{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sports team",
            "id": 1483
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "ice hockey",
            "id": 6483
         },
         {
            "name": "hockey game",
            "id": 41132
         },
         {
            "name": "winning",
            "id": 41401
         },
         {
            "name": "feel-good ending",
            "id": 156115
         },
         {
            "name": "the big game",
            "id": 191222
         }
      ],
      "imdb_id": "tt0104868",
      "video": false,
      "title": "The Mighty Ducks",
      "recommendations": [
         11164,
         10680,
         14709,
         11310,
         8873,
         11017,
         1498,
         12154,
         8494,
         10956,
         20726,
         13962,
         2616,
         1649,
         9536,
         8491,
         11528,
         8989,
         9622,
         11158
      ],
      "backdrop_path": "/jbREFnhxvVFCfgdMLkcI7Fb3Hz7.jpg",
      "revenue": 50752337,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gordon Bombay",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7cd",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hans",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7d1",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Coach Jack Reilly",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7d5",
               "name": "Lane Smith",
               "profile_path": "/js7GonfBVNHLYhaB0Xjtnm93DpH.jpg",
               "id": 65019,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Casey Conway",
               "gender": 1,
               "credit_id": "52fe436a9251416c7500f7d9",
               "name": "Heidi Kling",
               "profile_path": "/hvyWWe7M8ib9eUOnap76MgTU8CX.jpg",
               "id": 65038,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mr. Gerald Ducksworth",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7dd",
               "name": "Josef Sommer",
               "profile_path": "/3mR6yfeMhFS1UGsb7btjjLaiTu1.jpg",
               "id": 14792,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Charlie Conway",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f811",
               "name": "Joshua Jackson",
               "profile_path": "/e1btrP27otWpSRvgVV9PsOKCpJG.jpg",
               "id": 11866,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Greg Goldberg",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f815",
               "name": "Shaun Weiss",
               "profile_path": "/asBOiROZPLezU9YYjvp9qsaA0LK.jpg",
               "id": 147499,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Fulton Reed",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f81d",
               "name": "Elden Henson",
               "profile_path": "/nX2c32A2ppiw5IC86zUM4JTLpoz.jpg",
               "id": 20220,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Tommy Duncan",
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f821",
               "name": "Danny Tamberelli",
               "profile_path": "/k7xbvyCF3L707HoNYik7tfjVOjC.jpg",
               "id": 277101,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Connie Moreau",
               "gender": 1,
               "credit_id": "5352e537c3a3681d87002f9a",
               "name": "Marguerite Moreau",
               "profile_path": "/xY2WQSI85ttGyGhjFx8fzWKpzTr.jpg",
               "id": 22223,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Philip Banks",
               "gender": 2,
               "credit_id": "579b6ef5c3a36811610031a3",
               "name": "Hal Fort Atkinson",
               "profile_path": "/d3ACRRdnNesTmp3yYCFWzLpWdZX.jpg",
               "id": 1658382,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Terry Hall",
               "gender": 2,
               "credit_id": "58ea92a1c3a36872ee07ee84",
               "name": "Jussie Smollett",
               "profile_path": "/mENsciBE6E5ZsqhJROfLCpIT4re.jpg",
               "id": 181081,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Additional Dialogue Replacement (voice)",
               "gender": 0,
               "credit_id": "5aaf5416c3a3682f3401e5e4",
               "name": "Mickie McGowan",
               "profile_path": "/k7TjJBfINsg8vLQxJwos6XObAD6.jpg",
               "id": 84493,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7e3",
               "name": "Stephen Herek",
               "profile_path": "/wFMntUA59jIeLITlk5pYp2boZzB.jpg",
               "id": 18356,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7e9",
               "name": "Steven Brill",
               "profile_path": "/9CpoLVxDKV2XRF3rigTNSVimJK1.jpg",
               "id": 32593,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7ef",
               "name": "Jon Avnet",
               "profile_path": "/ckcE5lD7KNCh6iYHwCbfbs4r2y2.jpg",
               "id": 18250,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7f5",
               "name": "Jordan Kerner",
               "profile_path": null,
               "id": 58408,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f7fb",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f801",
               "name": "Thomas Del Ruth",
               "profile_path": null,
               "id": 3031,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f807",
               "name": "Larry Bock",
               "profile_path": null,
               "id": 16567,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe436a9251416c7500f80d",
               "name": "John F. Link",
               "profile_path": null,
               "id": 1099,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.855406,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10414,
      "vote_count": 252,
      "budget": 10000000,
      "overview": "After reckless young lawyer Gordon Bombay gets arrested for drunk driving, he must coach a kids hockey team for his community service. Gordon has experience on the ice, but isn't eager to return to hockey, a point hit home by his tense dealings with his own former coach, Jack Reilly. The reluctant Gordon eventually grows to appreciate his team, which includes promising young Charlie Conway, and leads them to take on Reilly's tough players.",
      "similar": [
         4942,
         13680,
         10637,
         10393,
         9655,
         9291,
         2300,
         86130,
         287,
         11287,
         22881,
         8923,
         13416,
         323677,
         14635,
         17108,
         10474,
         5693,
         21972,
         26602
      ],
      "original_title": "The Mighty Ducks",
      "runtime": 101,
      "poster_path": "/4qXfjDlDEGuN3xRNawh4WZo5o96.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1992-10-01",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/8C8f3UkMgNofmipZ4b42UqdnUYb.jpg",
         "name": "The Mighty Ducks Collection",
         "id": 10709,
         "poster_path": "/aUM5CXRiOu0YgrRZtDZSp997zgr.jpg"
      },
      "tagline": "They can't skate. They can't win. They can't be serious.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Herek"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Steven Brill"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104868/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMzgxOTQwMV5BMl5BanBnXkFtZTcwMzkzNDYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Emilio Estevez, Joss Ackland, Lane Smith | See full cast and crew »"],
      "reviews": [
         "I remember my cousins and I used to always watch these movies when I was a kid. I loved how these bad-playing, poor attitude-having kids could always be inspired to become champions, no matter how tough the odds and no matter how many times movies like this were remade with soccer, football, baseball, and dogs. Even though I've seen it a million times, I still get chills when the team works as a team and goes out to try their hardest. It's enough to make me, one of the least sporty people alive, want to join a sporting team. Another highlight, for me at least, were the guys. I always had at least one guy in the movie who I had a crush on and kept my undivided attention on. Who would've known back then that young Charlie (Joshua Jackson) would grow up to use big words and pretentious speeches on Dawson's Creek? Out of all those inspirational sports-are-good-for-kids movies, this was and always will be my favorite because it is the first one I can remember and the first I've ever seen. 1...2...3...Quack! Quack! Quack! Quack!",
         "C'mon, now, you know you can't resist those cute little kids with hockey sticks! And no one can resist the charms of Emilio Estevez! Put them together, and, damn, have you got one super cool movie! I mean, really, if a senior in high school still finds this flick cool, I'm pretty sure it'll work for anyone! :)",
         "The Mighty Ducks (aka as the Champions), is one of the great Disney movies I have seen. Not your typical fairytale, but a rugged kids adventure, which also goes into that winning is not everything, but that being in a team and playing as a team is the most important part of any sport and is good measure for a person's life. Aggressive trial lawyer Gordon Bombay has never lost a case. But when he's sentenced to a community service assignment, he must coach a ragtag team of peewee hockey players who can't skate, can't score and can't win. First he teaches the hapless team everything about winning and they teach him that winning is not everything. Watch the pucks fly as they battle their way to the most important game of their lives! This film is a great story for young up and coming sports \u0091people' to watch and learn that winning is not the be all and end all of sport. Sure there are some people such as Coach Reilly, because they are not true sports lovers. Instead they treat sport as a serious event, not something that as Gordon Bombay says should be \u0091fun'. In Australia, and my part of this country, we have Aussie Rules football, which again is a very team orientated sport. Although it can have some extraordinary individuals that play, the theme is still the same, that a team has to stick together and try as hard as it can. This movie has a very young and funny cast, with some old heads thrown in for good team balance. The obvious star is Emilio Estevez, who stars as Gordon Bombay. While he is a very aggressive character in the beginning, Gordon brings his knowledge and experience to a group of young kids that would make any sports coach proud. Estevez has had a good movie career, with some of his more well known movies being The Breakfast Club, St. Elmo's Fire, and an unaccredited role in Mission Impossible . The other main star is a very young Joshua Jackson who portrayed Charlie Conway, a good ice-hockey player, who reminds his coach a lot of himself as a young peewee hockey player. Jackson has made a name for himself in Hollywood starring in films such as Cruel Intentions, the disappointing Skulls and the popular TV drama, `Dawson's Creek'. Other cast members also include the rival coach of the Hawks Ice-Hockey team, Coach Reilly played by veteran actor Lane Smith. He also starred in another great film I saw recently, which happened to be on another popular sport, that of golf, the film being `The Legend of Bagger Vance'. All the characters that are on the Mighty ducks team are likeable people. The team consists of a fat kid, a silent kid, a nice kid, a wiseacre kid, a figure-skating princess, and a tough kid. The whole formula works for me anyway. I thought that this film had some impressive Ice-Hockey scenes that looked real, though I will never know if they are real or not. Ice-Hockey is a demanding sport and this movie shows that this is the case, with heavy bumps and unrelenting pressure on players. It was good to see that this sport has both males and females playing together, again the movie shows how well the two can gel. So, if you think that sport is not your thing, but want to give it a go, perhaps this film is what you need to watch. Although this isn't the most talented group of athletes to take the ice, and in the beginning the Ducks do really \u0091suck', they prove that with some good coaching guidance and team camaraderie, anything is possible if you put your mind to it. QUACK QUACK QUACK \u0096 Go the Ducks! Rating: 8/10 or 4 Stars",
         "Directed by Stephen Herek [BILL AND TED'S EXCELLENT ADVENTURE], THE MIGHTY DUCKS was a surprise box office hit in 1992 and was followed by two better sequels and a decent animated series. Although not the best in the trilogy, THE MIGHTY DUCKS is still one of the all-time classics of 1992. Emilio Estevez, in what is his best role to date, plays Gordon Bombay, the coach of The Ducks in this family sports comedy. Estevez, arguably one of the coolest actors of the 1980s and 1990s, is the glue that holds the movie together. Without him, it would be little more than any other cliched sports flick. Thanks to Estevez, the movie is better than expected and worth watching. **1/2",
         "I don't think The Mighty Ducks is a masterpiece in any shape or form, but it is an enjoyable film. I do agree that it is predictable, the plot is nothing particularly special and the ending especially doesn't really hold any surprises. But it is nicely filmed, with evergreen cinematography and pretty scenery and the music is pleasant. The script is good on the most part, there are some humorous parts but it is also somewhat touching, and the director Stephen Herek pitches the humour and melodrama at the right level. And the acting is spirited, with Emilio Estevez charming, dignified and fun as the disgraced lawyer who has to coach the worst ice hockey team and Joss Ackland solid as Hans. Also the ice-hockey scenes are done with just the right amount of flair. Overall, a sweet and fun movie, even with the predictable plot it is worth seeing. 8/10 Bethany Cox",
         "I thought that this was a good movie. It was a movie that you could sit down with the entire family, and still have a good time. It is a typical story line, and you pretty much know the end, but still, it is a fun journey from the beginning to the end of the film. This is a movie that everyone should see with their kids.",
         "One of the great kid movie-sports-films of all time, this movie always has a special place in my heart when it comes to losers turning into winners. Sure, some of the action proved to be a little sappy, but it was all in good fun. Emilio Estevez provided a rather believable performance as a snooty lawyer turned-peewee hockey coach. Virtually all of the characters were great in this film, even the annoying Goldberg. A good film to say the least, one that shouldn't have spawned sequels.",
         "I really like this movie out of the three Ducks movies because to me, this is the only one that feels like a genuine movie to me. A movie that was made from the heart. The reasons for it? There are two of them that stick out to me. Gordon Bombay goes through one hell of a transformation. He goes from a drunk lawyer to reconnecting with his old love and facing a demon that has haunted him up to now. Even the introduction scene carries an ominous feeling. The goalie facing the young Bombay looks more like a menacing monster; as well as it should be since it represents a horrible memory for the man. I remember being scared of that scene as a child, just cause the goalie looked so scary. His character's transformation over the movie is the heart of this film. It's a protagonist who has a REAL arc - beginning, middle, and end. It's all carried out with such poignancy as well. Emilio Estevez does great acting. The child actors do a good job. I mean, they're KIDS, and this is a kid movie...but they pull it off nicely. The kids who play Charlie, Fulton, Jesse, and Banks especially. They make you take their characters seriously, which is different from a normal kids movie. The kiddy parts don't make me cringe, but make me smile. I guess because it's not overdone. Sorry to say, but the other two movies to me relied too much on either hockey action or gimmicks (although I DID like D3's grittier hockey action and more serious story with Charlie). They didn't have the heartfelt story that this one did. It's all balanced out to entertain the little kids, but Gordon Bombay's arc is one for the adults. I also miss the kids that would end up not being in the future movies. In D3, when Gordon says that the Ducks were unchanged since the beginning, I cringed. I guess I'm the type to cling to sentimental values like that. This was the best movie out of the trilogy to me. That's because it felt like a REAL movie.",
         "Just recently, I saw D2 and D3, my friend unfortunately did not have the first Mighty Ducks movie, so I had to watch those first then rent this one. The second and the third were pretty good movies, but I felt bad, because it felt like you're getting into a group of friends, and you don't know their history, you weren't there? You know that feeling, and as silly as it sounds, that's how I felt watching the sequels without seeing the first one. Gordon is a lawyer who has had a little trouble with the lying in his career, therefore, he must do community service. When he sees a group of young pre-teen troubled youths playing a game of hockey, remembering his childhood love of hockey, he volunteers to become their coach in the Pee-Wee games. He starts off on a rocky relationship since he doesn't like kids, but he grows to love them and they do back learning that there is more to a game than just winning, but it'd be nice since they end up in the championships. I loved The Mighty Ducks, I felt like it was a terrific family film and I'm surprised it wasn't played in my childhood since I was seven years old when it came out, but you know the saying, better late then never, right? I would highly recommend this up lifting story for any family! 7/10",
         "One of the few truly great movies ever created, the others being Home Alone and the Back to the Future series. Some people like to put Citizen Kane on that list, but actually that movie is boring and should be avoided at all costs. Wall Street and the Wolf of Wall Street should be boring but they are not, they are just good movies, which is why this movie is great. Sure, that comparison made no sense, but I will continue this review regardless. The Mighty Ducks will surpass your expectation in linger in your memory banks even 10 years after watching the hockey hooligans learning to skate. And that my friend, is the mark of a great movie."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Avnet/Kerner Productions",
         "Touchwood Pacific Partners 1",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "Gordon Bombay, a hotshot lawyer, is haunted by memories of his childhood, when, as the star player in his champion hockey team, he lost the winning goal in a shootout, thereby losing the game, and the approval of his coach. After being charged for drunk driving, the court orders him to coach a peewee hockey team, the worst in the league, Gordon is at first very reluctant. However, he eventually gains the respect of the kids and teaches them how to win, gaining a sponsor on the way and giving the team the name of The Ducks. In the finals, they face Gordon's old team, coached by Gordon's old coach, giving Gordon a chance to face old ghosts.",
         "A self-centered lawyer is sentenced to community service coaching a rag tag youth hockey team."
      ],
      "budget": 10000000
   },
   "movielensId": 2082,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-10-01",
      "dvdReleaseDate": "2000-04-11",
      "directors": ["Stephen Herek"],
      "runtime": 101,
      "movieId": 2082,
      "title": "The Mighty Ducks",
      "mpaa": "PG",
      "actors": [
         "Emilio Estevez",
         "Joss Ackland",
         "Lane Smith",
         "Heidi Kling",
         "Josef Sommer",
         "Joshua Jackson",
         "Shaun Weiss",
         "Elden Henson",
         "Danny Tamberelli",
         "Marguerite Moreau",
         "Hal Fort Atkinson",
         "Jussie Smollett"
      ],
      "imdbMovieId": "0104868",
      "originalTitle": "The Mighty Ducks",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["PK0SizOkbF4"],
      "plotSummary": "After reckless young lawyer Gordon Bombay gets arrested for drunk driving, he must coach a kids hockey team for his community service. Gordon has experience on the ice, but isn't eager to return to hockey, a point hit home by his tense dealings with his own former coach, Jack Reilly. The reluctant Gordon eventually grows to appreciate his team, which includes promising young Charlie Conway, and leads them to take on Reilly's tough players.",
      "tmdbMovieId": 10414,
      "avgRating": 2.90232,
      "releaseYear": "1992",
      "numRatings": 5436,
      "posterPath": "/4qXfjDlDEGuN3xRNawh4WZo5o96.jpg"
   }
}