{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "juvenile crime",
            "id": 174240
         },
         {
            "name": "child empowerment",
            "id": 174243
         },
         {
            "name": "brawl",
            "id": 174244
         },
         {
            "name": "boy singer",
            "id": 174245
         },
         {
            "name": "name change",
            "id": 174252
         },
         {
            "name": "slingshot",
            "id": 174254
         },
         {
            "name": "juvenile detention",
            "id": 174258
         }
      ],
      "imdb_id": "tt0104990",
      "video": false,
      "title": "Newsies",
      "recommendations": [
         10419,
         14819,
         20639,
         41800,
         13962,
         13671,
         37108,
         10874,
         83489,
         40490,
         19378,
         25697,
         118430,
         15943,
         17745,
         11176,
         24736,
         14534,
         34857,
         16651
      ],
      "backdrop_path": "/uwu2a0pr41OqMxSRjAV71bnAZ3O.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack 'Cowboy' Kelly",
               "gender": 2,
               "credit_id": "52fe464b9251416c75073ccf",
               "name": "Christian Bale",
               "profile_path": "/2ocrTd8ChuUyJOzMuD4PsQw8eCB.jpg",
               "id": 3894,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bryan Denton",
               "gender": 2,
               "credit_id": "52fe464b9251416c75073cd3",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Medda Larkson",
               "gender": 1,
               "credit_id": "52fe464b9251416c75073cd7",
               "name": "Ann-Margret",
               "profile_path": "/jx5lTaJ5VXZHYB52gaOTAZ9STZk.jpg",
               "id": 13567,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joseph Pulitzer",
               "gender": 2,
               "credit_id": "52fe464b9251416c75073cdb",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "David Jacobs",
               "gender": 2,
               "credit_id": "52fe464b9251416c75073ce5",
               "name": "David Moscow",
               "profile_path": "/shlyKoI2kEAcgX0AE5qFEFSrLfv.jpg",
               "id": 62123,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Les Jacobs",
               "gender": 2,
               "credit_id": "52fe464b9251416c75073ce9",
               "name": "Luke Edwards",
               "profile_path": "/fAutv48tad09s8DHgUzrYuAZ33m.jpg",
               "id": 33052,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Racetrack Higgins",
               "gender": 2,
               "credit_id": "52fe464b9251416c75073ced",
               "name": "Max Casella",
               "profile_path": "/5CNTDSCBhWPclTLTyTBy8oHUkzb.jpg",
               "id": 7133,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Spot Conlon",
               "gender": 2,
               "credit_id": "52fe464c9251416c75073cf1",
               "name": "Gabriel Damon",
               "profile_path": null,
               "id": 44055,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Crutchy",
               "gender": 2,
               "credit_id": "52fe464c9251416c75073cf5",
               "name": "Marty Belafsky",
               "profile_path": "/4mXAx4zZYyV1j613NtrdCC8EYMY.jpg",
               "id": 60634,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Boots",
               "gender": 2,
               "credit_id": "52fe464c9251416c75073cf9",
               "name": "Arvie Lowe Jr.",
               "profile_path": null,
               "id": 154125,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mush",
               "gender": 2,
               "credit_id": "52fe464c9251416c75073cfd",
               "name": "Aaron Lohr",
               "profile_path": "/5Uvfm6uuZcMN1EqX3fWXbm0UJPL.jpg",
               "id": 148655,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Snitch",
               "gender": 0,
               "credit_id": "52fe464c9251416c75073d01",
               "name": "Dee Caspary",
               "profile_path": null,
               "id": 1133810,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe464b9251416c75073ce1",
            "name": "Kenny Ortega",
            "profile_path": "/cZrsOBr1tp1nNPJ5xj3uao2XQbJ.jpg",
            "id": 65310,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 5.311688,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15300,
      "vote_count": 83,
      "budget": 15000000,
      "overview": "A week in the life of the exploited, child newspaper sellers in turn-of-the-century New York. When their publisher, Joseph Pulitzer, tries to squeeze a little more profit out of their labours, they organize a strike, only to be confronted with the Pulitzer's hard-ball tactics.",
      "similar": [79129],
      "original_title": "Newsies",
      "runtime": 121,
      "poster_path": "/x71hXgtXbCIHsOK0VQkoIrBGjlt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Touchwood Pacific Partners 1",
            "id": 8830,
            "origin_country": ""
         }
      ],
      "release_date": "1992-04-10",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A Thousand Voices. A Single Dream.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kenny Ortega"],
      "runtime": 121,
      "synopsis": "The film takes place in New York City in the year 1899, focusing on a group of newsboys. Of this group, the focus is on Jack Kelley (Christian Bale),who one day dreams of heading out west to the wide-open spaces of Santa Fe. One day, Jack meets Les Jacobs (Luke Edwards) and David Jacobs (David Moscow), two brothers who've turned to selling newspapers to support their family, after their father was fired when a machine accident left him unable to work. Jack soon teaches Les and Jacobs some interesting lessons about how to sell papers (such as sensationalizing headlines). Shortly afterwards, the boys are challenged when the 'World' newspaper's owner, Joseph Pulitzer (Robert Duvall), raises their purchase rate by 1/10 of a cent. Though seemingly a drop in the bucket for Pulitzer (who hopes to use the added funds to keep competing with his closest competitor, William Randolph Hearst), the increase is a significant price gouge for the Newsies. With David supplying input and ideas, Jack becomes the leader of the group. The boys then go to other parts of New York to rally other newsboy groups, with Jack and David going to Brooklyn to recruit Spot Conlon (Gabriel Damon) and his group. Even with David's enthusiasm, Spot is still doubtul about joining them. At the same time, the boys catch the eye of Bryan Denton (Bill Pullman), a reporter for the 'New York Sun.' Denton soon becomes the boy's champion, making the 'Sun' the only newspaper in New York covering the newsboy strike. In one incident that gets Pulitzer's attention, the boys cause havoc at a newspaper distribution center, that calls the police to the scene. One of the newsboys, Crutchy (Marty Belafsky), is captured and taken to a place called 'The Refuge,' which is operated by Warden Snyder (Kevin Tighe). While told to be a place to rehabilitate young boys, it is actually a place where it's keepers take advantage of the system, pocketing extra money for every boy they bring in, as well as not allowing the boys to partake in more nourishing food. David is informed that Jack was once placed in there, and one day, Governor Theodore Roosevelt (David James Alexander) visited, and Jack rode out of the refuge with him in the Governor's carriage. While a number of newsboys believe this, David is quick to question if it happened. Shortly afterward, Jack and the newsboys lead another charge on the distribution center, only to find armed thugs waiting to greet them. The boys appear outnumbered, until Spot Conlon and his gang from Brooklyn arrive, fighting the thugs back, and seizing the day. Bryan Denton is on hand, and his article and a picture of the boys brings them front-page glory on the cover of 'The New York Sun.' Filled with enthusiasm, the boys decide to hold a newsboy rally, inviting all the newsies in New York. The publicity does not go unnoticed by Warden Snyder, who recognizes Jack in the newspaper photo, and after meeting with Joseph Pulitzer, gets permission to arrest Jack, along with a group of thugs. At the newsboy rally, Snyder shows up with cops and thugs, and a large riot breaks out, at which Jack is apprehended. The newsboys are also brought before the judge, being fined either $5, or 1 week's stay in the 'House of Refuge.' Bryan Denton pays the boy's fees. Jack on the other hand, is given a harsher sentence. It is here that Snyder 'represents' Jack before the judge, revealing Jack's real name to be Patrick Sullivan. Snyder convinces the judge to allow Jack to stay in the care of the 'Refuge' until he's 21. Afterwards, Denton and the newsboys meet at a cafe, where Denton explains that due to a 'print ban' on the strike material, no mention of the riot was published. It is then that Denton drops the big news: The 'New York Sun' has reassigned him to become a war correspondent, and are sending him away from New York. Denton apologizes to David, and gives him the news story that he had written about the riot. With Jack gone, David takes command, and vows to get Jack out of the 'Refuge.' David and several other newsboys sneak over to the 'Refuge,' only to see Jack being taken out in a horse-drawn carriage, with Snyder close by. They follow it to the mansion of Joseph Pulitzer. Inside, Jack meets up with Pulitzer, who promises that he can free Jack from his sentence in the 'Refuge,' and offers to pay him to work for him again. Jack balks at this, but grows worried when Pulitzer mentions that he has the power to lock the other newsboys in the 'Refuge,' including David and Les. Upon leaving Pulitzer's house, David appears, and encourages Jack to run. The two get a ways away, before Jack reprimands David for trying to help him. Jack demands David leave, with David unaware of what Jack heard from Pulitzer. The next day, the newsboys protest outside the distribution center, but are shocked when Jack emerges dressed in good clothes and a stack of papers under his arm. David angrily reprimands Jack for what he's doing, with Jack saying he only cares about doing this to earn enough money to finally leave for Santa Fe. One day, David, Les and their sister Sarah (Ele Keats) are assaulted by some thugs from the newspaper distribution center. Jack rushes in to protect his friends, and ends up sending the thugs running, promising to report the incident to their employer. Incensed, Jack, David, Les and Sarah go to visit Bryan Denton. Denton further explains that there's more to the newsies strike than they think. Much of the city thrives on child labor, and word is some people are scared that the strike could spread to other parts of city-wide business. After sometime, the group manages to persuade Denton to join them and distribute their own paper, which will print the riot story that was suppressed by 'The Sun.' Jack manages to sneak the group into the distribution center where they find an old printing press in the basement. Working diligently, they print out their own paper, and get the other newsboys to distribute the papers all over town. An article is even written in regards to the treatment of the boys in 'the refuge.' Denton delivers this news personally to Governor Roosevelt. Jack, now back in league with the Newsies, is surprised when their paper sparks an enormous crowd to gather in front of Pulitzer's office. Jack and David are then brought to appear before him. Pulitzer chastises Jack for continuing on with such a foolish venture, while David chastises Pulitzer in turn: everyday that the strike continues, distribution stays down and millions of dollars are spent, all over the 1/10 of a cent increase. Pulitzer ignores this reasoning and calls for the police to enter the room. Incensed at Pulitzer's attitude, Jack flings open the windows, and the cries of the people down below reach his ears, with Jack mentioning that 'people have voices, and they need to be heard.' Pulitzer is further upset when he finds out the strike-related material was printed on a press that he owned. Shortly afterward, Jack and David emerge, with the news that the 1/10 of a cent increase is repealed. As they cheer, Warden Snyder can be seen with a wagon approaching. Jack is prepared to run, when Bryan Denton appears, telling him he doesn't have to anymore. Before their eyes, the wagon's rear door opens, and a number of newsboys who were in the 'Refuge' (including Crutchy) are released. Snyder is then herded into the wagon, and taken away. Denton and Crutchy explain how the paper that was written sent Governor Roosevelt to the 'Refuge,' which caused the release of the newsboys. Denton says that the Governor is willing to give him a ride, and Jack decides to take Roosevelt up on his word, and go to the train yards, to head off to Santa Fe. After the crowds disperse, the newsboys return to business, with David taking Jack's lead. However, they are further surprised when Roosevelt's carriage returns with Jack, who has decided to stay in New York with his friends. A raucous welcome is had by all, and David greets his friend who has returned to them, as they head off into the future along with the other newsboys.",
      "writers": [
         "Bob Tzudiker",
         "Noni White"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104990/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0MDAwNDk4MF5BMl5BanBnXkFtZTYwMTcwNDg4._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Christian Bale, Bill Pullman, Robert Duvall | See full cast and crew »"],
      "reviews": [
         "Waaaaaaaaaaaay back in the early 1990's, when Jeffrey Katzenberg was still a top exec at Disney, he had one of his less successful ideas -- to bring back the break-into-song musical. So, as the story goes, he selected three scripts that were about to go into production and gave them to Disney Music Maestro Alan Menken and asked him which of the scripts could be turned into a musical. And that's how NEWSIES was born. It's a great story, too, being a fictionalized account of the newsboy strike in New York at the turn of the century. It follows the exploits of a ragtag band of teenage boys, including Cowboy (Christian Bale), who dreams of becoming a ranch hand in Santa Fe, and David & Les (David Moscow & Luke Edwards), brothers who take up selling newspapers when their father is injured on the job. Conflict arises when Joseph Pulitzer (Robert Duval) gets greedy and raises the price of his newspapers to the newsboys, but not to the public. The outraged \"newsies\" decide to go on strike, which eventually galvanizes all the working children in the city to stand up for themselves. It's a fun film, with Duval playing his villain to the hilt, but Ann-Margret is wasted in her role as a showgirl (both of her musical numbers are badly edited down to just snippets of song). Bale is the real wonder here, though, singing and dancing with surprising aplomb. The songs overall are quite good, but a couple of them are hard to distinguish from each other. My favorites are the opening number, \"Carrying the Banner,\" and the rousing \"The World Will Know.\" It seems odd, though, that Duval doesn't get a musical number of his own, considering in Disney's animated musicals the villains usually get the best songs (\"Poor Unfortunate Souls\" or \"Be Prepared\" anyone?). It's a shame that the film didn't do better financially, since as a result of its dismal box office Disney declined to ever make another like it. First time director Kenny Ortega, who also choreographed (he was known for his choreography of DIRTY DANCING), directed one more feature after this, the underrated Bette Midler flick HOCUS POCUS; since that film also failed to find an audience, he hasn't directed a movie since. And that's a shame; he has a very distinctive kinetic style that served both films well. Seek out a copy of NEWSIES, and go for the widescreen version. You won't be disappointed!",
         "When I first watched this movie, I was just 3 years old.. My mom tells me that my little brother and I used to dance and jump off couches and try to spin around on the ceiling fan, and sing, when we watched this movie... Recently, it was being mentioned to me for suggestions for our school chorus.. I began to look things up about the movie, and all of a sudden, had an urge to go out and buy it the next day. I've had the movie for a week, and have already watched it 6 times. Around 12 or 13 years later, the movie still has me wanting to dance and sing along... This is a movie that never gets old, no matter what your age.",
         "\"Newsies\" is one of the few Disney films that can be classified as 'great'. What makes it even more amazing is the fact that, although it's a Disney movie and based on actual events, it actually stays very close to what actually happened. (Who would've thought?) The movie has a very good script, great acting, and music that make even the biggest musical-hater tapping his/her feet. Add into this mix show-stopping choreography, humor, and some of the best actors and actresses you can find anywhere, and you will see why this movie has generated more fans than any other movie in history.",
         "This is a fantastic movie for people of all ages. It has historical information presented in a fun, and exciting way that keeps viewers entertained throughout. It is a brilliant musical filled with catchy tunes by Academy Award Winner Alan Menken, that wrote songs for The Little Mermaid and Beauty and the Beast, that keep you humming and singing even after the movie is over. Great dialogue between characters and fantastic dance sequences. The Newsies is filled with a incredibly talented cast, including Christian Bale, Robert Duvall, Gabriel Damon, Max Casella, Aaron Lohr, Ann-Margaret, David Moscow, and much more. Overall, a very entertaining movie, highly recommended for everyone!!!",
         "I'm 19 years old in college. I sing the music from this movie on my way to class. And people stop me and say \"that's from 'Newsies!' I love that movie!\" How many times do you get that kind of response? This movie was exciting, well-choreographed, and funny. It has the best ingredients a musical could have. The best part...you can find this stuff in the history books (well, maybe not dancing newsboys and Robert Duvall playing Joseph Pulitzer...but nobody's perfect...except Christian Bale). See it, love it, brings the kids. They'll want to carry the banner after the movie's long over.",
         "apart from being a wonderful musical (which i've grown up watching so i can tell a good from a bad) it also has a wonderful story-line. the plot is so well thought of, it isn't every day when they make a musical about a strike that happened in 1899. i fell in love with this movie the first time i watched it. it's classical, and when you see it, you can't help but liking it. the dancing, acting, and singing is great. i don't know many teenagers who can dance and sing like that! evenn thought this movie was made 10 years ago and i don't remember it, it's starting to come back. my mom's friend called one day saying that her daughter loves this movie called newsies, and i said that i love it! i thought nobody knew about it, but i was wrong. how could you forget a great movie like this? if you haven't seen it, i gaurentee you 100% that you will probably end up liking it as much as i do.",
         "In 1992, Hollywood has all but lost the fine art of movie-musicals, then along came this film & PRESTO, Disney breathed NEW LIFE into the forgotten art. NEWSIES entertains on ALL levels. The songs are singable and catchy, the dancing is lively, the charactors are lovable, and the story is PURELY INSPIRATIONAL!!! This movie works so well on the screen, and could VERY EASILY work as a Broadway Stage Production, that's the feeling it carries. This movie is So MUCH FUN, and I don't feel ashamed for announcing that. This is a movie that you could STAND UP and CHEER about! Christian Bale delivers a powerful performance in acting, singing, AND dancing, and the rest of the boys are equally as talanted. Headlines don't sell papes, NEWSIES sell papes, and they SOLD ME on this film. NEWSIES DELIVERS!!!!",
         "It is so hard to find something that the whole family can watch but this one of the few. Christian Bale does it again bringing laughter and tears to his portrayal of Jack Kelly. Jack is a Newsie(a young boy who sells newspapers) that helps lead a stike against the newspaper owners of NYC in the late 1800's. With the help of his friends, Jack overcomes and wins his rights as a working boy of NYC. Along the way he wins the heart of the girl he loves,confronts his past, and sings and dances his way into the hearts of everyone how watches this film. The music and dance routines are fun and energetic,making everyone want to join in the fun. Includes apreances by:Bill Pulman and Ann-Margret. Music by: Alan Menkin",
         "I loved this film! We had used a dance number from it for a musical I was in and we watched the film at out cast party. I had heard my friends talk about this film before but had never watched it. I love the story and everything about this film! The songs are so catchy, my personal favourites are Carrying The Banner, King of New York, and Seize the Day. My favourite characters are Mush, Jack, Les, Crutchy and David. I would recommend this film to anyone who likes musicals and good songs. Alan Menkin wrote most of the music and he was the one who wrote the music for The Little Mermaid so you know it has to be good! After watching this movie for the first time, I asked for it as a Christmas present. I also bought the soundtrack so that I could listen to the songs wherever I went. I love this musical and it will always be in my top 10 movies list. I don't see how anyone could not like this movie. I've never met anyone who hasn't liked it yet. Kind of like the same thing with the Princess Bride. I don't a single person who doesn't like this movie! I give it 10 stars!!!",
         "Anyone can make a difference, if they believe in the cause \u0085 even the \"Newsies.\" You've probably never heard of them, but in the cities, \"Newsies are what sell the news.\" With their \"expansion of the truth\" these guys can sell anything. They may seem energetic and jolly, but their lives are a little different. Residents of the slums of New York, they strive just to fill their plates each day. While living in shelters, these orphans live their lives by their own rules. With no one but their newspaper distributor caring for them, they have formed their own family. But on their terms it's not all that bad. Living life with no rules \u0085 every kid's dream. But their futures are what may worry some. This musical has everything from villains to the group hero. This typical Walt Disney Production is everything you image it would be: The same old story, an average \"slum\" like group and their attempt to change old ways of life. The \"Newsies\" are the rebels against the \"Big-Guys\" of the New York News Industry. Every rebel group has its leader, like the great, Susan B. Anthony, with her fight for women's rights. For the \"Newsies\" the handsome flirt, Jack Kelly was their Susan B. Anthony. This story isn't just on the fight for rights, it's like life...with love, laughter, and everyday problems. Also just like in life people lie, Jack Kelly lied of his future in the West. The reason for this was Realpolitik (there is no right or wrong when it comes to doing for your group/ country.) He wanted to be a strong leader for the others, but when it came down to possibly having a future Kelly, rethought his determination. In the end he got back on track and had more determination than ever before. Ladies, if you would like to see young, handsome men dancing in \"tight\" newspaper guy costumes, then this is just the musical for you. But, for a 1992 production this musical has some \"off the wall music\", and the guys sure know how to \"drop it like its hot\", if you know what I mean. City slums, orphans forming their own family, a fight for change, young love and new friendships, you'll see what it would be like if you went into the real world a \"little bit\" early. You're never alone in the city of New York \u0085 Not even Jack Kelly! As a leader of the pack, he was never really alone. He always had his followers with him."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Touchwood Pacific Partners 1",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "July, 1899: When Joseph Pulitzer and William Randolph Hearst raise the distribution price one-tenth of a cent per paper, ten cents per hundred, the newsboys, poor enough already, are outraged. Inspired by the strike put on by the trolley workers, Jack \"Cowboy\" Kelly (Christian Bale) organizes a newsboys' strike. With David Jacobs (David Moscow) as the brains of the new union, and Jack as the voice, the weak and oppressed found the strength to band together and challenge the powerful.",
         "A week in the life of the exploited, child newspaper sellers in turn-of-the-century New York. When their publisher, Joseph Pulitzer, tries to squeeze a little more profit out of their labours, they organize a strike, only to be confronted with Pulitzer's hard-ball tactics.",
         "In 1899, New York City got its news from an army of ragged orphans and runaways, called newsies. They sold the newspapers of Joseph Pulitzer, William Randolph Hearst, and other great publishers. Like many of his friends, newsie Jack Kelly (Christian Bale) dreams of a better life far from the hardship of the streets. But when Pulitzer and Hearst raise distribution prices at the newsies' expense, Jack finds a cause to fight for, and must decide between his dreams and his newfound responsibility.",
         "A musical based on the New York City newsboy strike of 1899. When young newspaper sellers are exploited beyond reason by their bosses they set out to enact change and are met by the ruthlessness of big business."
      ],
      "budget": 15000000
   },
   "movielensId": 2084,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-04-10",
      "dvdReleaseDate": "2002-01-15",
      "directors": ["Kenny Ortega"],
      "runtime": 121,
      "movieId": 2084,
      "title": "Newsies",
      "mpaa": "PG",
      "actors": [
         "Christian Bale",
         "Bill Pullman",
         "Ann-Margret",
         "Robert Duvall",
         "David Moscow",
         "Luke Edwards",
         "Max Casella",
         "Gabriel Damon",
         "Marty Belafsky",
         "Arvie Lowe Jr.",
         "Aaron Lohr",
         "Dee Caspary"
      ],
      "imdbMovieId": "0104990",
      "originalTitle": "Newsies",
      "genres": [
         "Drama",
         "Music",
         "Family"
      ],
      "youtubeTrailerIds": ["lqPuGMgT6yw"],
      "plotSummary": "A week in the life of the exploited, child newspaper sellers in turn-of-the-century New York. When their publisher, Joseph Pulitzer, tries to squeeze a little more profit out of their labours, they organize a strike, only to be confronted with the Pulitzer's hard-ball tactics.",
      "tmdbMovieId": 15300,
      "avgRating": 3.19035,
      "releaseYear": "1992",
      "numRatings": 1119,
      "posterPath": "/x71hXgtXbCIHsOK0VQkoIrBGjlt.jpg"
   }
}