{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "black white relations",
            "id": 11504
         },
         {
            "name": "alternative universe",
            "id": 208507
         }
      ],
      "imdb_id": "tt0114928",
      "video": false,
      "title": "White Man's Burden",
      "recommendations": [
         308636,
         70515,
         25674,
         19380,
         25758,
         71376,
         83714,
         46251,
         50043,
         25391,
         48864,
         2319,
         31605,
         33345,
         56087,
         2166,
         18316,
         57047,
         61168,
         41589
      ],
      "backdrop_path": "/eOGXrCGjz4kWUD640ps6mPiYLzB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Louis Pinnock",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f7d",
               "name": "John Travolta",
               "profile_path": "/6CKR08ipxM8d2xOB26ja7OlXx7H.jpg",
               "id": 8891,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Thaddeus Thomas",
               "gender": 2,
               "credit_id": "52fe448f9251416c91014f81",
               "name": "Harry Belafonte",
               "profile_path": "/fSSsExSbBbkr6ZV5uwTMZqZyDwh.jpg",
               "id": 33162,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Marsha Pinnock",
               "gender": 1,
               "credit_id": "52fe448f9251416c91014f85",
               "name": "Kelly Lynch",
               "profile_path": "/2ZbV0mppAxxyh4mIG4HKTHfLkDM.jpg",
               "id": 6473,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Megan Thomas",
               "gender": 1,
               "credit_id": "5460e49a0e0a26649e00074f",
               "name": "Margaret Avery",
               "profile_path": "/heWNDxiHXDRg71UJgfsvpGubN1r.jpg",
               "id": 13307,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Stanley",
               "gender": 2,
               "credit_id": "5460e4a7c3a3680b5d0032c4",
               "name": "Tom Bower",
               "profile_path": "/jINoIyKUhX01jflM68nZaJZlWMW.jpg",
               "id": 19453,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe448f9251416c91014f8b",
               "name": "Desmond Nakano",
               "profile_path": null,
               "id": 73494,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe448f9251416c91014f91",
               "name": "Desmond Nakano",
               "profile_path": null,
               "id": 73494,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.948668,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 31611,
      "vote_count": 28,
      "budget": 8000000,
      "overview": "The story takes place in alternative America where the blacks are members of social elite, and whites are inhabitants of inner city ghettos. Louis Pinnock is a white worker in a chocolate factory, loving husband and father of two children. While delivering a package for black CEO Thaddeus Thomas, he is mistaken for a voyeur and, as a result, loses his job, gets beaten by black cops and his family gets evicted from their home. Desperate Pinnock takes a gun and kidnaps Thomas, demanding justice.",
      "similar": [
         605,
         604,
         19,
         78,
         17431,
         157336,
         281,
         603,
         2048,
         335984,
         9323,
         534,
         296,
         12244,
         262543,
         131631,
         76341,
         157350,
         87101,
         198663
      ],
      "original_title": "White Man's Burden",
      "runtime": 89,
      "poster_path": "/aaFpmILNyNSReVgzKGFu8iKNYzi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "A BandApart",
            "id": 6911,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
            "name": "HBO",
            "id": 3268,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-12-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "Reality Just Switched Sides",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Desmond Nakano"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Desmond Nakano"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114928/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2ODY1ODcwMl5BMl5BanBnXkFtZTcwNzYzNzUxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: John Travolta, Harry Belafonte, Kelly Lynch | See full cast and crew »"],
      "reviews": [
         "In reading through these comments, I've seen tons of people complain about how this movie is thoughtless, the characters are one-dimensional stereotypes, blah blah blah. People, that was exactly the point...to challenge White and Black Americans' perspectives on those very stereotypes! Before you pick a film apart, you have to ask yourself what audience it was directed at. Would you criticize a Disney film for being too childish if it was supposed to be directed at children? Of course not. Therefore, ask yourself what audience White Man's Burden was targeted at. Because of where I grew up, that answer was obvious to me before I even saw the movie. I'm a White man who grew up in Monterey, California. Central Monterey is middle-to-upper class and is dominantly White and Asian. The southside communities of Pacific Grove, Carmel, and Pebble Beach are very upper class and dominantly White. In the north we have Seaside, which is the lower-income, high-crime area and is dominantly Black and Hispanic. This seems to be pretty typical of the race/class division that plagues America. Note that Monterey is not exactly a major metropolitan area where these neighborhoods are far away from each other. The entire area has a population of maybe 120,000 and stretches only about 12 miles (19 km) from north to south. By growing up between the downtown area and Seaside, it's been easy for me to see the racial problems in this country from many angles. I can tell you from experience that the most hot-headed, controversial, and hateful examples of racial bigotry and stereotyping in the USA are in the way so many Whites and Blacks view each other. I have met countless Blacks who think that being born White automatically makes you greedy, naturally oppressive of the poor, and have a genetically-inbred desire to dump on every other race in the world. These Blacks typically think that everyone with white skin owes them something because of the crimes of our ancestors (slavery, lynching, etc.), whether it be walking around giving an apology to every Black we see, expecting a free ride from the government just because they're born with black skin, or just having us generally take whatever they want to dish out and accepting that we \"deserve it\" because we were born into an \"evil race\". On the other side of this coin are the Whites who think that being born Black makes you stupid, lazy, and a natural-born criminal. These Whites can cite the fact that there is a high amount of violent crime committed by Blacks despite making up only 12% of the US population (not thinking about the fact that this is a result of poverty, not skin color), or the high amount of hard drug use in Black society (again, depression due to poverty, not skin color). White Man's Burden was very obviously aimed at these two particular groups of people. What they both have in common is the belief that certain behavior is naturally part of being born with a particular skin color. By depicting an alternate history with the roles of Blacks and Whites reversed in America, the film shows that lack of knowledge and a tendency towards crime is inspired by growing up in poverty, not by being born with black skin. It also portrayed selfishness, greed, and elitism to be qualities of those who grew up in luxury and wealth rather than being tied to white skin. The point of the film was not to go into painstaking detail about how the roles came to be reversed, where the other races are, or to explore the alternate-reality society on every single level, which would require a mini-series rather than a 90-minute film. The point was to shake up the narrow-minded perspectives of two particularly bigoted groups of Americans, to kick them in the butt and make them consider that skin color isn't a factor in who you are. Whatever else you want to say about the movie's performances or characterizations, it did its' job perfectly.",
         "I think the ending was sad. I felt sorry for Travolta, even his son. But I disagree with the comment about \"whats the point\" because it shows what I go through weekly. I mean, some of it is extreme, but true. And when Belafonte remarked, \"well, most of them don't have father's\" in response to his wife's comment about the white kids discipline, it was... I'm at a lost for words. I'm watching it again tonight, and I think every white man needs to see the movie, and every black man. It was a trip seeing the roles flipped. But the movie is truly, \"a trip\". I mean, when Belafonte talks about the \"socially crippled, genetically inferior\" whites, its a trip, just hearing that. I study psychology, and all these theories are pervasive, and they relate to science by the genetic concepts of the 20th century, i mean, eugenics and it is really wild. Anyway, this is a must see movie. You must see it. I'm mad I didn't know it existed for the last ten years.",
         "Alternative history is certainly one of the more compelling aspects of speculative fiction . Anyone who has seen the DOCTOR WHO story Inferno would be hard pressed to forget it , Robert Harris's Fatherland is a unforgettable novel and whilst I have no wish to read any of his books Harry Turtledove is a very popular author . In short premises featuring alternative planet Earths' and their different histories are thought provoking to say the least and when it was announced that John Travolta ( Let's not forget how massive a star he was then after PULP FICTION ) was going to be starring in an alternative future film where the roles of black and white are reversed the studio execs would have quite rightly tapped themselves on their shoulders knowing they were making a massive hit Strangely I'd forgotten all about this movie until it was broadcast on BBC1 a couple of nights ago and it's not difficult to understand why it's an obscure flop . The film starts with a black family gathered at the dinner table where patriarch and businessman Thaddues Thomas states his dislike for white people and their problems . Cut to Louis Pinnock who who works for Thomas company and lives in a rough area where his neighbours all seem to be pecker woods . Later due to a series of contrived , not very well written circumstances Pinnock loses his job with the company and decides to kidnap Thomas The problem with WHITE MANS BURDEN is that this is an alternative world where Black Americans are at the apex of social hierarchy while whites are at the bottom bu this scenario is never ever explored . In fact the only things were shown that things are so mightily different is when someone is flipping the TV channel that show amongst other things a western where all the calvarymen are black . I know this was made in 1995 but is director Desmond Nakano saying there's no white equivalent of Morgan Freeman , Condaleeza Rice or Colin Powell ? For goodness sake we're even shown a black golfer on TV . Is this version of America without a white golfing prodigy called Alpine Woods ? So that's the main problem and an unforgivable one where we're told that everything is different but as the plot rolls along we find ourselves asking what is actually different ? The audience are shown a couple of black cops being confronted by an angry white mob ( This doesn't happen in \" our \" America ? ) , a white man with a black companion are threatened by pecker woods ( This doesn't happen in \" our \" America ? ) etc , etc . At no point is the premise used to explore how anything would be different in \" our \" America . If you made a film set in \" our \" America where a disgruntled white employee kidnaps his racist black boss then you would not have to alter one single word never a single scene from this screenplay . And disgruntled employees kidnapping nasty employer type redemption plots we never all that compelling in the first place",
         "It is JUST a movie!!! geez... you all are giving this movie too much power. It is meant to ENTERTAIN. The movie's soul purpose was to illustrate many popular stereotypes. Any mature audience would recognize that it was only meant to do this and NOT to properly represent either role for the sake of being politically correct. However, it is apparent that many of you find it offensive or brutal because you feel that \"your race\" was being misrepresented. Speaking as an African American female, I understood that this movie was ONLY meant to open my eyes to society's view of race roles of blacks and whites in America. Sure black people dont walk around with duck-tape on their jackets (as in the scene with the thugs at the restaurant) and little black girls do not have easy access to a revolver that they are permitted to use in the case of an emergency (as in the scene where Belafonte's character hid in a white person's home for safety) and LORD KNOWS a white man will NEVER bring a black girl home to meet his family. *haha* --kiddin'. (\"disturbing\" comment, huh?) Well anyways, I think the movie was good for rousing up these feelings of disturbance, however it lost me when the whole kidnapping took place. It became the focal point of the movie and confused many of its viewers. Other than that, the movie was ok. I give it a 8 on a scale from 1 to 10, only because I have never seen such a bold attempt to deal with race roles as this one. Therefore, I enjoyed the movie.",
         "I didnt know anything about the movie when it was sent on Danish television, and to begin with I found it quite surprising; it made me think a lot. -A great way of describing the social problems in the USA. The only problem with the movie was that it lasted for more than half an hour; after that it was just a cliche of a movie..very predictable. Its obvious that the movie was produced basically because of the good concept. Then suddenly they had to write a script too, and they simply forgot to be original, resulting in a story which is lousy even compared to television.",
         "What I really found impressive in this film is the way it just falls into the turnaround of stereotypes. I was zapping one night and came across it and I was totally engrossed within the first few minutes. I don't come from or live in the USA but I can't help wondering what the people there thought about this film. It seemed to very subtly explain what I have always believed, racism has nothing to do with colour it has to do with wealth. I never realized that John Travolta was such a superb actor until I watched this film. I saw it about 7 years ago and I tell everyone about it when talking about cinema. What surprises me is that relatively few people have seen it or even heard of it.",
         "Although on the surface a stupid, simplistic and \"unrealistic\" film, there is much more to the film. If the roles were reversed and every black character was played by a white and every white by a black I would be bored to tears, the film would never have made a dime, and we'd all hate it with justification. However, it was this very realization, during the film, which made me respect its message. Because the roles are completely and totally reversed, swapping black and white character for character, the film is disturbing. It's almost painful to watch. Ask yourself while you're watching how you're reacting and how the reaction would be different if there were no race reversals. Maybe that's because of the stereotypes we have in place and the roles we do play in the world - if it were just another story about a black man down on his luck we'd all yawn but because it's a white man and all of society is reversed, we watch, we wonder how it will play out, and we're bothered by it. I analogize the film to Planet of the Apes in some ways because of its ability to make us step back and take a look at society in a different way entirely. It is not as well done as Planet of the Apes but is worthwhile.",
         "\"White Man's Burden\" has a (reasonably) neat premise: society is reversed so the black man is in the white man's current place. The idea is this allows us to tackle our prejudices and preconceived notions about society. Does it work? No, it's too busy being laughable or boring. From the opening I felt chills. Was this chocolate factory scene, brown being poured on top of white, some horribly clumsy use of imagery? I feared so. The film looked set to be heavy-handed, and it was. The movie's flaw is that it over-does it's premise - nearly all the white people are poor and rundown, while all the black people come across as elitist snobs. The underlying message of course being that in \"our reality\" the situation is reversed and this gives a horribly, simplistic, and downright irritating attitude towards race. It's completely simplistic and infuriating - not because you're angered that it's right but because it's done so poorly and with a preachiness that grates. It might all be OK if there was a story to support it. There isn't. Reeking of TV movie-of-the-week, John Travolta is playing a desperate factory-worker who kidnaps his ex-boss in a bid to get the money he lost from being fired unfairly. *Yawn*. There's no suspense and no tension in their scenes. There's the boring, trite situation where the boss, played by Harry Belafonte, starts to understand Travolta's cause. Far too obvious in coming. There's even the hilariously poor moment when Belafonte's son takes home a white girl to a look of distaste from his mother - bang that message-hammer on our heads Mr Nakano (the script writer). I'm reminded of a moment from \"Don't Be a Menace to South Central While Drinking Your Juice in the Hood\" when the character is similarly preachy and the postman turns to the screen and says \"Message!\" pointing out how morale messages are weakly delivered. In fact the only decent bit is about two minutes from the end, and even that's ruined by the (incredibly) obvious follow-up final minute. *Yawn*. Travolta does nothing for this picture. This film was released after his sudden re-emerge in \"Pulp Fiction\", but I imagine he made it while still wandering around the Turkey Farm. His performance is as forgettable, as is usual with him and Belafonte is just OK. Nothing can make me recommend this piece. If you want a movie about race issues why not watch the infinitely superior \"American History X\". This movie has a dreadful plot, weak acting, and destroys a promising premise by being both heavy-handed and insultingly simplistic. Avoid. 2/10.",
         "I expected good things from this film as I tend to admire directors and screenwriters who take a visually arresting premise and manipulate it in order to prompt self reflection in the audience (The Elephant Man for example). In addition, I am a big fan of Travolta and the role seemed an artistically sound one for him to undertake. Initially, the widespread symbolism is interesting and inventive, yet becomes overbearing relatively quickly, and to me it seemed that the director underestimated his audience's perception and continually rammed home his point with the subtlety of Dolph Lundgren. The film ultimately left me frustrated because I thought the idea was a good one but the story simply wasn't multi-faceted enough to be engaging. Aside from the characters played by Travolta and Belafonte, most of the supporting cast was very underwritten, particularly the families of both men. However, the performances were very good, and I thought Belafonte conveyed the defeatism and inherent arrogance of his role particularly well. Overall though, I thought this was pseudo-art: it masqueraded as a deep and meaningful examination of the social relevance of race, but ended up as a very simplistic story disguised by delusions of self worth. 5/10",
         "Minor Spoilers On the plus side, it was believable. It had good acting. I especially liked Harry Belafonte getting irate at the inept white cashier for not helping him get robbed by John Travolta. That was a nice touch to add some twisted realism to the movie. I laughed at that one part. But the rest was just so depressing, and that story line (apart from the racial switch) has been done to death. Take Boys in the Hood and switch the white and black people around. There was no real point other than the fact that racism exists in our world and that it's a darned shame people get discriminated against. Really? Wow! Who knew? So if you want to be miserable and your favorite Blues radio station has been taken over by the Dance Mix Syndicate, go rent White Man's Burden. Otherwise, don't."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "A Band Apart",
         "Chromatic",
         "Home Box Office (HBO)"
      ],
      "summaries": ["The story takes place in alternative America where the blacks are members of social elite, and whites are inhabitants of inner city ghettos. Louis Pinnock is a white worker in a chocolate factory, loving husband and father of two children. While delivering a package for black CEO Thaddeus Thomas, he is mistaken for a voyeur and, as a result, loses his job, gets beaten by black cops and his family gets evicted from their home. Desperate Pinnock takes a gun and kidnaps Thomas, demanding justice."],
      "budget": 7000000
   },
   "movielensId": 209,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-01",
      "dvdReleaseDate": "1999-05-11",
      "directors": ["Desmond Nakano"],
      "runtime": 89,
      "movieId": 209,
      "title": "White Man's Burden",
      "mpaa": "R",
      "actors": [
         "John Travolta",
         "Harry Belafonte",
         "Kelly Lynch",
         "Margaret Avery",
         "Tom Bower"
      ],
      "imdbMovieId": "0114928",
      "originalTitle": "White Man's Burden",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["37U_vQOKooE"],
      "plotSummary": "The story takes place in alternative America where the blacks are members of social elite, and whites are inhabitants of inner city ghettos. Louis Pinnock is a white worker in a chocolate factory, loving husband and father of two children. While delivering a package for black CEO Thaddeus Thomas, he is mistaken for a voyeur and, as a result, loses his job, gets beaten by black cops and his family gets evicted from their home. Desperate Pinnock takes a gun and kidnaps Thomas, demanding justice.",
      "tmdbMovieId": 31611,
      "avgRating": 2.82239,
      "releaseYear": "1995",
      "numRatings": 777,
      "posterPath": "/aaFpmILNyNSReVgzKGFu8iKNYzi.jpg"
   }
}