{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0078158",
      "video": false,
      "title": "Return from Witch Mountain",
      "recommendations": [
         14821,
         19378,
         112170,
         86233,
         14612,
         75686,
         38147,
         22777,
         81887,
         187542,
         18966,
         46878,
         16084,
         42218,
         29911,
         63988,
         84994,
         4199,
         45225,
         69321
      ],
      "backdrop_path": "/5Vq3BsulfarH3XzjQGgSuRu6xhP.jpg",
      "revenue": 16393000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Letha",
               "gender": 1,
               "credit_id": "52fe461d9251416c7506d9bd",
               "name": "Bette Davis",
               "profile_path": "/oWGPnjrIxmGHklOGimoPwvIxBgQ.jpg",
               "id": 3380,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Victor Gannon",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9c1",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tia Malone",
               "gender": 1,
               "credit_id": "52fe461d9251416c7506d9c5",
               "name": "Kim Richards",
               "profile_path": "/jTO90DPcHXesL7cSudasucD9xGW.jpg",
               "id": 53261,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tony Malone",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9c9",
               "name": "Ike Eisenmann",
               "profile_path": "/w37MJao2bS0EgGRpryckVlkjd90.jpg",
               "id": 87066,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mr. Yokomoto",
               "gender": 0,
               "credit_id": "52fe461d9251416c7506d9cd",
               "name": "Jack Soo",
               "profile_path": "/22rYGESZTvuXlCReTS8gVs85r1O.jpg",
               "id": 87067,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sickle",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9dd",
               "name": "Anthony James",
               "profile_path": "/IovpB0rm77GljLMLP5S3VW6AAi.jpg",
               "id": 3715,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9e1",
               "name": "Richard Bakalyan",
               "profile_path": "/flHUIu0hpigaZYXb7XfkEFmPc7j.jpg",
               "id": 12299,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mr. Clearcole",
               "gender": 0,
               "credit_id": "52fe461d9251416c7506d9e5",
               "name": "Ward Costello",
               "profile_path": "/qSQXhihMxZ53GMWHcCGssmNoqhz.jpg",
               "id": 107549,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dazzler",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9e9",
               "name": "Christian Juttner",
               "profile_path": null,
               "id": 137659,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Muscles",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9ed",
               "name": "Brad Savage",
               "profile_path": null,
               "id": 19737,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Crusher",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9f1",
               "name": "Poindexter Yothers",
               "profile_path": null,
               "id": 1002283,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Rocky",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9f5",
               "name": "Jeffrey Jacquet",
               "profile_path": null,
               "id": 162152,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Dolan",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9f9",
               "name": "Stu Gilliam",
               "profile_path": null,
               "id": 151659,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Operations Officer",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9fd",
               "name": "William Bassett",
               "profile_path": "/hY86g53UNyyBNny8c9nsqmVccij.jpg",
               "id": 83978,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9d3",
               "name": "John Hough",
               "profile_path": null,
               "id": 19032,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d9d9",
               "name": "Malcolm Marmorstein",
               "profile_path": null,
               "id": 68132,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58070a3dc3a3684e06012137",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58070a459251415b9001159e",
               "name": "Frank V. Phillips",
               "profile_path": null,
               "id": 58007,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.315009,
      "production_countries": [],
      "id": 14822,
      "vote_count": 44,
      "budget": 0,
      "overview": "In this sequal to \"Escape From Witch Mountain,\" Tia and Tony leave their safe refuge on witch mountain for a trip to Los Angeles. Tony is kidnapped by the evil Dr. Gannon and his spinster partner Letha and brainwashed into helping Gannon and Letha commit various crimes. It's up to Tia and a gang of truant kids to rescue Tony and prevent a major disaster.",
      "similar": [],
      "original_title": "Return from Witch Mountain",
      "runtime": 95,
      "poster_path": "/xyApwnx2Rf8105KrfO0oCWq56Bc.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1978-03-10",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/aXZ0LmSgLT1ZiNWnJ5qKaQHqBiC.jpg",
         "name": "Witch Mountain Collection",
         "id": 90348,
         "poster_path": "/3IggdwQeJvkkfMTKRv9iEpInGnV.jpg"
      },
      "tagline": "Sinister forces from this world against two young space travellers from another.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Hough"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Malcolm Marmorstein",
         "Alexander Key"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078158/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwMjA2NDMxOV5BMl5BanBnXkFtZTcwODk5MzAwMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Bette Davis, Christopher Lee, Kim Richards | See full cast and crew »"],
      "reviews": [
         "This is a fine sequel to one of Walt Disney's better family projects Escape from Witch Mountain. The adult stars are Bette Davis and Christopher Lee as an old dowager financing a mad scientist in some nefarious experiments. These two happen on the alien kids from Witch Mountain, Kim Richards and Ike Eisenman, when the kids are on holiday to Earth once again. They kidnap Ike after seeing an example of his powers of levitation and seek to use him and fit him with a mind control device that Lee's been perfecting. Lee's dreaming some big dreams and Davis has some more mundane schemes like a trip to some gambling house or racetrack. Both of them looking like they are having one grand old time hamming it up for the cameras. Of course the film wouldn't work at all if it were not for the winning personalities of Richards and Eisenman. Both come across as real kids, not sure of the extent of their own powers rather than Hollywood juvenile actors. The whole of the film is Richards pursuing and trying to rescue her brother and in the process she recruits a gang of juveniles escaping from a truant officer played by the ever deadpan funny Jack Soo. Eventually Soo joins forces with the kids and proves of some help. Both Escape to Witch Mountain and this sequel are fine family entertainment, some of the best that Disney studio produced.",
         "This is a very well done sequel to \"Escape to which mountain\" Tony and Tia(Ike Eisenmann & Kim Richards)are back! This time, they come back to LA(they come via space ship and land on the 50 yard line at the rose bowl!)for a vacation. On their way to the motel, the cab they are riding in runs out of gas. When the cab driver leaves to go get gas, Tony and Tia have visions of a man falling from a tall building. Tony goes to help him. Enter Letha and Victor(Bette Davis & Christopher Lee)who are testing a mind control device that Sickle(Anthony James)is wearing. The test goes wrong when Letha grabs the remote control from victor and drops it on the ground. When Victor and Letha see Tony's powers, they repay Tony for saving Sickle's life by kidnapping him. Meanwhile, when Tony hasn't returned to the cab-she goes looking for him. He is nowhere to be found. After a short while, a pre-teen group of kids(Whom they call themselves \"The earthquake gang)are running away from another gang-Tia helps them escape from this gang. They then help Tia look for Tony. I like the earthquake gang. These kids, despite how they dress are not really a violent gang-I think they have a tender side of them-they want to help people. Now I realize that this is not based in any real reality, it's only a movie-they are not to be taken seriously. I get a laugh out of them. Although, they try to act tough they don't scare anyone. Victor and Letha are in their Lab testing this mind control device on Tony. After seeing the success of their tests, they both use Tony for their own evil ends. Letha wants money, she takes Tony to the museum in an attempt to steal 3 million dollars worth of gold which is on display. Things of course go wrong when they underestimate the weight of the gold bars. Victor on the other hand wants to rule the world and he uses Tony to take over a plutonium processing plant. Tia then shows up-and a show down between Tia and Tony ensues-you will need to watch the film to see how it ends. Although not the best sequel, it's better than most(Esp. by Disney). I recently got my DVD copies of both films. It's been remastered in THX, Dolby 5.1 surround sound. It sounds better than ever.",
         "It's not perfect, and the wardrobe makes me shudder (Tia's poor clothing she never changes the entire movie!), but it's a nice Disney movie with some rather humorous parts. Eddie is particularly funny talking to the goat Alfred. Being a Tony and Tia fan, I thought this movie wonderful as a kid. As an adult, I see it as good \"fodder\" in the world of Spiderman, Hulk and the rest of the movies that have words that I have to remind my son not to repeat. Movie-makers seem to have forgotten the word \"family\". The two siblings are deposited on the 50 yard line of the Rose Bowl 3 mos. before the next game, and escorted to the hotel by Eddie the Cabbie who drives more like a New York Cabbie. After Tony \"visions\" a man falling off a building (Davis' Letha's nephew, Sickle), he takes advantage of the cab's running out of gas to go help. As things do in the movies, the rescue wasn't as easy as he thought, and the good Doctor saw a golden opportunity to take control of molecular manipulation by enslaving Tony with his mind control device. Tia after feeling the prick of the hypodermic, goes to find him, and the chase is on with Tony vs. Tia the rest of the movie. The minivan is my favorite portion of the whole movie. *** out of 5 stars.",
         "When this movie came out I really, really, enjoyed it and it was so much fun to see because I was about near the age of the actors (younger by 3 or 4 years) and to see them wielding powers that I found fascinating because I had read about telekinesis and telepathy and it was so wonderful to see this in a movie with kids and these powers on top of that at an age where what ifs was something I would engage in or daydream about. \"What if I had these powers.....?\" Really fun movie. I somewhat recognize the great American actress Betty Davis and I somewhat recognized the great British or English actor Christopher Lee and thought nothing whatsoever about whether this was beneath them or not. Why should I? I enjoyed their participation in the showing of this story. Now here comes \"Die beste freudin\" and his miserable seeming know it all comments ( I know this is an open forum). What I don't understand is why do you suggest having to view another work of said actor's repertoire when this was the work said actor or actress was involved in? I am critical of what I watch. But, the two movies, and this coming from a Disney in the mid-70s and post-star wars, were/are two films that somehow brought in those necessary elements: one it has to have participation of the viewer and 2 it has to be fun. I'm talking about Escape from witch mountain and the unexpected sequel, Returm from witch mountain. I enjoy these two very much and the young actors portrayal or performance or work: Ike Eisenmann and Kim Richards and the supporting actors and actresses. Why do yo find it unbecoming or beneath you, I don't know. But you are entitled to your comments and opinion and therefore I share mine to differ from yours or from others.....",
         "Disney's sequel to their not-bad 1975 hit \"Escape To Witch Mountain\" brings back Ike Eisenmann and Kim Richards as the teen-tykes from outer space, here battling wits and powers with villainous Bette Davis and Christopher Lee (and their chauffeur, Anthony James, who also played a chauffeur alongside Davis in \"Burnt Offerings\"!). Well-enough made, but the movie loses sight of what was so special about the first film (a kid's flick with the emphasis on character, not overtly outlandish special effects). Davis is alert and anxious, but she's practically smothered under the gaudy make-up and is left to chew the scenery without benefit of a strong script. Poor Christopher Lee has it even worse, blending into the foreground action while the kids steal all his scenes. The plotting gets too heavy in the final third, what with Los Angeles about to be decimated and delinquent children running amok, but the worst decision was to separate siblings Tony and Tia for much of the movie. Some good sequences, Jack Soo does nice work in a warm supporting bit, and a goat nearly saves the day (and gets a big \"thank you\" to boot!). ** from ****",
         "When I heard that there was a sequel to the charming 1975 film, I was a little worried. But after seeing it, I enjoyed the film. The effects are outdated, the plot is nothing particularly special and the script has some weak spots. But it is definitely worth watching, as the film skips along nicely, is well directed and there are some humorous scenes with the juvenile group. Not to mention the lively car chase. But the acting is the best asset of this film. Jack Soo is hilarious in his supporting role and Kim Richards and Ike Eisenmann reprise their roles and very well might I add. Christopher Lee is a finely sinister lead villain, but it is the legendary Bette Davis's picture all the way, as the actress brings a touch of colour into a film that could have easily been bland, and with that colour it made the film worth watching. 7/10 Bethany Cox",
         "Sir Christopher Lee as the mad scientist and Bette Davis as Cletha play the mad scientist and his business partner in a plot to take over the world and make money. Anthony James plays Sickle, Cletha's nephew and only living relative. One day, they go searching for a perfect location and end up with gold. Sickle has the mad doctor's commands in his ear and he hurts him if he doesn't do exactly what he wants like climbing to the roof of a building in a deserted Los Angeles area. He's about to fall but is saved by Tony, a boy with special abilities. Tony and his sister, Tia, were headed to return home but their cab ran out of gas. The cab driver goes to get gas. Tony sensing trouble tries to stop and saves Sickle's life. Unfortunately, Tony is tagged and taken away. They have other plans for him. It's not a bad film and the special effects are way outdated but the acting isn't bad and the cast does make it worth watching.",
         "I saw this film when I was about 10 years old and loved it. Now 30 years on, it is still one of my favourite films. I have just bought both 'Escape to witch mountain & Return from witch mountain for my kids as they love it as well. They sure don't make good old movies like this now.These films are a must when they are shown on TV. There are no swear words or violence which makes them suitable for all the family whatever the ages. Good family fun. My mum took me to the pictures to see this film and I always wanted to have 'powers' like Tony & Tia. Mind you the child in me still does. Perhaps thats why I have a passion for anything supernatural now.",
         "I will be honest about this one--I really don't like the Disney live action films of the 60s and 70s. And, I never saw the original film \"Escape From Witch Mountain\". So why would I watch \"Return From Witch Mountain\"? It stars Bette Davis---and I'd watch anything with her in it...anything (except porn...EWWW!). The film begins with the two children from the previous film returning home with an adult of their species. The boy is a bit of a knucklehead and uses his amazing powers and then is sharply reminded NOT to do this again on Earth. However, moments later, a guy is falling to his death from a building and the boy uses his mental powers to stop the guy only a few feet from the ground--where he stays suspended! Needless to say, the folks watching (Davis and Christopher Lee) are amazed. And, since they are evil, they drug the boy and decide to take him with them to try to exploit him and his gifts. Then, they implant a mind-control device and turn the boy into their own personal weapon! However, his sister understands through her psychic connection with him that something is amiss--and she must go in search of him. The film includes a bunch of annoying little jerks who call themselves 'the Earthquake Gang'. Without them, the film might have had more appeal to older audiences but Disney was clearly trying to appeal to the kids. It also might have appealed more with less broad humor. It's a shame actually, as the idea of the film isn't bad and the special effects are awfully good for 1978. I was particularly impressed with effects such as the broken glass containing the gold, the UFO landing as well as the floating items (it looked pretty seamless). I also liked the gold going into the car--it was a clever little scene. Overall, it's a film strictly for kids but one the parents won't hate if they are forced to watch. Not exactly a glowing endorsement, but it is what it is--a kid's film from Disney. It's a shame, though, as Davis wasn't particularly good or useful to the film--Lee was clearly more interesting and integral to the film.",
         "Disney fantasy full of adventure , tension , intrigue and spectacular images . Engaging Walt Disney Sci-Fi/fantasy in which we meet Tony (Ike Eisenmann , in 2009 recent version played by Alexander Ludwig ) and Tia ( Kim Richards , subsequently performed by Anna Rob ) as they are arriving along with their uncle (Denver Pyle) in a flying saucer at a stadium called Rose Bowl . They have special telekinetic powers which make getting along with the rest of the kids difficult . After that , the clairvoyant kids with special powers meet a Cabman getting into a car across the streets . Some baddies discover their supernatural powers and effect they can have on humans while the children being pursued . As Tony is abducted by the evil Dr. Gannon (Christopher Lee), his spinster pal Letha (Bette Davis) and hoodlum (Anthony James) who want to use his powers for his own objectives . Gannon puts him an artifact into the neck that allows him to control Tony's brain . As Tony will brainwashed into helping them commit several crimes , hoping to put his special faculties to evil . This mystery-fantasy is packed with amusing action , thrills, suspense and spectacular scenes with abundant but primitive effects. The two children with mysterious powers played by Kim Richards and Ike Eisenmann are enjoyable and phenomenal , as always , Christopher Lee as mean villain and likable Bette Davis as old nasty . The picture results to be the sequel to ¨Escape to Witch mountain (1978)¨ also by John Hough that holds a recent take on titled ¨ Race to witch mountain (2009)¨ with The Rock , Carla Gugino and Ciaran Hinds as government agent and as homage to former adaptation appears Kim Richards as Sara and Ike Isenmann as sheriff in a brief roles . This funny picture is well directed by John Hough . He has an eclectic and long filmmaker career , beginning in television series ( Avengers, Protectors , The champions ) , making Hammer film (Twins of evil) , classic terror ( Legend of hell house ) , average horror movies ( Howling IV, American Gothic, Incubus ) , adventures ( Island of treasure, Black arrow ) until wholesome Disney family fare ( The watcher in the woods , Return and escape to witch mountain) . The flick will appeal to Disney film buffs and wholesome entertainment enthusiasts . A good children's film with acceptable special effects by that time though nowadays corny . The motion picture is professionally made though with no originality because being a simple remake , being an agreeable fun from Walt Disney productions ."
      ],
      "genres": [
         "Family",
         "Adventure",
         "Sci-Fi",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Tia and her brother Tony have supernatural powers, can communicate and move things with the power of their mind alone. They arrive on Earth for a visit in Los Angeles. When Tony uses his powers to prevent an accident, he gets into the hands of Dr. Gannon, a ruthless scientist who's constantly striving for power over the world. He puts him a device into the brain that allows him to control Tony's will. Tia gets help from a kids gang to free Tony and save the Earth.",
         "In this sequel to \"Escape From Witch Mountain,\" Tia and Tony, teenage sister and brother who possess extraordinary powers, leave their safe refuge on witch mountain for a trip to Los Angeles (their transport ship lands in the Rose Bowl). Tony is kidnapped by the evil Dr. Gannon and his spinster partner Letha and brainwashed into helping Gannon and Letha commit various crimes. It's up to Tia and a gang of truant kids to rescue Tony and prevent a major disaster."
      ],
      "budget": 0
   },
   "movielensId": 2091,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-03-10",
      "dvdReleaseDate": "2003-09-02",
      "directors": ["John Hough"],
      "runtime": 95,
      "movieId": 2091,
      "title": "Return from Witch Mountain",
      "mpaa": "G",
      "actors": [
         "Bette Davis",
         "Christopher Lee",
         "Kim Richards",
         "Ike Eisenmann",
         "Jack Soo",
         "Anthony James",
         "Richard Bakalyan",
         "Ward Costello",
         "Christian Juttner",
         "Brad Savage",
         "Poindexter Yothers",
         "Jeffrey Jacquet",
         "Stu Gilliam",
         "William Bassett"
      ],
      "imdbMovieId": "0078158",
      "originalTitle": "Return from Witch Mountain",
      "genres": [
         "Adventure",
         "Fantasy",
         "Science Fiction",
         "Family"
      ],
      "youtubeTrailerIds": ["WJ4Tx4Vq_K8"],
      "plotSummary": "In this sequal to \"Escape From Witch Mountain,\" Tia and Tony leave their safe refuge on witch mountain for a trip to Los Angeles. Tony is kidnapped by the evil Dr. Gannon and his spinster partner Letha and brainwashed into helping Gannon and Letha commit various crimes. It's up to Tia and a gang of truant kids to rescue Tony and prevent a major disaster.",
      "tmdbMovieId": 14822,
      "avgRating": 2.88911,
      "releaseYear": "1978",
      "numRatings": 1258,
      "posterPath": "/xyApwnx2Rf8105KrfO0oCWq56Bc.jpg"
   }
}