{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "district attorney",
            "id": 33518
         }
      ],
      "imdb_id": "tt0075200",
      "video": false,
      "title": "The Shaggy D.A.",
      "recommendations": [
         15944,
         20639,
         6174,
         42795,
         42596,
         65066,
         22777,
         42453,
         19378,
         63063,
         17984,
         18660,
         42010,
         22779,
         24816,
         29694,
         51333,
         33258,
         18535
      ],
      "backdrop_path": "/pIFKVA2fdvDv8SCYX49iqouw8p8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Wilby Daniels",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c06f",
               "name": "Dean Jones",
               "profile_path": "/n9eCdZR2pUylbx53VEoTZ6INuIr.jpg",
               "id": 40393,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Betty Daniels",
               "gender": 1,
               "credit_id": "52fe468e9251416c7507c073",
               "name": "Suzanne Pleshette",
               "profile_path": "/7R77pmMiGLHtDrnhCjGzmDohS8O.jpg",
               "id": 8231,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c077",
               "name": "Tim Conway",
               "profile_path": "/non96yYuFTWnopBgNtj1MWcm0Z5.jpg",
               "id": 83414,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "John Slade",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c07b",
               "name": "Keenan Wynn",
               "profile_path": "/vKRcpt50Eh9AQ6yi9umy1YFZWyf.jpg",
               "id": 4966,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Katrinka Muggelberg",
               "gender": 1,
               "credit_id": "52fe468e9251416c7507c07f",
               "name": "Jo Anne Worley",
               "profile_path": "/z8vMMqw1Uo4WoUZbiVWtkA9Zac0.jpg",
               "id": 166994,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Raymond",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c083",
               "name": "Dick Van Patten",
               "profile_path": "/mAYJ9Psvz3JQAvHXDwdcegO3Wok.jpg",
               "id": 14671,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Brian Daniels",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c087",
               "name": "Shane Sinutko",
               "profile_path": null,
               "id": 167384,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Eddie Roschak",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c08b",
               "name": "Vic Tayback",
               "profile_path": "/38Y2TnqrKyaO7Pcy3edi4EFeYZR.jpg",
               "id": 14069,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Adm. Brenner",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c08f",
               "name": "John Myhers",
               "profile_path": "/buJ84g8FtK95dv5BkbfNB3nwZO0.jpg",
               "id": 108172,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Freddie",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c093",
               "name": "Richard Bakalyan",
               "profile_path": "/flHUIu0hpigaZYXb7XfkEFmPc7j.jpg",
               "id": 12299,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Dip",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c097",
               "name": "Warren Berlinger",
               "profile_path": "/sPjUl670iugfgCH5TMLXqqNLrMP.jpg",
               "id": 19440,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "T.V. Director",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c09b",
               "name": "Ronnie Schell",
               "profile_path": "/f98UP37Mm0AgEYysKlQDnYbqlDr.jpg",
               "id": 88821,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "T.V. Interviewer",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c09f",
               "name": "Jonathan Daly",
               "profile_path": "/lmuQw6mZsXl9WzBytbyypwu4loY.jpg",
               "id": 145174,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Howie Clemmings",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0a3",
               "name": "John Fiedler",
               "profile_path": "/wjhOLcxWaum0JIBIRMZaQQjrhQw.jpg",
               "id": 5247,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Prof. Whatley",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0a7",
               "name": "Hans Conried",
               "profile_path": "/7JnEMvdZEoA1uumb0HG2qKFh6ZP.jpg",
               "id": 16421,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Sheldon",
               "gender": 0,
               "credit_id": "52fe468e9251416c7507c0ab",
               "name": "Michael McGreevey",
               "profile_path": null,
               "id": 103322,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Desk Sergeant",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0af",
               "name": "Richard O'Brien",
               "profile_path": "/qcqGtwFB0why84io8GTClOidH28.jpg",
               "id": 118484,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Roller Rink Announcer",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0b3",
               "name": "Richard Lane",
               "profile_path": "/fXoJBOosoQ3zDZPaTN01hKwTQ1h.jpg",
               "id": 111464,
               "order": 17
            },
            {
               "cast_id": 22,
               "character": "Waiter",
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c0b7",
               "name": "Benny Rubin",
               "profile_path": "/iWjnIur6En50YRvC1zkPPGoP5By.jpg",
               "id": 117029,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c05f",
               "name": "Robert Stevenson",
               "profile_path": "/86MMwlxQ7AhJMn1JnDg8hjZbnSy.jpg",
               "id": 5834,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe468e9251416c7507c065",
               "name": "Don Tait",
               "profile_path": null,
               "id": 62755,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe468e9251416c7507c06b",
               "name": "Felix Salten",
               "profile_path": null,
               "id": 31017,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.58861,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15943,
      "vote_count": 17,
      "budget": 0,
      "overview": "Wilby Daniels, a successful lawyer running for District Attorney, suddenly finds himself being transformed into an English sheepdog. Somehow he has to keep his change a secret and find just what is causing it, all the while eluding the local dog catcher.",
      "similar": [
         12230,
         9598,
         9800,
         22803,
         389,
         396371,
         314365,
         1645,
         11674,
         392982,
         10340,
         2642,
         1574,
         28178,
         5559,
         2898,
         11544,
         634,
         399174,
         390043
      ],
      "original_title": "The Shaggy D.A.",
      "runtime": 91,
      "poster_path": "/5VkrpV2doDkFlIUg34MhDXJlFrC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1976-12-17",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Shaggy Dog Collection",
         "id": 294519,
         "poster_path": "/qCX60rYHFm8T8ffinuMq0cDM3iI.jpg"
      },
      "tagline": "The Only Candidate with a Law Degree and a Pedigree!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Stevenson"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Don Tait",
         "Felix Salten"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0075200/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NzU3NzczN15BMl5BanBnXkFtZTcwNTk4MzMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dean Jones, Suzanne Pleshette, Tim Conway | See full cast and crew »"],
      "reviews": [
         "One of the better Disney comedies from the 70's.This sequel to The Shaggy Dog is a bit funnier than the first film. With Dean Jones, Suzanne Pleshette, Tim Conway and Keenan Wynn it has a top notch cast. Anyone who enjoys good clean family entertainment should get plenty of chuckles from this slapstick romp. Rate it a 7.5 of 10",
         "I saw this back in 1976 and thought it was the funniest movie ever. Of course, I was only 7 at the time. I saw it again recently and of course noticed several things I didn't see the first time. The story is about a young lawyer/family man (Dean Jones) who runs for DA against the corrupt DA currently in office (Keenan Wynn) but the latter gets ahold of a ring which has an inscription that when read, can turn Jones into a sheepdog. The same gag (of Jones becoming a sheepdog at the worst possible time) is repeated a bit too much and most of the gags are obvious and dependant upon banana peel-like slapstick/humor. Dean Jones is a fine actor but he kept playing the same character over and over in the Disney comedies of the 70s. (He never seemed to know what was going on and was constantly the butt of the joke). Not surprisingly, the Disney slapstick films soon wore out their welcome. The Shaggy DA though is one of Disney's better offerings. It features a pretty good cast. Tim Conway as an ice cream man is especially in good form and Vic Tayback adds some life as a mobster who is in cahoots with Wynn. The humor is dated and certainly not aimed at intelligent kids but for the most part, it does deliver with the laughs.",
         "I guess that when Dean Jones and Suzanne Pleshette got married it wasn't spelled out that there would be no secrets because Dean Jones kept a really big one from his teen years. For what that was and how it turned out one should see the prequel to The Shaggy DA, the famous Walt Disney classic, The Shaggy Dog. To refresh one's memory back then the Dean Jones character of Wilby Daniels was played by Tommy Kirk who because of a cursed ring said to belong to Lucretia Borgia back in the day who allegedly dabbled in the black arts, Kirk would enter the body of a large sheep dog who was owned by the new next door neighbors of his family. When the ring got returned and Kirk performed a heroic act, the curse was lifted. Or so they thought, now Wilby Daniels is played by Dean Jones who now is a lawyer, running for District Attorney against corrupt DA Keenan Wynn and married to Suzanne Pleshette with a son, Shane Sinutko. Just as the campaign gets going the ring is once again stolen from the museum and when the magic words inscribed on the ring are uttered, Jones is shifting from human to canine and back. Eventually chief villain Keenan Wynn gets the ring and he's in control of the situation when he discovers what it does to Jones. It becomes a family project to get that ring back and expose him before the electorate. Also along for the ride is Tim Conway, an ice cream truck vendor whose shaggy dog's body Jones transfers to. The Shaggy DA has a lot of laughs in it and its good entertainment, it doesn't however have the poignancy of the teen angst that Tommy Kirk brought to the original Wilby. It does have the usual cast of Hollywood veterans that the Disney studio always managed to find work for. It's one of the reasons the Magic Kingdom films from the late Sixties and Seventies are a lot of fun, it's like watching some of the classic films from the studio system days, seeing all those familiar faces. I'd still recommend the film, especially to family audiences with younger viewers, but it's not as good as the original.",
         "This is not a true sequel to the 1959 original starring Tommy Kirk as a teen-aged Wilby Daniels. By that I mean it doesn't continue the same story line. This time, Dean Jones is the adult Wilby Daneils. When his house is robbed-not once-but twice-he decides enough is enough and decides to run for DA. From the outset Wilby is faced with two problems-first, is to try to defeat the incumbent DA-Honest John Slade(Keenan Wynn). John Slade is anything but honest-he is allowing crooks off the hook by not prosecuting them or letting them off easy. One of these crooks is Eddie Roschak(Vic Tayback-in a much more realistic portrayal of a bad guy than in \"No deposit, no Return\"). Wilby's Second and much more serious problem-is that the \"Borger\" ring has been stolen from the museum-and whenever someone reads the inscription on the ring-Wilby is transformed in to a shaggy dog-that belongs to \"Tim-the ice cream man\"(Tim Conway). THe dog's name is \"Elwood\" Wilby's Wife is Betty(Suzanne Pleshette)and they have a son, whom I call the wisecracking \"Brian\"(Shane Sinutko). His wife becomes his campaign manager. John Slade gets hold of the ring and tries to blackmail Daneils out of the race by threatening to keep reading the inscription on the ring over & over again to keep Daniels as a dog. Of course he ignores the warning the museum curator gives-if you read the inscription too many times-you may turn into a dog your self. Wilby, Brian & Tim are on a mission to get the ring back from Slade and his gang of crooks. Do they succeed? You will need to see the film to find out. The pie fight is so funny. There are plenty of funny moments and gags in this movie. This is one of the better comedies offered by Disney in the 70's. So, why do I vote 8 instead of 10? Well-the movie doesn't answer the questions I have: 1. Why is it that Wilby Daneils is turned into a dog himself? Why not someone else? 2. Does Daneils descend from the Borger Family, and is he a victim of a family curse? I know that in the 1959 original-Daneils finds the ring and he reads the inscription and turns into a dog. That maybe the answer-but the fact remains-not everyone who reads the inscription turns into a dog. I think there must be something else-a family trait or curse or something that only happens to Daniels and no one else. Overall, this is a real good movie with a fine cast and directed by Disney's Ledgendary director Robert Stevenson.",
         "Amiable lawyer Wilby Daniels (winningly played by Dean Jones) is running for district attorney. Wilby once again gets stricken by the Borgia ring curse which causes him to transform into a large shaggy sheepdog at inopportune moments. His shady and crooked no-count rival John Slade (a marvelously hearty'n'huffy portrayal by Keenan Wynn) tries to get his hands on said ring so he can fix the election. Director Robert Stevenson, working from a blithely silly script by Don Tait, relates the loopy story at a constant zippy pace, maintains a good-natured and innocuous tone throughout, and stages the expected zany slapstick with considerable panache (a wild pie fight and an equally crazy car chase rate as the definite sidesplitting comic highlights). Moreover, the top-rate cast play their parts with infectiously zesty aplomb: Jones is totally engaging in the lead, Tim Conway is in peak goofy form as eager beaver ice cream man Tim (the scenes with Tim trying to convince other people his dog Elwood can talk are hilarious!), Suzanne Pleshette brings some class to her role as Wilby's supportive wife Betty, Wynn grouches it up with growly gusto as a deliciously broad heavy, plus there are neat supporting contributions from Jo Anne Worley as brassy, chipper lunch lady Katrinka Muggelberg, Dick Van Patten as Slade's obsequious partner Raymond, Vic Tayback as fearsome crime boss Eddie Roschak, Richard Bakalyan as bumbling hoodlum Freddie, and John Fiedler as jolly dog catcher Howie Cummings. Buddy Baker's bouncy score, Fred V. Phillips' sharp cinematography, the nifty make-up f/x, and the jaunty theme song all further enhance the sweetly inane charm of this immensely enjoyable hoot.",
         "Attorney Wilby Daniels (played by Dean Jones) and his wife Betty (played by Suzanne Pleshette) return to their home and find out that it has just been robbed. After the robbers return a second time to take everything else that they had left, Wilby decides to run for District Attorney so he can clean up the town and lock up the criminals for good. Meanwhile, the same robbers who broke into his house have also stolen the famous Borgia ring from the local museum. Unfortunately for Wilby, every time someone reads the inscription, he turns into a sheepdog again. This of course, happens at the most inconvenient times, and the result is a silly, family-friendly comedy. The Shaggy D.A. is a sequel to the 1959 Disney film, the Shaggy Dog. Though it's not quite as funny as the original, there still is a lot to like about this version of the story. The acting is pretty much on par with what we've come to expect from these Disney films, and the characters are pretty interesting, even if they are one-dimensional. The transformation from human to dog doesn't seem to work as well here as it did in the 1959 film, for some reason, but it's fine. If I had a complaint about this movie, it's that it goes a bit long and the same gags are used a few times too many. Other than that, it's nice to find a film that doesn't resort to 7th grade humor that seems to be in every \"family\" film these days. The bottom line is this is a decent movie if you'd like to have a good time with the kids, but adults will be a bit bored from it fairly soon. It's not as good as some of the other Disney comedies from the 1960s and 1970s.",
         "This movie was probably never considered anything more than another silly mid-70s Disney slapstick comedy, but it is pretty fun and funny. I love Dean Jones in films like THE LOVE BUG and THE UGLY DACHSHUND, and he is great here as well as the adult Wilby Daniels, who has grown into an happily married husband and father, as well as an idealist lawyer. After he becomes fed up with the rash of organized crime in his town, Daniels is persuaded to run for district attorney, against the corrupt John Slade. I really like Keenan Wynn as an actor too, but in this he seemed more sinister than funny, and was more fun in HERBIE RIDES AGAIN and THE GREAT RACE. Still, he makes for a great villain, evil and calculating. Tim Conway, Suzanne Pleshette, Ronnie Schell (sp?), Dick Van Patten, Hans Conried and Joanne Worley add to a film that is a bit more lighthearted than the prequel of 1959.",
         "Dean Jones and Tim Conway make this the most thrilling and hilarious Shaggy Dog movie of all time. Some of it is a bit wacky, but not ridiculous and that just adds to the fun and humor. It's not exactly a direct sequel to the original 1959 Shaggy Dog, but that doesn't hurt it at all. Personally I find the original one to be rather boring, frustrating, and confusing, but this movie is all out fun. Some parts are so funny that I couldn't stop laughing. I haven't seen any of the latter Shaggy Dog movies except for the new one with Tim Allen, which is OK, but not as good as this one, I can't see any Shaggy Dog movie being better than this.",
         "Just kidding (As if anyone could not figure out-- whether they've seen the movie or not-- how it will turn out). Like one of the other people who commented above, I was a kid (6) when this movie came out, and for some reason this is one of the movies that sticks in my mind along with Gus, Boatniks, and the '66 Batman, when I think back on the movies I saw at that age. So Shaggy DA has a built-in nostalgia factor as far as I'm concerned, and maybe for others my age, but anyone else would probably be bored to tears. The pie-fight had a little spark of energy, but watching this now mainly just serves to remind what low standards \"family entertainment\" had in the 70s. It's really amazing, today, to look back on this kind of stuff-- Shaggy DA, Pete's Dragon, that \"Goin Cocoanuts\" thing the Osmonds put out-- and think: Good Lord, was that really the best they could do?",
         "Star Dean Jones and director Robert Stevenson collaborate on yet another goofy caper from the Disney machine. A belated sequel to the 1959 lump 'The Shaggy Dog', this is slightly better than the original thanks to a brisker pace and funnier gags, but it's thin stuff, and it's just like every other film popped from the same mould. As before, the funniest moments come when the dog (or is it a man in a dog suit? It's impossible to tell) does such un-doglike things as ride a bike, drive a car, read a paper and abseil out of a window! It's silly nonsense, desperate and overlong. But there is some fun to be had along the way, and Jones and Suzanne Pleshette are fun to watch."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Sequel to the 1959 movie about a boy who gets turned into a dog because of an ancient ring which some say is cursed. Today the boy, Wilby Daniels is a grown man, a lawyer and with a family. When they're robbed and Wilby tries to report it to police but only gets the run around, he decides to run for District Attorney or D.A. Because he believes that the current D.A. John Slade is not only doing his job but is on the take. When Daniels publicly denounces Slade, Slade decides to try and get something on him. And he might have found it when the ring that turned him into a dog when he was a boy is stolen from the museum and when the words inside are read, he turns into a dog.",
         "Wilby Daniels, a successful lawyer running for District Attorney, suddenly finds himself being transformed into an English sheepdog. Somehow he has to keep his change a secret and find just what is causing it, all the while eluding the local dog catcher.",
         "With his family's happy support, Wilby Daniels decides to try and get elected District Attorney in place of dishonest John Slade. But then robbers steal the magic Borgia ring that made things a bit difficult for Wilby as a lad. Once again he keeps turning into a large woolly dog at awkward moments. Unless he can get the ring back his chances of winning the election don't look good, as mean old Slade soon realises too.",
         "A lawyer makes an interesting discovery that could affect his chances of getting elected to office."
      ],
      "budget": 0
   },
   "movielensId": 2095,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1976-12-17",
      "dvdReleaseDate": "2006-03-07",
      "directors": ["Robert Stevenson"],
      "runtime": 91,
      "movieId": 2095,
      "title": "The Shaggy D.A.",
      "mpaa": "G",
      "actors": [
         "Dean Jones",
         "Suzanne Pleshette",
         "Tim Conway",
         "Keenan Wynn",
         "Jo Anne Worley",
         "Dick Van Patten",
         "Shane Sinutko",
         "Vic Tayback",
         "John Myhers",
         "Richard Bakalyan",
         "Warren Berlinger",
         "Ronnie Schell",
         "Jonathan Daly",
         "John Fiedler",
         "Hans Conried",
         "Michael McGreevey",
         "Richard O'Brien",
         "Richard Lane",
         "Benny Rubin"
      ],
      "imdbMovieId": "0075200",
      "originalTitle": "The Shaggy D.A.",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Wilby Daniels, a successful lawyer running for District Attorney, suddenly finds himself being transformed into an English sheepdog. Somehow he has to keep his change a secret and find just what is causing it, all the while eluding the local dog catcher.",
      "tmdbMovieId": 15943,
      "avgRating": 2.80676,
      "releaseYear": "1976",
      "numRatings": 828,
      "posterPath": "/5VkrpV2doDkFlIUg34MhDXJlFrC.jpg"
   }
}