{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "southern",
         "id": 170633
      }],
      "imdb_id": "tt0038969",
      "video": false,
      "title": "Song of the South",
      "recommendations": [
         313563,
         382798,
         216971,
         372942,
         382800,
         96019,
         378567,
         111669,
         383516,
         376477,
         365279,
         442554,
         331265,
         238327,
         327558,
         79359,
         116696,
         103130,
         132994,
         107673
      ],
      "backdrop_path": "/vyBKo6Ip5uCRctECi1fW7FKBpxB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sally",
               "gender": 1,
               "credit_id": "52fe45ad9251416c7505ea63",
               "name": "Ruth Warrick",
               "profile_path": "/zb6SLWE9PFCy1ZEEDznuVbYmoio.jpg",
               "id": 11026,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "52fe45ad9251416c7505ea67",
               "name": "Bobby Driscoll",
               "profile_path": "/ib5Age9peuCwy6L5eZBN7W3egt3.jpg",
               "id": 50997,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Uncle Remus / Br'er Fox (Voice)",
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505ea73",
               "name": "James Baskett",
               "profile_path": null,
               "id": 535025,
               "order": 2
            },
            {
               "cast_id": 19,
               "character": "Ginny",
               "gender": 1,
               "credit_id": "52fe45ad9251416c7505eaab",
               "name": "Luana Patten",
               "profile_path": "/nJH9a8RChJKrYecjb4veNVuWenQ.jpg",
               "id": 137831,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Grandmother",
               "gender": 1,
               "credit_id": "52fe45ad9251416c7505ea77",
               "name": "Lucile Watson",
               "profile_path": "/lph8cxn8qWFyt39tG68mfO2AyY8.jpg",
               "id": 83260,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Aunt Tempy",
               "gender": 1,
               "credit_id": "52fe45ad9251416c7505ea7b",
               "name": "Hattie McDaniel",
               "profile_path": "/y3QtJ1qZD7Ms0IAzRbgOunMp97h.jpg",
               "id": 11498,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "John (as Eric Rolf)",
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505ea7f",
               "name": "Erik Rolf",
               "profile_path": "/4iVrORBF3YiqlxtU8oPxrZ1iFRd.jpg",
               "id": 129680,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Toby",
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505ea83",
               "name": "Glenn Leedy",
               "profile_path": null,
               "id": 358850,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Mrs. Favers",
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505ea87",
               "name": "Mary Field",
               "profile_path": "/fUuUy1lk7aOlMuw9EvHG4UiUSRw.jpg",
               "id": 115366,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Maid",
               "gender": 1,
               "credit_id": "52fe45ad9251416c7505eaaf",
               "name": "Anita Brown",
               "profile_path": null,
               "id": 120775,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jake Favers",
               "gender": 2,
               "credit_id": "52fe45ad9251416c7505ea8b",
               "name": "Georgie Nokes",
               "profile_path": null,
               "id": 17758,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Joe Flavers",
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505ea8f",
               "name": "Gene Holland",
               "profile_path": null,
               "id": 348967,
               "order": 11
            },
            {
               "cast_id": 4,
               "character": "Br'er Bear (voice)",
               "gender": 2,
               "credit_id": "52fe45ad9251416c7505ea6f",
               "name": "Nick Stewart",
               "profile_path": null,
               "id": 388960,
               "order": 12
            },
            {
               "cast_id": 3,
               "character": "Br'er Rabbit (voice)",
               "gender": 2,
               "credit_id": "52fe45ad9251416c7505ea6b",
               "name": "Johnny Lee",
               "profile_path": null,
               "id": 198203,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505ea95",
               "name": "Harve Foster",
               "profile_path": null,
               "id": 275022,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ad9251416c7505ea9b",
               "name": "Wilfred Jackson",
               "profile_path": "/iQgvspjL7upXGHSG6EbOuzBMg3Y.jpg",
               "id": 11434,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45ad9251416c7505eaa1",
               "name": "Dalton S. Reymond",
               "profile_path": null,
               "id": 571175,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "55944e829251412502000b40",
               "name": "Joel Chandler Harris",
               "profile_path": null,
               "id": 571176,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "55944e9f9251411204000dec",
               "name": "Dalton S. Reymond",
               "profile_path": null,
               "id": 571175,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55944eb2c3a36835660015ac",
               "name": "Morton Grant",
               "profile_path": null,
               "id": 121049,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "55944ec8c3a368775d004ad4",
               "name": "Maurice Rapf",
               "profile_path": null,
               "id": 938322,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "565a0469c3a3680ab5000a69",
               "name": "Eric Larson",
               "profile_path": "/gVmjOBQ1Gf6xrL6xgPCyHgKa8f1.jpg",
               "id": 22066,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a087d92514161b1000af9",
               "name": "Les Clark",
               "profile_path": null,
               "id": 115754,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a186cc3a3680ab8000d28",
               "name": "Milt Kahl",
               "profile_path": "/olKWgwkVShdJnRJRZ4Po6uK0iq6.jpg",
               "id": 138170,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "565a2241c3a3680abe000f20",
               "name": "Ollie Johnston",
               "profile_path": "/76RFwErmaMm7tx8OHFU0eYCvMMr.jpg",
               "id": 143786,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "565a27dbc3a3680abb000fb1",
               "name": "John Lounsbery",
               "profile_path": "/5iwFX8llmSfEudddEXO8BGczdTs.jpg",
               "id": 69003,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "565c6e58c3a368508100829a",
               "name": "Marc Davis",
               "profile_path": "/lFkKN6Z1NIfk0ToZzQcmNfV7kL1.jpg",
               "id": 150111,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "565dcf88c3a3687cf10027c3",
               "name": "Mary Blair",
               "profile_path": "/vf3PzRot9sDJq7j884RnhTf25yj.jpg",
               "id": 77612,
               "department": "Art",
               "job": "Conceptual Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 6.657969,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13850,
      "vote_count": 85,
      "budget": 0,
      "overview": "Uncle Remus draws upon his tales of Brer Rabbit to help little Johnny deal with his confusion over his parents' separation as well as his new life on the plantation.",
      "similar": [
         152737,
         12498,
         480482,
         72881,
         265856,
         255620,
         87774,
         110299,
         124850,
         265090,
         498776
      ],
      "original_title": "Song of the South",
      "runtime": 91,
      "poster_path": "/opZPxPXF52M3ZZcQ0zGip9p5Vri.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1946-11-12",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Here Comes The Zip-A-Dee-Doo-Dah Show!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Wilfred Jackson",
         "Harve Foster"
      ],
      "runtime": 94,
      "synopsis": "In the late nineteenth century, newspaperman John and his wife Sally travel from their home in Atlanta to the rural plantation of Sally's mother, Miss Doshy, accompanied by their young son Johnny and his black nursemaid, Aunt Tempy. Johnny is excited about meeting Uncle Remus, a legendary black storyteller who amused John and Sally during their childhood, but is confused by his parents' anger toward each other. John, whose controversial writings have strained his marriage, returns to Atlanta alone, and Sally remains at the plantation with Johnny. Hurt by what he perceives as his father's desertion of him, Johnny sneaks out of the house with the intention of running away. As he walks along, Johnny finds the elderly Uncle Remus telling stories to a group of black children. Johnny stops to listen but runs off when Tempy and another servant, Chloe, come looking for him. Remus catches Johnny in the woods and agrees to run away to Atlanta with him, but insists on stopping at his cabin for provisions. While there, Remus tells Johnny a story of Brer Rabbit, who also tried to run away despite Remus' warning that there is no place far away enough to escape trouble: Brer Rabbit is captured by Brer Fox and Brer Bear, who intend to make a tasty meal of him, but the rabbit easily outwits them, escapes and returns to his briar patch. Strengthened by the story's moral, Johnny goes home with Toby, the young black servant assigned to look after him. Sally is devastated by his attempt to run away, however, and unfairly blames his behavior on Uncle Remus. Later, Sally orders Johnny to wear a suit with a lace collar, and while the boy wanders about miserably, he is taunted by Joe and Jake Favers, poor white youngsters who are threatening to drown their sister Ginny's puppy. Ginny and Johnny become friends, and she gives him the puppy, Teenchie. Sally refuses to let him keep the puppy, however, and orders him to return it. Instead, Johnny takes Teenchie to Uncle Remus, who agrees to keep it for him, but the next day, the Favers boys threaten Johnny with violence unless he returns the puppy. Uncle Remus tells the distressed Johnny about the time Brer Fox and Brer Bear used a tar baby to trap Brer Rabbit, but were once again outwitted by Brer Rabbit, who begged them not to fling him into the briar patch. Johnny uses the lesson of reverse psychology to get the Favers boys to complain to their mother about the puppy, and Mrs. Favers gives them a sound whipping. The angry boys then tell Sally their story, and Sally accuses Uncle Remus of \"warping\" Johnny with his stories and orders him to stop telling them to her son. Heartbroken, Uncle Remus returns Teenchie to the Favers boys, then roughly tells Johnny to leave him alone. A week later, Sally throws a birthday party for Johnny and allows him to invite Ginny, despite her misgivings about Ginny's humble upbringing. Johnny happily skips to Ginny's house, but her brothers muddy her only good dress. After fighting with the boys and becoming disheveled himself, Johnny tries to placate Ginny but only makes her cry more. Uncle Remus cannot resist comforting the children with a story and tells them about the time Brer Rabbit again freed himself from the clutches of Brer Fox and Brer Bear by leading them to his \"laughing place.\" The wise old man informs the children that everyone has a laughing place, and when they run off to look for theirs, Sally finds them and chastises them for missing the party. Sally then upbraids Uncle Remus and orders him to stay away from Johnny completely. The old man decides that he is of no use anymore and, after packing his few belongings, prepares to depart. Johnny, who has realized that Uncle Remus' cabin is his laughing place, sees his friend leaving and cuts through a field to stop him. The bull in the field chases Johnny and knocks him down, and the unconscious child is rushed to the plantation house. John immediately comes down from Atlanta, but even his presence does not help his delirious son, who calls for Uncle Remus. Miss Doshy sends for him, and as Uncle Remus holds Johnny's hand and tells him another story, the child revives. Finally realizing that they must set aside their problems for the sake of their son, John and Sally decide to stay at the plantation. Later, Uncle Remus contentedly watches Johnny, Ginny and Toby play with Teenchie. He is amazed to see Brer Rabbit and his other story folk join the children, but soon runs after them and enters their joyous world.",
      "writers": [
         "Joel Chandler Harris",
         "Dalton S. Reymond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038969/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NjA4Nzg2MF5BMl5BanBnXkFtZTcwNjE0NTg5Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ruth Warrick, Bobby Driscoll, James Baskett | See full cast and crew »"],
      "reviews": [
         "For its time, a time when segregation was still aggressively enforced in the United States, 'Song of the South' was likely a progressive film, a major family film many of whose main characters were black, and whose animated characters were voiced by a black performer. Now, of course, 'Song of the South' is considered problematic due to its depiction of black slaves as happy and complacent, and its portrayal of them as Uncle Tom stereotypes. Look closer, however, and you'll see a fine family film, warmhearted and gentle, both a technical landmark and a dazzling series of fables as told by Uncle Remus, the movie itself serving up a number of its own morals -- like the fact that a parent's good intentions can unwittingly stifle their child, or that storytelling is key to one's moral and social development. None of this matters, of course. Walt Disney has now chosen to ignore the film on the basis of its reportedly offensive depiction of African-Americans in the post-Civil War era. For one, this film was not intended as propaganda or considered offensive at the time, and was merely the product of American perceptions of the 1940s; it's not any worse than the scores of westerns that depicted Native Americans as savage Injuns. Of course, Native Americans were and continue to be a marginalized group while African-Americans have maintained a desire to assimilate and have. Being that African-Americans have been far more vocal in their rejection of the injustices committed against them, it goes without saying that white-on-black bigotry is a far more sensitive issue than white-on-Indian bigotry (despite the fact that the Native Americans have suffered just as greatly at the hand of The Man as African-Americans), and therefore, we're less willing to excuse movies like 'Song of the South' than we are films like 'The Searchers.' But then why is 'Gone With the Wind' still given the green-light and not 'Song of the South'? Well, the answer is simple: The Walt Disney Corporation. Walt Disney will go to any length to keep its reputation clean, and 'Song of the South' is construed as a serious threat to it -- therefore, placing the film on moratorium and making it unavailable simply deters controversy. They can't undo it, but they can certainly hide it. It matters not the value of the film. In a heartbeat, Disney would withdraw something as beloved as the 'The Little Mermaid' if it were one day decided that the film was unfair or offensive in its depiction of mermaids. In 'Song of the South,' one sees an innocence and warmth. In current Disney films, one sees a lot more of the cynicism and calculation of a soulless capitalistic corporate entity. The depiction of blacks in current cinema is a lot more shameful and offensive than anything in 'Song of the South.' Consider personalities like Chris Tucker, Martin Lawrence, and films such as 'Phat Beach' and 'Friday,' which depict African-Americans as lazy, dope-smoking ne'er-do-wells who treat women badly and have no morals. I guess the fact that these films are largely created by African-Americans for African-American audiences gives them a dubious seal of authenticity, being that African-American entertainers are, ostensibly, no longer being exploited by the white man and have developed their own independent voice. If that's true, why is it so much more difficult for black filmmakers such as Charles Burnett and Julie Dash, filmmakers with a truly independent voice, to either find financing for their films, or be met with commercial acceptance? 'Song of the South' might be inaccurate in its depiction of slavery, but it never makes a point of being *about* slavery, and it's no more inaccurate than hundreds of Hollywood's historical epics and costume dramas. By making 'Song of the South' unavailable, Disney is doing a disservice to those involved in the film and, more importantly, to the millions who harbor fond memories of it.",
         "This film will never receive a clean bill of political correctness, but neither will any film made before the 1960s. In fact, Song of the South presents some of the least offensive portraits of African Americans you can find from the time. If you really need to compare, go find any other film starring Hattie McDaniel \u0096 start with Gone With the Wind \u0096 and note how much more dignity she has in the Disney movie. Uncle Remus (James Baskett, who is utterly, utterly exceptional) is perhaps the most charming character you'll find. He's much more stereotypical of an elderly man than a black man. A smart man with strong morals and a clever way of delivering them, he seems to see things more clearly than anyone else in the film. No, Uncle Remus is a kind man who loves humanity, and this love is infectious. The movie made me very happy to be alive. A more politically correct version of the film would have him rebelling against white society with violence. It's kind of sad that we can't abide blacks and whites actually getting along, preaching brotherhood. The live action bits are very good (although I think Bobby Driscoll is a bit weak in the lead), but it is the animated pieces (and the live action/animation sequences) that make Song of the South great. Br'er Rabbit, Fox, and Bear are wonderful characters, and these three segments represent some of the best animation Disney ever did. The mixed scenes are amazing (was this the first time it was done?). I especially liked when Uncle Remus went fishing with Br'er Frog. Uncle Remus lights his pipe with an animated flame, and blows an animated smoke ring that turns into a square (which is, of course, also politically incorrect). I suspect that the biggest reason this film stirs so many negative emotions is the black dialect used in the film. I think that bugs people a lot. Really, though, blacks from the rural South have and have had their own accents and ways of speaking just as they have and have had in any other region. While the accents in this film are somewhat fabricated, I'm sure, I think that it would be a far cry to think of them as harmful to anybody. The hurt that people feel over this movie is the real fabrication, induced by PC thugs who seem to want to cause rifts between peoples. I think that a re-release of Song of the South could possibly have a beneficial effect on race relations in the United States, as it does depict dear friendships and respect between the races, something that I think we quite need at the moment.",
         "I recently viewed 'Song of the South' after not having seen it for at least 15 years if not longer. The last time that I had seen this wonderful family film was when I was around nine years old during one of its several theatrical re-issues in the early 1980's. OK, some say that this film is politically incorrect. No, it isn't. Let me explain and let's look at the positive messages before jumping to conclusions please: This film is not ABOUT SLAVERY. It is a film that has slavery in it, yes, but it is not the subject of the film. The subject of the film is the friendship between an elderly kind man (he's a African-American!!!!) and a nice little boy (he's Caucasian!) This little boy looks up to Uncle Remus as if Remus is god-like. For a 1946 film to treat a subject in this way is commendable. Tell you what if you want to get angry at a film try a myriad of other 1940's films and see the negative portrayals of black actors in them; you'll find none of that here. At all. My opinion and quite frankly a truthful one. Now, enough with the 2004 cynical comments and on with the show. I will say this right now: It is deplorable that Disney has not released this film when movies like 'Gone With The Wind' and 'The Charlie Chan Collection' are being released by major studios with disclaimers, etc. dealing with the views of some political groups who get their shorts in an uproar over the most benign issues and should focus their powers elsewhere and leave a beloved family film with a great message alone. This film has several genuinely touching moments that culminate in the innovative technique of combing animation (the amazing 'Brer Rabbit sequences) with live-action actors. Disney was the George Lucas of his day and he has managed to do what some have thought lacking in the recent Star Wars films; connect to an audience with animated characters! There's heart and soul in this film. Bottom line--Disney, a good company, is depriving itself of a goldmine because people are still paying to get copies of this film from outside resources and would gladly plunk down hard-earned ca$h for an anniversary edition, with as many disclaimers as Disney would like to stamp on it, make it a net-exclusive or something...it's depressing to think that this will never be released on video here in the United States. Really, what is the worse that would happen? There'd be a minor stink and then guess what? I'd have 'Song of The South' on my DVD shelf along with other lovers of great films and we'd all move on to the next thing and have a zip-a-dee-doo-dah Day!",
         "...Or, Queuing Up At The Outlaw Cinema. In China and Saudi Arabia, the government has absolute and frightening authority to bury whatever films or music or publications it considers unacceptable. In the dollar-driven U.S., we let cowardly mega-corporations (which either can't blow their nose without ten rounds of focus groups pummeling the life out of what may have been a decent idea once, or are run by megalomaniacs who attend to every detail of everything, whether they are capable or not) suppress our art for us. So while I guess it's par for the course that the studio that financed Song of the South is scared to death to touch this film, and in fact refuses to acknowledge that it exists, this situation leaves me wondering whether this means that those focus group studies held in South Central L.A. didn't turn out like they planned. \u0096 Or is the \"they\" who buried this film The Big E himself? Anybody? Let me spell out the specifics of this despised and incendiary censored object: It is good-hearted and sweet in the extreme. It was lovingly crafted to be a sentimental family film in a time that was far more hospitable to sentimental, family-oriented entertainment than we are today. But the acid test that it passes, for me, is that as you watch it, you find yourself wanting to be Remus. \u0096 Or to be a person with the stature, the imagination and the moral strength of Remus. He's lovable, wise, good, and possessed of immense natural wit. He has the smartest way with words of any film character of the 40s. James Basket is absolutely brilliant. His Remus is fully endowed with dignity, warmth and depth, even more so than most characters in mainstream films of this period. Oh the humanity! How dare they put out something like this!? Seeing it for the first time in 2004, you will likely be stunned that some bumbling corporate bureaucrats have decided that you shouldn't see this. The part that gives these people a problem is, I am guessing, that ex-slaves ('ex' because this is well after the Civil War) are shown here as (outwardly) well-adjusted people. This is kept off to the side, depicted (or really NOT depicted) by mostly dark, atmosphere-setting, long shot scenes of itinerant laborers ambling toward the work field, group-singing or sitting around fires, singing and telling stories. The fact that they are not on-their-sleeve embittered revolutionaries/guerrillas is apparently the deal-breaker for the PC inclined. I give this film ten stars. (For the record, I got my copy of this film from on line, in a sparkling-clean D.V.D. transfer. They're out there, and well worth your bargain dollar. Just watch who you buy from.)",
         "When I was about five years old, I saw this film with my older cousins who were in their twenties at the time and I don't remember hearing them saying anything negative about it. This is ironic, because I am African-American. Everyone must remember that this film was released in the 1940's before the civil rights movement and before \"Roots\". Now because of political correctness, we have all but forgotten this classic film, which was one of the first to combine live action and animation. Even though I do agree that this film does show slavery in a positive light you also should look at the fact that it dared to show the friendship between an African-American and a Caucasian, something that would never have even been thought about in those days. Next thing you know, someone might get the bright idea to ban \"The Cosby Show\" because it supposedly doesn't portray how the average black person really lives.",
         "When the marriage of his parents goes through a crisis, Johnny (Bobby Driscoll) moves with his mom to the Southern mansion of his grandmother. Distraught over the absence of his father, he strikes up a friendship with Uncle Remus (James Baskett), an old black man who tells him stories of rabbits, foxes and bears. Driscoll is obnoxiously cute, but James Baskett delivers a fine performance as Remus and the animated sections with Br'er Rabbit are fun. But is it racist? Well, it has no overt depictions of racism and therein lies the problem: Song of the South presents life in the Southern states after the civil war as idyllic and harmonious, a place where white people live in their mansions, black people in their cabins, everybody knows their place and is happy in it. \"Yes sir, things are lookin' mighty satisfactual\" says Uncle Remus and his Br'er Rabbit stories convey the same social conservatism: leaving your home (to a non-segregated North for instance) is pointless because \"You can't run away from trouble. There ain't no place that far.\" This movie can't imagine a single reason why a black man living in the post-slavery South wouldn't be happy with the way things were. Yet, these are the gripes of an adult and Song of the South is a children's film. With our modern-day knowledge of American history, it's obvious that the film is far removed from harsh reality, but can you really blame a kiddie-movie for presenting a fantasy-world? It is a musical with animated sequences, does it make sense to demand or expect realism? The stories and songs, however sanitized and Disney-fied they may be, are based on Afro-American folk-tales and music, which means that the movie at least acknowledges the existence of an Afro-American culture. That's actually an improvement over Gone With the Wind. Song of the South certainly has its faults, but I find Disney's self-censorship misplaced: at its simplest, most basic level, this is a movie about a white kid befriending a black man who is portrayed as intelligent, compassionate and kind. How harmful could that be?",
         "I think it's a great shame that the 1946 Walt Disney classic, \"Song Of The South,\" has been banned in the U.S. because some civil rights groups **15 years ago** complained that the movie was racist and they did not want it to be shown anymore. And Disney, not wanting to offend anyone, bowed down to their demands and yanked the film from public viewing in North America, where it has not been seen since. The only way you can watch \"Song Of The South\" now is if you still own a laserdisc player and you're willing to spring for a costly Japanese import disc, OR if you manage to track down a UK VHS copy of the film released in 1997 and have it transferred. Well, having viewed a transferred VHS copy of \"Song Of The South\" recently, I can honestly say that this is a marvelous Disney movie that is NOT racist and does NOT deserve to be hidden away. While I can certainly understand the concerns of the civil rights groups over \"Song Of The South,\" the fact that the movie is set during the turn-of-the-century South when many blacks served subservient roles is NOT a good enough reason to hide the film away from the public. This is not an issue of racism, it is simply a historical fact. Furthermore, the black characters in \"Song Of The South\" are all treated with respect. They are not treated badly, nor are they spoken to badly. Further still, are we going to destroy all copies of \"Gone With The Wind\" just because it features a black maid? Think about it. What also upsets me about the shunning of \"Song Of The South\" in the U.S. is that most Americans will now never get to see anymore the marvelous performance of James Baskett as the loveable storyteller Uncle Remus (and Baskett DID win an Honorary Oscar for his fine work in this film, lest we forget). Nor will Americans ever get to see again the wonderful Disney artistry on display in \"Song Of The South\" that perfectly blends live action with animation (the very first film to do so, if I'm not mistaken). They won't get to enjoy the hilarious adventures of Brer Rabbit ever again. Nor will they be able to sing along with the Oscar-winning song, \"Zip-A-Dee-Doo-Dah\" anymore. All of this, in my opinion, is very, very shameful. I strongly implore Walt Disney Productions to reconsider re-issuing \"Song Of The South\" in North America, if *only* for a limited time on home video, so anybody Stateside who wants the film can finally have it. And with all due respect to the civil rights groups who complained about \"Song Of The South\" back in 1986, I strongly implore them to seriously rethink the ban that they had Disney place upon the film. On the Grammy telecast this past year, just before mega-controversial rapper Eminem took the stage to perform \"Stan,\" the Grammy president came onstage to give a little pep talk about freedom of speech & freedom of expression. He said that we cannot ban certain artists and their work just because it makes certain people uncomfortable. The EXACT same thing can be said for Walt Disney's \"Song Of The South.\"",
         "Song of the South is a beautiful piece of film art. I acknowledge that some of the scenes are ignorant towards the plight of African Americans in the Civil War and Reconstruction era but I can't imagine a child who loves this movie coming away feeling racial prejudice or insensitivity towards African Americans. We should remember that this is a children's film and generally, people are happy in Disney movies. Should Birth of a Nation be banned because it champions the KKK? Of course not. We learn from our mistakes in the appreciation of our past. This isn't Nazi Germany. It was an Oscar winning film for petes sake. Please release Song of the South now.",
         "I saw this on one of it's re-releases when I was very young and it has stayed with me. It is one of Disney's best efforts and I'd love to see it again. Unfortunately, Disney is loathe to offend anyone and it therefore seems that this film will be consigned to the vaults because Disney is unwilling to risk any heat. It's too bad, because the film teachs tolerance among other lessons. Recommended, if you can see it at all.",
         "Song of the South is a beautiful film, with fine values -- fine moral values as well as exceptional production values. The animation is state of the art, the songs humable - Zip-A-Dee-Doo-Dah is a classic. But many Black people find it painful to watch, painful to the extent that Disney fears a boycott of its other films if it releases this one. Corporations are in the business of making money -- not art. We are lucky when art is an incidental by product, as it is in this case. The DVD I watched is from Buddha Video Co in Taiwan. Their telephone number if 886-2-2571337. Unlike some VHS releases, the Chinese subtitles can be turned off. The company logo appears briefly but annoyingly in several scenes, but that is a minor irritation. The transfer is better than VHS, though far from the pristine transfer we can wish far, in a happier time, when the old racial hate becomes as remote as the wars between Athens and Sparta. The box has a professional look -- the only strange thing is the absence of any mention of Walt Disney. Of course, I cannot view this film the way a Black person would, but I hope that Black viewers at least realize both the good intent and the good effect this movie had. Evidentally not all do -- there are posts to this board that accuse the film of racism. It is obvious to anyone who lived though real racism that the message of the film is one of respect. When I first saw the movie, I was a young white boy growing up in the Deep South, and I think this movie, and movies like it, led me to reject the racism of the adults around me. In much the same way, the TV show \"I Spy\" opened the minds of the generation that came after mine. The potential to offend is in all great art, and the offended are often moved to try to suppress what causes them pain. Song of the South is in the same class with Huckleberry Finn, Showboat, Gone With the Wind, and The African Queen -- offensive to some, loved by many, good in both intent and effect on society, but unacceptable today to those who do not want to be reminded of the truth about the past. Modern films, which invariably show Black people in the past as able to treat all whites like equals and not get lynched, are pure fantasy, but they are a fantasy that those who would rather forget history demand. But there were many close friendships across racial lines. Friendships such as the one shown in Song of the South between the grandmother and Uncle Remus did happen. One final comment, addressed to those who wish the horrors of Reconstruction were explicit in the film -- there are horrors enough hovering around the edges. The father, for example, is clearly risking his life by publishing a progressive newspaper in Atlanta. The mother, while she is not a racist, looks down on the \"lower class\". But these things are, rightly, kept to one side. This is a children's film, after all, about love, intelligence, and the healing power stories."
      ],
      "genres": [
         "Animation",
         "Family",
         "Music"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Uncle Remus draws upon his tales of Brer Rabbit to help little Johnny deal his confusion over his parents' separation as well as his new life on the plantation. The tales: The Briar Patch, The Tar Baby and Brer Rabbit's Laughing place.",
         "The kindly story-teller Uncle Remus tells a young boy stories about trickster Br'er Rabbit, who outwits Br'er Fox and slow-witted Br'er Bear."
      ],
      "budget": 0
   },
   "movielensId": 2099,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1946-11-12",
      "dvdReleaseDate": null,
      "directors": [
         "Harve Foster",
         "Wilfred Jackson"
      ],
      "runtime": 91,
      "movieId": 2099,
      "title": "Song of the South",
      "mpaa": "G",
      "actors": [
         "Ruth Warrick",
         "Bobby Driscoll",
         "James Baskett",
         "Luana Patten",
         "Lucile Watson",
         "Hattie McDaniel",
         "Erik Rolf",
         "Glenn Leedy",
         "Mary Field",
         "Anita Brown",
         "Georgie Nokes",
         "Gene Holland",
         "Nick Stewart",
         "Johnny Lee"
      ],
      "imdbMovieId": "0038969",
      "originalTitle": "Song of the South",
      "genres": [
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": [
         "IjP0DhXhv74",
         "G1qeHIfJH3A"
      ],
      "plotSummary": "Uncle Remus draws upon his tales of Brer Rabbit to help little Johnny deal with his confusion over his parents' separation as well as his new life on the plantation.",
      "tmdbMovieId": 13850,
      "avgRating": 3.58937,
      "releaseYear": "1946",
      "numRatings": 1505,
      "posterPath": "/opZPxPXF52M3ZZcQ0zGip9p5Vri.jpg"
   }
}