{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "opium",
            "id": 1632
         },
         {
            "name": "loss of eyesight",
            "id": 2490
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "sioux",
            "id": 8099
         },
         {
            "name": "wild bill hickok",
            "id": 180234
         },
         {
            "name": "calamity jane",
            "id": 190970
         }
      ],
      "imdb_id": "tt0114938",
      "video": false,
      "title": "Wild Bill",
      "recommendations": [
         40480,
         42500,
         240634,
         73247,
         27984,
         39787,
         139408,
         17629,
         30798,
         40454,
         48740,
         45928,
         95764,
         25576,
         19380,
         38107,
         49427,
         56931,
         12488,
         37412
      ],
      "backdrop_path": "/21QdOI1JIhJrdpaWxQfSLGEizHe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "James Butler 'Wild Bill' Hickok",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b520d",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Calamity Jane",
               "gender": 1,
               "credit_id": "52fe471ac3a368484e0b5211",
               "name": "Ellen Barkin",
               "profile_path": "/i4WSy0da6KaA3xvETtXqZtUMoRP.jpg",
               "id": 6913,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Charley Prince",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b5215",
               "name": "John Hurt",
               "profile_path": "/rpuH2YRLpxJjMxHq4T1QdOSVtlN.jpg",
               "id": 5049,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Susannah Moore",
               "gender": 1,
               "credit_id": "52fe471ac3a368484e0b5219",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Buffalo Bill Cody",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b521d",
               "name": "Keith Carradine",
               "profile_path": "/b2GbGSrgb6twTdjfvUK4y0WrIjx.jpg",
               "id": 30613,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jack McCall",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b5221",
               "name": "David Arquette",
               "profile_path": "/p5l4pnL9xhbHiKSipcdsCekoD52.jpg",
               "id": 15234,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Lurline Newcomb",
               "gender": 1,
               "credit_id": "52fe471ac3a368484e0b5225",
               "name": "Christina Applegate",
               "profile_path": "/irUHUE17vDaSSYsOOJAxnHyEiSo.jpg",
               "id": 18979,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Will Plummer",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b5229",
               "name": "Bruce Dern",
               "profile_path": "/fYhCiXGBARWUevnWDkeCEpwi4h4.jpg",
               "id": 6905,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "California Joe",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b522d",
               "name": "James Gammon",
               "profile_path": "/4oTidbjDQ8XU3LHot249SMlVLn4.jpg",
               "id": 16433,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Preacher",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b5231",
               "name": "Marjoe Gortner",
               "profile_path": "/erkvUkK0SMTAyhoyvqzlTxPebme.jpg",
               "id": 88163,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Donnie Lonigan",
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b5235",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe471ac3a368484e0b5209",
               "name": "Walter Hill",
               "profile_path": "/gCU3dgnNaZuvmArtBJgjCUMmimd.jpg",
               "id": 1723,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "546107e70e0a2672bc000321",
               "name": "Walter Hill",
               "profile_path": "/gCU3dgnNaZuvmArtBJgjCUMmimd.jpg",
               "id": 1723,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 4.139677,
      "production_countries": [],
      "id": 65796,
      "vote_count": 35,
      "budget": 30000000,
      "overview": "Biopic about famous gunslinger Wild Bill Hickock. The early career of legendary lawman is telescoped and culminates in his relocation in Deadwood and a reunion with Calamity Jane.",
      "similar": [
         323677,
         300671,
         462,
         640,
         769,
         5915,
         11202,
         371638,
         276907,
         324786,
         363676,
         389015,
         407445,
         318846,
         396371,
         228970,
         274479,
         152532,
         152792,
         328589
      ],
      "original_title": "Wild Bill",
      "runtime": 98,
      "poster_path": "/qIgslXL0NDtSlcHxISACLwWbkRJ.jpg",
      "spoken_languages": [
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "United Artists",
         "id": 60,
         "origin_country": ""
      }],
      "release_date": "1995-12-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The Name Is Legendary. The Man Is Real.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Walter Hill"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Peter Dexter",
         "Thomas Babe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114938/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI0MjI4NDkyOF5BMl5BanBnXkFtZTcwNzQ0NTg3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jeff Bridges, Ellen Barkin, John Hurt | See full cast and crew »"],
      "reviews": [
         "If there was ever a psychedelic western movie, this has to be it. It's so bizarre, at least compared to most westerns, that it was tough for me to write this review. I stopped and re-started several times. Where to start? I just found it great fun, an entertaining film that's always a kick to view, and what more you can ask? Being someone who is very much into visuals, great cinematography and unique approaches to camera-work, this film provided all of that and more, such as an interesting story with whacked-out characters. I love narration and John Hurt's description of the goings-on here was just great to hear. He played \"Charlie,\" an Englishman with a gentleman's vocabulary that was in stark contrast to the hardened outlaws, led by 'Wild Bill' Hickok himself, played by Jeff Bridges. Ellen Barkin plays \"Calamity Jane,\" and few women of the 1980s and '90s played foul-mouthed, hard-but-sexy women as convincingly as Barkin. In addition to Hurt, Bridges and Barkin, other fun characters included \"California Joe,\" Hickok's gravel-voiced friend who doesn't say much but when he does, you hear some some of the longest sentences ever uttered. Daid Arquette plays a very strange villain, the man who became famous for shooting Wild Bill. He acts strange and talks as if he has a mouthful of marbles. James Remar, another mean-looking tough guy, is a hired killer. Christina Applegate, Bruce Dern, Margoe Gortner, Keith Carradine and assorted other characters all add to this strange tale, strange in its telling and even stranger in its visual style. Some of the film is in flashback, which is seen in startling black-and-white and mainly features Diane Lane, who is flat-out gorgeous and maybe the most intriguing person in the film. One of the flashbacks has the film deliberately overexposed with wild dream-like images. No western \"purist\" admits to liking this but I love the genre and I put this near the top of my list of favorite westerns. So, sue me!",
         "Making a movie about a legend is a tricky situation; it is worse when the pages of history are filled with myth. There is no doubt that 'Wild Bill' Hickok was a lawman, gunman and Western legend. There is the problem. He was so famous that numerous sources sought to make their fortunes on stories embellished for sales. The most notable was the \"dime novel.\" The makers of this movie did as good a job as anyone has it trying to tell the true story of this legend. There are scenes not found in Bill's history, but they are historical for the time. The classic Western model is not in play. Indians, Chinese, black cowboys, ... etc are muti-dimensional characters. The added scenes flow the story and add depth. Even with numerous flash backs the story flows well. Jeff Bridges as \"James Butler 'Wild Bill' Hickok\" and Ellen Barkin \" as \"Calamity Jane\" do great jobs with the main characters. Bridges while in costume actually resembles the pictures of the real \"Wild Bill.\" The romantic relationship between these Western notables and its development is well done. The interplay sets this movie apart from most Westerns, and adds appeal to those who might not be Western fans. Two of the best pieces of acting are by actors with smaller parts in the film. Watch for Keith Carradine as \"Buffalo Bill Cody\" and John Hurt as \"Charley Prince,\" Bill's friend and the character narrating the film. James Gammon (I) does a good character role as \"California Joe.\" If you like Western history, this is a great film. If you want a classic Western flick and non-stop action, you may find it slow. For anything more accurate you'll need to go the library; to date, this is the best film on Hickok.",
         "\"The hardest steel is forged in the hottest fires...\" The Wild West in the years following The Civil War must've been very close to the West as Walter Hill envisions it here; if not in fact, then most certainly in tone. Life was cheap: pick up any one of the magazines or books devoted to same and take a gander at the bodies on display in storefronts and on boardwalks (or laid out in the sun, or dangling from the limbs of trees). The man who walked away from a gunfight was the man who got there first with the most. He what hesitated, was lost. Jeff Bridges as WILD BILL is a man with a hair-trigger; he HAD to be. (Otherwise, he would've been BELLY-UP BILL, and a lot less interesting.) He literally fights- with fists or with guns- at the drop of a hat. Not the kind of man you take lightly. He drowns his sorrows in booze and pipes and the black and white flashbacks (with the camera canted just enough to suggest an off-kilter dream state) are great. See this one because you like hard-hitting, no-nonsense westerns or because you prefer superior craftsmanship- but SEE it; to miss it would be to pass up one of the finest westerns to ever come thunderin' down the trail.",
         "I wasn't expecting much from this one, but Walter Hill's direction credit during the opening title sequence sucked me in - and I was glad it did. A very capable cast and an interesting cinematic style gave this film a unique flavor, although some of the characters bordered on unbelievable at times. Loved the interaction between Wild Bill and Calamity Jane on the saloon table, although the conversation seemed too modern for the late 1800s. But overall, the film was a great way to spend a Sunday afternoon, especially when compared with some of the lesser films available at the time.",
         "I've been checking out the comments on this film and they seem to be in line with most of the other reactions I've heard. It's important to say up front that this is not a film for Western fans. It's not a film for action fans. It's not for history buffs who care only about the facts. It's not a film for people who want to see a good story told simply. Wild Bill is one of the richest and most disturbing films ever made about the American West. It shows us a complicated man without trying to explain or rationalize the contradictions in his character. He's capable of love, but he also commits acts of brutal violence. He cares for his friends but he holds them all at arm's length. And he feels compelled to play the part of the living legend to the end, come what may. I suspect that Walter Hill chose this subject because he identified strongly with Wild Bill himself. But whether or not this is true, the contradictions in Hickok's character are a part of this country's character. Hill was lucky to have Jeff Bridges in the lead. It's one of his finest performances. Though Wild Bill doesn't voice doubts about his life out loud, Bridges' face shows us that he doesn't understand himself the reasons for many of his actions. The story is not told in chronological order, but the organization of the sequences is not haphazard. In fact it's beautifully thought out. This is not a film for everybody, but I think it deserves a lot more attention than it's gotten so far. I feel like fans of Walter Hill's work will see the same thing I do: a beautiful and haunting meditation on why this country is the way it is.",
         "The Wild West grew out of myth and partially true folklore. Hollywood grew for the same reasons. Put the two together to construct a story about the last days of Wild Bill and what do you get? Well\u0085you get something that's exciting, brutal, nasty and short \u0096 and very little of it truthful. Walter Hill is one of Tinsel Town's better producer/directors, no question; and his experience at producing great thrillers (like the Alien series) serves him (and the viewer) well. Because this is a thrilling tale: of a man who was in fact a legend in his own time (like Buffalo Bill, Billy the Kid, Butch Cassidy and many others), and of a man who obviously didn't relate too well with people in general. Maybe Wild Bill thought that he'd been dealt a raw deal from day one? Who knows...? And that's the upside of this narrative as well as its Achilles Heel \u0096 because if you read the history of Wild Bill, you'll find that most of this film is pure fiction. Trouble is, most of what you read about Wild Bill is pure fiction, also. And the sources I researched admit it: nobody knows the real truth about how Wild Bill died EXCEPT he did die while playing poker in a saloon. Beyond that, all else, it appears, is up for grabs \u0096 which means that any writer/producer can develop a story that provides a reasonable probability of what might have happened. So, don't pay any heed to reality in this film, beyond the very detailed settings, props, costumes, accents, language \u0096 the general mise-en-scene. The story, some of which is told in flashback, is generally fast-paced, with the possible exception of when Bill visits the Chinese opium dens in Deadwood for some light relief, shall I say? But, those episodes also give the director/cinematography the opportunity to play around with camera angles, shimmering scenes, and such like. What I particularly liked about this movie were the scenes of mid-nineteenth century small towns across USA. Those images compare very well with genuine photos I've seen of that time, particularly those of Deadwood. So, hats off to the production team for those flawless settings, arguably the best I've seen on film to date. In fact, this film is worth seeing for that alone. In contrast, there's a major error that is just unforgivable, considering the overall standard of the production: in the final battle scene between Wild Bill and five tough bounty hunters, Bill shoots them all dead with his two revolvers, both of which looked like 1858 or 1861 Remingtons. Those guns are six-shooters. In the gun battle, Wild Bill shoots at least sixteen shots, and maybe eighteen, all without reloading! Don't worry \u0096 I checked it by counting those shots, again and again, while going through the battle slowly. What a shame that goof wasn't caught before the film was released... However, the cast is great, particularly Jeff Bridges and John Hurt (as the fictional character, Charley Prince, invented for narrative purposes), both of whom are ably supported by Ellen Barkin as Calamity Jane and David Arquette as Jack McCall. Jeff Bridges must be highlighted for special mention: his costumes and general manner look stunningly true to life when compared with real photos of that long dead gunfighter. As a piece of history, forget it. As rip-snorting entertainment, go see it, especially if you love the Western genre. Highly recommended.",
         "Historians may scoff, but Walter Hill's \"Wild Bill\" is an absorbing and intriguing western with elegiac overtures yet much of the emphasis placed on the battles. Jeff Bridges does a fine job as scruffy, mangy, weathered James Butler Hickok in the 1870s Midwest, getting into brutal fights while doing nothing more than standing at a bar (John Hurt's narration tells us, \"Being 'Wild' Bill was in itself a profession.\"). Ellen Barkin plays Calamity Jane like a lovestruck toughie who clucks behind Hickok, waiting for a commitment; David Arquette is Jack McCall, a young man defending the honor of his mother, whom Hickok loved and left. Occasionally, director Hill hits a stumbling block (there's an inconsequential bit with Keith Carradine as Buffalo Bill Cody which disconnects the mood, and also a black-and-white flashback filmed in high-contrast where Hickok attempts to talk sensibly with a no-nonsense Indian tribe). Still, the hand and gun bouts are fully charged with adrenaline, and there's a genuine feel for these sad, meandering people that recalls strong sections from other westerns, particularly \"McCabe and Mrs. Miller\". A bumpy film, but not a bad one at all. **1/2 from ****",
         "This could have been great, but there are two big problems, Ellen Barkin cast as Calamity Jane, and worst of all, the idea that Jack Macall couldn't bring himself to pull the trigger when he TWICE had the opportunity. Hill's \"Long Riders\" is miles ahead of this film, although this is not all bad, Bridge's performance is excellent as are many other supporting roles. I found the John Hurt character a typical John Hurt 19th century character which he did best in Cimino's \"Heaven's Gate\". Here he takes the place of real life Charlie Utter for reasons I don't understand. Barkin is so miscast that it almost hurts, her imitation of an southern accent is so close to a crime against humanity that she should at least pay a fine, and no woman looking like Ms. Barkin living in a town like Deadwood would be as clean and pretty as she always seems to be. Her bubbly, sweetness is also more than misplaced. You can bet your gold nugget that the studio needed a love interest who would show her birthday suit, I would well hope that Hill was not responsible for her character or role. Hickock's killer is a much more believable character in the excellent HBO \"Deadwood, here he's a whiny, indecisive jerk which makes it hard to believe that he was raised by the woman who captured Hickock's heart long before. Lastly, the set design in this film was too \"westerny\", the bars are polished, the woodwork is excellent, the furnishings are expensive, etc. Deadwood was a gold mining camp that sprung up over night, this looks like a standard movie town for westerns despite the muddy streets. The excellent book by Dexter is done a disservice by this film and it is quite interesting to see what Hill did with the same story 9 years later in the pilot episode of \"Deadwood\". Watching both is a learning experience.",
         "Now I'm not going to go into a tirade how inaccurate the movie was historically, but you'd think with the cast they had paid damned good money to take part in the movie that they would have found a way to tell Wild Bill's story in a more factual yet exciting way that keeps the nuance of the Romantic Western Period in tact. The gun fights were incredible, the props and backgrounds were amazing and the portrayal of the old Deadwood mining camp were simply Breath taking. I personally enjoyed how the movie would weave in and out of Wild Bill's past through his opium induced dreams... the characters were very believable but the story just didn't add up to the facts that surrounded Wild Bill's death. I would also take exception to the HBO series Deadwood concerning Wild Bill's death also, it's a shame that somebody in the movie business, ANYBODY, would come up with a more accurate portrayal of the man, his life and his untimely death. With all that being said, it was a beautiful movie visually.",
         "James Butler \"Wild Bill\" Hickock: Soldier, buffalo hunter, lawman, adventurer, wastrel, whoremonger, opium user, syphilis-carrier, brawler. Wild Bill wasn't just worldly, he was world-class worldly. Yet there was a boyishly but noble, almost sensitive charm to this raging bar fight of a man. His murder by the hand of a coward smacks of Greek tragedy, though he was spared the final indignities of disease and self-abuse. \"Wild Bill\" pretty well accurately chronicles the life of the man. Walter Hill has beautifully established the enigmatic poetry of him. Jeff Bridges perfectly embodies his spirit, while his friends, \"Calamity Jane\" (Ellen Barkin), Charley Prince (John Hurt) and \"California Joe\" (James Gammon) provide letter perfect foils, thematic analyzers and comic relief. With the success of \"Deadwood\" on HBO, \"Wild Bill\" would probably be a deserved hit with audiences now. At the time, a movie whose gaminess made a Leone western look positively Disneyish by comparison was probably too off-putting for audiences. Now, it's time to examine the beauty of the performances amidst the accurate ugliness of actual conditions in mining towns like Deadwood in 1876. This is Barkin's best performance, Gammon's most charming and Hurt's most beautiful line readings. Who could ever forget the haunting look on the face of Song Lew (Karen Huie), proprietress of the opium den after saving the doped out Bill. Or Bill's disgust with the \"opium of the masses\" Marjoe Gortner (himself a former evangelical preacher) doles out to the suckers in the form of religion. How the movie beautifully integrates the old joke that \"the best way to find a whore is follow the church bells\" into the storyline. Christina Applegate is even very effective in her peripheral role, with her baby face and voluptuous body, a child whose eyes already reflect a soul dead from surrender to his conditions. \"Wild Bill\" is strong stuff indeed. If I can fault writer-director Walter Hill (and I believe it is still too soon to render a final judgment on this movie), I would fault his decision to shoot the flashbacks as erratic dreams, with unstable camera and black-and-white. I'd have chosen one OR the other, not both. No matter, \"Wild Bill\" will continue to haunt me, as great films do. for years to come. I just wish he'd added at least one flourish so effectively used in \"The White Buffalo,\" another less well made, but impressive movie about Hickock. That would have been to include the scene of Bill passing the mountain of bleached Buffalo bones. For Bill's passing was perhaps a fitting climax to the death of that era; and, with it, the death of the \"American West\" of legend. I give \"Wild Bill\" a \"9\"."
      ],
      "genres": [
         "Action",
         "Biography",
         "Western"
      ],
      "productionCompanies": [
         "United Artists",
         "Zanuck Company, The"
      ],
      "summaries": [
         "Wild Bill Hickok, famed lawman and gunman of the Old West, is haunted by his past and his reputation. He is loved by, but cannot love, Calamity Jane. Dogging his trail is young Jack McCall, who blames Bill for abandoning the boy's mother and destroying her life. McCall has sworn to kill Bill, and Bill's ghosts, his failing eyesight, and his fondness for opium may make McCall's task easier.",
         "The early career of legendary lawman Wild Bill Hickock is telescoped and culminates in his relocation in Deadwood and a reunion with Calamity Jane."
      ],
      "budget": 30000000
   },
   "movielensId": 210,
   "movielens": {
      "languages": [
         "广州话 / 廣州話",
         "English"
      ],
      "releaseDate": "1995-12-01",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Walter Hill"],
      "runtime": 98,
      "movieId": 210,
      "title": "Wild Bill",
      "mpaa": "",
      "actors": [
         "Jeff Bridges",
         "Ellen Barkin",
         "John Hurt",
         "Diane Lane",
         "Keith Carradine",
         "David Arquette",
         "Christina Applegate",
         "Bruce Dern",
         "James Gammon",
         "Marjoe Gortner",
         "James Remar"
      ],
      "imdbMovieId": "0114938",
      "originalTitle": "Wild Bill",
      "genres": [
         "Action",
         "Western"
      ],
      "youtubeTrailerIds": ["chceChQAVjI"],
      "plotSummary": "Biopic about famous gunslinger Wild Bill Hickock. The early career of legendary lawman is telescoped and culminates in his relocation in Deadwood and a reunion with Calamity Jane.",
      "tmdbMovieId": 65796,
      "avgRating": 2.88423,
      "releaseYear": "1995",
      "numRatings": 501,
      "posterPath": "/qIgslXL0NDtSlcHxISACLwWbkRJ.jpg"
   }
}