{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0019422",
      "video": false,
      "title": "Steamboat Willie",
      "recommendations": [
         67572,
         45665,
         88018,
         72640,
         53219,
         101806,
         33600,
         34463,
         32428,
         85051,
         104396,
         57472,
         67130,
         84664,
         100246,
         127409,
         128756,
         44468,
         77022,
         84893
      ],
      "backdrop_path": "/yHtAWRPQUqK3uWHhdgX56j8NwcI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 8,
            "character": "Mickey Mouse",
            "gender": 2,
            "credit_id": "52fe486ec3a36847f81669d9",
            "name": "Walt Disney",
            "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
            "id": 2106,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe486ec3a36847f81669b1",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe486ec3a36847f81669b7",
               "name": "Roy O. Disney",
               "profile_path": "/nieUrp0QfiW0S56RVU5tpSu30ky.jpg",
               "id": 148496,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe486ec3a36847f81669c3",
               "name": "Walt Disney",
               "profile_path": "/mrcVG49U2PVm1LpPMmwBtn5ZzOh.jpg",
               "id": 2106,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe486ec3a36847f81669c9",
               "name": "Wilfred Jackson",
               "profile_path": "/iQgvspjL7upXGHSG6EbOuzBMg3Y.jpg",
               "id": 11434,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe486ec3a36847f81669cf",
               "name": "Bert Lewis",
               "profile_path": "/pz3AZWkPKONQ6ijKnfsxvw41qgO.jpg",
               "id": 144566,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "54d83214c3a3683b89006c76",
               "name": "Ub Iwerks",
               "profile_path": "/abGYy198t3XRfnB9Jia1A9NVBEP.jpg",
               "id": 123192,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "54d832fc9251416b93006a78",
               "name": "Les Clark",
               "profile_path": null,
               "id": 115754,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "54d8337bc3a368439a0068b4",
               "name": "Johnny Cannon",
               "profile_path": "/grDZTm7xLgGwRU1xEWzmGnoQ9B3.jpg",
               "id": 148148,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "54d833b0c3a3683b8f00724a",
               "name": "Wilfred Jackson",
               "profile_path": "/iQgvspjL7upXGHSG6EbOuzBMg3Y.jpg",
               "id": 11434,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "54d833c6c3a3683b8c007326",
               "name": "Dick Lundy",
               "profile_path": "/1xDOsCB5TRmuoH5eikT7gduaqPu.jpg",
               "id": 150768,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 2,
               "credit_id": "54d834549251416b9f006c71",
               "name": "Carl W. Stalling",
               "profile_path": "/7w0TsnkpyHLIYsAyYFVbdIBj2RU.jpg",
               "id": 551674,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5ac11cb0925141601504758d",
               "name": "Ub Iwerks",
               "profile_path": "/abGYy198t3XRfnB9Jia1A9NVBEP.jpg",
               "id": 123192,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 5.570527,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53565,
      "vote_count": 104,
      "budget": 4986,
      "overview": "Mickey Mouse, piloting a steamboat, delights his passenger, Minnie, by making musical instruments out of the menagerie on deck.",
      "similar": [
         812,
         10530,
         872,
         11224,
         38757,
         224141,
         14128,
         16119,
         8587,
         9479,
         10882,
         9444,
         15121,
         9325,
         10545,
         252,
         3933,
         15969,
         46195,
         254470
      ],
      "original_title": "Steamboat Willie",
      "runtime": 8,
      "poster_path": "/q4VBrpjVrC0tBmeZMUiZ5rOJxRA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Celebrity Productions",
            "id": 3197,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1928-11-18",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Ub Iwerks",
         "Walt Disney"
      ],
      "runtime": 8,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0019422/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTkzMTIzMTQzNV5BMl5BanBnXkFtZTgwMzk4NzYwMjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Walt Disney | See full cast and crew »"],
      "reviews": [
         "A Walt Disney MICKEY MOUSE Cartoon. STEAMBOAT WILLIE, a mischievous little rodent, neglects his pilothouse and frolics his way into cinematic history. On 18 November 1928, a struggling young genius debuted the world's first successful cartoon with synchronous sound. There would be no looking back for either Walt Disney or his alter ego Mickey Mouse. Financial struggles would remain, but essentially the world was their oyster bed and Mickey would eventually rival Chaplin as the most recognizable cultural icon of the century. As entertainment, STEAMBOAT WILLIE is still fun to watch, featuring fine work by animator Ub Iwerks and showing a Mickey with all the passions & indifference of a small child. He must deal with a tyrannical skipper (Pete, without his peg leg; he had been appearing in Disney cartoons since February of 1925), a wisecracking parrot (in a few years it would be a Duck) and a cute little Mouse named Minnie. Together the two rodents rather callously make music on the live bodies of a goat, cat, goose, piglets & cow (a precursor of Clarabelle) - all of whom happened to be conveniently on board the steamship. Audiences howled for more and the pattern was set for the subsequent Mouse cartoons of the next few years. ****************************** Walt Disney (1901-1966) was always intrigued by pictures & drawings. As a lad in Marceline, Missouri, he sketched farm animals on scraps of paper; later, as an ambulance driver in France during the First World War, he drew comic figures on the sides of his vehicle. Back in Kansas City, along with artist Ub Iwerks, Walt developed a primitive animation studio that provided animated commercials and tiny cartoons for the local movie theaters. Always the innovator, his ALICE IN CARTOONLAND series broke ground in placing a live figure in a cartoon universe. Business reversals sent Disney & Iwerks to Hollywood in 1923, where Walt's older brother Roy became his lifelong business manager & counselor. When a mildly successful series with Oswald The Lucky Rabbit was snatched away by the distributor, the character of Mickey Mouse sprung into Walt's imagination, ensuring Disney's immortality. The happy arrival of sound technology made Mickey's screen debut, STEAMBOAT WILLIE (1928), a tremendous audience success with its use of synchronized music. The SILLY SYMPHONIES soon appeared, and Walt's growing crew of marvelously talented animators were quickly conquering new territory with full color, illusions of depth and radical advancements in personality development, an arena in which Walt's genius was unbeatable. Mickey's feisty, naughty behavior had captured millions of fans, but he was soon to be joined by other animated companions: temperamental Donald Duck, intellectually-challenged Goofy and energetic Pluto. All this was in preparation for Walt's grandest dream - feature length animated films. Against a blizzard of doomsayers, Walt persevered and over the next decades delighted children of all ages with the adventures of Snow White, Pinocchio, Dumbo, Bambi & Peter Pan. Walt never forgot that his fortunes were all started by a mouse, or that childlike simplicity of message and lots of hard work always pay off.",
         "Steamboat Willy was not the first cartoon to feature Mickey Mouse. The first film to star America's friend was \"Plane Crazy\". \"Plane Crazy\" was released May 15th 1928 in Hollywood California,in the silent movie format. \"Steamboat Willy\" was released November 18th 1928 as a SOUND movie (it was also released July 29th 1928 as a silent film). Thus making \"Steamboat..\"the first SOUND film of Mickey but NOT the first film for the little American Mouse. While many game shows have used the question: \"What was the first appearance of Mickey Mouse?\" The true answer is \"Plane Crazy\" not \"Steamboat Willy\". These dates can be checkout on IMDb under \"release dates\".",
         "While in one country, Spain, Luis Bunuel and Salvador Dali combined forces to create the benchmark of short-subject, cinematic surrealism, Un Chien Andalou, Walt Disney and his collaborator Ub Iwerks in America worked on Steamboat Willie, the most prominent of the early synchronized sound cartoons (it was revealed that this was not the first, contrary to other reports). It's also one of the more successfully simplistic and funny of the Mickey Mouse shorts (still in a silent-film way- the only sounds are little irks and bleeps from the Mickey and the animals). It also goes by fairly quickly for its less-than-ten minute run. But in these minutes one gets the immediate sense of how much fun Disney has with his characters, and how the newfound use of sound changes how his creation uses the animals as musical tools. There's no story to speak of, just random things that happens and occurs because of Mickey (err, Steamboat Willie) on this boat on a river. And like the better Mickey Mouse shorts, his lack of speaking acts as an advantage. It's a must-see if you haven't seen it as a kid, but if you have it might still be worth another look.",
         "'Steamboat Willie (1928)' is often erroneously touted as the first Mickey Mouse film, though that title actually goes to 'Plane Crazy (1928).' The source fuelling this common misconception is probably an episode of \"The Simpsons,\" which places the origin of Itchy the Mouse in a 1928 short called 'Steamboat Itchy,' obviously a parody of this cartoon. Interestingly, 'Steamboat Willie' was itself a parody, spoofing the latest Buster Keaton release, 'Steamboat Bill, Jr. (1928),' though the connection stretches little beyond the title and the general story setting. In this Walt Disney short, Mickey Mouse takes charge of a river steamboat, much to the annoyance of Captain Pete the cat, who spitefully casts him aside. But Mickey is not to be outdone in nastiness. Far removed from the pleasant, wholesome Mickey that more recent generations enjoyed, this little mouse cares only for numero uno, inflicting pain and displeasure on a series of farm animals in order to provide music for his own amusement. First there's the laughing parrot, which cops a bucket and a large potato to the head. Then a goat is cranked by the tail to provide music (\"Turkey in the Straw\") from a guitar it has swallowed. A cat is swung around by its tail, a goose throttled about the throat, and a piglet viciously booted. For a children's cartoon, 'Steamboat Willie,' directed by Walt Disney and Ub Iwerks, certainly has some mean-spirited humour, though I also noticed similar elements (though not quite to this extent) in some later Disney shorts, like 'Gulliver Mickey (1934).' Let's not forget Minnie Mouse, of course, who suffers treatment for which she could today sue for sexual harassment! The jokes may be crude, and the animation perhaps even more so, but this cartoon delivers a bucket-full of laughs, and it's easy to see why this little rodent became one of the most beloved characters in cinema history. If you're a fan of Mickey Mouse, or Disney in general, this is one steamboat you can't afford to miss.",
         "This era was not just the dawn of sound in cartoons, but of a cartoon character which would go down in history as the world's most famous mouse. Yes, Mickey makes his debut here, in this cheery tale of life on board a steamboat. The animation is good for it's time, and the plot - though a little simple - is quite jolly. A true classic, and if you ever manage to get it on video, you won't regret it.",
         "\"Steamboat Willie\" is Mickey`s first movie, and was released way back in 1928. It is an atmospheric piece of movie history, and is a must see for every Disney-fan out there. If you don`t like Disney, you probably won`t like this movie. A great debut for Mickey Mouse and it`s the first cartoon. As an old Disney-fan, I think that this is a brilliant movie. 10/10",
         "Mickey Mouse is now 75 years old. He was created by Walt Disney, a famous creater, producer, director etc: I love the Disney Movies because it is great fun watching the cartoon movies. Altogether Walt Disney i think is the king of the creations, Everyone has got to love this creations and the movies by Walt Disney. Thank you Walt for all the classic characters you made.",
         "This 8 minute gem is not only timeless, but it is a cartoon milestone. It is Mickey's third cartoon, and one of his best ones too. It is a cartoon milestone because it was the first one with synchronised sound. And my goodness, even after 70+ years it is ever so good, and gives real additional weight to the narrative. The black and white animation is excellent, and the character features are convincing enough. The music is wonderful, I love the soundtrack, it does add to the fun the cartoon has, no matter how thin the story sometimes is. And the cartoon is funny! So many memorable moments, like the cow's teeth being used as an xylophone and its udder as a bagpipe. The characters are also engaging, Mickey and Minnie two landmark Disney characters are well voiced by Walt Disney, and Pete serves well as \"the villain of the piece\". All in all, \"Steamboat Willie\" is just a timeless gem that everybody should see at least once. 10/10 Bethany Cox",
         "STEAMBOAT WILLIE is an amazingly important film to our cinema history. This second appearance of Mickey Mouse (following the silent PLANE CRAZY earlier that year) is probably his most famous film--mostly because it was so ground-breaking. This is because it was the first sound cartoon. While you don't yet hear Mickey speak, there are tons of sound effects and music throughout the film--something we take for granted now but which was a huge crowd pleaser in 1928. Now if this were just an important historical film, it would be worth seeing--especially to lovers of animation. However, after seeing the short again after about 25 years, I was amazed at how timeless the film actually is. While Mickey and Minnie behave a bit odd compared to the characters we have grown to love (thanks mostly to the kooky mind and talent of animator Ub Iwerks), there is an infectious charm about the film. It's just adorable seeing Mickey playing \"Turkey in the Straw\" in a highly imaginative (if occasionally cruel) way. Clever and a real crowd-pleaser--this film still ranks among Mickey's best films even after 80 wonderful years.",
         "This was the first Mickey Mouse cartoon released and the first cartoon with sound. In the cartoon, Mickey does not yet wear gloves. He does not yet speak either. All he does is whistle and play music. The song that he plays is \"Turkey in the Straw\" using several farm animals as musical instruments. For example, he plays the teeth of a cow like a xylophone and pulls nursing piglets like an accordion keyboard. I taped this cartoon off of the Disney Channel and I think it is wonderful. It was based on a silent film starring Buster Keaton entitled \"Steamboat Bill, Jr.\""
      ],
      "genres": [
         "Animation",
         "Family",
         "Comedy",
         "Musical",
         "Short"
      ],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": [
         "Mickey is piloting a steamboat when Captain Pete comes to the bridge and throws him off. They stop to pick up cargo. Minnie just misses the boat and Mickey uses the crane to grab her. She drops her sheet music of \"Turkey in the Straw\" and a goat eats it. With help from Mickey, she cranks the goat's tail, and it plays the tune. Mickey accompanies on percussion and by torturing various animals, until Pete comes down and puts a stop to it, putting Mickey to work peeling potatoes. While this is the first sound Mickey Mouse, there's no dialog.",
         "Mickey Mouse, piloting a steamboat, delights his passenger, Minnie, by making musical instruments out of the menagerie on deck."
      ],
      "budget": 4986
   },
   "movielensId": 2102,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1928-11-18",
      "dvdReleaseDate": "2002-12-03",
      "directors": ["Walt Disney"],
      "runtime": 8,
      "movieId": 2102,
      "title": "Steamboat Willie",
      "mpaa": "",
      "actors": ["Walt Disney"],
      "imdbMovieId": "0019422",
      "originalTitle": "Steamboat Willie",
      "genres": [
         "Music",
         "Animation"
      ],
      "youtubeTrailerIds": ["BBgghnQF6E4"],
      "plotSummary": "Mickey Mouse, piloting a steamboat, delights his passenger, Minnie, by making musical instruments out of the menagerie on deck.",
      "tmdbMovieId": 53565,
      "avgRating": 3.44715,
      "releaseYear": "1928",
      "numRatings": 1419,
      "posterPath": "/q4VBrpjVrC0tBmeZMUiZ5rOJxRA.jpg"
   }
}