{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111359",
      "video": false,
      "title": "Tall Tale",
      "recommendations": [
         12559,
         40490,
         30114,
         43391,
         87884,
         2302,
         112078,
         45928,
         6980,
         15128,
         54087,
         14170,
         4988,
         19762,
         17984,
         22328,
         45325,
         13962,
         26441,
         12475
      ],
      "backdrop_path": "/vFDLF0uzJNS9rBWpavaEHYuuesR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Pecos Bill",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df727",
               "name": "Patrick Swayze",
               "profile_path": "/b5G8AGP609DsUeokQ1asnqYJBSl.jpg",
               "id": 723,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Paul Bunyan",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df72b",
               "name": "Oliver Platt",
               "profile_path": "/an9n3aUKFAN50GDsbqwIkvWlcus.jpg",
               "id": 17485,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "John Henry",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df72f",
               "name": "Roger Aaron Brown",
               "profile_path": "/mQ2mEx7EteO2zdOFUzu1shDi7E.jpg",
               "id": 44054,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Daniel Hackett",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df733",
               "name": "Nick Stahl",
               "profile_path": "/3IBXRFxLdpk3PrN6ypdiWZi6xe3.jpg",
               "id": 6408,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "J.P. Stiles",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df737",
               "name": "Scott Glenn",
               "profile_path": "/aKUJwCKhl4qCi7j7M7TRpqWLmmO.jpg",
               "id": 349,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Jonas Hackett",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df73b",
               "name": "Stephen Lang",
               "profile_path": "/tqF6ibURpLvRPlgvLRvjCQqWaa2.jpg",
               "id": 32747,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Head Thug Pug",
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df73f",
               "name": "Jared Harris",
               "profile_path": "/96vCepP4GoFZdylBqn4aPRQPPHK.jpg",
               "id": 15440,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Calamity Jane",
               "gender": 1,
               "credit_id": "54ecd5899251417965002317",
               "name": "Catherine O'Hara",
               "profile_path": "/nDlIwrkmvz11mwsKSTAbM2dfDgC.jpg",
               "id": 11514,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df717",
               "name": "Jeremiah S. Chechik",
               "profile_path": "/avEcJTGsWFEzxpSOutwhkP3adQ8.jpg",
               "id": 34682,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45e0c3a36847f80df71d",
               "name": "Steve Bloom",
               "profile_path": null,
               "id": 56514,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e0c3a36847f80df723",
               "name": "Robert Rodat",
               "profile_path": null,
               "id": 12832,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58e015dec3a3683d0b00dc46",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58e015e5c3a3683cbe00db36",
               "name": "Janusz Kamiński",
               "profile_path": "/5LNGARjEfMDOcEP6fMNtJypAGYx.jpg",
               "id": 492,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58e015efc3a3683d3500e767",
               "name": "Richard Chew",
               "profile_path": null,
               "id": 8425,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58e015f79251415e3600e3ec",
               "name": "Jackie Burch",
               "profile_path": null,
               "id": 1097,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58e016019251415e4000e0b1",
               "name": "Eugenio Zanetti",
               "profile_path": null,
               "id": 961533,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58e0160bc3a3683d4600d903",
               "name": "Rick Heinrichs",
               "profile_path": null,
               "id": 1226,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "58e016109251415e5f00e75f",
               "name": "Jim Dultz",
               "profile_path": null,
               "id": 961534,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "58e0161d9251415e3c00e7c9",
               "name": "Bill Badalato",
               "profile_path": null,
               "id": 35510,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58e0162a9251415e4000e0cb",
               "name": "Roger Birnbaum",
               "profile_path": null,
               "id": 4504,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58e01634c3a3683d0b00dc7f",
               "name": "Joe Roth",
               "profile_path": "/lUtmB3mtMPrA5hhoEwZBeX1U5uL.jpg",
               "id": 18311,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58e0163dc3a3683d3500e797",
               "name": "Kirsten W. Welles",
               "profile_path": null,
               "id": 1788046,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "58e016499251415e4000e0dc",
               "name": "Wayne A. Finkelman",
               "profile_path": null,
               "id": 1542823,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "58e01650c3a3683cbe00db7e",
               "name": "Jerie Kelter",
               "profile_path": null,
               "id": 22010,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [{
         "name": "Adventure",
         "id": 12
      }],
      "popularity": 3.584318,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41841,
      "vote_count": 20,
      "budget": 32000000,
      "overview": "A young boy draws on the inspiration of legendary western characters to find the strength to fight an evil land baron in the old west who wants to steal his family's farm and destroy their idyllic community. When Daniel Hackett sees his father Jonas gravely wounded by the villainous Stiles, his first urge is for his family to flee the danger, and give up their life on a farm which Daniel has come to despise anyway. Going alone to a lake to try to decide what to do, he falls asleep on a boat and wakes to find himself in the wild west, in the company of such \"tall tale\" legends as Pecos Bill, Paul Bunyan, John Henry and Calamity Jane. Together, they battle the same villains Daniel is facing in his \"real\" world, ending with a heroic confrontation in which the boy stands up to Stiles and his henchmen, and rallies his neighbors to fight back against land grabbers who want to destroy their town.",
      "similar": [],
      "original_title": "Tall Tale",
      "runtime": 98,
      "poster_path": "/g20GsTJ3gDVEt17Z13vXzjJ7RON.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-03-24",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Sometime the hero ends up being you!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jeremiah S. Chechik"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Steve Bloom",
         "Robert Rodat"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0111359/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc3MzExNjkwMV5BMl5BanBnXkFtZTYwMTQ4Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Patrick Swayze, Oliver Platt, Roger Aaron Brown | See full cast and crew »"],
      "reviews": [
         "I expected some sort of supernatural-type hero story with he likes of Pecos Bill, Paul Bunyan and Jhn Henry, but this movie was more like a regular adventure. It reminded me, in some respects, of an adventure out West such as White Fang. It was that kind of story. The kid in here, \"Daniel Hackett,\" played by Nick Stahl, was a little annoying for awhile, the typical snotty kid they like to show in the movies, but came to his senses by the end and wound up a decent kid who respected the people he was supposed to respect. Meanwhile, all the characters including bad-guy \"J.P. Stiles\" (Scott Glenn) were a lot of fun not only to watch but to listen to, with some good dialog. In all, it was lightweight fun and a good adventure story rolled into one. Patrick Swaze was a hot as \"Pecos Bill\" and Oliver Platt equally fun as \"Paul Bunyan,\" and who doesn't admire big \"John Henry\" (Roger Aaron Brown)? Why this is not available (at least in Region 1) on DVD is a mystery to me. It's just a fun movie - pure escapism for more than just kids.",
         "Unlike the prior poster, I loved this movie. It is a great family movie that is based on the Tall Tales that many of us learned in literature classes. If you know who Pecos Bill, Paul Bunyan, or John Henry are, you will find those heroes here. If you don't, what better way to learn about some of American histories classic Tall Tale characters that once put a sense of pride in being American. It was obvious that they took the time to find very fitting actor for each role. The script was written to make it a definite family movie suitable for any family. When the movie ends, you feel satisfied that you saw a good movie and not left with an \"oily\" feeling like you were just slimed like many of the movies do today. The story is that of a boy and his family about to lose their farm to a railroad tycoon in the early 1900s, something that did happen back then. The American Tall Tale characters are brought in one at a time to help the boy through the situation and teach him the way of being a man, with respect.",
         "I thought this movie was excellent for older children and adults. Tall tales are such a large part of our culture and others as well. Sometimes a person has to make a stand to protect his or her way of life and I think this movie does that in a way that is easy to interpret. It would also stay in our minds as a life lesson. Rosa Parks stood alone on that bus in Montgomery, AL. The boy in this movie took a stand too. He never hurt anyone either. Dr. Martin Luther King, Jr. took a stand without any violence and look what happened! The boy's father was an inspiration to his son. Our youth of today need these things. They need someone to look up to by example. I'd highly recommend this movie for all ages! I watched it twice in one day and will do so again and again.",
         "This is a Disney family movie, and the lead character is 12 years old. This means that the target audience is still in grade school, and the moral lesson is as subtle as Paul Bunyan's blue ox. But if you're willing to relax and put on your mouse ears, you might enjoy seeing Pecos Bill ride a cyclone and John Henry compete with a steam engine. The barroom scene with Calamity Jane is a treat for lovers of Old West humor, and Texas son Patrick Swayze is perfectly cast as Pecos Bill. Sadly for us, his gorgeous looks are all but hidden under his mustache, prairie dust, and 10-gallon hat.",
         "I am only commenting on this \"movie\" because of previous criticisms listed above. This \"film\" was never in cinema houses because it was produced as a children's special for HBO. It's really too bad that others can't manage to see it through the eyes of its intended audience: a seven-year-old who is enthralled by the likes of Patrick Swayze, Oliver Platt, Scott Glenn, Catherine O'Hara, Roger Aaron Brown, Scott Wilson, William H. Macy and Burgess Meredith acting out his/her favorite childhood stories. Come on! Who WOULDN'T have fun watching this cast? I, for one, am glad that there is still mindless, FUN entertainment for children to watch in between the movies we adults view that are full of explosions, blood, gore and full frontal nudity. I'm certainly no prude, and I don't even HAVE children -- I just remember fully what it was like to be a child!",
         "I'm now 18 and this movie remains a favorite of mine. I watch it so much my parents urge me to watch other films. The film takes place in the American West in 1905. A young boy named Daniel Hacket doesn't believe his father is doing the right thing when he passes up an opportunity to sell the family farm for purely sentimental reasons. He also doesn't believe all the tall tales his father tells him of Pecos Bill, Paul Bunyun and Jonn Henry. He is later entrusted with the deed to the farm by his father who then gets critically injured. The villain of this film, Mr. Stiles, won't rest until he has every deed to Paradise Valley, the area where the Daniel lives. Daniel falls asleep in a boat and is carried off. When he awakes he is rescued by none other than Pecos Bill himself. Daniel is determined to get home to take care of his family. Pecos decides to help him. Along the way they meet Paul Bunyun and John Henry. They also must struggle to avoid Stiles and his men who are hot on their trail. On the journey, Daniel sees why the land is so important to his father and finds himself fighting for it just as hard. I find this to be a charming and heart warming film. It must have been fun for the actors to portray those great American legends. I, personally, could not see anyone else in those roles. I would have liked to see a bit more of Calamity Jane. Here's to the Code!",
         "A well made Family movie in the \"Field of Dreams\" mold. Instead of baseball legends a boy receives aid from some legends of the Old West-- Pecos Bill (Patrick Swayze), Paul Bunyon (Oliver Platt), John Henry (Roger Allen Brown), and Calamity Jane (Catherine O'Hara!). The talented game cast sells this sometimes hokey movie well. It's definitely worth a rent if it ever becomes available on home video though it can often be found on cable.",
         "Disney has retold (again) the Wonderful Wizard of Oz, this time with a male protagonist, Paul Bunyan as the Cowardly Lion, John Henry as the Tin Woodman, and Pecos Bill as the Scarecrow. I saw this movie for the first time today with my 8-year-old son, and as cheesy as this sounds, I know we will both remember this day forever. If you aren't the father of a small boy, take a hike. You don't have a clue. But if you are the father of a small boy, go to the public library's children's room and get this movie pronto. And if, like me, you're an old movie propman, get ready to enjoy some of the nicest set dressing and model work you've seen for a long, long time. I wish I had that train on my resume.",
         "I totally dug this movie when I was a kid (like 7 or 8 or 9 years old). I had it on tape and my sister, cousins, and I watched it all the time. It's certainly no blockbuster or award winning picture, but it's still fun for kids (it was for me anyway). I remember liking how these story characters I was familiar with, were all linked together in the story and were (kind of) brought to life. Anyway, I guess it's just personal preference, but I remember digging it, and to say that no child got anything out of this silly movie would be wrong. I can't really remember the story too much now, to be honest, (it's been so long), but just thinking about it made me smile, and I am seriously tempted to go out and rent it for my nephews. It's only a dollar or two, and even if it doesn't pack the same punch it did when I was little, I'm sure I would enjoy seeing it again, and I'm sure my nephews might enjoy it too.",
         "Written by Steve Bloom and Robert Rodat, and directed by Ornie Orsatti, Tall Tale stars Nick Stahl, Patrick Swayze, and Scott Glenn. Released in 1995 this Action/Adventure film takes place in an old western town at the start of the twentieth century and focuses on the modernization of America. In 1905, Daniel Hackett (Nick Stahl) lives with his mother and father on the farmlands of Paradise Valley. As the film progresses the audience learns that Daniel is growing sick of his life on the farm and expresses his bitterness to his father, Jonas. Daniel's father tells him repetitive stories of folk heroes, Pecos Bill, Paul Bunyan, and John Henry, in whom Daniel no longer believes. Meanwhile, J.P. Stiles (Scott Glen) enters town with his gang of wealthy men and his modern machinery with intent of buying the land in order to develop it. When Jonas stands up to stiles and refuses to sell his land he ends up being shot, but not before he hands the deed to his land to Daniel. Jonas survives but is badly injured, Daniel meanwhile runs and hides in his boat, where he falls asleep. When he wakes he finds himself in a dried up lake bed in Texas, where two men try to rob and kill him, only to be rescued by legendary cowboy Pecos Bill (Patrick Swayze). The two of them later meet up with famous lumberjack Paul Bunyan and ex-slave John Henry. The team gets into a tough battle with Stiles, whose greediness threatens the strength of the folk tales and the livelihood of the farmers. The acting by the Stahl, Swayze, and Glen was very impressive. They were able to capture the feel of the early Midwest and made the audience feel as if they were part of the story. The compelling acting brought out the excitement of the folk lures that every child reads when growing up. Gender clearly played a large part in casting actors for the film because men play all of the dominant roles. This can be attributed to the fact that women didn't have a large role outside of the home during this time period and unfortunately there are not many women folk heroes. The costume design and set design also played large roles in creating a convincing story. The costumes were dead on for what viewers would imagine Pecos Bill, Paul Bunyan, and John Henry to look and dress like. The costumes really brought out the feeling that this film was based in the early Midwest and the set was designed perfectly to give the feeling that the audience is involved in a folk story. For example Paul Bunyan's log home was exactly what you would imagine it to be, along with his blue ox, Babe. I would highly recommend this film, as I have loved it since I was a child. It is a great movie for children and for families, and should be watched by anyone who enjoys adventure films."
      ],
      "genres": [
         "Adventure",
         "Family",
         "Fantasy",
         "Western"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Walt Disney Pictures"
      ],
      "summaries": ["A young boy draws on the inspiration of legendary western characters to find the strength to fight an evil land baron in the old west who wants to steal his family's farm and destroy their idyllic community. When Daniel Hackett sees his father Jonas gravely wounded by the villainous Stiles, his first urge is for his family to flee the danger, and give up their life on a farm which Daniel has come to despise anyway. Going alone to a lake to try to decide what to do, he falls asleep on a boat and wakes to find himself in the wild west, in the company of such \"tall tale\" legends as Pecos Bill, Paul Bunyan, John Henry and Calamity Jane. Together, they battle the same villains Daniel is facing in his \"real\" world, ending with a heroic confrontation in which the boy stands up to Stiles and his henchmen, and rallies his neighbors to fight back against land grabbers who want to destroy their town."],
      "budget": 32000000
   },
   "movielensId": 2103,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-24",
      "dvdReleaseDate": "1998-03-16",
      "directors": ["Jeremiah S. Chechik"],
      "runtime": 98,
      "movieId": 2103,
      "title": "Tall Tale",
      "mpaa": "",
      "actors": [
         "Patrick Swayze",
         "Oliver Platt",
         "Roger Aaron Brown",
         "Nick Stahl",
         "Scott Glenn",
         "Stephen Lang",
         "Jared Harris",
         "Catherine O'Hara"
      ],
      "imdbMovieId": "0111359",
      "originalTitle": "Tall Tale",
      "genres": ["Adventure"],
      "youtubeTrailerIds": ["-94NGRBMPmM"],
      "plotSummary": "A young boy draws on the inspiration of legendary western characters to find the strength to fight an evil land baron in the old west who wants to steal his family's farm and destroy their idyllic community. When Daniel Hackett sees his father Jonas gravely wounded by the villainous Stiles, his first urge is for his family to flee the danger, and give up their life on a farm which Daniel has come to despise anyway. Going alone to a lake to try to decide what to do, he falls asleep on a boat and wakes to find himself in the wild west, in the company of such \"tall tale\" legends as Pecos Bill, Paul Bunyan, John Henry and Calamity Jane. Together, they battle the same villains Daniel is facing in his \"real\" world, ending with a heroic confrontation in which the boy stands up to Stiles and his henchmen, and rallies his neighbors to fight back against land grabbers who want to destroy their town.",
      "tmdbMovieId": 41841,
      "avgRating": 3.02881,
      "releaseYear": "1995",
      "numRatings": 243,
      "posterPath": "/g20GsTJ3gDVEt17Z13vXzjJ7RON.jpg"
   }
}