{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "oklahoma",
            "id": 2493
         },
         {
            "name": "shooting",
            "id": 7281
         },
         {
            "name": "coming of age",
            "id": 10683
         }
      ],
      "imdb_id": "tt0084783",
      "video": false,
      "title": "Tex",
      "recommendations": [
         96333,
         71034
      ],
      "backdrop_path": "/1RTdebZZ9tdxzx1xY9YW1uqPcAL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Tex McCormick",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ff9d",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mason McCormick",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffa1",
               "name": "Jim Metzler",
               "profile_path": "/tOxegcIdJ3VTixb63oSlJODMnFp.jpg",
               "id": 79740,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Jamie Collins",
               "gender": 1,
               "credit_id": "52fe4542c3a368484e04ffa5",
               "name": "Meg Tilly",
               "profile_path": "/qR47kpFZR7ROd82oXJUj1CHYyZl.jpg",
               "id": 39117,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Johnny Collins",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffa9",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Cole Collins",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffad",
               "name": "Ben Johnson",
               "profile_path": "/yqPEXD23jLYxmCCLNWtyQ3tJ89V.jpg",
               "id": 8258,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Pop McCormick",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffb7",
               "name": "Bill McKinney",
               "profile_path": "/bXGJNizj5SbEFPjeBupnRxgwPq0.jpg",
               "id": 16555,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mrs. Johnson, the school vice-principal",
               "gender": 1,
               "credit_id": "52fe4542c3a368484e04ffbb",
               "name": "Frances Lee McCain",
               "profile_path": "/kOI0WF56kQLIDCkEdT30KBDQNYT.jpg",
               "id": 1070,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Lem Peters",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffbf",
               "name": "Phil Brock",
               "profile_path": "/5Bsg4prnf5h6eQZAPgL92SY3PD3.jpg",
               "id": 159129,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Connie Peters",
               "gender": 1,
               "credit_id": "52fe4542c3a368484e04ffc3",
               "name": "Pamela Ludwig",
               "profile_path": null,
               "id": 554192,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Basketball coach",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffc7",
               "name": "Jack Thibeau",
               "profile_path": "/3u5SqsqsOeZjwRhtUbuEKqu6JJ2.jpg",
               "id": 14320,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "The hitchhiker",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffcb",
               "name": "Zeljko Ivanek",
               "profile_path": "/bQbyb11FgEPwNSfFeb6ChTfkqEM.jpg",
               "id": 6752,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Bob Collins",
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ffcf",
               "name": "Tom Virtue",
               "profile_path": "/qL53J6VThZlY14P8TmZWuggK2OY.jpg",
               "id": 38709,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4542c3a368484e04ff93",
               "name": "Tim Hunter",
               "profile_path": "/46BrIP5cvIMUfYDvhhYSqExpN6F.jpg",
               "id": 15858,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4542c3a368484e04ff99",
               "name": "Charles S. Haas",
               "profile_path": null,
               "id": 16174,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4542c3a368484e04ffb3",
               "name": "S.E. Hinton",
               "profile_path": "/nIXzHUlp1LzclFkiQAGY40bw65b.jpg",
               "id": 2868,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "53204ef39251411f890012d5",
               "name": "Tim Hunter",
               "profile_path": "/46BrIP5cvIMUfYDvhhYSqExpN6F.jpg",
               "id": 15858,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55952017925141683b001d54",
               "name": "Tim Zinnemann",
               "profile_path": null,
               "id": 12993,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5595202dc3a36870cc00284c",
               "name": "Pino Donaggio",
               "profile_path": null,
               "id": 14138,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5595203fc3a36870d5002ae0",
               "name": "Ric Waite",
               "profile_path": null,
               "id": 1728,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55952052c3a368146d000a72",
               "name": "Howard E. Smith",
               "profile_path": null,
               "id": 10853,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55952062c3a36870d5002ae7",
               "name": "Pam Polifroni",
               "profile_path": null,
               "id": 12866,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55952074c3a36870d5002aec",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5595208f9251415a0a002f30",
               "name": "Lisa Clarkson",
               "profile_path": null,
               "id": 1483907,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 6.042465,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27332,
      "vote_count": 12,
      "budget": 0,
      "overview": "Coming-of-age adventure about two teenage brothers and their struggles to grow up, on their own, after their mother dies and their father leaves them.",
      "similar": [
         8067,
         4771,
         339692,
         979,
         2149,
         11826,
         6075,
         281957,
         627,
         769,
         449176,
         169917,
         398818,
         9540,
         226,
         24420,
         133805,
         71859,
         1024,
         23949
      ],
      "original_title": "Tex",
      "runtime": 103,
      "poster_path": "/7GE4x0U5ye1RQy3HJxNafKc1LoG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Walt Disney Productions",
         "id": 3166,
         "origin_country": ""
      }],
      "release_date": "1982-07-30",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tim Hunter"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "S.E. Hinton",
         "Charles S. Haas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084783/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4MjQzOTc5N15BMl5BanBnXkFtZTcwNjg2NTYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Matt Dillon, Jim Metzler, Meg Tilly | See full cast and crew »"],
      "reviews": [
         "Has there ever been anybody who could play troubled teenagers as well as Matt Dillon could? His performance as a fifteen-year-old rural boy who is being raised by his older brother is his best; at least of his earlier films. The director Tim Hunter gives the movie a slow and steady slice of life feel, as the two siblings deal with problems involving friends, money, horses, sex, and in a ridiculously false scene - drug dealers. Overall it's a surprisingly mature and straightforward family drama from Disney. Ben Johnson has a memorable part as the repressive father of both Meg Tilly and Emilio Estevez. ***1/2 out of ****",
         "When I saw that Disney made this movie I was expecting it to be a toned down adaptation of S.E. Hinton's novel. Boy, I was wrong. This was one of Disney's more mature movies and had all the important stuff from the book. Even the drug deal that went wrong. The characters are just as likable as they were in the book which is good. It's too bad that this movie is forgotten. There was one review that called the movie version of That was Then... This is Now a gem and I would've agreed with that statement if it didn't have that crappy ending. This is the real gem out of all S.E. Hinton adaptations. If you ever find this movie somewhere, I recommend checking it out.",
         "The story is of two teenage brothers living together on a small property in Bixby, Oklahoma (a small town about twenty miles south of Tulsa). Tex (Matt Dillon) is the younger and Mason (Jim Metzler) is the older. Their mother is dead and their father rarely shows up. The brothers are doing everything they can to avoid the clutches of social services. The dynamic of their relationship is one of frustration, love, and anger. Their lives are not easy and money is running out. To buy food and get the lights back on Mason is forced to sell Tex's horse and of course that infuriates Tex and he takes off in a rage. The poignant scene that has Mason drive his pickup along the road to coax Tex back is an early scene that establishes the tone of the relationship between the siblings. It is not clear where this story will go. There are some moments along the way where it looks like Tex is going to take a very wrong turn when in the company of a drug dealing friend. The young Dillon and Metzler carry the movie by their natural performances; the kids talk and act like most kids of their age did in that place and time (early 1980s). The fact that the movie was filmed on location in Bixby and Tulsa adds to the feeling of authenticity. This movie does not go beyond the scope of being a simply-told, affecting tale and, within that scope, it delivers admirably. Some sentimentality creeps in toward the end, but for what it is I found this modest movie satisfying.",
         "Disney Pictures did a pretty good job on this movie. Matt Dillon played a really good Tex McCormick and the other actors and actresses were really good too. The movie was almost like the book except for little differences. The only thing i did not like were the cast members. Now! wait don't get me wrong they all did a wonderful job, but the only one that seemed to fit the description of the character as in the book was Matt Dillon. That dosen't really matter, its the movie not the book. So it should be different,and its a good movie. Just that you can't really rent it anywhere so you will probaly have to buy it. I had to.",
         "Starring a very young Matt Dillon in one of his earliest main roles, \"Tex\" is a completely by-the-numbers movie. It trudges over cliché after cliché, but it's age and settings sort of let's you forgive it's generic feel. It's core development is a drama of brothers growing up together and looking out for one-another. I liked the movie for it's simplicity and charismatic performances from Dillon and especially Metzler who stood out as the anchor in movie. Conversations were honest and occasionally poignant. One of the better aspects of the movie is it's unmuddied reflection of Southern society and school in the early 80s. In this way it excels. Supporting cast are fairly good including also young Emilio Estevez and Meg Tilly. Overall it didn't surprise me that it was Disney.",
         "In her review for The New Yorker, film critic Pauline Kael quipped that the young actor Matt Dillon who stars in \"Tex\" possessed an extraordinarily natural grasp of acting, and that he had never played a rascally, down-home country kid before. Actually, the character of Tex McCormick, Oklahoma high school student struggling to stay out of trouble after he and his brother are abandoned by their father, is like an expanded version of Dillon's character from 1980's \"Little Darlings\". In other words, there are no surprises from this up-and-coming star, no revelations, and not a trace of personal substance on display. Dillon falls for the pretty daughter of self-righteous Ben Johnson, who seemingly always plays self-righteous (no surprises from him, either). Johnson's way of acting is to pontificate clearly, as if he were making a speech in the town hall. This Disney drama, taken from S.E. Hinton's novel, is rather slow and fuzzy--and after an hour, the audience is still waiting for the plot to get started. The rural locations are capably captured, but the drama inherent in the story of these two brothers lays flat. *1/2 from ****",
         "Matt Dillon shines in the role he was made for-a troubled teen. Though not as effective as The Outsiders, Tex has a special charm all its own. Matt Dillon's excellent acting and the moving storyline bring the tale to life. Charming.",
         "This movie was filmed in my home town and my high school it is one of my favorite movies the actors really made the movie it is really strange to see you high school in a movie the school i went to is Bixby High School in Bixby Oklahoma its really nice to see how the town looked then and what it looks like today i have read all SE Hilton's books and watched all her movies Tex is got to be my all time favorite movies out of the all wish that they would make a remake of the movie to show where the characters are now in life thank you SE for all of your story lines they really get you into the story and make you cry with all the different scenarios",
         "In the rough days of teen life trying to find where one belongs in relationship to one's self, family and friends and the need for change and breaking away.This movie portrays all of that with great care and fantastic acting by the entire cast.I highly recommend it. What a great film this was- there was good acting, a good script, unexpected moments of hilarity- and best of all this film stayed close to the book. Many of the characters' lines in the movie are directly from the book. If you are a fan of S.E. Hinton and her writings, you won't be disappointed by it. In my mind, \"Tex\" was even better than \"The Outsiders,\" at least in terms of the movies. Matt Dillon is superb as Texas McCormick, a quiet, somewhat immature teenager living in Oklahoma, the usual setting for Hinton's books. There are few moments in the film (don't worry, I won't give them away) that were extremely funny. However, not only is the humor entertaining in the movie, but the drama is well done too. Tex faces changes at home, with his friends Johnny and Jamie, and at school, and the result makes for a captivating story line. The selection for the supporting cast is right on in almost every case- Jim Metzler plays Tex's brother Mason, who has to tend for his younger brother while also looking ahead to college and his own future. Emilio Estevez is Tex's spunky friend Johnny and Meg Tilly is Johnny's independent-minded sister Jamie, the object of Tex's affections. Even the filming and quality of the movie is not bad, considering that it was made two decades ago. The music is usually fitting in each scene, and the script came off sounding realistic and genuine. All in all, this is a movie well worth checking out. I think the only thing wrong with this movie is the rating it received; there's probably enough swearing in this movie to have earned it a PG-13 rating. Highly recommended.",
         "I would rank \"Tex\" as the second best of the S.E. Hinton adaptations starring Matt Dillon (happy birthday, Matt!) behind \"The Outsiders\"; \"Rumble Fish\" was too weird to make any sense. This one casts him a young man trying to make his way in Oklahoma after his mother dies. Although its status as a Disney movie gives it kind of a strange feeling, it still comes out very well, with good performances by pretty much all the cast members. But I will say that he reached his apex with \"The Outsiders\". In all these movies, he was showing the sort of talent that eventually earned him an Oscar nomination for \"Crash\". Worth seeing. Also starring Meg Tilly, Frances Lee McCain (the \"Gremlins\" mom), Ben Johnson, Emilio Estevez and Zeljko Ivanek."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Walt Disney Productions"],
      "summaries": ["Coming-of-age adventure about two teenage brothers and their struggles to grow up, on their own, after their mother dies and their father leaves them."],
      "budget": 0
   },
   "movielensId": 2104,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-07-30",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Tim Hunter"],
      "runtime": 103,
      "movieId": 2104,
      "title": "Tex",
      "mpaa": "PG",
      "actors": [
         "Matt Dillon",
         "Jim Metzler",
         "Meg Tilly",
         "Emilio Estevez",
         "Ben Johnson",
         "Bill McKinney",
         "Frances Lee McCain",
         "Phil Brock",
         "Pamela Ludwig",
         "Jack Thibeau",
         "Zeljko Ivanek",
         "Tom Virtue"
      ],
      "imdbMovieId": "0084783",
      "originalTitle": "Tex",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Coming-of-age adventure about two teenage brothers and their struggles to grow up, on their own, after their mother dies and their father leaves them.",
      "tmdbMovieId": 27332,
      "avgRating": 3.26763,
      "releaseYear": "1982",
      "numRatings": 312,
      "posterPath": "/7GE4x0U5ye1RQy3HJxNafKc1LoG.jpg"
   }
}