{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "anti semitism",
            "id": 10144
         },
         {
            "name": "nazi resistance",
            "id": 174594
         },
         {
            "name": "swing dancing",
            "id": 174599
         }
      ],
      "imdb_id": "tt0108265",
      "video": false,
      "title": "Swing Kids",
      "recommendations": [
         15300,
         14684,
         15581,
         9526,
         36934,
         64170,
         29901,
         58434,
         8428,
         32304,
         118430,
         54933,
         60230,
         210599,
         24050,
         32308,
         39467,
         27885,
         48798,
         45877
      ],
      "backdrop_path": "/mIwxNBvI0q9JYzPB8N9pJ4IqeCb.jpg",
      "revenue": 5632086,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Peter Müller",
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fa87",
               "name": "Robert Sean Leonard",
               "profile_path": "/90xoBVpR2LzaFdo83KmcxjXR7Dg.jpg",
               "id": 2692,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Thomas Berger",
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fa8b",
               "name": "Christian Bale",
               "profile_path": "/2ocrTd8ChuUyJOzMuD4PsQw8eCB.jpg",
               "id": 3894,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Arvid",
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fa8f",
               "name": "Frank Whaley",
               "profile_path": "/ma1lgPwUHUlgdt9BIcIbEPjdx0h.jpg",
               "id": 11805,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frau Müller",
               "gender": 1,
               "credit_id": "52fe436b9251416c7500fa93",
               "name": "Barbara Hershey",
               "profile_path": "/gaimK3QeNS32Wjryw03QC0PXWKO.jpg",
               "id": 10767,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Evey",
               "gender": 1,
               "credit_id": "52fe436b9251416c7500fa97",
               "name": "Tushka Bergen",
               "profile_path": "/5ok6xYGHpx2Bv0raKiXdj6bEZnY.jpg",
               "id": 65058,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Willi Müller",
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fa9b",
               "name": "David Tom",
               "profile_path": "/ZdUUjXp4BPJNRXNxcWK9o216yW.jpg",
               "id": 65059,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Mama Klara Müller",
               "gender": 1,
               "credit_id": "56d2168cc3a3681e3c00b8b0",
               "name": "Mary Fogarty",
               "profile_path": "/8wAhTCu3XTWOWq0E1oHE1Qiod0E.jpg",
               "id": 1556884,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Herr Knopp, Gestapo (uncredited)",
               "gender": 2,
               "credit_id": "590b1f619251414fbe01366e",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500faa1",
               "name": "Thomas Carter",
               "profile_path": "/j51pRbB8nCYrziSnjmB2PS9SIVh.jpg",
               "id": 52038,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe436b9251416c7500faa7",
               "name": "Jonathan Marc Feldman",
               "profile_path": null,
               "id": 65060,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500faad",
               "name": "Mark Gordon",
               "profile_path": "/lATsud5NyaXaKE5p8H1kEkUsbWN.jpg",
               "id": 6048,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fab3",
               "name": "John Bard Manulis",
               "profile_path": null,
               "id": 38800,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fab9",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fabf",
               "name": "Christopher Meledandri",
               "profile_path": null,
               "id": 5720,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fac5",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500facb",
               "name": "Jerzy Zielinski",
               "profile_path": null,
               "id": 13140,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436b9251416c7500fad1",
               "name": "Michael R. Miller",
               "profile_path": null,
               "id": 5175,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.783677,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10419,
      "vote_count": 74,
      "budget": 0,
      "overview": "The story of a close-knit group of young kids in Nazi Germany who listen to banned swing music from the US. Soon dancing and fun leads to more difficult choices as the Nazi's begin tightening the grip on Germany. Each member of the group is forced to face some tough choices about right, wrong, and survival.",
      "similar": [
         424,
         9045,
         423,
         2253,
         16869,
         14574,
         637,
         228150,
         289222,
         15764,
         369885,
         746,
         821,
         1771,
         15121,
         5925,
         857,
         203833,
         289,
         613
      ],
      "original_title": "Swing Kids",
      "runtime": 112,
      "poster_path": "/dQOGz6FhLSMDAT4thqeDb9VTkvU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Touchwood Pacific Partners 1",
            "id": 8830,
            "origin_country": ""
         }
      ],
      "release_date": "1993-03-05",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "In a world on the brink of war. You either march to one tune or dance to another.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thomas Carter"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Jonathan Marc Feldman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0108265/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4NDAxNjA5NF5BMl5BanBnXkFtZTcwMzUyNTUyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Sean Leonard, Christian Bale, Frank Whaley | See full cast and crew »"],
      "reviews": [
         "I'm a History teacher and we use Swing Kids as an introduction to the topic of alternative youth groups in Nazi Germany. I'm not saying that the film is 100% accurate, obviously some dramatic licence has to be taken, but its not far off. Many people on this site have questioned the accuracy, and validity of the film, especially mentioning the lack of consideration of the treatment of the Jews. However that is not what this film is about (if that is what you want see The Pianist or Schindler's List - also excellent films). This film is looking at how some German youths avoided the Hitler Youth and the nazi regime insofar as they could, and what they spent their time doing (dancing, listening to swing music and being with their friends).It does show some useful aspects about how the Hitler Youth were expected to behave and the propaganda they were exposed to, as well as about swing youth and their attitude to the regime.It is an entertaining and poignant film which explores friendship,romance and growing up against the backdrop of one of the most vilified periods in modern history Basically Swing Kids does what it does well. Maybe it isn't a Schindler's List, but it does have its merits.Watch it and you'll find them! BTW - could I just point out, many people on here have referred to the Holocaust, as though it is interchangeable with the Nazi regime, and have used the phrase in their reviews. Just to clear up this: the holocaust specifically refers to the gassing of Jews at extermination camps from 1942 onwards, essentially the Final Solution. As this film is set in 1939 it is prior to this.",
         "The central characters in this movie are unpolitical teenagers who have no concern with the larger political issues of Naziism and simply want to enjoy themselves. Their only perspective is that Nazis are stuffy, conformist jerks and no fun at all. For this reason, a number of mainstream critics (among them Ebert and Berardinelli) trashed the picture for trivializing the crimes and horrors of the Third Reich. These critics, I think, miss the point. The value of the movie is precisely that it is trivial. There is no hindsight. The audience, like the characters, is caught up in the everydayness of everyday life in a totalitarian state. The Nazis are the government, and as far as anyone can see in 1938-39 they are going to go on being the government forever. The war hasn't happened yet. The Swastika flag flying over every post office and courthouse doesn't give them a little shudder of horror; it's as normal as the Stars and Stripes is to us. All sensible, respectable people who aren't Nazis themselves go along with the Nazis, because they have no reason not to. Auschwitz hasn't happened yet either. Sure, there are concentration camps out there somewhere, but that has nothing to do with normal, ordinary people who behave themselves. Unless you happen to know a Jew or a political dissident yourself, what the government is doing to people like that isn't your problem. The teen-aged lead characters find themselves in opposition and in trouble, not because they have any principled objections to the government, but simply because they find respectable culture boring and want to amuse themselves. The first reaction of authority, in the person of Kenneth Branagh's kindly Gestapo man, is that all they need is a good talking to, a second chance, and a little constructive guidance in the Hitler Youth and they'll grow up to be good citizens. He's fifty percent right; Thomas does respond positively to the comradeship and healthy outdoor activity he finds there. The ultimate choices made by the two boys are governed not by principle but by their personal situations. Thomas has been rebelling against his cold, pompous, wealthy father, whom he loathes, and he ultimately decides that being a dutiful Nazi and denouncing the old man to the Gestapo offers him much better revenge than dancing to illegal jazz records. Peter recoils from the Hitler Youth (and from his former friend) because his own father had disappeared, perhaps into the camps, after the Nazis took power several years earlier. There's's no hindsight in the movie's perspective, and no heroism. Instead, it gives us ordinary, everyday people dealing with ordinary everyday life as they find it, from the viewpoint of a high school student. The movie leads the adolescents who are its target audience to ask themselves an unpleasant question -- would they be any different, any more politically aware, if they were in the same situation? Indeed, would they even realize it if they were actually in the same situation now? The implicit answer is that they probably wouldn't be all that different from ordinary non-political German teenagers in 1938, minding their own business, going about their own lives, and at most trying to carve a little more personal space than the government wants to give them. That's disconcerting and not at all flattering, which is why Swing Kids is worth watching.",
         "Anyone who has stepped on to the dance floor with a live swing band playing knows just how well Swing Kids captures the electricity of a night of swing. Anyone who has strapped on their best duds an hour earlier knows knows the romance and anticipation captured perfectly as Peter Muller (Robert Sean Leonard) dresses for his last night of swing. This movie was in no small measure part of the impetus for the swing revival in the mid 90's, and I personally get \"in the mood\" for a night of cuttin' rug with Janis Siegel's incredible rendition of \"Bei Mir Bist Du Schon\" from the film. But what makes this film truly superlative is its honest dealings with ordinary Germans' motivations for complacency towards or participation in Nazism. In Nazi Germany it was in everybody's best interest (save the Jews) to play along. From Peter's mother who just wants her to children live happily and avoid the terrible fate of their father to Thomas Berger (Christian Bale) who finds acceptance and encouragement for the first time, they do so for the reasons that would tempt each of us sorely. The horrible truth of the Holocaust is that, like the Germans, very few of us possess the selflessness and moral courage it would have required to oppose the evil tide of Nazism. Swing Kids is almost alone in its portrayal of this chilling truth among Holocaust and World War II films. Robert Sean Leonard's portrayal of this moral struggle for understanding and courage is very moving. (Of course, there's noone better at playing angst-ridden. c.f. Dead Poet's Society.) As he dances his last dance, with the weight of the world on his shoulders, the world spinning around him, he finds a rare kind of release that is perhaps found only on the dance floor. And yes, his brother's cries, \"Swing Heil! Swing Heil!\", in the final scene give me a lump in the throat every time. For all these reasons and more, Swing Kids is an excellent film.",
         "i have read the comment about SWING KIDS not being authentic. well, after doing a bit of research on this topic (swing scene in germany in the third reich) i have to say that there was quite a big scene there. yes, the film might have exaggerated a bit (the hair was not quite as long and they had to cut down on the way they dressed even though they tried as much as they could on the zoot suit front). but it is a fact that there were dances in different cafes and they didnt like the Nazi regime. so i would say give the film makers some slack and a bit of artistic freedom! they tried to portray a group of youngsters that found cure in music and stuck together in a difficult time. i really appreciated this film as normally you wouldnt know about them at all!!! two thumbs up from me as well!!!",
         "I have always been a very big fan of swing music and am a \"Hollywood Jew\". I.e., not very religious or observant of the ancient traditions, but still a Jew in humor and emotions. So this movie never fails to make my tear up. To imagine a time and place where not only your seeming friends turn on you, but you can't even listen to your kind of music is a special kind of hell on earth. The dance and music sequences are wonderful and I can't see or hear them enough. Solid sounds, daddio! However, the film wisely preempts the reverie and jerks you back to the Nazi repression each time. It suggests how those poor \"Swingkleine\" must have felt. The sweet and sorrowful blend here. Someone criticized this picture for not showing enough death. I think the boxes of human ashes and the random Brownshirt raids show enough of that! This picture isn't about the Holocaust -- it's about trying to survive when your society goes seriously wrong. I will always think of \"Swing Kids\" when I hear the truism: \"It don' mean a thing if it ain't got that SWING. Do-wah do-wha do-wah do-wah do-wha do-wha do-wha do-WHAAAAA\".",
         "I really don't understand a lot of these reviewers. The movie far from trivializes anything about the Nazis, it simply tries to portray a moment before the bloodiest war in history on a smallish scale. Would it be better to just have a movie that says \"Nazis are bad and they killed six million Jews.\"? No, because that wouldn't be a movie. It's like when people complained that a mini-series about Hitler's life that was supposed to be shown on TV would \"humanize Hitler\". Well, news flash, he WAS a human. That's the worst part, a human could do that sort of thing. What good is it to call evil-doers monsters and then leave it at that? When \"Swing Kids\" succeeds is when it's portraying the conflicts of youth as their country goes mad. Can anyone honestly say they feel NO sympathy for those who were forced to join the Hitler youth? It's easy to say you would have done different. And the idea that the music being key somehow trivializes the events of WWII, um, it's based on an ACTUAL subculture, swing kids. There were lots of them and at first they were fairly lacking in politics, but later in the 40s when they were cracked down on more so by the Nazis some were more active. It's not like the movie makers pulled the concept of kids, Nazis and swing out of their asses, which is what people seem to think. And at least it was something, at least it wasn't giving in totally. Remember these were young kids, high-school age, nobody can expect them all to be Sophie Scholl. Where \"Swing Kids\" lacks is its occasional excessive heavy-handedness. The ending is a bit excessive, something more subtle would have been better. But as I say, the conflicts between the three main leads are fantastic and bring up questions of what you would do in such circumstances. I think the boys's indifference in respect to the Jew being beat up in the beginning of the movie is a good touch. This is NOT about the holocaust, because it was just starting and was largely unknown at the time. I hate when people can't lose what they know to watch a movie. I recommend everyone to read some swing kids history, just look them up, it makes the movie much better and more interesting to know the facts. This is a fairly good movie with very good acting, great great music and costumes, a great story that was influenced by deeply interesting history, and too much heavy handedness. But seriously, who can resist a movie put out by Disney that includes the line of dialog \"You're turning into a f*cking Nazi!\"?",
         "Four German teenage boys (Leonard, Bale, Whaley, and Batrok), living under Nazy reign in World War II, secretly play Swing music, American stuff that's been forbidden, and embrace the concepts of the musical heritage. But this is clearly an act of rebellion, so they must do it in secret clubs at night, avoiding the Gestapo. Their relationships and the outcomes are the study of this film, which is both uneven and, ultimately, very powerful. Roger Ebert detested this film for the fact that, to him, is unclear in it's message. He feels that the motives behind these teen's rebellion are stupid: It seems as if Hitler hadn't banned Swing music, then they would have thought that he was a swell guy. Actually, this observation on Mr. Ebert's behalf might be the film's point. They thought Hitler was a loser because of he didn't let them play their music. Through this fact, they learn that there is a much bigger problem here, and they know that they can't conform to it. So how do they rebell? Through the music that they cherish. Along the way, two of the boys, Leonard and Bale, are forced to join the Gestapo. Leonard doesn't embrace the teachings, but Bale is slowly brainwashed into conforming. Whaley is a cripple, and he therefore observes the Nazis from a different position. He soon begins to despise his two friends for their uniforms. While his character might be an arrogant jerk, it is clear that he's got a better idea about the evil that's going on than anyone else. Bartok is just sort of along for the ride, just wanting to hang out with his friends and play in his music...oblivious to what happens with the Jews or Nazis. So here we have four chief characters that pretty much represent probably the most basic attitudes of German citizens during the war: Brainwashed, aware, torn in between, and indifferent. The characters are well acted, and the balance and chemisty between them work. The message at the end is very clear and VERY powerful....I am often reminded of its subtle excellence, though I haven't seen it in a good while. Unfortunately, the film itself is uneven. Almost too much time is spent on the swing music itself. So much that it takes away from the message of the film. The music should have only served as a backdrop, and endless scenes of dancing almost threaten to take away from the impact of the theme. \"Almost\" is the key word. All in all, this is a most intriguing film. Kenneth Branagh appears unbilled, as a central Gestapo character. *** out of ****",
         "One of the basic reasons I like this movie is because it was one of the first movies I watched with my older brother that we both enjoyed. I don't have a lot in common with him, but this one movie opened up lots of opportunities for other movies. Other than that, I love this movie for its unique point of view. We always get the movies like Saving Private Ryan or Pearl Harbor, which are very important stories in themselves (and good movies of course) but how often do we get a movie about people who were part of the war from the beginning. people that didn't necessarily have a direct threat, but were still greatly affected. The story of Peter and Thomas and Arvid are wonderfully done. Peter is the kind of person any girl would like. Thomas, the rich brat that speaks his mind too much, helps put internal conflict in the group. Arvid seems to be the voice of reason, seeing what the Nazis are doing and doesn't want to be a part of it. The acting is great, of course. Peter, played by Robert Sean Leonard, is portrayed as soft spoken, confused, and even a little bitter. Thomas, played by the beautiful Christian Bale, is the kind of people that drive me nuts - just \"go along with it. We can have it both ways.\" It is virtually impossible to have it \"both ways.\" The guy who plays Arvid is a lovely actor, obviously talented, and shows emotion so well you'd think he went through this himself. The history of the movie might be a little tweaked to make a few interesting scenes, but to see what the Nazis were doing to the youth of their country, brainwashing them and telling them to spy on people, is appalling. No wonder a few former Nazi soldiers still think they were right. The music is like a whole nother character. This movie is what really got me to enjoy listening to swing music. Even though I can do very few steps, I realize now the feeling they got when they heard it and I get the same feeling, just not quite as strong probably. All around, this movie is wonderful. I love showing it to my friends, and it is very interesting and jerks at your emotions.",
         "This movie does a great job of showing a different angle on the WW2 time period. The struggles the youth of Germany went through during that time were portrayed very well. People complain that this movie doesn't show the horror of the holocaust and the awful persecution the Jews faced, but that is not what it's trying to do! We all read or hear about what the Nazis did to the Jews (& other minorities) and think that the Germans must have been horrible people to have even gone along with this. But this shows how the propaganda they were constantly fed--as well as the activities & sense of belonging the HJ (Hitler Jungen) experienced--could slowly twist their minds to the Nazi way of thinking. One of the excellent things about this movie is how it shows how the main characters change. The changes in Peter & Thomas come very slow and natural, and only when you get to the end (and maybe re-watch it) do you realize how drastically they have changed their views. (Thomas especially) There were some not-so-great things about the movie, like some characters or scenes which, when you think back, seem to have been included for an unknown reason. But the good points of the movie out-weigh the minor nit-picks. The swing music and dancing in the movie was awesome, and I thought all the characters were acted very well by the actors. They did a good job of showing the confusion that the young Germans must have felt, not knowing who was right. All in all, I really enjoyed this movie, and I think it makes you think as well.",
         "I do love swing music and love the music and artists from the era. So did my parents who were contemporary with it. But they had the good fortune to love it in the USA. It was a dangerous thing to like Benny Goodman, Count Basie, Duke Ellington and most of all Arthur Shawronsky who the authorities did know was Artie Shaw. But these squares were the Gestapo and Swing Kids is about the youth who loved American swing music at considerable cost. Robert Sean Leonard, Christian Bale, Frank Whaley are three friends who are into American swing at a time in their country when such \"jungle\" music was Verboten. Swing Kids is the story about how all three were dealing with the growing strangulation of culture. One of the opening scenes takes place at a forbidden swing club where the kids are cutting a rug to Benny Goodman when word comes the authorities are near. Without a beat the band turns into a typical German Oompah band, the kind of music Herr Schicklgruber deemed acceptable to German youth. Which was being swallowed up by the Hitler Youth and the social pressures to join are enormous. Something that we in this country cannot fathom. I'm not a big fan of the current Pope, but about the only thing I'll give Benedict XVI a pass on was joining the Hitler Youth. At a certain point the wiggle room got less and less. Barbara Hershey as Leonard's mother gives a good performance as a woman keeping company with a Gestapo official for a little more comfort. Her husband and Leonard and David Tom's father had been arrested by the Gestapo a few years back and died as a result of their custody. The Gestapo official is played by an unbilled Kenneth Branagh who took no billing for his part deliberately. Swing Kids has a timely lesson for today if some in federal authority will care to learn it. The fundamentalist Moslems just as the Nazis hate our decadent culture. The answer is keep importing it into places like Iran by the cargo ship load. Don't bomb them to death, just send them our music and films. By the way our own fundamentalist Christians hated that music as they hate the music of today. Something about authoritarianism of whatever stripe just hates contemporary culture, whatever it is at the time. Swing Kids is a valuable lesson about freedom of expression wrapped up in a good entertaining package."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": ["Hollywood Pictures"],
      "summaries": [
         "The story of a close-knit group of young kids in Nazi Germany who listen to banned swing music from the US. Soon dancing and fun leads to more difficult choices as the Nazis begin tightening the grip on Germany. Each member of the group is forced to face some tough choices about right, wrong, and survival.",
         "In (pre) World War II Germany, Swing music becomes the underground movement of young people. Two engineering students attempt to be Swing Kids by night and Hitler Youth by day. The impact of this decision is felt acutely by their friends and families. A charming SS officer complicates matters for Peter, whose father was taken away for defending his Jewish colleagues at the University.",
         "Kids all over the world and all through time want to rebel. Peter Muller (Robert Sean Leonard) and Thomas Berger (Christian Bale) are two such young men whose rebellion against the conformity of Nazi Germany took the form of a love of American swing music, British fashion, and Harlem slang. But when an innocent prank forces Peter into the Hitler Youth, their friendship and their loyalties are put to the test against the seductive power of Nazism.",
         "In Nazi Germany, the youth of the nation were pressed into joining the pro-Nazi Youth League called the \"Hitlerjugend\", or Hitler Youth. A group of rebel teenagers, however, chose to defy Nazi directives and grew their hair long and listened to American music while calling themselves the \"Swing Kids.\" This is the story of one group of Swing Kids and how Nazi rule and persuasion tore them apart and set them against each other."
      ],
      "budget": 0
   },
   "movielensId": 2106,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-03-05",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Thomas Carter"],
      "runtime": 112,
      "movieId": 2106,
      "title": "Swing Kids",
      "mpaa": "PG-13",
      "actors": [
         "Robert Sean Leonard",
         "Christian Bale",
         "Frank Whaley",
         "Barbara Hershey",
         "Tushka Bergen",
         "David Tom",
         "Mary Fogarty",
         "Kenneth Branagh"
      ],
      "imdbMovieId": "0108265",
      "originalTitle": "Swing Kids",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": ["62dy01f9tCk"],
      "plotSummary": "The story of a close-knit group of young kids in Nazi Germany who listen to banned swing music from the US. Soon dancing and fun leads to more difficult choices as the Nazi's begin tightening the grip on Germany. Each member of the group is forced to face some tough choices about right, wrong, and survival.",
      "tmdbMovieId": 10419,
      "avgRating": 3.34775,
      "releaseYear": "1993",
      "numRatings": 1665,
      "posterPath": "/dQOGz6FhLSMDAT4thqeDb9VTkvU.jpg"
   }
}