{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0109340",
      "video": false,
      "title": "The Browning Version",
      "recommendations": [
         41747,
         43940,
         73473,
         71576,
         48596,
         52636,
         47032,
         15730,
         343725,
         51722,
         55294,
         199291,
         103785,
         23523,
         32622,
         129417,
         37658,
         36141,
         29568
      ],
      "backdrop_path": "/iL83fUKMuV0uzh2Mq0wIjh23O5w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andrew Crocker-Harris",
               "gender": 0,
               "credit_id": "52fe47a8c3a36847f8141471",
               "name": "Albert Finney",
               "profile_path": "/2BTzSQUa3RXPqeeNjbJqnyIBePE.jpg",
               "id": 3926,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Laura Crocker-Harris",
               "gender": 1,
               "credit_id": "52fe47a8c3a36847f8141475",
               "name": "Greta Scacchi",
               "profile_path": "/uHPHNwBnhBIs1z2sJcKQODtaY2n.jpg",
               "id": 21245,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frank Hunter",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f8141479",
               "name": "Matthew Modine",
               "profile_path": "/tEQG1Us5IuoKYtufZe6waWtxfeg.jpg",
               "id": 8654,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Tom Gilbert",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f814147d",
               "name": "Julian Sands",
               "profile_path": "/hDb4UlbeTvvVK53Cmh7W0Ijo41h.jpg",
               "id": 6104,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Frobisher",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f8141481",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bryant",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f8141485",
               "name": "Jim Sturgess",
               "profile_path": "/fkK5UfM6g8880vaIAyw9qC9ehW2.jpg",
               "id": 38941,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Taplow",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f8141489",
               "name": "Ben Silverstone",
               "profile_path": "/qWdKvFZdO99b3IEszxUDqyvL3Db.jpg",
               "id": 68014,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Diana",
               "gender": 1,
               "credit_id": "52fe47a8c3a36847f814148d",
               "name": "Maryam d'Abo",
               "profile_path": "/2KQONgibNNv1zM3AMVwtsO9jUdU.jpg",
               "id": 10670,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Dr. Rafferty",
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f8141491",
               "name": "Bruce Myers",
               "profile_path": null,
               "id": 72328,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Wilson",
               "gender": 0,
               "credit_id": "52fe47a8c3a36847f8141495",
               "name": "Joe Beattie",
               "profile_path": null,
               "id": 146237,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Trubshaw",
               "gender": 0,
               "credit_id": "5871b52c925141356c010556",
               "name": "Oliver Milburn",
               "profile_path": "/c9zA7fID5K53QxCQ0utHfxEOAw2.jpg",
               "id": 95023,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Adakendi Senior",
               "gender": 2,
               "credit_id": "5871b546c3a3684f16010c7a",
               "name": "George Harris",
               "profile_path": "/dqfdsdtliWJ7yvJupQXxphllHkK.jpg",
               "id": 2247,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f814149b",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47a8c3a36847f81414a1",
               "name": "Terence Rattigan",
               "profile_path": null,
               "id": 137992,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe47a8c3a36847f81414a7",
               "name": "Ronald Harwood",
               "profile_path": "/kFxKyfaXcaWd4E0tOm0B1FLYnBC.jpg",
               "id": 3558,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.598264,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 49805,
      "vote_count": 14,
      "budget": 0,
      "overview": "Andrew Crocker-Harris is an embittered and disliked teacher of Greek and Latin at a British prep school. After nearly 20 years of service, he is being forced to retire on the pretext of his health, and perhaps may not even be given a pension. The boys regard him as a Hitler, with some justification. His wife Laura is unfaithful, and lives to wound him any way she can. Andrew must come to terms with his failed life and regain at least his own self-respect.",
      "similar": [],
      "original_title": "The Browning Version",
      "runtime": 97,
      "poster_path": "/xjWc2uWrcGLwC87JN2CbxseGKQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1994-10-12",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "The greatest lessons in the life and the ones learned by heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Mike Figgis"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Terence Rattigan",
         "Ronald Harwood"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109340/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MjM0OTUwMF5BMl5BanBnXkFtZTcwMTg1NDAwMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Albert Finney, Greta Scacchi, Matthew Modine | See full cast and crew »"],
      "reviews": [
         "This movie touches one's soul. Albert Finney gives a heartfelt performance as an old, crusty, teacher, who reflects on his career and life in the days leading to his retirement. He comes to the realization that his entire life's work has been, for the most part, in vain. It is reminiscent of Tolstoy's Death of Ivan Illyich. While in Tolstoy's Illyich, the character reflects on his life while on his death bed, Finney's soul searching is triggered by his imminent retirement. He realizes that his marriage has failed and that none of his students, with the exception of one, appear to have any appreciation and respect for him. Finney gives a remarkable performance in the lead role. Have Kleenex handy when you watch this one.",
         "Albert Finney gives a classic portrayal of a teacher of the times. This movie shows so clearly the invisible gap which existed between teacher and pupil. It was extremely difficult if not impossible to come close to teachers in those days. The innocence of Taplow played brilliantly by Ben Silverstone and his genuine regard and respect for the aging Crocker=Harris, provides the viewer with an intimate encounter in which this teacher who is in a failed marriage, has not accomplished his ambitions to be head of the school, suddenly realises in the form of \"Taplow\", that he is genuinely loved for what he is, a good teacher who showed his love for the boys by, discipline and teaching. Little wonder that Crocker-Harris weeps when the truth dawns on him. Watch this movie and weep too. Absolutely first class.",
         "A touching,gentle movie,The Browning Version is perhaps hugely under-rated. The simple tale of an aging school teacher forced into retirement actually contains many poetic metaphors for struggle.Crocker-Harris finds himself at one of life's great crossroads and wrestles with the inner turmoil of the knowledge that his life-work may have been futile.His convictions about language and literature are to be swept aside with the arrival of his successor and his still-beautiful wife,sympathetically played by Greta Scaachi,is as distant as his pupils. Finney plays this role with a calm and measure that is evidence of a great actor at work.Perhaps only Hopkins could have hoped to have done so well with this role. The score is excellent and the cinematography elegant.A great \"English\" film in every sense;my only wish is that it might have been a little longer.Somehow,an epic running time may have yielded the acclaim that it justly deserved.",
         "The movie lives with the superior performance of Albert Finney, who puts Crocker-Harris alive so tremendously, that you can't help but suffer with him. So much that you nearly wish to jump into the screen\u0085 ...to support that poor man in his struggle against unfairness. Finney plays a senior teacher at an English elite school, who is not very popular, even addressed with the nickname \"Hitler\" of his form, due to his severe strictness and dry adoration for the classical, but dead poets of ancient Greek and Latin. As a perfect British gentleman he is tied by fully self-controlled formality, holding back all his emotions. He is totally obliged to conventions, always saying yes to everything. Except once.",
         "Albert Finney and Greta Scacchi have given a fabulous performance. Indeed this is a rare gem in cinema. I give this 9 out of 10. The script is tight, the music score good and the performances are amazing. Its a simple story of a school teacher who is forced to retire. He finds no comfort in his retirement as he is denied his pension and there is absolutely no one in the school who is sad to see him go. Living with an unfaithful life, this school teacher lives a lonely life. Never to bow down to anyone and nor letting anyone sympathise with him, he portrays a classic and rare case of a strong human being. As i say this, it was sad to see him break down when a kid showers him a rare gift of love. If this movie does not touch your soul or move you, then you truly belong to the cold hearted. Keep a handkerchief ready. Please watch this movie. It is a masterpiece .",
         "The Browning Version(1994) Director Mike Figgis(Leaving Las Vegas)does a wonderful job in this remake of the 1951 classic about an unpopular teacher( Albert Finney) who realizes his life has been a failure after being forced into early retirement because of a heart condition and his relationship with his 20 year younger unfaithful wife(played by the beautiful Greta Scacchi).Its always a pleasure to see Finney, certainly one of the finest actors alive,and maybe even the best, give a gut wrenching performance as the out of touch teacher forced to face an uncertain future. The excellent supporting cast includes Julian Sands and Matthew Modine. A very intelligent, well made movie recommended for all serious film buffs",
         "This is one of those movies that are easy to overlook because of their lack of special effects, bone-rattling audio, and sexual situations. Nevertheless, The Browning Version tells a poignant story of an aging teacher who is being shunted aside in favor of a younger replacement. Albert Finney is wonderful as Crocker-Harris, \"the Hitler of the lower sixth,\" whose health is failing and whose enthusiasm for teaching is gone. Greta Scacchi is equally good as his unfaithful wife. Her nuanced performance is one way in which this version is superior to the much-admired Michael Redgrave issue of 1951. In the latter, Jean Kent plays an unrelenting bitch who cares not a whit for her husband's plight. One cannot, under any circumstances, imagine how the two characters ever got together. In the new rendition, however, one can see how the lovely Miss Scacchi might have fallen for the athletically built Finney. As a result, one can better appreciate the disillusionment and bitterness that inform her character as she contemplates what he has become.",
         "This is not, perhaps, the most moving or emotional film you are likely to see. However it is my opinion that The Browning Version displays some of the finest acting ever to be seen by Albert Finney and his supporting cast. The story itself is very well written and sets an example for other British films to follow. So if you are fed up with action packed, no-brainer movies and would like something to sit back, watch and enjoy then The Browning Version is the film you need.",
         "I don't think I have the gift of words to write something that makes brilliant sense. Some movies are good, some movies aren't. This movie is just a superb thing. Everything is done with class. The acting is fine and subtle and the scene where the old teacher gets the book and he starts crying is magnificent. The soundtrack satisfies all my needs with it's romantic melodies and perfect timing. This movie is a must-see.",
         "The performance by Albert Finney is a beautiful and powerful one of inner emotion, misunderstanding and unapreciation. On a simply level it makes you more reflective and retrospective of your school days and those who nurtured us, but on a deeper level it brings, in many different examples, you a deeper understanding of the turmoil people go through, from a miss understood teacher who`s sharp exterior hides a broken heart, to the troubles of a young boy who feels for this man, and has domestic troubles of his own. Not a unique film as comparisons of varying strengths can be made to films such as `Goodbye Mr Chips` and `Dead Poets Society`, but still an amazingly powerful and emotive film."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Percy Main"],
      "summaries": [
         "Andrew Crocker-Harris is an embittered and disliked teacher of Greek and Latin at a British public school. After nearly 20 years of service, he is being forced to retire on the pretext of his health, and perhaps may not even be given a pension. The boys regard him as a Hitler, with some justification. His wife Laura is unfaithful, and lives to wound him any way she can. Andrew must come to terms with his failed life and regain at least his own self-respect.",
         "A student (Taplow, played by Ben Silverstone) completely changes the the self-perception of his master (Andrew Crocker-Harris, played Albert Finney) so that he can accept his forced retirement from his academic establishment his head with his head held high."
      ],
      "budget": 0
   },
   "movielensId": 211,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-12",
      "dvdReleaseDate": "2003-10-14",
      "directors": ["Mike Figgis"],
      "runtime": 97,
      "movieId": 211,
      "title": "The Browning Version",
      "mpaa": "",
      "actors": [
         "Albert Finney",
         "Greta Scacchi",
         "Matthew Modine",
         "Julian Sands",
         "Michael Gambon",
         "Jim Sturgess",
         "Ben Silverstone",
         "Maryam d'Abo",
         "Bruce Myers",
         "Joe Beattie",
         "Oliver Milburn",
         "George Harris"
      ],
      "imdbMovieId": "0109340",
      "originalTitle": "The Browning Version",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["fSqvtspQonw"],
      "plotSummary": "Andrew Crocker-Harris is an embittered and disliked teacher of Greek and Latin at a British prep school. After nearly 20 years of service, he is being forced to retire on the pretext of his health, and perhaps may not even be given a pension. The boys regard him as a Hitler, with some justification. His wife Laura is unfaithful, and lives to wound him any way she can. Andrew must come to terms with his failed life and regain at least his own self-respect.",
      "tmdbMovieId": 49805,
      "avgRating": 3.58484,
      "releaseYear": "1994",
      "numRatings": 607,
      "posterPath": "/xjWc2uWrcGLwC87JN2CbxseGKQ.jpg"
   }
}