{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "street gang",
            "id": 542
         },
         {
            "name": "children's home",
            "id": 6272
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "juvenile delinquent",
            "id": 14857
         },
         {
            "name": "based on young adult novel",
            "id": 223438
         }
      ],
      "imdb_id": "tt0086066",
      "video": false,
      "title": "The Outsiders",
      "recommendations": [
         9346,
         232,
         11557,
         11873,
         11522,
         11967,
         11814,
         7520,
         9749,
         13342,
         21309,
         15144,
         9663,
         10023,
         838,
         15143,
         11976,
         11418,
         9080,
         11591
      ],
      "backdrop_path": "/2Y9Zb61gL4w0eUgyla4IELWqzGh.jpg",
      "revenue": 33697647,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Dallas 'Dally' Winston",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bd5",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Johnny Cade",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bd9",
               "name": "Ralph Macchio",
               "profile_path": "/nTiV5ux56X4dmX5Qvriw8r7SgLz.jpg",
               "id": 2877,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Ponyboy Curtis",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bdd",
               "name": "C. Thomas Howell",
               "profile_path": "/8PFMkxOnn1JEKwd0nlbBuZfS7Sf.jpg",
               "id": 2878,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Darrel 'Darry' Curtis",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008be1",
               "name": "Patrick Swayze",
               "profile_path": "/b5G8AGP609DsUeokQ1asnqYJBSl.jpg",
               "id": 723,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Sodapop Curtis",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008be5",
               "name": "Rob Lowe",
               "profile_path": "/yt6vMZVBXGCJL0xRE4jFa4SjzcQ.jpg",
               "id": 2879,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Keith 'Two-Bit' Mathews",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008be9",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Steve Randle",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bed",
               "name": "Tom Cruise",
               "profile_path": "/3oWEuo0e8Nx8JvkqYCDec2iMY6K.jpg",
               "id": 500,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Tim Shepard",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bf1",
               "name": "Glenn Withrow",
               "profile_path": null,
               "id": 2881,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Sherri 'Cherry' Valance",
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008bf5",
               "name": "Diane Lane",
               "profile_path": "/81fhEMQlbhQ3mbI5ghq9RUrjkLB.jpg",
               "id": 2882,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Bob Sheldon",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bf9",
               "name": "Leif Garrett",
               "profile_path": "/bjzqSgp3vfbpMSBR1p4Q1D5CDFp.jpg",
               "id": 2883,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Randy Anderson",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bfd",
               "name": "Darren Dalton",
               "profile_path": "/ilvaY9lSWPWMPXxRmrDBTl3xbWm.jpg",
               "id": 2884,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Marcia",
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008c01",
               "name": "Michelle Meyrink",
               "profile_path": null,
               "id": 2885,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Jerry Wood",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008c05",
               "name": "Gailard Sartain",
               "profile_path": "/QFQlZdsM0QEUDWll19fgnxALYq.jpg",
               "id": 2886,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Buck Merrill",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008c09",
               "name": "Tom Waits",
               "profile_path": "/3XXe20xrdgUaOchQt5YOQqqSH6u.jpg",
               "id": 2887,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Little Girl (as Domino)",
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008c0d",
               "name": "Sofia Coppola",
               "profile_path": "/zG1WS4sS5jvYkObHMxsK6fGK7Uk.jpg",
               "id": 1769,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Store Clerk",
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008c17",
               "name": "William Smith",
               "profile_path": "/rlO5RpMwYgyLmD9QsePedpsS8Dq.jpg",
               "id": 98102,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008b9b",
               "name": "Francis Ford Coppola",
               "profile_path": "/vEGwqahu7UlI6OwELy92xbXk9Kd.jpg",
               "id": 1776,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008ba1",
               "name": "S.E. Hinton",
               "profile_path": "/nIXzHUlp1LzclFkiQAGY40bw65b.jpg",
               "id": 2868,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bad",
               "name": "Gray Frederickson",
               "profile_path": null,
               "id": 2870,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bb3",
               "name": "Fred Roos",
               "profile_path": null,
               "id": 2871,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bb9",
               "name": "Carmine Coppola",
               "profile_path": "/kMTbFLKb8wzgRMCUx6aVy8GxIoq.jpg",
               "id": 2872,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bbf",
               "name": "Stephen H. Burum",
               "profile_path": null,
               "id": 1258,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008bc5",
               "name": "Anne Goursaud",
               "profile_path": null,
               "id": 2873,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008bcb",
               "name": "Janet Hirshenson",
               "profile_path": null,
               "id": 2874,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4229c3a36847f8008bd1",
               "name": "Dean Tavoularis",
               "profile_path": null,
               "id": 2875,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe4229c3a36847f8008c13",
               "name": "Richard Beggs",
               "profile_path": null,
               "id": 2889,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4229c3a36847f8008c1d",
               "name": "Kathleen Rowell",
               "profile_path": null,
               "id": 2869,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.088729,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 227,
      "vote_count": 376,
      "budget": 10000000,
      "overview": "When two poor greasers, Johnny, and Ponyboy are assaulted by a vicious gang, the socs, and Johnny kills one of the attackers, tension begins to mount between the two rival gangs, setting off a turbulent chain of events.",
      "similar": [
         449176,
         43923,
         308369,
         13223,
         222935,
         76726,
         598,
         10229,
         85350,
         84892,
         112160,
         328387,
         397837,
         227156,
         286565,
         2105,
         8363,
         674,
         272693,
         9880
      ],
      "original_title": "The Outsiders",
      "runtime": 91,
      "poster_path": "/35K8ItoRuD7i0VBqjj8bEX0Ct6E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ueaENQkPcy8rlr5fGZVBXKOhlBh.png",
            "name": "American Zoetrope",
            "id": 70,
            "origin_country": "US"
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1983-03-25",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "They grew up on the outside of society. They weren't looking for a fight. They were looking to belong.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Francis Ford Coppola"],
      "runtime": 91,
      "synopsis": "The film opens with Ponyboy Curtis (C. Thomas Howell) sitting at his desk in his room, writing. He talks about walking home from the movies one night. As he is bouncing and messing with a red ball, he is reciting parts of the movie that he had just seen when a group of guys pull up in a red Corvair. They start to call him a greaser because he has greasy hair and he tries to evade them. They are the Socials, clean cut teens dressed in Varsity letter jackets and chinos, also known as the rich kids or the South Side Socs. The Socs stop beside him and get out. They attack Pony, and knock him to the ground as he struggles. The soc on top of Pony, puts his knees on Pony's elbows, saying, \"How would you like that haircut to begin just below the neck?\" Ponyboy struggles but is unable to unpin himself. As they Socs try and shut him up, the knife accidentally slips and cuts his head slightly. Soon Pony's 2 older brothers, Darrel Curtis (Patrick Swayze), Sodapop Curtis (Rob Lowe), and the rest of their gang, Johnny Cade (Ralph Macchio), Dallas Winston (Matt Dillion), Steve Randall (Tom Cruise), and Two-Bit Matthews (Emilio Estevez) come to his rescue, hearing his screams. The boys chase off the Socs. Darrel, Sodapop and Ponyboy are three brothers who have lost their parents in a car crash. Darrel is a high school grad and has a job, he acts as the father figure. Steve has dropped out of school and works at a local gas station. The three are allowed to live together without parental supervision as long as they stay out of trouble. Pony is still in high school at the insistence of Darrel, who is often overbearing. Dallas, Johnny and Ponyboy go to a drive-in movie and sit in the bleachers. Cherry (Diane Lane) has an argument with her Soc date and leaves his car, she sits in front of the greasers with her friend . Dallas tries to chat her up but Cherry seems to connect more with Ponyboy and Johnny. Dallas finally says something offensive and Cherry, unafraid of his tough-guy attitude, tells him to shut his mouth. When Dallas reaches for her, Johnny stops him, being the only member of the group able to do so. Spurned, Dallas stalks off. Pony goes with Cherry to the concession stand. While waiting in line, they talk about their respective friends. Pony's view is that he and his friends are persecuted by the Socs because they're poor, dress differently and are often considered delinquents. Cherry counters, saying that her group has their own problems, ones that the greasers couldn't even dream of. Back at their seats, Two-Bit joins the group and after the movie ends the three boys and two girls walk together chatting. Cherry's boyfriend, Bob, in the blue mustang stops nearby. He's quite drunk and harshly admonishes her for hanging out with the greasers. To avoid a fight, Cherry reluctantly goes with Bob. Later the Socs ambush Ponyboy and Johnny by a park with a large fountain. The Socs dunk Ponyboy's head in the water, Johnny pulls out a switchblade and comes to defend his friend. Bob is left dead and everyone flees. Johnny and Ponyboy look for Dallas at a friend's house and he gives them some directions to hide out in an abandoned church in the next county. Johnny and Ponyboy hop a freight train and make their way, they break into the church and fall asleep. The next morning Johnny comes back with food, cigarettes, peroxide and a paperback copy of \"Gone With the Wind\". They cut their hair with pocket knives and Ponyboy dyes his hair bright blonde in an attempt to disguise themselves. The two spend several days playing cards, Pony reads \"Gone With the Wind\" to Johnny and trying to trap a rabbit that lives nearby. One morning, Pony wakes up early and sees the valley below the church in the sunrise, admiring it's beauty. He recites a Robert Frost poem, \"Nothing Gold Can Stay\" that Johnny takes to heart. A few days later Dallas arrives in a convertible T-Bird and takes them out for a burger. Johnny wants to turn himself in as it sounds like they can claim self-defense but Dallas tries to discourage him warning him of what can happen in prison. On returning to the church they find it burning and a group of young kids milling about with two adults and a school bus. The woman exclaims some kids are trapped inside. Johnny and Ponyboy enter to rescue the kids, Dallas reluctantly follows. In the smoke and fire Johnny is badly burnt and his back is broken when the roof collapses. Dallas pulls both of them to safety. EMS finally arrive. The boys are all hailed as heroes, Ponyboy is happily reunited with Darrel and Sodapop. The Socs and Greasers plan a big rumble to settle things. Cherry acts as the go-between, no knives or other weapons allowed, the fight will only be hand-to-hand. Two-Bit and Pony go to the hospital to visit Dallas and Johnny. Johnny is suffering from horrible burns and is in traction, seemingly paralyzed. The visit is very emotional and Johnny becomes very upset when a nurse tells him that his mother came to visit. Johnny doesn't want to see his mother, whom he feels doesn't care about him. When he orders the nurse to send her away, he faints. Pony and Two-Bit leave, obviously shaken by the encounter. When they visit Dallas, he is arguing with a nurse. Dallas asks about Johnny & the boys tells him the outcome doesn't look very promising. Dallas is desperate to join the big rumble and asks Two-Bit for his knife talking about revenge for Johnny's sake. On the night of the rumble Ponyboy, despite signs of exhaustion, wants to join. Darrell reluctantly lets him participate, telling he and Soda to run from the fight if the cops arrive. The Socs arrive and as a pouring rain starts the big rumble gets underway as the groups pair off and start slugging. Both sides get their licks in but after a while the Socs retreat, the Greasers whoop with delight at their victory. Just before the first punch is thrown, Dallas arrives, having left the hospital. When the fight ends, Dallas grabs Pony and they drive to the hospital to see Johnny, who is weaker than ever. On the way, Dallas tells Pony to stay tough and nothing will ever phase him. When they arrive, Dallas tells Johnny that the Socs have been driven out of their territory for good. Johnny seems not to care and tells Pony to \"stay gold\". He dies and Dallas becomes incredibly upset, clicking his pistol, which is not loaded, at a doctor and babbling madly. Pony heads home to find Darrell and the rest of the gang nursing their wounds. Pony tells them that Johnny died and Dallas left in a fury. Pony is worried Dallas will have a meltdown. Dallas robs a corner store (U-Tote-M) but is shot and wounded. He calls Pony's house, asking for a place to hide from the police. The cops chase him and shoot him in a nearby park when he waves the unloaded gun at them. His friends arrive just as he dies, his last word is \"Pony\". Pony faints from his exhaustion. At home Darrel rides Ponyboy, Sodapop runs off into the night. The three brothers join up and Sodapop tells Darrel to stop being so hard on Ponyboy, the three only have each other and they all need to get along. They have a group hug and return home. At the trial Cherry gives her testimony and Ponyboy is declared not guilty. All are happy. Back at school Ponyboy is now neatly dressed and coiffed, Cherry ignores him and a teacher gives him another chance to finish his assignment. At home at his study desk he sits down and begins to write his story, starting with the moment he left the movie theater. \"When I stepped out into the bright sunlight from the darkness of the movie house, I only had two things on my mind...Paul Newman and a ride home.\"",
      "writers": [
         "Kathleen Rowell",
         "S.E. Hinton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086066/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxMDQ0OTM3OV5BMl5BanBnXkFtZTYwNTkxODI5._V1._CR24,22,273,428_SX214_AL_.jpg",
      "actors": ["Stars: C. Thomas Howell, Matt Dillon, Ralph Macchio | See full cast and crew »"],
      "reviews": [
         "This lovely film was universally trashed and smashed by all the critics. FF Coppola directed it, but they still smashed it. I don't get that. The then unknown cast was: Patrick Swayze, Matt Dillon, C. Thomas Howell, Rob Lowe, Ralph Macchio, Tom Cruise, Emilio Estevez, Diane Lane, and Leif Garrett. All these actors went on to fame, but the whole movie, the performances, the writing, were trashed. I thought the cinematography was exceptionally lovely. The \"Nothing Gold Can Stay\" sunrise scene was gorgeous. The camera angles during the hair cutting scenes were creative and intimate. The music was \"epic\" sounding, yeah, but this film had a huge tie in with Gone With The Wind, remember. I thought the soft lighting and the creamy edging made the film look very much like IT was filmed in 1939!!! I don't know. I thought the chracters were very engaging and the performances excellent. Lots of people loved this film, regular people like myself, that is.",
         "A gem from Francis Ford Coppola based on S.E. Hinton's novel. Teenage gang members in a mid 60's Oklahoma town become involved in murder, leading to tragic consequences for all concerned. Filmed mostly in Tulsa, Oklahoma, with a very impressive list of young actors on their way to stardom. The cast includes Matt Dillon, Patrick Swayze, Rob Lowe and Tom Cruise. Also featured are Emilio Estevez, Diane Lane, C. Thomas Howell, Gailard Sartain and Ralph Macchio. A coming of age movie that packs a punch. Very much worth your time.",
         "I had to read the book in seventh grade and we also watched the movie. I though both of them were fabulous. Francis Ford Coppola has adapted almost every detail of the book into this movie. I thought the acting was great and the plot was good for teenagers, which is the movie's, as well as the book's, target audience. I was surprised on how many stars were in this movie (seven) and it was much better than I thought it would be. It didn't seem cheesy and small but you felt like you were watching a real film. Even though the Greasers seem to be born into undesirable lives, watching this movie makes you want to go back to 1967 in the Southwest and be a Greaser, too. Fabulous movie and perfect for teenagers.",
         "\"The Outsiders\" was one of my favorite novels I read in high school, and the film version is just as powerful. -- Set in a small town in 1963 Oklahoma, two groups of teenagers from opposite sides of the tracks defend their \"turf\" and rival for girls. The \"Greasers\" are tired of being shown-up by the \"Soashes\", who drive around in fancy cars and wear expensive clothes, and when someone calls for a \"rumble\", both sides are in for the fight. The main plot line centers around two of the younger \"Greasers\" who are on the run after one of them kills a \"Soash\", even though it was clearly self defense. Later the boys are celebrated as heroes when they rescue children from a burning building. The dying words of the alleged killer sum up the entire story: The fighting must stop; there are better ways to communicate other than kill one another. The Stevie Wonder song \"Stay Gold\" is a nice finishing touch. I especially recommend this film for teenagers or young adults; the message is a powerful one and it hasn't aged over the decades.",
         "The Outsiders is one of the best movies and books ever written! It was manatory for me to read it and I got right in with the characters. The movie is......... I can't describe it, it's that awesome! I personally, fell in love with it so much that I've read it 5 times and have seen it 45 times. This movie really brings out the book and if you have not seen it, but you've read it go to your local movie store and rent it! Or, if you have not even read it go read it! This is a movie that you will talk about with your friends and will always remember. Both Coppola and Hinton did a great job with this. This movie included excellent acting to, Matt Dillon, C. Thomas Howell, Ralph Macchio, Emilio Estevez, Rob Lowe, Patrick Swayze, and Tom Cruise. This movie will surly be popular with those who love Drama.",
         "I think that both the movie and the book were outstanding. The book sent off an amazing image in my mind in-order for me to picture the \"happenings\" included through the lives of these young kids. In the movie, I thought it sent off a different type of perspective, and yet it was very well done because of the fact that it was changed a bit, though, it was basically a better image of the story where you can see through your eyes, so that you were able to picture and make out with what you originally were thinking. Very well done! The actors were placed in very well positions, and each actor really fit each character the story The Outsiders. =)",
         "First let me say that this will not be a comment where the author will be gushing about how \"hot\" the cast is! Like a lot of people who have commented on this film I, too, read the book first in school and then proceeded to seek out the film to see how the story translated to the screen. I thought esteemed director Francis Ford Coppola (The Godfather, Apocalypse Now) did a fairly competent job of adapting the book (there will always be somerevisions and omissions in such an enterprise). He preserved the essence of the class struggle: the eternal conflict between those who were better favored by birth and station (Socs) with those less favored (Greasers). Coppola elicited more than competent performances from the young up-and-coming cast he assembled. All in all, a very good coming of age film.",
         "The Outsiders is a great adaptation of S.E Hinton's wonderful (and heart-breaking) novel. The film is a piece of art. It's got a good, solid story, beautiful photography, convincing acting by the leading actors and a nice score. It's a star-packed film with appearances by Tom Cruise, Rob Lowe, Patrick Swayze among others. (Not to mention it was directed by Francis Ford Coppola!) But I was most amazed by C. Thomas Howell's portrayal of Ponyboy Curtis, the central character of the novel and film, who did a great job carrying the story. There are many scenes in the film that are exactly like the book, even following the same dialogue. Usually I don't think that's a good thing since I like to see someone else's interpretation, another one's point of view instead of a copy of the book. But Coppola masters everything beautifully anyway so it never gets boring and C. Thomas Howell's interpretation of his role is what makes the film stand on its own. Thanks to Howell there are many memorable Ponyboy moments. One of those is Ponyboy's recital of Robert Frost's 'Nothing Gold can stay', which is a scene that stays with you forever. Another actor who caught my attention in this film was Emilio Estevez who plays Two-Bit Mathews, friend of the Curtis brothers and a greaser. Estevez lights up every scene he's in and the film wouldn't be as great without him. There are only two things I don't like about the film: The greasers are too well-groomed and clean and the socs are a too one-dimensional.",
         "The Outsiders is a great film, well done and well acted, I read the novel by S.E. Hinton, great book. I am glad they made this movie back in 1983. The Outsiders touched on a lot of issues when it came to having money and not having money, the \"greasers\" where the poor kids from the north side of town and the \"socs\" are the rich kids from the south side of town. Matt Dillon(Over The Edge, The Flamingo Kid) as Dallas Winston, Tom Cruise(Top Gun, Vanilla Sky, and Minority Report)as Steve, Ralph Macchio(The Karate Kid Parts I,II,and III) as Johnny Cade, C. Thomas Howell(The Hitcher, Red Dawn,and Soul Man) as Ponyboy Curtis, Rob Lowe(About Last Night, St. Elmo's Fire and Wayne's World)as Sodapop Curtis, Patrick Swayze(Red Dawn, Grandview U.S.A. and Point Break) as Darrell Curtis. Emilio Estevez(The Breakfast Club, Repo Man, St. Elmo's Fire and Nightmares) as Two Bit Matthews, Diane Lane(My Dog Skip, Streets of Fire, and Unfaithful) as Cherry Valance, Darren Dalton(Red Dawn) as Randy, and former teen heart throb Leif Garrett as Bob Sheldon, William Smith(Any Which Way You Can, Red Dawn and Conan The Barbarian) as the stork clerk, Michelle Meyrink(Valley Girl, Real Genius, and Revenge of the Nerds) as Marcia, make up the great cast for this awesome film. The movie really touched me in lots of ways, the story of kids being on the wrong side of the tracks, like Ponyboy and Johnny, who have a lot of heart and goodness inside. The movie does show what the true meaning of friendship and spirituality, especially Ponyboy loving sunsets. The poem by Robert Frost, \"Nothing Gold Can Stay\", does have a lot of meaning about youth and the moments of enjoying things you find wonderful when you are young, you should always embrace them. I give this movie 2 thumbs up and 10/10 stars. Francis Ford Coppola did an excellent job directing the movie. The song, \"Stay Gold\", is such a great song, sung really well by Stevie Wonder.",
         "When I first read the book, I thought it was excellent. Then after reading the book, I decided to watch the movie. The first time I watched it I thought it was horrible, but then I watched it a second time and started realizing what the director was trying to point out. I thought that Coppola left out ALOT of VERY important details, like the first chapter, which wasn't really important but more then some scenes he put in. I also think he could have picked the actors better, not by how they acted (they acted great, but by how they looked, in the book it said Dally was towheaded (blonde) and he had dark brown hair in the movie, and it also said he was ugly and frightening, but I found him pretty good looking, BUT it was played by Matt Dillon. Now I have the movie and have watched it a hundred times, and liking it more every time I see it. I have also read the book over and over, and find it better then the movie. If you are to watch the movie, read the book first because then the film will be easier to understand. I would recommend, both the movie and book to young adults. It was done wonderfully and the actors were great, especially Matt Dillon and Rob Lowe, even though he only had a few lines."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Zoetrope Studios"],
      "summaries": [
         "The movie details a town split between the wealthy South Zone gang called 'The Socials' and the poor North Zone gang called 'The Greasers'. Dallas Winston, Ponyboy Curtis and Johnny Cade from 'The Greasers' befriend the rich Cherry Valance and Marcia at a drive-in. Later that night, a group of 'The Socs' chase and beat up Johnny and attempt to drown Ponyboy in a fountain. However, Johnny stabs one Soc and kills him, saving Ponyboy. The desperate boys seek Dallas who finds a hideout for them in a nearby town. One week later, Johnny and Ponyboy decide to return to their hometown, with Dallas, to claim the murder as self-defense. But on their way back, they see the church on fire and Ponyboy and Johnny help the children trapped in the church and become heroes. However Johnny is badly wounded and confined to the hospital. Meanwhile The Socs and The Greasers prepare to fight.",
         "The tension between two groups: The Greasers and The Socials \"Socs\" puts Ponyboy Curtis and his best friend Johnny Cade in a bad spot. One night at the movies, Ponyboy and Johnny fall in love with Sherri \"Cherry\" Valance and Marcia - once they get Dally Winston, the toughest and meanest of the Greasers to stop attempting to \"score\" with the girls. Cherry and Marcia are from the snobbish, popular, and rich group, the Socs.",
         "The rivalry between two gangs, the poor Greasers and the rich Socs, only heats up when one gang member kills a member of the other."
      ],
      "budget": 10000000
   },
   "movielensId": 2114,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-03-25",
      "dvdReleaseDate": "2005-09-20",
      "directors": ["Francis Ford Coppola"],
      "runtime": 91,
      "movieId": 2114,
      "title": "The Outsiders",
      "mpaa": "PG",
      "actors": [
         "Matt Dillon",
         "Ralph Macchio",
         "C. Thomas Howell",
         "Patrick Swayze",
         "Rob Lowe",
         "Emilio Estevez",
         "Tom Cruise",
         "Glenn Withrow",
         "Diane Lane",
         "Leif Garrett",
         "Darren Dalton",
         "Michelle Meyrink",
         "Gailard Sartain",
         "Tom Waits",
         "Sofia Coppola",
         "William Smith"
      ],
      "imdbMovieId": "0086066",
      "originalTitle": "The Outsiders",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "8tgJqnVMAtc",
         "Q0mBUs9Mcgg"
      ],
      "plotSummary": "When two poor greasers, Johnny, and Ponyboy are assaulted by a vicious gang, the socs, and Johnny kills one of the attackers, tension begins to mount between the two rival gangs, setting off a turbulent chain of events.",
      "tmdbMovieId": 227,
      "avgRating": 3.60038,
      "releaseYear": "1983",
      "numRatings": 3985,
      "posterPath": "/35K8ItoRuD7i0VBqjj8bEX0Ct6E.jpg"
   }
}