{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "buddhist monk",
            "id": 1529
         },
         {
            "name": "mountain lake",
            "id": 1531
         },
         {
            "name": "tibet",
            "id": 4558
         }
      ],
      "imdb_id": "tt0120056",
      "video": false,
      "title": "The Saltmen of Tibet",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Old Mother",
               "gender": 0,
               "credit_id": "52fe477bc3a36847f813805b",
               "name": "Margen",
               "profile_path": null,
               "id": 141311,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Old Father",
               "gender": 0,
               "credit_id": "52fe477bc3a36847f813805f",
               "name": "Pargen",
               "profile_path": null,
               "id": 141312,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lord of the Animals",
               "gender": 0,
               "credit_id": "52fe477bc3a36847f8138063",
               "name": "Zopon",
               "profile_path": null,
               "id": 141313,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Novice",
               "gender": 0,
               "credit_id": "52fe477bc3a36847f8138067",
               "name": "Bopsa",
               "profile_path": null,
               "id": 141314,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe477bc3a36847f8138051",
               "name": "Ulrike Koch",
               "profile_path": null,
               "id": 141310,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe477bc3a36847f8138057",
               "name": "Ulrike Koch",
               "profile_path": null,
               "id": 141310,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.955869,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "CH",
            "name": "Switzerland"
         }
      ],
      "id": 48894,
      "vote_count": 3,
      "budget": 0,
      "overview": "Four men from a nomadic Tibetan tribe undertake their annual, ritualistic pilgrimage to a sacred salt lake. Salt gathered in this traditional fashion will be sold to provide the economic livelihood of the tribe for the coming year. The journey, necessary for the group's survival, also incorporates a number of rituals necessary for their culture to survive in the modern world.",
      "similar": [
         978,
         9746,
         1995,
         113,
         1689,
         8982,
         746,
         58233,
         16520,
         10136,
         13967,
         474125,
         14830,
         10884,
         274175,
         443408,
         38368,
         44154,
         3598,
         4435
      ],
      "original_title": "Die Salzmänner von Tibet",
      "runtime": 108,
      "poster_path": "/yVgqD24O6aWeRjgNQrcij5tbglx.jpg",
      "spoken_languages": [
         {
            "name": "",
            "iso_639_1": "bo"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [],
      "release_date": "1997-04-25",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ulrike Koch"],
      "runtime": 108,
      "synopsis": null,
      "writers": ["Ulrike Koch"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0120056/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzEwNzQwNzczNV5BMl5BanBnXkFtZTcwNDQyMTAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Margen, Pargen, Zopon | See full cast and crew »"],
      "reviews": [
         "A documentary about a nomadic tribe in Tibet going out to a dry lake to get salt does not sound very appealing. But this is not a popcorn movie but a visual cultural feast whereby you partake of a rapidly vanishing morsel of humanity. The superstitions, the epic songs and poetry, the faith of a people who truly believe in following their own unique patterns of life are something the West had in the times of Homer but that is now, unfortunately, completely foreign to most of us in the \"developed\" world. We have lost the spiritual serenity that comes from following well established patterns of life, often with dire mental consequences in our increasingly soulless society. The film makers have woven us intimately into the fabric of these materially poor but spiritually rich and scrappy saltmen. And made us see that there was more to life than the shopping mall and pop culture. So disconnect your land lines, turn off your cells, turn off the driveway lights and sit back and ease yourself into a timeless adventure.",
         "_Saltmen_ is a long film for its genre, and quite often the pace is much slower than that expected by Western audiences. That being said, I enjoyed it thoroughly both in terms of interesting subject matter and the magnificent images this film contains. Some of the scenery is truly breathtaking, and there is enough of interest that most should be able survive _Saltmen_ with minimal use of the fast-forward.",
         "This is a beautifully filmed movie that questions the future of all indigenous peoples, especially nomadic tribesmen. Focusing on the Saltmen of Tibet, the film moves at pace that may make some western viewers uncomfortable. For some peoples, life still proceeds at the same pace which it has for thousands of years. This film follows a group of tribesmen on their annual two month quest to get salt. Their tribe lives its life in a traditional manner (slowly by modern standards) and always accounting to their many gods. This is a remarkable film, one which will preserve a piece of what may, unfortunately, become history. Well worth the time. Don't be in a rush when you see it.",
         "For a modern Westerner, it is hard to imagine that people ever lived this way ... let alone, that some still do. This film reminds me a little of The Fast Runner (about the Inuits) in its foreignness and matter-of-fact superstition. This is probably like how most of our ancestors lived in medieval times. It's a real eye-opener about a commodity (salt) that we so take for granted. And also about how little of everything it is possible to get by on. The film moves slowly because the protagonists move slowly. Some of the dialogue is incredibly tedious and mundane, thus winds up being a defect or detraction. On the other hand, the photography is gorgeous, and truly remarkable is the trust and cooperation that the filmmakers received from the saltmen, who shared many of their usually well-hidden cultural secrets. All in all, well worth watching even if a bit over-long.",
         "I think Gerard's comments on the doc hit the nail on the head. Interesting film, but very long. It's definitely the antithesis to the new school of flashy, sexy, Moore-style docs. There is no narrator, no facts or side info interlaced, and no other gimmicks. What you see is what you get - a glimpse into the vanishing world of the Saltmen of Tibet. As a huge doc fan, I was surprised how much I lost attention with this film, namely due to the length and lack of dialogue. In the end though I would recommend it if the subject matter sounds interesting to you. It's beautifully shot, informative, and presents a valuable (and closing) window into the way of life of the Tibetan saltmen (and women :) - all important attributes of a good doc. But do put on a big pot of coffee, it'll help.",
         "\"THE SALTMEN OF TIBET\" is a spiritual film about Tibetan tribe. About Tibetan culture, I'm a person who had no knowledge. Therefore, it is tremendously interesting, and deep shocking to face them; a nomadic tribe who are naturally faithful to legends, rules that's living for as long as 2,000 years. On the other hand, the film indicates that modern trucks are gradually invading that sacred lake where the Tibetan get salt as their one of main commodities. This must be extremely confusing things for the tribe to see such monstrous industrial stuff. Nevertheless, while they accept their fate of the today's harsh trade, they take measures to it at their congregation, and devote into their eternal work which is to saw up completed colorful yak, in harmonious and friendly atmosphere, and such the attitude gives much deeper impression, and warns to be aware of their existence. Especially the last scene engraves their extreme intent true picture on my mind.",
         "This could have been a very good film, a very interesting look at ancient tradition and oral history, but it should have been a short subject. As it is , it moves at a snail's pace; sure that's part of the life being portrayed, but this was unbearable. I fell asleep watching them make soup and that was a highlight."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Bayerischer Rundfunk (BR)",
         "Catpics Coproductions",
         "Duran Film"
      ],
      "summaries": [
         "In Tibet's Changtang region, nomads harvest salt to buy barley. A clan prepares four of its men for an annual trek to Lake Tsento, where they rake salt from shoals into piles, then into bags, and onto their yaks to return, 90-days in all. After picking an auspicious day to depart, they feast, sing, tell stories, and race horses. Women are forbidden on this sacred trip. All is ritualized: Margen cooks, Pargen prepares burnt offerings and distributes meat, Zopon cares for the caravan of 160 yaks, Bopsa bends his strong back to arduous work. To each other they speak the secret language of saltmen; they pray and observe exemplary behavior. The goddess of the lake smiles upon them.",
         "Four men from a nomadic Tibetan tribe undertake their annual, ritualistic pilgrimage to a sacred salt lake. Salt gathered in this traditional fashion will be sold to provide the economic livelihood of the tribe for the coming year. The journey, necessary for the group's survival, also incorporates a number of rituals necessary for their culture to survive in the modern world."
      ],
      "budget": 0
   },
   "movielensId": 2129,
   "movielens": {
      "languages": [
         "",
         "Deutsch"
      ],
      "releaseDate": "1997-04-25",
      "dvdReleaseDate": "2002-07-30",
      "directors": ["Ulrike Koch"],
      "runtime": 108,
      "movieId": 2129,
      "title": "The Saltmen of Tibet",
      "mpaa": null,
      "actors": [
         "Margen",
         "Pargen",
         "Zopon",
         "Bopsa"
      ],
      "imdbMovieId": "0120056",
      "originalTitle": "Die Salzmänner von Tibet",
      "genres": [
         "Documentary",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Four men from a nomadic Tibetan tribe undertake their annual, ritualistic pilgrimage to a sacred salt lake. Salt gathered in this traditional fashion will be sold to provide the economic livelihood of the tribe for the coming year. The journey, necessary for the group's survival, also incorporates a number of rituals necessary for their culture to survive in the modern world.",
      "tmdbMovieId": 48894,
      "avgRating": 3.47468,
      "releaseYear": "1997",
      "numRatings": 79,
      "posterPath": "/yVgqD24O6aWeRjgNQrcij5tbglx.jpg"
   }
}