{
   "tmdb": {
      "original_language": "sv",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "pianist",
            "id": 14743
         },
         {
            "name": "invalid",
            "id": 41402
         }
      ],
      "imdb_id": "tt0077711",
      "video": false,
      "title": "Autumn Sonata",
      "recommendations": [
         10238,
         29455,
         11602,
         11506,
         11656,
         47735,
         47721,
         26372,
         43877,
         18333,
         614,
         42602,
         42152,
         11700,
         19426,
         5781,
         797,
         47473,
         24657,
         29264
      ],
      "backdrop_path": "/5bQm5w80SGOlsMuX4jhXxn0H3mG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charlotte Andergast",
               "gender": 1,
               "credit_id": "52fe451d9251416c7504c375",
               "name": "Ingrid Bergman",
               "profile_path": "/jXEE0P6705JbMAJ2nwtHjmqkd5F.jpg",
               "id": 4111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eva",
               "gender": 1,
               "credit_id": "52fe451d9251416c7504c379",
               "name": "Liv Ullmann",
               "profile_path": "/5u8fikv8ANDx5FJhLtvhZmBZtRa.jpg",
               "id": 11916,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Helena",
               "gender": 1,
               "credit_id": "52fe451d9251416c7504c37d",
               "name": "Lena Nyman",
               "profile_path": "/lpdxi2oOrzqPXF99aC6HrtUadae.jpg",
               "id": 3854,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Viktor",
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c381",
               "name": "Halvar Björk",
               "profile_path": null,
               "id": 73595,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Charlotte's private secretary",
               "gender": 0,
               "credit_id": "52fe451d9251416c7504c385",
               "name": "Marianne Aminoff",
               "profile_path": null,
               "id": 73596,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Uncle Otto",
               "gender": 0,
               "credit_id": "52fe451d9251416c7504c389",
               "name": "Arne Bang-Hansen",
               "profile_path": "/a1fGJlBmBsesO69mpPjFtPAyocf.jpg",
               "id": 13511,
               "order": 5
            },
            {
               "cast_id": 23,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3d5",
               "name": "Gunnar Björnstrand",
               "profile_path": "/AiGcTLr6uQXjtKxh2CMOOIfXEW1.jpg",
               "id": 6649,
               "order": 6
            },
            {
               "cast_id": 24,
               "character": "Josef",
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3d9",
               "name": "Erland Josephson",
               "profile_path": "/mJV7IOqkp8lzy6L3DXlOwmPXQHl.jpg",
               "id": 38127,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c38f",
               "name": "Ingmar Bergman",
               "profile_path": "/rHYYP3N2ivz6WTuTHsLX58Gab7G.jpg",
               "id": 6648,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c395",
               "name": "Ingmar Bergman",
               "profile_path": "/rHYYP3N2ivz6WTuTHsLX58Gab7G.jpg",
               "id": 6648,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe451d9251416c7504c39b",
               "name": "Richard Brick",
               "profile_path": null,
               "id": 73597,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe451d9251416c7504c3a1",
               "name": "Katinka Faragó",
               "profile_path": null,
               "id": 5983,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe451d9251416c7504c3a7",
               "name": "Lew Grade",
               "profile_path": "/rA0Z1fY2bDpM6Qy5zGfF47XsSBn.jpg",
               "id": 24328,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3ad",
               "name": "Martin Starger",
               "profile_path": "/6fUAYOXgAXpbSzYP3xnVmJ4ezZh.jpg",
               "id": 30592,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3b3",
               "name": "Sven Nykvist",
               "profile_path": "/2S1wtqPzCUlAMVpor5o0YHkme21.jpg",
               "id": 11905,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe451d9251416c7504c3b9",
               "name": "Sylvia Ingemarsson",
               "profile_path": null,
               "id": 46871,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3bf",
               "name": "Johann Sebastian Bach",
               "profile_path": "/aV2aVHcwptPnsPa8SvrzmqS9322.jpg",
               "id": 67826,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe451d9251416c7504c3c5",
               "name": "Frédéric Chopin",
               "profile_path": null,
               "id": 73598,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3cb",
               "name": "Georg Friedrich Händel",
               "profile_path": "/oi1LsVTXaZB1JWekiLyuRDlNQcb.jpg",
               "id": 73599,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe451d9251416c7504c3d1",
               "name": "Robert Schumann",
               "profile_path": null,
               "id": 46872,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.298105,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "SE",
            "name": "Sweden"
         }
      ],
      "id": 12761,
      "vote_count": 97,
      "budget": 0,
      "overview": "After a seven-year absence, Charlotte Andergast travels to Sweden to reunite with her daughter Eva. The pair have a troubled relationship: Charlotte sacrificed the responsibilities of motherhood for a career as a classical pianist. Over an emotional night, the pair reopen the wounds of the past. Charlotte gets another shock when she finds out that her mentally impaired daughter, Helena, is out of the asylum and living with Eva.",
      "similar": [
         334,
         12102,
         10795,
         7350,
         319,
         425,
         2288,
         69,
         1374,
         745,
         858,
         13,
         51828,
         112160,
         46705,
         637,
         664,
         122906,
         277216,
         15584
      ],
      "original_title": "Höstsonaten",
      "runtime": 90,
      "poster_path": "/2ZskjUMmMRhWSR781fDfuWE2kl2.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Suede Film",
            "id": 26239,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Personafilm",
            "id": 7447,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmédis",
            "id": 17085,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Incorporated Television Company (ITC)",
            "id": 15980,
            "origin_country": ""
         }
      ],
      "release_date": "1978-10-08",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ingmar Bergman"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Ingmar Bergman"],
      "originalLanguage": "Swedish",
      "imdbLink": "http://www.imdb.com/title/tt0077711/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTMzMTQyOTUxMF5BMl5BanBnXkFtZTcwMzE5NDkxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Ingrid Bergman, Liv Ullmann, Lena Nyman | See full cast and crew »"],
      "reviews": [
         "This is one of the very best Ingmar Bergman films I have seen, and therefore one of the very best films. Ingrid Bergman and Liv Ullman are simply amazing together as a mother and daughter combination from hell. Ingrid Bergman is terrific, despite a deliberately naff hairdo which makes her look like Queen Elizabeth II of the UK rather than the faded beauty she is. Liv Ullman also has visual nuances to enhance her character - the glasses, platted hair and jumpers enabling this beautiful woman to look frumpy. The acting is simply amazing, even through the subtitles you can tell. Fortunately Scandinavian vocal nuance is similar enough to English to enable us non-Swedish speakers to appreciate the acting. Of course, it has the Ingmar Bergman darkness to it. The sister with the horrible degenerative disease, the drowned toddler, the selfishness of the Ingrid Bergman character. If you get depressed along with the characters in films like this, you might be better off giving this one a miss. But for those with a taste for this type of claustrophobic drama, this is one of the most powerful films you will ever see.",
         "Writer/director Ingmar Bergman examines the strained relationship between a mother and daughter in `Autumn Sonata,' starring Ingrid Bergman and Liv Ullmann. Eva (Ullmann) has not seen her mother, Charlotte (Bergman) in seven years; a successful concert pianist, Charlotte has spent a good portion of her life on the road, but after losing her long-time companion, Leonardo, Eva invites her to come to the parsonage where she and her minister husband, Viktor (Halvar Bjork), live, for an extended visit. Charlotte accepts, but soon after her arrival, old wounds and feelings begin to surface, and the film becomes an intimate character study of the life-long dysfunctional relationship between Charlotte and Eva, during which director Bergman intricately examines the causes and effects of all that has passed between them during their lives. It's an in-depth look at the emotional damage human beings are capable of inflicting upon one another, and how fragile the line between love and hate becomes when subjected to incessant neglect by even one of the parties involved. As the story unfolds and the principals bare their souls-- at last revealing a lifetime's worth of repressed feelings-- it becomes an emotionally devastating experience for the audience, as well, for there is much contained within the dynamics of this situation that most viewers will be able to identify with and relate to within their own lives. Ingmar Bergman is a Master of presenting life as it truly is; reality-- and portraying it on the screen-- is his domain, and throughout his career he has veritably created almost a genre of his own in doing so. With a microscope of his own design, he scrutinizes the basic instincts of the human condition, what makes people tick and how and why they relate to one another as they do. Much of what he presents is startling, and always emotionally involving, because he penetrates so deeply and succinctly into the heart of the matter, as he demonstrates so superlatively with this film. His methods and style are unique, his talent unequivocal; many others have attempted to capture the essence of that which Bergman has perfected, but few have succeeded. Interestingly enough, Liv Ullmann is one who, as a director, has probably come the closest to achieving that classic `sense' of Bergman, with her films `Private Confessions,' and `Faithless,' both of which were written by Bergman. In her role as Eva, Ullmann gives one of the best performances of her career, for which she should have at least been nominated for an Oscar; that she was not is nothing less than a gross injustice. She so skillfully conveys the depth and complexities of her character, and the differing emotional levels to which Eva is subjected, that it creates a lasting impression and makes her someone with whom it is easy for the audience to sympathize. It makes you realize, upon reflection, what a truly gifted actress Ullmann is. And, as good as Ullmann's performance here is, it is equaled-- though not, I would say-- surpassed, by Ingrid Bergman's portrayal (in her final theatrical appearance) of Charlotte; and in a renewal of faith that there is some justice in the world after all, she received an Oscar nomination for Best Actress for it. In retrospect, it seems somehow inevitable that the two Bergmans came together at last, though it's somewhat lamentable that their career paths did not cross sooner. There is some consolation, however, in the fact that when they did finally join forces the result was such a powerful, memorable film. The supporting cast includes Lena Nyman (Helena), Gunnar Bjornstrand (Paul), Erland Josephson (Josef) and Linn Ullmann (Eva as a child). An intelligent, thought provoking and emotionally wrenching film, highlighted by outstanding performances and beautifully photographed by Sven Nykvist, `Autumn Sonata' is an example of filmmaking at it's best; it's a lasting tribute, not only to the immense talents of Ingmar Bergman and Liv Ullmann, but to Ingrid Bergman, one of the most beautiful and gifted actresses ever to grace the silver screen. I rate this one 10/10.",
         "Generally, either \"Seventh Seal\" or \"Persona\" is the film that a critic will name if s/he is stuck with the task of naming Ingmar Bergman's greatest achievement. A couple others might be named, but rarely do you hear a critic espouse the brilliance of \"Autumn Sonata.\" The first thing I noticed about this film is that it is, like \"Cries and Whispers,\" nothing less than a painting. The textures, the warm reds and the close-ups of the faces of wounded souls, all combine to make the viewer realize that s/he is witnessing High Art. Then there's the shot of Liv Ullman's wounded profile as she stares at her mother, Ingrid Bergman, while mother shows Liv how the Chopin piece should be played. It is an eloquent scene. Truly heartbreaking and unforgettable. One can feel Liv's pain begin to show itself: it is the painful shame of inadequacy and mediocrity made all the more shameful because it is mother inspiring these feelings in her. Later, it's Liv's cruelty toward her mother in that unforgettable late night diatribe. And finally, it's Liv's crippled sister and Ingrid's disgust at the thought that not only did mediocrity crawl out of her womb, but so did deformity and suffering. The film is bleak (obviously) and the resolution is only slightly hopeful. It is however a masterpiece -- a film that reveals that what the world needs now is not Love, as the song proclaims, but Compassion and Grace. Liv Ullman is the only actress who can say these things without opening her mouth. Ingmar Bergman is the only filmmaker who can make a seemingly banal story into an eloquent prayer for redemption and reconciliation. (CAUTION: Dont take mom to see it on mother's day ... unless...)",
         "What makes a movie perfect is not only the intensity of emotion you feel when seeing it, and it's not only the seamless matching of technique and artistry, it is the truth of feeling conveyed and the unrelenting attention to the details of the crafts of writing, acting, and directing, making certain that those details work together to create meaning - a view of life, and whatever forces are behind life, that are as varied, contradictory, and complete as a living being. It is this that Bergman managed to accomplish with AUTUMN SONATA. The hyperbolic use of the word 'perfect', too often spontaneously tossed out as a result of confused and mawkish sentimentality (just as one Liv Ulmann's interpretation of a Chopin prelude is described as mawkish in the film) has a right to be used in the case of this work. There are no demons or angels in this movie. There are a collection of remarkably real characters whose actions and their motivations are fully explained by themselves, in dialog that is explicit and direct but not delivered as an artificial way of getting across the creator's judgment on his characters. Ingrid Bergman, in what is doubtlessly the finest performance of her career, portrays a mother who has neglected her children all her life and is confronted by this fact by her grown daughter whose adoration as a child has turned into an apparently irreversible hatred. \"There is no forgiveness\" is a line uttered by Liv Ulmann after summarizing the crimes of her mother's neglect and the results of that neglect. And yet, the character's contradictory feelings are clearly seen in the moments when her need for vengeful expression of her pain has faded away. The daughter who has condemned her mother, quite honestly, wants to keep trying to resolve the conflict, to heal the gaping wounds in her heart and in her sister's heart - a sister who, arguably, has been physically crippled by the cold withdrawl of her mother's feelings and her mother's competitive need to be the leading female character in everyone's life. Ingrid Bergman's character, though seen as a villain in the emotional eyes of her daughter, comes across as complex as Ulmann's. She has an awareness of her crimes of neglect but remains helpless, by choice and by need, to confront them within herself and make amends to resolve them. Her own childhood is the reason. The isolation that she felt, instead of inspiring her to not repeat the mistake with her own children, took the course of isolation, of seeking praise from the outside, of being the central character in the lives of people around her. Her insatiable hunger for love from others, though, remains forever unsatisfied. Her selfishness, even though she is painfully aware of it, is something which she has learned how to hide from herself. Her methods, of physical distance or the perfection of her work as a pianist has, for all her adult life, successfully obfuscated her pain - until an all-night exposing of the naked truths of hurt and distrust that are thrust upon her by her daughter. Anyone with a mother or father can find identification with the characters in AUTUMN SONATA, as long as they can tolerate the pain of the truth that lies at the center of their all-too-human needs and the hurtful action that those needs have caused.",
         "This is a beautiful and devastating film that I admire, love and am connected to. This was the first Liv Ullmann's film I've seen and the first Bergman's color film. It is considered to be Ingrid Bergman's film and she is phenomenal as a talented and world renowned pianist who had never been a good mother to her two daughters. It is much easier to make the whole world happy then your own child. One can be a brilliant artist and read the minds of the other great minds easily but the hearts and souls of one's own blood and flesh would be the unsolved mystery. I think the film was very personal for both Bergmans in their only work together. It is amazing how bravely they explore the themes and events that could've (and did) occurred in their own lives. For me, though, the film belongs to Liv Ullmann, the greatest actress I've seen, the best Ingmar Bergman's actress. I was riveted to Liv's face; I'd never seen the face like hers. She played a plain daughter to the brilliant mother and she was supposed to look and feel awkward and gawky comparing to her mother but her face was like a magnet, her eyes - like two deep blue lakes. If ever the saying, the eyes are the soul's mirror, is true, it is about Liv's eyes. There are kindness, tenderness, strength, and something even more attractive than beauty itself in them - the goodness of her soul. Dostoyevsky said once that human face has to mean something - I always think of his words when I see performance of my favorite actress ever -Liv Ullmann.",
         "ingrid berman was diagnosed with terminal cancer shortly before she agreed to star in this film. due to the fact that insurance companies in hollywood rarely secure contracts with ill actors, ingrid had to take what she could while she was still alive. i don't know what her financial situation was at the time, but i do know that her fee for starring in this film was much less than she was used to. yet, despite her condition, this became, to me at least, her swan-song performance. during ingrid's prime, she had considerable control of her image in hollywood. she was portrayed, more often than not, as a strong and goddess-like character (casablanca, anyone?). in this film, however, all control of imaging was in the hands of her swedish counterparts ingmar bergman and sven nykvist, and the image they created of her was deconstructive of her screen persona, yet not in her brilliance and ability as an actress. ingrid hated working with them, though. ingmar would command long takes, and sven would put the camera inches from her face. yet this technique showed a side of ingrid the world has never seen before. ingrid's character,charlotte, is a successful concert pianist yet unsuccessful mother who returns to see her two daughters and a son-in-law. one daughter is married, yet is incapable of feeling love. and the other (helena, played by 60's swedish film star lena nyman) is left virtually paralyzed. she returns to visit after 7 years, and that's when the sparks fly. liv ullman, who plays eva, (the married daughter), has usually been portayed as a non-confrontational person in her collaborations with ingmar, yet her persona in this film is slightly reserved in the beginning, but all her inhibitions are unleashed upon charlotte. i've always remembered ingrid as a beautiful painted rose on the screen (for whom the bell tolls, anyone?), but when this film ends, all we see is ingrid's tear-stained face. this may be ingmar's own reaction to his own short-comings as a husband and father (7 kids/4 marriages). in an effort to deconstruct himself, he looked at another icon to drive home his point of childhood pain and adult insecurities. at this films end, the most punishing scenes occur. i'm not going to spoil it for you, but it's the scene when eva walks amongst cemetery headstones while charlotte takes the train out of town. i hate to admit it, but there was a lump in my throat at this point in the film. although i praise this film, i wouldn't give this movie a 10 because of nyman's character. although her scene in the beginning is powerful, her other two appearances,(although brief) are way over-the-top, almost as bad as jar-jar binks in phantom menace. i could write more, but i want everyone who reads this to go see this movie without my crappy opinions ruining it. it's not often that people see a film with such realistic portrrait of the human condition. and as i said earlier, ingrid and ignmar have rarely (maybe never)been better. 9 out of 10 (***1/2 out of ****)",
         "Ingmar Bergman claimed, in the DVD-introduction, that Ingrid Bergman told him that she wanted to make a film with him. The result was, and still is, a cinematographic masterpiece that compromises neither with style or emotion to get the message out. Ingrid Bergman is simply astonishing in the role as the world famous singer that after years of neglecting her children returns to find her oldest daughter full of hatred towards her. A hatred she doesn't understand, somewhere inside being a child needing attention herself. The tension between mother and daughter is building up, at first it is jolly but soon we see cracks in the surface of both Ingrid Bergman's glamorous Charlotte and Liv Ullman's quiet and suppressed Eva. \"Höstsonaten\" is beautiful, but it takes its toll on the viewer. If you aren't prepared for it, it can be an emotional roller coaster ride that leaves you chocked when its over. The beauty and the ugliness of the human soul, ripped apart by anger, disease and sadness, is clear in this work of art.",
         "The acting of Ingrid Bergman and Liv Ulmann is absolutely spell binding and while Katherine Hepburn may have been accused of portraying the emotions for A to B there is no doubt that these two actors can portray the emotions from A to Z and beyond. When I watch a film in a foreign language I find myself studying facial expressions and body language very closely, not surprisingly as, with the lack of understanding I am more dependant of visual cues. However such scrutiny often uncovers failings and weaknesses \u0096 not here. The cinematography id also first class, the colours, tones and lighting are all superb and enhance, never detract. This is only the second of Bergman's films I have seen (the first being Fanny and Alexander) and what I have noticed is that while many films give to the viewer and I feel as if the emotions are a natural response, I felt with the Bergman films, particularly this one, as if the films have taken something out of me, as if the emotions have been extracted against my will. This may sound over the top and rather florid but is a genuine statement. I also have to say that what the two films have in common is that they were both spellbinding and like a good book that just can't be put down, the films gripped me and wouldn't let go even for a minute.",
         "Spoilers herein. As a general matter, I appreciate Bergman's skill but do not welcome his art into my life. However intense, the issues are too small, excepting `Seventh Seal.' But his is a cinematic mind, and every once in a while, he'll create an image so powerful it burns its way into the depths of your memory, slightly below that threshold of awareness. You then carry it always. This film has one such scene. It involves a Chopin Prelude. Chopin's work is unlike any other composer's: it is designed to be played in a way that deviates from the expected with the passion coming not from the notes per se, but the space between them, and between them and us that when filled affects the placement of the notes in time ever so slightly. This particular prelude can range from one that haunts to one that accuses. I've heard all sorts of different passions, depending on who plays and how rich they are as humans. There is nothing in all the world like the many ways this can be filled and the impact it can have when taken seriously. The scene in question is superficially simple: the daughter plays the piece rather poorly, followed by the mother much more expertly. But the pianist who actually plays (Laretei) really knows his way around this world, and was expertly directed by Bergman. Watch the scene, and you'll hear the piece played by Eva in a way that expertly expresses the damage, perverted love, and sly literateness of her character. Then we have a speech from her Mom about wrestling with it, about being emotional but not mawkish, feeling not being sentimentality, pain and not reverie, to be calm clear and harsh, to not show the hurt, to be restrained. And then she plays, and does everything she says not to. Everything. Rather than hinting at yogic control of immense suffering, she creates the reverse notion. Rather than phrasing in the small, she does it in the large with hesitations not anticipations. In other words, she acts through the music in precisely the same way her character does in the film. But the music is far richer than can be accomplished with talk. And Liv! She watches her mother go through this, feeling the metapain of her mother: the pain of not knowing why her pain isn't genuine, and tapping the metapain for the performance. It's an exploitation of cluelessness. Eva recognizes this and it scrambles her soul without her really knowing why. It is a few minutes of the most concentrated emotion you may ever experience in film. Everything that follows is annotation, including Eva's awareness and Charlotte's noting of Leonardo's remark to her: `a sense of reality is a matter of talent.' I've watched a few thousand films, many about music. Almost never does the filmmaker understand the music. This does. She does. He does. Ted's evaluation: 3 of 4 -- Worth watching.",
         "Ingrid Bergman as Charlotte, is a concert pianist visiting her daughter Eva, played by Liv Ullmann. They have not seen each other for 7 years. Charlotte's other daughter, Helena, is also living with Eva. Helena has a crippling disease, and at one time was living in some type of institution. At first, everything is fine, as mother and daughter do their best to make each other as comfortable as possible. When left alone, they wonder about each other's expectations, but continue on. Charlotte is a very talented, but completely self-absorbed woman. Eva is a frump. A sweet frump, but a frump nonetheless. At first, there are a few catty remarks exchanged, but the turning point is when Eva offers to play the piano for her mother. She works as hard as she can, but the music sounds contrived and unmusical. When she asks her mother to play the piece for her, Charlotte does the one thing that signaled to me that \"the war was on\". She laid down the music rack on the piano. (When pianists have a piece memorized, they do that to show the audience that they have no need for the printed music.) Charlotte, of course, plays beautifully (she could play no other way). However, the damage is done. Mother is successful, and daughter is a failure. Although the scene is dramatically pivotal, it did produce one of the few really funny lines in the movie. After Charlotte finishes playing, she says, \"Well, I HAVE been playing these Chopin pieces for 37 years.\" Charlotte's self-absorption is pretty amazing when you realize that her ill daughter was in an institution, then moved to Eva's house, and she had no idea that it happened. There are some other clues in the early part of the story that indicate she probably wished that her daughter Helena would have died long ago. Charlotte can be totally charming to her public, her agents, her fans... but has very little to offer her own children. Eva is so desperate for love and affection from her mother that she seemingly misses the fact that her husband loves her very much. When Charlotte is awakened by a nightmare, she and Eva begin a late-night talk. And that is when the real nightmare begins. At times this film is painful to watch, and at times is emotionally draining. Sven Nykvyst's cinematography is stunning. I thought this especially so in the flashback sequences, and in the scene close to the end of the film when Eva is in the cemetery. Although not as perfect as The Seventh Seal, or Wild Strawberries, Autumn Sonata still has much to say, whether we feel comfortable listening to it or not."
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Personafilm",
         "Filmédis",
         "Incorporated Television Company (ITC)"
      ],
      "summaries": [
         "After having neglected her children for many years, world famous pianist Charlotte visits her daughter Eva in her home. To her surprise she finds her other daughter, Helena, there as well. Helena is mentally disabled, and Eva has taken Helena out of the institution where their mother had placed her. The tension between Charlotte and Eva only builds up slowly, until a nightly conversation releases all the things they have wanted to tell each other.",
         "Leonardo, the long time partner of Charlotte, a world renowned concert pianist, has just passed away. Because of Leonardo's passing, Charlotte's daughter, Eva, formerly a journalist, has invited her mother for an extended stay at the country home where she lives with her minister husband Viktor. Despite not having seen Eva in seven years as Charlotte is absorbed solely in her own life, Charlotte agrees. Upon arrival at the parsonage, Charlotte learns that her other daughter, Helena, is now living there with Eva as well. Helena, who is mentally disabled, used to be institutionalized until Eva decided to look after her herself starting two years ago. In some respects, Eva taking care of Helena replaces taking care of her son Erik, who accidentally drowned when he was four. Eva takes solace in believing that Erik is still a major part of her life despite his death. Charlotte also has not seen Helena in quite some time, and Eva surmises that if Charlotte knew that Helena was there, she probably would not have come. Despite telling Eva otherwise, Charlotte in private does mention her displeasure at seeing Helena there. As Eva spends more time with her mother, who she believes is a calculating woman whose actions always have a meaning behind them, her feelings from childhood re-emerge, of which she tells her mother and which she knows have shaped the unhappy person she is today. That unhappiness also has affected the way she views her marriage. Charlotte, in turn, explains the reasons for the way that she is in life.",
         "A married daughter who longs for her mother's love gets visited by the latter, a successful concert pianist."
      ],
      "budget": 0
   },
   "movielensId": 2131,
   "movielens": {
      "languages": [
         "English",
         "svenska"
      ],
      "releaseDate": "1978-10-08",
      "dvdReleaseDate": "2000-01-11",
      "directors": ["Ingmar Bergman"],
      "runtime": 90,
      "movieId": 2131,
      "title": "Autumn Sonata",
      "mpaa": "",
      "actors": [
         "Ingrid Bergman",
         "Liv Ullmann",
         "Lena Nyman",
         "Halvar Björk",
         "Marianne Aminoff",
         "Arne Bang-Hansen",
         "Gunnar Björnstrand",
         "Erland Josephson"
      ],
      "imdbMovieId": "0077711",
      "originalTitle": "Höstsonaten",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "wHd4ymdGAGA",
         "lLmK0k54RWs"
      ],
      "plotSummary": "After a seven-year absence, Charlotte Andergast travels to Sweden to reunite with her daughter Eva. The pair have a troubled relationship: Charlotte sacrificed the responsibilities of motherhood for a career as a classical pianist. Over an emotional night, the pair reopen the wounds of the past. Charlotte gets another shock when she finds out that her mentally impaired daughter, Helena, is out of the asylum and living with Eva.",
      "tmdbMovieId": 12761,
      "avgRating": 3.93698,
      "releaseYear": "1978",
      "numRatings": 603,
      "posterPath": "/2ZskjUMmMRhWSR781fDfuWE2kl2.jpg"
   }
}