{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "babysitter",
            "id": 2604
         },
         {
            "name": "blues",
            "id": 2636
         },
         {
            "name": "adventure",
            "id": 4414
         },
         {
            "name": "unfaithful boyfriend",
            "id": 11511
         },
         {
            "name": "misadventure",
            "id": 161267
         },
         {
            "name": "one night",
            "id": 162914
         },
         {
            "name": "playboy magazine",
            "id": 170184
         },
         {
            "name": "suburbanite",
            "id": 170189
         },
         {
            "name": "chop shop",
            "id": 170192
         },
         {
            "name": "homeless man",
            "id": 170195
         },
         {
            "name": "stitches",
            "id": 170199
         },
         {
            "name": " expressway",
            "id": 170200
         },
         {
            "name": "frat party",
            "id": 170209
         },
         {
            "name": "criminal gang",
            "id": 170212
         },
         {
            "name": "held hostage",
            "id": 170217
         },
         {
            "name": "auto theft",
            "id": 170219
         },
         {
            "name": "norse mythology",
            "id": 179101
         }
      ],
      "imdb_id": "tt0092513",
      "video": false,
      "title": "Adventures in Babysitting",
      "recommendations": [
         11064,
         14370,
         8989,
         13704,
         11584,
         12714,
         10859,
         11814,
         11821,
         11418,
         15413,
         10780,
         14628,
         14052,
         9749,
         10019,
         15596,
         12154,
         9080,
         9409
      ],
      "backdrop_path": "/s9Ukl6CI1DwyJenfaDH1z1ZVlqV.jpg",
      "revenue": 34368475,
      "reviews": [{
         "author": "Wuchak",
         "id": "5a8746530e0a2653b3041059",
         "content": "RELEASED IN 1987 and directed by Chris Columbus, “Adventures in Babysitting” (aka \"A Night on the Town\") is a teen dramedy about 17 year-old babysitter, Chris (Elisabeth Shue), from the suburbs of Chicago who has no choice but to take the siblings she’s babysitting (Keith Coogan & Maia Brewton) and their friend (Anthony Rapp) into the big city whereupon they have many misadventures. Penelope Ann Miller plays Chris’ geeky friend (at the bus station), Calvin Levels a car thief, John Davis Chandler the main heavy and George Newbern a helpful college dude with eyes for Chris. \r\n\r\nI was surprised at how entertaining this movie is. It has the tone of an Indiana Jones flick, but with teen protagonists and taking place in a modern USA city. The Thor element was a unique surprise and the little girl is cute and spry. The protagonists are likable and you can sense the warmth in their relationships, e.g. Brad’s infatuation with Chris. \r\n\r\nUnfortunately, the movie fumbles the ball on the female front a little bit. There are quality women in the cast, for sure, but the director never milks these resources for their worth (and I’m not tawkin’ bout nudity or sleaze). Take Shue, for example (who was 21 during filming); she’s dressed in a looong sweater or jacket that covers her figure the entire film. Compare this with her role in “The Karate Kid” (1984) where her beauty is well displayed and tastefully so.   \r\n\r\nTHE FILM RUNS 1 hour & 42 minutes and was shot in Toronto and the Chicago area. WRITER: David Simkins            \r\n\r\nGRADE: B+/A-",
         "url": "https://www.themoviedb.org/review/5a8746530e0a2653b3041059"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chris Parker",
               "gender": 1,
               "credit_id": "52fe45ea9251416c75066df1",
               "name": "Elisabeth Shue",
               "profile_path": "/44AaIXkbZFkdhSW1kRdzCbfYk6c.jpg",
               "id": 1951,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sara Anderson",
               "gender": 0,
               "credit_id": "52fe45ea9251416c75066dfb",
               "name": "Maia Brewton",
               "profile_path": "/w10sqQx1ANA2KFwYc37gS4Kl8Up.jpg",
               "id": 139044,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Brad Anderson",
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066dff",
               "name": "Keith Coogan",
               "profile_path": "/uAMrErJNb1IW78RkgpMq9id2ec8.jpg",
               "id": 56145,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Daryl Coopersmith",
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e03",
               "name": "Anthony Rapp",
               "profile_path": "/a9SBIDqSXkJaxJHqDaHXNkLhOUs.jpg",
               "id": 6165,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Joe Gipp",
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e07",
               "name": "Calvin Levels",
               "profile_path": null,
               "id": 77589,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dawson / 'Thor'",
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e0b",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "52fe45ea9251416c75066e0f",
               "name": "Penelope Ann Miller",
               "profile_path": "/6wjG6NUBKc6Ca4KX6G6V4t6sU2.jpg",
               "id": 14698,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dan Lynch",
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e13",
               "name": "George Newbern",
               "profile_path": "/kUFci5BzhMyx3ZNQEvpauRmpMyT.jpg",
               "id": 59222,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mike Todwell",
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e2f",
               "name": "Bradley Whitford",
               "profile_path": "/66brylvzWLg94TRMd6QFrVyMOei.jpg",
               "id": 11367,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "John Pruitt",
               "gender": 2,
               "credit_id": "54cbf34bc3a36860c300003d",
               "name": "John Ford Noonan",
               "profile_path": "/q7HqioLxUs6G71F0sw7bP53jNyo.jpg",
               "id": 175008,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066df7",
               "name": "Chris Columbus",
               "profile_path": "/2fHN78oumrJRM84UydgfVzj0YEl.jpg",
               "id": 10965,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e19",
               "name": "David Simkins",
               "profile_path": null,
               "id": 139045,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45ea9251416c75066e1f",
               "name": "Debra Hill",
               "profile_path": null,
               "id": 2161,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45ea9251416c75066e25",
               "name": "Lynda Obst",
               "profile_path": null,
               "id": 2162,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ea9251416c75066e2b",
               "name": "Michael Kamen",
               "profile_path": "/y83bqw1VP1PkuvOhG2XROwc9eXG.jpg",
               "id": 7714,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54768515c3a3681c67001393",
               "name": "Fredric Steinkamp",
               "profile_path": null,
               "id": 10640,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5476852a92514151af0015bc",
               "name": "William Steinkamp",
               "profile_path": null,
               "id": 2241,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55d5416c92514102d20032e3",
               "name": "Ric Waite",
               "profile_path": null,
               "id": 1728,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "55d5418b92514102c80030d7",
               "name": "Janet Hirshenson",
               "profile_path": null,
               "id": 2874,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "55d5419792514102c300307e",
               "name": "Jane Jenkins",
               "profile_path": "/aVOlC6UkKaxZpzvpdRxCjkMtJHI.jpg",
               "id": 3275,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "55d541a4c3a3687b99002b14",
               "name": "Todd Hallowell",
               "profile_path": null,
               "id": 6184,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "55d541b0c3a368507f003594",
               "name": "Barbara Dunphy",
               "profile_path": null,
               "id": 22060,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55d541be92514102cf0033f8",
               "name": "Daniel Loren May",
               "profile_path": null,
               "id": 19046,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "55d541ca92514102d20032f3",
               "name": "Judith R. Gellman",
               "profile_path": null,
               "id": 63535,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 9.277536,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14367,
      "vote_count": 204,
      "budget": 0,
      "overview": "When plans with her boyfriend fall through, high school senior Chris Parker ends up babysitting the Anderson kids, Brad and Sara. What should be a quiet night in, however, turns into a series of ridiculous exploits, starting when they leave the house to pick up Chris' friend Brenda. Soon, Brad's buddy Daryl is involved, and the group must contend with car thieves, blues musicians and much more.",
      "similar": [],
      "original_title": "Adventures in Babysitting",
      "runtime": 102,
      "poster_path": "/8QiAj0Xw2UMeZMIIfZKeNoIsszs.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Silver Screen Partners III",
            "id": 554,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1987-07-01",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "She thought babysitting was easy money - until she started hanging out with the Andersons.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chris Columbus"],
      "runtime": 102,
      "synopsis": "Chris Parker is awaiting the arrival of her boyfriend, Mike Toddwell, to pick her up for a date. When he arrives, he devastates her by canceling their plans to go to a French restaurant in downtown Chicago due to his sister becoming ill. Brokenhearted, Chris has her best friend Brenda come over, and while she is there, the Andersons call asking if Chris can babysit their daughter Sara. Seeing no other plans for the evening, Chris agrees. When she arrives, she discovers eight-year-old Sara and her fifteen-year-old brother Brad in an argument. Sara had taken Brad's Clearasil and used it to paint another picture of her Marvel hero Thor, prompting Brad to call him a homo and upset her. She manages to blackmail him by telling him in front of Chris (without his knowing) that she would tell Chris about all of his love poems to her. Embarrassed, Brad admits defeat and apologizes to Sara. After the Andersons leave for the evening, Brad is visited by his best friend Daryl, whose house he was supposed to be staying over that night, but Brad cancels and returns to the living room where he shuts the blinds out from the \"stray dog\" as he describes him to Chris. Chris gets a call from a frantic Brenda, who had successfully run away from home, but unsuccessfully stranded herself at the bus station downtown. Without the money to pay for a cab ride, Brenda's fear prompts Chris to decide to drive into town. Sara and Brad won't let her leave them home alone, and Daryl's eavesdropping forces her to take him along as well. In the car, Chris tells Sara a scary story about a man with a hook who kills a babysitter and her children, and when a car tire blowout stands them on the expressway without a spare, she realizes that she forgot her purse at the Anderson's. A tow truck pulls over and \"Handsome\" John Pruitt offers them a hand, or a hook to the surprise and fear of the children. Offering to pay for the tire repair, Pruitt is distracted by a call and he diverts to his home where his wife is cheating on him. In a resulting shootout, Chris and the others get out of the truck and into a Cadillac, which is being stolen. The thief, Joe Gipp, promises to take them to safety after he drops off the car at a chop shop. However, leaders Greydon and Bleak detain them up in the office for a meeting they were involved in. Daryl boosts a Playboy magazine to replace his dad's, which had been thrown out of the car window earlier by Brad. They then make a tense escape crossing the girders in the warehouse ceiling, escaping outside. The thieves find the Playboy missing, and as it contains incriminating evidence that can be used against them, they give chase. The kids are chased into a blues club where they are not allowed off the stage until they reveal their predicament in song, much to the cheers and applause from the audience. When they are allowed to leave, they are reminded of their mission and predicament when Darryl attempts to pick up a prostitute on the street who turns out to be a seventeen yo runaway. Meanwhile Brenda is not having a very good time at the bus station. Having her glasses stolen while resting leaves her practically blind, she mistakes a sewer rat for a kitten, and is laughed at by pest exterminators when she attempts to defend it. A hot dog vendor will not accept her small check as payment, stating \"You slip me the cash, and I'll slip you the wiener.\" But when she says, \"I don't have any cash!\" he proclaims, \"Then I don't have a wiener!\" Another chase from the thieves prompts them to board a monorail where a pair of rival gang members move in to kill each other. Chris intervenes to hold off the fight until they exit the train, and Brad stands up when she is insulted. Brad gets a knife thrown into his shoe, and Chris wields it against the gang, quoting her famous line: \"Don't fuck with the babysitter.\" When they back off, the four of them leave the train and rush Brad to the hospital. After a scare where they think Brad has died, they run into Pruitt again, who tells them that they will need to pay $50 for the tire, as he had to pay for the windshield damage from the gunfight earlier. They arrive shortly after at a fraternity party. Chris meets a new love interest in Dan Lynch who manages to get together $45 toward the car's tire payment. Darryl gets into trouble with a jock whose lonely girlfriend attempts to have sex with him, and Dan takes them to Dawson's garage. Leaving, and expected never to be seen again as he did not give Chris an address to get hold of him to pay him back, upon entering the garage, they meet Dawson, whose long blond hair and physically fit appearance causes Sara to think he is the alter ego of Thor. Dawson, offended by the $5 shortage, refuses to relinquish the car, but Sara's selflessness in giving him her plastic Thor helmet prompts him to have a change in heart, he gives the car and her helmet to the kids, and lets them go. En route to the bus station, Chris spots the restaurant that Mike was supposed to take her to that night, and Darryl points out Mike's car in the parking lot. They go in to find that Mike is dating and flirting with the sleazy Sesame Plexer, and it is revealed that Mike was only dating Chris in interest of having sex with her. Brad stands up for Chris, but won't sink to his level. Darryl admits, \"I will\", and kicks Mike into a dessert cart. Meanwhile, Sara has slipped out of the restaurant to visit a toy store she had seen, and is approached by Bleak, who spots the Playboy in her backpack. They chase her down to the building that her parents are having their party in, and find through chocolate finger smudges on the elevator buttons which floors to check. Graydon exits in the renovated top floor of the building, and discovers Sara climbing out the window on a rope. Chris, Darryl, and Brad hot on their trail choose the wrong floor and accidentally crash the Anderson's office party. After a brief encounter with Bleak, both he and Chris notice Sara walking along the window ledge outside, and Chris causes Bleak to trip while she and Brad and Darryl go upstairs and discover Sara outside the window. After pulling her up to safety, Joe arrives and explains they were after the Playboy the whole time. They decide to leave Graydon outside and let him \"sweat a little\" while Joe shows his resignation from the car thieves by punching out Bleak, and they depart the building. Brenda discovers her glasses and steals them back, only to be chased from the bus station by everyone she had come across. Being chased by the homeless, she runs into the exterminators, past the hot dog vendor, and past the phone booth, which is a homeless man's house. After she gets outside, she is picked up by Chris and the others and she proclaims \"What took you guys so long?!\" On the way home, the kids pass the Andersons on their way home. Chris sends the kids upstairs and Brenda home before cleaning up the messes that had been made earlier in the day, coming to settle down just as the Andersons appear in the doorway, not suspecting a thing. Chris goes upstairs to say good night and announces her plans to retire from babysitting. They each admit to each other and thank themselves for \"What was probably the greatest night of their lives... so far\". As Chris leaves, Dan makes a surprising appearance to return Sara's skate, which she'd left in his jeep, as well as admit to Chris that he is interested in her. Sara shouts \"Kiss him!\" from the bedroom window, and they comply happily. Brad, who had come to realize that while they aren't boyfriend/girlfriend, he and Chris can still have a good friendship, accepts that Dan is better for her than he is. He closes the blinds to give the two some privacy, and the credits roll.",
      "writers": ["David Simkins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092513/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NzY3Njg4Nl5BMl5BanBnXkFtZTYwNzM3ODE5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Elisabeth Shue, Maia Brewton, Keith Coogan | See full cast and crew »"],
      "reviews": [
         "This is a really funny movie because you never really know where it's going. Basically everything that happens in it happens by accident. It's not only funny but also exciting if you aren't that old. I think it's great. It sort of reminds me about \"Afterhours\" (starring Griffin Dunne) but this is the family version of that movie. Anything can happen during a crazy night or so it seems. Elisabeth Shue is good in this movie and everyone in it seems to have had a good time making it. If you just want to see a cute movie which makes you feel good , or if you've had enough of over-dramatic epics , action that blows you out of your seat and bloody horror movies , check this out. It's sweet , funny , lovable and adventurous all at the same time. If you don't like it , there are more than enough of violence out there for you.",
         "Why does this movie have such a low rating on this site? This is such a good movie! Ok, I'll admit, the story is pretty odd, but it's still very good, and it's a great adventure. All the actors do a great job in the film. Elizabeth Shue looks as beautiful as ever and does a great job as Chris Parker. Keith Coogan does a great job as well. Other notable cast members are Vincent D'Onofrio, Penelope Ann Miller, Geroge Newbern, Bradley Whitford, and Lolita Davidovich. Also, I have to hand it to director Chris Columbus, he did a superb job with this film. Amazingly enough, this was his first directorial effort too. Good job Chris! It's always good to see where directors come from, if you didn't know, he went on to do \"Home Alone\", \"Home Alone 2: Lost in New York\", \"Mrs. Doubtfire\", \"Bicentennial Man\", and \"Harry Potter: The Sorcerer's Stone\", just to name a few. There are so many good things about this film! This movie's got action, adventure, and comedy. The comedy in the film is absolutely fantastic! There are a few scenes that crack me up just thinking about them. ...And there are a great number of quotable lines that everyone that has seen this movie will remember. Anyhow, I strongly suggest you see this film! I really hope that you enjoy the film if you haven't seen it already. Thanks for reading, -Chris",
         "\"Adventures in Babysitting\" is a movie that I'll never forget. One of the reasons why this film is so memorable is because of the Chicago locations. For the past 25 years or so there have been lots of good movies shot in and around Chicago (as well as the suburbs) such as \"Risky Business\", \"Ferris Bueller's Day Off\", and \"The Fugitive\" just to name a few. But \"Adventures in Babysitting\" is probably my favorite movie to be made in Chicago. I saw this movie when it first came out in the summer of 1987 (a year after \"Ferris Bueller\" which \"Adventures\" bares somewhat of a resemblence to) and while I was watching the film it felt to me like I was part of the adventure. Today, this is still a very entertaining picture, and a lot of fun. Elisabeth Shue is terrific in her first leading role as Chris Parker, a 17-year-old high school senior who prepares for a big date with her boyfriend at the beginning of the film. But he cancels the date, and since she's now free for the night, she's asked to babysit for the Anderson kids. She agrees. Once she gets over there, she gets a frantic phone call from her best friend Brenda (Penelope Ann Miller) who's run away from home and is now stranded at a bus station in downtown Chicago. Terrified after witnessing a shooting, Brenda asks Chris to pick her up because she blew all her money on the cab ride to the bus station. Hesitant, Chris has no choice but to take the two Anderson kids Sara (Maia Brewton) and Brad (Keith Coogan) with her to pick up poor Brenda. Also going along for the ride, Brad's horny best friend Daryl (Anthony Rapp). Once they get on the expressway, things start to go wrong. Very wrong. This is where \"Adventures in Babysitting\" turns into a fun movie. The foursome experience car troubles; run-ins with a friendly car thief, a mob group the thief works for (who spend most of the movie chasing the kids through the streets of Chicago), and two gangs on a train; a short trip to a hospital (when one of the kids is slightly injured by a member of one of those gangs); a brief stop at a frat party; a chase to the top of a high-rise building; and a show stopping classic scene in a blues bar. And much more happens as the hapless Brenda continues to wait and wait and wait for Chris to come get her. \"Adventures in Babysitting\" was directed by Chris Columbus in his directing debut after writing screenplays for a couple of Steven Spielberg produced movies (\"Gremlins\", \"The Goonies\", and \"Young Sherlock Holmes\"). Since this film, Columbus has gone on to direct some of the biggest box office hit comedies of all-time such as \"Home Alone\", \"Home Alone 2\", and \"Mrs. Doubtfire\". \"Adventures in Babysitting\" was nowhere near as big a hit as those films, but it did modestly well. I would have loved to see a sequel to this. It would have been interesting to see what kind of misadventures were next for Chris and company. Shue, Brewton, Coogan, and Rapp all seem to be having a blast on screen, and I would too if I were up their on the screen. Even though Miller doesn't seem to be having a good time, she's a scream as Brenda (she would later show off some real good acting in \"Kindergarten Cop\" and \"Awakenings\"). And Vincent D'Onofrio (of \"Men in Black\" and currently \"The Cell\") has one of his first film roles in a very small part as the owner of a auto repair shop (where the broken down car gets fixed). \"Adventures in Babysitting\" is a movie that's great fun from start to finish and never lets up. This comedy/adventure is awesome! **** (out of four)",
         "For an unknown (to me) reason, when I saw this on British TV, it was called \"A Night On The Town\", a far inferior title than 'Adventures in Babysitting', although maybe they figured that parents would think this a children's movie... Anyway, the movie itself is charming in that way that only 1980s US comedy films are. There is an air of innocence to the whole thing, before these more conscious and overtly cynical days that we know and hate now - maybe a reason why 1980s retro is all the rage now... that, and things are cyclical. I thought the film WAS charming, although entirely far-fetched in its plot lines, although I think that was kind of the point. The characters, while not being very complicated, were warm and at least not entirely two-dimensional, and the little girl was quite cute and not extremely annoying as could have happened. Overall, I'd recommend it to hounds who love to watch 80s films.",
         "\"Adventures in Babysitting\" is an underrated gem featuring a very strong young cast. The movie opens with Chris Parker (played by Elizabeth Shue in a very early starring role) first finding out that her boyfriend can't make their big date that night. So she agrees to babysit Sara and Brad Anderson, played by Maia Brewton and Keith Coogan (both of whom have dropped off the face of the earth, apparently, in the last 10 or 15 years). Sara's kind of a brat, and Brad has a crush on Chris. Brad's best friend Daryl (played by Anthony Rapp, who went on to appear in \"Dazed and Confused\" and \"Road Trip\"), who is an annoying wise-ass, also drops by. Things go okay until Chris gets a call from her best friend Brenda (Penelope Ann Miller), who says that she ran away from home, and is now stuck at a bus station in the city with no money and no way home, and of course she can't call her parents. This prompts Chris to take the kids (including Daryl) on a little trip, and of course, hilarious hijinks ensue. They have a tire blow-out, and are helped by a mechanic with a hook for a hand. Their car is then stolen, and they go to try to get it back. They're caught by the mobsters running the car ring, and have to escape (which they achieve by walking along a very thin metal beam overhead). But the mobsters catch them trying to leave, forcing them on the run and leading to one of the funniest scenes in the movie: going through a blues club, the singer stops them, saying \"Ain't nobody leaves here without singing the blues.\" So they do, Chris leading, singing a song about their predicament. It's both cute and hilarious, with the others joining in singing back-up (\"And we should be in bed!\"). The rest of the movie is about them being chased through the city by these mobsters, and of course, there's one funny bit after another, with some suspenseful bits thrown in for good measure. This is all hilarious, but the best scenes are the ones interspersed throughout with Brenda trying to get along at the bus station. Penelope Ann Miller truly steals the show; scared out of her skull, she has to contend with such problems as a bum yelling at her to get out of his \"house\" (a phone booth); getting her glasses stolen by a bag lady (the look on the bag lady's face when she puts them on and realizes she can see is priceless); a hot dog vendor who won't help her out (\"Then I don't have a wiener!\" he says when she says she doesn't have any cash); and a jumbo-sized sewer rat she tries to rescue, thinking it's a cute little kitty cat (because she can't see). This is probably the best part Penelope Ann Miller has ever had, and she demonstrates a surprising talent for screwball comedy. Like I said, the rest of the young cast is great; Shue pretty much began her career here, and Coogan, Rapp, and Brewton (who was also very funny on the also underrated TV show \"Parker Lewis Can't Lose\", which I'm dying to see come out on DVD) put in funny, though clichéd, parts. \"Adventures in Babysitting\" is one of those movies that just sounded kind of dumb based on the title (like \"Buffy the Vampire Slayer\"), but if you haven't seen it, give it a try anyway; the brilliant gags and the strong acting made it work.",
         "I grew up with this movie and always wanted to be like Chris. She was so beautiful and handled the toughest situations so well. She took the deadliest situations and got the kids out of them so safely. Well, now I babysit and I'm glad I never got in the same situation, but it still made for a great and fun movie. Chris is a senior who has a big date planned with her boyfriend, but when he cancels, she is forced to babysit the Anderson's daughter, Sara. They also have a son, Brad is a couple years younger and has a huge crush on Chris and decides to cancel on his friend, Darrel to stay home with Chris. But when Chris's best friend, Brenda, calls her from the Anderson's, she finds out her friend is stranded at a bus station and can't get anyone else to help her. So Chris takes Brad and Sara and is forced to take Darrel since he won't leave them alone, they all go into the city of Chicago and end up getting a flat and get into one deadly situation after the next, even getting chased by the Mafia! This is a fun flick that I still watch 'til this day and have so much fun with. I would always recommend this also for anyone, I truly hope it is discovered by new generations. I still enjoy singing along with the \"Babysitting Blues\", I think I finally feel Chris's pain, after all, I'm too old to babysit. :D 7/10",
         "When I first saw this movie in the late 1980's I thought to myself how whenever I had babysat I had had a pretty boring night stuck in front of a TV hoping the kids wouldn't wake up crying and spoil the peace. How I wish they had been more like this movie. Elizabeth Shue plays Chris Parker who is babysitting one night but due to certain circumstances ends up taking the kids out on the town in order to pick up one of her friends. What follows is all sorts of adventures involving thugs, crooks, thieves, the lot. The film is totally funny to watch and has some really good scenes in. Two that come to mind involve a fight between two gangs on a train and one involving the god of Thunder Thor (well, not the Thor you would be expecting). This is an exciting movie which was typical of 1980's movies. Boy, I wish they could make movies like that now. The 80's has got to be the best decade ever for films of all genres and this movie is just one of many great comedy films of that era. Oh and by the way, I think Elizabeth Shue is beautiful and I believe this was her best role.",
         "I didn't want to go see this movie back in '87 with my kids, but I was dragged into it. The movie was awesome then, and it still remains a great movie. Why? The music. Anyone even remotely interested in \"The Blues\" as a music genre should have this DVD in their library. Not only do you get some great blues music as part of the scoring, the incidental Blues Club Scene, vintage Chicago, pulls this out of the ordinary to a slam for music lovers. And, ... how about the straggling scene after the credits, which is standard today. Heck, I'm in my 50s, and I still have to pull this movie out to hear the harp licks.",
         "Uriel's Movie Reviews - Adventures in Babysitting***1/2 (1hr 39min)(Rated PG-13) The 1987 flick from future Harry Potter and Mrs. Doubtfire director Chris Columbus, Adventures in Babysitting is a good film and it has some fun moments in it. Its about a high school senior named Chris Parker(Elisabeth Shue) in a rich suburb of Chicago, where she has just been agrees to babysit for a pre-teen girl named Sara (Maia Brewton) and his older brother Brad(Keith Coogan), with his friend Daryl(Anthony Rapp). The children's parents leave for a party and the babysitter relaxes thinking this will be another boring night, however, she receives a call from her friend who just ran away from home and is at the train station in Chicago. She is scared and wants her to come and pick her up. The babysitter cannot leave the children alone and so she takes them and one of the teenagers' friend on a wild and crazy adventure. In her pursuit to pick up her friend, they have to deal with being in a love quarrel where pistol is being fired, and then, being in a stolen car that results in gangster-like characters chasing them because they posses information about their operation. The reason why this movie is so good is that the characters are rich and come from a secluded suburban area who never had to deal with the hard life of the inner-city, and One interesting moment in the movie is when they were in a blues club and they were told they could not leave without singing the blues. This is really good, and also fun movie to enjoy.",
         "In the suburbs of Chicago, the seventeen year-old Chris Parker (Elisabeth Shue) is in love with her boyfriend Mike (Bradley Whitford). When Mike stands her up and cancels their dinner in Chicago, Chris accepts to babysit the siblings Sara (Maia Brewton) and Brad (Keith Coogan). But her friend Brenda (Penelope Ann Miller) calls her telling that she decided to run away home but now she has repented; she begs Chris to rescue her from the bus station in downtown Chicago. Chris makes a deal with Sara and Brad and when she is ready to drive to downtown, Brad's friend Daryl (Anthony Rapp) overhears the negotiation and blackmails Chris to go with them. However, when they are on the expressway, Chris has a flat tire and she realizes that she has forgotten her purse in the house. The mechanic Pruitt (John Ford Noonan) stops this tow truck and offers to truck the car to his garage. Chris sees no other option and accepts the offer in the beginning of an unforgettable night of adventures in Chicago. \"Adventures in Babysitting\" is one of those adorable cult-movies for the entire life. I saw this movie in the 80's and since then, it has become one of my top movies ever. There are unforgettable scenes and maybe my favorite is when Albert Collins says that nobody leaves the club without singing a blues. The 25th anniversary Blu-Ray is really a worthwhile shopping. My vote is nine. Title (Brazil): \"Uma Noite de Aventuras\" (\"One Night of Adventures\")"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Silver Screen Partners III"
      ],
      "summaries": [
         "Chris Parker agrees to babysit after her \"dread\" date stands her up. Expecting a dull evening, Chris settles down with three kids for a night of TV... and boredom. But when her frantic friend Brenda calls and pleads to be rescued from the bus station in downtown Chicago, the evening soon explodes into an endless whirl of hair-raising adventures! Babysitter and kids leave their safe suburban surroundings and head for the heart of the big city, never imagining how terrifyingly funny their expedition will become!",
         "In the suburbs of Chicago, the seventeen year-old Chris Parker is in love with her boyfriend Mike. When Mike stands her up and cancels their dinner in Chicago, Chris accepts to babysit the siblings Sara and Brad. But her friend Brenda calls her telling that she decided to run away home but now she has repented; she begs Chris to rescue her from the bus station in downtown Chicago. Chris makes a deal with Sara and Brad and when she is ready to drive to downtown, Brad's friend Daryl overhears the negotiation and blackmails Chris to go with them. However, when they are on the expressway, Chris has a flat tire and she realizes that she has forgotten her purse in the house. The mechanic Pruitt stops this tow truck and offers to truck the car to his garage. Chris sees no other option and accepts the offer in the beginning of an unforgettable night of adventures in Chicago.",
         "Chris has a big night out planned when her boyfriend cancels on her. She agrees to babysit for a preteen girl and a pubescent boy. She's settled in for a dull night when a girlfriend calls her to say she's marooned at a downtown bus station with very seedy characters around. The three plus one of the boy's friends get into the parents' station wagon for a trip to the inner city. All is well until the flat tire.",
         "Chris Parker is a high school senior that her date stands her up. The only thing she can do now is babysit Brad and Sara Anderson, and their annoying sex fiend neighbor Darryl. When her friend Brenda is trapped in a bus station, Chris has to travel out of the suburbs to the big city. While there and with a flat tire, Chris, Brad, Sara, and Darryl get caught in the middle of a mafia deal lead by Dan Lynch because of a Playboy magazine. Will they be able to get back to the 'burbs?"
      ],
      "budget": 0
   },
   "movielensId": 2133,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-07-01",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Chris Columbus"],
      "runtime": 102,
      "movieId": 2133,
      "title": "Adventures in Babysitting",
      "mpaa": "PG-13",
      "actors": [
         "Elisabeth Shue",
         "Maia Brewton",
         "Keith Coogan",
         "Anthony Rapp",
         "Calvin Levels",
         "Vincent D'Onofrio",
         "Penelope Ann Miller",
         "George Newbern",
         "Bradley Whitford",
         "John Ford Noonan"
      ],
      "imdbMovieId": "0092513",
      "originalTitle": "Adventures in Babysitting",
      "genres": [
         "Thriller",
         "Comedy",
         "Crime",
         "Adventure"
      ],
      "youtubeTrailerIds": [
         "4FOQNuKcf7s",
         "5ng5XOCwQk4"
      ],
      "plotSummary": "When plans with her boyfriend fall through, high school senior Chris Parker ends up babysitting the Anderson kids, Brad and Sara. What should be a quiet night in, however, turns into a series of ridiculous exploits, starting when they leave the house to pick up Chris' friend Brenda. Soon, Brad's buddy Daryl is involved, and the group must contend with car thieves, blues musicians and much more.",
      "tmdbMovieId": 14367,
      "avgRating": 3.23232,
      "releaseYear": "1987",
      "numRatings": 5133,
      "posterPath": "/cYCpqHVoZvf5x4bO8EA68YBX1N.jpg"
   }
}