{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "snail",
            "id": 4455
         },
         {
            "name": "vegetarian",
            "id": 4459
         },
         {
            "name": "rainstorm",
            "id": 156507
         },
         {
            "name": "shell",
            "id": 194258
         }
      ],
      "imdb_id": "tt0061584",
      "video": false,
      "title": "Doctor Dolittle",
      "recommendations": [
         41521,
         4952,
         43812,
         33839,
         16618,
         52276,
         42222,
         43852,
         41951,
         35992,
         25167,
         3092,
         44747,
         29464,
         14328,
         24807,
         26520,
         29882,
         30204,
         16515
      ],
      "backdrop_path": "/dYakGhfA6o1KBl73DBdwtR6Db5u.jpg",
      "revenue": 9000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. John Dolittle",
               "gender": 2,
               "credit_id": "52fe469f9251416c7507e2d5",
               "name": "Rex Harrison",
               "profile_path": "/nWFxAoYfFURmIxz9YJBQ9DLcDx6.jpg",
               "id": 35321,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Emma Fairfax",
               "gender": 1,
               "credit_id": "52fe469f9251416c7507e2d9",
               "name": "Samantha Eggar",
               "profile_path": "/cd8H4zvFKDsGOHgYAOGzpYzkFaj.jpg",
               "id": 46780,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Albert Blossom",
               "gender": 2,
               "credit_id": "52fe469f9251416c7507e2dd",
               "name": "Richard Attenborough",
               "profile_path": "/Abo8fAcdruACs344ut6PNSKH7N4.jpg",
               "id": 4786,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Matthew Mugg",
               "gender": 2,
               "credit_id": "52fe469f9251416c7507e2e1",
               "name": "Anthony Newley",
               "profile_path": "/qgIIdT8QN7z6lJdOM7easJNyOX2.jpg",
               "id": 81409,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "General Bellowes",
               "gender": 2,
               "credit_id": "52fe469f9251416c7507e2e5",
               "name": "Peter Bull",
               "profile_path": "/iIh6WkuefTUVrEybz1CXdz86puI.jpg",
               "id": 6600,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mrs. Blossom",
               "gender": 1,
               "credit_id": "52fe469f9251416c7507e2e9",
               "name": "Muriel Landers",
               "profile_path": null,
               "id": 120340,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tommy Stubbins",
               "gender": 2,
               "credit_id": "52fe469f9251416c7507e2ed",
               "name": "William Dix",
               "profile_path": "/7oUAy5yQDSdBZGuo30bnG3ZJ3Fo.jpg",
               "id": 996597,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "William Shakespeare X",
               "gender": 2,
               "credit_id": "52fe46a09251416c7507e2f1",
               "name": "Geoffrey Holder",
               "profile_path": "/bmNg7Ld2H1V3Sqz2PmxvOJOof8z.jpg",
               "id": 10225,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sarah Dolittle",
               "gender": 0,
               "credit_id": "52fe46a09251416c7507e2f5",
               "name": "Portia Nelson",
               "profile_path": "/fOhxKucuutEwKNZMvg00BuFUBsa.jpg",
               "id": 198948,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Lady Fetherington",
               "gender": 1,
               "credit_id": "52fe46a09251416c7507e2f9",
               "name": "Norma Varden",
               "profile_path": "/drT8Epg6NOot7OKG1jLZDdagN4U.jpg",
               "id": 10926,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe469f9251416c7507e2cb",
               "name": "Richard Fleischer",
               "profile_path": "/pChGBiYPxqPfozB7GlDFCIjCQxs.jpg",
               "id": 2087,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe469f9251416c7507e2d1",
               "name": "Leslie Bricusse",
               "profile_path": null,
               "id": 3616,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57699aaec3a36836ed0004da",
               "name": "Hugh Lofting",
               "profile_path": "/lXN9dYciu46rj9frGFY8t2iW15Q.jpg",
               "id": 1454647,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "57699ab892514117790004d6",
               "name": "Arthur P. Jacobs",
               "profile_path": null,
               "id": 13269,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57699abfc3a3683726000550",
               "name": "Mort Abrahams",
               "profile_path": null,
               "id": 18636,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "57699acfc3a36836610004d9",
               "name": "Leslie Bricusse",
               "profile_path": null,
               "id": 3616,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57699b30c3a36833a1000641",
               "name": "Robert Surtees",
               "profile_path": "/6CuhH7m0KvjbR088xyaJurddfZH.jpg",
               "id": 10005,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57699b38c3a3683726000560",
               "name": "Samuel E. Beetley",
               "profile_path": null,
               "id": 10151,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "57699b3fc3a36833700005c3",
               "name": "Marjorie Fowler",
               "profile_path": null,
               "id": 18664,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "57699b47c3a36836a60004c8",
               "name": "Mario Chiari",
               "profile_path": null,
               "id": 25802,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57699b4e92514117790004e2",
               "name": "Ed Graves",
               "profile_path": null,
               "id": 224960,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "57699b55925141174d0005bd",
               "name": "Jack Martin Smith",
               "profile_path": null,
               "id": 9061,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "57699b5b92514115220005bf",
               "name": "Stuart A. Reiss",
               "profile_path": null,
               "id": 9799,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "57699b6492514114f70004ff",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "57699b6a92514115220005c4",
               "name": "Ray Aghayan",
               "profile_path": null,
               "id": 91231,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "57699b7392514115220005c6",
               "name": "William Eckhardt",
               "profile_path": null,
               "id": 1336289,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "57699b7b92514114f7000502",
               "name": "Jack Stubbs",
               "profile_path": null,
               "id": 1383415,
               "department": "Production",
               "job": "Unit Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 3.649231,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16081,
      "vote_count": 53,
      "budget": 18000000,
      "overview": "Get ready for the wildest adventure of a lifetime in the most ambitious production ever brought to film. Earning a 1967 Academy Award nomination for Best Picture, this dazzling fantasy turns both ordinary and exotic animals into talking, dancing and singing sensations! Rex Harrison is unforgettable in this inspiring adaptation of Hugh Lofting's classic stories.Step into the English country home of the good doctor as he performs remarkable treatments on the wildest variety of patients you could imagine. Discover his secret cures and watch with wide-eyed excitement as he and his four-legged, fine-feathered friends charm their way into your heart!",
      "similar": [
         253,
         646,
         657,
         667,
         699,
         708,
         668,
         682,
         714,
         691,
         267935,
         146216,
         634,
         658,
         954,
         707,
         259693,
         3933,
         10204,
         291805
      ],
      "original_title": "Doctor Dolittle",
      "runtime": 152,
      "poster_path": "/hsbUAyzgMtF7NC6pR2SEk0UgeNU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "APJAC Productions",
            "id": 12943,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1967-12-19",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Ride across the sea inside the GIANT PINK SEA SNAIL!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Richard Fleischer"],
      "runtime": 152,
      "synopsis": "During the opening credits, which feature animations of various animals, the orchestra plays an overture of three songs from the film, most notably \"Talk to the Animals.\" The action begins in the quaint 19th century English seaside village of Puddleby-on-the-Marsh. Matthew Mugg, an Irish fishmonger, meets his young friend Tom Stubbins, as Matt wheels his fish barrow around the wharf collecting fresh seafood for his customers. Matthew rescues an injured duck from a fisherman who intends to eat it for his dinner. As soon as Matthew finishes his rounds, he tells Tom they will take the duck to John Dolittle, the greatest animal doctor in the world. Matthew explains that Dolittle talks to the animals to determine what ails them. To explain further, Matthew sings \"My Friend the Doctor.\" During the song Tom accompanies Matthew as he makes his deliveries to his customers. By the time the song ends, they have arrived at Dolittle's house. When a chimpanzee and a parrot answer the door, Matthew introduces Chee-Chee and Polynesia to Tom. After the introductions, they go into the library where Dr. Dolittle is trying to converse with some goldfish. He explains to Matthew and Tom that he is attempting to gather information about the legendary Great Pink Sea Snail. He soon plans to embark on a voyage to find the creature. Tom takes the duck out of his coat where he has been keeping it safe and hands it to the doctor. After a few quacks back and forth, Dolittle is certain that the drake has had a row with his wife. The doctor invites Tom and Matthew to dinner and instructs Polynesia, the parrot, to prepare for two more guests. Tom and Matthew had encountered a thunderstorm on the way to Dolittle's, so the good doctor furnishes them with dry clothes. When they return from changing out of their wet togs, Chee-Chee is frying sausages and bacon while a pig is squealing his displeasure. The doctor doesn't join them for dinner. He explains that he doesn't eat meat; it upsets the animals and besides one shouldn't eat their friends. In \"The Vegetarian,\" Dr. Dolittle explains further. Instead of meat, he eats such things as apple cores, plain brown bread and drinks parsnip juice. He admits, however, that the sausages look very good and begins to waver in his conviction. At that point, he calls such things as turnip pie and peanuts filth and rubbish and proclaims: \"I'm a cheat! I love meat!\" However, when he hears Gub-Gub, the pig, squeal, he returns to being a reluctant but sincere vegetarian. When Tommy asks how he became a veterinarian, Dolittle explains that his sister, Sarah, started it all. At that point, the film flashes back to an earlier time when Dolittle was a human doctor and his sister was his house keeper. Sarah complains when her brother brings animals into the house and gives them sleeping space all over the inside of their home. Presently, Lady Petherington arrives to see the doctor. Her nerves are frayed because during a dinner party the previous evening a mouse had scampered across her table. While she is explaining this to the doctor, little white mice are crawling on her chair and onto her enormous bonnet. Soon the village's Vicar arrives with a terrible sneeze. He explains to Sarah that the Bishop is coming to visit and the Vicar needs to be in good health when he arrives. Then the village Magistrate, General Bellowes, arrives with a bandaged foot. Suddenly, Lady Petherington screams and runs from the doctor's office. Her screams cause other accidents that cause more problems for the Vicar and Bellowes. By the time they all leave, Sarah presents an ultimatum to her brother: either the animals go or she goes. Dolittle chooses the latter option. Later that evening when Matthew stops by for a friendly visit, Dolittle is despondent. He admits to Matthew that he is not a good doctor because he really doesn't care about his patients. He doesnt have anything in common with the human race. From its perch, Polynesia says, \"Be an animal doctor.\" Dolittle immediately likes the suggestion. After all, he says, there's not one good animal doctor in the west of England. When he learns that Polynesia, a 199-year-old parrot, speaks 2,000 animal languages, he asks if he could I learn to talk to animals? The parrot assures the kindly doctor that he could and that she will teach him. Dr. Dolittle is so keen on this idea that he expresses his feelings in \"Talk to the Animals.\" Later, Matthew, Tommy and Polynesia join the doctor in the song. During the song, Dolittle goes to bed still thinking about all the animal languages he can learn so he can speak to each animal when he encounters them. In the morning, he is still awake and continuing to sing (in his mind). Once he dresses for the day and goes downstairs, Polynesia helps him say good morning to Gub-Gub, the pig, by combining sounds with foot and leg movements. The doctor is so excited with his success in communicating with the pig that he informs Polynesia that he wants to say good morning to every animal in Puddleby (and the song continues as they greet various animals). After the song, the film returns to 1845. Dr. Dolittle informs Tommy that he has learned 498 animal languages. The doctor is reminded that he'll need more than languages if he intends to search for the Great Pink Sea Snail. He'll also need lots of money. One of Dr. Dolittle's patients is a short sighted horse, which he furnishes with gigantic glasses. However, the horse's owner, General Bellowes, bursts into the doctor's office and accuses the doctor of being a horse thief. A mother fox and her babies get extremely nervous at the sight of Bellowes; he has been hunting foxes lately and has chased the mother. When the mother fox runs away, the horse bolts and runs out of the office too. Bellowes chases them , but is foiled by some skunks. Dolittle explains to Tom and Matthew that he imported the skunks from America to help protect the foxes. He assigns each skunk to a fox to disguise their smell from the foxhounds. Emma Fairfax, Bellowes' niece, had accompanied her uncle to Dolittle's office. She chides the doctor for his irresponsibility and rudeness to her Uncle. She would like to be a man so she could take revenge. For her feistiness, Matthew gives her the nickname \"Fred.\" Her horse had been spooked by the skunks, so she is forced to walk home. During her walk across the countryside and through streams, Emma sings \"At the Crossroads.\" In the lyrics, she admits that her life is not the one she intended to lead. Later, Dolittle and his friends find a huge package in his yard. When they open it they discover a two-headed llama-type creature from Tibet, the Pushmi-Pullyu. A picture message from Dolittle's friend, Long Arrow, accompanied the package; the message encouraged Dolittle to use the Pushmi-Pullyu to make the money necessary for the voyage to search for the Great Pink Sea Snail. Matthew, Tommy and Dolittle take the creature to a nearby circus owned by Albert Blossom. Once Blossom sees the creature, he is so excited he sings \"I've Never Seen Anything Like It.\" He calls all the circus performers out to see this amazing animal. Dr. Dolittle sings about the Pushmi-Pullyu's dance ability and he and the creature demonstrate with a minuet-type dance. Once Blossom agrees to share the profits, he and Dolittle finally agree on a deal. The Pushmi-Pullyu becomes the star attraction of the Dolittle and Blossom Circus and crowds flock to see the creature dance. Emma is seen among those in the audience. Later, Emma comes to the circus to complain about Dolittle exploiting the animals, but Matthew defends his friend. Matthew, who is infatuated with \"Fred,\" attempts to help her understand by singing \"Beautiful Things.\" He sings that our lives are full of beautiful things. By the end of the song, Emma seems to have changed her mind about the doctor. When the circus seal can't catch the ball thrown by his handler, Dr. Dolittle befriends the seal named Sophie and discovers that she misses her husband who is at the North Pole. Dolittle decides to take her to the Bristol Channel so she can swim to her husband. That night he sneaks her out of the circus dressed as a baby in a pram (perambulator). Once it is daylight, he dresses the seal in a woman's hat and clock he took from a tavern, so they can catch the coach to Bristol. When the road is blocked by police a few miles from Bristol, Dolittle and the seal transfer to a hay wagon. Once the driver stops, Dolittle talks to the horses into delivering the seal and the doctor to the rocky Bristol Channel shoreline. Just before he helps the seal into the sea, Dolittle sings \"When I Look Into Your Eyes.\" Dolittle kisses Sophie goodbye and tosses her into the ocean still in the lady's clothing. When he turns around, two men are standing there; they think he has thrown a woman into the water, so he is hauled off to court. Unfortunately, the Magistrate for Dolittle's hearing is General Bellowes (Emma is seen in the court room). Of course, everyone thinks Dolittle is daft when he claims the seal asked him to help her get to her husband. The Doctor attempts to prove his ability to talk to animals by staging a conversation with Bellowes' Great Dane, Rufus. When Dolittle translates the dogs report of the gigantic dinner the General consumed the previous evening, Bellowes takes offense and dismisses the court until the following day. When Tommy and Matthew visit the doctor in his cell, Emma brings Tom and Matthew dinner and tells Dolittle that Rufus was correct about her Uncle's meal. The next day, the General announces that Dr. Dolittle has been acquitted, because the lady who owned the stolen clothes refused to prosecute (there seems to be some indication that the lady is Sarah, Dolittle's estranged sister), however, the General and a couple of other judges agree that Dr. Dolittle's talking to animals necessitates his being committed to an asylum. As his last speech before being taken away, Dolittle sings a clever song, \"Like Animals.\" The doctor admits to not understanding the human race and accuses people of inhumane treatment of animals. He also abhors human phrases like \"treat him like a dog,\" \"working like a horse\" and \"eating like a hog\" (when we mean \"eating like a man\"). He also complains that we call a hoodlum a weasel or a rat and a woman of ill-repute a vixen or a cat. He chides the women in the courtroom for wearing furs by asking them if they ever thought they were wearing someone's brother or mother. After his song, Dr. Dolittle is escorted to the jail awaiting transfer to the asylum. Matthew and Tommy plot to break their friend out, but Emma is skeptical that their plan will work. Matthew tells her that he, Tommy and several of the animals will sail away to search for the Great Pink Sea Snail as soon as they break the doctor out of jail. Emma begs Matthew to allow her to come along on the voyage as their cook. Matthew doesnt exactly approve, but he hints that if she were to stowaway he wouldn't know where to look for her. When she kisses him for the idea, he sings \"After Today.\" He is confident that one little kiss will change his life. On the day the doctor is being transferred to a police wagon to take him to the asylum, Polynesia talks the horses into running away before the policemen board. She also convinces the police horses to buck and rear allowing the wagon to get away. Chee-Chee steals the keys to the police wagon so it can be unlocked to free Dr. Dolittle. In the next scene, their ship, the Flounder, is at sea. Dolittle quickly discovers that Emma is on board and has prepared a vegetarian meal, seaweed pie, for them. When Dolittle objects to having a woman on the voyage, Emma assures him that she expects to be treated as one of the crew... and, as a matter of fact, she often ends up with the hardest and dirtiest jobs. During dinner, Emma asks where they are going. Dolittle explains that he randomly sticks a pin into any page of the map and they simply end up there. Emma can't believe their destination is determined so haphazardly. She begs the doctor to take them to exotic locations in the song \"Fabulous Places.\" Matthew, who is still infatuated with Fred, also joins her in the song. Their protests are in vain. At the end of the song, Emma drops the pin on the map; it lands on the tiny Sea-Star Island, a floating island. During a fierce storm, the Flounder is torn apart. Dolittle, Matthew and Tom are floating on separate parts of the wreckage, but they have no idea if Emma is safe. As if it were planned, the Sea-Star Island comes floating by, so Dolittle talks a porpoise into pulling him on shore, while Matthew and Tommy paddle their parts of the wreckage. Shortly after they reach shore, Tom and Matthew leave to search the island for Emma. While they are gone, she walks out of the woods onto the beach dressed in her under garments (all of her dresses were lost in the storm). Dolittle and Emma both seem to realize they are mutually attracted to each other and express their feelings in the song \"I Think I Like You.\" Suddenly, Emma and John are taken captive by a group of savages. They are taken to the village and are tied up in a hut where Matthew and Tom are similarly captive. Dolittle talks some mice into chewing through the ropes that bind him and he unties the others. When he looks outside, Dolittle discovers frost; the island has been blown off course by the storm. When the chief of the tribe comes to the hut, the doctor says, \"Hello. Me Doctor Dolittle. Here little boy, late for school, here very cold. They all go home Puddleby, yes?\" And in perfect English, the chief replies, \"What a funny accent.\" The chief's name is William Shakespeare, the Tenth. He explains that they name their children after their favorite authors. Lots of ships have wrecked on the island and they have collected numerous books and treasures and have become quite educated and civilized. However, they do have some strange laws, such as the person who brings winter must die - meaning Dolittle. The doctor quickly learns that the climate change has caused health problems for the other living things on Sea-Star Island, so he, of course, doctors them. The chief, who is known as Willie, is impressed by Dolittle's healing powers, so the death sentence is lifted. Dolittle then gets the idea to ask a blue whale to push the island back on course, but when the island begins to move, a revered balanced stone falls into a volcanic crater. Disturbing the balanced stone also carries a death sentence. Just before that sentence is carried out, the whale pushes the island back into the African mainland where it belongs. Once again, the death sentence is lifted. Dr. Dolittle resumes his task of treating the island's creatures. When several of the island's children gather, Matthew, Tommy and Polynesia sing \"Doctor Dolittle\" to welcome the children to the doctor's wonderful world where crocodiles talk and elephants sing. After the song, they hear an unusual noise. The sound is the Great Pink Sea Snail sneezing. Dr. Dolittle concocts a tonic for the snail and in gratitude it offers to transport them back to England. Since the snail's shell is watertight and has room for several passengers, Dolittle sends Matthew, Tommy, Emma and his animals back, but decides to stay behind on the island since he would be sent to the asylum if he returned. During his goodbye to Emma, Dolittle tells her he plans to explore the moon on the Giant Lunar Moth. Emma wants to remain with Dolittle, but finally kisses him goodbye and tells him she will miss him. Once she gets inside the shell and the snail sails away, she starts to cry. A little while later, Sophie, the seal, and her husband turn up at the Sea-Star Island. She tells Dolittle that the animals of England have gone on strike until he is allowed to return and the authorities are anxious for him to come back. The doctor quickly constructs a saddle and arranges for the Giant Lunar Moth to fly him back home that very evening. As the film ends with Dr. Dolittle astride the huge insect, a chorus sings a reprise of \"My Friend the Doctor.\"",
      "writers": [
         "Hugh Lofting",
         "Leslie Bricusse"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061584/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjMxOTM3NzU4M15BMl5BanBnXkFtZTgwNDU0MDUxMDE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rex Harrison, Samantha Eggar, Anthony Newley | See full cast and crew »"],
      "reviews": [
         "I know it goes against the general tide to praise this film (the only other place I've ever read a really positive review of it being the back of its own video cover), but I'm going to do it--and I'll even attach my name! For, in my opinion, this musical adaptation by Leslie Bricusse of Hugh Lofting's delightful \"Doctor Dolittle\" series succeeds in a great many respects. I was enchanted as a child when I saw it in the cinema, and I still enjoy watching it on video with my own children. The admittedly meandering plot combines elements from various of the Dolittle books, but it essentially concerns the Victorian veterinarian's quest for the Great Pink Sea Snail, an animal whose language he hopes to add to the thousands he has already learned. Thus the first part of the movie takes Dolittle and his friends through several adventures on their way to earning the money to make the journey, while the second finds the entourage actually setting sail (on the aptly-named \"Flounder\") for Sea Star Island and their goal. And, even if the musical *is* so front-end-loaded with big numbers that the second half seems anticlimactic, and even if the resolution of the plot's final conflict *is* jarringly abrupt, and even if the film's direction *is* a tad slow, it is *also* the case that I find more than enough pleasures along the way to compensate for these shortcomings. One is Bricusse's marvelous score. Besides the Academy Award-winning \"Talk to the Animals,\" he includes two other showcase pieces for star Rex Harrison's trademark \"powerful patter\" delivery, the humorous \"Vegetarian\" and the impassioned \"Like Animals.\" Other up-tempo winners are \"I've Never Seen Anything Like It\" (brilliantly put across by Richard Attenborough--the twinkle never leaves his eye!--in what amounts to an extended cameo as wily circus-master Albert Blossom) and \"Faraway Places,\" while tender ballads \"When I look in Your Eyes\" and \"Beautiful Things\" are very affecting. And if \"After Today\" seems to have been pulled from the trunk of another show by mistake, the other Anthony Newly numbers--including \"My Friend the Doctor\" and \"This is the World of Doctor Dolittle\" (as well as the lovely \"Where are the Words,\" which is on my soundtrack album but not in the video)--are spot on. Another pleasure is the cast. As the Doctor, Harrison is wonderful, of course. The film was originally conceived as a reunion project for him and composing team Lerner & Lowe, who'd written \"My Fair Lady,\" and it's clear that the part was written for the star. But I'm impressed that eventual Lerner & Lowe stand-in Bricusse, though he was obviously influenced by \"My Fair Lady,\" resisted what had to be the temptation to turn the main character into Henry Higgins--and that Harrison also didn't see the gig as a mere Higgins reprise. The charming Doctor--kind to animals, children, and people from all walks of life; educated and capable but somehow sweetly clueless at the same time; gentle but rousable to anger on behalf of his charges--is a different character, and Harrison gets him right. As for the other leads, Anthony Newly, for once, is perfect as the elfin Matthew Mugg, while child actor and \"whatever-happened-to\" candidate William Dix is a fine if underused Tommy Stubbins. Even Samantha Eggar, in the mis-conceived role of a tentative love-interest for Dolittle, does well with the part she's been given. And strong support is provided by the aforementioned Attenborough, Peter Bull as the beefy English squire who is the closest thing to a villain in this piece, and Geoffrey Holder as Willie Shakespeare, head of a quirkily-PC group of island natives encountered during the voyage. Finally, there's the appearance of the film: it's beautiful. If you find you can't enjoy a musical unless it's shot on a soundstage, the wide-open spaces won't work for you, but I loved all the wonderful locations. This is a big movie, long and theatrically-structured (Overture, Act I, Entr'acte, Act II, and even Exit Music!). They don't make them like this anymore--which sounds like a straight line, but I mean it in a regretful way. :-) I recommend \"Doctor Dolittle\" heartily, and I think the family will enjoy it even more if, before you watch it, you read a couple of the original Dolittle books together first! [P.S.-- don't be put off this film if you didn't happen to like the similarly-titled 1998 Eddie Murphy vehicle which billed itself as a remake. They're completely different!]",
         "My childhood favorite still holds up! In 1967 I remember sitting in the theater in awe of this tall Englishman that could sing & talk to animals. As an adult I can sit and enjoy another brilliant performance by the Late Great Sir Rex Harrison (God bless him!), this time as the Good Doctor Dolittle. Leslie Bricusse has done a wonderful job combining some of the Hugh Lofting tales into a Big Hollywood Musical! I only wish that all the songs made it to the screen. Two were cut, I guess for time (Where are the words?, Something in your smile) but show up on the soundtrack record & CD. Robert Surtee's photography is gorgeous! It really should have walked away with an Oscar that year. Richard Fleischer brings it altogether beautifully. His direction is just the right pace, letting us enjoy all the fantasy that is set in front of us. No quick cuts, loud noises - Hell, everything that audiences today never see. There is nothing wrong with taking time telling a story - I wish the new Hollywood understood that. The circus number with Sir Richard Attenborough is just as entertaining today as it was in 1967. The Pushmi-Pullyu may not hold up to the digital effects of today but it's still just as lovable. This family film is a treasure and it certainly is more to what Hugh Lofting envisioned compared to the recent Eddie Murphy films. If you ever have a chance to see this in a Theater - GO! The DVD has a beautiful transfer - I do wish the DVD had more extras, such as the two songs they cut for the final release. But it should be in the family collection. Remember it has Rex Harrison in the title role. That alone should give you a reason to see it - If you haven't already",
         "This has got to be one of the best movies ever made. The many wonderful and most importantly, memorable songs and lively characters contribute to the exciting and magical nature of the storyline. Anyone who can not see the inherent brilliance of this movie within the constraints placed upon films from this era is clearly missing the point. The delightful characters each add their own individual ideas to a film which has touched the hearts of children and adults alike. Rex Harrison plays a wonderful Doctor, forever entertaining and much more convincing than Eddie Murphy in the tragic American remake. This film is brilliant in its own right, and is definitely one for the books.",
         "Highly atmospheric and splendidly acted this film is a pure joy to watch. Legendary actor Rex Harrison give one of his best screen performances as the eracable,lovable Doctor. Anthony Newley gets one of his rare screen appearances and shows just what a talented performer he was.And of course Lord Attenbourgh's comic turn as Albert Blossom gives him rare comic opportunity.the score is well done by Leslie Bricusse (Newley's long time collaborator.)And the dialogue is sharp and witty. the performance are extremely real for a childeren's fantasy film. Its a shame that the Eddie Murphy misfire has taken recognition away from this charming film.",
         "If the only \"Dr. Dolittle\" you've ever known is Eddie Murphy's rendition, you need to see Rex Harrison's original performance! The first \"Dolittle\" has the remake and its sequel beat by a mile! Sure, it has the look and feel of those campy 1960's movies, like \"Mary Poppins\" and \"Chitty Chitty Bang Bang.\" But it also has the same comfy and family-friendly appeal. The original movie best captures the image of Hugh Lofting's famous veterinarian, in 19th-century England, just as he should be! So never mind Eddie Murphy, and enjoy the real Dr. Dolittle!",
         "I was taken as a child to see this movie in 1967 and loved it. I ended up buying the soundtrack, coloring books, puzzles, etc. It charmed me that much. Today, I still find it to be a great yet under-rated film. The DVD is nice, but this is a movie that is really meant to be seen on the big screen. That is why I also own a copy on 16mm film. What a difference it makes seeing it in this format. Regardless of how you watch it, this movie is entertaining for kids and adults of all ages. Those who might get bored with it are those who prefer the newer version with Eddie Murphey over this classic from 1967. Which, by the way, got nominated for Best Picture and won the Oscar for Best Song (Talk to the Animals). Rex Harrison's performance is outstanding as the wonderful Doctor Dolittle. I give this timeless film an 8 out of 10.",
         "So attached am I to Rex Harrison's personage to the character of Doctor Dolittle, when I see copies of Hugh Lofting's books without the movie tie-in shots I actually feel cheated. There is no other Doctor Dolittle for me. Harrison is wonderful and regal amongst his animals and I love many of his lines (the spin he gives to his dialogue makes the words his own). My favorite: \"When you say 'He can speak crab and pelican', they'll say 'Like hell he can!'\" (cue parrot's ruffled reaction). Admittedly, \"Doctor Dolittle\" gets off to a clunky start with Anthony Newley telling of Dolittle's beginnings...and the film goes into stillborn flashback mode. I get defensive if a movie foists a flashback on me in the first 15 minutes (and this flashback is a long one, laden with silly slapstick). Why not start the story with Dolittle finding his voice, cut the introduction with Newley, and then get on with the plot? After this tiresome, talky opening, the pacing does pick up (right about the time Richard Attenborough enters as circus-owner Blossom). Harrison is on-target throughout but, story-wise, momentum doesn't build until the second hour, when Dolittle and his companions hit the South Seas in search of the Great Pink Sea Snail. Overall, the film simply LOOKS smashing, with marvelous locations in England's most beautiful city, Castle Combe. It is flawed (with that bad opening), but stick with it and see if you find Rex Harrison as charming as I did. **1/2 from ****",
         "If you don't appreciate wonderfully made movies that make people happy, go find a small island to keep away from the rest of the world. Once again, movies like this prove 'a well thought out and developed plot and storyline' makes the movie a success at its foundation. The 'allstar cast' is just the beautifying of the cake with icing. The writers seemed to realize that you can't always or do not have to force the plot lines to make a certain length of movie. They allowed the musical numbers to fill it up. On top of that, they didn't try to constrain the timeframe and edit out important details that allow a movie to flow. This is geared towards the family to make people feel good about anything and everything. Many writers these days are leaving films like this up to cartoon animators as cartoons seem to thought of hollywood as the \"Childrens' Medium\". This is a film that people of any age can feel good about and laugh together with. Dr. Dolittle brings imagination to life by speaking to animals in a more realistic way. He's studied them and learned from experience how they communicate. He then takes his intelligence, almost by force, out to the world to find rare and unique animals and help out the world with the help of nature. This tale is often inspiring to many children to take care of animals. For those that have grown may remember some of the tunes and find yourself singing along. The is truly a masterfully done marvel that any treasured classic video collection should have.",
         "Yes the movie has the world is a wonderful beautiful magical place feel, yes the premise is pretentious at best, yes, yes, yes, but I love it. I have bought it many times as a gift. I will continue to do so. Not only is this movie suitable for all the family even when the minister is in the room, but it is fun. The songs like Talk with the Animals and the song about the Pushme-Pullyou are sure to have your children singing and dancing, while other songs like Beautiful People (not the song by Melanie) will draw in even the most adult audience. This movies comes from a time when people hoped to be able to look to a future without the problems that plagued our past. To all the cynics out there, if you ever get tired of only looking at the bad side of life I strongly recommend this movie, it is food for the soul.",
         "Having grown up loving the music, storyline and animal interactions in the origional Doctor Dolittle, it was a jarring shock to watch the scatological-joke loaded remake. Doctor Dolittle is a wonderful clean family film, with plenty of adult jokes to keep the parents chuckling and visual slapstick to tickle the young ones' funnybones. The music is top rate with the Oscar winning \"Walk With the Animals\" leading the way as the good Doctor searches for the Great Pink Sea Snail, encountering a number of wacky adventures along the way. Doctor Dolittle would make a great companion to \"Chitty Chitty Bang Bang\" for an evening of old fashioned family entertainment. Suspend you disbelief for a few hours and watch this one with your kids and toss the remake in the garbage disposal."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "APJAC Productions",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Doctor Dolittle is a world-renowned veterinarian who speaks a wide array of animal languages. He sets off from his home in Puddleby-on-the-Marsh, England, in search of the Great Pink Sea Snail. In so doing, he and his friends meet such exotic creatures as the Pushme-Pullyu and the Giant Lunar Moth. This musical is the source of the hit song, \"If I Could Talk To The Animals.\"",
         "After the animal communicating veterinarian goes too far for his clientèle, he and his friends escape their hometown to sea in search of the Great Pink Sea Snail."
      ],
      "budget": 18000000
   },
   "movielensId": 2135,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-12-19",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Richard Fleischer"],
      "runtime": 152,
      "movieId": 2135,
      "title": "Doctor Dolittle",
      "mpaa": "G",
      "actors": [
         "Rex Harrison",
         "Samantha Eggar",
         "Richard Attenborough",
         "Anthony Newley",
         "Peter Bull",
         "Muriel Landers",
         "William Dix",
         "Geoffrey Holder",
         "Portia Nelson",
         "Norma Varden"
      ],
      "imdbMovieId": "0061584",
      "originalTitle": "Doctor Dolittle",
      "genres": [
         "Adventure",
         "Comedy",
         "Family",
         "Fantasy",
         "Music"
      ],
      "youtubeTrailerIds": ["VW_Jzub27_g"],
      "plotSummary": "Get ready for the wildest adventure of a lifetime in the most ambitious production ever brought to film. Earning a 1967 Academy Award nomination for Best Picture, this dazzling fantasy turns both ordinary and exotic animals into talking, dancing and singing sensations! Rex Harrison is unforgettable in this inspiring adaptation of Hugh Lofting's classic stories.Step into the English country home of the good doctor as he performs remarkable treatments on the wildest variety of patients you could imagine. Discover his secret cures and watch with wide-eyed excitement as he and his four-legged, fine-feathered friends charm their way into your heart!",
      "tmdbMovieId": 16081,
      "avgRating": 3.00328,
      "releaseYear": "1967",
      "numRatings": 2437,
      "posterPath": "/hsbUAyzgMtF7NC6pR2SEk0UgeNU.jpg"
   }
}