{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "professor",
            "id": 1992
         },
         {
            "name": "chemistry",
            "id": 6013
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "teacher",
            "id": 10508
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "potion",
            "id": 14752
         },
         {
            "name": "piano playing",
            "id": 159868
         }
      ],
      "imdb_id": "tt0057372",
      "video": false,
      "title": "The Nutty Professor",
      "recommendations": [
         15788,
         35188,
         24062,
         28333,
         81789,
         25431,
         18994,
         170578,
         368432,
         117897,
         116314,
         18257,
         115360,
         79359,
         132994,
         116696,
         103130,
         107673,
         143529,
         40044
      ],
      "backdrop_path": "/aR7vb41tAYxMGIwA70UISbUjlbN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Professor Julius Kelp / Buddy Love / Baby Kelp",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f15",
               "name": "Jerry Lewis",
               "profile_path": "/6RmgMdUxRPm2dZnTyRD4r0c6z3M.jpg",
               "id": 3663,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Stella Purdy",
               "gender": 1,
               "credit_id": "52fe47749251416c75099f19",
               "name": "Stella Stevens",
               "profile_path": "/hsNwoHrAe6ZWaBl4f62YiP2iJqo.jpg",
               "id": 7631,
               "order": 1
            },
            {
               "cast_id": 24,
               "character": "Gibson, College Student",
               "gender": 2,
               "credit_id": "584930ecc3a3681414012240",
               "name": "Henry Gibson",
               "profile_path": "/5dmU4muna3kpU2aFM4eU2Ij12Xn.jpg",
               "id": 19439,
               "order": 2
            },
            {
               "cast_id": 27,
               "character": "Man in Gym (uncredited)",
               "gender": 0,
               "credit_id": "58493146c3a3681414012288",
               "name": "Richard Kiel",
               "profile_path": "/wop4KV2ywl6gdYnCUs1OthtGylM.jpg",
               "id": 10460,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Hamius R. Warfield",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f23",
               "name": "Del Moore",
               "profile_path": "/5b3qVpThhy4nFzRTuUfEFW5QknK.jpg",
               "id": 113951,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Football Player",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f2b",
               "name": "Norman Alden",
               "profile_path": "/vdzvCDT4UtVctmo17OSpU8HVUxe.jpg",
               "id": 7139,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mr. Elmer Kelp",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f2f",
               "name": "Howard Morris",
               "profile_path": "/dYOSuyGJg5oOS31Ls8sNvvjogw2.jpg",
               "id": 27517,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Edwina Kelp",
               "gender": 1,
               "credit_id": "52fe47749251416c75099f33",
               "name": "Elvia Allman",
               "profile_path": "/nHTxHcykh8mjEUq2xv7ce2KIzx.jpg",
               "id": 1949,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. M. Sheppard Leevee",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f37",
               "name": "Milton Frome",
               "profile_path": "/snPMADelhKNuylScSIQpsGE3PV3.jpg",
               "id": 78776,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Rube",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f79",
               "name": "Doodles Weaver",
               "profile_path": "/zkgv07aQJA3XMnJ1ZjrGH28SFWp.jpg",
               "id": 89735,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Millie Lemmon",
               "gender": 1,
               "credit_id": "52fe47749251416c75099f75",
               "name": "Kathleen Freeman",
               "profile_path": "/wdNFoCWk58bgTRxoqPV8uN9UoGO.jpg",
               "id": 7210,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Gym Attendant (uncredited)",
               "gender": 2,
               "credit_id": "5849311e92514119bc0111ea",
               "name": "Murray Alper",
               "profile_path": "/gt2IIpoK6M8YVgmTrqV6A3dDz7j.jpg",
               "id": 14454,
               "order": 11
            },
            {
               "cast_id": 12,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe47749251416c75099f3b",
               "name": "Buddy Lester",
               "profile_path": null,
               "id": 152682,
               "order": 12
            },
            {
               "cast_id": 7,
               "character": "Football Player",
               "gender": 0,
               "credit_id": "52fe47749251416c75099f27",
               "name": "Med Flory",
               "profile_path": "/etO8uGlxHrV9oMRNxkzJ3Bt5fxF.jpg",
               "id": 19483,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Waitress (uncredited)",
               "gender": 0,
               "credit_id": "58493130c3a368142800ff4b",
               "name": "Stephanie Hill",
               "profile_path": null,
               "id": 1719634,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f1f",
               "name": "Jerry Lewis",
               "profile_path": "/6RmgMdUxRPm2dZnTyRD4r0c6z3M.jpg",
               "id": 3663,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f41",
               "name": "Jerry Lewis",
               "profile_path": "/6RmgMdUxRPm2dZnTyRD4r0c6z3M.jpg",
               "id": 3663,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f47",
               "name": "Bill Richmond",
               "profile_path": null,
               "id": 155376,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f4d",
               "name": "Ernest D. Glucksman",
               "profile_path": null,
               "id": 936699,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f53",
               "name": "Walter Scharf",
               "profile_path": null,
               "id": 3375,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f5f",
               "name": "John Woodcock",
               "profile_path": null,
               "id": 50976,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe47749251416c75099f65",
               "name": "Edward R. Morse",
               "profile_path": null,
               "id": 936700,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f6b",
               "name": "Hal Pereira",
               "profile_path": null,
               "id": 5188,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe47749251416c75099f71",
               "name": "Robert R. Benton",
               "profile_path": null,
               "id": 11083,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "59b59e3992514139730015ab",
               "name": "W. Wallace Kelley",
               "profile_path": null,
               "id": 111987,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.171015,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18331,
      "vote_count": 111,
      "budget": 0,
      "overview": "Jerry Lewis directed, co-wrote and starred in this riotously funny movie that set a new standard for screen comedy and inspired the hit remake. Lewis plays a timid, nearsighted chemistry teacher who discovers a magical potion that can transform him into a suave and handsome Romeo. The Jekyll and Hyde game works well enough until the concoction starts to wear off at the most embarrassing times.",
      "similar": [
         1259,
         10571,
         14055,
         52449,
         489,
         207,
         1903,
         13,
         38,
         272693,
         1643,
         14313,
         290762,
         24420,
         13523,
         27066,
         76726,
         62211,
         86331,
         72105
      ],
      "original_title": "The Nutty Professor",
      "runtime": 107,
      "poster_path": "/sqHQK1OhC3zZgJVpGhHt6AuRJfK.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Jerry Lewis Enterprises",
            "id": 22745,
            "origin_country": ""
         }
      ],
      "release_date": "1963-06-04",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "Well, any scientist who makes a girl like this can't be all mad.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jerry Lewis"],
      "runtime": 107,
      "synopsis": "After an ill advised comment to an athlete in his chemistry class, Professor Kelp (Jerry Lewis) decides he needs to become more manly. He finds himself falling for a beauty in his class and overuses this fountain of cool youthfulness formula he creates. If it wears off it's trouble. But now he has Stella Purdy's (Stella Stevens) attention and cannot bear to lose it. After her frustration increases over this egotistical rebel Buddy Love (Jerry Lewis), she tells Kelp her feelings. SPOILER WARNING. And just in time because Kelp's about to blow it big time by a mistake with the potion. Playing his first big venue, the gig is up for buddy Love. With the truth now evident, only Stella can find a way to take the Jekyll and Hyde relationship and create a better, complete relationship. She becomes the hero, creating a relationship with a now confident, dutiful man which the professor could not do with his previous schizophrenia. But what will become of the macho-man formula?",
      "writers": [
         "Jerry Lewis",
         "Bill Richmond"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057372/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjM4MzQzOTY4OV5BMl5BanBnXkFtZTcwNzQ3NTYyMQ@@._V1_SY317_CR24,0,214,317_AL_.jpg",
      "actors": ["Stars: Jerry Lewis, Stella Stevens, Del Moore | See full cast and crew »"],
      "reviews": [
         "On the Nutty Professor DVD extras, Jerry Lewis says that he had been \"enthralled with Jekyll and Hyde\" since he was a kid. So it's only logical that he'd long to create this \"Jekyll and Hyde comedy/musical\". Oddly, The Nutty Professor tends to be read as only a comedy, in the modern colloquial sense of that genre term, as \"a film that's supposed to make you laugh\", but there's much more to it than that, and more intended than that. Which is probably a good thing, because even though I didn't laugh out loud very frequently while watching The Nutty Professor, I did enjoy it quite a bit, despite the flaws. Lewis--who also directs--plays Professor Julius Kelp, a bizarrely nerdy-but-stupid chemistry professor. He has a knack for conducting dangerous, unauthorized experiments in the presence of students. At the beginning of the film, he blows up his classroom yet again. On a later day, a football student who was denied permission to leave class early for football practice responds by stuffing Kelp into a shelf. Beautiful student Stella Purdy (Stella Stevens) feels sorry for Kelp and helps him unstuff himself. Stevens skillfully has the slightest gleam in her eye while doing this so that we can tell that Purdy has an attraction to the strange-looking professor. Spurred on by the incident--with both the physical abuse and the physical attraction as motivators, Kelp decides to give himself a make over. He first tries his luck at the local gym. When that doesn't work out so well he puts his chemistry knowledge to use and hits upon a potion that produces a Jekyll & Hyde transformation. The Nutty Professor has Kelp trying to balance the two personalities, with the expected calamitous but humorous results. Although Lewis' Hyde character, \"Buddy Love\", is often said to be a skewering of his early comedy partner and pal Dean Martin, Lewis claims this wasn't the case. Both the nerd and the debonair but sublimely obnoxious hipster were supposedly amalgamations of different people Lewis had encountered over the years. Still, the similarities to Martin are difficult to deny; perhaps the character was partially a subconscious parody of Martin. In any event, Love is entertaining to watch--he's something like a glossy trainwreck. Or maybe like a suave Satan in a silk suit. Lewis makes both characters complex in their differences from their respective stereotypes. Kelp is the stereotypical \"absent-minded professor\", only the absent-minded professor is usually a wiz at his academic subject. Lewis paints Kelp as primarily a wiz at being a slightly sympathetic dork, where his cockeyed chemistry successes are more accidental. Love is the stereotypical overbearing but attractive-to-the-women brute, yet Lewis is quick to imbue him with an odd combination of pathos and flair, so that Love ends up being both more fragile and more talented/intelligent. Some of the material employing both characters is quite funny, but Lewis dwells on humor no more than a whole gamut of modes and emotions, from fairly serious horror material during the slightly overlong initial Jekyll/Hyde transformation to poignantly sad, touching scenes showing the crack in the Love armor. To an extent, the Jekyll/Hyde theme permeates the film in its shifting tones. One of those modes that works surprisingly well is the musical material. Lewis hired the superb Les Brown and other great jazz musicians to provide songs. Les Brown's \"Band of Renown\" even makes an on screen appearance, performing a couple songs at a college dance. Lewis isn't the greatest singer, but he does a passable job with an alluring rendition of \"That Old Black Magic\". There's also a great version of \"Stella by Starlight\" in the background of a couple scenes. The performances are quite good. Both Stevens and Del Moore, as Dr. Hamius R. Warfield, the college dean, easily hold their own next to Lewis, who does a remarkable job with the transformations. He's helped a lot by W. Wallace Kelley's cinematography. Kelley had a more than respectable, varied background, including camera experience on a couple Alfred Hitchcock films--To Catch A Thief (1955) and Vertigo (1958)--and Cecil B. DeMille's The Ten Commandments (1956). Kelley uses very subtle angle changes to make Kelp seem small and insignificant (aided by Lewis' physical contortions) while making Love seem like a big, macho guy. The production design is also gorgeous. Lewis directs his crew to fill the film with bold, unusual color combinations--most overtly in the rainbow-colored paints on the lab floor during the first Jekyll/Hyde transformation, the nice overlaying of purples and reds in The Purple Pit club, and the great, unusual coordinations of Love's suits. Whether you find The Nutty Professor hilarious or not, it has certainly been influential. Lewis considers this his best film. The American Film Institute placed The Nutty Professor at number ninety-nine on its list of the \"100 Funniest American Films\" (\"100 Years/100 Laughs\"). Both Adam Sandler and Jim Carrey have obviously been influenced by this film, as they have been by Lewis in general. And Andy Kaufman's disparate characters Latka Gravas (from 1978-1983's \"Taxi\") and Tony Clifton (a regular part of his live act) are direct parallels to Kelp and Love, even if Kaufman had other influences for those characters, as well. The Nutty Professor is also a \"message\" film. The dual \"morals\" of the story, in addition to the less conspicuous subtexts dealing with personal identity, are to not be afraid to be your true self and to accept others for their true selves--to look deeper than the surface level. Given such wide-ranging moods and aims, it's probably best to watch the film without genre expectations. That's not likely to make those averse to Lewis' shtick enjoy it any more, but for everyone else, The Nutty Professor is worth a look. It will surprise you with its diversity.",
         "One of the most depressing symptoms of the phenomenon of \"dumbing down\" is the drastically diminished time-frame of people's imagination and empathy, which function well enough microscopically and telescopically (at a range of, say, two or three hundred years, or the day before yesterday), but which cannot make the small leap back thirty or forty years. It is surely on such grounds that Jerry Lewis's masterpiece, \"The Nutty Professor\", might be dismissed as \"dated\" or be found \"unfunny\". Ever since I saw this movie as a child back in the late 60s it has haunted my imagination, and taken on a mythic existence that floats free of its actual content and context. On recently viewing it again on a borrowed videocassette I was startled by the internal organisation of the movie, by its pacing, and by the fact that Kelp's odious alter-ego, Buddy Love, who dominates the movie conceptually, is actually on screen for so little of its longish running-time. Since childhood I had cherished Buddy Love for his wit, glamour and self-assurance, which contrast so strongly (and therapeutically) with the painful gaucheness of Julius Kelp. Only now, as a mature adult, do I fully appreciate just how fundamentally unlikeable he is. It is interesting to note that his allure works better at a distance: idolised by the hipster habitues of the Purple Pit, he is viewed with deep suspicion by Stella Purdy, even as he fascinates and intrigues her. \"The Nutty Professor\" is as firmly located in its milieu (the United States of the early 60s) as \"War And Peace\" is in its (Tsarist Russia at the time of the Napoleonic Wars); therefore, talk of \"datedness\" is beside the point. As an exact picture of life in 2001 the film is hopeless, but as a myth or parable, with Kelp, Buddy Love, Stella, et al., as archetypes, its power is undiminished. Jerry Lewis has never been happy playing it straight, and Buddy Love is as extreme and grotesque in his way as the hapless Kelp. He is also by no means entirely free of Kelp's flaws; his clumsiness during the slow dance with Stella shows how aspects of Kelp's personality continue to permeate his, and point to the incompleteness and volatility of the metamorphosis. Even his name, opportunistically extemporised for Stella's benefit, contains a deep irony, since, in spite of his superficial popularity and supreme sexual confidence, he is essentially friendless and incapable of deep feeling. If kindly Kelp is crippled by involuted intelligence, the sybaritic, self-seeking Buddy Love is stunted by affectlessness. (I am puzzled by the IMDb reviewer who found him insufficiently monstrous.) Buddy Love's glittering lounge suits emit a satanic glow, and Jennifer, the caged mynah-bird, is a kind of familiar to Kelp, whose Faustian alchemy effects his painfully achieved and all-too-brief transformations into this eerie nightclub singer who generally only appears after nightfall (his one diurnal appearance being a spectacularly successful bid to persuade the otherwise pompous college Principal to sanction his headlining performance at the Senior Prom). In view of their acrimonious split it is tempting to view the Buddy Love persona as an acerbic commentary on Lewis's erstwhile partner Dean Martin, but the character also contains generous helpings of Frank Sinatra, and is perhaps best seen as a broad swipe at the Rat Pack. The wider message of the film is that kindness and intelligence (which Kelp already possesses) are far more important than the kind of shallow and flashy qualities that invest Buddy Love with his powerful but limited appeal (the rapid wearing-off of Kelp's formula, whose ingestion is attended by such agonising side-effects, shows that such a persona is literally unsustainable for any length of time). Kelp's final speech at the Prom, when his appearance as Buddy Love has been cut catastrophically short, is indeed \"heart-wrenching\", but as both a summing-up of the main themes of the movie and a token of Kelp's increased self-knowledge, it is indispensable. This brilliant and disturbing film uses comedy as a vehicle to explore serious questions about the nature of identity. The Kelp who wins Stella's love is a better-integrated personality than either his earlier self or the grotesque alter-ego of Buddy Love, but a note of mild cynicism (defusing any hint of sentimentality in Kelp's Prom speech) is sounded when Stella pockets two phials of the formula put on sale by Kelp's formerly timid father (to whom he had entrusted it). (He had also entrusted it, of course, to his domineering mother, but it is perhaps significant to observe that the formula presumably only works with men.)",
         "This is by far the best of the Jerry Lewis (sans Martin) films. The Jekyll & Hyde storyline is the perfect outlet for Jerry Lewis' \"physical comedy\" genius. I bet the \"French\" were inspired by this performance, when they named Jerry Lewis their comedy idol. As a clumsy, yet lovable chemistry professor, the title character could hardly be considered a \"babe magnet\". When he discovers a magic potion that turns the nerd into \"Buddy Love\", his luck with the ladies appears to change. In the end, he learns that appearance is less important than character. A young Stella Stevens is effective as the grad-student love interest. This original \"Nutty Professor\" is heartwarming and funny without offensive language and double-meaning visuals. It is far superior to its 1990s Eddie Murphy remake. Especially for a juvenile audience, Lewis beats Murphy by a mile!",
         "The original Jerry Lewis version of this movie is still the best one ever. Irregardless of the special effects employed in the Eddie Murphy version, or the novelty of him playing multiple characters at the same time, the original has something the copycat doesn't - Jerry Lewis, still one of the best comedians on the planet. Lewis doesn't need the power of special effects or multiple roles to fully convey the story here. How he transforms from a nerdy professor to a suave and sweet-talking singing/dancing/kissing Romeo is a sight to behold. He employs acting techiques which manage to convince us that these are 2 distinct people with distinct personalities and characters. No one can top Lewis in his prime, and this is one of better movies.",
         "i enjoy watching jerry lewis's movies and this one is an all-time classic! the story is out of the ordinary and that's what makes it fun and enjoyable. it's very interesting to watch jerry's cute mannerisms such as:running his tongue over his teeth, stuttering [especially towards stella]and that memorable voice. i find the proffesor kelp character much more appealing then buddy love. b.l. can get on one's nerves with his smooth fonzie/gangster attitude. one of the best scenes in the movie was when j.l. sings \"that old black magic\". stella stevens portrays stella very well but how could a student/teacher marriage be looked upon? a must see and definetly a classic!",
         "Further to my earlier review, I would wholeheartedly endorse the opinion of other reviewers that the original Lewis movie is superior - vastly superior - to the crass Eddie Murphy re-make. Lewis's subtle points about Buddy Love (whom, I am unsurprised to learn, he loathed) are utterly lost in the Murphy version. If Lewis's movie fails as popular entertainment, it is because it makes extraordinary intellectual demands on its audience, requiring them to see beyond the surface glamour of Buddy Love to the moral rottenness and egotism within. Strangely enough, however, Buddy Love is not without pathos. There is enough of Kelp in him, together with the shakiness of his chemically-induced persona, to lend a faint suggestion of vulnerability. Perhaps even this is part of his satanic charm (he literally charms the pants off the college Principal). It is no coincidence that his calling-card number is \"That Old Black Magic\"!",
         "My one line summary just about say it all. The remake did well due to the advancement of special effects, stage make-up and prosthetics. This film did not have that luxury. Jerry Lewis is fabulous as the gawky, quirky Professor. Both his natural comic acting talents and his natural straight acting talents shine through. When seen one after the other (i.e the remake and then the original or vice-versa) you can do nothing but agree with me that the original is the far superior film of the two. Eddie Murphy does his best with the remake and the sequel but the remake just doesn't have the class that the original has. Now I know that there are going to be those that say the remake must be better because there was no sequel to the original but lets be honest now, in todays day and age and as things currently are in the film world's state of affairs, if a film is (in the executive's and the board of director's eyes)successful enough, a sequel is always churned out. Back in the sixties when the original was made this very rarely happened if it happened at all. Those same people will also say that the remake made more money but that's because there are FAR more cinemas around now and it's effectively cheaper to go now even with a semi-bankable actor like Eddie Murphy. (A bankable name, for those that don't know, is a name that guarantees the film being successful regardless of weather or not they can act. Will Smith has somehow become a bankable name and he has less ability to act than Pavarotti does to tap dance. The list of people like that is too big to put them all in and quite frankly I don't want to spend the time doing so. The same thing regarding the names that can act but an example of one that can is George Clooney.). At the time when the original was made Jerry Lewis was the biggest box office draw of them all; I don't think that has ever been able to be said of Eddie Murphy. It's because of this that when you take into account how much money was taken on the original due to how many were able to see it and how many went to see the remake you will realise that the original comparatively took more and was therefore a better, no, not better, far superior film.",
         "THE NUTTY PROFESSOR (1963) **** Jerry Lewis, Stella Stevens, Del Moore, Kathleen Freeman, Howard Morris. Jerry Lewis' comic masterpiece (which he also directed) adapts the Jekyll-Hyde story to tailor form-fitting to his loose frenetic talents and comes up with two memorable characters: feeble social outcast chemistry professor Dr. Julius Kelp all chipmunk-toothed geekiness and bad hair becomes lounge lizard, charming bully Buddy Love (some say he was inspired by Dean Martin, which Lewis steadfastedly denied). Funny, touching and out-there! Groovy, man, groovy!",
         "Easily Jerry's best film without Dean. After all these years it still holds up well. The Eddie Murphy remake was fine but this one did it without special effects. Favorite scene is the flashback of The Professors early life. His mother rules his milqtoast dad with an iron hand and in the background can be seen a toddler in a playpen who looks a little goofy. The close up reveals Jerry in baby PJ's. Then there is the legendary Alaskan Polar Bear Heater!",
         "Let me get this off my chest first: I am not a Jerry Lewis fan. I've always found his comedic antics tiresome and stupid, and his telethons for Muscular Dystrophy are nothing but daylong snooze fests. But, at one point in his career, he was able to bring it all together and create one of the great comedy films of all time, \"The Nutty Professor\". A comedic take on the familiar Jekyll and Hyde tale, it's the story of über-nerd Professor Julius Kelp (played by Lewis) and his search for love and a better self-image thru chemistry\u0085which results in him changing into a creosote-haired, obnoxious, hard drinking, sexually voracious yet musically talented Rat Pack swinger named Buddy Love (also played by Lewis). While Professor Kelp loves his student Stella Purdy (played by Stella Stevens) from afar, Buddy has absolutely no problem sweeping her off her reluctant feet \u0096 until, that is, Kelp's formula starts wearing off and Buddy's tenor singing voice suddenly starts squeaking like the Professor's nasal twang! It all comes to a head at the senior prom where all the kids want to swing to Buddy's music but the formula wears off and Buddy/Julius (in a touching and almost-profound moment) has to face the reality of what he's done and that you'd better love yourself because you're stuck with you for your whole life. But Lewis shows that he could also direct, and pretty well at that. From the opening shot of test tubes boiling away with candy-colored chemicals, this has to be one of the most colorful movies ever made \u0096 just look at the deep purples of the lettermen sweaters or the entire décor of the Purple Pit or the violent primary splashes during the first transformation scene or Buddy's suits \u0096 especially his suits! Lewis has always denied that Buddy Love was based on his old partner Dean Martin but it's pretty obvious that Dino and Frank Sinatra (the hard drinking, arrogant, and supremely confident King of the Rat Pack) are the prime models for Buddy Love. But it's also interesting to see how traits from one character show up unexpectedly in the other, like when Julius proclaims during class that hydrogen \"is a total gas\" or when Buddy sings \"That Ole Black Magic\" and his voice keeps slipping into Julius'. And there's all sorts of other touches, like Buddy's intro into the movie: after Julius drinks the formula, writhes all over a chemical-splattered floor and transforms into a hairy Beatlesesque gray monster, the next scene shows the shocked reactions of people on the street as the \"monster\" walks from the University to the Purple Pit where the camera pulls a 360° turn and we see\u0085Buddy Love in full swinger regalia ordering a drink called an Alaskan Polar Bear Heater that's got to be the most lethal combo I've ever seen served anywhere! This is the movie that shows why the French think this guy was a comedy genius - his particular brand of physical comedy is not only timeless but also totally independent of language. When you see Julius bopping to Les Brown's band at the prom, it doesn't matter if you're sitting in a movie theater in San Francisco, Paris, Timbuktu, or Outer Slobodia, it's damn funny stuff even if you don't understand a word of what he's saying. A truly funny movie that's perfect for the whole family."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Jerry Lewis Enterprises"
      ],
      "summaries": [
         "Nerd. Milquetoast. Klutz. These are just three of the many undesirable words that can be used to describe Professor Julius Kelp. But all that changes when the chemistry expert invents a potion that transforms him into a suave, sexy chick magnet, whom Julius aptly names Buddy Love. Unfortunately, there's one side effect: Buddy can't control when he'll change back into Julius, an event that always happens at inopportune times. How will Julius/Buddy resolve his Jekyll-and-Hyde dilemma?",
         "Julius Kelp is a nerdy and not very handsome chemistry professor at small college. The mild mannered Kelp has been bullied all of his life and is now pushed around by his students, especially the football players. One of his students, the pretty Stella Purdy, encourages him to stand up to them but his approach is to develop a chemical solution that will turn him into a different man. What he develops turns him into Buddy Love, who Stella aptly describes as a rude and discourteous egomaniac. One thing he can't control however is when he turns back into Kelp, something that puts his secret in danger of becoming public.",
         "Julius Kelp is an ugly chemistry teacher with no personal life. One day he creates something incredible! An elixir that transforms him into a totally different man, Buddy Love. He is very successful with women, and one of his students (Stella Purdy) falls in love with him. Of course nobody knows that this charming, cool guy is in fact Julius Kelp. Everyone is very excited with Buddy, but there is a problem. The elixir's effect doesn't last very long...",
         "To improve his social life, a nerdish professor drinks a potion that temporarily turns him into the handsome, but obnoxious, Buddy Love."
      ],
      "budget": 0
   },
   "movielensId": 2136,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1963-06-04",
      "dvdReleaseDate": "2004-10-12",
      "directors": ["Jerry Lewis"],
      "runtime": 107,
      "movieId": 2136,
      "title": "The Nutty Professor",
      "mpaa": "NR",
      "actors": [
         "Jerry Lewis",
         "Stella Stevens",
         "Henry Gibson",
         "Richard Kiel",
         "Del Moore",
         "Norman Alden",
         "Howard Morris",
         "Elvia Allman",
         "Milton Frome",
         "Doodles Weaver",
         "Kathleen Freeman",
         "Murray Alper",
         "Buddy Lester",
         "Med Flory",
         "Stephanie Hill"
      ],
      "imdbMovieId": "0057372",
      "originalTitle": "The Nutty Professor",
      "genres": [
         "Comedy",
         "Family",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "1DUkGjWVOlc",
         "fjcFqdTc0Bk"
      ],
      "plotSummary": "Jerry Lewis directed, co-wrote and starred in this riotously funny movie that set a new standard for screen comedy and inspired the hit remake. Lewis plays a timid, nearsighted chemistry teacher who discovers a magical potion that can transform him into a suave and handsome Romeo. The Jekyll and Hyde game works well enough until the concoction starts to wear off at the most embarrassing times.",
      "tmdbMovieId": 18331,
      "avgRating": 2.81757,
      "releaseYear": "1963",
      "numRatings": 3426,
      "posterPath": "/sqHQK1OhC3zZgJVpGhHt6AuRJfK.jpg"
   }
}