{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "animation",
            "id": 10336
         },
         {
            "name": "seagull",
            "id": 10430
         },
         {
            "name": "trap",
            "id": 11060
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "rabbit",
            "id": 15199
         },
         {
            "name": "runt",
            "id": 158324
         },
         {
            "name": "river crossing",
            "id": 158328
         },
         {
            "name": "adult animation",
            "id": 161919
         },
         {
            "name": "journey",
            "id": 189092
         }
      ],
      "imdb_id": "tt0078480",
      "video": false,
      "title": "Watership Down",
      "recommendations": [
         30060,
         10857,
         11704,
         36819,
         11879,
         8983,
         10002,
         10692,
         11298,
         13155,
         3604,
         11850,
         9542,
         11639,
         13776,
         11591,
         10437,
         11234,
         10847,
         20465
      ],
      "backdrop_path": "/70dbXMaSl2mve998vUnNHs30VXa.jpg",
      "revenue": 3713768,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Hazel (voice)",
               "gender": 2,
               "credit_id": "52fe448f9251416c7503921d",
               "name": "John Hurt",
               "profile_path": "/rpuH2YRLpxJjMxHq4T1QdOSVtlN.jpg",
               "id": 5049,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Fiver (voice)",
               "gender": 2,
               "credit_id": "52fe448f9251416c75039221",
               "name": "Richard Briers",
               "profile_path": "/cdOxeResI28YXe912GbQKKvbKv8.jpg",
               "id": 29859,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bigwig (voice)",
               "gender": 2,
               "credit_id": "52fe448f9251416c75039225",
               "name": "Michael Graham Cox",
               "profile_path": null,
               "id": 16380,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Captain Holly",
               "gender": 2,
               "credit_id": "52fe448f9251416c75039229",
               "name": "John Bennett",
               "profile_path": "/arSkPpoGcRyqSdx4iAE9DtBc2Z8.jpg",
               "id": 47547,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Blackberry",
               "gender": 2,
               "credit_id": "54436c490e0a26633a0043f5",
               "name": "Simon Cadell",
               "profile_path": null,
               "id": 175910,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Chief Rabbit",
               "gender": 2,
               "credit_id": "53dff830c3a3686c5d002cef",
               "name": "Ralph Richardson",
               "profile_path": "/p9FyikB1ShTtq1cpMgkkhUrI9Bp.jpg",
               "id": 12689,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Silver",
               "gender": 2,
               "credit_id": "53dff902c3a3686c51002be9",
               "name": "Terence Rigby",
               "profile_path": "/cmg8qwt7Wo649ocgs2vxTPC2MnH.jpg",
               "id": 10748,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Pipkin",
               "gender": 2,
               "credit_id": "53dff911c3a3686c4d002d17",
               "name": "Roy Kinnear",
               "profile_path": "/vPG07Lh06DuUlpcd8evvJjAGq8k.jpg",
               "id": 3463,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Dandelion",
               "gender": 0,
               "credit_id": "53dff923c3a3686c56002bdf",
               "name": "Richard O'Callaghan",
               "profile_path": null,
               "id": 113697,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Cowslip",
               "gender": 2,
               "credit_id": "53dff92dc3a3683fc0000947",
               "name": "Denholm Elliott",
               "profile_path": "/oR6GnGecov6Mjg0cLasCawyz3mF.jpg",
               "id": 656,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Cat (voice)",
               "gender": 1,
               "credit_id": "5885eedb92514132230079e1",
               "name": "Lynn Farleigh",
               "profile_path": "/jgNFfyUz3a45vTSFvphJcz066hC.jpg",
               "id": 1220072,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Kehaar (voice)",
               "gender": 2,
               "credit_id": "5885eef1c3a3684d6300761c",
               "name": "Zero Mostel",
               "profile_path": "/3EexCCgqsUSj6ObFpZ75sXFCJLX.jpg",
               "id": 18861,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Frith (voice)",
               "gender": 2,
               "credit_id": "5885ef17925141321e007a02",
               "name": "Michael Hordern",
               "profile_path": "/jvy4gJc9cS1MJPgHJXefRUYGUYJ.jpg",
               "id": 39741,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Black Rabbit (voice)",
               "gender": 2,
               "credit_id": "5885ef25c3a3684d660080cc",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Capt. Campion (voice)",
               "gender": 0,
               "credit_id": "5885ef3b9251413227007abe",
               "name": "Nigel Hawthorne",
               "profile_path": "/jKG3trCa3RGE6h5yzjMOramfoed.jpg",
               "id": 15788,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c7503922f",
               "name": "Martin Rosen",
               "profile_path": null,
               "id": 70663,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c75039235",
               "name": "Richard Adams",
               "profile_path": null,
               "id": 70665,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe448f9251416c7503923b",
               "name": "Angela Morley",
               "profile_path": null,
               "id": 70667,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c75039241",
               "name": "Terry Rawlings",
               "profile_path": null,
               "id": 5056,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c75039247",
               "name": "Martin Rosen",
               "profile_path": null,
               "id": 70663,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448f9251416c7503924d",
               "name": "Martin Rosen",
               "profile_path": null,
               "id": 70663,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5aa9e7510e0a2664fb0056d4",
               "name": "Alan Simpson",
               "profile_path": null,
               "id": 214707,
               "department": "Visual Effects",
               "job": "Key Animation"
            },
            {
               "gender": 0,
               "credit_id": "5aa9e7649251410579005600",
               "name": "Colin White",
               "profile_path": null,
               "id": 1773132,
               "department": "Visual Effects",
               "job": "Animation"
            },
            {
               "gender": 0,
               "credit_id": "5aa9e7df92514105640051ca",
               "name": "Denis Ryan",
               "profile_path": null,
               "id": 1787771,
               "department": "Art",
               "job": "Background Designer"
            },
            {
               "gender": 0,
               "credit_id": "5aa9e7f3925141057900568a",
               "name": "Gary Sycamore",
               "profile_path": null,
               "id": 1773149,
               "department": "Art",
               "job": "Background Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 8.622136,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 11837,
      "vote_count": 218,
      "budget": 1000000,
      "overview": "When the warren belonging to a community of rabbits is threatened, a brave group led by Fiver, Bigwig, Blackberry and Hazel leave their homeland in a search of a safe new haven.",
      "similar": [
         769,
         4771,
         101299,
         281957,
         452507,
         8067,
         74997,
         133805,
         341006,
         434873,
         398181,
         10185,
         294963,
         562,
         588,
         379149,
         381288,
         12162,
         201085,
         180863
      ],
      "original_title": "Watership Down",
      "runtime": 88,
      "poster_path": "/879iEKkJMSXSbgqjs3tVOQceNUK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "AVCO Embassy Pictures",
            "id": 494,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nepenthe Productions",
            "id": 5016,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Watership Productions",
            "id": 47264,
            "origin_country": ""
         }
      ],
      "release_date": "1978-10-14",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "All the world will be your enemy, Prince with a Thousand Enemies, and when they catch you, they will kill you... but first they must catch you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Martin Rosen"],
      "runtime": 101,
      "synopsis": "Watership Down begins with a prologue, narrated by Michael Hordern, establishing the Lapine culture and mythology and describing the creation of the world and its animals by Lord Frith, the sun god. All the animals co-exist peacefully and eat grass together but the rabbits, led by Prince El-ahrairah, quickly multiply and overwhelm the other animals with their insatiable hunger. When Frith warns El-ahrairah to control his people, the prince scoffs at him, claiming that his are the strongest people in the land. In retaliation, Frith gives to each of the other animals a gift, turning them into predators, or 'elil' that hunt and feed on the rabbits. However, Frith also bestows upon the rabbits the gifts of speed and cunning, enabling them a fighting chance against their enemies. All creatures may seek to kill El-ahriarah and his descendants but, with their wits and quickness, the rabbits may survive. The film then transitions to realistic animation and brings us to the English countryside of Sandleford. Fiver ( Richard Briers), a young runt rabbit with prophetic abilities, foresees the end of his peaceful rabbit warren during an afternoon grazing, or 'silflay'. He exclaims to his older brother, Hazel ( John Hurt), that the field they live on is covered in blood, but Hazel acknowledges the image as a trickery of the sunset. Regardless, he agrees to take Fiver to the Chief Rabbit to see if they can have the warren evacuated. However, the Chief Rabbit ( Ralph Richardson) dismisses them, saying that leaving the warren in the height of the mating season is preposterous enough without it being based off a young rabbit's prophecy. Knowing that his brother's visions have always come to light in the past, Hazel helps Fiver gather any rabbits willing to leave the warren and they all sneak away during the night. They are briefly stopped by Captain Holly ( John Bennett) of the Owsla, the rabbit police force, but they manage to fight past him. As they leave the safety of the warren, they pass a sign clearly stating to us that the lands of their home is due for construction. In all, eight rabbits successfully defect: Fiver, Hazel, ex-Owsla officer Bigwig ( Michael Graham Cox), cunning Blackberry ( Simon Cadell), small Pipkin ( Roy Kinnear), storyteller and runner Dandelion ( Richard O'Callaghan), old Silver ( Terence Rigby), and the only female, Violet. They travel into the woods and through the night, encountering dangers such as owls and a large badger, or 'lendri'. Their curiosity is aroused when they stumble upon a road and Blackberry explains that 'hrududu' travel on it but have no interest in rabbits. He proves this by sitting still as one of them, a car, approaches and speeds on by. However, the threat of being killed by such wayward creatures is made apparent when Blackberry is nearly hit by another. A bean field provides some shelter and the rabbits are able to rest. Come morning, Fiver wakes to see Violet leave the safety of the plants to feed on grass and watches in horror as a hawk swoops down and takes her away. One less, they move along and come to a creek in time to hear that there's a dog loose in the woods. With the dog on their scent, and Fiver and Pipkin unable to swim, the larger rabbits use a plank of wood to float them across, swimming alongside. They find refuge that night within a crypt in an old cemetery but are set upon by a band of black rats which draws the attention of an owl. The rabbits escape. The following day they meet a friendly, but odd, rabbit named Cowslip ( Denholm Elliott) who offers them food and shelter at his warren. The group is grateful for the hospitality they receive and all but Fiver consider remaining at the warren permanently. He senses something terribly wrong and tries to warn the others of it but they refuse to listen. He leaves in a fit, followed by Bigwig who taunts him before suddenly being caught in a snare trap. Bigwig collapses and begins to choke as the others frantically try to dig out the post the snare is attached to. He coughs blood and appears to stop breathing just as the post is removed. The rabbits mourn their loss as Fiver admonishes them: the warren is given food and protection from a nearby farmer who occasionally snares the rabbits as retribution. After this revelation, Bigwig miraculously recovers and, on Fiver's advice, the band moves on with a newfound respect for the seer's wisdom. Eventually, the rabbits come to Nuthanger Farm where Hazel discovers the existence of a hutch of female rabbits. Knowing that does will be needed to start a new warren, but deterred by the farm's dog and cat, he promises a young doe named Clover ( Mary Maddox) that he will return. As the rabbits move alongside a field, they spot a fox, or 'homba', sniffing out their trail. Bigwig runs out to draw its attention away to the shelter of the woods nearby. The others hear a cry and think Bigwig has been caught but he soon returns and hurries them on, explaining that he ran into a couple of rabbits that tried to stop him despite his warning of the fox. It was presumably one of the rabbits that cried out when the fox caught up. The band continues onward until they find Captain Holly, badly injured and at the brink of death. He briefly recounts the destruction of the Sandleford warren as Fiver predicted, witnessing as the ground was upheaved and how he was forced to leave his fellow rabbits within their burrows to suffocate to death by noxious fumes. He mentions a warren called Efrafa before he collapses. Once rested, Fiver leads the group to the place he envisioned, a hill called Watership Down where the rabbits discover empty burrows suitable to live in beneath the shelter of a great tree. They all settle in with Hazel informally recognized as Chief Rabbit. One day, an acerbic seagull crash lands on the warren, his wing injured and leaving him unable to fly. Hazel, seeing the potential of using the gull's skills of flight, offers to help him despite the gull's stubborn pride. Kehaar ( Zero Mostel) is allowed to rest at the warren and, as Hazel hoped, notices with disdain the lack of female rabbits and 'chicks'. He berates the rabbits for not keeping a better warren but eagerly agrees to survey the area for females once his wing heals. When he manages to take flight, Hazel opts to return to Nuthanger Farm with two other rabbits to try and free the caged does. Hazel and Blackberry make it to the barn and start chewing away at the hinges to the doe's crate while Dandelion keeps watch. However, he inadvertently alerts the dog and farmer to their presence just as the crate door is broken open. The farmer wrangles up the does as the other rabbits try to escape. Hazel is hit by shotgun pellets as they flee and Blackberry and Dandelion are forced to leave him behind. They return to the warren to tell Fiver of his brother's demise, sentimentally stating that the Black Rabbit of Inle, 'death', does no more than his appointed task. However, seeing a vision of the Black Rabbit, Fiver claims his brother is not dead and follows the vision to an old pipe where a trail of blood leads to Hazel, his heart still beating. Kehaar returns to Watership Down and helps remove the buckshot pellets from Hazel's hindquarters, using his beak. He speaks of the Efrafa warren nearby which houses many rabbits. Holly pipes up and warns the other rabbits not to go there; it is a dangerous warren ruled tyrannically by a chief named General Woundwort ( Harry Andrews). It was Woundwort's Owsla that injured Holly and, were it not for the brave actions of a doe named Hyzenthlay ( Hannah Gordon) and the appearance of one of Frith's 'messengers' (a train that cuts down pursuing Owsla), he would never have escaped. Bigwig offers to infiltrate the warren. Arriving at Efrafa as a newcomer wishing to join, he impresses General Woundwort and is offered a familiar spot on the warren's Owsla as an officer with the option of choosing a female for himself. He meets with Hyzenthlay and tells her of his free warren. In time, they recruit other defectors including Blackavar, a rabbit severely maimed for his many escape attempts. After meeting with Kehaar and relaying his plans to leave that very night, Bigwig is confronted by General Woundwort who overheard Kehaar's loud calls. Bigwig manages to convince him that their talk was of no concern, though Woundwort remains suspicious. That night, as a thunderstorm approaches, Bigwig takes his band of Efrafans and escapes. However, the ever-vigilant Efrafan Owsla gives chase, led by General Woundwort. A timed attack by Kehaar keeps the General at bay while the rabbits make way for the river. Echoing their earlier use of driftwood, the rabbits leap into a small boat and break off the moor just as the Owsla arrive at the banks. Bigwig and the other defectors safely drift downstream and make their way to Watership Down. However, several days later, their trail is picked up again by Efrafan trackers and General Woundwort vows vengeance on Bigwig. As an unknown to Woundwort, Hazel approaches the Efrafans to negotiate. He offers an alliance of free and independent warrens living peacefully together, but Woundwort casts his intrigue aside and dismisses Hazel, ordering him to tell Bigwig to surrender the defectors. Hazel returns to his warren and instructs all the rabbits to hole up inside their burrows and block the entrances as the Efrafans begin their assault. Panic-stricken, Fiver falls into a trance, moaning as he envisions a 'dog loose in the woods'. His sounds briefly scare the Efrafans and inspires Hazel to a plan. He brings with him the fastest runners; Hyzenthlay, Blackberry, and Dandelion, and they escape the warren. Woundwort orders his Owsla to ignore them, intent on finding Bigwig whom he believes to be the chief rabbit. On their way, Hazel prays to Frith and offers his life in return for the safety of the warren, but Frith replies that it is a bargain he cannot honor. Along the way, he positions each of the rabbits at different intervals until he and Dandelion arrive at Nuthanger Farm. Dandelion exclaims that, if they succeed, theirs will be the greatest story ever told. Hazel assures him that he will be the one to tell it as he makes his way towards the farmer's dog, sleeping in its dog house. Hazel chews away at the dog's leash as Dandelion draws its attention. The dog chases after Dandelion as Hazel is pounced upon by the farmer's cat ( Lynn Farleigh). However, the farmer's daughter, Lucy ( Michelle Price), orders her cat to let the rabbit alone and Hazel is freed. The dog, meanwhile, is led by the rabbits in relay fashion back to Watership Down as General Woundwort makes his way inside the burrows, fiercely killing Blackavar. In a last ditch effort to protect the warren, Bigwig burys himself beneath the dirt of one of the tunnels and, as Woundwort approaches, lunges out in surprise and attacks him. The rabbits ferociously bite and scratch at each other until they are both bloodied. Woundwort asks why Bigwig won't simply surrender and Bigwig responds that his chief ordered him to protect the warren. Woundwort hesitates, surprised that Bigwig is not chief and imagines that he now has a larger rabbit to reckon with. At that moment, the dog arrives at the warren and begins tearing the Efrafan Owsla apart. They all scream and scatter as Woundwort emerges out of the warren and curses them for their cowardness, claiming that dogs aren't dangerous. He then sees the dog come out from behind the tree, dropping a dead Efrafan from its mouth before it charges towards him. Woundwort fearlessly leaps to confront the dog and it is said that, after this encounter, his body was never found and he wasn't heard from again. His legacy lives on as a story that does tell to their kittens as a way to keep them obedient; that if they misbehave, General Woundwort will get them. In epilogue, an elderly Hazel attempts to silflay when he is visited by a shadowy phantom, revealed as Prince El-ahrairah in the form of the Black Rabbit of Inle. El-ahrairah suggests that Hazel has been feeling tired of late and offers him a place on his Owsla. When Hazel looks back warily on his family at the warren, El-ahrairah assures him that they, and future generations, will be safe. Reassured, Hazel lays down in the grass and peacefully passes away. His spirit leaves his body and follows El-ahrairah through the woodland and into the afterlife \"All the world will be your enemy, Prince with a Thousand Enemies. And whenever they catch you, they will kill you. But first, they must catch you; digger, listener, runner, prince with the swift warning. Be cunning and full of tricks, and your people will never be destroyed.\"",
      "writers": [
         "Richard Adams",
         "Martin Rosen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078480/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNTAyMTQ3Ml5BMl5BanBnXkFtZTYwODI0MzI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Hurt, Richard Briers, Ralph Richardson | See full cast and crew »"],
      "reviews": [
         "I saw this film initially when I was about six or seven years old and have seen it several times since. Of all the films I saw during my early childhood, none captivated me as much as Watership Down. I am now twenty eight years old and, despite the violence and sadness of the film, I have somehow turned out to be a fairly normal bloke rather than a murderer or manic depressive. Funny that. It is a complete fallacy to suggest that we must shield our children from anything that hints of the injustices that may exist in the real world. In fact, seeing a film such as this may help them in dealing with issues in their own lives or perhaps teach them lessons in understanding and appreciation of the world around them. Watership Down had that effect on me.",
         "I would never spoil the wonder that is \"Watership Down\". The book and the film are timeless classics. I think it is the greatest adaptation of a novel (any genre) ever made and one of the most under-rated movies of all-time. They managed to capture more of a long novel (nearly 500 fantastic pages) than most films can compile from a 200 page source work. The soundtrack is beautiful (I'll be getting one for a Christmas present--thanx for the info IMDb!!) and matches the mood of the scenes perfectly. Viewers will recognize someone they know in nearly every rabbit and, with unbiased observation, probably see themselves. It is at once gripping and gentle, heart-rending and endearing. You will find yourself humming the tunes incessantly for months afterward. I recommend reading the book first (also try \"Traveler\" by Adams, another classic), then purchasing the film, then the soundtrack--wait, better yet, write your Congressman and demand a DVD release. I long for another wide-screen viewing (hint, hint)! I have noticed multiple comments that state the movie is too violent for children (it is somewhat graphic--to it's credit). For very small children, I would whole-heartedly agree, however, I think it depends on the individual. I was lucky enough to have a Father who took me to see it at the theatre when I was a youngster (about 5) and it did not scar me or give me nightmares--rather I learned the importance of the symbiotic circle of existence and the reality and necessity of life and death. It is still a comfort to me in times of sadness. In addition, the movie is highly layered and something new can be gleaned with nearly every viewing. I enjoyed it for years and only later realized many people had never even heard of it...I take every opportunity to recommend it and not once, not once, have I heard anything but thanks for the suggestion. Most of them end up owning the film. Both symbolic and blunt, \"Watership Down\" is a triumph of emotional proportions and is exemplary of what adaptations, animation, scoring and good film-making should be about. This wonderful adventure is an asset to any collection...10/10.",
         "British animated film about a bunch of rabbits leaving their old warren (which one psychic rabbit can tell is going to be destroyed) and searching for a new one. The movie recounts their adventures searching for one. It may sound like a movie ideal for little kids--but it really isn't. It's an excellent adaptation of Richard Adams book which was written more for teenagers and adults. It's an ecological tale of how men are destroying the earth and (inadvertently it seems) killing innocent wildlife. It's also a very interesting story about how a group of rabbits survive on their own. The animation is excellent--right up there with Walt Disney. The score is great, the script intelligent and the voices used perfectly match the characters. However, as I said, this isn't really for little kids. The story is dead serious and the only humor is provided by the bird Kehaar (who I personally found very annoying although Zero Mostel DOES have fun with the voice). Also, at the end, it gets very violent and quite bloody. When I saw it in a theatre in 1978 one small kid was in tears by the conclusion. So, use your own judgment but I would never let a small kid see this. This is perfect for teenagers and adults. A 10.",
         "I had absolutely no knowledge of WATERSHIP DOWN was going to be about except that it featured rabbits in some capacity . I had an inkling it was going to be some patronising , juvenile crap that anyone above the age of seven would find nauseating . It says something about the quality of television on the run up to Christmas when a bitter and twisted 39 year old man sits down to watch a feature length about talking rabbits - Talking rabbits ! OMG , it's not like the author Richard Adams meant the story to be some drug metaphor is it ? OMG talking rabbits just how pathetic is that ? And the one thing that I remembered on its initial release - And which I'm still trying to forget to this very day - is that gawd awful song by the guy with the worst hairstyle in the history of pop music . You know the song .... \" bright eyes burning like fire \" . Bad enough I saw BARNEY'S BIG ADVENTURE the previous day . Now I was going to be watching equally childish sentimental crap with talking rabbits Oh hold on . I've just seen WATERSHIP DOWN this very minute . Can everyone reading this review please ignore erroneous phrases like \" Childish pathetic crap \" because this is not how the story plays out . I do confess that perhaps the original story has perhaps been slightly flawed in the adaption with the hierarchy of the original warren somewhat unexplained ( For example why is it treason to leave the warren and search for a new one ? ) but that is my one and only criticism of this superb animated adventure which can be enjoyed by anyone of any age In a nut shell WATERSHIP DOWN resembles one of those post apocalypse dramas by John Wyndham or more especially John Christopher except instead of humans it features rabbits that talk . No seriously forget all about the characters being humanized bunnies , this is a dark dramatic adventure where survivors of an eco-disaster try and find sanctuary in a bleak , desolate and dangerous world . As crazy as it sounds some people have picked up on the coincidence that the plot resembles 28 DAYS LATER and one can't help thinking that it's a little bit stronger than coincidence . If you've seen one you can't noticing the quite striking similarities between the two especially the climax . Of course it could be that the original novel of WATERSHIP DOWN was influenced by Conrad's HEART OF DARKNESS which seems to have influenced much of Alex Garland's work but even so A thoroughly enthralling adventure that may have children weeping at the sad bits will certainly keep adults interested as they try and spot analogies . Let me repeat once again that while there's sad scenes there is nothing sickeningly sentimental and is a shockingly sophisticated tale . I certainly rate as being one of the greatest British productions of the 1970s",
         "I am twelve years old and I personally loved it. It is one of the most touching films I have seen. All to do with these rabbits hardships. Some of it made me laugh whilst other bits made me cry, but thats just me. It is very good and also makes you think about what could be happening in real life. My dad used to take me shooting rabbits, but after Watership Down I never went again. The graphics may not be as high quality as some of the newest releases but don't let that put you off. It is a remarkable film and I loved it. Don't think that older films are no good because Watership Down is AMAZING! I think if you are under the age of eight then you might not like it due to some violence and gore, but eight plus with love it. Even adults will enjoy it.",
         "'Watership Down' is quite simply my favourite animated film of all time. The vocal talent, animation style (both in the main story and in the mythical opening), soundtrack and script all work wonderfully, shortening the material of the book but not losing all of its themes. Efrafa was exactly as I imagined it would be from reading the book, Woundwort being suitably scary and unhinged. Obviously the violence and horrific imagery has been toned down to make the film more accesible to a young audience (at 8 I wore out TWO copies of the film on VHS!!!) but not so much that the film becomes cutesy. Far from it. These are not fluffy bunnies in the vein of Thumper, they are real. They get hurt (Bigwig nearly is killed in a snare, Hazel is shot, Captain Holly arrives nearly dead), they fight, they flee from domestic dogs, cat, from humans with guns. There is blood and violence, the film does not shy away from that...Blackavar's torn ears are as wince-inducing to me now as they were to me when I first saw the film 10 years ago. What does surprise me now though is that the film is rated U (universal, suitable for all) here in the UK. Not only is there some mild swearing, the level of violence and the visual horror (Fivel seeing the field covered in blood, Holly's description of the warren blocked with dead bodies) is surely at least PG? Hmmm.... To conclude it can be said that watching films from your childhood is often a bad move....they are usually best left in the memory. The same can not be said of Watership Down. Simply brilliant!",
         "The first great animated film to come around in the entire history of motion pictures! It's not only original(shying away from the traditional \"Disney\" formula), but it's the first animated film to ponder the meaning of life itself! I was really moved by it! With \"Disney\" films, you know what to expect. This was like watching a Terrence Malick film; beautiful, subtle, spiritual, and important for our lives. The only difference is that it's animated with \"cute & cuddly\" cartoon characters. This is a film both adults and children alike will enjoy and learn from, because it is a social commentary on facism, and it is a spiritual film. It's spirituality lies in it's initial message, which is about facing death, and avoiding it as well. Not that you can avoid death, but that you can have a sense of self preservation, purpose, and a place in life. The most inspirational line of the movie is \"All the world will be your enemy. And when they catch you, they will kill you. But first they have to catch you.\". All of your life, you will continue to meet people who like you, and those that will attack you. Be strong, stand tall, \"and your people will never be destroyed.\". That is basically, in a few words, what the world and the meaning of life is really all about!",
         "If I had had this video when I was 8 or 9, I think I would have watched it as much as or more than I watched any other video that I had at the time. It's quite an extraordinary film. I'm 21 now, and I found it very exciting and involving throughout. The only problem is that it always seems like the episodes in the film happen a bit too quick, making it pretty obvious that it was adapted from a much longer novel. Episodes that seem very important only last for three minutes or so. And they never did free the rabbits in the pen at the farmhouse. Still, it's a great movie. While not for the very young children (there is a bit of violence and gore), I think any kid 8 or above would really love this film. Learn that you don't have to just buy videos of recent films for children. Some of the older films are much better. 9/10.",
         "While not as good as the book itself, the movie was well done indeed. This was one of those books I lived in when I first read it, never has Richard Adams come close to what he achieved here, able to pull you the reader right down into the grass roots along with Hazel, Fiver and BigWig. And the animators did him justice...I don't have much to add here that others here haven't, save to say I enjoyed the classic voices used here a lot-from Joss Ackland as the 'Black Rabbit of Inle' to the late, much lamented Harry Andrews as Woundwort. Now THAT guy was as tough and ornery a character actor as ever I saw onscreen, and he did the brutal Woundwort character justice indeed. Of course I recommend this-***1/2 outta ****, the book being ****.",
         "'Watership Down' is a terrific adaptation of Richard Adams's novel. Like Orwell's 'Animal Farm', this isn't only a film for children but equally important for adults. The soundtrack is captivating and I loved the way Art Garfunkel's song was used. The characters are so richly written that the viewer immediately empathizes and identifies with them. They are brave, endearing, loyal and strong and this is all cleverly downplayed. Fiver and Hazel are the two heroes who are brilliantly voiced by Richard Briers and John Hurt. The overall voice acting is very well done. Unlike most animated films, 'Watership Down' uses a lot of subtlety. Nothing is overdone. The music flows well, the pacing is smooth and the characters are real (rather than over the top). The animation is simplistic, created with watercolour and ink, giving it a gentle touch. It works effectively. There story is cleverly layered and there's a lot of intriguing symbolism. The film never shies away from being brutally honest. It shows life the way it is: There's pain, there's death, there's suffering, there's determination and one needs to work hard to have the best of it, to survive. While many have complained that this is no movie for children, I think it depends more on the individual because this film is relevant for everyone. The violent scenes are a bit graphic and the sad scenes are moving but in the end it is uplifting. There are very few novels that have been so fascinating on screen. 'Watership Down' is among them. It is a magnificently gripping adventurous tale. After 30 years it still remains a powerful story that strongly applies to today's world. I remember seeing it ages ago and then it was a must-have-on-DVD movie for me. I finally got the DVD and had the pleasure to watch revisit it today. A dazzling gem."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Nepenthe Productions",
         "Watership Productions"
      ],
      "summaries": [
         "Based upon Richard Adam's novel of the same title, this animated feature delves into the surprisingly violent world of a warren of rabbits as they seek to establish a new colony free of tyranny and human intervention. Frightening and bloody in some scenes. Not recommended for young children.",
         "In the Sandleford warren, Fiver, a young runt rabbit who is a seer, receives a frightening vision of his warren's immenient destruction. When he and his loving brother, Hazel, fail to convince their chief of the need to evacuate; they set out on their own with a small band of others who heeded the warning and barely manage to elude the Warren's military caste. What follows is a perilous journey in which the band faces dangers of all varieties like predators, humans and even their own kind. While they eventually find a peaceful new home at Watership Down, they have new problems that will lead to a deadly conflict with the neighbouring Warren called Efrafa, which is a police state by the powerful and insane General Woundwart.",
         "A group of rabbits flee their doomed warren and face many dangers to find and protect their new home."
      ],
      "budget": 0
   },
   "movielensId": 2138,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-10-14",
      "dvdReleaseDate": "2002-03-26",
      "directors": ["Martin Rosen"],
      "runtime": 88,
      "movieId": 2138,
      "title": "Watership Down",
      "mpaa": "PG",
      "actors": [
         "John Hurt",
         "Richard Briers",
         "Michael Graham Cox",
         "John Bennett",
         "Simon Cadell",
         "Ralph Richardson",
         "Terence Rigby",
         "Roy Kinnear",
         "Richard O'Callaghan",
         "Denholm Elliott",
         "Lynn Farleigh",
         "Zero Mostel",
         "Michael Hordern",
         "Joss Ackland",
         "Nigel Hawthorne"
      ],
      "imdbMovieId": "0078480",
      "originalTitle": "Watership Down",
      "genres": [
         "Adventure",
         "Animation",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "9S26LA8Bk14",
         "3sN-crgRXV0"
      ],
      "plotSummary": "When the warren belonging to a community of rabbits is threatened, a brave group led by Fiver, Bigwig, Blackberry and Hazel leave their homeland in a search of a safe new haven.",
      "tmdbMovieId": 11837,
      "avgRating": 3.69235,
      "releaseYear": "1978",
      "numRatings": 3070,
      "posterPath": "/879iEKkJMSXSbgqjs3tVOQceNUK.jpg"
   }
}