{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "mouse",
            "id": 2161
         },
         {
            "name": "owl",
            "id": 3905
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "crow",
            "id": 4639
         },
         {
            "name": "illness",
            "id": 40895
         }
      ],
      "imdb_id": "tt0084649",
      "video": false,
      "title": "The Secret of NIMH",
      "recommendations": [
         13225,
         4978,
         10380,
         11837,
         11135,
         15171,
         11497,
         12335,
         9994,
         10437,
         12144,
         19933,
         10957,
         18890,
         10150,
         8989,
         35614,
         11176,
         6878,
         11827
      ],
      "backdrop_path": "/eKpqOVmANBixi8y2hHMGa5OWGU8.jpg",
      "revenue": 14665733,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nicodemus (voice)",
               "gender": 2,
               "credit_id": "52fe447d9251416c7503690f",
               "name": "Derek Jacobi",
               "profile_path": "/jJ4MkVS59gCfJhWMfLTbeHKjoyC.jpg",
               "id": 937,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mrs. Brisby (voice)",
               "gender": 1,
               "credit_id": "52fe447d9251416c75036913",
               "name": "Elizabeth Hartman",
               "profile_path": "/5K4dw0DEjBsH5VHkRnpdxmWg0gx.jpg",
               "id": 70286,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mr. Ages (voice)",
               "gender": 2,
               "credit_id": "52fe447d9251416c75036917",
               "name": "Arthur Malet",
               "profile_path": "/6YEWBozoD2s33M1QHxcPVN69Jvu.jpg",
               "id": 13392,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jeremy (voice)",
               "gender": 2,
               "credit_id": "52fe447d9251416c7503691b",
               "name": "Dom DeLuise",
               "profile_path": "/u1DOOocPOgaiCucbbbxPkdOTuo8.jpg",
               "id": 6844,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Auntie Shrew (voice)",
               "gender": 1,
               "credit_id": "5680d69c9251414f63008a48",
               "name": "Hermione Baddeley",
               "profile_path": "/qdCA3FjT4So7sD6NGK3KE0ldqC6.jpg",
               "id": 5827,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Teresa (voice)",
               "gender": 1,
               "credit_id": "5680d6adc3a3682abc00860e",
               "name": "Shannen Doherty",
               "profile_path": "/1q3BKF6vnOFUOCRier8hfH9Nyxo.jpg",
               "id": 19144,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Martin (voice)",
               "gender": 2,
               "credit_id": "5680d6bdc3a36860e900f12c",
               "name": "Wil Wheaton",
               "profile_path": "/1lrCjrsazL3O82DsP7ICfMHWJTU.jpg",
               "id": 3033,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Cynthia (voice)",
               "gender": 0,
               "credit_id": "5680d6cdc3a368227b00575c",
               "name": "Jodi Hicks",
               "profile_path": null,
               "id": 1554694,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Timothy (voice)",
               "gender": 2,
               "credit_id": "5680d6e39251412e5200d8d0",
               "name": "Ian Fried",
               "profile_path": null,
               "id": 16621,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Great Owl (voice)",
               "gender": 2,
               "credit_id": "5680d6f3c3a36860e900f132",
               "name": "John Carradine",
               "profile_path": "/iv9pZ2JRddIUNe2RgYAKmUR55WO.jpg",
               "id": 8516,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Justin (voice)",
               "gender": 2,
               "credit_id": "5680d70a9251417ddd00f974",
               "name": "Peter Strauss",
               "profile_path": "/ufx1trct43k7UcT4DpoIMPZXi5A.jpg",
               "id": 21368,
               "order": 10
            },
            {
               "cast_id": 27,
               "character": "Jenner (voice)",
               "gender": 2,
               "credit_id": "5680d718c3a36828f5005222",
               "name": "Paul Shenar",
               "profile_path": "/1atzShPqdjNPAJ8J3do03ygrY2S.jpg",
               "id": 1165,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036921",
               "name": "Don Bluth",
               "profile_path": "/sek7iLDM6J8Poc2FueAkgCUytfn.jpg",
               "id": 40345,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036927",
               "name": "Don Bluth",
               "profile_path": "/sek7iLDM6J8Poc2FueAkgCUytfn.jpg",
               "id": 40345,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c7503692d",
               "name": "Will Finn",
               "profile_path": "/lbFB2MFrDocpKqzgGlXBvtrLQmw.jpg",
               "id": 70287,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036933",
               "name": "Gary Goldman",
               "profile_path": "/3GPDphDxHIlT3D8GiMCKsf3X4Rj.jpg",
               "id": 12881,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe447d9251416c75036939",
               "name": "Robert C. O'Brien",
               "profile_path": null,
               "id": 70288,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c7503693f",
               "name": "John Pomeroy",
               "profile_path": "/an7N7XCrbpMtKadExr9IZbC8MXU.jpg",
               "id": 39056,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036945",
               "name": "Don Bluth",
               "profile_path": "/sek7iLDM6J8Poc2FueAkgCUytfn.jpg",
               "id": 40345,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c7503694b",
               "name": "Gary Goldman",
               "profile_path": "/3GPDphDxHIlT3D8GiMCKsf3X4Rj.jpg",
               "id": 12881,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe447d9251416c75036951",
               "name": "Rich Irvine",
               "profile_path": null,
               "id": 70291,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036957",
               "name": "John Pomeroy",
               "profile_path": "/an7N7XCrbpMtKadExr9IZbC8MXU.jpg",
               "id": 39056,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c7503695d",
               "name": "James L. Stewart",
               "profile_path": null,
               "id": 70292,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036963",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447d9251416c75036969",
               "name": "Bill Butler",
               "profile_path": "/BJpWJoyF771fVD0bUPx5WE173y.jpg",
               "id": 2287,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe447d9251416c7503696f",
               "name": "Jeffrey C. Patch",
               "profile_path": null,
               "id": 70294,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5525db42c3a3686b17001184",
               "name": "Diann Landau",
               "profile_path": null,
               "id": 226006,
               "department": "Visual Effects",
               "job": "Animation"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 10.721056,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11704,
      "vote_count": 260,
      "budget": 7000000,
      "overview": "A widowed field mouse must move her family -- including an ailing son -- to escape a farmer's plow. Aided by a crow and a pack of superintelligent, escaped lab rats, the brave mother struggles to transplant her home to firmer ground.",
      "similar": [
         1024,
         9769,
         11224,
         11360,
         866,
         956,
         14869,
         261023,
         320,
         101299,
         452507,
         336843,
         3597,
         417678,
         10137,
         521,
         8834,
         15370,
         226,
         10795
      ],
      "original_title": "The Secret of NIMH",
      "runtime": 82,
      "poster_path": "/qXvgbM2cIjkoOPgzxn0hwiSUqk6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Don Bluth Productions",
            "id": 90512,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Aurora",
            "id": 32178,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mrs. Brisby Ltd.",
            "id": 90400,
            "origin_country": ""
         }
      ],
      "release_date": "1982-06-17",
      "vote_average": 7.5,
      "belongs_to_collection": {
         "backdrop_path": "/z9k5Uu2vXRDSclQU35bb7PhMG6U.jpg",
         "name": "The Secret Of NIMH Collection",
         "id": 141292,
         "poster_path": "/y0S9nsG7bDUgblBiYd0pciE57zr.jpg"
      },
      "tagline": "Right before your eyes and beyond your wildest dreams.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Bluth"],
      "runtime": 82,
      "synopsis": "Mrs. Brisby (Frisby in the original book) is a very shy, timid, and lonely mouse widow whose family is threatened by a premature warm spell, prompting the farmer to start his mowing early, endangering the cinder block she and her family call home. Normally she would simply pack up their things and move to a new spot in the field, but her younger son Timothy is too ill to be moved, forcing her to seek another alternative before it's too late. With the push of her local confidante, the Shrew, and the aid of a clumsy, love lorn crow named Jeremy, she goes to see the Great Owl, who, upon learning that she is the widow of a mouse named Jonathan Brisby, advises her to seek the aid of the mysterious rats who live in the rosebush outside the farmer's house. There, Mrs. Brisby learns of her deceased husband's past, and the secret of these rats, the Rats of NIMH, who agree to move her home before they abandon their underground colony for Thorn Valley, but Mrs. Brisby herself is endangered by the evil machinations of Jenner, a power hungry rat who seeks to overthrow the rats' leader Nicodemus so as to keep the rats in their underground colony, and will go so far as to endanger Mrs. Brisby's children to achieve his goals. Only Justin, the rats' gallant, Errol Flynn like captain of the guard, stands between Jenner and Mrs. Brisby, who must call upon the same courage her husband had if she is to save her family. ===================================================== Mrs Brisby is a widowed mouse who lives on a farm owned by a man named Fitzgibbons. She and her 4 children, Martin, Theresa, Cynthia and Timmy live in a cinderblock in one of Fitzgibbons' fields. Every year, before Fitzgibbons plows the field to plant his crops, the family moves to their summer home to avoid the tractor. Nearby is another mouse, Dr Ages, who is the family doctor. Brisby visits Ages to get a remedy for Timmy, who has come down with pneumonia, potentially delaying the summer move. Fitzgibbons decides one day to begin plowing the field early. Brisby desperately tries to disable the farmer's tractor and freezes while climbing up the mechanism. Auntie Shrew intervenes and pulls out the tractor's gas line, halting the machine. While Mrs Brisby sobs over her predicament, Auntie tells her to be braver for her family's sake and suggests she visit the Great Owl, the wisest creature in the forest. Brisby is hesitant, since owls eat mice, but she goes. With the help of a new found friend, Jeremy, a crow hoping to meet Miss Right, she meets with the fearsome owl, who merely tells her that she must move her family. Brisby explains the complication with her son Timmy and the owl tells her he has no solution. As he leaves, he learns her last name and becomes more helpful because her husband, Jonathan, was well known throughout the woods. The Owl tells Mrs Brisby to go to the colony of rats that live in the farmer's rose bush and ask them for help. He specifically tells her to have the rats move her house to \"the lee of the stone\", the protected side of a large rock in the field that Fitzgibbons avoids when plowing. Mrs Brisby sneaks into the rose bush and finds that the rats have built a very modern colony that makes use of electricity that they pilfer from Fitzgibbons. She also meets Dr Ages, who is astonished that she had met with the Great Owl and lived. They are discovered by the rats' captain of the guard, Justin, who takes them to the rats' Senate room. As they enter, a charismatic rat, Jenner, is speaking to the council about the plan of the rats' leader, Nicodemus, who wants to abandon the rose bush and move to a location called Thorn Valley, where they'll found a new colony based on their own labors, rather than stealing supplies from the farmer. Jenner is opposed to the idea and even suggest that they wage war against any humans who attempt to drive them out. Justin and Ages make Mrs Brisby's case to the council, who agree to the request because she is Jonathan Brisby's wife. In a sinister private meeting with his associate, Sullivan, Jenner plots to have Nicodemus killed during the operation and make it look accidental. Justin takes Brisby to meet with Nicodemus. A very old and wise leader, he tells Mrs Brisby the rats' history: they were all lab animals imprisoned in NIMH, the National Institutes of Mental Health. Injected with experimental compounds, the rats developed intelligent brains and were able to escape their cages, along with several mice including Jonathan and Mr Ages. When they were trapped by a vent grating, Jonathan was small enough to crawl through and open the grate. The rats subsequently owed Jonathan their lives and he continued to work with them while they built their colony. Some months prior to Mrs Brisby's visit to the rose bush, Jonathan had been killed by Fitzgibbons' ornery and fearsome cat, Dragon, whom the rats had been trying to drug. Nicodemus gives Brisby a large red amulet and tells her that it has great supernatural powers when someone shows true courage of the heart. Nicodemus says that the rats will be happy to repay their life debt to Jonathan's family and will move her home. For the operation to succeed, Dragon will have to be drugged. Mrs Brisby, feeling she should participate, volunteers to spike Dragon's feeding dish. The only way into Fitzgibbons' kitchen is through a small hole under a sideboard, a hole too small for any rat. The plan goes well until Brisby runs back and is trapped by Fitzgibbons' son. Justin leaves her, having to supervise the operation, promising to come back for her. While she's trapped in a bird cage, Brisby overhears Fitzgibbons on the phone with NIMH, who want to come to his farm and capture the rats. Brisby realizes the situation is now more desperate and escapes the bird cage by knocking out it's small water cup. At the site of the Brisby home, the rats have constructed an elaborate system of ropes and blocks and tackles to lift the cinderblock. While the block is being swung towards the stone, Jenner cuts the anchoring lines with his sword and the block falls, narrowly missing Nicodemus, however, the heavy gears and rope fall on him, killing him. Jenner declares the operation a failure and suggests they leave when Mrs Brisby arrives. Justin tells her that her family is alive but Nicodemus is dead. She suddenly remembers that NIMH will be at the farm tomorrow and tells the rats they must leave tonight. Jenner refuses to believe her and tells the rats that he will take over leadership of the colony. When Mrs Brisby insists she's telling the truth, Jenner strikes her and notices that she's wearing the amulet. Attempting to seize it from her, Justin intervenes and fights with Jenner until he wounds him. Jenner admits that he'd caused the accident that killed Nicodemus, saying that the plan to move the colony would fail. As he moves in to kill Justin, Sullivan kills Jenner with a thrown dagger and succumbs to his own wound, inflicted by Jenner himself. Moments later, Mrs Brisby sees that her house has begun to sink into the mud, taking her children with it. A futile attempt to rig a new roping system fails and Brisby herself vainly pulls at the remaining ropes as the house sinks under the surface. Justin rescues her, holding her back. As she looks on in horror, the amulet suddenly arises from the mud, brightly glowing, and places itself around her neck. Using the power that Nicodemus spoke of, she raises the house from the mud and moves it to the lee side of the stone. Brisby's children are safe and she faints from exhaustion. The next morning, with Timmy on the mend from his pneumonia and the rose bush being inspected by NIMH, Jeremy arrives with mounds of string that he'd been collecting to build a love nest and finds the Brisby home already moved and even camouflaged by the natural vegetation. He asks Brisby for the amulet, however, she'd given it to Justin before they'd left the rose bush. While he laments that he wasn't able to help move the house, a female crow suddenly flies into him. The two become immediately infatuated. While Brisby's daughter wraps her mother's hands which were burned by the amulet, Auntie Shrew arrives for a visit, bringing groans from Martin.",
      "writers": [
         "Robert C. O'Brien",
         "Don Bluth"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084649/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTEwMDEyNzI2OV5BMl5BanBnXkFtZTcwNTAxMDc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Elizabeth Hartman, Derek Jacobi, Dom DeLuise | See full cast and crew »"],
      "reviews": [
         "The short version: 'The Secret of NIMH' isn't just a masterpiece: it's the best classically animated film since the early 40's. It's up there with 'Bambi', which is to say, this is about as good as it gets. I remember walking down the street when I was about 19, and seeing the poster for 'The Secret of NIMH' up in a theatre, and immediately thinking \"This film is going to blow my mind.\" A week later, I was sitting in an empty theatre, watching the last credits rolling down the screen after everybody else had left, and the house lights were up, thinking \"yep.\" A bit of history is probably in order for a film of this importance. Flashback to about 1980. Disney animator Don Bluth walks out, halfway through production on 'The Fox and the Hound', taking several other key animators with him, and declaring that he was going to recapture the spirit of classical animation, which Disney had forgotten about. Nearly three years later, NIMH debuts. Critically it is well received, but lack of distribution and advertising means it's swamped by such an historical non-entity as Disney's 'Tron'. Accepting an animation award for best film, Bluth remarked \"Thanks. We didn't think anyone had noticed.\" NIMH is a glorious achievement. It puts to shame anything which Disney had done for a quarter century, and singlehandedly did exactly what Bluth set out to do. It revived the spirit of classical animation, and at the same time it proved that there was room on the block for another player than Disney - not an unimportant fact when you consider that at the time there was no Dreamworks or Pixar, and no feature animation section in Universal or MGM. As to the film itself: from the first moment you are treated to a gloriously rich, sumptuous, seamless animation and background art, the likes of which hadn't been seen since Disney's war years. Particularly stunning is the movie's use of colour to enhance moods. The dark blues and blacks of the stunning 'lantern elevator' descent into the rats' city, and the tractor scene - the background starts out in subdued tones and ends up flaming red as the action peaks. One reviewer at the time wrote \"I felt as if I was watching the invention of color, as if I was being drawn into the depths of the screen.\" The characters are beautifully conceived and drawn, and the voice characterisations are spot-on (including the animation debut of Dom de Luise as Jeremy). And, significantly, there is only one song, and it's not sung by a character (significantly, 'Balto', one of the few animated films since which can hold a candle to NIMH, followed the same principal). Jerry Goldsmith's score supplies the emotional power for the rest of the soundtrack. Even more importantly though, the film is incredibly emotionally potent, and not in a sentimental, kiddy way. It has genuine choke-you-up power which will appeal to adults. Bluth ditched the double storyline of the book, relegating Jonathan Brisby's more substantial role in the novel to a short piece of background information revealed in an explanatory flashback. Personally I think this was the right decision. To do otherwise would have been to take the spotlight off Mrs Brisby, and probably diminish the film's coherence and power. So, Don Bluth achieved his goal: his debut feature film was the greatest animated achievement in 40 years. Sadly, it was also his only masterpiece. He peaked on his first outing, and afterwards declined into mediocrity, while Disney picked itself up and overtook him. In fact, ironically, there were signs of this in 'The Fox and the Hound', which despite being plagued by Bluth's departure amongst other catastrophes, turned out to be Disney's best movie since the 60's, even if it would still be the better part of another decade before they started hitting their marks consistently. Today NIMH enjoys the sort of cult following it deserves. It's just a damn shame that its greatness isn't more widely acknowledged, and an almost equally great shame that a generation later it was cursed with one of the most insulting, wretched sequels in cinematic history. It's an important film, and it's a great film. In the two decades since it was released, only a small handful of animated films have approached its stature.",
         "Anybody who doesn't like this movie just doesn't love animation. How can a proclaimed fan of feature animation not be dazzled by the extravagance of Don Bluth's work seen in NIMH? Here is a perfect example of what happens when artists are given free reign to just create whatever their vivid imaginations may produce. To me, the greatest triumph of this movie is the art itself. Its greatest flaw is that it was cheapened by a sequel! Why in the name of HUMANITY was a sequel made? A masterpiece of this magnitude should not be so insulted as to be milked for every dollar that the bean counters say it can! But I digress... Bluth's use of highly stylized art to influence your emotions is rarely seen in others' work. The whole point of animation is that you are not limited by the bounds of reality, so thorns and cobwebs can be just that much more twisty and foreboding. Owls' eyes can glow- not because they do, but because it just plain looks cooler. The bright and sunny entrance to the rats' lair can suddenly fade to a background of blood red as Mrs. Brisby runs in terror from Brutus' electrified blade. What plot holes does using a lit electric lamp as a diving bell produce? Who cares? The concept just looks awesome on screen! The effects animation is spectacular in this movie as well. The glow of Nicodemus' eyes, the sparkling of the fairy dust ink and the flaming letters of the movie title screen are great, and the radiance emitting from Mrs. Brisby as the sheer strength of her character lifts her home from the mud is fantastic. If the story were no more than a shabby framework to lace all of this cool art together, it would be good enough, but there's a lot going for it as well. It's not a complicated story, but its message of love, devotion, and courage shown in the meekest of people (mice?) is enough to inspire anyone! Mrs. Brisby's simple wish for the safety of her family drives her to the greatest of courage, despite her apparant simplicity and weakness. She stands as a model for all of us to aspire to. Animation should never be considered something just for kids. It should not require the characters to burst into song at regular intervals, or the story to be sappy and condescending. NIMH does none of this. It is truly a movie for movie-lovers of all ages. Disney, take a hint!!! Don Bluth, keep making movies like this, and your field will reach an entirely new level of acceptance among older viewers in America.",
         "When I first saw this film, years ago, I was very afraid of many aspects it contained, yet I was also in love with it. As a cartoon, it captures the very familiar values that we have seen in such praised Disney films such as The Sword in the Stone\". This one is much darker though, and because so, it also brings forth, a much scarier element that Disney will never have! Being based completely on archetypical formation, the \"Secret Of NIMH\" is based on the famed children's book \"Mrs. Brisby and the rats of NIMH\". As the book is very darling, and for children of all ages, the film is put together in a more mature, adult style, with intense moments. Later on in life, I realize that children watching this film is an amazing happening, if I knew then, what I know now about the film, I would have been completely overtaken by the film. Some things are better left unknown in childhood. Most kids today will not appreciate this film, for all the glory in which it was made. There were two direct-to-video sequels. Two. This is unacceptable for a movie of this type. The two latter films were made with light, fluffy, musical touches that did NOT capture anything this film did. The two latter films had NO business being made! The generation I grew up in was able to take this wondrous intensity we were given, today, things are much different, and movies like this one are hardly seen. The \"toy story\" genre has taken over, and most films that would, otherwise be like this one are laughably awful, without any real heart. Don Bluth was expressing his strong imagination for this one, most \"pixar\" company films are just money, and offer nothing for anyone except babies in cribs! This movie is a cartoon, a pure adventure, and a treasure full of heart! Don Bluth is a wonderful filmmaker!",
         "The Secret of NIMH after twenty three years is still an absolutely fantastic film. I hold it in such high regard as the even more obscure Gay Pur-ee (with the voice talent of Judy Garland, also wonderful) and Disney's Robin Hood. Criticisms can be made of the film. For one, \"faithful\" isn't exactly an adjective that can be used when describing it's relation to the source material: \"Mrs. Frisby and the Rats of NIMH\" by Robert O'Brien. However, the novel was a Newberry Award winner and it deserved an excellent film which is what it received. The book itself had two separate story lines, one focusing on Mrs. Frisby and her plight, and the other a lengthy backstory involving the rats of NIMH. For the animated feature, Don Bluth and his team chose to focus on Mrs. Frisby's plight and for this I am grateful. In Mrs. Brisby we have a totally unique and a truly delightful heroine. She isn't some young boy getting ready to go on a fantastic adventure or some sort of great, brave hero. She's just a mother, a mother whose first concern is her family. And she makes a fantastic hero, showing that courage isn't just involved in facing down fierce monsters (though when she has to do that she finds the courage). She never stops pushing herself and though she might be a very small mouse, she has a very big heart. As a kid I walked away thinking how cool Justin was, but now that I'm older I have complete respect for Mrs. Brisby. It's an excellent film both for children and adults alike. And how about Derek Jacobi as Nicodemus? Dom deLuise as Jeremy? Not to mention Elizabeth Hartman, whose short career was never-the-less magnificent. Thank god for film that we might have her talents available to us for all time!",
         "I voted a 10 on this movie mostly for its hauntingly breath-taking original musical by Jerry Goldsmith. Surely this film's score has to be some of his very best work. The awe-inspiring wisdoms of Nicodemus and The Great Owl, the comic reliefs of Mr. Ages, Jeremy and Auntie Shrew, the fascinating struggle between good and evil (Justin and Jenner), and of course the unmatchable greatness of the Brisby family name make this film one of the best animated movies ever. The movie's ending climax is powerful and gorgeous. You are left utterly stunned. Mrs. Brisby proves once again that she is just as brave and capable as her husband, if not more so, by never giving up hope and eventually succeeding in keeping her family safe.",
         "The Secret of NIMH is powerful, dramatic and has great originality. The animation is excellent and stylish, and complements the mystical storyline. The plot is complex and beyond your average toddler. This is a film for older kids and adults, anyone who enjoys a unique film experience and is looking for deviation from the expected norms of an animated film. Truly ahead of its time, NIMH is a must - It's become a classic and is not at all childish, as one might predict for animation. There are no musical numbers, just an exciting, vibrant score that follows the action perfectly. Clear your brain of prejudgments and animation stereotypes, and then go rent The Secret of NIMH. It is an ultimately rewarding film.",
         "In the early '80s a group of Disney animators, headed by Don Bluth, decided to break away from the Disney studio. The Secret of NIMH was the first film they made. Based on a semi-classic children's book entitled \"Mrs. Frisby And The Rats Of NIMH\" by Robert C. O'Brien, the film emerges as a decent little animated feature. The story is a bit on the sombre side - probably a bit too serious and complex for really young viewers - but the animation is of a superb quality and the characters are very nicely voiced. Field mouse Mrs Brisby needs to move her family from their home in a farmer's field, as it is almost time for the farmer to gather his crop with the combine harvester. Inevitably the Brisby home would be destroyed and anyone in it killed during the gathering of the crop. Unfortunately, one of her children, Timmy, is suffering from pneumonia and couldn't possible survive the move. Mrs Brisby is advised to contact the rats of NIMH, a group of hyper-intelligent rodents, to ask for their help. Apparently, her late husband Jonathan was a close friend of the rats and they held him in such high regard that they will do anything to help a member of the Brisby clan. The story is told mainly through talk, with occasional bursts of action. As already pointed out, this means the film doesn't really lend itself to a very young audience. But older kids, especially those who are willing to listen with the appropriate degree of attention, will find the story interesting. There are other plus points - Jerry Goldsmith's rousing score; Dom DeLuise's amusing vocals as an accident-prone bird; and some very well-conceived \"baddies\" in the shape of rat conspirator Jenner and savage farm-cat Dragon. The Secret of NIMH is a moderately successful film - no masterpiece, true enough, and not really a serious challenger to the Disney dominance over the genre, but definitely a film that every child should see at least once.",
         "This film has more soul than most animated films. The film music is excellent, and honestly is the shining jewel of the movie. The art work is excellent for the time period: and no computers used! The backgrounds have excellent detail: they could honestly be used as great works of art on their own merit. The voices are excellent and very fitting for the characters. The story line is very well done: while not lacking in action at any time, it's also not like most modern films that are constantly \"in your face\" with fast-moving activity. The facial expressions are outstanding! Too bad Don Bluth didn't do more films! The mud in certain scenes was very well done. The story has great struggle and good-versus-evil appeal to it. The music is actually great for an animated film: no catchy or cheeky pop music at all, but the music score seems to always be doing something. Many times it does such a good job at painting the mental picture of certain scenes that if you were to listen to the score by itself after seeing the movie, you could trace the story line by heart. Even the musical prototype for the main theme, \"Flying Dreams\" (or whatever) was done so well that it makes one wonder who wrote and performed the original demo (first song of the credits). Excellent movie in all aspects, even if it seems \"old school\" to some :)",
         "I turned on Nickelodeon the other day and was disgusted with \"Secret of NIMH 2: Timmy to the Rescue\". Among the many things was the pee-poor animation. So it's not even worth mentioning. The original \"The Secret of NIMH\" remains to this day, my favorite animated feature. Animation-wise, it outshines even Disney's finest features of old: Bambi and Snow White; and of new: Mulan and Beauty and the Beast, all of which are favorites of mine. If the story of Mrs. Brisby, a widowed fieldmouse with four children to rear alone and the heroism she displays throughout the movie isn't enough to touch certain people, they should watch it if only to marvel at the miraculous use of color and dexterity. My favorite scene is when the farm cat is chasing Mrs. Brisby and they end up falling into the water beneath a windmill. But the whole movie has a kind of visual \"theme\" of glowing, sparkling mysticism, which fits into the storyline of power, beauty, courage, the abuse of power, and good and evil. It was rated G, but I feel that because of the amount of violence and animated bloodshed, and because of a very frightening scene involving a sinkhole, it should have been rated PG. That means it's not a kiddie kind of cartoon!!!",
         "1st watched 5/13/2001 - 8 out of 10 (Dir-Don Bluth): Complicated story for kids, but extremely well-done animated tale of a group of rats who are experimented on by NIMH(National Instiute for Mental Health) and become smart. They escape and live in an underground existence stealing electricity from a farmer. The plan is to generate their own electricity and be able to move to a safer locale, but we don't exactly know how this is going to happen. Dom Deluise has a humorous role as a clumsy love-lorned crow to keep the seriousness of the story at bay. This movie is excellent from beginning to end and deserved more recognition than it got(probably because it's not Disney), but launched a series of Bluth animated movies to give animated movie fans an alternative to Disney."
      ],
      "genres": [
         "Animation",
         "Drama",
         "Family",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Aurora",
         "Don Bluth Productions",
         "Mrs. Brisby Ltd."
      ],
      "summaries": [
         "Mrs. Brisby, a widowed mouse, lives in a cinder block with her children on the Fitzgibbon farm. She is preparing to move her family out of the field they live in as plowing time approaches, however her son Timothy has fallen ill, and moving him could prove fatal. Mrs. Brisby visits The Great Owl, a wise creature who advises her to visit a mysterious group of rats who live beneath a rose bush on the farm. Upon visiting the rats, Brisby meets Nicodemus, the wise and mystical leader of the rats, and Justin, a friendly rat who immediately becomes attached to Mrs. Brisby. While there, she learns that her late husband, Mr. Jonathon Brisby, along with the rats, was a part of a series of experiments at a place known only as N.I.M.H. (revealed earlier in the story as the National Institute of Mental Health). The experiments performed on the mice and rats there boosted their intelligence, allowing them to read without being taught and to understand things such as complex mechanics and electricity. The rats and Mr. Brisby escaped from N.I.M.H. and came to live on the Fitzgibbon farm. The rats created a home for themselves under Mrs. Fitzgibbon's rose bush, creating an elaborate habitation of beautiful chambers, elevators, and Christmas lights. However, the rats are unhappy in their dependence on the humans, who they are stealing electricity from, and have concocted a plan to leave the farm and live independently. Because of her husband's prior relationship with the rats, they agree to help Mrs. Brisby move her home out of the path of the plow. However, the evil Jenner and his unwilling accomplice Sullivan, who wish to remain beneath the rose bush, yet plot to kill Nicodemus during the move.",
         "It seems to Mrs. Brisby, the widowed head of a family of field mice, that her youngest son must die, either by the farmer's spring plough or of pneumonia in his flight to safety. In her quest for a cure she frees a young crow from some string in which he has foolishly tied himself, at the mercy of the farmer's cat Dragon. In return for her risking her life to save his, he takes her to the creature all birds know is the wisest: a great owl. Owls eat mice, but when this owl learns Mrs. Brisby's name he sets her on a path to earning a noble solution to her predicament - which is the secret of NIMH...",
         "A fieldmouse named Mrs. Brisby must move her family to a safe location before the farmer plows the field where they live, but her invalid son Timmy cannot go outside due to his pneumonia. She enlists the aid of some highly intelligent, escaped lab rats that have built a subterranean society inside a rose bush near the farmer's garden. The rats, led by the wise Nicodemus, decide to help her physically move her house to repay a debt of gratitude to her late husband, who made possible the rats' escape from the laboratory. But things become complicated when some of the rats decide to use the situation to kill Nicodemus and make it appear to be accidental.",
         "To save her ill son, a field mouse must seek the aid of a colony of rats, with whom she has a deeper link than she ever suspected."
      ],
      "budget": 7000000
   },
   "movielensId": 2139,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-06-17",
      "dvdReleaseDate": "1998-11-17",
      "directors": ["Don Bluth"],
      "runtime": 82,
      "movieId": 2139,
      "title": "The Secret of NIMH",
      "mpaa": "G",
      "actors": [
         "Derek Jacobi",
         "Elizabeth Hartman",
         "Arthur Malet",
         "Dom DeLuise",
         "Hermione Baddeley",
         "Shannen Doherty",
         "Wil Wheaton",
         "Jodi Hicks",
         "Ian Fried",
         "John Carradine",
         "Peter Strauss",
         "Paul Shenar"
      ],
      "imdbMovieId": "0084649",
      "originalTitle": "The Secret of NIMH",
      "genres": [
         "Fantasy",
         "Animation",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [
         "5aZA4qB85r4",
         "9YsUYMVsN5Y"
      ],
      "plotSummary": "A widowed field mouse must move her family -- including an ailing son -- to escape a farmer's plow. Aided by a crow and a pack of superintelligent, escaped lab rats, the brave mother struggles to transplant her home to firmer ground.",
      "tmdbMovieId": 11704,
      "avgRating": 3.71136,
      "releaseYear": "1982",
      "numRatings": 5396,
      "posterPath": "/qXvgbM2cIjkoOPgzxn0hwiSUqk6.jpg"
   }
}