{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "record store",
            "id": 633
         },
         {
            "name": "lovesickness",
            "id": 725
         },
         {
            "name": "class",
            "id": 6069
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "outcast",
            "id": 10216
         },
         {
            "name": "teenage crush",
            "id": 10791
         },
         {
            "name": "slumber party",
            "id": 11798
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "school life",
            "id": 190116
         },
         {
            "name": "origin",
            "id": 202540
         }
      ],
      "imdb_id": "tt0091790",
      "video": false,
      "title": "Pretty in Pink",
      "recommendations": [
         15144,
         11557,
         11814,
         15143,
         13342,
         2028,
         9346,
         1552,
         12919,
         19382,
         2617,
         12151,
         10780,
         2640,
         14370,
         8130,
         10013,
         11418,
         10019,
         8491
      ],
      "backdrop_path": "/9c72JU6Agv9zPY5YWDsuekGd8kz.jpg",
      "revenue": 40471663,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andie Walsh",
               "gender": 0,
               "credit_id": "52fe44519251416c75030885",
               "name": "Molly Ringwald",
               "profile_path": "/y8RQwpSQaRfWK70fR9LUT8Fql64.jpg",
               "id": 21625,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Philip F. \"Duckie\" Dale",
               "gender": 2,
               "credit_id": "52fe44519251416c75030889",
               "name": "Jon Cryer",
               "profile_path": "/lUbtFIFdzGXktaFPgrznBDteI5y.jpg",
               "id": 69718,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Blane McDonough",
               "gender": 2,
               "credit_id": "52fe44519251416c7503088d",
               "name": "Andrew McCarthy",
               "profile_path": "/bn6djJHhLF6dTIz5H3UvuCFoeLm.jpg",
               "id": 37041,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jack Walsh",
               "gender": 2,
               "credit_id": "52fe44519251416c75030891",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Iona",
               "gender": 1,
               "credit_id": "52fe44519251416c750308b9",
               "name": "Annie Potts",
               "profile_path": "/eryXT84RL41jHSJcMy4kS3u9y6w.jpg",
               "id": 8873,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Steff",
               "gender": 2,
               "credit_id": "52fe44519251416c750308bd",
               "name": "James Spader",
               "profile_path": "/gFDjZje8P0S3MzHuw1cxiYuHBX5.jpg",
               "id": 13548,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Benny Hanson",
               "gender": 1,
               "credit_id": "540d15a4c3a36879a8004bf6",
               "name": "Kate Vernon",
               "profile_path": "/qQRoxwIVkRU0al9J2EUDBSD80kq.jpg",
               "id": 19740,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Bouncer",
               "gender": 0,
               "credit_id": "540d15b0c3a368799c004f11",
               "name": "Andrew Dice Clay",
               "profile_path": "/1KzjDfy2r0Q8HUiEYfLvrOqVWH0.jpg",
               "id": 57906,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Duckette",
               "gender": 1,
               "credit_id": "540d15c2c3a368799f004dc6",
               "name": "Kristy Swanson",
               "profile_path": "/wxLklfVHTuVg3O7XT4vBpgzc0Tm.jpg",
               "id": 56128,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Simon",
               "gender": 2,
               "credit_id": "540d15d6c3a368799c004f1b",
               "name": "Dweezil Zappa",
               "profile_path": "/d2HSXwuYiTKzL1Lo1IEtMsAa0WX.jpg",
               "id": 120952,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Trombley, Girl Friend/Gym Class",
               "gender": 1,
               "credit_id": "52fe44519251416c750308c1",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Mrs. Dietz",
               "gender": 0,
               "credit_id": "57cdde6d9251413d5b0012e7",
               "name": "Maggie Roswell",
               "profile_path": "/v2rJHrmv3fcTLfdjX42to9F0JuA.jpg",
               "id": 6007,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Kate",
               "gender": 1,
               "credit_id": "580916c5925141438f002178",
               "name": "Emily Longstreth",
               "profile_path": "/jVGECibuxYgom9VPGO9Mcqo4Uky.jpg",
               "id": 141046,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44519251416c75030897",
               "name": "Howard Deutch",
               "profile_path": "/68Vae1HkU1NxQZ6KEmuxIpno7c9.jpg",
               "id": 26502,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44519251416c7503089d",
               "name": "Lauren Shuler Donner",
               "profile_path": "/uwuWpT2xyhwlrfSCk6xTTvrRvEE.jpg",
               "id": 7200,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44519251416c750308a3",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44519251416c750308a9",
               "name": "Tak Fujimoto",
               "profile_path": "/stUrxvmoFNrNLskc2oPhrOOeinB.jpg",
               "id": 16300,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44519251416c750308af",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44519251416c750308b5",
               "name": "Michael Gore",
               "profile_path": null,
               "id": 32398,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56c12795c3a36817f200d7e2",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56c127a79251410d670002fc",
               "name": "Michael Chinich",
               "profile_path": null,
               "id": 7185,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.548093,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11522,
      "vote_count": 386,
      "budget": 0,
      "overview": "Andie is an outcast, hanging out either with her older boss, who owns the record store where she works, or her quirky high school classmate Duckie, who has a crush on her. When one of the rich and popular kids at school, Blane, asks Andie out, it seems too good to be true. As Andie starts falling for Blane, she begins to realize that dating someone from a different social sphere is not easy.",
      "similar": [
         10691,
         9836,
         225886,
         24420,
         38,
         1903,
         11224,
         50546,
         46705,
         449176,
         6620,
         1643,
         290762,
         427900,
         11397,
         158907,
         11121,
         87567,
         12102,
         111969
      ],
      "original_title": "Pretty in Pink",
      "runtime": 96,
      "poster_path": "/iSSExklJXBcevQuD8Rycq95fD2p.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1986-02-28",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Blane's a pretty cool guy. Andie's pretty in pink. And Ducky's pretty crazy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Howard Deutch"],
      "runtime": 96,
      "synopsis": "Andie comes from a poor home, is a bit of an outcast at school and works at a record store. She takes care of her dad, who is still a bit lost after being left by Andie's Mom years ago. Duckie is her best friend who has secretly been in love with her since childhood. Enter Blaine, A popular rich kid who is interested in Andie despite the social pressure from his friends. After a couple days of flirting Blaine eventually asks Andie out, much to Duckie's disappointment. Andie is initially very excited but feels out of place when Blaine takes her to a party and his friends are less then accepting. They leave and go to one of Andie's favorite hangouts, A bar with live music, but the Blaine gets a less the welcome reception from Duckie. Despite the social world differences the two want to make it work and Blaine asks Andie to Prom. Blaine's douche bag friend Steff get's to him though and Blaine backs out of the prom date. Andie eventually decides to go anyways, is meet there by Duckie, and they reconcile their friendship. Blaine realizes he was wrong and apologies to Andie, Duckie relents and tells her to go after him, and Andie and Blaine make up and out in the parking lot and everything is golden in 80's teen romance land.",
      "writers": ["John Hughes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091790/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2OTk5NTE5NV5BMl5BanBnXkFtZTcwODA0NTQzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Molly Ringwald, Jon Cryer, Harry Dean Stanton | See full cast and crew »"],
      "reviews": [
         "Writer John Hughes has the 80's pegged. But this story could have been set in the 50's or 60's and still worked well. That is why I think this movie is so relevant. Devotion, friendship, and self worth are quizzed. The young actors were better than expected. I have watched this over a dozen times and I don't care if some people refer to this as a \"chick flick\". A young girl falls in love with a boy from the other side of the tracks. Problems occur when his peers think the object of his desires is socially beneath him. Molly Ringwald was very good. Andrew McCarthy and Jon Cryer seemed to feel their part more than the rest of the cast. But James Spader was such a realistic jerk, you want to get up and punch his face in. Harry Dean Stanton and Annie Potts play the adult roles of substance. Have you ever seen Stanton so sympathetic? A very upbeat soundtrack keeps the movie flowing and helps you feel the atmosphere. Don't write this off as just another teen movie. Highly recommended.",
         "Possible spoilers: To hell with the Duckie vs. Blane question. Steff's the only interesting one. 1. He's fearless: Duckie's afraid to tell Andie he loves her, Blane's afraid of his friends, but Steff walks up and hits on her right in front of his friends without caring what they'll think. He exploits Blane's shame about Andie but clearly feels no shame himself. 2. Duckie's suffering puppy love, Blane's just curious, but Steff has been after Andie for years. When he says it's \"not *only* for sex,\" he's probably telling the truth, in his own sarcastic way. Key scene, when Blane and Andie walk in on Steff and Benny Bimbo, and Steff clearly wishes he were with the hot geeky girl, instead of the vapid blonde, even if Benny is better-looking, sexually available, and approved by his friends. And it's not only the challenge attracts him to Andie: despite his arrogance, he's probably been turned down before. He just suspects that with Andie, he'd have something real, and with Benny, whether her ecstasy is real or faked, it will be conducted according to \"Cosmo.\" 3. He's willing to fight for what he wants, i.e., sabotaging Andie's relationship with Blane. OK, he's fighting dirty--but he's fighting at all. The others are about as decisive as Hamlet. Right, enough deep thought devoted to what should probably be regarded as another teen movie. I give full credit to Spader, who fleshed out what could have been a one-dimensional baddie by making him really interested in Andie in his own sociopathic way, instead giving lip-service to a script that could have been played with the character being vicious solely out of hurt pride and snobbery.",
         "It is hard to believe that this was 13 years ago. Has it really been that long since we said goodbye to the Brat-Pack? When I watched Pretty In Pink it made me laugh, but more importantly it brought me back to a time that was fun, had less pressure ( in some ways ), and there were a plethora of films that were made aimed at us teens. The early 80's will at least partly be remembered as a time when teen flicks ruled. Everything from Fast Times and Porky's to The Breakfast Club and Pretty In Pink, they were all there and they all tried to do the same thing. Entertain. Sure John Hughes always seemed to have some heavy issues in his films, but ultimately his films were there for us to enjoy for 90 minutes. Pretty In Pink is one of the best at accomplishing that. What makes this film such the standout that it is, is everything really. The actors were fresh and cool. The dialogue was smart and easy for us to relate to. The situations of love covered areas that we have probably all been through. There was the unobtainable love that just seemed like a fantasy. There was the two really good friends, one male and one female, that just weren't meant to be lovers and the heartbreak that one is inevitably going to experience. There was perhaps not being accepted by your love interests peers and so on. Watching this film I could understand how Duckie felt. I could feel his anger when he watches his best friend, and his secret love interest, date the personification of what ( and Andie ) consider the personification of snobbery. She has probably complained many a night about how she is tired of being treated unfairly just because she wasn't born with a silver spoon in her mouth, and now she dates one. I could feel Ducky's pain. And that can be attributed to John Hughes for writing a brilliant script, but also to Jon Cryer for making his character what he is. You can sense his insecurities and his undying devotion to a girl that he knows he will probably never get. And when he sits with Andies dad and chats about love, there is one of the greatest lines in the film. Jack ( Harry Dean Stanton ) tells him that you can't force love, it is either goging to happen or it isn't. You can't control these things. And that is what makes love so painful. While you may be perfect for someone, that someone wants the perfection of someone else. And that sucks, love's a bitch Duck. Love's a bitch. Pretty In Pink epitomizes everything that made the 80's a great time for teen flicks. Secret loves, proms, a great soundtrack and John Hughes. What more can you ask for? This is one of the best.",
         "PRETTY IN PINK is the tale of an original, but slightly outcast, girl named Andie Walsh (Molly Ringwald) who is from the poorer part of her town. She never minded this until one day when the rich, \"preppy\" Blane McDonnagh (Andrew McCarthy) asks her if she'd like to go out sometime. All of Blane's rich preppy friends immediately disapprove, and Andie gets caught in the middle when her own best friend Duckie (Jon Cryer) disapproves as well. Andie decides to go out with Blane anyway, although their first date ends up being somewhat of a disaster. Blane takes Andie to his friend Steff's (James Spader) house party, where nearly everyone snubs her, and Andie is embarrassed to let Blane see where she lives and what kind of house it is. In the end, Andie has to decide whether pursuing potential love is worth the humiliation she receives from everyone else for doing so. PRETTY IN PINK is the last of the three famous Molly Ringwald-John Hughes collaborations, and is also the least favorable, in my opinion. Which is not to say that it's not a good movie, though. While its two predecessors dealt more with status and popularity issues, this movie deals with a more serious topic of class differences. However, I find this to be a pretty unrealistic scenario by today's standards and not very easy to relate to, in my case at least. However, the whole concept of two lovers dating despite their differences and everyone else's disapproval is pretty cool and receives my commendation. The ending, though, is a bit of a disappointment. What I really commend the movie on, however, is its portrayal of what love is really like. It manages to show just how beautiful it can be at times, and just how destructive it is most of the time. Having experienced something similar to Andie's struggle, I have to say that that feature of the movie made it a lot more personable and relatable for me, taking on a deeper meaning than it probably would for others who haven't experienced such a battle. As far as technical aspects go... well, what can you say. The acting is terrific, namely from the always-great Molly Ringwald and the spectacularly wacky Jon Cryer as the film's most memorable character by far, Duckie. Jon Cryer easily delivers the film's best performance, along with most of its best lines. Annie Potts is also wonderful and funny as Andie's coworker Iona. John Hughes was a great director, even though his area of expertise was '80s teen movies--but, let's face it, no one could have done them better. To wrap it up, PRETTY IN PINK is a cute love story with fantastic acting and characters that manages to capture a bit of the true essence of love, even if it is a bit disappointing in the end. 7/10.",
         "An 80's movie. You have to love them. This is one of the few that do have a slight twist on the ending though. I like this film for many reasons. Molly Ringwald is the queen of the teen movies in the 80's. She is a must watch in all of these classic films. I also loved the fact that you got to see some later on famous stars appear in this film like Kristy Swanson and Gina Gershon. Neither really had any lines but they were in it. Make sure to see this movie if you get a chance. Romance or not, it is a good film.",
         "PRETTY IN PINK and Molly Ringwald were to the 80s, as CLUELESS and Alicia Silverstone is to the 90s. An excellent cast and some fine acting were guaranteed enough to have branded this a teenage classic from the 80s. They don't make good movies like this anymore! The clever talent from John Hughes doesn't just mean it's a far-out comedy, but he expresses the problems of young love from central character Ringwald that sound dramatic and satirizing. In other words, a girl-meets-boy story that offers a wide spectrum of situations that are confronted in the real world. Like I already said, the cast is exceptional, including the sensational Jon Cryer doing a lip-synching of that familiar tune from THE COMMITMENTS. Annie Potts is a pure delight at changing one wig after the next (what a nice impersonation of Audrey Hepburn!). The movie wouldn't have been anywhere near complete without the memorable hit tune \"If You Leave\" (Orchestral Manoevers In The Dark). While the end has a hard time getting things straight, there is a valuable moment that caresses deeply. From start to finish, this one still holds up against the recent string of teen pictures that aren't as cool or refreshing (CLUELESS and REALITY BITES are the exceptions). A movie like this is great when it's not so raunchy.",
         "John Hughes knows the 80's. And this proves it. The film is a drama/comedy about a teenage girl and her problems in social and family life. Though I am a guy, I identified with a lot of the problems and I thought there was so much to like in this film. It's just that this is a little softer than the other Hughes films. Maybe cause he didn't direct it. Molly Ringwald gives her best yet and Harry Dean Stanton has never been more tender. Good 80's film, but not in the best column. By the way, Andrew Dice Clay appears as a bouncer, so pay attention to his part which highlights the film for me. A",
         "PRETTY IN PINK STARRING: MOLLY RINGWALD, ANDREW MCCARTHY Molly Ringwald plays Andie, a poor girl who lives with her father after her mother left them. She falls in love with a \"richie\", as she calls him, named Blane (who is played by Andrew McCarthy) but the pressure of friends is in the way of their relationship being perfect. Meanwhile, Andie's best friend Duckie is declaring even more his undying love for her. \"Pretty in Pink\" is one of those great teen movies that only comes along once. It has a fantastic sound track, cute guys, a great leading lady and a clever plot with some of the most romantic movie scenes of its time. It defines the 80s high school years with its cliques, which still are around until this day, and the problems that occur when you fall in love with someone else on the other side of the tracks. I give this movie **** out of *****",
         "This movie set in the mid 80s era of brat-pack movies is a unique shining star. Molly Ringwald is Andie a girl from the wrong side of the tracks who has romantic interests from both sides of the spectrum; Duckie (Jon Cryer) who's puppy dog love for her is both sweet and endearing to watch, and Blane (Andrew McCarthy) the rich guy who has everything going for him. What follows is Andie having to deal with this, the bitchy cheerleader type girls at school, her loving but dishonest father (An excellent Harry Dean Stanton) and through all this will she get an invitation to the prom? This is a great film with both Blane and Andie having to deal with their friends disagreeing with their relationship. Steff (James Spader at one of his very best) Blane's best friend, who tries to make Blane decide between Andie and himself when really he just wants a finger in the pie. Annie Potts as Iona, Andie's quirky older best friend is excellent and her weird and orginal costume changes throughout the movie are a high-point. This is an emotionally raw film a rarity at the time it was made. If you ask me this should have swept the Oscar nominations with Molly Ringwald getting Best Actress, but hey regardless of the miss of Oscars, watch this, it is a powerful film and a great piece of film making",
         "I love this movie. Let me tell you why. First off, the cast: Molly Ringwald, Andrew McCarthy, Jon Cryer, James Spader, Annie Potts, etc all bring their own special something to the movie. Jon Cryer in particular is perfect for the character of Duckie, an angst-ridden teen who yearns for Andie (Molly Ringwald). They had a special showing of this movie in a theater in Orlando that I went to, and Duckie still to this day, had the whole audience laughing. I definitely recommend the soundtrack. It seems like every time I watch this movie (and I've seen it so many times) I find something new about it that I like even more. It's just such a cool movie about being independent and your own person. This is Molly's best role yet. Yes, her fashion is very outdated, but you have to realize that this was the 80's and Molly was trying to show her own uniqueness. I love the fact that Andie works at a record store, Trax, with punked-out Iona (Annie Potts)who is her confidant and funny to boot. The record store seems like a place you would find one day and just feel special for knowing it's there. I love her pink car. I love the club they go to and the Rave-Ups that play on-stage. In conclusion, this is a fabulous movie. Especially if you love the 80's!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Teenager Andie is one of the not-so-popular girls in high school. She usually hangs out with her friends Iona or Duckie. Duckie has always had a crush on her, but now she has met a new guy at school, Blane. He's one of the rich and popular guys but can the two worlds meet?",
         "A poor girl must choose between the affections of her doting childhood sweetheart and a rich but sensitive playboy."
      ],
      "budget": 0
   },
   "movielensId": 2145,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-02-28",
      "dvdReleaseDate": "2002-08-20",
      "directors": ["Howard Deutch"],
      "runtime": 96,
      "movieId": 2145,
      "title": "Pretty in Pink",
      "mpaa": "PG-13",
      "actors": [
         "Molly Ringwald",
         "Jon Cryer",
         "Andrew McCarthy",
         "Harry Dean Stanton",
         "Annie Potts",
         "James Spader",
         "Kate Vernon",
         "Andrew Dice Clay",
         "Kristy Swanson",
         "Dweezil Zappa",
         "Gina Gershon",
         "Maggie Roswell",
         "Emily Longstreth"
      ],
      "imdbMovieId": "0091790",
      "originalTitle": "Pretty in Pink",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [
         "y-X5ixDLuhM",
         "E-Jb-Wu_sXw"
      ],
      "plotSummary": "Andie is an outcast, hanging out either with her older boss, who owns the record store where she works, or her quirky high school classmate Duckie, who has a crush on her. When one of the rich and popular kids at school, Blane, asks Andie out, it seems too good to be true. As Andie starts falling for Blane, she begins to realize that dating someone from a different social sphere is not easy.",
      "tmdbMovieId": 11522,
      "avgRating": 3.3621,
      "releaseYear": "1986",
      "numRatings": 8927,
      "posterPath": "/iSSExklJXBcevQuD8Rycq95fD2p.jpg"
   }
}