{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "secret admirer",
            "id": 171612
         },
         {
            "name": "post college",
            "id": 171626
         }
      ],
      "imdb_id": "tt0090060",
      "video": false,
      "title": "St. Elmo's Fire",
      "recommendations": [
         11522,
         10859,
         18169,
         13346,
         1552,
         9941,
         11584,
         11177,
         2107,
         14370,
         8130,
         9080,
         8992,
         13665,
         10905,
         19382,
         11896,
         2565,
         11307,
         12560
      ],
      "backdrop_path": "/gXlhTsdRd7Wpov398gfENK5WNmd.jpg",
      "revenue": 37803872,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kirby Keger",
               "gender": 2,
               "credit_id": "52fe44599251416c750319c1",
               "name": "Emilio Estevez",
               "profile_path": "/2NSM4zFrw3i16UYdUhfETVjqC4I.jpg",
               "id": 2880,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billy Hicks",
               "gender": 2,
               "credit_id": "52fe44599251416c750319c5",
               "name": "Rob Lowe",
               "profile_path": "/yt6vMZVBXGCJL0xRE4jFa4SjzcQ.jpg",
               "id": 2879,
               "order": 1
            },
            {
               "cast_id": 18,
               "character": "Kevin Dolenz",
               "gender": 2,
               "credit_id": "52fe44599251416c75031a17",
               "name": "Andrew McCarthy",
               "profile_path": "/bn6djJHhLF6dTIz5H3UvuCFoeLm.jpg",
               "id": 37041,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Jules",
               "gender": 1,
               "credit_id": "52fe44599251416c750319c9",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Alec Newbary",
               "gender": 2,
               "credit_id": "52fe44599251416c750319cd",
               "name": "Judd Nelson",
               "profile_path": "/9H1TSnBEDYl59tFC1EQHccrINsp.jpg",
               "id": 21624,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Leslie Hunter",
               "gender": 1,
               "credit_id": "52fe44599251416c750319d1",
               "name": "Ally Sheedy",
               "profile_path": "/xfNrfzgDwyvmczadJWw4fN70siS.jpg",
               "id": 12851,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Wendy Beamish",
               "gender": 1,
               "credit_id": "52fe44599251416c750319d5",
               "name": "Mare Winningham",
               "profile_path": "/hDaZAbMo9fLranbNDei5e0t8VjL.jpg",
               "id": 51544,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Mr. Beamish",
               "gender": 2,
               "credit_id": "52fe44599251416c750319d9",
               "name": "Martin Balsam",
               "profile_path": "/vOrAfNxbu3Y1eQbdVQGUcmTu9Rc.jpg",
               "id": 1936,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Dale Biberman",
               "gender": 1,
               "credit_id": "52fe44599251416c750319dd",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mrs. Beamish",
               "gender": 1,
               "credit_id": "55f454d0c3a3686d07003795",
               "name": "Joyce Van Patten",
               "profile_path": "/wEUXn5Zgz88SZlTLZPrecfxGFOO.jpg",
               "id": 14108,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Felicia",
               "gender": 1,
               "credit_id": "55f454e59251414e08003179",
               "name": "Jenny Wright",
               "profile_path": "/scz1dQwtwyFDej8zCAbk6p5bqdp.jpg",
               "id": 64056,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Wally",
               "gender": 2,
               "credit_id": "55f454f6c3a3686d270030b8",
               "name": "Blake Clark",
               "profile_path": "/j6nhwuLKJXzHuD4zv2d3y99PcIC.jpg",
               "id": 21485,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Howie Krantz",
               "gender": 0,
               "credit_id": "55f45516c3a36871ec0033c5",
               "name": "Jon Cutler",
               "profile_path": null,
               "id": 1509217,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Ron Dellasandro",
               "gender": 2,
               "credit_id": "55f4552e92514131af0001a0",
               "name": "Matthew Laurance",
               "profile_path": "/6j5XR1nejp66diRtHD6CgSbhkvO.jpg",
               "id": 164723,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Judith",
               "gender": 1,
               "credit_id": "55f455479251413a9600279a",
               "name": "Gina Hecht",
               "profile_path": "/heybFsT6FKB7CdZ8Uj6cxt52EwY.jpg",
               "id": 156818,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Naomi",
               "gender": 1,
               "credit_id": "55f4555c925141666a000bbf",
               "name": "Anna Maria Horsford",
               "profile_path": "/aHGNsdQyfYiMsclGTlEPvvmZw3a.jpg",
               "id": 54800,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Libby",
               "gender": 1,
               "credit_id": "588e1707c3a36874a3009a1b",
               "name": "Elizabeth Arlen",
               "profile_path": "/tYaDJk3oNI2zey4UOi1fN9oA54T.jpg",
               "id": 1564336,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44599251416c750319e3",
               "name": "Joel Schumacher",
               "profile_path": "/ijI5sCPqDvT18NRWCeBqw8BJIZx.jpg",
               "id": 5572,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44599251416c750319e9",
               "name": "Joel Schumacher",
               "profile_path": "/ijI5sCPqDvT18NRWCeBqw8BJIZx.jpg",
               "id": 5572,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c750319ef",
               "name": "Carl Kurlander",
               "profile_path": null,
               "id": 69876,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44599251416c750319f5",
               "name": "Lauren Shuler Donner",
               "profile_path": "/uwuWpT2xyhwlrfSCk6xTTvrRvEE.jpg",
               "id": 7200,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44599251416c750319fb",
               "name": "Ned Tanen",
               "profile_path": null,
               "id": 21643,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44599251416c75031a01",
               "name": "Bernard Schwartz",
               "profile_path": null,
               "id": 65637,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44599251416c75031a0d",
               "name": "Stephen H. Burum",
               "profile_path": null,
               "id": 1258,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44599251416c75031a13",
               "name": "Richard Marks",
               "profile_path": null,
               "id": 3175,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56447697c3a36870db005838",
               "name": "David Foster",
               "profile_path": "/mNZoeFJTQY6f2G27P3l32v42266.jpg",
               "id": 62053,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.044568,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11557,
      "vote_count": 169,
      "budget": 0,
      "overview": "Seven friends - Alec, Billy, Jules, Kevin, Kirby, Leslie and Wendy - are trying to navigate through life and their friendships following college graduation. Alec, who aspires to political life, has just shown his true colors by changing his allegiance from Democrat to Republican, which freaks out girlfriend Leslie, who he wants to marry. Budding architect Leslie, on the other hand, has an independent streak. She believes she has to make a name for herself to find out who she is before she can truly commit to another person in marriage. But Leslie and Alec have decided to live together. Because Leslie refuses to marry Alec, he believes that justifies certain behavior. Kirby, who wants to become a lawyer and who pays for his schooling by working as a waiter at their local hangout called St. Elmo's Bar, and struggling writer Kevin are currently roommates. They are on opposite extremes of the romance spectrum.",
      "similar": [
         4629,
         44564,
         23168,
         1429,
         40807,
         77338,
         68718,
         50544,
         41630,
         13,
         28178,
         19913,
         489,
         277547,
         290762,
         397422,
         13523,
         226,
         12244,
         62211
      ],
      "original_title": "St. Elmo's Fire",
      "runtime": 110,
      "poster_path": "/h1bsWIQedOvYQyLVNCzOHHMDxYG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1985-06-20",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The passion burns deep.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joel Schumacher"],
      "runtime": 110,
      "synopsis": "Seven friends fresh out of Georgetown University struggle to overcome the issues that keep them from growing up and moving on past their college glory days.",
      "writers": [
         "Joel Schumacher",
         "Carl Kurlander"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090060/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4ODM2MTAzOF5BMl5BanBnXkFtZTgwOTYxNjcxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Demi Moore, Rob Lowe, Andrew McCarthy | See full cast and crew »"],
      "reviews": [
         "St. Elmo's fire has been on constant play on HBO lately. I turned it on the other night and watched the whole thing. Yeah, it was a nostalgia trip (I remember watching it a few times on cable ten years ago) but it also has some decent scenes and it really captures a \"moment,\" both for recent college grads and for those of us who were enchanted by the brat pack in the 80s. I've been reading other people's reviews; several of them whine about how \"self-absorbed\" these characters are. Well...um... duh. Yeah. Most movies are about self-absorbed people. Self-absorbed people are more interesting, because they don't care what other people think: self absorbed people feel deeply, they make huge mistakes, and they're generally fun to watch. Some of the greatest movies of all time are about self-absorbed people: Annie Hall (Alvy Singer), Amadeus (Mozart), Leaving Las Vegas (Nic Cage), Goodfellas (Every single mobster in the movie). Mother Theresa was completely giving, completely SELFLESS, and yet I haven't seen a great movie about her. That's not the point. I'm not saying St. Elmo's Fire is a classic. I'm just saying, calm down people. Take the movie for what it is, a stylized look into one moment in life, and don't be so preachy about what kinds of characters are \"appropriate\" to focus on.",
         "When I first saw this film I was about 14. I loved it back then because there were so many cool actors in it. That is why, nothing more and nothing less. But now, as I am a young adult perhaps going through some of the same scenarios and fears and insecurities that these people are in the movie, I can appreciate it a whole lot more. Not only is it a film that has an incredible young cast in it, but it is a film that does a great job of dealing with a plethora of issues. My favourite character was Billy, the Rob Lowe character. Sometimes his intentions weren't always spelled out for us, but there are subleties about the way he plays his character that really hit home. You can tell that he misses the easier days of college. The days where all he had to do was play sports and smoke up a bit. But now he is in real life and he can't quite seem to find his niche. He is still the good looking playboy that can get laid whenever he feels like it, but as for dealing with real life issues, he is confused and scared. And he masks that insecurity by being a playboy. It's a great character study. Many of the other characters in the film have interesting stories as well. None of them have quite figured out what the meaning of life is yet and all of them are kind of living on the edge. All are attempting to get by with what they have, but what it ultimately comes down to is that none of them really knows the answers. Maybe some have become more successful than others but deep down they are all scared of life. Now I don't know about other mid 20's people, but I can sure relate to what they are feeling and going through. And this movie made me feel like I am not the only one that may not have all the answers. If this is a film that you haven't seen in a few years, watch it. Admire what it wants to say. Take it for what it is. I really enjoyed what this film was about. And it made me feel a bit better about life, after all, we're all going through St. Elmo's Fire.",
         "St. Elmos Fire is a look at life of several friends who have just graduated college and are making the transition from frat parties and college football to real world decisions and backing up their degree. Although in hindsight this movie really isn't the best movie, I gave it a ten because at one time I could really relate to the characters sense of trying to redefine who they are. Demi Moore was definitely one of the weaker performances and you want to reach into the screen and smack her around for being such a half-wit snob. The rest of the cast did a really good job. The music from this movie is phenomenal. I think the reason I love this movie despite all its flaws is it makes me put my life in perspective and think about the friends and decisions I have made. Everytime I hear the love theme I can't help but feel sentimental. So all in all I gave it a hesitant 10 not for the performances, script or direction. I gave it a 10 because it hits home.",
         "I think Joel Schumacher gets a bad rap. Sure Batman & Robin is possibly the worst movie ever made, and it did kill a multi-million dollar franchise, but is that truly all we think about on the mention of his name? I myself will admit to keeping a stigma of hack whenever Schumacher is talked about, however, along with some decent films of late, his track record in the 80's was full of pure, nostalgic gems. I finally got the opportunity to check out one of my mother's favorite films, St. Elmo's Fire. Made at the height of Brat Pack fame, this film really gets the angst of college graduation and the life of responsibility and work that waits in the future right. While not as quotable or memorable as say The Breakfast Club, Schumacher still is able to take a moment in the youth of society and make something meaningful out of it. Maybe I can relate to it having just graduated from college two years ago, but I think that it would be relevant later on as well. Even if not, it is an accomplishment to last over twenty years and still be relatable to someone in that same position in the present day. So the film is chock full of stereotypes and clichés, does that make it not true? We have our striver for fame and notoriety at the expense of his ideals, the girlfriend who wants to make a career before settling down as a stay at home mother, the troubled artist who can't leave school behind for a real life, the self-obsessed flirt who would rather self-destruct than ruin the façade she has worked so hard to build, the love-struck indecisive one stalking a past love and changing himself to try and win her over, and the confused souls not quite sure what they want to do with their new independence. We have the drug use, the sleeping around, the comradery, and the heartbreak. Through it all, though, you can really buy into it and see moments in your own life that mirror the events on screen almost perfectly. I think a lot of this has to do with the times and the ability to use actors that are actually the age of the characters they are playing. This is a film about 23 year olds trying to find themselves, and the authenticity of having people that age, going through those things in their real lives, helps the performances to be truthful. Nowadays this would have been changed to a post- high school story with the 18 year olds played by actors 25 or older. It's the vulnerability and the childlike appearance that makes you buy into the story and want to follow it to the end to see if the friendships can remain intact. The star-filled cast does a great job throughout, and a film like this makes you wonder where these guys have gone. An actress like Ally Sheedy, who had the talent and the looks, pretty much fell off the map once the 80's came to a close. It is her and Andrew McCarthy that really carry the film. He is another that disappeared after Weekend at Bernie's. It is always nice to see this troupe of acting talent and what they were capable of in their prime. Emilio Estevez, Demi Moore, and Judd Nelson are all pitch-perfect in their roles along with Mare Winningham playing the friend that is so totally different from everyone else in the group, yet believable because we all have a friend like that. The only weak spot, in my opinion, is Rob Lowe, who at many times seems a bit out of his element as the drunk, party guy cracking jokes and getting into trouble. I don't discount his performances totally, though, because when he has moments of clarity, like when he talks Moore down after her total collapse, he is really excellent. Everyone goes through a moment of time in his/her life like the characters on screen in St. Elmo's Fire. Schumacher should be given credit for giving us a poignant study into the lives of those souls on the cusp of a new chapter in life and the decisions that need to be made to continue forward without regrets for what is left behind. The dialogue is realistic and it all ends in a conclusion that makes sense in the scheme of the character's evolutions. Your friends will always be there for you, through thick and thin, however, as you grow older, the roles each play in your life changes. Getting older doesn't mean severing ties to the past, but instead a restructuring of it to keep you strong and moving towards the future.",
         "A few comments here have slammed this movie for being shallow, despite decent performers. Maybe this is not 100% similar to real life. But it does have some parallels, and except for the Judd Neldon character (rather annoying) it is realistic and comedic in some aspects. Demi Moore as Jules is simply lost in denial borrowing money to keep up an image of success. They are 26 years old and have no clue what is in store. Andrew McCarthy likable and sympathetic. Ally Sheedy, just okay. Rob Lowe is very good as irresponsible Billy, involved with Mare Winningham, the resident unattractive 'old standby' girlfriend. There are some scenes reminiscent of a frat party. A few scenes with Emilio Estevez, pursuing a pipe-dream romance with Andie McDowell. Basically it addresses recent graduates floundering, attempting different careers and lifestyles, affairs and obsessions. It catches that time period most of us had, when we thought we were so significant in the world, not yet jaded, still trying to find meaning and hope. The Winningham character particularly conveys the aspect of the screenplay. When her father (Martin Balsam) tells her to just get married settle down and have a greeting card franchise (like the rest of her family) No I am committed to my real job, she says as she works as a social worker, still trying to have an affect. Similar to the later Generation X issues, and the now sense of alienation, everyone goes through similar growing pains, whether 80's materialism, 90's nihilism ('Reality Bites') or today's general alienation and violence. The issues are the same, the culture just manifests them a bit differently. 8/10",
         "Seven friends -- fresh out of college and in their mid-20's -- find themselves struggling with real-life issues such as breaking away from an over-bearing family, getting married, raising children, finding a career, finding love and creating an identity, all while trying to maintain a tight-knit friendship with one another as they booze it up at \"St. Elmo's,\" a bar that perhaps served as the grandfather to the coffee shop in \"Friends\" or even the pub in \"How I Met Your Mother.\" They laugh, they fight, they learn, and by the end of the flick, things have changed, but their \"fire\" has remained. You might recognize three stars of \"The Breakfast Club\" -- Judd Nelson, Ally Sheedy and Emilio Estevez -- who have magically turned into college grads, and alongside Andrew McCarthy, Demi Moore, Rob Lowe and Mare Winningham, round out the solid cast of \"St. Elmo's Fire.\" A good decade before bringing a perfectly good \"Batman\" franchise to its knees, writer/director Joel Schumacher did what few films could do with the \"Brat Pack\" in tow. That is, he created a film that dared to be over-dramatic and dared to touch upon the ugliness of growing up long after the security of school and family has faded. While some characters and their stories are questionable (Emilio Estevez, I'm looking at you), the little stories that make up their day-to-day life are, for the most part, stuff that everyone goes through, and none of the actors seem ashamed to look ridiculous in portraying the selfish, the immature and the inexperienced. For the most part, the characters feel real, and that's why the film works as well as it does. Perhaps it's a little too over-dramatic and self-indulgent for its own good, but maybe that's the point. All seven characters are colorful, albeit, horribly flawed human beings, and it shows in the most awkward and endearing moments of the film. You may not understand their decisions or why they choose to bring so much drama down on themselves, but you'll at least relate to it in one way or another. How you interpret and appreciate the film rests both in your position in life and whether or not you can recognize the biggest flaws in yourself. It's a film that will speak volumes to anyone fresh out of college, in their 20's or with the hindsight to realize how silly and self-made much of the drama in their life has been.",
         "Perhaps one must be of a certain age to truly appreciate this film. The \"self-absorbed\" comments seem to spring, in my mind, from older (middle-aged or elderly) viewers, or maybe just from grad students who are frightened that their prof may be reading their dissertation on this film. In my experience as a 30 year old woman, most young people who are in their twenties are self-absorbed. I think it's a natural and necessary part of thriving in the current United States' culture. I saw this movie in my late teens, and it made a tremendous emotional impact on me. I did not see the characters as shallow, superficial, or selfish, but just as regular people like myself and my friends. Even now that I have left my twenties, I can go back and still appreciate St. Elmo's Fire; not just for the 80's nostalgia (though that is a big draw, I must admit) but because I perceive the characters as living stories that I can identify with in parts. Especially as a slightly more mature adult, I can look back and say, \"Yeah, I remember going through that.\" or \"I knew someone like that five years ago.\" St. Elmo's Fire will always have a place in my heart for what it represents to my generation, and to the generation that actually came of age during the film's premiere. Maybe one had to grow up in the 80's - whether in childhood or adolescence - to enjoy St. Elmo's Fire. Okay. So it's not timeless. Who cares? There are some great scenes in this flick and it's a fun watch, even though it always makes me cry.",
         "It is my firm belief that one's enjoyment of the film 'St. Elmo's Fire' is directly proportional to one's enjoyment of the titular song by John Parr (also featured in the film). If you dislike this particular song, then consider avoiding this movie. If, on the other hand, you like the song, then you'll get at most 2-3 minutes of enjoyment out of the movie. This is the film that effectively launched The Brat Pack to national stardom (in tandem with 'The Breakfast Club', but in all fairness, that one was at least a halfway decent movie). Named after the group's favorite college town watering hole, 'St. Elmo's Fire' gives us a schmaltzy, soapy, melodramatic glimpse into the lives of 7 freshly graduated college students and their trials and tribulations as they face adult life. Robe Lowe is your typical party animal who's afraid to admit he's someone's father. Judd Nelson wants Ally Sheedy to marry him already (so he can stop cheating on her ...... the hell-?), but Sheedy's freaked because Nelson just went Republican. Mare Winningham's the sheltered rich girl (let's not forget she's still a pure virgin) who just wants Rob Lowe. Emilio Estevez is madly in love with a doctor (Andie MacDowell) and would do anything (including stalking) to tap that. Andrew McCarthy is in love with Ally Sheedy, but she's in love with a lascivious prick. Then there's Demi Moore who prostitutes herself to her boss (to solve those pesky credit problems) and lives from day to day just to get some more of that great coke. But none of that means a thing because there's not a single likable character in the movie. Not one. At best, these are children masquerading as real world adults. Each one is self-centered, hyperbolic, and completely out of touch with the world around them. It's fitting that there's a hot young cast carrying this thing because they're just pretty people with problems. And that's the fundamental problem with this film: there's simply nothing to draw us in. When Demi Moore has an emotional crisis, we don't care. When Rob Lowe does something stupid, we don't care. When Estevez pines, Nelson's a d-bag, Sheedy's incompetent, McCarthy whines, we don't care! And that's when you know that the screenplay has torpedoed the film: when characters are so poorly written that no hot young faces can make them interesting. This patient's dead on the table. Schumacher has given us a film that represents the worst in '80s filmmaking. It's a shallow, self-important mess of a film with no redeeming message or value. It aspires to say something important and ends up wasting everyone's time. It's the kind of movie that makes you wish violence upon the actors. Bloody awful. 2/10",
         "How does a Brat-Pack movie wind up on a top ten list alongside Citizen Kane and Gone With The Wind? Simple: it's real and it works. I've been there, and so has Joel Schumacher and the Pack. I will never forget seeing this movie for the first time. I was two months out of undergrad school, in a strange town on a new job in a brand new professional career. I went to see it by myself, and during that time the Brat Pack jumped off the screen to connect with me in a way that few movies do. This warm and deeply sympathetic treatment of changes in a young person's life is Hollywood come to life in rare form. Say what you will about the eighties; I say St. Elmo's is about life, and it's basic concept is timeless. This is a masterful movie, masterfuly crafted by a Director and cast of brilliant artists. Not to mention the soundtrack...I still get goosebumps when I hear \"Man In Motion\", even back-to-back on my CD player with \"Bach's Tocatta and Fugue in D minor\". Hey, find what you like and stick with it! Call it what you will, but it works, for a lot of people! Brat Pack, with all your warts and short-comings, I salute you, I salute US, because you made me one of you in your crowning achievement. Thank you!",
         "'St. Elmo's Fire' looks at life after college of seven best friends. Even though I didn't go to college in the 80s, the movie brought a lot of memories and I can still relate to many of the conflicts the characters experience. I don't understand why so many people disliked it. It's very much a character driven piece and while many argue that the they are self-absorbed but who isn't at least a little self-absorbed at that age? These characters are trying to find themselves in the 'new' real world of grown-ups. All seven friends are of distinct personalities and even though they are a little clichéd, they remain real and are well played. The friends include: -Kirby (Emilio Estevez) who is so desperately 'in love' with a past love that he even changes himself to win her heart. -Billy (Rob Lowe) who is talented, unstable and unpredictable -Kevin (Andrew McCarty) who is following a love that is with someone else. -Jules (Demi Moore) who is the self-destructive flirtatious one striving to protect her outer image while she destroys herself internally. -Alec (Judd Nelson) who is climbing the ladders of success and screwing 'nameless' and 'faceless' chicks while still desperate to marry his girlfriend to make his life perfect. -Leslie (Ally Sheedy) is the girlfriend who wants to have a career of her own before settling down for marriage bliss. -Wendy (Mare Winningham) who is the most selfless one, a frustrated virgin who is striving for independence and love. The actors are brilliantly cast as they fit the parts physically (the right age and looks) and deliver sincere performances. I won't single anyone out as I thought they all did excellent. The supporting cast does not have much scope except for Andie McDowell (who is quite bad). The 80s were known to be a wild and reckless decade for the young ones where it was all about rock and roll, big hair and felt-tips. Foster's soundtrack wonderfully adds to that nostalgic feel of that decade. Through their lives, Schumacher presents different themes such as drugs, alcohol, sex, loyalty, etc. It sounds like just another one of 'those' movies but here it is dealt with in a very real and easily relatable way rather than being overdone. Everyone will recognize at least a couple of the conflicts the characters face. I loved the way it ended. There is no definitive conclusion. Instead, what is shown is that the characters are aware that now it is time to grow up and to build their own lives while an uncertain future awaits. It's a great movie."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Delphi IV Productions"
      ],
      "summaries": [
         "Seven friends - Alec, Billy, Jules, Kevin, Kirby, Leslie and Wendy - are trying to navigate through life and their friendships following college graduation. Alec, who aspires to political life, has just shown his true colors by changing his allegiance from Democrat to Republican, which freaks out girlfriend Leslie, who he wants to marry. Budding architect Leslie, on the other hand, has an independent streak. She believes she has to make a name for herself to find out who she is before she can truly commit to another person in marriage. But Leslie and Alec have decided to live together. Because Leslie refuses to marry Alec, he believes that justifies certain behavior. Kirby, who wants to become a lawyer and who pays for his schooling by working as a waiter at their local hangout called St. Elmo's Bar, and struggling writer Kevin are currently roommates. They are on opposite extremes of the romance spectrum. Kirby has just reconnected with Dale Biberman, a slightly older woman he knew in college who is now a doctor. He is madly in love with her and will do *anything* to impress her. Kevin, on the other hand, doesn't date and states he doesn't believe in love, making his friends speculate that he's a closet homosexual who is secretly in love with Alec. Kevin will eventually open himself up to the one friend who matters the most. Billy, married with a child, is the irresponsible one of the group who would rather sleep around and play the saxophone than face the realities of being an adult with family commitments. He still lives for the memory of his fraternity glory days. Virginal and sheltered Wendy, who comes from a wealthy family, works in a low paying social services job. Her family provides for all her financial needs. She is in love with Billy, who in turn takes advantage of her adoration of him. And most are concerned about Jules, who works in a bank, lives a life of excess in all facets and doesn't have the financial means to live that lifestyle. The question for all seven becomes whether their friendship can survive adult real life.",
         "A group of friends, just out of college, struggle with adulthood."
      ],
      "budget": 0
   },
   "movielensId": 2146,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-06-20",
      "dvdReleaseDate": "2001-11-20",
      "directors": ["Joel Schumacher"],
      "runtime": 110,
      "movieId": 2146,
      "title": "St. Elmo's Fire",
      "mpaa": "R",
      "actors": [
         "Emilio Estevez",
         "Rob Lowe",
         "Andrew McCarthy",
         "Demi Moore",
         "Judd Nelson",
         "Ally Sheedy",
         "Mare Winningham",
         "Martin Balsam",
         "Andie MacDowell",
         "Joyce Van Patten",
         "Jenny Wright",
         "Blake Clark",
         "Jon Cutler",
         "Matthew Laurance",
         "Gina Hecht",
         "Anna Maria Horsford",
         "Elizabeth Arlen"
      ],
      "imdbMovieId": "0090060",
      "originalTitle": "St. Elmo's Fire",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Y46Sw1BUHPs"],
      "plotSummary": "Seven friends - Alec, Billy, Jules, Kevin, Kirby, Leslie and Wendy - are trying to navigate through life and their friendships following college graduation. Alec, who aspires to political life, has just shown his true colors by changing his allegiance from Democrat to Republican, which freaks out girlfriend Leslie, who he wants to marry. Budding architect Leslie, on the other hand, has an independent streak. She believes she has to make a name for herself to find out who she is before she can truly commit to another person in marriage. But Leslie and Alec have decided to live together. Because Leslie refuses to marry Alec, he believes that justifies certain behavior. Kirby, who wants to become a lawyer and who pays for his schooling by working as a waiter at their local hangout called St. Elmo's Bar, and struggling writer Kevin are currently roommates. They are on opposite extremes of the romance spectrum.",
      "tmdbMovieId": 11557,
      "avgRating": 3.16891,
      "releaseYear": "1985",
      "numRatings": 3570,
      "posterPath": "/h1bsWIQedOvYQyLVNCzOHHMDxYG.jpg"
   }
}