{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "house",
         "id": 6095
      }],
      "imdb_id": "tt0093220",
      "video": false,
      "title": "House II: The Second Story",
      "recommendations": [
         38084,
         11415,
         52868,
         15158,
         33061,
         23730,
         40342,
         18086,
         19158,
         36599,
         28090,
         16146,
         16139,
         16288,
         18111,
         26953,
         12521,
         24929,
         15762,
         47038
      ],
      "backdrop_path": "/7Gn9Q4G511ATmHXsnkfvtvDvfGb.jpg",
      "revenue": 7800000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jesse",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c35",
               "name": "Arye Gross",
               "profile_path": "/ha4ziYlBSBBHs88ltnamOKLZ084.jpg",
               "id": 72028,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c39",
               "name": "Jonathan Stark",
               "profile_path": "/Alykv40kPzEeJAiDdKmv4TzX4B3.jpg",
               "id": 119941,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gramps",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c3d",
               "name": "Royal Dano",
               "profile_path": "/5kHyvS5Xaa97Lulrxy0ZgtqHqMI.jpg",
               "id": 19968,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "John",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c41",
               "name": "Bill Maher",
               "profile_path": "/4BSBrFCcRYJD0lVb1fyb5dxiiFu.jpg",
               "id": 74086,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c45",
               "name": "John Ratzenberger",
               "profile_path": "/yGechiKWL6TJDfVE2KPSJYqdMsY.jpg",
               "id": 7907,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Rochelle",
               "gender": 1,
               "credit_id": "59dc7313c3a368620d062d13",
               "name": "Jayne Modean",
               "profile_path": null,
               "id": 152353,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe46529251416c91050c49",
               "name": "Lar Park Lincoln",
               "profile_path": null,
               "id": 64719,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jana",
               "gender": 1,
               "credit_id": "52fe46529251416c91050c4d",
               "name": "Amy Yasbeck",
               "profile_path": "/c7WOXDlKE9cwTBjpUtCKFPqnptr.jpg",
               "id": 1219,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Sheriff",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c51",
               "name": "Gregory Walcott",
               "profile_path": "/oTGgXPEOqGR8Yu7N9mRSaWLbMkE.jpg",
               "id": 41279,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Clarence",
               "gender": 2,
               "credit_id": "52fe46529251416c91050c55",
               "name": "Dwier Brown",
               "profile_path": "/qipSMklcWJtFjxILumRzywancMt.jpg",
               "id": 23974,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Virgin",
               "gender": 1,
               "credit_id": "52fe46529251416c91050c59",
               "name": "Devin DeVasquez",
               "profile_path": "/aHkt6wAhWx1YhCOoqX10nNRJr0o.jpg",
               "id": 88526,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46529251416c91050c2b",
               "name": "Ethan Wiley",
               "profile_path": null,
               "id": 69331,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46529251416c91050c31",
               "name": "Fred Dekker",
               "profile_path": null,
               "id": 44056,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe46529251416c91050c5f",
               "name": "Sean S. Cunningham",
               "profile_path": "/n2NNVtKE42SNGm9q75IknMZhMtr.jpg",
               "id": 35475,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "588fd7a9c3a3687f12000039",
               "name": "Phil Tippett",
               "profile_path": "/2uQ0B7fN5cDQk17J1X3pxDSf9y.jpg",
               "id": 7727,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.134606,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37530,
      "vote_count": 82,
      "budget": 0,
      "overview": "Young urban professionals Jesse (Arye Gross) and his girlfriend Kate (Lar Park Lincoln), move into an old mansion that has been in Jesse's family for generations. They are soon joined by Jesse's goofy friend Charlie (Jonathan Stark), who brought along his diva girlfriend Lana (Amy Yasbeck), in the hopes of being discovered by Kate, who works for a record company. Jesse has returned to this old family mansion after his parents were murdered when he was a baby. While going through old things in the basement, Jesse finds a picture of his great-great grandfather (and namesake) in front of a Mayan temple holding a crystal skull with jewels in the eyes. In the background is a man Jesse learns is Slim Razor, a former partner of his great-great grandfather turned bitter enemy after a disagreement over who would get to keep the skull.",
      "similar": [
         209244,
         6795,
         57431,
         428449,
         12536,
         8491,
         6404,
         9378,
         10172,
         1970,
         12609,
         10331,
         11096,
         10466,
         88042,
         10402,
         166271,
         37227,
         10758,
         34106
      ],
      "original_title": "House II: The Second Story",
      "runtime": 88,
      "poster_path": "/gv4mBZfv09eEW4Sv5ZZmalMDYlA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sean S. Cunningham Films",
            "id": 17611,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "New World Pictures",
            "id": 1950,
            "origin_country": ""
         }
      ],
      "release_date": "1987-05-14",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": "/ifZA8CtbMf072z71m1ijQHXGe78.jpg",
         "name": "House Collection",
         "id": 102782,
         "poster_path": "/pZhCkFoFyK8VIEuglkv78XDy0h3.jpg"
      },
      "tagline": "It's an all new house with brand new owners",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ethan Wiley"],
      "runtime": 88,
      "synopsis": "In this sequel, a young man inherits a house and invites his friend to move in with him. A series of mysterious (and humorous) events leads him to his great-grandfather, who has been kept alive by a magical crystal skull. The skull is stolen, and mayhem ensues.",
      "writers": [
         "Fred Dekker",
         "Ethan Wiley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093220/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxOTg4NjQwMV5BMl5BanBnXkFtZTYwNTYzNzA5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Arye Gross, Jonathan Stark, Royal Dano | See full cast and crew »"],
      "reviews": [
         "This non-related sequel is so sweet-natured, so tame and family orientated that to assume otherwise is completely ludicrous. There is nothing in this movie that could possibly rate it above a PG, max. I wouldn't even have reservations letting younger children watch House 2. A new house has a 20-something yuppie called Jesse (Arye Gross) move in with his girlfriend Kate (Lar Park-Lincoln). His friend Charlie (Jonathan Stark), a music agent, arrives with his new diva discovery Jana (Amy Yasbeck) to help him thru the unfamiliar first few days. The house is where Jesse's parents were killed when he was just a baby and it full of many curiosities. Crafted in a bizarre Gothic-Aztec style the house itself is a marvellous set and the many rooms and passages are as mysterious to us as they are to Jesse. Sitting on one of his many mantelpieces is a crystal skull that fascinates him for some reason. He even misses his housewarming party while studying the skull's history. His studies lead him to dig up the grave of his great, great grandfather, or Gramps (Royal Dano), where he discovers the old coot isn't dead just in limbo. The person who possesses the skull is granted eternal youth but it also warps the space-time continuum within the House. Gramps comes home with Jesse, is more enthralled by Kleenex boxes and TV than the mysteries around him and ducks for cover whenever someone from another time comes to steal the skull. Just like the first movie different rooms lead into different time zones. Jesse and Charlie have many hilarious adventures battling caveman, dinosaurs, Aztecs an evil cowboy called Slim. The one that killed Jesse's parents and betrayed Gramps over a century ago. House 2 has so much careless abandon and zany plot twists that it is totally impossible not to love this movie. The huge success of the first movie meant that this one was put into production literally and hour later and Ethan Wiley was given the budget and green light to do whatever he wanted. How often does happen today? Usually it would make for a bad movie considering this was the first movie Wiley directed. But it makes for an unusually cute and light-hearted supernatural romp. One of the weaker aspects of this sequel is that it has more SFX and animation by Phil Tippet's stop-motion workshop and less by Dreamquest. The matte paintings are gorgeous but the dated dinosaurs look hokey in a few shots. If you can just squint during these moments you won't notice. Bill Maher from TV's \"Politically Incorrect\" even manages to show up as a music producer who is interested in Yasbeck and mighty suspicious of Jesse's antics. John Ratzenberger (this makes both movies star one of the \"Cheers\" barflies) appears as a repairman/adventurer who assists Jesse and Charlie battle some Aztecs. Look out for Kane Hodder (Jason) in an ape costume. Jesse adopts a fluffy, little baby pterodactyl and a strange creature called a Caterpuppy, a cross between...well you know. You need an open mind and a suspension of disbelief to swallow the outrageous goings on in this movie. The commentary is better than the one on the first movie. Ethan Wiley and Cunningham get on well and have no quibbles pointing out how crazy the film is. They discuss the budget, tell tales of the late Royal Dano and explain how many of the effects were pulled off within the constraints of the budget. One of the most interesting things they mention is that even tho the movie was stuck in between The Color Purple and Beverly Hills Cop II the kids still preferred House 2 as their fave movie of the summer. But because the movie didn't have it's own opening weekend, unlike the original, it wasn't as successful. Didn't stop 2 more sequels being made. A theatrical trailer is also included. Much like the first film the picture has been brilliantly transferred onto DVD. The 1.85:1 anamorphic picture looks super with very few glitches. Colors are rendered with pleasant accuracy and you wouldn't believe the low-budget origins when judging this picture. There is some grain during darker scenes but other than this the movie is looking great. The Mono soundtrack is not terribly engaging and most of the film's sound is centre-channel biased. But there's no hiss or pop to worry about. It may be Mono but it's clean and fresh sounding to me.",
         "Although a lot of people said this was a bad movie, I liked it. It had great special effects and good acting. This was not as good as the first HOUSE movie, but I still liked it. It was funny (but maybe a bit silly.) and entertaining. I recommend this movie. Not as good as the first, but still fun, with great effects and humor. Not bad, and pretty cool.",
         "This film is a fun, under-watched gem from the 80s. Fans of the first House have a lot to enjoy here. Certainly one of the only horror/comedy/westerns I can think of, but it works well in this picture. Don't expect Citizen Kane, but if you're looking for an enjoyable little flick, you won't be disappointed. Interestingly, this film follows in the footsteps of the original House by casting a member of Cheers in a small role. In House, it's George Wendt, and in this film we get an amusing, if brief, appearance by John Ratzenberger. Jonathan Stark puts in an amusing performance as the Jim Carrey-esquire buddy, and Bill Maher shows up as well.",
         "House II: The Second Story (no pun intended, I'm sure) is a great example of lighthearted horror. I've loved this movie since I was a kid. I applaud Ethan Wiley, who also wrote the original, for making a sequel that is good enough to carry on the House name. A lot of people are blown away by the fact that this movie has nothing to do with Roger Cobb or his house. But what they were trying to do with this series was to inspire an anthology of haunted house movies, and not staying with the same house. Although having nothing to do with the original, House II still manages to continue its inventive legacy. For example, look at the scene where the cupboard pops open to reveal an ironing board. That's a conventional horror scare tactic and yet, it's not a cat that popped out. It's more creative than most genre pictures. Another tradition they seemed to maintain was having a Cheers cast member in the film. This time it's John Ratzenberger. Did you ever think you'd see Cliff Clavin fighting amazon warriors? House II is a very funny film too. There's more comedy in this one, but it's not over the top. The cast helps to make the comedy work. Royal Dano gives a great performance as the kindhearted Gramps. He plays the funny parts just right, and has those sad eyes in other scenes that make you feel sorry for his character. The comical tag team of the heroes, Arye Gross (Soul Man) and Jonathon Stark (Fright Night) works well. But what in the hell is Bill Maher doing in this movie? And why wasn't he killed? The best lines of dialogue are between Jonathon Stark and Bill Maher: Maher: \"Who's your friend, Bozo the Clown?\" Stark: \"No, Bozo the Death Machine.\" And I can't forget to mention Harry Manfredini's score. It holds the movie together no matter what scenario you've just been thrown into. House II deserves more respect than it gets because it's a good horror/comedy (which is rare)...and your kids can enjoy it too. Note for genre buffs: Kane Hodder was the stunt coordinator for House II and did a cameo as the gorilla guy. Dwier Brown, who plays Clarence, appeared in the first House as the Lieutenant in the Vietnam scenes.",
         "Another house, another set of house-guests. Although the first few scenes make you wonder if the movie was worth seeing, you're soon captivated by this movie. \"House II\" continues the comedic tradition set forth in the first \"House\". Arye Gross is as excellent as ever as Jesse, the new owner of the house, and Jonathan Stark, best known for his voice abilities in animated shows, is without equal in his role as Jesse's quirky and weird friend Charlie. This movie will take you from the Wild West to the ancient Aztecs to the Crustaceous Period to the present time (October 30, 1986 in the movie). Charlie and Jesse get involved in one absolutely hilarious adventure after another. Like \"House I\", this movie is horror with a comedy bent, and doesn't have the nudity, language, or extreme violence that categorized most horrors of the eighties. It's good, clean fun. Sure, there's a few long-dead guests, but they're basically harmless. Add to the thrill some humorous, and well-done, special effects, and some interesting new pets, and you've got a winner! If you enjoy \"House II\", it would be worth your while to check out \"The Never-Ending Story\" -- they work on a similar bent of fantasy and comedic special effects to catch your interest. Some viewers may also enjoy movies like \"The Adventures of Pecos Bill\". and more die-hard horror fans might also like \"Tales From the Crypt Presents Demon Knight\"",
         "* MINOR SPOILERS FOLLOW * Others have panned this one as \"forced\" and \"stupid.\" I could not disagree more! I absolutely loathed the original 'House' movie, and found the second one to be a wonderful mix of Quality Silly and pretty decent storytelling. Heck... Where else are you going to come across an electrician who keeps a sword in his tool kit, and is a cross-dimensional adventurer at heart, or someone wrestling with a baby pteranodon -- or 'pterodactyl' if you prefer -- for a crystal skull? Sure, the film has its weak points. The ending could have been expanded on, perhaps even re-done, and I'll never stop wanting better FX. 'House II,' though, makes for a good watch, and I don't give a flying banana what the other 'critics' say about it.",
         "1987's \"House II: The Second Story\" really isn't that good of a horror film really more of a screwball spoof comedy that's cheap made and it doesn't follow the originals plot and the storyline is much different with unheard of actors at the time. You have a story that revolves around a murder that took place in a house 25 years ago, then it picks up to the present day with Jesse(Arye Gross) all grown up so he returns to his house where his parents were murdered too. Soon after moving in the old mansion style home with his close friend party animal and craved sex guy Charlie(Jonathan Stark) they discover the history and treasures of the house, and that Jesse's grandfather was an old west legend with a storied past. Yet that past comes back to haunt them after grandpa returns to life as an old friend he had a falling out with returns to settle the score old western gunfire style! Really the movie is campy and has a lot of funny parts not a lot of fright, and many of the stars were not well known. Yet some memorable cameos include now political spin talker Bill Maher as a record promoter, and \"Playboy\" POTM miss June 1985 the sexy Spanish and Cajun beauty Devin Devasquez she has a small part. Really nothing great but always watchable especially late at night for some entertainment fun.",
         "If you liked Army of Darkness... you will want to see this movie! This movie is a comedy, horror, fantasy type similar to \"Army of Darkness\". House 2 however, has nothing to do with the original release of \"House\". It is a stand alone movie. Good acting and a creative story line make this well worth watching!",
         "I love this movie because it just keeps getting goofier and goofier and throws all sorts of disparate elements into the mix. You have the the great old mansion, you have the nutty friend, you have the obligatory 1980's party segment but you also have alternative universes, pterodactyls, feuding Wild West zombified cowboys and one of the cutest creations in filmdom the caterpuppy!! Arye Gross is right for the lead and has great comic timing,Jonathan Stark is very funny as Gross' wacky party buddy and Royal Dano takes the prize as Gross' zombified great-great grandfather who had discovered a crystal skull that creates all the ensuing havoc!There are also two great supporting roles for John Ratzenburger(from Cheer's) as an electrician/adventurer and Politically Incorrect's Bill Maher as a smarmy record exec. Watch out for some imaginative special effects that bring to mind the work of Ray Harryhausen (like the skeletal horse ridden by Royal Dano's nemesis) and the super cute caterpuppy! If every scene doesn't work it hardly matters as it is always an enjoyable and wild ride. Watch this for a dose of imaginative fun.",
         "Sequels so often repeat a lot of the previous film and lack in imagination. Most are just made to milk more money out of the title and today not much has changed. However, sometimes they can be a real surprise and take things in cool and unexpected directions. The first 'House' was a success financially and with audiences, not so much with critics, and so naturally a sequel would be made. But instead of bringing back the same characters and putting them in a different house, the makers of II sort of took the same route as 'Halloween III: Season of the Witch' did and introduced new people in a new situation. The result is not as good as the first, but a good little movie in it's own right. Pros: Good work by the cast, obviously having a ball. Another solid score by Manfredini, different yet with a similar flavor to the first. Really cool and unique house, inside and out. Fantastic make-up and special effects. Some really fun set pieces. The humor is sillier this time, but much of it works. Fast paced from beginning to end. Like the original this one is full of creative vitality. Cons: Not much in the way of plot. If you expect to be scared you'll be let down. Pretty dated. Some of the humor is just too silly and falls flat. Final thoughts: The makers of this film were really smart to not repeat themselves. Of course, some will likely be disappointed that this is less a Horror/Comedy and more a Comedy/Fantasy/Adventure movie. However, if you can get past that then you may enjoy this second chapter in the 'House' legacy. There is surely no lack of fun or surprises in the film's 85 minutes. My rating: 3.5/5"
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["New World Pictures"],
      "summaries": ["The new owner of a sinister house gets involved with reanimated corpses and demons searching for an ancient Aztec skull with magic powers."],
      "budget": 0
   },
   "movielensId": 2149,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "1987-05-14",
      "dvdReleaseDate": "2001-06-26",
      "directors": ["Ethan Wiley"],
      "runtime": 88,
      "movieId": 2149,
      "title": "House II: The Second Story",
      "mpaa": "PG-13",
      "actors": [
         "Arye Gross",
         "Jonathan Stark",
         "Royal Dano",
         "Bill Maher",
         "John Ratzenberger",
         "Jayne Modean",
         "Lar Park Lincoln",
         "Amy Yasbeck",
         "Gregory Walcott",
         "Dwier Brown",
         "Devin DeVasquez"
      ],
      "imdbMovieId": "0093220",
      "originalTitle": "House II: The Second Story",
      "genres": [
         "Fantasy",
         "Horror",
         "Comedy"
      ],
      "youtubeTrailerIds": ["5ouvkZzJ-Nc"],
      "plotSummary": "Young urban professionals Jesse (Arye Gross) and his girlfriend Kate (Lar Park Lincoln), move into an old mansion that has been in Jesse's family for generations. They are soon joined by Jesse's goofy friend Charlie (Jonathan Stark), who brought along his diva girlfriend Lana (Amy Yasbeck), in the hopes of being discovered by Kate, who works for a record company. Jesse has returned to this old family mansion after his parents were murdered when he was a baby. While going through old things in the basement, Jesse finds a picture of his great-great grandfather (and namesake) in front of a Mayan temple holding a crystal skull with jewels in the eyes. In the background is a man Jesse learns is Slim Razor, a former partner of his great-great grandfather turned bitter enemy after a disagreement over who would get to keep the skull.",
      "tmdbMovieId": 37530,
      "avgRating": 2.31882,
      "releaseYear": "1987",
      "numRatings": 712,
      "posterPath": "/gv4mBZfv09eEW4Sv5ZZmalMDYlA.jpg"
   }
}