{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "dog",
            "id": 15162
         }
      ],
      "imdb_id": "tt0140796",
      "video": false,
      "title": "Air Bud: Golden Receiver",
      "recommendations": [
         20755,
         21518,
         24794,
         20737,
         40344,
         276530,
         84604,
         102188,
         234416,
         210599,
         60823,
         40688,
         118430,
         68927,
         79783,
         34672,
         22779,
         56195,
         124042,
         55016
      ],
      "backdrop_path": "/9XqoGiKvldMxIKKpqkqh45yGjAE.jpg",
      "revenue": 10224116,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Josh Framm",
               "gender": 2,
               "credit_id": "52fe4423c3a368484e0118c3",
               "name": "Kevin Zegers",
               "profile_path": "/8IZWHzUElVhAyRqzWiCXzf7MHL4.jpg",
               "id": 7431,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Fred Davis",
               "gender": 2,
               "credit_id": "52fe4423c3a368484e0118c7",
               "name": "Tim Conway",
               "profile_path": "/non96yYuFTWnopBgNtj1MWcm0Z5.jpg",
               "id": 83414,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Phil Phil",
               "gender": 2,
               "credit_id": "52fe4423c3a368484e0118cb",
               "name": "Dick Martin",
               "profile_path": "/rXrU2Wm2GZIqMFu2Sq3NOO2bzL.jpg",
               "id": 87769,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Natalya",
               "gender": 1,
               "credit_id": "52fe4423c3a368484e0118cf",
               "name": "Nora Dunn",
               "profile_path": "/wX89q3KHGOe0z47LU6UmukgEdo7.jpg",
               "id": 4496,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dr. Patrick Sullivan",
               "gender": 2,
               "credit_id": "532ac64dc3a3681fdd001839",
               "name": "Gregory Harrison",
               "profile_path": "/luFhYgGEm2vLXQkplRHm88trg48.jpg",
               "id": 29370,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Jackie Framm",
               "gender": 1,
               "credit_id": "5a8144e40e0a262aa602f421",
               "name": "Cynthia Stevenson",
               "profile_path": "/4EClZk1ZIKe3SwcfFr5FrK0xd84.jpg",
               "id": 65528,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Popov",
               "gender": 2,
               "credit_id": "5a8144f1925141410102bc19",
               "name": "Perry Anzilotti",
               "profile_path": "/yV0dNPR1RRO6ygjXycS8uxMkMkg.jpg",
               "id": 156413,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Coach Fanelli",
               "gender": 2,
               "credit_id": "5a814501c3a36818ac029c8e",
               "name": "Robert Costanzo",
               "profile_path": "/vyUeNk56Yv7xyHztgVa8UBEIasu.jpg",
               "id": 33492,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4423c3a368484e0118bf",
               "name": "Richard Martin",
               "profile_path": null,
               "id": 87767,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54b40cf5c3a3680287001adc",
               "name": "Richard Trus",
               "profile_path": null,
               "id": 1410526,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "5a81455b0e0a262aa002f1c9",
               "name": "Paul Tamasy",
               "profile_path": null,
               "id": 86525,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a814565c3a36818cd02adfb",
               "name": "Aaron Mendelsohn",
               "profile_path": null,
               "id": 86526,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a81457b925141410a02b0ff",
               "name": "Mike Southon",
               "profile_path": null,
               "id": 25012,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a81458cc3a368189f02cba1",
               "name": "Robert Vince",
               "profile_path": null,
               "id": 61244,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a81459ec3a36818a702f1ab",
               "name": "Brahm Wenger",
               "profile_path": null,
               "id": 61247,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5a8145b80e0a262aa002f212",
               "name": "Melinda Friedman",
               "profile_path": null,
               "id": 1950851,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5a8145ca0e0a262aac0301e8",
               "name": "Bruce Lange",
               "profile_path": null,
               "id": 960061,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a8145d3925141410102bccc",
               "name": "Rex Raglan",
               "profile_path": null,
               "id": 1539893,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "5a8145e0925141410a02b146",
               "name": "Patricia Hargreaves",
               "profile_path": null,
               "id": 962063,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.171261,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 21661,
      "vote_count": 53,
      "budget": 11000000,
      "overview": "Josh and Buddy move from basketball to American football in this first of several sequels to the original Air Bud.",
      "similar": [
         10393,
         2300,
         9655,
         9291,
         86130,
         4942,
         11287,
         9598,
         10637,
         8923,
         22881,
         11528,
         13416,
         323677,
         11544,
         9614,
         42888,
         9472,
         11770,
         12230
      ],
      "original_title": "Air Bud: Golden Receiver",
      "runtime": 90,
      "poster_path": "/8iy8JlIgLPACRR32wzTJBpZ3iMk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/jEMVaCuEjQ3lzkhakWDKNVjwd9Q.png",
            "name": "Alliance Atlantis Communications",
            "id": 803,
            "origin_country": ""
         },
         {
            "logo_path": "/cXMoZ75Zu4EoA3fRADCLTDeXBk3.png",
            "name": "Dimension Films",
            "id": 7405,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Canadian Film or Video Production Tax Credit Fund (CPTC)",
            "id": 8582,
            "origin_country": "CA"
         },
         {
            "logo_path": null,
            "name": "Keystone Entertainment",
            "id": 37892,
            "origin_country": ""
         }
      ],
      "release_date": "1998-08-14",
      "vote_average": 4.6,
      "belongs_to_collection": {
         "backdrop_path": "/3iROV2GdrAFz6lbrGneQLt8lc7K.jpg",
         "name": "Air Bud Collection",
         "id": 97445,
         "poster_path": "/6uJ2GXA5kBskJx6emTuHyp2S3ww.jpg"
      },
      "tagline": "The Timberwolves Are About To Unleash Their Secret Weapon.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Martin"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Kevin DiCicco",
         "Paul Tamasy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140796/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNzcwMDMzN15BMl5BanBnXkFtZTcwMjA4OTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kevin Zegers, Cynthia Stevenson, Tim Conway | See full cast and crew »"],
      "reviews": [
         "This movie is in line with the first Air Bud. Not many sequels of this nature are tolerable let alone enjoyable. Air Bud: Golden Receiver is a movie that your whole family can enjoy. The movie centers around Josh Framm coming to terms with his mom's return to dating. Josh has to get used to the new man in his mom's life and a new sport for him and Buddy, football. Most people can relate to that being a difficult adjustment no matter how nice the man is. In this case it's the lovable Patrick Sullivan,DVM. The low point of this movie are the lampoonish villians Natalya and Popen. They try miserably to add slapstick comedy to this otherwise endearing film. A very notable scene is between Josh Framm and Coach Fanelli. The parts of Patrick Sullivan and Coach Fanelli were wonderfully casted.",
         "The story of Buddy, a dog, who can play basketball and even American football. Kevin Zegers stars as Josh, a young teenager coping with the loss of his father and guys, who try dating his mother Jackie. Buddy likes his new vet, Dr. Patrick Sullivan portrayed by Gregory Harrison and he arranges Jackie to \"bump\" into Patrick. It works and they take a liking to each other. Seeing this Josh doesn't want to be home much to see his mother act like a teenager in love so he decides to join the football team with his friend. Suddenly Buddy shows that he too can play, but at the same time there are two kidnappers around trying to find animals to act in their circus and they intend on snatching Buddy. When Josh's team the Timberwolves land in the finals with Buddy's help Patrick proposes to Jackie. Josh sees this he runs away from home and Buddy goes missing. I found it strange seeing a dog play for a team not that I live in America nor do I know too much about the rules to American football and I never thought I would see a dog play in a team, but miracles do happen...that and a good dog trainer...Good movie very suitable for kids.",
         "My daughter and I had a wonderful afternoon enjoying Air Bud, Golden Receiver. She recognized that the \"bad guys\" were really bad and that they were just acting. It was a great story with great morals! I had not seen the first movie but we enjoyed this one so much that we went right our and saw the first one. They were warm and both great family movies!",
         "Same basic story as part one, with young Josh finding out that his mom is getting remarried and the new guy brings him a football, but basketball is his sport. Soon he finds out Buddy (the dog) likes to play football and he and his friend Tom, who played basketball with him on part 1, join the team so Josh can get away from the new guy Patrick. Soon Buddy ends up on the team and Josh can't take someone trying to replace his dad so he runs away from home. A bunch of Russian circus freaks are kidnapping animals and kidnap Buddy and the coach finds Josh and tries to talk him out of leaving and to come back and play in the big game, even though Buddy is no where to be found. Same as part 1 basically. Wow, my dog can play a sport, and oh no, someones trying to take Buddy away...the only new factor is Patrick. I hate how they tried so hard to be like part one and offered nothing new. I hated that they ripped off scenes from 101 Dalmations and stole dialog from 2010 with the Russions saying \"piece of pie\" instead of piece of cake..I hate like on part 1 you can tell Buddy uses a soft ball and not the kind of ball the team uses, thats very obvious. I liked the coach here, but hated his lame pep talks to the team. The dog is less impressive here too, all he does is fetch basically. I hated also that Josh had runaway and the family was terrified, Patrick knows its his fault, so he leaves.. If you were a good man you would stay at least until the child is found then leave...stupid writing. I also hate how you know the team will win and it'll be a cheesy happy ending. Acting was OK here, Kevin Zegers is back as is Cynthia as the mom. Robert Castanzo did a great job as the coach and Tim Conway and Dick Martin did great as the sports announcers. Part 1 is okay for kids, but part two is just the same story over again with football in place of basketball...2/10 stars",
         "This is not a movie that I would recommend to adults to watch, however, if you have kids and you need to get the house clean with little distraction put this in the VCR. Kids have no problem seeing the same movie 50 times and this is one that they will not tire of. So pop it in and start cleaning your house...the kids will leave you alone...atleast for 90 minutes!",
         "I do really like this movie. It's not a good as the first movie, but it's very rare that a sequel is better than the original, other than Terminator 2, that's a given. But it is very common that sequels are not only, not as good, but intact, terrible. I really don't believe this is one of those cases. I do think this movie is a great watch for the whole family. Young children all the way up to seniors will enjoy it. I do hate how there is always someone who wants to capture Buddy, I mean it's likely that, that would happen in real life, but mean people stealing him, so he can be a sideshow act in a Russian circus. Come On. Overall, I give this movie a 7 out of 10.",
         "Fernfield, Washington teenager Kevin Zegers (as Josh Framm) is happy with the golden retriever he adopted in the first \"Air Bud\" movie. In this sequel, \"Buddy\" is still top dog on the basketball court - but, now, he will learn to play football just as well. It begins when veterinarian Gregory Harrison (as Patrick Sullivan) gives young Zegers and \"Buddy\" a football while courting widowed mom Cynthia Stevenson (as Jackie). Of course, Zegers does not want a new man taking the place of his father, who died in a plane crash before the events in \"Air Bud\" (1997)... The adults hit it off well, but are reluctant to hurt Zegers' feelings. Also complicating matters is a sub-plot to dog-nap \"Buddy\" by exotic animal thieves Perry Anzilotti (as Popov) and Nora Dunn (as Natalya). The Russian evil-doers are an obvious swipe of \"Boris and Natasha\" from the old \"Rocky & Bullwinkle\" show; but, they are less satisfying here. Better are over-eating coach Robert Costanzo (as Fanelli) and Zegers' fainting pal Shayn Solberg (as Tom Stewart). Veteran comedians Tim Conway and Dick Martin have fun announcing the big game. **** Air Bud 2: Golden Receiver (8/14/98) Richard Martin ~ Kevin Zegers, Cynthia Stevenson, Gregory Harrison, Robert Costanzo",
         "In Fernfield, Washington, Josh is not happy that his mother Jackie is now dating Dr. Patrick Sullivan, a veterinarian. His father's absence is apparently explained by a newspaper headline about a deceased test pilot. Hoping to get dirt on his nemesis, Josh and his friend Tom take Josh's dog Buddy to Patrick, pretending Buddy has a problem. They find incriminating evidence. After Patrick gives Josh a football as a present, Josh shows he has talent, and Tom tells Josh he should try out for the junior high football team. Josh makes the team as backup quarterback. Coach Fanelli's job is in trouble, though. He is not winning games and sports are expensive, so Principal Salter would rather cut them. If you know the Air Bud movies, it's not hard to figure out what will happen. Meanwhile, bumbling Russians Natalya and Popov drive an ice cream truck around the neighborhood, hoping to capture Buddy and add him to their collection of animals. This is a harmless enough family film (unless you're one of the stunt players--OUCH!). It's not going to win any awards, except maybe for being bad (I just feel certain people would have said it deserved worst film), but it's an enjoyable story. Between the hapless Russians and the football players, it's only slightly less violent than \"Home Alone\", but it's all good clean fun. Among human actors, I would say the best performance comes from Robert Constanzo as the coach. He never gives up, and he has a positive attitude. Fans of classic comics Tim Conway and Dick Martin have a treat as the legends serve as announcers at one football game. They make the Russians look like geniuses. I'm not entirely sure the writers took advantage of their talents, but if the objective was to make Martin look as dumb as any character in movie history, they succeeded. These two are fun even if they don't really show why they were great. The best actors in the movie played Buddy. I noticed four in the credits, and I suppose each one had a special ability. A chimp in the Russians' menagerie also deserves mention (no, I have no particular interest in chimps). Don't expect too much--just enjoy.",
         "My kids are 5 and 7 and they loved this movie. There is some wonderful slapstick comedy - especially with the pet-snatchers. Sure, to an adult the plot may be unbelievable, but this isn't aimed at adults. The dog is cute, the story is simple, and you feel good at the end. My kids were laughing and bouncing on the couch - a sure sign of a good movie. (Oddly enough, we got this free on DVD in a box of cereal.)",
         "This film is a shocking disappointment. It is nothing short of disgusting that this film was made. It has none of the believability or freshness of the original Air Bud film (which was a masterful achievement). The original is somewhat believable with a dog playing basketball, but a dog playing football? Come on, who do you think we are? This film takes all of the magic out of the original, and defiles it into its own twisted vision that I can assure you is COMPLETELY void of art. Whatever you do, do not see this motion picture."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Keystone Pictures",
         "Dimension Films",
         "Alliance Atlantis Communications"
      ],
      "summaries": [
         "The Golden Receiver picks up where Air Bud left off. Josh, now legal owner of Buddy, now plays football with Buddy instead of Basketball!!! The movie takes place in the same town of Ferfield, Washington.",
         "Now in the 8th Grade, Josh discovers he has a great throwing arm and tries out for his school football team. It is then soon discovered that his dog, Buddy, can also make impossible catches, and the two become an unstoppable force. However, an evil duo of Russian circus-managers attempt to kidnap Buddy and use him as their main attraction, while the Timberwolves make it to the championship. Can Josh save Buddy before the big game?",
         "Story of a golden retriever who can play football."
      ],
      "budget": 0
   },
   "movielensId": 2152,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-14",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Richard Martin"],
      "runtime": 90,
      "movieId": 2152,
      "title": "Air Bud: Golden Receiver",
      "mpaa": "G",
      "actors": [
         "Kevin Zegers",
         "Tim Conway",
         "Dick Martin",
         "Nora Dunn",
         "Gregory Harrison"
      ],
      "imdbMovieId": "0140796",
      "originalTitle": "Air Bud: Golden Receiver",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["FBFhdl17YJ0"],
      "plotSummary": "Josh and Buddy move from basketball to American football in this first of several sequels to the original Air Bud.",
      "tmdbMovieId": 21661,
      "avgRating": 2.0612,
      "releaseYear": "1998",
      "numRatings": 866,
      "posterPath": "/8iy8JlIgLPACRR32wzTJBpZ3iMk.jpg"
   }
}