{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "moving",
            "id": 18253
         },
         {
            "name": "beverly hills",
            "id": 163047
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "nursing school",
            "id": 208974
         },
         {
            "name": "nomad",
            "id": 208975
         }
      ],
      "imdb_id": "tt0120831",
      "video": false,
      "title": "Slums of Beverly Hills",
      "recommendations": [
         16980,
         12772,
         40562,
         24925,
         20096,
         14741,
         36136,
         33430,
         23570,
         12257,
         47692,
         14578,
         77469,
         26291,
         17600,
         29444,
         31016,
         76516,
         42719,
         47045
      ],
      "backdrop_path": "/l3cjRFKXaZR94dlhKsq8rQRwSpG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Vivian Abromowitz",
               "gender": 1,
               "credit_id": "52fe460d9251416c7506b7eb",
               "name": "Natasha Lyonne",
               "profile_path": "/8rhl25eCPQQFhv1Mvqe9eMP3MpS.jpg",
               "id": 10871,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Murray Samuel Abromowitz",
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b7e7",
               "name": "Alan Arkin",
               "profile_path": "/gcrKO2z0YVUXBXVeB9V8PndG0IJ.jpg",
               "id": 1903,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Rita Abromowitz",
               "gender": 1,
               "credit_id": "52fe460d9251416c7506b7e3",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Rickey Abromowitz",
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b7db",
               "name": "Eli Marienthal",
               "profile_path": "/eK4kfRpE12lCoCamBJWyHfWDDbq.jpg",
               "id": 116027,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rachel Hoffman",
               "gender": 1,
               "credit_id": "52fe460d9251416c7506b7df",
               "name": "Mena Suvari",
               "profile_path": "/xnc7WgBvfefwu3nJ5IkCjQrhPz0.jpg",
               "id": 8211,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Ben Abromowitz",
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b7ef",
               "name": "David Krumholtz",
               "profile_path": "/5171elOp1qFxf9c8DkpeyhHBB6d.jpg",
               "id": 38582,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Eliot Arenson",
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b7ff",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Belle Abromowitz",
               "gender": 1,
               "credit_id": "52fe460d9251416c7506b815",
               "name": "Rita Moreno",
               "profile_path": "/cpu3QeMGvbkBLmrFy8dUxEP7zdd.jpg",
               "id": 13299,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "54b864a39251411d6a003218",
               "name": "Carl Reiner",
               "profile_path": "/AtDqJQkl7dH2m19kPio3cosfbes.jpg",
               "id": 1895,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Doris",
               "gender": 1,
               "credit_id": "54b864d1c3a368141100026c",
               "name": "Jessica Walter",
               "profile_path": "/zPHpjVlg6nTKnyXWq8rreW6q1x.jpg",
               "id": 41232,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Belle",
               "gender": 1,
               "credit_id": "5943e1b6c3a3686bc902245f",
               "name": "Rita Moreno",
               "profile_path": "/cpu3QeMGvbkBLmrFy8dUxEP7zdd.jpg",
               "id": 13299,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe460d9251416c7506b7f5",
               "name": "Tamara Jenkins",
               "profile_path": "/xsfUx2TZ8DB9mhLrl8AsV5dICr3.jpg",
               "id": 54240,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe460d9251416c7506b7fb",
               "name": "Tamara Jenkins",
               "profile_path": "/xsfUx2TZ8DB9mhLrl8AsV5dICr3.jpg",
               "id": 54240,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b805",
               "name": "Michael Nozik",
               "profile_path": null,
               "id": 2948,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b80b",
               "name": "Stan Wlodkowski",
               "profile_path": null,
               "id": 51689,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe460d9251416c7506b811",
               "name": "Robert Duffy",
               "profile_path": null,
               "id": 56519,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.136613,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14662,
      "vote_count": 66,
      "budget": 5000000,
      "overview": "In 1976, a lower-middle-class teenager struggles to cope living with her neurotic family of nomads on the outskirts of Beverly Hills.",
      "similar": [
         19053,
         979,
         226,
         3134,
         1024,
         17612,
         2149,
         10212,
         11826,
         6075,
         634,
         4771,
         281,
         112160,
         339692,
         281957,
         258480,
         507,
         8067,
         39927
      ],
      "original_title": "Slums of Beverly Hills",
      "runtime": 91,
      "poster_path": "/u0690Aor60ZM7Zhg6rwUD1KvJOr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
         "name": "Fox Searchlight Pictures",
         "id": 43,
         "origin_country": "US"
      }],
      "release_date": "1998-08-14",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Growing Up is Hard to Do",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tamara Jenkins"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Tamara Jenkins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120831/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDI2OTY1NDU5MF5BMl5BanBnXkFtZTcwMTY2NzIzMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Natasha Lyonne, Alan Arkin, Bryna Weiss | See full cast and crew »"],
      "reviews": [
         "\"Slums\" is one of the more underrated films of the 1990s. It seems to rub some people the wrong way for unclear reasons, but I found it to be touching and hilarious from start to finish. Perhaps I'm just a sucker for Alan Arkin, whom I've always liked, and see on screen all to infrequently. More likely I was impressed by the witty script, deft direction and solid cast. I especially appreciated the spot-on portrayal of Southern California during the mid-70s, which just happens to be the era when I migrated from \"back East\" to Los Angeles. Fortunately, we weren't as hapless as the Abramowitz family, who throughout this film are trying desperately to hang onto the ragged edge of the good life. This is one \"coming of age\" story that you don't need to be a teenage girl to enjoy.",
         "THE SLUMS OF BEVERLY HILLS (3 outta 5 stars) I figured this was going to be just another silly movie about the trials and tribulations of spoiled rich kids in Cali. Actually it's a pretty good coming-of-age story circa 1976. Vivian (Natasha Lyonne) has just grown breasts and now considers herself deformed. Her dad (Alan Arkin) is a divorced man of almost-retirement-age who has never been able to provide a stable home for his kids and keep dragging them from place to place like nomads (and presumably keeping one step ahead of bill collectors). One brother is a struggling actor and the other is too young to really fit in anywhere. In a desperate attempt to make ends meet Arkin takes in his troubled 29 year old niece (Marisa Tomei), charging his rich brother a fee for keeping an eye on her. So they all move into a small, cheap Beverly Hills apartment block and try to cope. Very funny moments... punctuated by some heavy drama and some unexpected twists. One of the better roles that Alan Arkin had had in recent years... proving that he hasn't lost his touch as he's gotten older (unlike many other comic actors of his generation). I have never been much of a fan of Marisa Tomei but I liked her a lot in this movie. The scenes of her and Lyonne conversing in their \"secret language\" are priceless!",
         "Now, I am a middle aged male movie buff, and although I like and have watched lots of movies, and all kinds of movies, comedies are not that high on my list, generally speaking. When I read the tv guide, it said this movie was a comedy. So I tuned in, expecting to not be too excited about the movie. I tuned in about 10 minutes after the start of the movie, and gave the movie my partial attention. But within 2 or 3 minutes, this movie had my full attention. I could see right away this one was something special. It comes as close to depicting a genuine species of lower middle class family life as I have ever seen. It is a real gem. And it is not really a true comedy, although it is quite funny sometimes. It sort of defies definition or categorization. Sort of wry and humorous exploration of the dynamics of a typical struggling, lower-middle class family. No fancy camera angles. Not a special effect in sight (and I have enjoyed many movies with fancy camera angles and special effects--I am no snob). But this movie is cinema stripped to its bare essence. Just pure script and acting. And what a script. Marisa Tomei is incredible. She should have won the Oscar for this one. See it! BTW, I cannot believe the lady who scripted and directed this one has not gone on to do more directing or writing! What a waste of talent!",
         "For a long time, the depiction of the family unit in movies and on television was for the most part a sanitized, idealized representation, from movies like the Mickey Rooney `Andy Hardy' series and William Powell's `Life With Father,' to the totally stereotypical versions presented on TV in such shows as `Ozzie and Harriet' and `Father Knows Best,' which were entertaining, perhaps, but set standards that in reality were simply unattainable; a reflection of real life these movies/shows were not. There was the occasional film like `Rebel Without A Cause' or `The Young Savages,' which certainly explored conflicted individuals, but the focus was not on the `family unit' per se. Then gradually, all of that began to change; filmmakers evolved and the screen did begin to more accurately reflect the family dynamic in very real terms, for better or worse, and in 1998, `Slums of Beverly Hills,' written and directed by Tamara Jenkins hit the screen, with a depiction of the family unit that's about as honest as it gets. Murray Abromowitz (Alan Arkin) is 65 years old, divorced and raising three kids on his own. A car salesman, Murray is currently in a `slump.' In point of fact, however, his whole life has been one long slump. But he's determined that his children, Ben (David Krumholtz), Vivian (Natasha Lyonne) and Rickey (Eli Marienthal), are going to get a good education, and that means keeping them in the best schools. And that means living in Beverly Hills. It's one of the most `upscale' communities in the world, but he doesn't have to be rich to take advantage of the educational opportunities; as long as they live within the city limits, the kids stay enrolled. It's all a matter of having the right zip code. But there's the rub; it's just not as easy as it sounds, because even living on the periphery of Beverly Hills cannot be successfully effected without `means,' and `assets' of any kind are decidedly not a part of Murray's personal resume. Which means there has to be a plan. And Murray's plan is very simple: You stay one step ahead of the landlord and the monthly rent and you're home free. Which means moving. A lot. As in slipping out in the middle of the night with only as much as you can carry and moving on to the next `dingbat' apartment. And so is goes with the Abromowitz family, living a nomadic existence as part of a very real sub-culture in one of the richest areas on the planet. It's hard, but the kids are getting the education. Murray, however, suddenly has something else to deal with: Vivian, who is about to enter her freshman year at high school. And she is not a `little' girl anymore. To tell her semi-autobiographical story, writer/director Jenkins has crafted and delivered a thoroughly engrossing film steeped in nuance and gritty realism. It's an incisive portrait of how a dysfunctional family can survive by establishing parameters which allow them to get from point A to point B on a daily basis, and what it takes to maintain the kind of internal support system that enables them to function and stay together, though individually their goals and aspirations may be pulling them in opposite directions. it goes far in disproving the idea that a family in perpetual crisis must necessarily disintegrate. The story is told through the eyes of Vivian, which gives the film a decidedly personal resonance, as it is obvious that this is where Jenkins' heart resides. And it presents a mature perspective that effectively dispels the stereotypical characterization of the self-absorbed teen mired in the throes of paralyzing angst, which adds considerable credibility to this character driven comedy/drama. Jenkins also successfully captures an entirely genuine `sense' of the whole Abromowitz's environment; the look, texture and `feel' of the film is a reflection of reality, so much so that you can almost actually detect the scent of the apartments, the steaks cooking at Sizzler or that familiar clean/warm smell of the laundry room. An exceptionally insightful film, it sheds some light on the invisible threads that hold us together and keep the myriad facets of our society connected. What really brings this one to life, though, is the performances Jenkins exacts from her exceptional cast of actors, beginning with Lyonne, who so perfectly embodies the character of Vivian. This is the pivotal part of the film, and with her `natural' presence Lyonne delivers a convincing portrayal through which she precisely conveys exactly what she's thinking and feeling with a combination of facial expressions, body language and simply the inflection of her voice. As Murray, Arkin gives an extremely affecting and introspective performance, creating a character with whom many in the audience are going to be able to relate and identify on one level or another, as he taps into that sense of not quite being able to figure out how it all works, even after doing it day after day for sixty-five years. In Murray we see a very accurate reflection of the on-going process of sorting out `life'-- a process that, in reality, never ends. It's a performance that takes into account the inherent flaws of being human; it makes us realize that none of us are perfect, but that it's okay-- we just have to keep trying. One of the finest character actors in the business, indy favorite Kevin Corrigan turns in an effective, understated and unassuming performance as Eliot, the guy with whom Vivian has a `building thing' relationship. Also giving a memorable performance is Marisa Tomei, as Murray's niece, Rita, who is deliciously tacky and adds some real spice to the film. Her portrayal is earthy and utterly believable, and like Arkin's Murray, is an honest reflection of how most people grapple with the uncertainties of life. `Slums of Beverly Hills' is a viable exploration of the human condition; a film that helps us understand who we are, and why.",
         "Natasha Lyonne stars as a teenage girl growing up in various slums in Beverley Hills, but her family cannot necessarily afford to live in them. After moving around for most of her life, her family's finally found a place to call home with help from her uncle's money. The catch is that they have to watch after their troubled daughter (Marisa Tomei) and make sure that she makes a transition from drugs to a career worthy of their name. That's not spoiling so much, I don't think, because the movie has much more depth than that. This very original drama/comedy features a great, universal struggle of living without proper means and making life work. It's a coming-of-age film for Lyonne's character who sees the beginnings of her womanhood, struggles of relationships, and maintaining her family's name and reputation through whatever means possible. It's really touching how the Abromowitzes handle themselves and make each others' experiences memorable. The aging father (Alan Arkin) is truly memorable in this film for his struggles in finding out an end to poverty and loneliness without his wife. A great film altogether, not very long (only about 1 hr. 30 min), and easy to watch all the way through. Definitely a buy on DVD (even if the special features aren't all that special). I gave it an 8/10.",
         "The Slums of Beverly Hills is a coming-of-age story from the perspective of a young girl. Vivian, the protagonist, is the pubescent member of a roving band of urban gypsies in 1976 Beverly Hills. The band consists solely of her divorcee father, and two brothers; one older and one younger. They don't roam far, just in the confines of the Beverly Hills school district. They are joined by a rehab-fleeing, neurotic female cousin, who becomes a guide for the young Vivian, leading her through the sexual-emotional vicissitudes of teenagerdom. Very clever, and also very heartfelt, The Slums of Beverly Hills really connected with me. I felt for the family. The acting is top flight and this makes up for some grating story lapses. When in the mood for a comedy I highly recommend this movie.",
         "Very enjoyable movie about a family guaranteed to make yours look more appealing. Reminds us all why the 1970's should never be repeated. Several memorable lines from an outstanding cast. Underappreciated movie that deserves more recognition, highly recommend viewing for some adult humor.",
         "Slums of Beverly Hills is about a teenage girl named Vivian Abromovitz(Natasha Lyonne). The Abromovitz family has this weird thing where they tend to move out every few months. Vivian can't seem to understand her family and is having a hard time growing up with her father and her two brothers. Suddenly vivian's gorgeous but crazy cousin Rita(Marisa Tomei) moves in with her. Rita's dad buys the Ambromovitz family a nice house because they are letting his daughter stay with them. Vivian finally thinks that she has found a home and that they won't be moving out into another dump hole like they did before. But due to some accidents, vivian's dream might not come true but make her realize that she doesn't need a nice place to live in order to be happy with her family. Slums of Beverly Hills was a nice little funny and original movie, besides the fact that they could have choosen someone else to play Vivian, because Natasha Lyonne looks like she's in her late twenties. I would give Slums of Beverly Hills 7.5/10",
         "Well, I didn't have a clue what this movie was about. Someone said I would like it, so I gave it a try. The opening scene is the Natasha Lyonne character getting fitted for a bra. I thought, huh. What on earth? A whole movie about getting breasts? And in some ways, it is. But, it's so much more than that.(And for the fellas, you do get to see both Marissa Tomei and Natasha Lyonne topless.) It's a story about a family where the mother is the one who left and the kids are actually staying with the father. In the case, the father doesn't necessarily seem all that equipped to handle them. They are an adult and three kids living in one room apartments and moving overnight before they can get kicked out. But, if you stick with the story, you'll start to see that maybe he's not such an inappropriate father, as he is just a human. Marissa Tomei is fantastic as the black sheep of the family.",
         "This is a movie with well-drawn characters you can really relate to. Much like Ben and Ricky, I also enjoy sitting around in my tight-whities, eating Trix and watching H.R. Pufnstuf. That scene brought back memories. I also learned the hard way that you can't trade cereal for drugs. Sadly, Vivian was too busy obsessing over puberty, etc. to realize the answer to all her problems would be to have her hair straightened. People with curly hair are not like the rest of us. Science has proved that their brains are so busy growing hair in weird spirals, that they don't think as good as us normal people."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Fox Searchlight Pictures",
         "Wildwood Enterprises"
      ],
      "summaries": [
         "Vivian's family are penniless nomads, moving from one cheap flat to another in Beverly Hills so she and her brothers can attend the city's schools. Uncle Mickey sends them money to survive. When Mickey's daughter Rita runs away from an asylum, Vivian's dad offers shelter to her if Mickey will pay for a plush flat. Vivian must babysit her adult cousin, making sure she gets to nursing school and avoids pills and booze. But Vivian has her own problems: she's curious about sex, likes an older neighbor kid, has inherited her mother's ample breasts, and wants a family that doesn't embarrass her. Can she help Rita, keep Uncle Mickey happy, and feel OK about her body and her family?",
         "This semiautobiographical story follows a lower-middle-class teenager (Lyonne) and her neurotic family in 1976 Tinseltown."
      ],
      "budget": 5000000
   },
   "movielensId": 2155,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-14",
      "dvdReleaseDate": "1999-01-19",
      "directors": ["Tamara Jenkins"],
      "runtime": 91,
      "movieId": 2155,
      "title": "Slums of Beverly Hills",
      "mpaa": "R",
      "actors": [
         "Natasha Lyonne",
         "Alan Arkin",
         "Marisa Tomei",
         "Eli Marienthal",
         "Mena Suvari",
         "David Krumholtz",
         "Kevin Corrigan",
         "Rita Moreno",
         "Carl Reiner",
         "Jessica Walter",
         "Rita Moreno"
      ],
      "imdbMovieId": "0120831",
      "originalTitle": "Slums of Beverly Hills",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["SKJlAYQoCqY"],
      "plotSummary": "In 1976, a lower-middle-class teenager struggles to cope living with her neurotic family of nomads on the outskirts of Beverly Hills.",
      "tmdbMovieId": 14662,
      "avgRating": 3.40005,
      "releaseYear": "1998",
      "numRatings": 1986,
      "posterPath": "/u0690Aor60ZM7Zhg6rwUD1KvJOr.jpg"
   }
}