{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0133413",
      "video": false,
      "title": "The Best Man",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Francesca Babini",
               "gender": 1,
               "credit_id": "52fe4abcc3a368484e164215",
               "name": "Inés Sastre",
               "profile_path": "/gaYLEBCVdOaCVT1nuEXB0M5QFa6.jpg",
               "id": 37918,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Angelo Beliossi",
               "gender": 2,
               "credit_id": "5517321d9251416f100018f6",
               "name": "Diego Abatantuono",
               "profile_path": "/kKihAlP104AJ0zshWfET2gGt4fA.jpg",
               "id": 55912,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Edgardo Osti",
               "gender": 0,
               "credit_id": "551732349251416f07001870",
               "name": "Dario Cantarelli",
               "profile_path": "/qIA5IzMYZOgq3r3RomeMqoo5c5v.jpg",
               "id": 234396,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Peppina Campeggi",
               "gender": 0,
               "credit_id": "5517324ec3a36862f90016e0",
               "name": "Cinzia Mascoli",
               "profile_path": "/btMQLR1LZ2t3vILnkD6iByKLcX3.jpg",
               "id": 555716,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Olimpia Campeggi Babini",
               "gender": 1,
               "credit_id": "551732619251416f10001906",
               "name": "Valeria D'Obici",
               "profile_path": "/skJK8CvwEx3EHO6vTQIqP4nMymc.jpg",
               "id": 103180,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Sisto Babini",
               "gender": 2,
               "credit_id": "551732769251416f12001865",
               "name": "Mario Erpichini",
               "profile_path": "/yO3NdlUhq989Bpq6Gnq9aIuodQd.jpg",
               "id": 27196,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Marziano Beliossi",
               "gender": 2,
               "credit_id": "5517328b9251416f12001869",
               "name": "Ugo Conti",
               "profile_path": "/ihyYwD4DdZ25cnkzUu2mT3d3bqx.jpg",
               "id": 71296,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Sauro Ghinassi",
               "gender": 0,
               "credit_id": "565ad692c3a368507200193c",
               "name": "Nini Salerno",
               "profile_path": "/cTD5157bmSxjtDDvkjFCLx4Imlp.jpg",
               "id": 130876,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Manlio Lobianco",
               "gender": 0,
               "credit_id": "551732b6c3a36862ff00168e",
               "name": "Toni Santagata",
               "profile_path": "/xxbnvvajGnga5ziFRTV3YrxqJGM.jpg",
               "id": 1446843,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "551732d6c3a36862ef00166a",
               "name": "Ada Maria Serra Zanetti",
               "profile_path": null,
               "id": 1446844,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 1,
               "credit_id": "59cf8de49251412f3101d54b",
               "name": "Carmela Vincenti",
               "profile_path": "/txCPCyH021AvcCOVvFRP6VCpMvx.jpg",
               "id": 1487574,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4abcc3a368484e164211",
               "name": "Pupi Avati",
               "profile_path": "/qgbskeZ6D6AIn8L8WGVVlb10fdI.jpg",
               "id": 72191,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5517317bc3a36862ef001626",
               "name": "Pupi Avati",
               "profile_path": "/qgbskeZ6D6AIn8L8WGVVlb10fdI.jpg",
               "id": 72191,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55173194c3a36862fc0015a3",
               "name": "Antonio Avati",
               "profile_path": null,
               "id": 105346,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "551731dac3a36862fc0015ab",
               "name": "Aurelio De Laurentiis",
               "profile_path": null,
               "id": 41383,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "551731ebc3a368630200164c",
               "name": "Riz Ortolani",
               "profile_path": "/hRt4uLf7DUvuX1pJnXVvBfp8taC.jpg",
               "id": 33804,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "551731fdc3a36862ef001642",
               "name": "Pasquale Rachini",
               "profile_path": null,
               "id": 240097,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.220275,
      "production_countries": [],
      "id": 125124,
      "vote_count": 1,
      "budget": 0,
      "overview": "Incredibly, the bride at the altar falls in love with the best man on first sight, and even though he makes efforts to avoid her infatuation with him, she is determined to annul her marriage and marry the best man. And although she is able to dissolve her marriage, because she has never consummated it, the best man leaves... only to return to her many months later.",
      "similar": [],
      "original_title": "Il testimone dello sposo",
      "runtime": 101,
      "poster_path": "/sMLIxxCgmtFXNqOuOIYffg4oOwP.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1997-10-28",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "On her wedding day she was very much in love. Unfortunately, not with the groom.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pupi Avati"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Pupi Avati"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0133413/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5ODM3NDUyOV5BMl5BanBnXkFtZTcwMDE3NzEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Diego Abatantuono, Inés Sastre, Dario Cantarelli | See full cast and crew »"],
      "reviews": [
         "It's 1899 and in Sasso, the small town in Italy, a marriage is going to take place. Naturally, the end of the century is in everyone's minds at what appears will be a festive occasion taking place during that historical New Year's eve. The only problem is the bride doesn't love the groom; everything indicates this is an arranged marriage by the impoverished family of the bride to a wealthy man. Pupi Avati, a man who has worked steadily in his native Italy for a number of years is not a well known name among the American movie going public. Mr. Avati deserves much better, as he demonstrates with this tale of how things were done among the moneyed classes in Italy, where a simple wedding takes epic proportions. Francesca, the beautiful bride doesn't want to get married to Edgardo, who is much older and appears to be a lecher and a profligate. The young woman is torn between duty and her own repugnance toward the man who would be her husband. At this point a mysterious guest appears on the scene. He is Angelo, an Italian who emigrated to America and, according to the popular belief, has made a fortune. Because of the fortune he made abroad, Angelo has been asked by Edgardo, who comes from an upper class background, to be his best man. Angelo, we find out, has been a lucky man because he didn't built the fortune he now possesses. When his older brother died, he left Angelo everything, thus making him a rich man. Angelo keeps looking at Francesca during the wedding ceremony. It's clear both have developed a passion that is not meant to be. In fact, Angelo is blamed for everything that goes wrong with the wedding. \"The Best Man\", the English title for this movie, offers a great performance by Diego Abatantuono, an actor that kept reminding us of Gian Carlo Giannini. In that both rely effectively on the expression of their eyes. In fact, one can see all the emotions going through Angelo just by looking at the actor that is giving him life on the screen to find out what is going on in his head and in his soul. Mr. Abatantuono plays his character with an economy of gestures. Pupi Avati knows what he is doing and nothing prepares us for the outcome of the film. Ines Sastre, the gorgeous Spanish actress, is perfect as the young bride Francesca who hates the husband her impoverished family has imposed on her. Ms. Sastre is an equal match for her co-star in a subtle performance that could have been overblown by another, less experienced director. Dario Cantareli plays the older groom who wants Francesca. This film didn't get any attention in this country since there is no market for these types of films. Pupi Avati's work should be seen more often because he hasn't received the recognition he deserves, at least in America.",
         "The setting is in a small Italian town on the last day of the 19th century. This is the wedding day for a beautiful 22 year old maid who dreams of love even on the day she is to wed by an arranged marriage for which she is repelled. There is an American who is to be the best man who grew up in this small town but has become wealthy in America. She falls in love with him on first sight. The acting couldn't be better and there is exquisite details to the wedding and New Year preparations. Sensitive and beautifully photographed, this shouldn't be missed by anyone who has a romantic bone in their body.",
         "Two of the three previous squibs here are negative. Ignore 'em. This film is delectable-- showed it to a roomful of old/young relatives Christmas night, and they all were delighted (while arguing with a pat ending). Huge cast-- more than 40 speaking characters, nearly all distinct and well-acted. Reminiscent of Visconti's THE LEOPARD, its art direction and costumes make for a lovely evocation of provincial Italy wedding, everyone in their best, on Dec. 31, 1899 (a good reason for rushing out to rent it right now). Most interesting as a compendium of folk rituals surrounding weddings in late nineteenth century, some familiar and a few bizarre. The film would be worth seeing for that alone-- but watch for the delicacy of the hero's interactions with the several women who pursue him, or the two beautiful group scenes over the wedding gifts.",
         "the two negative comments widely miss the mark on this movie , and show why Italian cinema is so much more appealing , often , that ideologically-drenched politically-correct dumbed down American movies often enough these days. first , the film showed a certain epoque as it was , and as such no reason to portray a character confirming with today's poliical correctness. as far as the dialogue which revealed both subtle individual and societal personalties and trends , they were much deeper than the previous poster recognized. second, the wishes for the turn of the century are reflected in literature and newspapers of the period, my grandparents often commented on this - and the tragedies of the 20th century were quite at odds with what Europeans in the West thought progress would bring. Last, the final scene in the movie by itself is worth the whole film, romantic and touching . definitely Ines Sastre's finest moment in her career in my opinion. Having lived in the \"old\" Italy of the 1960's much in this film hit a chord. A wonderful movie, and thank god no American political correctness !",
         "I viewed The Best Man as a laserdisc, with Italian dialogue and English subtitles. The story is drenched in century-old Italian culture, which is of much intrinsic interest to me. Cinematography, costumes and sets were high quality, down to the matched horses pulling the carriages. The plot is basically a romantic comedy, with few surprises. The majority of the movie takes place on New Year's Eve, 1899. The movie's focus was on the cultural shift of those times, away from the 19th century tradition of `arranged' marriages. The central character, Francesca Babini, rebels at her parent's choice of an arranged spouse. Her parents pressure her to go through with the marriage and succeed only in creating a disaster. The ending is a triumph for the modern, 20th century view of romantic love. I would recommend this movie both for those interested in historical Italian culture, and those looking for a good `date' movie. I didn't see any profanity, nudity or violence that would merit the movie's `R' rating.",
         "Aesthetically ,Avati has a very high place in the Italian cinema;as regards the level of continuous quality ,only Fellini,Antonioni and Visconti are his superiors\u0097in the sense that they did not alternate masterpieces and mediocre movies,but have a kept a level of mastership that allows them to be called authors, and not occasional authors (--even for a longer phase of their career,or for a logically placed one \u0085--) of astounding films\u0097be they masterpieces (the case of many\u0097from Rossellini,De Sica,Pasolini,Bertolucci and many others \u0085to Brass \u0085). Along his career, Avati maintained a very high artistic position. These being said, The Best Man is not one of his best movies.Yet it is extremely interesting and exciting and charming; what I want to say is that,while not a bad movie, The Best Man is a flawed and misconceived one.It is not bad,on the contrary\u0097it is amusing,interesting and exciting.But it is flawed.In the early part of The Best Man,after having read the stupid epigraph that opens the film,then after having now seen the Sandokanesque lead, his bovine air of a perplexed rural Latin lover,the provincial antics of \"Francesca\",I hoped it was only a farcical device and I began eagerly waiting for the denouement;well,that thing did not come. The Best Man is a provincial,rural romance ,very conventional, sermonizing and melting,of an unpredictable (in an Avati movie) sentimentalism. For me,the whole movie was very unpredictable,because I did not think Avati able of such a piece of sentimental crap.The film is interesting and pleasing despite the script's.This script is so non-Avatian for many reasons;it also tries to dwell on too many themes.\"The BM\" is Avati's camp romance.There are lots of things to be enjoyed in it,but its place it is that of a camp romance. This extremely awkward contrast between the camp note and Avati's sarcasm and deftness undermines the film's tone and makes it an ultimately unsatisfying experience.The dose of camp romance exposes not so much Avati's inability in treating satisfactory this kind of stuff,but rather his basically very bad choice of a script.Everything that is interesting is something that could be added: striking endocrine\u0097ailing physiognomies, satirical approach,etc..But with its main theme Avati did not find what to do.The best thing that \"ITDS\" can do is give one a new appreciation of Avati's other films \u0096by simply proving that worse is possible\u0097and in what way.We should not be upset on Avati for this movie;because if he deserves blame for this one,then he certainly also merits praise for the others that are better\u0097and much better.\"ITDS\" should normally enhance the respect for the better Avati films. There are enchanting Avatian touches:dreamy images;an interesting gallery of women (almost all the women in The Best Man are interesting\u0097minus Francesca,unfortunately;but her aunt,her mother, other women present at the wedding party are fine \u0085);an eerie salon of grotesque faces and physiognomies ,and several charges against provincial stupidity; atypical for Avati's movies is the multiplicity of themes (the love vs. marriage without love,of course;but also the end of the XIX century, occasion for mocking the hideous rural versions of the \"scientism\" current then \u0085;many satirical sketches of the turpitude, ugliness,etc.; many peculiar wedding habits,like the bride sprinkling her body with a liquid prepared by the older women in the house and brought to her by her very loving and fancy aunt;then the quest for virgin people to dress the bride with her lingerie and to prepare the nuptial bed;then the shortness of a wedding party (particularly, of course,when it is a dreadful one,like that in The Best Man \u0085);finally,the creepy fact that the wedding guests take back their gifts at the end. Let us draw rapidly a short synopsis.First we witness the final preparations for a marriage; the bride does not really want to marry,but her father almost implores her,explaining her again that this wedding is vital for his business\u0097the girl,\"Francesca\",being practically bought from her father. Her groom is the son of a local potentate. Then, we see the wedding in the church,the priest telling some gross licentious jokes,etc..Here arrives a man just returned from America;he comes back in Italy rich and respected and courted.At the wedding,he is guest of honor.From the instant she sees him,before the altar, Francesca has a crush for this silent mysterious reserved Italoamerican. Just when asked by the priest if she wants to marry, Francesca runs off and hides in the sacristy;again her embarrassed family has now to appease her.The parishioners suppose that Francesca is pregnant.Finally,the priest marries the couple,and they go to the churchyard, then at the wedding party.Francesca's family notices the exchanges of looks between her and Angelo.He and Francesca's husband take a walk,they talk about women,etc..Angelo then visits some places.It is known that he had a mistress, and everybody is curious about how will their meeting be like. At the party,Francesca's aunt gets drunk,she dances with Angelo,etc..A meeting between him and his former girlfriend is arranged by the groom.Between Francesca and her husband quarrels occur,she does not,of course, want to be his,he is a cynical vulgar profligate,etc..The idyll of Angelo and Francesca is not interesting, and I will not further spoil what happens next. There is a fine sequence when the servants throw bed-sheets from a higher level, over a balustrade. The execution of the film is Avatian, the quirks are his.Too bad he chose this romance,or too bad he did not succeed in making it his.The motto at the beginning of \"ITDS\" already gives away the film,and makes a very bad impression.It is below the Avati standards.It is less than we expect from him.And this idyll\u0097it is so insipid and trite \u0085.It is of the worse Romanesque provincial taste.And the too campy characters\u0097Angelo and Francesca\u0097very disappointing choices. Movie of a great visual beauty, The Best Man features two rather insipid and banal leads,as \"Francesca\" and a Sandokan-like uncouth bum named \"Angelo\".I guess Avati considered him poetic;I found this \"Angelo\" annoying.Francesca's aunt is delightful.",
         "This movie gets off on the wrong track because it begins with a commentary on love and the new 20th century woman. If you can forget that, it is a deliciously done period piece filled with humorous skits that illustrate the characters. It is a story that could be redone as a modern comedy. A shy middle aged man with no experience with women goes to a wedding and ends up being chased around the reception by the gorgeous bride who has fallen in love with him at the church while standing at the alter. The little scenes filling out the characters and the idiosyncrasies of the times are wonderful, like small beautiful portraits. This is not a movie for fast action, it is for those who appreciate atmosphere and character.",
         "The Italian film, the Best Man, is very well acted and believable about the Bride who falls in love with her husband's brother who is older and an American success. I found the movie to be well-paced and well-acted and believable. I enjoyed this film very much and do recommend it as a change from other films. Maybe it's because I have been fascinated by the beauty of Italy and the Italian language all of a sudden. I love Italian movies including this one. It shows another time in Italian life where family and tradition was still important including having a large family. That's all changed in contemporary Italy, people still get married and maybe live together without raising an eyebrow. They have smaller families maybe just one child much less two or more as it has even in New Jersey. Families are smaller and everybody is so involved in themselves. It doesn't help that the long working days in the rural fields have been replaced by a cubicle and an office. But that's what I miss about the old world of Italy, it's charm and eternalness.",
         "Hopeful that the New Italian Cinema produced another little gem in its 90's renaissance, went to see this motion picture with high expectations. While the costumes and indoor settings were marvelous, the rest was disappointing. Some of the dialogues made little sense, or were artificially forced on the actor's mouth. The acting didn't see spontaneous, and some of the characters just seemed to make little sense. Another big disappointment was the dubbing of dialogues that clearly didn't follow the actor's lips: listening to mono-tone reading of dialogue text, and watching the lips simply not sinchronized to the listened voice, just makes this movie a turn-off. This movie reminded me of some of the made-for-TV productions of RAI-TV that catered to a domestic forced-fed audience when RAI was the only TV station in the entire country twenty years ago, and the audience had no other choice but to watch the only show in town. In its defense, there were some interesting moments in the plot, like the slide show shown to the italian audience, of pictures of America. But at the end, this movie was like reading a book whose turn-paging incentive is to find out when things were finally happening, only to find out at the end that the climatic moment never happened. Very anti-climatic.",
         "On new year's eve 1899 a young woman is betrothed to marry a man she doesn't want to. The best man arrives on the scene an she falls instantly in love. The art direction and costumes are beautiful in this period drama, but many of the tongue-in-cheek references are a bit jarring. For no reason characters say things like, \"I wonder if we'll go to the moon in the next century\" and \"the 1900s will know no war. As far as portrayal of women. It starts out as a woman trying to take control of her life and ends up depicting her as an obsessive, submissive nut who is convinced she married the best man at her wedding rather than the groom."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Duea Film",
         "Filmauro"
      ],
      "summaries": ["Incredibly, the bride at the altar falls in love with the best man on first sight, and even though he makes efforts to avoid her infatuation with him, she is determined to annul her marriage and marry the best man. And although she is able to dissolve her marriage, because she has never consummated it, the best man leaves... only to return to her many months later."],
      "budget": 0
   },
   "movielensId": 2156,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1997-10-28",
      "dvdReleaseDate": null,
      "directors": ["Pupi Avati"],
      "runtime": 101,
      "movieId": 2156,
      "title": "The Best Man",
      "mpaa": null,
      "actors": [
         "Inés Sastre",
         "Diego Abatantuono",
         "Dario Cantarelli",
         "Cinzia Mascoli",
         "Valeria D'Obici",
         "Mario Erpichini",
         "Ugo Conti",
         "Nini Salerno",
         "Toni Santagata",
         "Ada Maria Serra Zanetti",
         "Carmela Vincenti"
      ],
      "imdbMovieId": "0133413",
      "originalTitle": "Il testimone dello sposo",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Incredibly, the bride at the altar falls in love with the best man on first sight, and even though he makes efforts to avoid her infatuation with him, she is determined to annul her marriage and marry the best man. And although she is able to dissolve her marriage, because she has never consummated it, the best man leaves... only to return to her many months later.",
      "tmdbMovieId": 125124,
      "avgRating": 3.17606,
      "releaseYear": "1997",
      "numRatings": 71,
      "posterPath": "/gEULENMuYUyUFVMMXAOLIKpQVdr.jpg"
   }
}