{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "titanic",
         "id": 4388
      }],
      "imdb_id": "tt0129923",
      "video": false,
      "title": "The Chambermaid on the Titanic",
      "recommendations": [
         138644,
         258023,
         136986,
         42139,
         115715,
         107642,
         114333,
         107287,
         410
      ],
      "backdrop_path": "/n9YAatHxfip8V45kFx9U1CkezTU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Horty",
               "gender": 2,
               "credit_id": "52fe4b7dc3a36847f82062e9",
               "name": "Olivier Martinez",
               "profile_path": "/2jGpw7G64BlnONreDZMsVEBQgXQ.jpg",
               "id": 15533,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4b7dc3a36847f82062ed",
               "name": "Aitana Sánchez-Gijón",
               "profile_path": "/wh3P0RqrbWVRxTT3k1Sg4jXhC0Y.jpg",
               "id": 37946,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "52fe4b7dc3a36847f82062f1",
               "name": "Romane Bohringer",
               "profile_path": "/keVDM0uUbKmo0yOVNrjMuKiH1B2.jpg",
               "id": 40938,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Simeon",
               "gender": 2,
               "credit_id": "52fe4b7dc3a36847f82062f5",
               "name": "Didier Bezace",
               "profile_path": "/dx2p4j19q5bppOUZ467px2wzqSi.jpg",
               "id": 55922,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Zeppe, Actor",
               "gender": 2,
               "credit_id": "59ecc864925141211f00d3ba",
               "name": "Aldo Maccione",
               "profile_path": "/qe5isTBNkm5KHHH0Pzo1SLVjVSr.jpg",
               "id": 21236,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Pascal",
               "gender": 2,
               "credit_id": "59ecc86ec3a368535b00e4d5",
               "name": "Jean-Marie Juan",
               "profile_path": "/n4lrTD9tcMwAiLtwUKouI1ValP4.jpg",
               "id": 1664226,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Al",
               "gender": 2,
               "credit_id": "59ecc876925141366d001a6e",
               "name": "Arno Chevrier",
               "profile_path": "/9drUbAD4wBJr63y5QHZXQ8i4umX.jpg",
               "id": 78292,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Mathilde",
               "gender": 1,
               "credit_id": "59ecc880925141245f007de3",
               "name": "Marianne Groves",
               "profile_path": null,
               "id": 146637,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Simeon's Secretary",
               "gender": 2,
               "credit_id": "59ecc88992514119fc01227b",
               "name": "Didier Bénureau",
               "profile_path": "/hSkwMCRMO05jJTWQhzK6HFiy6xG.jpg",
               "id": 35966,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Giovanni",
               "gender": 2,
               "credit_id": "59ecc892925141366d001aad",
               "name": "Alberto Cassadie",
               "profile_path": null,
               "id": 1910178,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Manu",
               "gender": 2,
               "credit_id": "59ecc8a0c3a36871bc0085ea",
               "name": "Giorgio Gobbi",
               "profile_path": "/eUzdAICqLdxyPCTsdC8HaxVxspx.jpg",
               "id": 226029,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Gaspard",
               "gender": 2,
               "credit_id": "59ecc8a8c3a368520400da0d",
               "name": "Yves Verhoeven",
               "profile_path": "/zj1N6PEmJWGQlfbC7SigdjXhFyP.jpg",
               "id": 77195,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Lacroix",
               "gender": 2,
               "credit_id": "59ecc8b292514119fc0122cf",
               "name": "Enzo De Caro",
               "profile_path": null,
               "id": 1132233,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Leon",
               "gender": 2,
               "credit_id": "59ecc8bdc3a36851bd00bd1e",
               "name": "Salvador Madrid",
               "profile_path": null,
               "id": 1065432,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Blanche",
               "gender": 1,
               "credit_id": "59ecc8c792514119000121f3",
               "name": "Barbara Lerici",
               "profile_path": "/2Gviq53rqzc87HOl00DtkOtc6Br.jpg",
               "id": 1693770,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Mimi",
               "gender": 1,
               "credit_id": "59ecc8cf9251412783007879",
               "name": "Stefania Orsola Garello",
               "profile_path": "/jo33KZQiZlZXYjQfFoGf2Sowtxd.jpg",
               "id": 119349,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Lou",
               "gender": 2,
               "credit_id": "59ecc8d892514119fc012315",
               "name": "Maurizio Solda",
               "profile_path": null,
               "id": 1065496,
               "order": 16
            },
            {
               "cast_id": 27,
               "character": "Chinese Photographer",
               "gender": 2,
               "credit_id": "59ecc8e192514119fc012327",
               "name": "Jim Adhi Limas",
               "profile_path": null,
               "id": 1270705,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b7dc3a36847f82062d3",
               "name": "Bigas Luna",
               "profile_path": "/jjl6wHNVCqjXydfCDi87KlLDd6b.jpg",
               "id": 37577,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b7dc3a36847f82062d9",
               "name": "Bigas Luna",
               "profile_path": "/jjl6wHNVCqjXydfCDi87KlLDd6b.jpg",
               "id": 37577,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b7dc3a36847f82062df",
               "name": "Jean-Louis Benoît",
               "profile_path": null,
               "id": 263085,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b7dc3a36847f82062e5",
               "name": "Didier Decoin",
               "profile_path": null,
               "id": 23611,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe4b7dc3a36847f82062fb",
               "name": "Cuca Canals",
               "profile_path": "/5pIdbE0c9fY7ZtrajLpybCGrs0m.jpg",
               "id": 84770,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59ecc832925141211f00d361",
               "name": "Luigi Conversi",
               "profile_path": null,
               "id": 1684753,
               "department": "Camera",
               "job": "First Assistant Camera"
            },
            {
               "gender": 1,
               "credit_id": "59ecc844c3a36879fe015c01",
               "name": "Cuca Canals",
               "profile_path": "/5pIdbE0c9fY7ZtrajLpybCGrs0m.jpg",
               "id": 84770,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "59ecc84ec3a36871bc008530",
               "name": "Jean-Louis Benoît",
               "profile_path": null,
               "id": 263085,
               "department": "Writing",
               "job": "Scenario Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.614902,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 115872,
      "vote_count": 4,
      "budget": 0,
      "overview": "Horty, a French foundry worker, wins a contest and is sent to see the sailing of the Titanic. In England, Marie, saying she is a chambermaid on the Titanic and cannot get a room, asks to share his room. They do, chastely; when he awakens, she is gone, but he sees her at the sailing and gets a photo of her. When he returns home, he suspects that his wife Zoe has been sleeping with Simeon, the foundry owner. Horty goes to the bar, where his friends get him drunk and he starts telling an erotic fantasy of what happened with him and Marie, drawing a larger audience each night.",
      "similar": [
         597,
         10971,
         87827,
         205775,
         950,
         810,
         578,
         285,
         5689,
         27902,
         10488,
         8676,
         24982,
         11968,
         11021,
         86938,
         11002,
         3989,
         503,
         14372
      ],
      "original_title": "La femme de chambre du Titanic",
      "runtime": 100,
      "poster_path": "/jSsKHwtqk0XNdABR2R5wI3grfxV.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "UGC YM",
            "id": 10344,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         }
      ],
      "release_date": "1997-10-10",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bigas Luna"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Cuca Canals",
         "Jean-Louis Benoît"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0129923/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNDA0NTg4M15BMl5BanBnXkFtZTcwNTExNDYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Olivier Martinez, Romane Bohringer, Aitana Sánchez-Gijón | See full cast and crew »"],
      "reviews": [
         "In Lorraine, the worker Horty (Olivier Martinez) wins an internal competition promoted by Simeon (Didier Bezace), the owner of the foundry where he works, and the prize is a travel to Southampton alone to see the departure of the Titanic. Once in the hotel in England, a woman called Marie (Aitana Sánchez-Gijón) knocks on his door telling that she is a chambermaid of the Titanic and the hotel is completely booked and she has no place to stay. Horty invites Marie to share his room; on the next morning, Marie is gone but Horty gets her picture with a street photographer. When Horty returns to his French town, he is promoted and his colleagues insinuate that his wife Zoe (Romane Bohringer) had had an affair with Simeon. The upset and jealous Horty goes to a bar with his friends and while drinking, he shows the picture of Marie and tells erotic fantasies about his one nightstand with her. His erotic tales become famous, drawing more and more people in the audience every night in the bar and changing the sexual lives of his friends. His fame reaches the actor Zeppe (Aldo Maccione) that proposes a business with Horty. \"La Femme de Chambre du Titanic\" is a totally original romance that blends the tragedy of the Titanic with the lives of ordinary people, developing an intriguing and erotic love story. The truth about the night of Horty and Marie is disclosed only in the very end, and the viewers are never sure whether Horty is fantasizing because he believes Zoe has betrayed him, or if his affair with Marie had really happened. Surprisingly there are bad reviews in IMDb about this good film. My vote is seven. Title (Brazil): \"A Camareira do Titanic\" (\"The Chambermaid of the Titanic\")",
         "Perhaps one of the most intriguing stories to board the Titanic craze is this exquisite tale of a foundry worker and a chambermaid. Never actually setting foot on the famed vessel itself, the action centers on a night in a Southampton hotel the night before the ill-fated vessel left England for the first and last time. That night, roomless title maid Marie who works for the line not the hotel) knocks on the door of handsome Horty, who has won a contest at the French foundry where he works and is rewarded with a trip to see the eventful sailing. Because Horty's boss has eyes for his lovely wife Zoe, she remains at home, leaving Marie and Horty to their own devices. Horty returns home having been faithful, but is unsure if his wife has done the same. From then on, Horty's barroom revelations of his encounter with Titanic and maid become more and more embroidered. Both to anger Zoe and to please his audience, Horty's stories become nothing short of hallucinatory. After the liner's sinking, Horty's fate is sealed as a virtual one man show, relating what is now nearly all fiction, including his presence on the ship the night it went down. But the fickle hand of fate that took the Titanic to a watery grave has just as unexpected plans for Horty and Zoe, who now \"plays\" Marie in a full-length stage production of Horty's story. The final act of this impressive motion picture is just as dramatic and humbling in it's way as the story of the liner itself. Director J.J. Bigas Luna peppers this French language feature with water imagery, forshadowing the Titanic's fate and a crucial plot point for Marie and Horty. A letterbox video release is terrific except for that the subtitles are a bit small. See it on a bigscreen TV. Although, there's no sinking to gape at, the human drama is also of titanic size.",
         "I love this film; it dares to let the audience be soaked in wonderfully melodramatic and lustfully vulgar scenes. Feelings and drama make the film rattle, and when, in addition to this, the humor is so frequent, this film can't fail. It is erotic, wonderful, lovely. Ace.",
         "This collaboration between France and Italy is simply a very original movie, with a scrip of a great intelligence. We don't really know if Olivier Martinez is telling lies, but like the people who listen to him, we want to hear him and believe him. And like in a great short story of litterature, we know the true at the end, but the director told us, in a little part, that it's not really sure... The idea of shows in little theatres, by the last half of the film, is simply brillant. I have study the reaction of people with melodrama at this time of the 20th century, and we saw that in this film exactly like it was in the early 1910's. This is truly a wonderful movie.",
         "As a new Olivier Martinez fan, I have clamored to get my hands on most of everything he's done. I bought this movie through Amazon.com along with 'Mon Homme' and 'The Roman Spring Of Mrs. Stone.' Anyway, this movie was very different from the very famous 'Titanic' movie made in 1997, as well. The story begins as Horty (Martinez) wins some kind of contest from his boss and he gets a free ticket to South Hampton to watch the Titanic set sail. When he arrives in South Hampton, he goes to the hotel he is staying at and is shown to his room. Suddenly, this chambermaid from the Titanic comes to his door and tells him that she has no where to stay and asks if she could sleep in his room for just the one night. Horty reluctantly, if I remember correctly that is, offers his room and his bed to the chambermaid while he tries to sleep in the chair. After they both settle down, she invites him into the bed just to sleep. He has this romantic dream about her, but when he wakes up she is already gone. He goes outside to watch the Titanic set sail, and sees that a photographer is taking her picture. After she walks away, he goes up to this photographer and asks to have her picture. When he comes home, his friends want to know what happened while he was there. He tells them that the chambermaid, named Marie, stayed in his room for the night. Obviously they were intrigued, and wouldn't believe that nothing happened between them. So, Horty gives in and starts to tell this elaborate story, making it up as he goes along. His wife overhears his stories, and believes that he cheated on her. He tells her that everything is made up and nothing happened. He eventually finds out that that Titanic sank, and figures Marie must have died. Somehow, this acting troupe comes along and wants Horty to make it into a play because he stories about the chambermaid named Marie are so popular in the town he lives in. He and his wife decide to go along and do it, because they need the money. One night as he's about to tell the story, he realizes that this person, Marie, is in the audience! I'll have to stop here, so I won't spoil it for you... This movie is a very good movie, and worth watching! It's not really even about the Titanic, the ship is in the details, but really its about Horty's fantasies about what could have happened the night he spent with a chambermaid named Marie.",
         "This is a French film directed by the Spanish director Bigas Luna, who has done a very good job with a difficult and ambiguous subject, which alternates between reality and fantasy so often that it is like a shuttle service. One really does not know from one scene to the next whether something is really happening or is being imagined. That is a tightrope, but Luna does not fall off. In this, he is assisted by the dreamy performances of Olivier Martinez (half French, half Spanish-Moroccan) and the well known Spanish actress Aitana Sanchez-Gijon. Both of them keep us wondering all the way. The only solid earthy figure is Romane Bohringer, being as Anna Magnani-like as possible, a young earth mother, but still an earth mother. There is lots of passion, it's all over the place. Sometimes it is real, sometimes it is fantasy. One never knows for sure about some of it. When Martinez is telling his stories, his quiet, introspective but commanding presence effects us as much as it does his audiences in the film. Romane gets a bit carried away by the myth of the chambermaid and wishes to become the chambermaid, wishes to be sprayed in champagne. The chambermaid was not listed amongst the survivors of the Titanic, so this creates a story steeped in tragedy. People like tragic passion best, because it is unattainable by definition, and can never disappoint. Or can it? Perhaps things are not entirely as they seem in more ways than one in this story. This film shows clearly how love and sensuality thrive in the hothouse of ambivalence and ambiguity: does someone really exist? Do they feel love too? Is the love simulated? Can any passion be trusted? Ultimately, it comes down to this: is reality even real?",
         "My first from this Spanish director noted for his erotic films and, while this element is certainly at the forefront of his preoccupations here, it is presented in a generally restrained and tasteful way. The film's plot is an interesting, even original one: in 1912, a happily-married but poor French mine-worker wins a race and the once-in-a-lifetime prize he receives is to witness the historic launching of the ill-fated \"Titanic\". In the hotel where he stays for one night, he ends up sharing his room with a beautiful young girl who tells him that she will be working as a chambermaid on the ship. When he returns home - and especially after learning of the tragedy that befell the \"Titanic\" - he becomes obsessed with his memory of the girl and, to appease his curious and envious colleagues, he concocts stories of their various sexcapades in the hotel, on the docks and even aboard the ship itself! Of course, his devoted wife is not pleased when she learns about this (despite rumors that she had been unfaithful with her husband's boss in his absence!) but soon changes her mind when she realizes that the tall stories her husband tells in the local bar are turning a profit and have also made him something of a celebrity! In fact, they are subsequently visited by a traveling showman who specializes in tragic love stories revolving around historical calamities (such as the eruption of Vesuvius at the time of the Roman Empire) who proposes to take the couple under his wing, with the promise that the husband's monologues will eventually play in front of a wide audience in theatre houses across the country. And, as in every fable, it all comes true - except that one day the chambermaid, who is alive and well and not as pure as the husband professes, attends one of his performances... The twist ending is delightful, taking the plot's aura of fantasy, romance and nostalgia as far as it can go. Indeed, the entire film was a pleasant surprise for me and I will surely be renting on DVD two of the director's more typical 'carnal comedies' - THE AGES OF LULU (1990) and JAMON, JAMON (1992) - somewhere down the line...",
         "\"La Femme de chambre du Titanic\" is one of the best film by the spanish director Bigas Luna and my opinion it is the only one. The reason is because is very different,it is not like the other films,which serve us sex scenes.This film is romantic and present the fantasies of a middle class man (Olivier Martinez)when he win a ticket to the departure of the titanic.There,in England he knows a beautiful woman,Marie,and she pass a night with him in his hotel room. then,when he returns,He tell stories in the bar and people heard them very carefully so he imagine new stories. There is no explicit sex like in \"Son de mar\" or \"Jamon,Jamon\" and this is good because \"la femme de chambre du titanic\" Becomes Romantic and perhaps a little bit erotic",
         "Great poetic film about ordinary life and one-night romance that will last forever, even when it's not real at all!. A superb casting, a Bigas Luna dominating the slow pace, even through the many changes of the story.",
         "I've renewed my interest in Titanic over the past year or so and happened across this movie. I thought it was an OK movie after I saw it about two months ago but since then there's been an aspect that I can't get around. I can go for how the townspeople were entranced by Horty's stories. They knew him, after all. But once he took the performance on the road and was charging admission to complete strangers, things changed; the least of which is that since they didn't know Horty, I don't think they'd relate to him the way the townspeople in the tavern did. Imagine you were one of his audience members, seeing his show in the weeks following the disaster. To imagine yourself as a member of the audience at that time, imagine that it's November 2001 and you're going to the show of someone claiming to be a survivor of the World Trade Center. You sit there and listen to the speaker go on and on about his torrid love affair with the coffee shop girl on the 80th floor sky lobby. Wouldn't he -- and you, for that matter -- be more interested in what it was like to survive the disaster? And after we've seen the pictures of the poor souls plunging from the buildings, and keeping in mind that the 9/11 lost are as dead as those on Titanic, wouldn't you think that having a set with the side of the building and an actress pantomiming the death plunge, much as Zoe was mimicking the drowning Marie, be in incredibly poor taste? That aspect of his production alone would make me consider Horty to be a shameless opportunist, regardless of what he actually said."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "UGC YM",
         "La Sept Cinéma",
         "France 2 Cinéma"
      ],
      "summaries": ["Horty, a French foundry worker, wins a contest and is sent to see the sailing of the Titanic. In England, Marie, saying she is a chambermaid on the Titanic and cannot get a room, asks to share his room. They do, chastely; when he awakens, she is gone, but he sees her at the sailing and gets a photo of her. When he returns home, he suspects that his wife Zoe has been sleeping with Simeon, the foundry owner. Horty goes to the bar, where his friends get him drunk and he starts telling an erotic fantasy of what happened with him and Marie, drawing a larger audience each night."],
      "budget": 0
   },
   "movielensId": 2157,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Magyar"
      ],
      "releaseDate": "1997-10-10",
      "dvdReleaseDate": null,
      "directors": ["Bigas Luna"],
      "runtime": 100,
      "movieId": 2157,
      "title": "The Chambermaid on the Titanic",
      "mpaa": "",
      "actors": [
         "Olivier Martinez",
         "Aitana Sánchez-Gijón",
         "Romane Bohringer",
         "Didier Bezace",
         "Aldo Maccione",
         "Jean-Marie Juan",
         "Arno Chevrier",
         "Marianne Groves",
         "Didier Bénureau",
         "Alberto Cassadie",
         "Giorgio Gobbi",
         "Yves Verhoeven",
         "Enzo De Caro",
         "Salvador Madrid",
         "Barbara Lerici",
         "Stefania Orsola Garello",
         "Maurizio Solda",
         "Jim Adhi Limas"
      ],
      "imdbMovieId": "0129923",
      "originalTitle": "La femme de chambre du Titanic",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Horty, a French foundry worker, wins a contest and is sent to see the sailing of the Titanic. In England, Marie, saying she is a chambermaid on the Titanic and cannot get a room, asks to share his room. They do, chastely; when he awakens, she is gone, but he sees her at the sailing and gets a photo of her. When he returns home, he suspects that his wife Zoe has been sleeping with Simeon, the foundry owner. Horty goes to the bar, where his friends get him drunk and he starts telling an erotic fantasy of what happened with him and Marie, drawing a larger audience each night.",
      "tmdbMovieId": 115872,
      "avgRating": 3.29348,
      "releaseYear": "1997",
      "numRatings": 138,
      "posterPath": "/jSsKHwtqk0XNdABR2R5wI3grfxV.jpg"
   }
}