{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "serial murder",
            "id": 11260
         },
         {
            "name": "violence",
            "id": 14819
         }
      ],
      "imdb_id": "tt0116516",
      "video": false,
      "title": "Henry II, Portrait of a Serial Killer",
      "recommendations": [
         27651,
         37901,
         126793,
         92779,
         40252,
         48885,
         87469,
         26961,
         27548,
         86269,
         87699,
         59762,
         24777,
         85567,
         49684,
         83413,
         53246,
         104205,
         61909,
         57597
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe473f9251416c9106f01b",
               "name": "Neil Giuntoli",
               "profile_path": "/rfZpmKHhsgQkCL1TjOfBGptcQj4.jpg",
               "id": 168323,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Cricket",
               "gender": 1,
               "credit_id": "52fe473f9251416c9106f01f",
               "name": "Kate Walsh",
               "profile_path": "/xKy0PNB5xLSwm6yyL3zZ5zUNvQZ.jpg",
               "id": 61114,
               "order": 1
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe473f9251416c9106f017",
               "name": "Chuck Parello",
               "profile_path": null,
               "id": 223312,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "565f5f55c3a36874f4004656",
               "name": "Chuck Parello",
               "profile_path": null,
               "id": 223312,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.415917,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39930,
      "vote_count": 8,
      "budget": 0,
      "overview": "Henry has wandered into a small town looking for work and a place to stay. He gets a job delivering and cleaning porto-potties and moves in with a co-worker until he gets his feet off of the ground. Henry and his new friend soon start to kill.",
      "similar": [
         357096,
         15069,
         984,
         8090,
         11423,
         10781,
         123109,
         12619,
         10692,
         4771,
         96,
         979,
         10285,
         2832,
         281,
         75780,
         948,
         807,
         281957,
         238636
      ],
      "original_title": "Henry II, Portrait of a Serial Killer",
      "runtime": 84,
      "poster_path": "/d0YVvWpirA43wvHPwV5m8ZNJsFA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1996-10-10",
      "vote_average": 5.3,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Henry: Portrait of a Serial Killer Collection",
         "id": 143755,
         "poster_path": "/6QTtWHXfyRO9HYnpKk6tCuIut0p.jpg"
      },
      "tagline": "Guess who's back in the neighborhood?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Chuck Parello"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Chuck Parello"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116516/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjQ2NTEyNzA3M15BMl5BanBnXkFtZTcwOTM5NDQzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Penelope Milford, Neil Giuntoli, Mike Houlihan | See full cast and crew »"],
      "reviews": [
         "I thought this was going to be REALLY bad. Luckily I was wrong. It tries to imitate the pattern of the first one. It is well paced, with a psychological build-up similar to the first one. However, the acting occasionally slips, and so does the direction. The punches thrown in the film are some of the fakest looking ever, for example... Still, despite a few mistakes, it comes close to the first one in every sense of the other, while still being slightly inferior. Not a bad rental.",
         "Would you want to see a sequel to Apocalypse Now? Would you want to see a sequel to A Clockwork Orange? How about Easy Rider 2? The obvious answer would be NO. So why would anyone want to see a sequel to Henry: Portrait of a Serial Killer? Henry 2: Mask of Sanity is a completely unnecessary sequel. It fails in just about every way that the original succeeded. It also recycles much of the plot. Henry moves in with a lower class family, gains a new sidekick, and teaches him how to kill people. How does Henry stumble upon these kinds of guys? I guess it takes one to know one. I will give credit to Neil Giuntoli. Anyone trying to fill the original Henry's shoes is going to be in for a critical bashing, but he's actually decent. He's just no Michael Rooker (and he must stand about 5'2...needless to say he has a hard time being intimidating). Anyone interested in the continuing adventures of Henry as he teaches rednecks across the country how to terrify and kill people, should probably still avoid this. Chuck Parello went on to make the equally avoidable Ed Gein and the updated Hillside Strangler (which I have not yet seen). It seems he's a one trick pony.",
         "Henry 2: Mask Of Sanity is the sequel to- you guessed it Henry: Portrait Of A Serial Killer. Why make a sequel to the masterpiece? I don't know. Henry 2 lacks the sense of emptiness that the original generated perfectly. It also lacked Michael Rooker's Oscar caliber performance of Henry. But Henry 2 is no less disturbing. Henry has wondered into a small town looking for work and a place to stay. He gets a job delivering and cleaning porto-potties and moves in with a co-worker until he gets his feet off the ground. Henry and his new friend soon start to kill. The idea of brutally killing total strangers cause you've had a bad day is disturbing in itself, but Henry 2 does it in more of a graphic slasher-esque manner than the original. I didn't understand why Henry and his new friend just didn't kill the poeple they were pissed at instead of taking it out on strangers. I did enjoy Henry 2, but its hard to compare it to the original, so don't. Neil Giuntoli portrays Henry in the same quiet manner Michael Rooker did, but is in no way as good or convincing. I give props to Chuck Perello for writing and directing a descent flick, he had the right ideas, but........ I recommend Henry 2, but don't compare or think it will live up to the original cause you'll just let yourself down. Appreciate Henry 2 for itself.",
         "Yeah, yeah, I know. Different director, and a different Henry, even. Not quite what I had in mind, either. Perhaps a bit insulting, if you're like me, and you think highly of Henry 1, that is, unless you're, once again, like me and have extremely low standards for Horror, and are used to that sort of inconvinence, because there sure is whole lot of it. So, as far as half-ass sequels with different directors, and an all together different feel goes, this one is actually pretty good. Good, but not awesome, at least not compared to the original, which. by the way, is a masterpiece, but let's try not to hold that against Chuck Parello's underdog of a sequel. Henry 2 picks up some time after the events of the original. Henry is broke, desperate, and completely out of his mind. Henry ends up with a job cleaning porta-potties, and soon gets friendly with a co-worker and his wife (Kai and Cricket), resulting in a place to crash for a few days. Polite at first, Henry makes himself right at home after discovering Kai's hobbie... firebug. Naturally, Henry wants to play, and soon Henry introduces Kai to his own games, quickly turning this regular joe firebug into a bloodthirsty killer. But as we all know, Henry is only capable of playing well with others for so long. I take it we weren't supposed to notice that the new Henry is about a foot shorter than Michael Rooker. In that case, forget I said anything. Henry 2 Mask Of Sanity is a much better stand-alone movie than one may think, and also has a lot going for it in the violence and terror department, despite being in the shadow of Henry one. for those who can really appreciate a quality sequel, Troll 2 is waiting. And as for Henry 2, this may sound strange, but this movie really is a worthy sequel. 7/10",
         "You might wonder why Chuck Perello decided to make a sequel to Henry: Portrait of a Serial Killer. Did he think that it would live up to the original masterpiece? Of course it didn't. In this installment Henry played by Neil Giuntoli, is looking for work and finds it. Cleaning and delivering porto-johns. He moves in with a co-worker until he gets his feet off the ground. His new friend soon discovers that the quiet soft spoken Henry is a psycho, but he (like Henry's buddy in the original) soon begin killing total strangers for kicks. While the film has its similarities and differences to the original Perello still manages to acquire a cold empty feeling which was present in the original Henry although not as strongly. Henry 2 tries a more graphic approach toward the murders, but is no less disturbing than the original. Neil Giuntoli approaches the character of Henry in the same way Michael Rooker did, with a certain quiet. But Giutoli is in no way as effective. If you choose to rent Henry 2, enjoy it for it and don't try comparing it to the original, cause you'll just be let down. Let Henry 2 stand on its own two feet.",
         "I'm not knocking Neil Gutioni but I just couldn't think of him as the henry from the first film. I mean, Michael Rooker must be at least 6 inches taller. I felt a lot of the dialogue stank (SPOILER), like when the two parents came to the door, everyone just seemed to be shouting random insults instead of having a realistic argument. Apart from that, this Henry was a completely different character. Michael Rookers' character wouldn't have hid in his room while other people fought his battles, nor would he have tolerated a barman saying \"get the f*ck out of here. If we look at the Henry from the 1st film and ignore the fact that he was based on the vile Henry Lee Lucas, he was almost an anti-hero, e.g. rushing to Becky's rescue, if it wasn't for all those murders, he would have been a good guy! (joke). My advice to anyone who has seen the 1st film and wants to get the second, don't bother. it's a waste of money.",
         "HENRY: PORTRAIT OF A SERIAL KILLER 2- MASK OF SANITY (2 outta 5 stars) Uh, long enough title, you think? First things first: this movie is one of those In Name Only sequels... and has practically nothing to do with the original classic. It hasn't got the same writer, director, actors or even the same style. This film is of a distinctly lesser quality in every respect. (This movie has some of the absolute WORST, fakest fight choreography I have ever seen!) Neil Giuntoli stands in this time for Michael Rooker (the original Henry) and, while he has a couple of effective scenes of underlying, stoic menace, for the most part he doesn't make much of an impression. This time around Henry is on his own and looking for work. He gets a job cleaning and moving port-a-potties and makes fast friends with a co-worker, Kai (Rich Komenich). Kai and his very un-happy-looking but smolderingly sensuous wife (Kate Walsh) invite Henry to stay with them until he gets some money put together. They also have an emotionally unstable niece (Carri Levinson) who draws freaky pictures. You think, with the two women in the house making googly eyes at Henry and carrying all that emotional baggage, that the tension would escalate into something really interesting. Well, you'd be wrong. Instead, Henry finds out that Kai does arson jobs for extra cash and the two of them get sidetracked into burning down old buildings for awhile. Then Henry starts into his killing spree again, slowly involving Kai more and more. The finale is a big disappointment in all respects... hardly touching on some of the more interesting elements introduced earlier in the movie. No wonder that there hasn't been a Henry 3.",
         "I thought this movie was going to suck, considering (1) how good the first movie was, and (2) that the original writer/director and Michael Rooker didn't return. I was surprised that this movie actually isn't a bad follow-up. Even if the first movie never existed, this would still be an interesting movie. It's obvious that the director was really trying hard to duplicate the feel of the first movie. Movie does somewhat fudge its look at the thoughts of the characters, and how the characters change in the movie, but the characters still have some interest. So it's not without interest - just don't expect a masterpiece.",
         "Granted, as written and directed by Chuck Parello, it inevitably falls short when compared to a genuinely disturbing predecessor, but it works nevertheless. Lead actor Neil Giuntoli (\"Child's Play\", \"The Shawshank Redemption\") is no Michael Rooker - he can't match Rookers' level of intensity - but he does do alright in the role of glum loner Henry. His life at a real low point, Henry ends up taking a job in the port-a-potty business. He makes the acquaintance of married couple Kai (Rich Komenich) and Cricket (Kate Walsh of 'Grey's Anatomy'), and they offer to let him room with them for a while. Henry soon finds out about Kai's second job, as an arsonist for hire. Henry tags along with Kai on these arson gigs until they discover two squatters in a building. It's here that Henry is able to satisfy his need to kill, and from then on there's no turning back as he convinces Kai to turn killer. Their murders weigh heavy on Kai's conscience, but he's gotten in too deep. One good thing that can be said about this sequel is that it stays true to itself and its grim depictions of life. It follows a pretty predictable story line, working towards the kind of resolution that marked the original. As we can see, Henry just doesn't work that well with other people. Parello utilizes the same approach as John McNaughton in not judging his characters, but presenting their f'd up lives in a matter of fact way. The acting is solid from all concerned, and the film is generally well crafted, with some creepy moments and doses of grisly violence. It's about as good a sequel as the first \"Henry\" could have gotten. Eight out of 10.",
         "Michael Rooker forever imprinted himself on my mind as the cool, psychopathic serial killer in the 1986 masterpiece \"Henry: Portrait of a Serial Killer\", in a performance that would stand to be impossible to beat, and has never been matched since. Being a big fan of John McNaughton's film, I approached the 1996 sequel with some excitement, and natural trepidation. It looked bad for a number of reasons.... for starters, Rooker wasn't reprising his role as Henry. And needless to say, McNaughton wasn't to be at the helm. But nevertheless, I watched it, and I was quite surprised. It's a long shot off the first film, but nevertheless, it is enjoyable and although Neil Giutoli had been given an impossible task of matching Rooker's performance, he still managed to shadow his performance well and was quite good. The sequel takes off where the original ended, with Henry at large and on the run. He is homeless, but is still randomly killing people. It's not until he finds a job working at a portable toilet company that he finds some stable work and money, and he moves in with Kai - a co-worker - and his family. These people are thrash, and Henry fits in just perfectly with them. Kai's wife's niece also lives in the house, a very shy and geeky artist with suicidal tendencies. She takes a liking to Henry that later turns into dangerous obsession. Meanwhile, Henry is approached by Kai to do a little extra 'work' with him. This involves them burning down sleazy properties for insurance scams, and Kai turns out to be some sort of pyromaniac... and needless to say, Henry starts killing while out on these late shifts, and it isn't long before he has Kai doing the same thing. OK, even from reading that I know many people would be turning their noses up and calling it a blatant insult/rip-off of the original. That it nearly is, but I was willing to look beyond that and just enjoy the film as it's own. This was never going to brilliant... as the original is notorious for just being a film about three characters sitting around a scummy apartment drinking, and two of them just happen to pop out every night and kill someone. It was so simple, yet extremely effective and almost authentic looking. The plot here has a bit more flesh added onto it, and there's a lot more going on. But it doesn't make it anymore scary or shocking, it just improves it as a whole in terms of being its own film. Giutoli is far from intimidating... he stands at no more than 5\"6 and he lacks all the power and intensity of Rooker in the original. The violence is plentiful as there are a few beatings, a decapitation and numerous stabbings as well as a neck break (The one thing that makes me squirm!). The story leaves a lot to be desired, as it seems to just repeat the trend of the original where Henry bumps into scumbags like himself and is able to manipulate them to kill and brutalise people. This disturbing trait is evident here - as is the idea of just going out and murdering someone because you've had a bad day which was possibly one of the biggest things that made the original film make such a huge impact. Henry kills just as apathetically here, and as usual, makes sure that everything goes his way. So is it a good sequel? Yes; because it could have been a whole lot worse. Director Chuck Parello manages to remain faithful to the original in maintaining the taut and tense atmosphere, however, that been said, it's still a long pitch off the original - as it lacks the power and intensity, and part of that is just down to the absence of Rooker."
      ],
      "genres": [
         "Crime",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [],
      "summaries": ["Henry II picks up where the original (Henry: Portrait of a Serial Killer) left off. Henry (Neil Giuntoli) takes a thankless job at a port-o-john company where he meets husband and wife, Kai (Ken Komenich) and Cricket (Kate Walsh). They take pity on the homeless drifter and offer him a room in the home they share with their emotionally fragile teenage niece, Louisa (Carri Levinson). Henry learns that Kai has a side job as an arsonist-for-hire, setting up phony insurance scams to make money for their boss, Rooter (Daniel Allar). He agrees to join Kai and on one of their first outings, they discover two squatters in a building that's been marked for fire. It is then that Henry introduces Kai to his life's work... and the murders begin. Kai has never killed before, but he turns into a willing accomplice. Initially, the two men work well together. But as the killing sprees increase in their depravity, it's more than Kai can handle. He wants out, but he's in too deep."],
      "budget": 0
   },
   "movielensId": 2158,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-10",
      "dvdReleaseDate": "1998-11-03",
      "directors": ["Chuck Parello"],
      "runtime": 84,
      "movieId": 2158,
      "title": "Henry II, Portrait of a Serial Killer",
      "mpaa": "R",
      "actors": [
         "Neil Giuntoli",
         "Kate Walsh"
      ],
      "imdbMovieId": "0116516",
      "originalTitle": "Henry II, Portrait of a Serial Killer",
      "genres": [
         "Crime",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Henry has wandered into a small town looking for work and a place to stay. He gets a job delivering and cleaning porto-potties and moves in with a co-worker until he gets his feet off of the ground. Henry and his new friend soon start to kill.",
      "tmdbMovieId": 39930,
      "avgRating": 2.8817,
      "releaseYear": "1996",
      "numRatings": 224,
      "posterPath": "/d0YVvWpirA43wvHPwV5m8ZNJsFA.jpg"
   }
}