{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "chicago",
            "id": 520
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "sadistic",
            "id": 625
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "psychopath",
            "id": 6259
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "video camera",
            "id": 10561
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "blood",
            "id": 11221
         },
         {
            "name": "extreme violence",
            "id": 14687
         },
         {
            "name": "killing spree",
            "id": 17987
         },
         {
            "name": "incest",
            "id": 33841
         }
      ],
      "imdb_id": "tt0099763",
      "video": false,
      "title": "Henry: Portrait of a Serial Killer",
      "recommendations": [
         15516,
         9696,
         994,
         11879,
         8740,
         28942,
         16307,
         1694,
         11167,
         27813,
         31417,
         931,
         21588,
         26517,
         24920,
         19236,
         74725,
         27346,
         7219,
         1483
      ],
      "backdrop_path": "/9ZYJvlx2nzoi2Q4O11wuDHvTZQe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Henry",
               "gender": 2,
               "credit_id": "52fe43a39251416c750184e7",
               "name": "Michael Rooker",
               "profile_path": "/bvmf7TIjCyRPrBNrmZ5qyePTL5y.jpg",
               "id": 12132,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Becky",
               "gender": 0,
               "credit_id": "52fe43a49251416c75018525",
               "name": "Tracy Arnold",
               "profile_path": null,
               "id": 157914,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Otis",
               "gender": 2,
               "credit_id": "52fe43a49251416c75018529",
               "name": "Tom Towles",
               "profile_path": "/nqcpMGjjJkz8IMdDyrObZulUFKg.jpg",
               "id": 27736,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Henry's Boss",
               "gender": 0,
               "credit_id": "52fe43a49251416c7501852d",
               "name": "David Katz",
               "profile_path": null,
               "id": 1265139,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Dead Woman / Dead Prostitute / Hooker",
               "gender": 0,
               "credit_id": "52fe43a39251416c750184e3",
               "name": "Mary Demas",
               "profile_path": null,
               "id": 67161,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Waitress",
               "gender": 0,
               "credit_id": "52fe43a49251416c750184eb",
               "name": "Anne Bartoletti",
               "profile_path": null,
               "id": 67162,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Dead Couple - Wife",
               "gender": 0,
               "credit_id": "52fe43a49251416c750184ef",
               "name": "Elizabeth Kaden",
               "profile_path": null,
               "id": 67172,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Dead Couple - Husband",
               "gender": 0,
               "credit_id": "52fe43a49251416c7501851d",
               "name": "Ted Kaden",
               "profile_path": null,
               "id": 1265135,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Floating Woman",
               "gender": 0,
               "credit_id": "52fe43a49251416c75018521",
               "name": "Denise Sullivan",
               "profile_path": null,
               "id": 1265136,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a49251416c750184f5",
               "name": "John McNaughton",
               "profile_path": "/4EoxmVdvj7ZKNOAytTdIijn32Wl.jpg",
               "id": 9200,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a49251416c750184fb",
               "name": "Richard Fire",
               "profile_path": null,
               "id": 67179,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a49251416c75018501",
               "name": "John McNaughton",
               "profile_path": "/4EoxmVdvj7ZKNOAytTdIijn32Wl.jpg",
               "id": 9200,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a49251416c75018507",
               "name": "Steven A. Jones",
               "profile_path": null,
               "id": 9202,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a49251416c7501850d",
               "name": "John McNaughton",
               "profile_path": "/4EoxmVdvj7ZKNOAytTdIijn32Wl.jpg",
               "id": 9200,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a49251416c75018513",
               "name": "Charlie Lieberman",
               "profile_path": null,
               "id": 67181,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a49251416c75018519",
               "name": "Elena Maganini",
               "profile_path": null,
               "id": 3121,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "59a977dbc3a3683ccc0302cd",
               "name": "Lisa Dedmond",
               "profile_path": null,
               "id": 1880496,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59a977f592514157c602d9f2",
               "name": "Ken Hale",
               "profile_path": null,
               "id": 1300920,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "59a97810c3a3683ccc030308",
               "name": "Steven A. Jones",
               "profile_path": null,
               "id": 9202,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "59a9781b925141579902d684",
               "name": "Robert McNaughton",
               "profile_path": null,
               "id": 1072476,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "59a97833c3a3683c7a032721",
               "name": "Rick Paul",
               "profile_path": null,
               "id": 1074839,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59a9784392514157ee02c1ac",
               "name": "Patricia Hart",
               "profile_path": null,
               "id": 1880499,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59a97853c3a3687671017283",
               "name": "Cory Coken",
               "profile_path": null,
               "id": 1570528,
               "department": "Sound",
               "job": "Sound Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.747099,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10692,
      "vote_count": 192,
      "budget": 111000,
      "overview": "Henry likes to kill people, in different ways each time. Henry shares an apartment with Otis. When Otis' sister comes to stay, we see both sides of Henry: \"the guy next door\" and the serial killer.",
      "similar": [
         10029,
         281,
         12662,
         123109,
         1696,
         504,
         9299,
         979,
         4141,
         948,
         395834,
         281957,
         238636,
         12619,
         10285,
         2832,
         10781,
         74997,
         663,
         984
      ],
      "original_title": "Henry: Portrait of a Serial Killer",
      "runtime": 83,
      "poster_path": "/jE9bDB7v7lMED5PWpPMsmc3SzlI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Maljack Productions",
         "id": 11506,
         "origin_country": ""
      }],
      "release_date": "1986-09-24",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Henry: Portrait of a Serial Killer Collection",
         "id": 143755,
         "poster_path": "/6QTtWHXfyRO9HYnpKk6tCuIut0p.jpg"
      },
      "tagline": "The shocking true story of Henry Lee Lucas.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John McNaughton"],
      "runtime": 83,
      "synopsis": "In the opening shot, a naked and bloody dead woman is seen lying in grass in a field. In a local diner, a man named Henry (Michael Rooker) finishes his meal, pays his tab, buys a pack of Kool brand cigarettes, and tells the waitress: \"real nice smile you got there\". Henry walks to his beat-up dark-green 1970 Chevy Impala and drives off. In a convenience store, a man and woman are seen lying dead beside the counter, and the sounds of their murder are heard. In other shots, a woman is seen lying dead in the bathroom of a motel room. Another nude woman is seen lying dead in a creek. Henry drives around Chicago listening to his car radio and staring at the people on the street. He drives to a suburban neighborhood and sees several women walking to their cars in a shopping mall parking lot. He follows one woman to her house, but leaves when he sees a man greet her in the driveway. Henry drives on until he picks up a female guitar-carrying hitchhiker. Meanwhile, a man named Otis (Tom Towles) meets his younger sister Becky (Tracy Arnold) at a terminal at Midway Airport. She has just arrived from Texas to stay with him for a while. Otis tells Becky that she looks terrible (from the bruises on her face). In his car driving from the airport, Otis says he always knew that Becky's husband, Leroy, was no good for her. Becky tells Otis that she is not sure how long she will stay. Otis and Becky arrive at Otis' seedy second floor apartment located at 1801 North Road in Chicago. They are seated at the kitchen table talking when Henry walks in. Henry has the hitchhiker's guitar and gives it to Otis as a gift. Otis introduces Henry to his sister, and Otis tells Becky that Henry is currently heading west and has been staying with him for a few weeks. The next day, Henry is seen working as an exterminator, spraying a kitchen. Henry's boss arrives as he is leaving and tells Henry that this is all the work he has for a while, but tells him to hold onto the spray can. He gives Henry some money for his job and sends him on his way. Henry drives to the house of the same woman that he followed from the mall a few days earlier. He still his spray tank with him. He knocks on the woman's front door and introduces himself as an exterminator and asks if she needs her house fumigated. She lets him inside. Afterwords, the woman is seen laying dead on her living room couch, having been strangled with an electrical cord. Meanwhile, Otis is seen working as a fuel pump operator at a local gas station. A teenage boy visits Otis at the station and asks if Otis has any more of the stuff that he sold the boy last week. He gives Otis some money, and Otis agrees to meet with the teen later. That evening, Becky is in the kitchen cooking dinner and she asks Otis how he met Henry. He tells her that they met in prison a few years ago and that Henry was inside for killing his mother and one of her boyfriends with a baseball bat. After dinner, Henry helps Becky clear the table as well as wash and dry the dishes, while Otis leaves to go to his meeting with the teenager. While playing cards with Henry, Becky asks him about his father, and then tells him that her own father used to rape her. She asks Henry if he killed his mother and repeats what Otis told her. Henry tells Becky that he did kill his own mother but he didn't beat her to death with a baseball bat. He stabbed her. Henry explains that his mother was a prostitute who brought men over and make Henry watch while she had sex with them. When Henry would refuse, she would beat him. When Henry mentions about shooting his mother, Becky reminds him that he told her that he stabbed her. Henry corrects himself. The following evening, Becky again cooks dinner for Henry and Otis and mentions that she got a job as a shampoo girl at a local beauty parlor downtown to help out financially. Otis mentions that Becky's previous job was a stripper and that she used to dance naked at various strips clubs, and asks when she will dance for them. Otis tells Becky to get him a beer. When she comes back to the table with a can, he pulls her by her arm as if to give her a kiss. Henry suddenly grabs Otis' hair and yells \"Don't do that, Otis! She's your sister!\" Henry makes Otis apologize and promise not to do it again. Otis seems upset, so Becky suggests the two men go out for a beer. While driving along a seedy part of Milwaukee Avenue, Henry and Otis pick up a couple of women. The car pulls into an alley where they begin to make out with the two women. In the back seat, Henry suddenly kills her. The other woman, in the front seat with Otis, screams and tries to get out of the car, but Otis grabs her while Henry reaches up and snaps the woman's neck. He pulls the bodies out and leaves them in the alley. Otis is unsettled, but Henry pacifies him by getting him something to eat. At Otis' apartment later, Henry talks about killing people, and Otis seems to agree with Henry's philosophy that \"it is either you or them\". Another evening later, Otis in his living room and getting bad TV reception and kicks in the screen. He decides that they need a new television. Otis and Henry drive to a garage where they meet a portly man surrounded by television sets and other appliances. The three men discuss different TV's and a $500 video camera before Otis settles on a $50 black-and-white TV. The fat man is angry that they wasted his time to settle for a cheap TV and is rude towards Henry, who responds by stabbing him in his hand and then in the stomach. Then the two of them bash the $50 TV over his head and plug it it, killing the fat man. A little later, Otis, Henry and Becky are playing with the stolen video camera at Otis' apartment and watch TV with a new and stolen TV set. Another few days later, Otis goes to see his parole officer to discuss his job status. Later, Otis goes to a high school parking lot where he meets with the same teenage boy for a drug transaction. Otis touches the boy's leg, and receives a punch to his face by the homophobic youth who runs out of the car. That evening, a furious Otis tells Henry that he wants to go out and kill someone. Henry and Otis drive around Chicago and feign car trouble at Lower Wacker Drive where Otis shoots and kills a man who stops to offer help. The next day, while out filming with the video camera, Henry advices Otis about his MO for killing and tells him to kill in different ways so that the police will not find a pattern. Henry also says that it is important to keep moving and never stay in one place for too long. That evening, the two men head over to a house where Henry films Otis tormenting a woman, while her husband is lying on the floor bound and gagged. The couple's teenage son returns and Henry drops the camera, runs to the boy and breaks his neck. Otis breaks the woman's neck and Henry stabs the man. Otis fondles and kisses the dead woman, and Henry orders him to stop. Later, Henry and Otis are back in the apartment watching the video. Otis rewinds the tape saying, \"I want to see it again.\" Another day or two later, Becky is working at her job at the beauty parlor and during a break, she talks on the phone with her mother long distance and asks how she is doing. Meanwhile, Henry and Otis are driving around in Henry's car. As Otis leans out with the video camera, the camera is hit and broken. Otis throws it out the window and the two men argue. Henry warns Otis that he is getting careless and out of control with his antics. The growing warped Otis says that he wants to stop for a beer, and Henry forces him to get out of the car. Henry arrives back at the apartment where Becky tells him that she just quit her job so she can go back to Texas to live with her daughter and mother, and she asks Henry to go with her. Henry suggests going out to get a steak dinner at a local restaurant so they can talk about it some more. Plus, Henry wants to try out his new credit card (obviously stolen from one of his recent victims). The couple returns a few hours later to find Otis passed out drunk on the living room couch. Becky takes Henry to her bedroom where she takes off her shirt and begins to unbutton his, clearly wanting to have sex with him. Henry seems reluctant. Otis suddenly appears in the doorway and says \"I ain't interuptin' nothin', am I?\" Henry leaves the apartment and goes for a walk. He goes to a convenience store to buy some more Kool cigarettes. He is angry, but backs out on wanting to kill the store clerk. Outside in an alley, he meets a middle-aged woman walking a dog. He follows the woman for a while, but again backs out from killing her and heads back to the apartment. Upon arriving back at the apartment, Henry finds Otis on top of a partially unclothed Becky, clearly raping her while choking her with his shirt. Henry kicks him off and beats him until Otis breaks a liquor bottle over his head. Just when Otis is about to stab Henry with the broken bottle's jagged edge, Becky leaps up and stabs Otis in his eye with the sharp edge of a steel comb. Henry crawls to the wounded and screaming Otis and stabs him in the stomach with his hunting knife, killing him at last. Becky yells at Henry to get the police, but Henry tells her to shut up and let him think. After a minute, he tells Becky help him clean up the mess and pack up so they can leave since their names are not on the lease of the apartment. While Becky cleans up the blood, Henry chops up Otis in the bathtub and puts his remains in several black plastic trashbags and then puts the bags in a suitcase. Henry and Becky leave the apartment carrying several suitcases as well as the guitar case. They drive to a bridge and throw the suitcase containing Otis' cut up body into the Chicago river. While driving out of the city, Henry says that they are going to hide out at his sister's ranch out west and they will send for Becky's daughter. Becky tells Henry that she loves him. Henry replies unemotionally, \"I guess I love you too.\" The two of them drive to a rural motel and check in for the night. Becky plays with the guitar while Henry looks at himself in the bathroom mirror. He tells Becky that they need to get some sleep for they have a long drive tomorrow. The next morning, Henry showers, shaves, packs up and leaves the motel by himself. He stops his car a short distance from the motel along a rural road, pops open the car trunk and takes out Becky's blood stained suitcase. He drives away, leaving the suitcase (obviously containing Becky's dismembered body in it) behind.",
      "writers": [
         "Richard Fire",
         "John McNaughton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0099763/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5MjQ5MDA1M15BMl5BanBnXkFtZTcwNjI0NTYzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Rooker, Tracy Arnold, Tom Towles | See full cast and crew »"],
      "reviews": [
         "I really wish that there were more movies like \"Henry\" out there. Most people still don't realize just HOW controversial this film was when it was made. The MPAA wouldn't touch it with a ten foot pole. McNaughton fought for 4 years to get an R rating, but no dice. And since he didn't want the X, and there was no NC-17 rating at the time, it was finally released, with no rating, in 1990. And why? I've seen films with MORE violence in them...Romero's \"Day of the Dead\" leaps to mind. But it's not the violence in this film that makes it so disturbing. It's the way the material is handled. And this is what the film's detractors obviously can't appreciate. \"Henry\" doesn't bother with any type of morality...it neither glorifies nor denounces Henry's actions. It simply observes. It places those actions before us and says \"there it is...you deal with it...you sort it out.\" People who don't like this film often say that there's \"no character development...no discernible plot line...etc., etc.\" Those people should stop throwing around film school terms. This is one movie that doesn't present events in a \"movie reality\"...it shows us things as they are in the real world. Character development means showing you enough of the characters in 90-120 minutes to make you feel as if you've known them forever. How often do you spend 90 minutes with a real person and know that much about them...or feel that you can seriously identify with them? It's just a conceit of film-making. Same with plot lines. Does life have a plot line? Not at all. Life is an endless succession of things happening. Some seem important and/or entertaining...some don't. \"Henry,\" in its attempt to realistically portray the life of a serial killer, does not need a plot line...in fact, it benefits from having only a very loose plot line. Much like a homicidal version of \"The Catcher in the Rye,\" this film seems much like a lot of things that happened, as opposed to a carefully constructed fictitious story...which make it seems all the more real...and all the more disturbing. \"Henry\" is disturbing on many levels. Firstly, it feels very real. Too real, perhaps. Nothing is slicked up...nothing seems counterfeit or contrived. The entire thing is so utterly plausible that it chills you to the bone. Secondly, the complete lack of police involvement is equally disturbing. The only time you see a police car in this film, it's driving past in the background as Henry is cruising the streets. It drives past...and that's it. And Henry isn't scared...nor is he even aware, apparently. He has nothing to hide. He knows the police won't connect his crimes to one another...and they certainly won't connect them to him. So what has he to fear? And finally, the setting of Chicago makes the film more disturbing for me, as I'm somewhat familiar with that city and can spot some locales in the film that I recognize. In fact, a friend of mine who lives in Chicago told me that the first time he watched \"Henry,\" he and a friend rented it and sat down in his friend's apartment to watch it. It was about halfway through that they realized that the apartment they were sitting in was the same one used as Henry's apartment in the film. All I can say is...I'd never use that bath tub again. All in all, I truly wish that more directors had the guts to make films like \"Henry.\" Honestly, I can't think of one film that's comparable. There simply aren't any films out there that are anything like this. This is truly one of the most disturbing films I've ever seen. After seeing \"Happiness,\" I guess that \"Henry\" probably got knocked down to Number Two on that list. But \"Second Most Disturbing Film Of All-Time\" is still a damn fine achievement, in my opinion. If you want to see an accurate and appallingly realistic portrayal of what the life of a serial killer must be like, definitely give \"Henry\" a viewing. Make up your own mind from there. Oh, and a final note...one reviewer stated concretely that his biggest problem with the film was that \"serial killers work alone.\" This is, of course, not always the case. The real life counterparts to Henry and Otis (Henry Lee Lucas and Ottis Toole) DID kill together, as did Bianchi and Buono, the infamous Hillside Stranglers. Those are not the only such instances...but they're certainly the best-known. Therefore, the overly broad generalization that serial killers \"work alone\" is no real attack on the realism of this film.",
         "With the BWP hype, a lot of talk of going around about \"the scariest movie you've ever seen\". Probably because I've seen over a thousand horror/fright/suspense/gore movies, I have trouble pinning it down. I can't name the scariest, I can name the top 5. As far as non-supernatural horror goes, this movie and Last House on the Left are the scariest movies I've ever seen. I saw this at a film festival and the audience was very, very quiet. My friend and I just sat there quietly cowering most of the time. It's just way too realistic. The opening and closing are probably the most frightening, and we don't even see Henry killing anyone, just the bodies of his victims and their terrified screams in the background, echoing. It will give you chills down your spine. The stuff in the movie that scared me wasn't any big \"jumps\" or gore, just very disturbing, creepy moments (especially if you knew someone who was been the victim of a homicide, as I do). My friend I saw it with worked at the city prosecutors office and heard about plenty of local murder cases and said it rang very, very true to life. One of the most chilling scenes is early on, when Henry goes to a mall and just sits patiently in the parking lot, scanning. The camera looks coldly and calculatedly at different women in the parking lot from Henry's point of view. There are so many shots you almost start to wonder what the point of the scene is until it hits you: they are ALL potential victims, this is how he looks at women. I have always been careful as a woman whenever I am alone but after seeing the film, to this DAY I do not walk to my car alone at the mall without my mace in my hand, and I look all around me and never turn my back on anyone. The movie also does not glamorize the killing or violence against women at all. Also, it's a good primer on home and personal safety. (a good rule- Do not EVER let a stranger into your house when you are home alone if you were not expecting him. In fact, after I saw this I never open the door when I am home alone and not expecting anyone, period. Think I'm paranoid? Watch this movie and see how safe you feel). The plot sounds simple but it's not boring. The movie follows the exploits of Henry, a young man who is practically a textbook case of a serial killer (male, white, 30's, drifter, soft-spoken, shy). Conflict comes when his disgusting nasty inbred cousin Otis Toole stays with him, along with his pathetic sister. One night Otis and Henry pick up a couple of prostitutes and are having sex with them in the car. Henry kills both of them sort of offhandedly, with no more emotion than you would swat a fly. Otis starts joining him on his exploits. Henry is more sympathetic than Otis, however, because while Henry does these things because he is sick and doesn't have a choice, Otis seems to get off on them, and also should know better. Things sorta go downhill from there, and the sister complicates things because she is so desperately lonely that Henry starts to look good to her. It culminates in one of the most chilling, downbeat endings of all time. After I saw this movie at the festival, I was lucky enough to be there when Michael Rooker, who plays the title character, came out and lectured and did Q & A. When I say lucky, I don't mean lucky that I got to meet a celebrity (though that was neat). I mean lucky that I was able to have proof immediately afterwards that this was just a movie. If the movie had ended and I just had to get up and go home, I probably wouldn't have gotten any sleep for about a week. He was very nice and personable, wore glasses and a blazer, not at all like his character. The thing I remember most clearly is someone asked him what kind of movies he liked and he replied, \"I don't like horror movies, really, I like musicals\". Everyone laughed for about 5 minutes, partially out of relief. BIG relief. See, it's just a movie, there's the actor right there, and ha-ha, he's actually very shy and charming and harmless, isn't that funny? Even with all of that, I still find this one of the most disturbing, unsettling movies ever made. You haven't seen a really scary movie until you see this movie.",
         "I am 57 years old. I've seen many films in my lifetime. I am not easily frightened or upset by movies. I am partial to drama and documentaries. I can count on one hand the films that I have found to be so deeply disturbing, that I later regretted seeing them.This film is among them. It is possible to \"see too much\" in this life, and once seen, some sights remain trapped in your head FOREVER short of getting a lobotomy, or being hypnotized. Leaving the theater that day, I honestly felt as though I had actually witnessed several murders. I was really shaken by the horrific realism of this cinematic event. I was sorry that I had seen the film, but it was too late to retract the terror that, even today, still remains in my memory. Some things are so emotionally damaging, that perhaps they should be left alone. This film was so powerfully unsettling for me, that I feel a need to warn others of the emotional impact. This speaks well of the directors skill at scaring movie-goers, but approach with caution please. This is a very heavy movie. The Honeymoon Killers is another film that I regret seeing. Would that I could forget that nightmare!",
         "In 1960, Michael Powell committed professional suicide by directing and producing \"Peeping Tom,\" a thriller in which a psychopathic murderer photographs his victims at the moment of death. Denounced as sick and without redeeming social value, \"Peeping Tom\" vanished from theaters, while its director, also denounced as sick, went on to make only two more films in the next eight years. Powell's film has gone on to attract an avid cult following and, if it hasn't done so already, so will \"Henry: Portrait of a Serial Killer.\" Loosely based on the real life exploits of Henry Lee Lucas, a leering, low IQ sicko who became a media star after claiming to have murdered several dozen people (some believe Henry was bragging), this film takes a gritty, realistic approach that creates the impression that we are watching real life unfold. Director John McNaughton exploits the discomfort the viewer is inclined to feel by presenting a scene in which Henry and his equally vicious former cellmate, Otis, videotape the rape and murder of one of their victims, then play it back for further amusement. This shocking episode effectively makes the point that those who seek second hand thrills through violent \"entertainment\" are almost as guilty as the perpetrators of such deeds. By casting anonymous non-stars in the leading roles (not that he had a choice considering the budget and the repellent subject matter), and focusing entirely on the exploits of the killers (there are no scenes of police investigating the crimes or peeks into the lives of the victims), McNaughton has created a brutal, amoral horror film that makes the bloodiest gorefest look benign. Although the real Henry was apprehended, his cinematic counterpart is never even suspected of his crimes, and gets off scot-free. Is \"Henry\" a film to acclaim or condemn? It's a difficult question to answer, and I, for one cannot make a decision. It is so expertly made that I think McNaughton deserves a round of applause and maybe an Oscar. But, at the end of the video tape of the film that I watched, there was a commercial hawking \"Henry\" T-shirts ($14.98) and posters ($7.98). Both were available through \"Henry Merchandising,\" and this attempt to turn this all too real murderer into a cult figure deserving of a fan club is despicable.",
         "The real Henry Lee Lucas had one of the worst childhoods that I have ever had the misfortune of reading about. Growing up in Texas, he lived with a family that was totally dysfunctional. He grew up in a shack, that had nothing more than a dirt floor. The father being a legless alcoholic, literally as well as figuratively. The mother worked as a prostitute. Henry was also forced into sexual activity with her clients. They forced him to dress as a girl and then would proceed to have sex with him. He was a child that grew up being raped. He then grew up with such an intense rage that he became a serial killer. Are we surprised? Now, I am not trying to justify his behaviour. Rather, I am pointing out the fact that these people do not just fall out of the sky. There is no such thing as an inexplicable evil. That is, the person is just evil because they are. Yes, there seems to be some genetic evidence for psychopaths. However the majority do not become killers. The ones who become killers are made. If you are truly interested in what makes a psychopath, I suggest you read, 'Not Guilty by reason of Insanity ' by Dorothy Otnow Lewis. Serial killers are often portrayed as being like Hannibal Lecter. Smart and talented creatures that have suddenly lost their moral code. The truth is most are a psychological mess. Losers that are full of conflicting emotions. There is also strong evidence to suggest that these people are made by a specific form of brain damage. Basically when you combine trauma in childhood and frontal lobe brain damage, you end up with Henry. This movie is what happens when people are treated in an utterly horrific way. Michael Rooker is excellent as a psychopath who seems normal but deep down harbours a psychotic rage against society. He and Otis travel around killing. Why? Why not? The pointlessness of their lives is perfectly captured. People complain about the lack of plot. I think it perfectly captures the plot. It shows the emptiness of these characters. In fact Henry and Otis feel nothing unless they are killing. The emotional side of the characters has been like killed off by previous abuses against them. They are not unlike the living dead. Even when Otis's sister shows some affection towards Henry he cannot reciprocate. He can't relate to people, he can only get off on torture and death. Yeah, this is shocking. But it is also incredibly sad. Here in New Zealand there are many shocking drunk driving ads that they play to try and get people to stop this behaviour. I feel that this movie is like that. The movie is an ad for psychopaths, who they are and the dysfunctional psychological world that they inhabit. It is a film that honestly looks at these kinds of people. This certainly does not glorify these people, which is a criticism that has been levelled at the 'Silence of the Lambs' series. This is why I think it shocks people. The serial killer kills for visceral, physical pleasure. As Ted Bundy stated, 'I killed because I wanted to.' Maybe, this is where the film falls down. That the characters motivations are not explained well enough. But either way the viewer is given a shockingly realistic interpretation of a serial killers world. Obviously this is a film that was made on a budget! But this just adds to the bleakness. In fact Chicago looks dirty, grimy and not like somewhere that you would visit. The performances of the rest of the cast are pretty average if not bad. So the film has some definite flaws. The exploitation factor is there. But then I think of films like Baise Moi and this film has nothing on that! Overall I think this is an objective look at a world that those of us who come from normal backgrounds will find horrific. A world that we prefer would never exist, but however does exist. Maybe one day, as our society matures these people will cease to exist. Stories like these will become completely fictional. I really hope for that day. 7 out of 10.",
         "A flat disturbing film, almost documentary in scope which trawls the depths of the human condition. 'Henry' is not surprisingly often slated as a violent exploitation film, bundled together at Film Fairs with the Italian cannibal flicks of the 70's. Make no mistake though, this is a highly commendable piece of movie-making, which tackles the subject of serial killers with the same no-holds-barred approach which 'M' did way back in 1931. By referencing the early Fritz Lang classic, I am intentionally comparing 'Henry' favourably with it. I would also say that Henry Rooker's performance is on a par with Peter Lorre's. The film develops like a three-handed play, revolving around Henry's flat which he shares with former prison-mate, Otis. The trio is made up by Becky, the sister of Otis, who comes to visit. We are introduced to Henry immediately as a killer and the story does exactly what it says it will in the film's title. We simply follow Henry throughout his daily routine. No mention is given to any police enquiries and Henry is oblivious to any notion of avoiding capture or covering his tracks. Much of the film's power comes from this nonchalant approach, whereby if a person doesn't register that something he is doing is wrong, then it quickly becomes almost acceptable. Rooker, in the title role, is totally convincing and gives a chilling performance, free from the mannerism clichés which detract from more famous serial killer characters like Hannibal Lector and Norman Bates. I can only think of Kevin Spacey in 'Seven' (1995) giving a similar level of performance for this character-type. Despite a couple of scenes whose violent content borders on the gratuitous, for the most part 'Henry' succeeds by relying on a suffocating atmosphere and it's down-beat characters. Anyone without a sense of desolation at the end of the film must be devoid of their senses. BEST SCENE - Henry and Otis enjoying a night in on the sofa, watching their recent home-video recordings, is one of the most disturbing scenes I can remember watching.",
         "Henry: Portrait of a Serial Killer (1986) is a film that is loosely based upon the exploits of notorious white trash serial killer Henry Lee Lucas. This man claimed to have killed hundreds of people, mostly women. But the director takes us down the path of a man who is in many ways similar to the real deal. Michael Rooker stars as Henry, a demented man living in a twisted world who lives with a scummy roommate Otis (based also on Henry Lee Lucas' running buddy/lover Ottis Toole). Otis' kid sister Becky (loosely based upon the very young sister of Ottis) comes to live with her older brother after a falling out back home. She decides to head out to the big city to find a new life. The film follows the murderous trail of Henry who's pent of rage and sexual frustrations fuel the madness that's locked deep within his psyche. Those that are around him soon feel his madness and it's brutal and fatal consequences. The director follows these three individuals with a pseudo-documentary feel. The rape and murder scenes are graphic and brutal as they should be. This is no mere exploitation film because there is nothing exploitative about it, as it should be. I have to recommended this film. It's a sick, twisted but honest look at the life of a serial killer. He's no movie magic monster because unlike those, he's for real. Co-starring future B-Movie thug Tom Towles as Otis. You'll never see a film like this again.",
         "As you probably know, this film is partly based on the confessions of the real Henry Lee Lucas. If you know that and see this movie, you can ask some serious question about how disturbing some of our fellow humans are. This man shows no emotions what so ever. Contact with other people is nearly impossible, no mercy, not wondering whether his victims have a family or how old they are...no nothing. You wonder if he even IS a human, no living creature can be so awful. So, if you ask yourself all this during this movie, and I assure you will, you could say it's an excellent film. The mission of the movie itself has succeeded. The ideal atmosphere is achieved in the movie. Dark, melancholic, depressing...Director McNaughton really creates world you don't want to live in. Michael Rooker plays the role of his life and puts down one of the best acting performances ever. Sure, he's never honored with an Oscar or any other important price for his performance, but everyone who sees this movie knows it's true. Actually, when I first saw this film at the age of 9 ( Too young, I know) I thought this actor was in fact a real-life psycho. Henry talks with the same, aggressive tone of voice during the whole movie, his eyes seem to shoot fireballs when the camera looks like in them and his appearance makes you want to puke. Actually this film is pure genius for mainly one reason : you don't have sympathy for any of the characters. Most film, even is the whole cast play villains, there's always one you like. One character you create a sort of band with. In Henry: Portrait of a serial Killer you can only feel hate. Hate and disgust for Henry and for his companion Otis. Heck, you even start to hate the girl... For being so naive that is. Although many persons are killed and many violence occurs, Henry certainly ain't a gore or bloody film. Many things are suggested but not shown, and in this case it's actually more or at least as scary as showing the actual murders. That's a quality you don't see in movies very much. Only the old horror movies from the 30's and 40's could do that. And now also Henry can. I advise everyone to see this movie, if they haven't already. Not just if you're a fan of horror or thrillers, but also if you appreciate good movies in general. Even the most critic movie buffs can only find this film terrific. It was on many many levels a very important film.",
         "Henry Lee Lucas was the son of a prostitute and a railway worker.His mother seems to have detested the child and treated him with sadistic cruelty.In January 1960 he murdered his mother during the course of a quarrel,slashing at her with a knife.He was sentenced in a forty years in prison,but was recommended for parole after ten years.After that he met another drifter Ottis Toole.The two teamed up and left a bloody trail through Michigan,Ohio,Indiana,Illinois and Wisconsin.When Lucas was arrested he confessed to a total of three hundred and sixty murders(many of these admissions proved to be false).Both-Lucas and Toole-were sentenced to death.\"Henry:Portrait of a Serial Killer\" is a pretty good film.Michael Rooker as a psychopathic killer is really believable.The supporting cast is also great.The scene when Lucas and Toole watch themselves murdering a family,who they tie up and kick to death,is very disturbing.A must see for any fan of the genre.Check it out,you won't be disappointed.",
         "This low-budget film gets high marks because it's entertaining, despite the perversity of the subject matter. It's only 83 minutes long and it moves very fast. Some will be turned off big-time with the shocking brutality of this film, but that's what it is about - a cold-blooded killer (Michael Rooker, playing real-life killer Henry Lee Lucas) with seemingly no conscience, and a stupid partner (Tom Towles as \"Otis Toole\"), who is about as bad. \"Chilling\" is a good word to describe these guys. The only part of the movie which was repugnant to me was the scene in with Rooker and Towles break into a house, terrorize a woman and videotape it. Other than that, this is fun to watch in a sick way. This, and the French movie, \"Man Bites Dog,\" are the two movies in my collection I am embarrassed (morally speaking) to say I own and find fascinating to watch. There are only three main actors in this film: Rooker, Towles (playing fellow killer, Otis Toole, a real dumb-ass trashy character) and his kid sister, \"Becky\" (Tracy Arnold). All three are extremely interesting. The rest of the people are all victims of those two guys who go on a killing spree that is almost a daily occurrence for a short time. It's absurd, but that's the story. It caused quite a star when it was released. It was given a rare NC-17 rating. Nowadays, it would be \"R\" with no fanfare. This is a very sick story, but it sure is interesting."
      ],
      "genres": [
         "Biography",
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Maljack Productions"],
      "summaries": [
         "Loosely based on serial killer Henry Lee Lucas, the film follows Henry and his roommate Otis who Henry introduces to murdering randomly selected people. The killing spree depicted in the film starts after Otis' sister Becky comes to stay with them. The people they kill are strangers and in one particularly gruesome attack, kill all three members of a family during a home invasion. Henry lacks compassion in everything he does and isn't the kind to leave behind witnesses - of any kind.",
         "Henry likes to kill people, in different ways each time. Henry shares an apartment with Otis. When Otis' sister comes to stay, we see both sides of Henry; the \"guy-next-door\" and the serial killer. Low budget movie, with some graphic murder scenes.",
         "What would you do if you found out that the person living right along side you is really a serial killer, who engages in bizarre acts of sex with people and animals, living and dead, who killed his own mother? Well, meet Henry. He is a typical under-paid bug spray guy who lives amongst you. He is not Freddy or Jason, he's real. Henry was serving time in jail for killing his mother. He cannot seem to keep his story straight in his head, he can't really recall how he killed that one. She was cruel to him. She made him wear a dress to school, and she made him watch her have sex with dirty old men. He couldn't take it anymore, so one day, he just killed her. No remorse. He hooked up with a friend named Otis, and the two are living together. Otis' sister is moving in too, because she doesn't have any money. They are an interesting trio, each with their own set of morals. Otis' sister begins to fall for Henry, who has wonderful manners and seems to look out for her. Otis on the other hand, he just wants to see his sister naked. Henry and Otis go out for beers one night, and Henry introduces him to the act of murder. They kill a few prostitutes, and a \"hot\" items salesman. There is no limit to what they will do once they get a taste for it. Otis is becoming quickly addicted, and he can't pull himself out of the web Henry has weaved. That poor girl has no idea what is going on with them. She begins to date Henry. The two appear to fall in love. The cops don't have a clue. Henry is too smart for them. If you shoot one, and stab another, they will never make the connection between the two murders. It all becomes so random that it seems normal death to the police. Henry also has transportation on his side. He travels from town to town once the heat gets too heavy. He can pick up a few hitchhikers on the way and kill them. Bingo! A new guitar. This movie is very shocking, because you only see one or two of the fifteen murders happen, the rest you just see the before and after, with no middle. It makes you wonder what the hell was going on in between.",
         "Based on the true life serial killer, Henry Lee Lucas."
      ],
      "budget": 111000
   },
   "movielensId": 2159,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-09-24",
      "dvdReleaseDate": "1998-11-03",
      "directors": ["John McNaughton"],
      "runtime": 83,
      "movieId": 2159,
      "title": "Henry: Portrait of a Serial Killer",
      "mpaa": "R",
      "actors": [
         "Michael Rooker",
         "Tracy Arnold",
         "Tom Towles",
         "David Katz",
         "Mary Demas",
         "Anne Bartoletti",
         "Elizabeth Kaden",
         "Ted Kaden",
         "Denise Sullivan"
      ],
      "imdbMovieId": "0099763",
      "originalTitle": "Henry: Portrait of a Serial Killer",
      "genres": [
         "Crime",
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "OHVHqOoQf5k",
         "IU3P6WXzvXU"
      ],
      "plotSummary": "Henry likes to kill people, in different ways each time. Henry shares an apartment with Otis. When Otis' sister comes to stay, we see both sides of Henry: \"the guy next door\" and the serial killer.",
      "tmdbMovieId": 10692,
      "avgRating": 3.39716,
      "releaseYear": "1986",
      "numRatings": 1760,
      "posterPath": "/jE9bDB7v7lMED5PWpPMsmc3SzlI.jpg"
   }
}