{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mutation",
            "id": 2766
         },
         {
            "name": "aggression by plant",
            "id": 4015
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "tomato",
            "id": 6388
         },
         {
            "name": "vegetable",
            "id": 6401
         },
         {
            "name": "low-budget",
            "id": 9660
         },
         {
            "name": "parody",
            "id": 9755
         },
         {
            "name": "mad scientist",
            "id": 10125
         },
         {
            "name": "b movie",
            "id": 11034
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0080391",
      "video": false,
      "title": "Attack of the Killer Tomatoes!",
      "recommendations": [
         15482,
         10513,
         48885,
         19142,
         27313,
         20424,
         36089,
         30924,
         28180,
         18498,
         27815,
         5677,
         29058,
         28172,
         26946,
         28452,
         49673,
         70500,
         39867,
         16665
      ],
      "backdrop_path": "/n8jSLMc8zT2p1rELAUyRCc3VN7B.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Mason Dixon",
               "gender": 2,
               "credit_id": "52fe433ec3a36847f804560d",
               "name": "David Miller",
               "profile_path": "/pdZrx5QFu8wuy3cpbcGJKw3UAsX.jpg",
               "id": 22354,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Jim Richardson",
               "gender": 2,
               "credit_id": "52fe433ec3a36847f8045635",
               "name": "George Wilson",
               "profile_path": "/esKSxIzrTwUUeVXmRweqVUUfS4F.jpg",
               "id": 27587,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Lois Fairchild",
               "gender": 1,
               "credit_id": "52fe433ec3a36847f8045611",
               "name": "Sharon Taylor",
               "profile_path": "/z7xF3QqesWblV2gdZEoutJhrCAD.jpg",
               "id": 22355,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Wilbur Finletter",
               "gender": 2,
               "credit_id": "52fe433ec3a36847f8045615",
               "name": "J. Stephen Peace",
               "profile_path": "/9V7Wna8fg5ptxwGQQxEZTtANY4h.jpg",
               "id": 22356,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "The President",
               "gender": 0,
               "credit_id": "52fe433ec3a36847f8045631",
               "name": "Ernie Meyers",
               "profile_path": null,
               "id": 22371,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Senator Polk",
               "gender": 2,
               "credit_id": "5484424f92514168cd00022d",
               "name": "Eric Christmas",
               "profile_path": "/dCs1h8vhRjNNfmJeHuVgcVE6ZwI.jpg",
               "id": 4976,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Salesman",
               "gender": 2,
               "credit_id": "5746249d9251415e69000067",
               "name": "Jack Riley",
               "profile_path": "/vuVw6plHloObuA04Ha5pWkJza1H.jpg",
               "id": 62590,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Guard at Gate",
               "gender": 0,
               "credit_id": "57a897b5c3a36826c60077f5",
               "name": "Nigel Barber",
               "profile_path": "/65K0zCPQMWxJXJlGnm9HdMlU44x.jpg",
               "id": 1404403,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Janitor / Charles White",
               "gender": 2,
               "credit_id": "57a897d8c3a368365a0063e2",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Sergeant",
               "gender": 2,
               "credit_id": "57a89a12c3a36835f6005ce8",
               "name": "Gregg Berger",
               "profile_path": "/fIb7F9PiTY8kcWfmRlgZ2G7FMOh.jpg",
               "id": 19547,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Man in Library",
               "gender": 2,
               "credit_id": "57a8a272c3a36826c6007d7f",
               "name": "Costa Dillon",
               "profile_path": "/wPONClMivshyVfNFzyOGvGc3bRt.jpg",
               "id": 22357,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f80455f1",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f80455f7",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f80455fd",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f8045603",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f8045609",
               "name": "John De Bello",
               "profile_path": "/xSdEXPGCshu7Zga1T3EXXGvLaQN.jpg",
               "id": 22353,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f804561b",
               "name": "Costa Dillon",
               "profile_path": "/wPONClMivshyVfNFzyOGvGc3bRt.jpg",
               "id": 22357,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f8045621",
               "name": "J. Stephen Peace",
               "profile_path": "/9V7Wna8fg5ptxwGQQxEZTtANY4h.jpg",
               "id": 22356,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433ec3a36847f8045627",
               "name": "Rick Rockwell",
               "profile_path": null,
               "id": 22358,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe433ec3a36847f804562d",
               "name": "John K. Culley",
               "profile_path": null,
               "id": 22361,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.395884,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2182,
      "vote_count": 90,
      "budget": 90000,
      "overview": "Attack of the Killer Tomatoes is a 1978 comedy film directed by John De Bello and starring David Miller. The film is a spoof of B-movies. Made on a budget of less than USD $100,000, the story involves tomatoes becoming sentient by unknown means and revolting against humanity.",
      "similar": [
         872,
         4638,
         14831,
         4258,
         1694,
         8005,
         15482,
         15493,
         3034,
         22572,
         351819,
         36685,
         40264,
         2759,
         30197,
         9442,
         18193,
         28658,
         409447,
         16093
      ],
      "original_title": "Attack of the Killer Tomatoes!",
      "runtime": 87,
      "poster_path": "/3vohBv1acbgscmf0lODu5AbCKF2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Four Square Productions",
         "id": 989,
         "origin_country": ""
      }],
      "release_date": "1978-10-01",
      "vote_average": 4.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Killer Tomatoes! Collection",
         "id": 47983,
         "poster_path": "/dle8G0LFT8d4MAS2BFFJhwBjn0Q.jpg"
      },
      "tagline": "Aaargh!...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John De Bello"],
      "runtime": 83,
      "synopsis": "The film opens with a scroll saying that when Alfred Hitchcock's film The Birds (1963) was released, audiences laughed at the notion of birds revolting against humanity, but when an attack perpetrated by birds occurred in 1975, no one laughed. This is followed by a pre-credits sequence of a tomato rising out of a woman's garbage disposal unit. Her puzzlement turns into terror as the tomato draws her into a corner. Following the opening credits, the police investigate her death. One officer discovers that the red substance she is covered with is not blood, but tomato juice. A series of attacks perpetrated by tomatoes occur (including a man dying by drinking tomato juice made from a killer tomato, a boy heard being gobbled up by a killer tomato, and a sequence where the tomatoes attack innocent swimmers in a bay area of San Diego, in a parody of 'Jaws'). While the President's press secretary, Jim Richardson, tries to convince the public that there is no credible threat, the president puts together a team of specialists to stop the tomatoes led by a Euro-American man named Mason Dixon. Dixon's team includes Sam Smith, an African-American disguise expert who is seen at various points dressed as, among other things, George Washington, Abraham Lincoln and Adolf Hitler; Euro-American Navy diver Greg Colburn; Central-Russo Russian Olympic swimmer Gretta Attenbaum; and Euro-American parachute-toting soldier Wilbur Finletter. Smith is sent out to infiltrate the tomatoes at a campfire, eventually blowing his cover while eating a hamburger and asking if anyone could \"pass the ketchup\". Colburn and Gretta are sent to sectors, while Finletter stays with Mason. Meanwhile, the president sends Richardson to the fictitious ad agency \"Mind Makers,\" where executive Ted Swan spends huge amounts of money to develop virtually worthless ploys including a bumper sticker with \"STP\" for \"Stop Tomato Program\" on it, a satirical reference to the real \"whip inflation now\" campaign and its widely ridiculed \"WIN\" slogan. It is revealed that a human is also plotting to stop Dixon when a masked assassin attempts to shoot him, but misses. A senate subcommittee meeting is held where one secret pamphlet is leaked to a newspaper editor who sends reporter Lois Fairchild on the story. While she tails Finletter, he mistakes her for a spy and trashes a hotel room attempting to kill her. He then chases the assassin as the masked man fails again to kill Dixon, but loses him. Gretta is killed and further regression has led leaders to bring in tanks and soldiers to the west coast in a battle that leaves the American forces in shambles. Dixon, walking among the rubble, sees a trail of tomato juice and decides to investigate. He ends up being chased by a killer tomato to an apartment where an oblivious child is listening to the radio. The tomato is about to kill Dixon but suddenly flies out the window. Dixon peers out to see if it has died when he spots the assassin hijacking his car. He chases the assassin on foot until he is knocked out when it is revealed that Richardson is behind the tomatoes. He is about to reveal his secret of control when Finletter charges in and runs him through. Dixon, picking up some strewn records, realizes that both times the tomatoes left him the new hit song \"Puberty Love\" had been on the radio. He orders Finletter to gather all remaining people and bring them to the stadium, which is soon attacked by the tomatoes. The tomatoes are cornered in a stadium. \"Puberty Love\" is played over the loudspeaker, causing the tomatoes to shrink and allowing the various people at the stadium to squash them by stomping on them repeatedly. Fairchild, meanwhile, is cornered by a giant tomato wearing earmuffs. Dixon saves her by showing the tomato the sheet music to \"Puberty Love.\" He professes his love to her, in song. The film ends with a carrot that rises from the Earth and says \"All right, you guys. They're gone now.\" The end credits title card appears which is a joke to stay tuned for the sequel, \"Attack of the Killer Carrots\".",
      "writers": [
         "Costa Dillon",
         "John De Bello"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080391/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM1NjE1MTE0NF5BMl5BanBnXkFtZTgwNjA2MjI4MzE@._V1._CR43,54,1240,1936_SX214_AL_.jpg",
      "actors": ["Stars: David Miller, George Wilson, Sharon Taylor | See full cast and crew »"],
      "reviews": [
         "I will be the first to admit I absolutely ADORE this film. I absolutely love the sendup of horror films that seemed to exist up to that time. However, it really is a bad film. I gave it a 5. Why, I think it is honestly a movie you will either love or hate. It is hard to be ambivalent about this film. The effects are cheesy, the dialogue silly, and the concept even sillier. Yet, I don't think it could of been pulled off any better. I think everyone should check this film out at least once, but do it with friends. \"Could someone please pass the ketchup?\"",
         "Some may call this the worst movie of all times, but if you have shots like \"The Toxic Avenger\", \"Plan 9 from outer space\" or \"Dracula Vs. Frankenstein\" in your collection this is exactly the right film for you! The humor in \"Attack of the Killer Tomatoes\" appears like a cheap version of Zucker/Abrahams/Zucker-flicks à la \"Airplane!\" or \"The Naked Gun\", but always pretty entertaining and amusing! If you´re in search for the right stuff for your next party check this out - but don´t do the mistake and take this too serious in any way!!",
         "\"Tomatoes\" has been unfairly maligned as one of the worst movies of all time. This is too bad, because the film is really a satire of cheap, bad sci-fi movies. So what better way to satirize a cheap, bad sci-fi movie than by unintentionally making one? If you saw this movie as a child or teenager, scenes will be indelibly imprinted upon your mind. The guy taking a shower in a hallway; the dubbed voice of the Japanese scientist; the helicopter crash (which wasn't supposed to happen...the pilot came in at too steep of an angle and crushed the back rotor blade. The pilot lost control and crashed the copter. The producers, not wanting to waste this precious filming of an actual accident, put it in the film and instructed actor Jack Riley to pretend to crawl away from the smoldering wreckage); the tomato chasing a woman in a parking lot, with oh-so-noticeable wheels propelling it forward; ah, the magic of film. Brought to you in part by future California state Assemblyman and State Senator J. Stephen \"Rock\" Peace.",
         "The trailers before the movie on my VHS copy are for a Hannah Barberra cartoon (\"Yogi bear in the Arabian Nights\" or something) which shows you who the marketing guys thought their target audience was and, taken on that kind of dumb stupid cartoon level, this is one of the funniest things I have seen for years. I laughed out loud several times whilst completely sober and on my own. Yes, its story structure is an utter mess, yes, the acting, directing, editing production values and sound (especially the sound) are awful, yes, a lot of the gags just don't work - the timing is all over the place sometimes jokes are rushed, other times they are stretched out way beyond their worth but as a whole \"Tomatoes\" is undeniably funny. I'm afraid I nearly wet myself when the Adolf Hitler line came as the payoff to a what looked like a lame running gag. Reading some of the reviews here I find it hard to understand how anyone can be disappointed in this movie. It lays its stall out in the first two minutes. Girl is attacked by a tomato - then some of the funniest opening credits ever. It is so preposterous it defies criticism. This is the purest form of High Concept movie making. \"Attack of the Killer Tomatoes\"... unless you didn't actually KNOW what a tomato was how could anyone think this is anything other than what it is - a dumb, stupid, funny movie? and I defy anyone who watches this film not to have the theme song running around their head for days afterwards. Think of this movie as being made by Matt Stone & Trey Parker (the guys behind South Park etc.) and you get the idea - though in my opinion \"Attack of the Killer Tomatoes\" is a lot funnier than \"Cannibal, the Musical\" or \"Orgazmo\". Definitely a movie to watch with your brain, and any critical faculties you may think you have, switched very, very off.",
         "Many have claimed this is the worst movie of all time. I would rather sit through this 100 times than watch 10 minutes of Titanic!! To rate this movie you must watch it for the way it was intended, pure unadulterated B-Grade movie garbage. Then you will find there is only one vote to give it,... 10/10",
         "Ok it's crap, but very funny crap. It lacks so much logic, effects, story and talent that it's really worth looking at. One of those crap movies, that are even good by being crap. You know ;) Watch it on a geek party with some beer and you will have lotsa fun",
         "This film combinds funny jokes with funnier unintentional humor and the result is one of the funniest cult films ever. The rest of the series is o.k., but the original is amazing. Horrible effects galore. make sure you try to grab the original version and not the director's cut. The new version is remastered in better quality, but they altered the film and it just isn't as cool that way. my rating 5/5 and for directors cut 4/5",
         "This film was perhaps THE big low-budget/cult/parody flick in its time. While it doesn't create belly laughs from start to finish, it does have some truly hilarious moments. My favorite scene has dozens of tomatoes just floating in a lake, attacking some unsuspecting summer-campers(believe me, you'll positively crack up when you see the underwater footage!). Also, watch for the sequence in which grown men blast with shotguns tomatoes that were obviously rolled at them off-camera.",
         "The easiest way to describe this movie is as a satire. The target of the satire is quite vast, from the US Government to corporate America. It is also not a stinging satire, but rather a silly one. Think of this movie as a mix between the Kentucky Fried movie, Airplane and Police Squad series, done with a much smaller budget and not as funny. I can see how this movie is a satire of many sci-fi disaster movies from the 50's and 60's. I see this movie as a big influence on Tim Burton's Mars Attacks. The plot is simple enough. Genetically engineered giant tomatoes go \"crazy\" and start attacking people and cities. At first there is a cover up and then it blows over into full blown war. The movie runs the gamut of characters and characterizations : Lois \"Fairchild\" (a Lois Lane clone), a very ambitious Presidential Press Secretary, Clark Kent, Mason Dixon (FIA agent who hasn't worked since the Bay of Pigs), a useless President (who only seems to be able to sign his name and attack New York), an even inept Congress, a sleazy marketing CEO, and Mason's team consisting of an obese East German \"female\" swimmer, a scuba diver, a crazed WWII paratrooper and an African-American disguise expert (disguised as George Washington, Abraham Lincoln, Hitler and finally as a tomato). Did I also forget to mention, lots and lots of tomatoes? There are all kinds of tomatoes from small tomatoes, to giant plastic tomatoes, to smashed tomatoes, to tomato juice and finally to people dressed up as tomatoes. On top of all this, you have a couple of musical numbers as well. They aren't that good and seem to be dubbed. The best tune is by far the theme of the movie (\"Attack of the Killer Tomatoes\"). It is way too catchy and you might end up humming or singing it in public. Be warned. Most of the movie is quite amusing and shows the absurdity of various real life situations as well as various entertainment genres. I don't believe I was induced to laughter, but mostly smiled and scratched my head. I definitely recommend this movie for fans of B and C grade movies, but only as a rental. -Celluloid Rehab",
         "Attack of the killer tomatoes is low-budget's answer to summer blockbuster Snakes on a Plane. Technically, it's the other way around, since AOTKT came first, but whatever. It's dumb, it has a small cult following, and you understand the plot when you read the title. Tomatoes, you know, the kind in salads, attack people. This is shown in the movie, mostly as tomatoes being thrown at people with tomatoes on the ground everywhere. This continues for an entire movie, which might sound repetitive, but there's other side-tracks of the story as well, which more often than not are very funny. The production values are non-existent but the filmmakers do their best to cover them up(\"I'm sorry, gentlemen, for the size of this room\", the general says and then all the scientists climb over each other to get a seat) There are lots of silly plot points and many totally unnecessary, some funny and some not. Whenever it gets draggy, there's usually something really funny just in time. That's not bad. If you need to have this told to you, then you will not like this movie, but I'll tell you anyway: Do NOT take this movie seriously. Enjoy the musical numbers, the stupid \"Jaws\"-like tomato attacks, the crazy characters, and all the other details that in then end makes AOTKT a fun experience."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Sci-Fi",
         "Musical"
      ],
      "productionCompanies": ["Four Square Productions"],
      "summaries": [
         "After a wave of reports of mysterious attacks involving people and pets being eaten by the traditionally docile fruit, a special government task force is set up to investigate the violent veggies and put a stop to their murderous spree. Included in this crack team are a lieutenant who never goes anywhere without his parachute, an underwater expert who's never out of his scuba gear, and a master of disguise who conceals his appearance by dressing as a black Adolf Hitler.",
         "A group of scientists band together to save the world from mutated tomatoes that KILL!"
      ],
      "budget": 90000
   },
   "movielensId": 2163,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1978-10-01",
      "dvdReleaseDate": "2003-09-23",
      "directors": ["John De Bello"],
      "runtime": 87,
      "movieId": 2163,
      "title": "Attack of the Killer Tomatoes!",
      "mpaa": "PG",
      "actors": [
         "David Miller",
         "George Wilson",
         "Sharon Taylor",
         "J. Stephen Peace",
         "Ernie Meyers",
         "Eric Christmas",
         "Jack Riley",
         "Nigel Barber",
         "John De Bello",
         "Gregg Berger",
         "Costa Dillon"
      ],
      "imdbMovieId": "0080391",
      "originalTitle": "Attack of the Killer Tomatoes!",
      "genres": [
         "Comedy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["nWu6uOBSCVc"],
      "plotSummary": "Attack of the Killer Tomatoes is a 1978 comedy film directed by John De Bello and starring David Miller. The film is a spoof of B-movies. Made on a budget of less than USD $100,000, the story involves tomatoes becoming sentient by unknown means and revolting against humanity.",
      "tmdbMovieId": 2182,
      "avgRating": 2.50438,
      "releaseYear": "1978",
      "numRatings": 1942,
      "posterPath": "/3vohBv1acbgscmf0lODu5AbCKF2.jpg"
   }
}