{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0094077",
      "video": false,
      "title": "Surf Nazis Must Die",
      "recommendations": [
         60383,
         59138,
         62330,
         59744,
         47044,
         29693,
         27070,
         17923,
         69860,
         27994,
         13948,
         28169
      ],
      "backdrop_path": "/9zW4dRU3wX4c5g51WBrWIp4P4YC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Eleanor 'Mama' Washington",
               "gender": 1,
               "credit_id": "52fe4576c3a368484e05cc27",
               "name": "Gail Neely",
               "profile_path": null,
               "id": 166827,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Leroy",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05cc2b",
               "name": "Robert Harden",
               "profile_path": null,
               "id": 1271818,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Adolf",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05cc2f",
               "name": "Barry Brenner",
               "profile_path": null,
               "id": 1073197,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Eva",
               "gender": 1,
               "credit_id": "52fe4576c3a368484e05cc33",
               "name": "Dawn Wildsmith",
               "profile_path": "/eCcaRztus48JCKCDhPFl7mc2NdW.jpg",
               "id": 97699,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mengele",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05cc37",
               "name": "Michael Sonye",
               "profile_path": null,
               "id": 97868,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Hook",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05cc3b",
               "name": "Joel Hile",
               "profile_path": null,
               "id": 1271819,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Brutus",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05cc3f",
               "name": "Gene Mitchell",
               "profile_path": null,
               "id": 49876,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Smeg",
               "gender": 2,
               "credit_id": "52fe4576c3a368484e05cc43",
               "name": "Tom Shell",
               "profile_path": "/ucz3PCdRyUfHJA95xbPxZkOJhHU.jpg",
               "id": 99809,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Smeg's Mom",
               "gender": 1,
               "credit_id": "52fe4576c3a368484e05cc47",
               "name": "Bobbie Bresee",
               "profile_path": null,
               "id": 100476,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Ariel",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05cc4b",
               "name": "Tom Demenkoff",
               "profile_path": null,
               "id": 1271821,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mex",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05cc4f",
               "name": "John Williamette",
               "profile_path": null,
               "id": 549452,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Teeth",
               "gender": 0,
               "credit_id": "52fe4576c3a368484e05cc53",
               "name": "Rand Hogen",
               "profile_path": null,
               "id": 1271822,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Wang",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc57",
               "name": "Daniel Kong",
               "profile_path": null,
               "id": 1271824,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Yin",
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc5b",
               "name": "Steve Reid",
               "profile_path": null,
               "id": 1271825,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Yang",
               "gender": 2,
               "credit_id": "52fe4577c3a368484e05cc5f",
               "name": "Terry Lee",
               "profile_path": null,
               "id": 1018508,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Blow",
               "gender": 0,
               "credit_id": "58bcb889c3a368515d028a8d",
               "name": "Ted Prior",
               "profile_path": "/rcYCjIZ4OIJB1cTet2jwk6EjXCa.jpg",
               "id": 45346,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Smeg's Girl in Pink",
               "gender": 1,
               "credit_id": "58bcb8af9251416077046324",
               "name": "Dianne Copeland",
               "profile_path": null,
               "id": 45361,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Dead Fisherman",
               "gender": 0,
               "credit_id": "58bcb8bc925141609b0448a1",
               "name": "Gary J. Levinson",
               "profile_path": null,
               "id": 98620,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc65",
               "name": "Jon Ayres",
               "profile_path": null,
               "id": 1198732,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4577c3a368484e05cc6b",
               "name": "Peter George",
               "profile_path": null,
               "id": 1195866,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4577c3a368484e05cc71",
               "name": "Jon Ayres",
               "profile_path": null,
               "id": 1198732,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 2,
               "credit_id": "575089999251413ee100029a",
               "name": "Peter George",
               "profile_path": null,
               "id": 1195866,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 2.734311,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28070,
      "vote_count": 28,
      "budget": 0,
      "overview": "When the grandson of a gun wielding woman is murdered by neo-nazi surf punks in the post-apocalyptic future, this grandma hunts them down for some bloodthirsty revenge.",
      "similar": [],
      "original_title": "Surf Nazis Must Die",
      "runtime": 83,
      "poster_path": "/ntK9jm6IeTs0mxID4VKXTL8RpZS.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [],
      "release_date": "1987-07-03",
      "vote_average": 3.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter George"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Jon Ayre",
         "Peter George"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094077/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyOTEwNjAxMl5BMl5BanBnXkFtZTcwNDAwOTUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gail Neely, Robert Harden, Barry Brenner | See full cast and crew »"],
      "reviews": [
         "A great title leads you to great expectations. \"Surf Nazis Must Die\" is a title that DEMANDS a movie overflowing with needless sex and unnecessary violence. Characters should be killing and dying and stripping and screwing ceaselessly and pointlessly from beginning to end. It should be filled with bizarreness, crammed with oddities that were included not because they make sense, but because somebody in the cast or crew thought it was a good idea at the time. \"Surf Nazis Must Die\" should have been the cinematic equivalent of 'found art.' Alas, it isn't. Rather the filmmakers told a largely conventional story of revenge in a largely conventional manner. And when there wasn't enough content to fill out the movie, instead of throwing in some irrelevant bits of sex, violence or weirdness, they fluffed up the scenes carrying the main storyline, making them slow and dull, instead of quick and sharp. Even the sex and violence that IS in the movie is dull and forgettable. But this is common enough in the low budget world - and not a sin - where high quality is expected to be beyond the means and talent of the filmmakers. But they should remember that quantity is also a quality and that a pile of low-grade industrial diamonds can be worth more than a few gemstones.",
         "Surf Nazis Must Die is one of the best films to be distributed by Troma and sadly, one of the least appreciated. The IMDb voters who briefly put the film in the bottom 100 should be strapped down and forced to watch Driving Miss Daisy until they come to their senses. I even disagree with the reviewers who lump the film in the \"so bad it's good\" category. I think Surf Nazis Must Die is simply good. In comparison to many of its low budget contemporaries, the writing in SNMD is positively Shakespearian. The film has some semblance of a plot, the jokes are actually funny and the action is well paced. Most surprisingly, the film has a bizarre feel-good quality, which could almost be described as wholesome (if you look past the violence, sex and foul language). This is largely due to film's sympathetic heroine, the awesome Eleanor Washington, who vows to single-handedly take out the members of an evil beach gang (the titular \"surf Nazis\") after they kill her beloved son. In addition to Eleanor, the film's minor characters also have a lot to offer. Smeg's relationship with his mother is hilarious and the surf Nazis are wonderfully tasteless, with members being named after Nazi \"luminaries\". The director makes several very obvious references to A Clockwork Orange, but despite their eye make-up and swastikas, these gang members are about as chilling as the Goonies. The inevitable bloodshed is rather low key and the gore effects are simplistic at best. However, the innovative use of hooks and speedboats more than makes up for any lack of carnage. Unlike many zero budget action films, SNMD does not rely on blood splatter or gratuitous sex to pass the time - which under normal circumstances I would consider to be a huge failing. However, SNMD is generally in such poor taste and overflows with sardonic humour to the point where the film becomes utterly irresistible. Surf Nazis Must Die is a brilliantly conceived beach holocaust drama/revenge thriller that you can enjoy with the entire family. Forget about the low IMDb rating and brace yourself for this evocative masterpiece.",
         "...but the film fails to live up to it, unfortunately. No, not for the reasons that most other reviewers have stated. It's Troma...so I EXPECTED bad acting, thin plot, hilariously bad dialogue, etc. That's why I watch Troma flicks in the first place. No, the reason that Surf Nazis doesn't live up to its brilliant title is that it isn't outrageous enough. It's far too tame for a Troma film, as far as I'm concerned. When I first heard about this movie, I was psyched up to see it. Why? Because when you think \"Surf Nazis Must Die,\" in conjunction with the name \"Troma Films,\" you just expect something completely twisted...full of sex, gore, and sick humor. You know...a TROMA movie. But the bulk of this movie just doesn't live up to the expectation that I had. This is atypical Troma, and not even all Troma fans will appreciate it. But hey, I guess it's not that bad. But with a title like Surf Nazis Must Die, Troma should have done better.",
         "For, amongst other things, the excellent soundtrack, for having a character called \"smeg\",for the lush shots of the sky and the bunker area, and for the immortal line \"taste some of mommas home cooking Adolf\", this films deserves 10 out of 10. I think the films worst enemies were Troma themselves for the misleading cover art and hyping up the title by adding the \"must die\" part. I think many people will be disappointed because they are taken in by the cover and blurb. Here in Britain the film was originally released simply as \"Surf Nazis\" and featured a less sensational cover, you knew more what to expect, although the \"a clockwork orange for the 1980's\" tag line was a bit of a joke.",
         "If you don't like this film, it is because you don't really understand. Go pay your seven or fifteen bucks and plop down at the local cinemark, because if you don't stuff like this, it just isn't for you. But if you can take a joke, then the thing is interesting. I haven't seen a bunch of Troma's catalogue, but I think it is one of the more memorable flicks there; it certainly isn't Tromeo and Juliet or Terror Firmer, but I don't understand the claim that it isn't a typical Troma film. At least it wasn't something like \"Outlaw Prophet\" (which put Troma on a blacklist with my wife). It was a genuine trash film, and taken as such seems as good as any other work of trash. What makes this movie good is the fact that the kids have all given themselves new names, a fact that comes up when Smeg is talking to his mom (who claims he shouldn't call her mom). That is just choice. Or the fact that the Nazis are all queens in hiding. I like the not so subtle homo-eroticism. Of course, not only could both of these elements been mobilized more effectively, but there are other things it could have hit on. The apocalyptic oil pumping could have been used better, along with placing Leroy as part of the energy company pumping the beach dry. I was hoping that the fact that there is a big disjunction between the bourgeoisie expectations of Leroy and the ludicrous turf wars of the surf gangs could have been put to better use. So to all you people who didn't like this because of the film making-- you are just wrong. This is what good ol' not so Hollywood film looks like. Like all real films, it's flaws are that it doesn't exploit everything that it could.",
         "Although the title, combined with the Troma label, will make most people go into this film with low expectations, I feel the need to say that \"Surf Nazi's Must Die\" is definitely worth seeing. A lot of the acting is sub-par, sure, and the writing isn't exactly fantastic, but it manages to be very entertaining throughout; the soundtrack, in particular, is fantastic. Certain scenes nicely incorporate off-key humor, yet the filmmakers didn't intend to make a comedy; in fact, they take themselves rather seriously, a decision which I'm sure is one of the reasons this film is so maligned. It seems like those involved in the making of this film were enjoying what they were doing, for the most part, and I think they made a well-paced, consistently interesting B-movie. Well worth seeing.",
         "When I first heard about this movie, I thought it would be the greatest movie ever made. First of all, it's called Surf Nazis Must Die. Second of all, it's about an old fat black lady seeking revenge against a gang called the surf Nazis who killed her son. Third of all, it was released by Troma. It seems nearly impossible for somebody to screw this movie up, but they did. It was just one big boring scene after another and Momma Washington didn't do too much fighting with the surf Nazis. Somebody with talent needs to remake this would be tromasterpiece. This would be the end of my review but I need at least 10 lines. I don't understand why they think you can only describe a movie in 10 or more lines. And I have seen reviews that have been far less the 10 lines. How did they do that?",
         "It's because of films like these, which serve as the reason why Troma rules. OK. So Troma's got some stinkers out there after 30+ yrs of experience, but not many. They are, by far, the best low budget schlock makers in the world! The only ones who can hold a candle to them might be say Full Moon & Roger Corman. If ya like Troma's stuff, then check them out too. But one thing: where were the sharks in this one? I would've loved to see one of those surf Nazis or various other chomped by a shark. And while although it's been a while since I've seen this, I don't recall even seeing a fin's tip. The scene where the \"n\" word was used just conjures up memories of my own personal experiences as a boy nicely. Of course I didn't murder anybody and brag about it in the wide open in front of two girls before. What a jackass! In nearly 30 years, now *damn where did the time go?* there unfortunately hasn't been a sequel to its name. And I would love to see one more ridiculously good time w/ the surf Nazis. At least this film, along w/ most other troma films, doesn't take itself near as seriously as the blockbusters who just come off as stupid. And yes, if you will read my review carefully, I'm pretty much agreeing w/ another commenter who also called it, \"ridiculously good.\" That much it is. I gave this a 7, which is the highest I gave a movie of its kind so far.",
         "OK, OK, first of all, I love Troma. Lloyd Kaufman is a brilliant man, creating a company that is entirely based around camp horror with humor, most of them with talented actors (or untalented ones, just for old time's sake) and distributed them out to filmfans. You can tell a film is a Troma film if it includes the following: 1) B-movie actors (although, they do have SOME well known celebs in their films 2) Over-the-top gore and violence, not disturbing, more nasty and disgusting, but for humorous purposes. 3) Kinky sex scenes, filled with soft-corn porn, Lesbian interaction, outrageous sex-jokes 4) Virtually no plot. But a hilarious title for the film. When I heard about \"Surf Nazis Must Die\", I probably jumped three feet in the air for joy. I mean, what else do you want? Surfing, Nazis, a angry Black woman, TROMA?!? It should be the PERFECT Troma film! Unfortunately, this particular film makes you wonder why Kaufman didn't kick director Peter George in the teeth after seeing the final cut of the film. In the end, the only thing the film succeeds in being a good Troma movie is the title...thats it. Well, where do we start? There's virtually no plot. I know, I know, I wasn't expecting \"On the Waterfront\", but come on...even \"The Toxic Revenger\" had somewhat of a plot, and if not, over the top violence...this had nothing. The story set somewhere in the future (at least the 80's/early 90's version of the future, where tie-dye shirts are still in style apparently), where an Earthquake has destroyed most of the California coast line (ummm...ooook). Out of the chaos, surfing gangs begin a war to stake claim over the beach. One of the most ruthless gangs is....OK, is that obvious? The surf Nazis. The Nazis are really just a bunch of scraggly lookin' white supremacists who wear tethered clothing with poorly drawn swastikas written on them. Adolf is the leader...hmm, clever. He looks like he's about 40 years old, but hangs out with high school kids. The others are Eva, Sneg, Gangdala and Hook, and none of them have any back story (althought for some odd reason, they try to portray Sneg as being some dumb, naive teenager with a mother who is worried about him, in some pointless subplot). Adolf tries to unite all the gangs on the beach so they can rule the coastline (a plot line ripped off of the far-more superior film, \"The Warriors\"), but none of them want to be under the command of the Nazis, so one by one, they turn on them and are killed...end of that story. Now, there's a young man named Leroy with his tough-as-nails mother who live near the beach. Leroy, being black, is attacked by the Nazis and killed. This leads Leroy's Momma to escape from her retirement home and seek revenge against the murderers. I basically told you the entire flick. It's that basic and small. You probably get more out of watching the trailer for the film than watching the actual film. The violence is surprisingly toned down, with virtually no gore, which makes it look like a film made over the weekend at a budget of $75 dollars. The fight scenes are poorly choreographed, looking like they improvised it at the set. The acting...eh, it's alright. One thing I noticed is that they tried to make this film look more serious than campy...which is the kiss of death, being that the film is called....SURF Nazis MUST DIE!!! Oh, thats another thing...it's called \"SURF Nazis MUST DIE\", but in the film, only three of them are actually killed (out of a gang of about 7, not including the youth punks). Scenes were long and boring, with very little pay off. The surfing scenes were nice, though. Obviously, it was footage of professionals surfing in Hawaii (California does NOT have that nice of waves) and most of the film was shot in my home town of Huntington Beach. It you wanna watch a good Troma movie, watch \"Tromeo & Juliet\" or \"Cannibal! The Musical!\" instead. Leave this one to wipe-out, and hang to dry.",
         "This film unashamedly attempts to replicate Kubrick's 'A clockwork Orange' and is also similar to other youth gang movies such as 'Romper Stomper' and 'Suburbia' The issues of radical politics, racism, disillusioned youth, vengeance and gang violence are all addressed, but there is nothing original about this film. There is excellent cinematography and an interesting synth score which seems appropriate. The story focuses around a the 'surf Nazis' the dominant surfer gang in California, they kill a young African American, but things go wrong for the gang when the victim's Mother seeks a bloody revenge. The story is simple and the acting pretty abysmal, but if you're a fan of the amateur charm of Troma movies then this probably won't bother you, as long as you accept there are a lot less laughs and a lot less tits than other Troma classics such as 'Class of Nuke 'em High'"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Drama",
         "Horror"
      ],
      "productionCompanies": ["Troma Entertainment"],
      "summaries": ["When the grandson of a gun wielding woman is murdered by neo-nazi surf punks in the post-apocalyptic future, this grandma hunts them down for some bloodthirsty revenge."],
      "budget": 0
   },
   "movielensId": 2164,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Pусский"
      ],
      "releaseDate": "1987-07-03",
      "dvdReleaseDate": "1998-03-25",
      "directors": ["Peter George"],
      "runtime": 83,
      "movieId": 2164,
      "title": "Surf Nazis Must Die",
      "mpaa": "R",
      "actors": [
         "Gail Neely",
         "Robert Harden",
         "Barry Brenner",
         "Dawn Wildsmith",
         "Michael Sonye",
         "Joel Hile",
         "Gene Mitchell",
         "Tom Shell",
         "Bobbie Bresee",
         "Tom Demenkoff",
         "John Williamette",
         "Rand Hogen",
         "Daniel Kong",
         "Steve Reid",
         "Terry Lee",
         "Ted Prior",
         "Dianne Copeland",
         "Gary J. Levinson"
      ],
      "imdbMovieId": "0094077",
      "originalTitle": "Surf Nazis Must Die",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Q8LV1S2q2GA"],
      "plotSummary": "When the grandson of a gun wielding woman is murdered by neo-nazi surf punks in the post-apocalyptic future, this grandma hunts them down for some bloodthirsty revenge.",
      "tmdbMovieId": 28070,
      "avgRating": 2.1453,
      "releaseYear": "1987",
      "numRatings": 234,
      "posterPath": "/ntK9jm6IeTs0mxID4VKXTL8RpZS.jpg"
   }
}