{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dance",
            "id": 1691
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "beautiful woman",
            "id": 9767
         },
         {
            "name": "dance contest",
            "id": 10104
         },
         {
            "name": "ballroom dancing",
            "id": 10106
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0120576",
      "video": false,
      "title": "Dance with Me",
      "recommendations": [
         31078,
         78051,
         44455,
         121763,
         36790,
         10120,
         20333,
         201724,
         13526,
         37305,
         75531,
         43708,
         253259,
         68247,
         239552,
         86531,
         40546,
         78229,
         36046,
         45225
      ],
      "backdrop_path": "/uDzrtotTMIo6X6DJ9s4iaYaswG7.jpg",
      "revenue": 15,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ruby Sinclair",
               "gender": 1,
               "credit_id": "52fe47529251416c750953a5",
               "name": "Vanessa Williams",
               "profile_path": "/25QMiae8zSvSYObHDbYn1mgbOrz.jpg",
               "id": 27011,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Rafael Infante",
               "gender": 2,
               "credit_id": "52fe47529251416c750953af",
               "name": "Chayanne",
               "profile_path": "/cFSDYfmmnvx5fv5jqiehiKVw1S4.jpg",
               "id": 168373,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "John Burnett",
               "gender": 2,
               "credit_id": "52fe47529251416c750953b3",
               "name": "Kris Kristofferson",
               "profile_path": "/hiGkNoiAwnUgY9XZ3YhiWMvKngi.jpg",
               "id": 10823,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Bea Johnson",
               "gender": 1,
               "credit_id": "52fe47529251416c750953b7",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Patricia Black",
               "gender": 1,
               "credit_id": "52fe47529251416c750953bb",
               "name": "Jane Krakowski",
               "profile_path": "/sOeuLd0MLBk3M6P0nyvZ8TCDUeK.jpg",
               "id": 13636,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Lovejoy",
               "gender": 1,
               "credit_id": "58a96317c3a3680bd400475f",
               "name": "Beth Grant",
               "profile_path": "/zAT9GvzJE0ytL3C36L461cgKI9p.jpg",
               "id": 5151,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47529251416c750953ab",
               "name": "Randa Haines",
               "profile_path": null,
               "id": 19798,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53dbbf8b0e0a26482800011e",
               "name": "Michael Covertino",
               "profile_path": null,
               "id": 1348423,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.87344,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17915,
      "vote_count": 32,
      "budget": 0,
      "overview": "Young Cuban Rafael just buried his mother, and comes to Houston to meet his father John for the first time. The difficult part is that John doesn't know he is Rafael's father. John runs a dance studio, and everyone prepares for the World Open Dance championship in Las Vegas. It soon becomes clear Rafael is a very good dancer, and Ruby is the biggest hope for the studio at the championship.",
      "similar": [
         9291,
         22881,
         8923,
         9762,
         2300,
         10637,
         227306,
         323677,
         11287,
         43923,
         10474,
         297762,
         2280,
         9563,
         27586,
         2323,
         86130,
         13416,
         2771,
         3134
      ],
      "original_title": "Dance with Me",
      "runtime": 126,
      "poster_path": "/5BVHdE90wQullQl63oTjHbcSJLS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Mandalay Entertainment",
            "id": 1236,
            "origin_country": ""
         }
      ],
      "release_date": "1998-08-21",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "In the dance of life, love can happen in a heartbeat.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Randa Haines"],
      "runtime": 126,
      "synopsis": null,
      "writers": ["Daryl Matthews"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120576/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2MjM2NTEyNl5BMl5BanBnXkFtZTYwMjM2MjE5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Vanessa Williams, Chayanne, Kris Kristofferson | See full cast and crew »"],
      "reviews": [
         "I saw the movie \"DANCE WITH ME\" because there was nothing else interesting on. If I had known it would be so entertaining I would have watched it years ago. Like \"STRICTLY BALLROOM\", it is a beautiful mix of music, fun and dancing. This movies shows an intensity and passion between 2 people that is lacking in most modern movies. Most movies never develop a love story.....rather they jump into some steamy sexual situation. What happened to leaving things to our imagination....Happily Ever After!!! Don't get me wrong, the script was lacking at times, but the performers made up for it with energy, and realism. Who can't relate to being torn between something you love and something you want. Vanessa L. Williams is outstanding. If she had starred in \"MOULIN ROUGE\", I may have been able to watch the whole thing. Vanessa is one of the few MULTI-TALENTED PERFORMERS(singer, actress and NOW dancer)overlooked by Hollywood. Few women can do it all. Not since the likes of Judy Garland, Audrey Hepburn, and Ginger Rodgers. \"DANCE WITH ME\" is worth watching.",
         "This is one of my all-time favorites, yet I wouldn't call the film great in the usual sense. It doesn't have an intricate plot, and some will be frustrated at the limited interaction between the stars, Williams and Chayanne. (I wasn't but that's me.) The film's spirit - with its dancing and Latin music - makes it something special. The acting was superb, and there was a nice mix of characters. But the dancing really steals the show - it makes you want to get up and join them. I recommend this to anyone who enjoys a mix of light drama and dancing.",
         "This movie is very good eye candy. The music and the dancing pulls you into the movie. Sometimes I just forgot that they were telling a story because almost in every scene there was movement, feeling and attention in the dance choreography. It was a wonderful display of dancing and choice in music. Some may not like the movie because it lacks a strong storyline, but there are no new ideas. We all know what hidden behind door number 1, 2 and 3. Nonetheless, it is not that the movie doesn't stray into the unknown; it is that the movie has attraction, heat, and passion especially with the chemistry between Chayanne and Vanessa. I even like the music video that complements the movie. Chayanne has done a great job in his first English role and better yet he has the moves to back it up. Although Vanessa is heard in the movie speaking extremely poor Spanish, she did a wonderful job in the Spanish version of \"You are my home\" it was great!",
         "as someone who enjoys dancing and anything Latin i have to say i loved this film. Maybe its because I'm female and can be a bit soppy at times but i loved Rafael and Ruby, and must say I found Rafael Infante very sexy. I thought the dancing was very interesting and had me watching with anticipation and I enjoyed every minute. I'm also a fan of ally McBeal so enjoyed watching Jane Krakowski as Patricia too. which was followed by a very amusing little dance by an older lady whose name i can't remember but who said \"I wanna do that too\". I loved the outfits and wow Rubys dress in her final dance was amazing! Just hoping it is going to come out on DVD in the UK now!",
         "A must see! Chayanne (Rafael) is incredibly sexy and Vanessa Williams (Ruby)looks amazing. Chayanne from Puerto Rico, who has been a singer for years, has proven himself multi-talented. Not only can he sing, he can DEFINATLY dance, and act too! Vanessa is one of those women you love to hate - especially in this movie. Utterly Gorgeous, she dances like a dream and in the duet with Chayanne \"You are my home\" she even sings great too! The Chemistry between the two leads is electrifying, especially evident in the Dance championships and in the club scenes. Well casted. Ruby's young son is irresistable and Bea is the grandma everyone wants. The music is so incredibly catchy - I have the soundtrack, which also contains a couple of songs not in the movie which should be, but unfortunatly leaves out some that are in the movie that should be on the CD as well! There is also \"Dance with Me 2\" which contains songs not in the movie but in the syle of. Features Chayanne and Vanessa Williams, Gloria Estefan, Sergio Mendes, DLG (who have a role in the movie performing at the club Rafael and Ruby go to), Ruban Blades and more! I think I must have seen this movie over 25 times and I never get sick of it! I've almost memorised the script! Would have been nice to embelish the father-son relationship of Rafael and John (Kris Kristofferson), but this may well have detracted from the dance scenes. And I definatly would have liked more on the romance between the two leads...! I hope Chayanne does more movies as he has a talent for it and I'm hanging out for more perving! Oh, and more dancing too!",
         "I saw this film by chance on cable TV. I was captivated from the start and stayed with it to the end (a major feat for a remote \"trigger finger\" like me). I read the cable synopsis and thought, \"Uh oh! Cliché city!\" But, to my surprise, this film was not clichéd and the film was like a breath of fresh air. The performances, for the most part, were true and honest. Chayenne (as Rafael, a Cuban émigré) is charming and acts well in his English-language film debut. Vanessa Williams is stunning, as always. And the music! Picante! The dance sequences are excellent and Chayenne is an excellent dancer as is Vanessa. Chayenne has a soulful demeanor and with his eyes and subtle facial inflections, he made me feel his loneliness as a stranger in a new land. Many times, I thought the film would sink into gooey sentimentality, but again, to my surprise, it rose above such obviousness. The best scene in the film is when Chayenne is caught in a lawn sprinkler system that turns on unexpectedly. With great charm and wit, Chayenne does an excellent homage to Gene Kelly, but with his own style and grace. A wonderful and funny scene. I recommend this film if you want to hear some great Latin music, see some great dancing and be captivated by Chayenne and the beautiful Vanessa Williams. By the way, Kris Kristofferson is very good as the man who gives Rafael (Chayenne) a place to live upon arriving from Cuba and who plays a key role in Rafael's adjustment to a new life in America.",
         "I think this was a wonderful, refreshing movie. The dancing was suburb! Chayanne, the new Latin sensation, was absolutely wonderful. He fills the screen with such charm and charisma......he steals the movie! Vanessa Williams was exciting and beautiful. Both Chayanne and Vanessa made the most electrifying couple! The rest of the cast added just the right touch to complete this ensemble. The dancing and music was well worth just seeing the movie!",
         "This movie was one of the greatest Latin dance movies. I myself dance and i love the way it focused around the fact of REAL Latin DANCING (afro-cuban) and ballroom Latin dancing. The only thing that i could picture wrong with the film was not enough dancing, but i tell you, when the dance scenes hit the screen they REALLY hit it :). The great choreography, and great music, couldn't stop smiling. Some low points of the film was with father son chats, which just seem like they were there to fill in time. The cast was a great choice. Chayanne (Latin singer) who moves are unique and fun and that makes u smile. And Vanessa L. Williams, was trained to the extent of a real ballroom champion. With all of this it included comedy, many funny lines which make it memorable, and a lasting feeling that will make you want to take up salsa dancing :) If you enjoy this movie, rent out dirty dancing havana nights, forbidden dance lambada, salsa motion picture (oldie but a goodie)",
         "This movie instantly became a favorite of mine, it's full of warmth and charm, the characters are real and enchanting, and Chayanne (Rafael) is absolutely captivating! I could hardly take my eyes off of him during the entire movie. Watch for the scene where he dances in the sprinklers, he's absolutely charming! (I could go on for days about him but I'll spare you). Vanessa Williams (Ruby) is every bit his equal though, not only is she breathtakingly beautiful, but her dancing is some of the best I've ever seen in any movie. (I still can't figure out how she dances so well in those shoes!) As for the supporting cast, Joan Plowright (Bea) can even steal a scene from Chayanne! She's adorable as one of the older, but very enthusiastic dance students. Her second performance in the Las Vegas competition is another one of my favorite scenes. Do not miss this movie! (Now, where do I sign up for Chayanne's fan club???)",
         "The old dance films of Fred Astaire and Ginger Rogers, and Gene Kelly, may have been a technical marvel, but they also understood that dancing was a form of communication, of things left unsaid. This film fits right in with that tradition, though of course it's using more modern dances, but I think Astaire would look at the chemistry between Chayanne and Williams when they're dancing, and approve. You can tell director Randa Haines is a fan of the dancing the way she lovingly photographs it, and gives all the dancers a chance to shine, especially during the long dance scene at the club. She's also the first director who really gives Williams a chance to cut loose and show her talent. I don't know much about Chayanne, but he's good too. So the plot isn't much. Who watches musicals just for the plot? And actually, I liked how they handled certain aspects, like the dance competition and how Chayanne and Williams resolve their feelings for one another without even dancing together. The only real criticism I have is the movie is a little too long, but that's only a quibble."
      ],
      "genres": [
         "Drama",
         "Romance",
         "Music"
      ],
      "productionCompanies": [
         "Mandalay Entertainment",
         "Ballroom Dancer"
      ],
      "summaries": ["Young Cuban Rafael just buried his mother, and comes to Houston to meet his father John for the first time. The difficult part is that John doesn't know he is Rafael's father. John runs a dance studio, and everyone prepares for the World Open Dance championship in Las Vegas. It soon becomes clear Rafael is a very good dancer, and Ruby is the biggest hope for the studio at the championship."],
      "budget": 0
   },
   "movielensId": 2168,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-21",
      "dvdReleaseDate": "1999-01-12",
      "directors": ["Randa Haines"],
      "runtime": 126,
      "movieId": 2168,
      "title": "Dance with Me",
      "mpaa": "PG",
      "actors": [
         "Vanessa Williams",
         "Chayanne",
         "Kris Kristofferson",
         "Joan Plowright",
         "Jane Krakowski",
         "Beth Grant"
      ],
      "imdbMovieId": "0120576",
      "originalTitle": "Dance with Me",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": ["s9-9uvi1iQ0"],
      "plotSummary": "Young Cuban Rafael just buried his mother, and comes to Houston to meet his father John for the first time. The difficult part is that John doesn't know he is Rafael's father. John runs a dance studio, and everyone prepares for the World Open Dance championship in Las Vegas. It soon becomes clear Rafael is a very good dancer, and Ruby is the biggest hope for the studio at the championship.",
      "tmdbMovieId": 17915,
      "avgRating": 3.03665,
      "releaseYear": "1998",
      "numRatings": 573,
      "posterPath": "/5BVHdE90wQullQl63oTjHbcSJLS.jpg"
   }
}