{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "fraternity house",
            "id": 171400
         },
         {
            "name": "pot",
            "id": 171401
         },
         {
            "name": "teen suicide",
            "id": 171411
         },
         {
            "name": "autopsy room",
            "id": 171416
         }
      ],
      "imdb_id": "tt0118301",
      "video": false,
      "title": "Dead Man on Campus",
      "recommendations": [
         6020,
         20309,
         107934,
         22792,
         47070,
         24081,
         41579,
         76297,
         41971,
         14475,
         27465,
         47045,
         20242,
         200580,
         75531,
         21332,
         399786,
         83489,
         35225,
         33068
      ],
      "backdrop_path": "/nXdDrS9DiAcRevMCwTXgzPuSYEz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Josh",
               "gender": 2,
               "credit_id": "52fe46009251416c75069c75",
               "name": "Tom Everett Scott",
               "profile_path": "/5f85Hirx8TYIvb9irRtBSrqsq11.jpg",
               "id": 16857,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cooper",
               "gender": 2,
               "credit_id": "52fe46009251416c75069c79",
               "name": "Mark-Paul Gosselaar",
               "profile_path": "/y5GHzu45UsMzIEOUeGM4jIurFr7.jpg",
               "id": 19184,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Rachel",
               "gender": 1,
               "credit_id": "52fe46009251416c75069c7d",
               "name": "Poppy Montgomery",
               "profile_path": "/AvILGeLZoeK5CEQtbSBcaubRMBA.jpg",
               "id": 77028,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cliff",
               "gender": 2,
               "credit_id": "52fe46009251416c75069c81",
               "name": "Lochlyn Munro",
               "profile_path": "/caBPICexFi48JIvsEdwJGjQrTmY.jpg",
               "id": 58058,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Buckley",
               "gender": 2,
               "credit_id": "52fe46009251416c75069c85",
               "name": "Randy Pearlstein",
               "profile_path": null,
               "id": 69803,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Matt",
               "gender": 2,
               "credit_id": "52fe46009251416c75069c89",
               "name": "Corey Page",
               "profile_path": null,
               "id": 77029,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe46009251416c75069c8d",
               "name": "Alyson Hannigan",
               "profile_path": "/vZw7AEUOs9lbkS0lYzDyaFp9Tjv.jpg",
               "id": 21595,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Kristin",
               "gender": 1,
               "credit_id": "52fe46009251416c75069c91",
               "name": "Mari Morrow",
               "profile_path": "/ivvkGg3Oq36eiu1o4PFEJkT4rxp.jpg",
               "id": 42743,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Hank",
               "gender": 2,
               "credit_id": "52fe46009251416c75069c99",
               "name": "Mark Carapezza",
               "profile_path": null,
               "id": 77031,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Jerry",
               "gender": 0,
               "credit_id": "52fe46009251416c75069c9d",
               "name": "Jeff Tarpley",
               "profile_path": null,
               "id": 77032,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Kyle",
               "gender": 2,
               "credit_id": "52fe46009251416c75069ca1",
               "name": "Jason Segel",
               "profile_path": "/49zyYG6HSQm76mN1SLmCCzgIN0Y.jpg",
               "id": 41088,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Kelly",
               "gender": 1,
               "credit_id": "52fe46009251416c75069ca5",
               "name": "Linda Cardellini",
               "profile_path": "/iwmPwZARlFIKOqwEVuYIgPOc4WX.jpg",
               "id": 1817,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Pickle",
               "gender": 2,
               "credit_id": "52fe46009251416c75069ca9",
               "name": "Aeryk Egan",
               "profile_path": null,
               "id": 51215,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Guidance Counselor",
               "gender": 1,
               "credit_id": "52fe46009251416c75069cad",
               "name": "Judyann Elder",
               "profile_path": "/o5swKKUwN4oCf44OhowICmjZncg.jpg",
               "id": 77033,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Zeke",
               "gender": 2,
               "credit_id": "59815b3d92514151ed00b164",
               "name": "Dave Ruby",
               "profile_path": null,
               "id": 77030,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46009251416c75069cb3",
               "name": "Alan Cohn",
               "profile_path": null,
               "id": 111247,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46009251416c75069cb9",
               "name": "Anthony Abrams",
               "profile_path": null,
               "id": 58745,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46009251416c75069cbf",
               "name": "Adam Larson Broder",
               "profile_path": null,
               "id": 58746,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "5883ffd89251410460012cbd",
               "name": "Gale Anne Hurd",
               "profile_path": "/oRWGpXdIm2lu870aaKpgO3wy19n.jpg",
               "id": 869,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "588be790c3a3687846000cb4",
               "name": "David Gale",
               "profile_path": "/b4MJOQRqAk2rIpMJ4vL9QBbj3qA.jpg",
               "id": 1746321,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.413118,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14557,
      "vote_count": 58,
      "budget": 0,
      "overview": "Josh Miller (Tom Everett Scott) is a studious and responsible pre-med student entering college as a freshman. His wild, hard-partying roommate Cooper Frederickson (Mark-Paul Gosselaar), on the other hand, is a spoiled rich kid who never studies and spends his time getting drunk and ogling co-eds. Before long, Cooper's fun-filled lifestyle has corrupted Josh, and both are on the verge of flunking out.",
      "similar": [
         17899,
         11004,
         8363,
         9352,
         19053,
         325133,
         627,
         86838,
         15037,
         122081,
         634,
         2770,
         4247,
         106646,
         109414,
         39939,
         195589,
         179144,
         376659,
         8469
      ],
      "original_title": "Dead Man on Campus",
      "runtime": 96,
      "poster_path": "/aZ0RzokVfR7ocmX0E3xy8mYrkOm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/kc7bdIVTBkJYy9aDK1QDDTAL463.png",
            "name": "MTV Films",
            "id": 746,
            "origin_country": "US"
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-08-21",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alan Cohn"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Anthony Abrams",
         "Adam Larson Broder"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118301/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2MDk1MzYzN15BMl5BanBnXkFtZTcwNjkzNDQyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom Everett Scott, Mark-Paul Gosselaar, Poppy Montgomery | See full cast and crew »"],
      "reviews": [
         "This comedy is fun. It's not meant to education; it's meant to entertain. Mark Paul Gosselaar shines as a comedic actor, and his talents were further evidenced after he was an NYPD Blue addition (a HUGE contrast from DMOC, obviously.) The premise is unique, and the acting was good. Yes, it may lag a bit in the 2nd act and the writing can become a tad labored, but nonetheless, this is a totally fun movie with great performances and hijinx. If you have not seen it, get a group of friends together who actually have a sense of humor, get some good eats, and have a blast.",
         "This film is one of the most underrated films i have ever seen. The film follows 2 roommates Coop and Josh and there plan to have a roommate kill himself so they can achieve straight A's. Although that storyline only comes in the second half of the film for the first half we just spend the time in college with the boys. The chemistry between the 2 leads is great and Mark Paul Gosselar sort of plays his role as Zack from SBTB for a more adult audience ( which i thought was genius), his charisma meant that I was never bored.why he never broke into the A list I don't know. but its all politics. It is one of the most quotable films i have ever seen,with so many great characters The comedy here is not for everyone but if you like films which don't take themselves seriously then this is for you. The soundtrack is also great and has Dust Brother as executive producers would you believe it (they did the soundtrack for fight club among others) The icing on the cake though is Cliff O Malley the insane party Animal who really should have got more screen time, he makes every scene he is in and I was just crying with laughter, he really is a match for Bluto. This film is great to watch with a bunch of mates I give it 9/10",
         "I own this movie and watch it several times a year. Why? Because when you are studying for exams you wish your school had a policy like this (and you could fake a death because who really wants a roommate to die?) I find people are over-analyzing, and you have to take any movie with a grain of salt. All movies require a suspension of disbelief, as much of this is unbelievable, but it's a freakin' comedy! Not a statement on life. It pokes fun at a situation where many of us have been: most of us go through a slacker phase where the world is just too tough and you have to forget, just relax a little... still don't get how if we all need this there are still so many consequences but I digress. Most of the intelligent stuff has been said already so I won't bore you by repeating the same sentiments. However, I do recommend this movie for when you can't get papers/exams out of your mind but you still need a break (or if you just feel like reliving that part of your life). It's better than \"The Perfect Score\" but that movie is also good for study breaks.",
         "I've seen some of the bad comments that the users gave and was quite surprised.Seriously folks,this is one REALLY entertaining movie.I was laughing throughout the movie. I believe that Mark and Tom really played their parts superbly.Being a university student,I really could relate with what was happening and I think that made it funnier to watch Cooper and Josh make plans only to find that it fails :-) Obviously,this is not some kind of serious,thinking movie....and thank God,it doesn't try to be.Full of humor and sarcastic jokes,I am sure you'll enjoy this movie especially if you're a college/university student....I've watched it 3 times and still laugh when watching it! The music is also superb,considering the fact that it was produced by THE dust brothers...so.....sit back,relax....after a hard day's of studying/whatever the hell u do in college....and watch Dead Man On Campus! Satisfaction guaranteed.",
         "I rented this with my friend one night, some years ago, I still consider it the best comedy I've seen in my entire life. We were literally in pain all through out the film, we laughed so hard that for most of the movie we were on the floor holding our stomachs! Then we watched it again right after and then the next day and laughed as hard as the first time. I remember Mark-Paul Gosselaar from Saved By The Bell, I had no idea he could be this funny. The cast is diverse and completely wild, especially the possibly-suicidal-roommate candidates that the two main characters are trying to lure to stay with them. Corey Page (from Heartbreak High) is completely phenomenal as the over-the-top angsty, brooding goth-rocker Matt and Lochlyn Munro (Charmed) is just too much as the crazy frat guy Cliff, these two guys gave us the best laughs. Also I liked the relationship between the main characters, played by Mark-Paul Gosselaar and Tom Everett Scott. It's that kind of \"lets go do something stupid together\" kind of thing and you can also see they really care about each other. As a hilarious comedy, the movie also has a little depth to it towards the end, which i really liked. Also for Buffy fans there is Alyson Hannigan who is a great comedic actor as you can see from the American Pie-movies and of course from Buffy. If you like the Pauly Shore-type of humor, and crazy ideas and general crazyness, you should love this film. There wasn't a moment during, that I wasn't completely thrilled to be watching it. I give it 10+!",
         "Dead Man on Campus is a movie that need not be taken too seriously. Deadman on Campus is full of stupid jokes and typical junk from any \"college comedy\" like this. The cast Mark-Paul Gosselaar and Tom Everett Scott were excellent choices. Deadman on Campus is entertaining and fun movie for those who don't take anything too seriously.",
         "I can see why though. When this flick was released in theatre I thought it looked like garbage. Zack is back, I thought oh great. But then six months back I watched it on pay. Needless to say I was blown away. This movies has some unique characters. Cliff O'malley has some choice jokes and Buckley is great. I mean just look at those self portraits on his wall. One thing I expected was some lame Saved by the Bell jokes, which obviously isn't the case. The dark humour is fantastic. The cast fit each other so well, this helps you forget the ridiculous premiss of the movie. Dead Man shouldn't be taken seriously, that wasn't the writers intentions. It's a fun movie that I would like to see more of in the future. By that I mean a teen movie which doesn't suck. The soundtrack was also a great high point. Any soundtrack with Supergrass is terrific. The fact that it was full of great music that hasn't been pounded into your head by MTV deserves some respect. The chef recommends Dead Man on Campus. Forget the trailer, it wasn't marketed properly.",
         "\"Dead Man On Campus\" is a film about two guys who enroll at Daleman College, and become roommates. Josh enrolls via a scholarship, and is studying to become a doctor, and Cooper, well, he's just there to avoid having to clean toilets for a living at his father's business, and of course, to goof off and party. Josh eventually decides to party with Cooper, and as a result, starts to fail every class he's in. He winds up failing his mid-terms, and he finds out that he needs to maintain a B+ average if he wants to keep his scholarship. One night, while the boys are at a local bar, they find out that if your roommate commits suicide, you get straight As for your grief, so they decide to move a suicidal roommate into their dorm! In my opinion, the best roommate they find is a no holds barred psychotic named Cliff O'Malley (played by the underrated Lochlyn Munro). Cliff is my favorite character in this film! He's so wacky, and he completely lacks sanity or a conscience! Most of his dialogue and facial expressions in this film are priceless! As for their other roommates: Buckley: He's a computer nerd who's paranoid, suicidal, and thinks Bill Gates is after his brain! Matt Noonan: He's the \"depressed\" goth rock star who acts happy and likes to sing show tunes when no one's around! In the end: For off the wall teen comedies, this is as good as it gets. This movie originally bombed at the box office when released in August of 1998, and seems to be forgotten nowadays, but trust me, it's funny, and the character Cliff totally makes it worth the admission! It's bound to become a cult classic sooner or later.",
         "I'm an idiot. I loved this movie. Not only did I watch it MORE than once, I bought the DVD so now I have the benefit of watching this highly underrated piece of trash anytime I want. Let me do a brief description of Dead Man on Campus for those out there who don't know: An uptight med-student Scott (Werewolf in Paris) moves in with constantly partying Gossellar (you guessed it, Saved by the Bell) and starts to loosen up a bit. In the midst of all the all-night beer blasts and sex, the two start flunking out. They hear from a drunk, that if a roomate kills himself, then the other will be awarded a 4.0 grade-average. So starts the search for a suicidal roommate. Now the premise is nowhere near as funny as it thinks, but what really gives this one staying power is its assortment of characters. Everyone loves Cliff O'Malley and his \"I got some beers....Let's drink em'!!!\" and who can ever forget the pseudo, British goth-boy Matt Noonan. His hairbrush scene is a riot and worth a rental in itself. This is a no-brainer movie people and it's exactly what you would expect from an MTV production. The only thing missing is the gratutitus nudity that was so prevalent in the slew of college party-comedies of the 80s. What the hell, you can't have everything right? This one has almost enough laughs to make up for it. Call the boys over, crack open some Coors and laugh your ass off.",
         "I started to watch this movie not expecting anything other than a few laughs. It turned out to be a lot more, Hilarious is the word I'm looking for. Basic plot revolves around 2 collage students, both roommates, one is smart(Josh) and wants to do the best he can in his exams, he studies and doesn't party. The other(Cooper) is intent on doing no work, doesn't go to his classes, likes his bong and late night party's. Cooper slowly pulls Josh into his world of Partys and Beer and it starts to show on his Collage work. Then comes the wacky loophole that if they have a roommate that commits suicide then there other roommates automatically pass there exams. Now, Enter the wacky roommates, handpicked by Cooper and Josh, that are all \"on the edge\". The rest will have your sides splitting. All the Characters play their parts well, especially the insane roommates, but none more so than Cliff. He steals the show and whenever the film was getting boring and uninteresting, he would pop back up and bring this hilarious comedy back to life. Typical Teenage comedy packed with laughs but a rather far fetched plot, Cliff's wacky ways of dealing with cop car chases and putting out hair fires make this stand out above most."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Paramount Pictures",
         "MTV Productions",
         "Pacific Western"
      ],
      "summaries": [
         "Two college roommates go out and party, resulting in bad grades. They learn of the \"if your roommate dies, you get an A\" clause, and decide to find someone who is \"on the verge\" so to speak to move in with them.",
         "Two students, one, a slacker, and the other, a student on scholarship, find out in their college's charter that if your roomate commits suicide, you get straight As for your grief. They then go looking for the perfect roomate when the student on scholarship starts to fail his classes.",
         "Two college roommates go out and party, resulting in bad grades. They learn of the clause that says, \"If your roommate dies, you get an A,\" and decide to find someone who is on the verge, so to speak, to move in with them."
      ],
      "budget": 14000000
   },
   "movielensId": 2169,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-21",
      "dvdReleaseDate": "1999-03-09",
      "directors": ["Alan Cohn"],
      "runtime": 96,
      "movieId": 2169,
      "title": "Dead Man on Campus",
      "mpaa": "R",
      "actors": [
         "Tom Everett Scott",
         "Mark-Paul Gosselaar",
         "Poppy Montgomery",
         "Lochlyn Munro",
         "Randy Pearlstein",
         "Corey Page",
         "Alyson Hannigan",
         "Mari Morrow",
         "Mark Carapezza",
         "Jeff Tarpley",
         "Jason Segel",
         "Linda Cardellini",
         "Aeryk Egan",
         "Judyann Elder",
         "Dave Ruby"
      ],
      "imdbMovieId": "0118301",
      "originalTitle": "Dead Man on Campus",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["PZbXDnXEpfk"],
      "plotSummary": "Josh Miller (Tom Everett Scott) is a studious and responsible pre-med student entering college as a freshman. His wild, hard-partying roommate Cooper Frederickson (Mark-Paul Gosselaar), on the other hand, is a spoiled rich kid who never studies and spends his time getting drunk and ogling co-eds. Before long, Cooper's fun-filled lifestyle has corrupted Josh, and both are on the verge of flunking out.",
      "tmdbMovieId": 14557,
      "avgRating": 2.73441,
      "releaseYear": "1998",
      "numRatings": 1203,
      "posterPath": "/aZ0RzokVfR7ocmX0E3xy8mYrkOm.jpg"
   }
}