{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "falsely accused",
            "id": 769
         },
         {
            "name": "death penalty",
            "id": 2122
         },
         {
            "name": "violin",
            "id": 4721
         },
         {
            "name": "attempt to escape",
            "id": 5034
         },
         {
            "name": "violinist",
            "id": 8608
         },
         {
            "name": "spoof",
            "id": 11931
         }
      ],
      "imdb_id": "tt0120901",
      "video": false,
      "title": "Wrongfully Accused",
      "recommendations": [
         10535,
         9644,
         41579,
         16299,
         10411,
         34322,
         10563,
         34309,
         27993,
         18856,
         12280,
         9680,
         16384,
         9438,
         8860,
         9308,
         9448,
         16806,
         11244,
         71142
      ],
      "backdrop_path": "/snqU4BpNiaTKZ0HSMGVnoMffomf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ryan Harrison",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41e3",
               "name": "Leslie Nielsen",
               "profile_path": "/cZpuTfE1j63tCEXoSL2A7KZjk5d.jpg",
               "id": 7633,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hibbing Goodhue",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41e7",
               "name": "Michael York",
               "profile_path": "/hW0uWJtsKWsWAQ9k7EYq9sn5YCH.jpg",
               "id": 13919,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lauren",
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b41eb",
               "name": "Kelly LeBrock",
               "profile_path": "/gk9cVP7V8muOcc8ygC8owV1YhF.jpg",
               "id": 46948,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Cass Lake",
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b41ef",
               "name": "Melinda McGraw",
               "profile_path": "/2teouIhRdYzFPL1dNZ2Anq2qi2e.jpg",
               "id": 58692,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Security Guard #2",
               "gender": 0,
               "credit_id": "52fe44f5c3a36847f80b421d",
               "name": "Alexander Boynton",
               "profile_path": null,
               "id": 1235421,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Sergeant Tina Bagley",
               "gender": 1,
               "credit_id": "56d5b78ac3a3681e440195e6",
               "name": "Leslie Jones",
               "profile_path": "/2cXrwJoX0QHGBtNMsMLqeF6bR3s.jpg",
               "id": 168452,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41f5",
               "name": "Pat Proft",
               "profile_path": null,
               "id": 12991,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b41fb",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4201",
               "name": "Bernd Eichinger",
               "profile_path": "/oBQqBzLhwGhcIV3iYnjfyl7jMR9.jpg",
               "id": 673,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4207",
               "name": "Pat Proft",
               "profile_path": null,
               "id": 12991,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b420d",
               "name": "Bill Conti",
               "profile_path": "/cR6H9EFVkeGP0TnoX9RPNBB6hSN.jpg",
               "id": 10494,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4213",
               "name": "James R. Symons",
               "profile_path": null,
               "id": 13432,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4219",
               "name": "Glen MacPherson",
               "profile_path": null,
               "id": 22818,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 8.493708,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9417,
      "vote_count": 108,
      "budget": 0,
      "overview": "Ryan Harrison, a violin god, superstar and sex symbol does not want to cheat on sexy Lauren Goodhue's husband with her. Mr. Goodhue is found murdered and Ryan suddenly finds himself being the main suspect. After being sentenced to death he manages to flee while being transferred to his execution site. Now, all the world is after him as he stumbles from one unfortunate incident to the next in order to prove himself innocent - by finding a mysterious one-eyed, one-armed, one-legged man...",
      "similar": [
         5503,
         1368,
         4258,
         8005,
         687,
         10498,
         351819,
         9267,
         10354,
         40264,
         13825,
         2182,
         15493,
         11587,
         52371,
         377587,
         78206,
         38087,
         13707,
         47947
      ],
      "original_title": "Wrongfully Accused",
      "runtime": 87,
      "poster_path": "/rf9wKcXwItrtG4CSvUgEmuY6XAh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/wVi7hRRKlhoGBnVqRnUGfqEtLZ2.png",
            "name": "Pathé Films",
            "id": 4959,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-08-21",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "It's not just a movie. It's every movie.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pat Proft"],
      "runtime": 87,
      "synopsis": "World-famous violinist Ryan Harrison (Leslie Nielsen) is seen giving a concert. Afterwards, he goes to a party where he meets Hibbing Goodhue (Michael York), a millionaire who sponsors Harrison's performances, as well as Goodhue's seductive wife Lauren (Kelly Le Brock) and his possible mistress Cass Lake (Melinda McGraw). The next evening, he finds a note from Lauren in his car which summons him to the Goodhue residence. When he goes to the Goodhue mansion, he bumps into Sean Laughrea (Aaron Pearl), who has just killed Goodhue (together with an unknown accomplice). A violent fight follows, during which Harrison discovers that Sean is missing an eye, an arm, and a leg, and he overhears the preparations for an operation with the codename \"Highlander\" before he is knocked out. When he wakes up, Harrison finds himself arrested and convicted for the murder of Goodhue. Desperate to prove his innocence, Harrison escapes from his prison transport following an accident. Lieutenant Fergus Falls (Richard Crenna) arrives on the scene with his two partners, takes charge, barks out orders and vows to do whatever it takes to capture the fugitive. Harrison returns to the Goodhue mansion where he encounters Cass, who is trying to retrieve something from behind a portrait. She tells him she knows he's innocent and believes Lauren is the killer, but refuses to say anything to the police because Lauren is her sister. She provides him with a place to hide and helps him shake his pursuers, but Harrison's opportunities to rest are short and fleeting: Falls seems to find him wherever he goes, and Cass behaves suspiciously, increasing Harrison's doubts of whom to trust. Harrison gradually begins to piece together the puzzle; he remembers that Sean was present at the party as the bartender and was given a great amount of money by Cass. He also finds that Cass is strangely interested in Sir Robert McKintyre, the secretary-general of the United Nations. Eventually, after investigating Sean's disabilities in a limb replacement clinic, he discovers that Cass, Lauren and Sean are planning an assassination attempt on McKintyre. He manages to follow the group but is caught. Cass shoots Harrison but actually fakes his death, both because she has fallen in love with him and because she wants to stop the assassination, since she has found out that McKintyre is really her father. Goodhue has been murdered by Sean and Lauren because he had come to suspect that his wife was actually a terrorist and had only used him to further her goals. At a Scottish festival, Harrison and Cass just barely manage to save McKintyre's life. They are cornered by Lauren, Sean and accomplices, but Fergus Falls and a SWAT team arrive just in the nick of time, arresting the terrorists. Falls officially tells Harrison that he was \"wrongfully accused\", clearing his name and acquitting him. In the last scene, the exonorated Harrison and Cass go on a cruise and are seen are riding on the bow of a cruise ship (spoofing 'Titanic') and end up bumping their heads on a low bridge.",
      "writers": ["Pat Proft"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120901/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyNDgwODgzOF5BMl5BanBnXkFtZTcwMzcyMzYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leslie Nielsen, Richard Crenna, Kelly LeBrock | See full cast and crew »"],
      "reviews": [
         "I read another reviewer's comments about Wrongfully Accused, and I am continually amazed at how many people judge movies like this as though they are meant to be serious cinematic endeavors. Leslie Nielsen's films, literally, are jokes, and if you can't take them that way then maybe it would be better if you didn't watch them. I only say this here rather than just to that reviewer because I think it's worth pointing out that, in case you couldn't already tell, this movie is a parody and is meant to be laughed at. I am perfectly willing to admit that it is peppered with scenes that fall completely flat (the sex scene with the sports commentary in the background is a prime example) and much of Nielsen's acting is absolutely awful (also note that much of this is also a parody of similar bad acting in the movies that are being spoofed in this movie, such as The Fugitive and obviously some of the James Bond films), but again, you really need to keep in mind what kind of movie this is. Besides, there are also plenty of truly hilarious scenes. I can't help cracking up at the train peeking around the rock at Nielsen as he tries to escape, or the scene where he bends down to get his foot out of the railroad tracks and is hit in the forehead by the crossing gate. This scene was also screwed up, because that crossing gate was down across the track rather than a road going over the tracks, and it stopped rising just above Nielsen's head. But who cares? Comedy is a surprise, if you just saw what was expected it wouldn't be funny! I can't say that Wrongfully Accused promises a cerebral workout or any moving social commentary, but if you look at the cover of this movie and expect something like that, maybe you should stick to the kid's section at the video store, because you are probably a little out of your league. The rest of you should be able to find some things to laugh at in this movie. Just enjoy it for what it is, because there are really only two things that frost my butt, a snow cone about that high, and IMDb reviewers that can't take a good joke!",
         "How does this movie only have a rating of 5.2?! The only movies that might be funnier than this that I have seen were Airplane! or Mafia!, which Mafia! has an even lower rating! This is the mother of all parodies, except for maybe, once again, Airplane! or Mafia!, each of which is hilarious. Stupid, stupid things come together to make a funny, funny movie. I swear, when he accidentally fries that janitor with the defibrillator, every time I see that I nearly p*ss myself! I actually took count once, and I think there are around twenty to thirty different movies that this one parodies, from Star Wars, where the usher has a light saber instead of a flashlight, to The Terminator when the lights are turned on when the villain is wearing night vision goggles and his eyes glow green, to the immortal, \"Here's looking at you, kid,\" from Casablanca, this movie really has it all. Really simple things that you most likely don't even remember make this movie HYSTERICAL! From, \"You're not Lauren, you're an impostor!\" to the hydraulic car playing \"La Cucaracha\" (which, by the way, is another one of my all-time favorite gags), the slapstick and reckless comedy this movie has will have you really split your sides (call the hospital in advance). All in all, if you haven't seen this movie before, see it. Ignore what the IMDb rates it, a somewhat lousy movie. This movie has hysterics beyond belief.",
         "Since \"The Fugitive\" is one of my all-time favorites, this takeoff on it was fun and enjoyable for me to watch. Hey, sometimes it's best to laugh at ourselves and the things we like. For much of it, this movie was laugh-out-loud funny. It helped not only to know \"The Fugitive\" story well but also \"North By Northwest,\" \"Casablanca\" \"Titantic,\" and many, many other films, both classic and modern-day. The more familiar you are with movies, the more of these \"inside\" jokes are going to make you laugh. Being a movie buff, a lot of these gags connected and made me really have a good time watching this Leslie Nielsen farce. Be warned, parents: this is not a family comedy. There are tons of sexual innuendos, so typical of today's comedies.",
         "Spoofing THE FUGITIVE, Leslie Nielsen takes us on a wild ride that combines the Three Stooges with the Marx Brothers and includes quick stops at CASABLANCA and THE MALTESE FALCON, then north by northwest to MISSION IMPOSSIBLE, BRAVEHEART, and TITANIC. As the ads say, this isn't a movie -- it's all movies. And it's well worth the trip. Nielsen is in top form.",
         "I have been a fan of Nielsen's since I first saw Spy Hard when I was still a kid. Leslie Nielsen was perfect to play this role simply because he has the presence of a dramatic actor only making his actions funnier. Nielsen is perhaps one of the funniest comedic actors around, though his movies like this are criticized as though they were supposed to be some Oscar Nomminated hit or something. What those \"drama critics\" don't seem to understand is that all his comedy movies are PARODIES of dramatic movies. They're not supposed to be taken seriously. Niesen movies like this are just for a few yuks and laughs. I have always loved random comedy movies like this, therefore, I love this movie.",
         "There has been a murder in town and the violin player superstar is the main suspect.He is wrongfully accused, of course.He gets a death sentence but he manages to escape.So then he is an innicent violin player chased by the cops.All he knows is that the real murderer is a one-armed, one-legged and one-eyed man. Shouldn't be so hard to find.Easier said than done.Wrongfully Accused is a comedy, that has parodies from many other movies and some series.Mostly from The Fugitive.There are also parodies from movies like Braveheart and Titanic.Leslie Nielsen is perfect for the movie.He knows the genre very well.He is a parody man.Great comedian.Great comedy.",
         "If you like leslie nielson movies, naked gun, airplane, then you will love this. definitely the funniest movie i have ever seen by far, if you like his style. if not then don't see it. but if you like weird random movie, see it. very very funny. a make fun of harrisons fords \" the fugitive\" the sad thing is you can't buy this movie anymore, anywhere. no one has really seen it. i have met one person outside my family that has seen it, and i ask everyone i meet. movies like this shouldn't go so unnoticed. very funny movie. you should definitely see it. best of leslie nielson. very many can't stop laughing parts. parts like after a big train wreck. all silence, this first thing you hear is a guy complaining who was inside the train about his shoe being untied. very funny",
         "You do not go to see a Nielsen movie expecting anything else but a good laugh. You know that you will see a parody, based on one film, and a lot of references to other famous movies. The humor itself may get what they call rather low, but occasionally you will have a good laugh, and even some gags to remember. No social comments, no pretentions. This is exactly what this film is - an average level parody, with one memorable scene, and a few good other. Go in the right mood, do not expect too much, and you may enjoy it. 6/10 on my personal scale.",
         "It stars Leslie Nielsen. what more do you need to know? It's true, Nielsen has built a career out of movies like this. He plays Ryan Harrison, the dashing, although somewhat clueless hero who somehow romances a woman half his age, tracks down a 1-armed, 1-legged, 1-eyed man, and saves a UN Member. He does so through trial and error, questionable flashbacks, smart-alec quips and oddly phrased metaphors. And somehow does it in what seems to be 2 days! In the good tradition of the parody, nothing is sacred to this movie. Although it is mostly a spoof of The Fugitive, every movie gets the blade here. Braveheart, Titanic, Mission Impossible, Field of Dreams, it all gets the Nielsen treatment. And just movies, but pop culture too! Car alarms, ER, bras, basketball commentary, and Alfred Hitchock all get their dues. Even the adorable puppet Lambchop can be heard chanting 'Riot, riot, riot!' in a scene. Simply put, any Leslie Nielsen fan will love this. If you hated his previous movies, you won't like this one. It's a rehash of the classic parody formula, a formula that has withstood the test and still stands up. And of course the clueless Nielsen doesn't fail to disappoint. Running from a model airplane, wearing a meat factory coat to impersonate a doctor, using a long wooden stick to deactivate his bear-trap car alarm, and playing a violin with his teeth...He does it all! Leslie Nielsen is without a clue, without a hope, and he's been Wrongfully Accused!",
         "there is a lot of misses in this movie. but there are more than a few hits. some of the gags are very tired. but more than a few are right on target. this movie is not as good as some other nielsen movies like the naked gun series. but it's still better than his recent movies like dracula dead and loving it,and spy hard. all in all not bad. i give wrongfully accused **1/2 out of ****"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": [
         "Morgan Creek Productions",
         "Constantin Film Produktion"
      ],
      "summaries": [
         "Ryan Harrison, a violin god, superstar and sex symbol does not want to cheat on sexy Lauren Goodhue's husband with her. Shortly after that Mr. Goodhue is found murdered and Ryan suddenly finds himself being the main suspect. After being sentenced to death he manages to flee while being transferred to his execution site. Now, all the world is after him as he stumbles from one unfortunate incident to the next in order to find the real murderer.",
         "Ryan Harrison is framed for murder and must prove himself innocent by finding a mysterious one-eyed, one-armed, one-legged man after escaping from a bus accident on the way to jail."
      ],
      "budget": 0
   },
   "movielensId": 2170,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-21",
      "dvdReleaseDate": "1998-12-22",
      "directors": ["Pat Proft"],
      "runtime": 87,
      "movieId": 2170,
      "title": "Wrongfully Accused",
      "mpaa": "PG-13",
      "actors": [
         "Leslie Nielsen",
         "Michael York",
         "Kelly LeBrock",
         "Melinda McGraw",
         "Alexander Boynton",
         "Leslie Jones"
      ],
      "imdbMovieId": "0120901",
      "originalTitle": "Wrongfully Accused",
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Cq-YWo0HKuc"],
      "plotSummary": "Ryan Harrison, a violin god, superstar and sex symbol does not want to cheat on sexy Lauren Goodhue's husband with her. Mr. Goodhue is found murdered and Ryan suddenly finds himself being the main suspect. After being sentenced to death he manages to flee while being transferred to his execution site. Now, all the world is after him as he stumbles from one unfortunate incident to the next in order to prove himself innocent - by finding a mysterious one-eyed, one-armed, one-legged man...",
      "tmdbMovieId": 9417,
      "avgRating": 2.71844,
      "releaseYear": "1998",
      "numRatings": 998,
      "posterPath": "/rf9wKcXwItrtG4CSvUgEmuY6XAh.jpg"
   }
}