{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0119778",
      "video": false,
      "title": "Next Stop Wonderland",
      "recommendations": [
         141635,
         48833,
         60994,
         14922,
         25636,
         13574,
         36196,
         77469,
         42391,
         49471,
         47692,
         28026
      ],
      "backdrop_path": "/yvdDIy0lboylwYFasQmdWuMJXUO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Erin Castleton",
               "gender": 1,
               "credit_id": "52fe45ccc3a36847f80daf4f",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sean",
               "gender": 2,
               "credit_id": "52fe45ccc3a36847f80daf53",
               "name": "Philip Seymour Hoffman",
               "profile_path": "/8DjE4XIngdn0dK3RnIKTHB8U8jZ.jpg",
               "id": 1233,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Piper Castleton",
               "gender": 1,
               "credit_id": "52fe45ccc3a36847f80daf57",
               "name": "Holland Taylor",
               "profile_path": "/oPcA8Ju1rBGlDCRqbyVD7S5vakY.jpg",
               "id": 11318,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Alan Monteiro",
               "gender": 2,
               "credit_id": "52fe45ccc3a36847f80daf5b",
               "name": "Alan Gelfant",
               "profile_path": "/vN5Apek2f4IElqJmUNcgNInZZb2.jpg",
               "id": 126583,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Rory",
               "gender": 2,
               "credit_id": "58e5bbdbc3a3687326035261",
               "name": "Jason Lewis",
               "profile_path": "/rJx9FAIMOtaOiqTtlaGLVTxn8Y2.jpg",
               "id": 32224,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ccc3a36847f80daf45",
               "name": "Brad Anderson",
               "profile_path": "/qjEl3MLqL4MDZFMWO4ukQbBBal0.jpg",
               "id": 37948,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45ccc3a36847f80daf4b",
               "name": "Brad Anderson",
               "profile_path": "/qjEl3MLqL4MDZFMWO4ukQbBBal0.jpg",
               "id": 37948,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.766666,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41469,
      "vote_count": 23,
      "budget": 0,
      "overview": "A lighthearted story about a man and a woman who seem destined to be together... and the hilarious chain of accidents that seem determined to keep them apart!",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         298312,
         8810,
         948,
         14433,
         12162,
         1359,
         4771,
         8923,
         97630,
         101,
         205,
         141,
         339692,
         281957
      ],
      "original_title": "Next Stop Wonderland",
      "runtime": 96,
      "poster_path": "/c0Iezx1DOEd5nIYTOyg1OQ5YvN3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-08-21",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Romance Is Her Destination.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brad Anderson"],
      "runtime": 104,
      "synopsis": "When Erin (Hope Davis) is dumped by her boyfriend (Philip Seymour Hoffman), her mother (Holland Taylor) places embarrassing personal ads on her behalf. Erin reluctantly goes out with a string of men, but a lonely plumber (Alan Gelfant) with aspirations to be a marine biologist keeps crossing her path. If the two could only meet, they might make the perfect pair. Directed by Brad Anderson, the film earned a spot at the 1998 Sundance Film Festival.",
      "writers": [
         "Brad Anderson",
         "Lyn Vaus"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119778/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MTA4NzQ1OF5BMl5BanBnXkFtZTcwOTE5MTcxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Hope Davis, Alan Gelfant, Philip Seymour Hoffman | See full cast and crew »"],
      "reviews": [
         "This is a very enjoyable movie. I must admit that I had my doubts at first, as it looked far too sugary for my taste. Poor marketing I guess. However, this is the first movie in years which I watched and then watched again the next day. Hope Davis' character, Erin, elicits many emotions -- the first of which is pity. Having been dumped by what is clearly the wrong man, we witness her attempt to re-enter the dating scene. She is immediately catapulted back into the world of losers, married men, and guys who are downright scary. She handles all of this with grace, but more than a hint of cynicism. You can often see the depression in her face, as she moves from one date to the next, always telling her friends that \"there's no such thing as destiny.\" And yet, there is (as she discovers.) Her character seems very much the essence of the modern young single person: She tells herself she is happy alone, but quietly yearns for the depth of true love. She is never rude, except when it's deserved, but she is never particularly friendly either. She inadvertantly wears the scars of years of dating on her sleeve. A very subtle and clever performance from the ethereal and under-appreciated Hope Davis. HIGHLY RECOMMENDED",
         "I love this movie's realism, juxtaposed with a certain magic, i.e., fate, karma, destiny - and the question of whether these elements exist in real life. Here, the possibilities unfold and are played out as quietly, subtly and unexpectedly as they can and often do in real life. What surprised me most is that when I was doubting whether our heroes (Alan and Erin) would get together at all, I realized that it was okay - disappointing, but okay - if they didn't; as long as they found happiness, that would be fate calling the shots. The movie as a whole puts a positive spin on being alone with yourself, on the importance of taking the time to find what you really want and need. Which is something we all need in life, but how often does Hollywood promote that philosophy? All the actors were terrific, especially the two leads, Alan Gelfant and Hope Davis; they were people you might really know - quietly passionate in their pursuits, sometimes just struggling to get through the day. There's a lot of humor too: in the prickling, loving tension between Erin and her mom; in the bar-table philosophies spouted by various characters; and particularly the in blind-dating montage - I will attest to how true to life this is! See this movie - heck, buy it. The more you watch it, the more you get out of it.",
         "This film is exactly how romance was meant to be portrayed on film. Love leaves you vulnerable, completely exposed, mad, and yet it is all worth the road where it takes us. This movie shows you that road for two people, and paints it so beautifully. It has been a long time that I have laughed at moments so familiar. This movie takes us places we've all been, or where we are right now. I am so angry at my friends for never telling me about this movie. I found it on the IFC channel today 5/11/05. This movie ranks in my book up there for romance movies w/Say Anything, Frankie and Johnny, and A Little Bit of Romance. Watch this film, it'll enlighten you and make you smile. Now who doesn't want to smile?",
         "Erin (Hope Davis) is recently single (her boyfriend moved out), a nurse and looking for Mr. Right. Alan (Alan Gelfant) works at the New England Aquarium, is a student and has no time for love. Naturally they're made for each other. We watch their separate lives all through the movie slowly intertwining them and drawing them to each other. This is a very small independent film, shot in Boston and picked up by Miramax. If you know Boston and the surrounding cities some of this is amusing. Erin lives in a huge apartment in Beacon Hill--there's no way a nurse could afford that. Also she meets all her dates a bar called the Burren which is located two towns away in Somerville! But they did get Wonderland right--that's a station on the Blue Line subway where Alan lives near. Those little goofs aside (actually they're pretty funny) this is a very nice, romantic film. A perfect date movie. It's got a very laid-back feeling that is absolutely charming. This is helped with a very soothing music score. But be warned--this movie is only for true romantics! If you look at it in a serious frame of mind you're gonna hate it. But if you're a romantic (like me) you'll love it! Davis gives a very nice low-key performance (but she could have lightened up a little); Gelfant is good also--and has beautiful eyes. Also well-directed by Brad Anderson. Not believable for a moment but boy--is it romantic! I recommend it. I give it an 8.",
         "\"Next Stop Wonderland\" is a lovely, very underrated indie romantic comedy, co-written and directed by Brad Anderson (\"Happy Accidents\", \"The Machinist\"). The always wonderful Hope Davis stars as Erin, a nurse from Boston who's dumped by her boyfriend, Sean (Philip Seymour Hoffman). Her liberal mother (Holland Taylor) places a personal ad for her in the paper (without Erin's consent). Initially appalled by the idea, Erin's life starts to change when she decides to meet the guys who answer the ad. \"Next Stop Wonderland\" gets away from stupid Hollywood clichés, and is romantic without being corny. Anderson's and Lyn Vaus's witty script has some amazing dialogue, and Hope Davis brings the right emotional depth/low-key humor to her character. This movie is similar to the recent \"Broken English\" (starring another indie goddess, Parker Posey), only better. Honduran actor José Zuniga plays a Brazilian guy (hopeless romantic or prick?), speaking a very mannered Portuguese (more like some kind of \"portuñol\", a mixture of Portuguese and Spanish) that doesn't beguile the most naïve Portuguese speaker - which is very annoying for native Brazilians, specially considering that there are so many talented Brazilian actors out there that would've fitted the part. Of course I'm not saying foreign people can't play someone of a different nationality, but when the actor can't pull a decent accent, that's a problem. Anyway, that's a minor flaw, and \"Next Stop Wonderland\" is definitely an adorable flick. The soundtrack, full of classic Brazilian bossas (a rarity in American movies) is a plus, and the perfect complement to the movie's bittersweet atmosphere. 8.5/10 in my books.",
         "I was surprised by my own reaction to this movie. I felt the loneliness and anxiety that the characters demonstrate. The movie really catch me and became one of my favorites. The wait for the meeting between a nurse and a plumber gave us several moments of pure joy by the intelligence in those takes. As a Brazilian person I have to say that the soundtrack is delicious. We have here some sweet pieces of Bossa nova that harmonically fit in to the story and give us unforgettable moments in the movie. And what about that friendly baloonfish? Its already a character apart. I certainly recommend this movie to the ones who demand a reflective story about human anxieties admirably conduced by sensitive and intelligent Brad Anderson. Thanks, Brad, for the experience.",
         "Take a tour through some gorgeous Boston sights, even some kinda grubby under the (soon-to-be-erased by the Big Dig) elevated streets. I loved the Puffer-fish in our wonderful New England aquarium. And is this Gelfant guy sexy-----whoah!!! The sight of him and the flirty student he's mentoring eating each other up on the whale-watching boat was OUTSTANDING!! With all his obvious knowledge of the girl's crush and her wiley ways, he STILL gives into the animal chemistry in a surprising rush. I am SO tired of obviously phony kisses onscreen that this one caught me off-guard. If you've ever done a dating ad thing, you'll empathize with the heroine's disgust at the pitiful and revolting lines of the many 'candidates' she meets. When one lowers his pseudo-intellectual facade long enough for you to see the human being behind, you want to scream, \"Why didn't you show THIS part of yourself to her before you lost the chance?\" Of course, the 3-way bet by the scum bums ends well as they get their just desserts. The well-meaning but meddling mother behind it all who placed the ad is well-written and well-played. It's enough to watch the superb photography to buy this movie, but the many boy-girl angles portrayed also make it worthwhile. It could have been entitled, \"What Not to Do on a First Date\". I own it and am looking forward to giving it to my unmarried son as a tutorial. I also lend it out to people I want to lure to Boston.",
         "Just saw this last night, while on a \"date\"...and I'm glad that I listened to my friends who recommended it. This is a PERFECT date movie. Enough of a romantic comedy to put you in that oh-wouldn't-it-be-great-to-be-in-love mood, but unpredictable and un-corny enough to slip away from the usual Hollywood trappings. I won't ruin it for anyone, but the \"linoleum moment\" was priceless, and Hope Davis is terrific. I'm renting \"The Daytrippers\" this weekend.",
         "Unlike most romantic comedies that get distributed, Next Stop Wonderland is neither star-peopled nor entirely plot-driven. Although the film was marketed as another Nora Ephron knockoff, it is very different from the slick, syrupy Meg Ryan vehicles viewers were led to believe it would resemble. Brad Anderson's beautiful, shimmering treatment of light, and his pleasingly idiosyncratic manner of filming the Boston urban landscape (and the lovely Hope Davis), well serve the sympathetic honesty with which he treats the search for love in the modern American city. A magnificent film.",
         "\"Next Stop Wonderland\" is a fresh, fun, smart, and sassy romantic comedy which sticks Davis out in front as a typically jaded revolving door dating single who is on a collision course with Mr. Right (Gelfant). There's not an ounce of fat on this lean little indie which is imbued with a sense of destiny, the sound of Brazil, and scene to scene unpredictability with periodic poignant pauses and brief philosophical passages all seeming unique to Anderson's auteursmanship. Intelligent and hip fun for romcom junkies. (B)"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Robbins Entertainment"],
      "summaries": [
         "Erin is a nurse and her longtime boyfriend has dumped her. Her mother Piper places a personal ad for her. Meanwhile the film follows the life of Alan, a volunteer at a local aquarium who dreams of becoming a marine biologist. Will their paths cross?",
         "An unlucky in love nurse finds her life taking a detour when her mother places a personals ad in the paper, while on the other side of Boston, a plumber is trying to change careers."
      ],
      "budget": 1000000
   },
   "movielensId": 2171,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-21",
      "dvdReleaseDate": "2000-05-09",
      "directors": ["Brad Anderson"],
      "runtime": 96,
      "movieId": 2171,
      "title": "Next Stop Wonderland",
      "mpaa": "R",
      "actors": [
         "Hope Davis",
         "Philip Seymour Hoffman",
         "Holland Taylor",
         "Alan Gelfant",
         "Jason Lewis"
      ],
      "imdbMovieId": "0119778",
      "originalTitle": "Next Stop Wonderland",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A lighthearted story about a man and a woman who seem destined to be together... and the hilarious chain of accidents that seem determined to keep them apart!",
      "tmdbMovieId": 41469,
      "avgRating": 3.65115,
      "releaseYear": "1998",
      "numRatings": 1257,
      "posterPath": "/c0Iezx1DOEd5nIYTOyg1OQ5YvN3.jpg"
   }
}