{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0120692",
      "video": false,
      "title": "All I Wanna Do",
      "recommendations": [
         15209,
         47541,
         44895,
         26156,
         21413,
         27647,
         43634,
         17906,
         46112,
         36964,
         33563,
         39141,
         38966,
         16263,
         8008,
         24073,
         74929,
         14196,
         77665,
         30296
      ],
      "backdrop_path": "/5ouD655RgqLWqVFg5VaIXrMZ6s8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Verena von Stefan",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d73",
               "name": "Kirsten Dunst",
               "profile_path": "/hA5wdCWKbRi7vOZExgEuGxakLsA.jpg",
               "id": 205,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Odette",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d77",
               "name": "Gaby Hoffmann",
               "profile_path": "/zg7FTMjtdWmyg8b4o5DXEZNC5uv.jpg",
               "id": 12930,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Miss McVane",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d7b",
               "name": "Lynn Redgrave",
               "profile_path": "/jnXKuScyfE4zZ5AqBpmrVBMKeVz.jpg",
               "id": 29791,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Abigail 'Abby' Sawyer",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d7f",
               "name": "Rachael Leigh Cook",
               "profile_path": "/cotGJui5H2Te2ThYERndc3DOVOm.jpg",
               "id": 38581,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "'Frosty' Frost",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d83",
               "name": "Tom Guiry",
               "profile_path": "/3LcbdkpjePcQk8q4QbRg7uhNMgN.jpg",
               "id": 4729,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Snake - Flat Critter",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d87",
               "name": "Vincent Kartheiser",
               "profile_path": "/y2i2epgCOwfMyC5FclcF3IU8Iy3.jpg",
               "id": 52646,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Tinka Parker",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d8b",
               "name": "Monica Keena",
               "profile_path": "/f4dD2ohtjJZweo6nbvu38OpSsCO.jpg",
               "id": 18315,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe47d49251416c750a6d8f",
               "name": "Matthew Lawrence",
               "profile_path": "/5FstHTIRe51bkmga1cWGRB7vFMc.jpg",
               "id": 11716,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Theresa 'Tweety' Goldberg",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d93",
               "name": "Heather Matarazzo",
               "profile_path": "/xcwR8aPuSkUCDPIyKU049M1CXph.jpg",
               "id": 33656,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Maureen 'Momo' Haines",
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d97",
               "name": "Merritt Wever",
               "profile_path": "/27RmAly6e7s1U4iGBAH6bClHRbH.jpg",
               "id": 28044,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Police Captain",
               "gender": 0,
               "credit_id": "54ff7f129251413d9f00058b",
               "name": "Roger Dunn",
               "profile_path": null,
               "id": 1351508,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d69",
               "name": "Sarah Kernochan",
               "profile_path": null,
               "id": 15149,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe47d49251416c750a6d6f",
               "name": "Sarah Kernochan",
               "profile_path": null,
               "id": 15149,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a86a04fc3a3686316037378",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 4.175078,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 19381,
      "vote_count": 29,
      "budget": 0,
      "overview": "If there's one thing this wild group of friends at an all-girls high school has learned, it's how to get what they want! So when word leaks out that their school is about to merge with an all-boys academy, some of the students strike back... and the girls wage an all-out assault in an outrageous battle of the sexes!",
      "similar": [
         258480,
         10735,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         634,
         437557,
         17130,
         43923,
         11634,
         141,
         297762,
         376867,
         394117,
         242224,
         370663,
         376660
      ],
      "original_title": "Strike!",
      "runtime": 97,
      "poster_path": "/jM8kdUnKSzJKRJhzfBcAtVWPnjx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-08-21",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Every Girl Has A Secret Desire",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sarah Kernochan"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Sarah Kernochan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120692/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0ODgwNDM3M15BMl5BanBnXkFtZTgwOTc3MzkyMTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Kirsten Dunst, Lynn Redgrave, Gaby Hoffmann | See full cast and crew »"],
      "reviews": [
         "All I Wanna Do, or Strike was a great and funny movie. I don't know why it's called Strike on this website, but on the cover it says All I Wanna Do. This movie had a great cast: Kirsten Dunst, Gaby Hoffman, Lynn Redgrave, Rachael Leigh Cook, Heather Matarazzo, and Matt Lawrence. This movie is about Miss Godar's School For Girls, and when Odette comes, she meets Verena and all of her friends, and becomes a part of a club that is named after cold raviolies, is held in the attic of the school. Then, when Miss Godard's school is to become a coed school, the girls have something to say about it, and plan to ruin the Ambros School for Boys permanantley! This is a real feel good comedy. I give All I Wanna Do a 10 out of 10!!! :)",
         "Strike is a great teen 'girl-power type' film with a cool cast including: Kirsten Dunst, Gaby Hoffmann, Monica Keena and Heather Matarazzo who are all brilliant in their roles. Might I just add that the film also includes some VERY cute guys. Anyway, if you like all the other teen films about, I'm sure you'll love Strike. I give the film a 10/10. Great!",
         "You have to be in the right mood to watch and enjoy this movie. It's actually quite good though. The movie is based on a true story of a few awesome girls who want to have a voice. The movie is funny and charming with fabulous acting. If you're in the right mood for an awesome uplifting story that rings GIRL POWER then see this groovy flick. 8/10",
         "Okay, so that's a little much. But seriously, this is one of the funniest teen-related movies I've seen, and I've seen most of them. The cast is delightful, especially Kirsten Dunst as Verena, the quick-witted ringleader of the Daughters of the American Ravioli. She and her friends Tinka, Tweetie, and Momo take Odette, a new student at Miss Goddard's School for Girls, under their trouble-making, big-dreaming wings and try to stop their beloved school from going co-ed. It sounds like a thin premise for a movie, and maybe it is, but the characters are real and humorous and some of the scenes are extremely funny. The dance, where Verena and Momo spike the punch and intoxicate the choir boys of St. Ambrose, is hilarious, especially if you can pick out Hayden Christensen as a drunken student. And Tom Guiry, Scotty Smalls of \"The Sandlot\" fame, grew up and got himself some muscles. My one real problem with this movie was Gaby Hoffman as Odette. She was, for the most part, the one dull person in a crowd of comical characters. Her main goal is to be an \"ex-virgin\" and then become a politician. She's rather boring and expressionless compared to the rest of the DAR. This movie is funny and charming and perfect for a group of girlfriends to watch together. I'd suggest it along the same lines as \"Ten Things I Hate About You.\" I give it 7 stars out of 10.",
         "Cute movie with lots of laughs and teen attempts to change the world. I enjoyed this one for the humor and the realistic aspects of what teenagers can and will do. Young love not to be over looked. Whether prep school, college or finishing, kids will find a way to out smart the school administration and that's what this movie is about. If you want humorous entertainment, this is the one for you.",
         "Cute and sassy. Both the movie and Kirsten Dunst. Also known as ALL I WANNA DO. Miss Godard's School for Girls is about to go coed. A small group of students led by Miss Dunst gather around cold cans of ravioli to plot their futures and scheme of ways to stop their school from merging with an all boys school. Not total girlish whimsy...there is the underlying recognition of togetherness. And some girls even have ambition. No brainer, but enjoyable. Very fine support from:Gaby Hoffman, Rachel Leigh Cook, Monika Keena and veteran actress Lynn Redgrave.",
         "From the moment Odette Sinclair sets foot in Miss Goddard's School for Girls, disaster is sure to follow. She then hooks up with members of the DAR (Daughters of the American Ravioli), a secret club of girls who discuss their futures over ravioli. Then comes the big news: Miss Goddard's may go co-ed. The group splits up over this issue, but then are reunited when they realise how awful the St. Ambrose students are (with a little help from some local townies). It also doesn't matter that Tweety is bulimic, or that Odie hates being separated from her boyfriend; nothing matters anymore when the girls come together to fight the boys. I thoroughly enjoyed the film...and I'm in my early twenties, for pete's sake! Up your ziggy with a wa-wa brush!",
         "The in-crowd at Miss Godard's,a highbrow New England girls boarding school,has waged an all-out war against the administration,which wants to merge with St.Ambrose, a nearby boys prep school.Although the St.Ambrose boys are the very same boys these young women want to be at social events,and event on occasion,lust after,they do not want them in the same classroom.Odette (Gaby Hoffmann),the clique's brainy ringleader ,takes Verena (Kirsten dunst),tinka (Monica keena) and tweety (Heather matarazzo)and Merrit weaver along on a bumpy-but often hilarious-road of misadventures as they attempt to keep their school boy-free while constantly fighting with Abby (Rachael leigh cook),Miss Godard's tattletale moniter.What it lacks in suspense (you know what's gonna happen the first 15 minutes)STRIKE!makes up for its CHARM!",
         "It is definitely a movie that touched my heart and made me moved to LOTS of tears! I've recommended this movie to some friends, expecting them to feel the same way that I felt. It's so good to see somebody playing your life in a movie.This is a movie based on a private girls' boarding school and also a true story happened on the director herself years ago, in her teenage life. In the movie, those girls have dreams of their own. And they all achieve their goals after stepping into the grow-ups' world (they really are very successful in real world). I was touched because I saw how much they cherish each other's secret and how heartedly they help each other through the difficulties in reaching out for their dreams. I , like them, have lived in a all-girls boarding school for 6 years. The movie reminded me those times at many nights, in our beds, my friends and I listened carefully to each other's dream about future, we share our young hearts, just like the girls in the movie do. I don't know what other people would think of this movie, especially males. But after reading some critics about this movie, I know that it is time for girls to stand out. There has never been any movie like this to tell what a girl really wants and how we girls think ourselves are. Any girls who have spend their teenage time in Wesley would love this movie like I do , because during the movie I cry out several time that\" it's just like what we do in school!\". I think mothers would love this film because don't they always want to know what their girls are doing in school! Also teachers in school would pleased to see this movie because many things they want these girls to know but don't know in what way to teach them is the best way are shown in the movie. We will all smile and understand that what a girl's responsibility is to respect our own dream and to think that we are so important. Strike is definitely fitted to girls who want to prove the real woman in them. It shows how friendship will eventually conquer all. I really liked this because it showed the value of friendship and trust in our teenage life. I hope everyone has a great time seeing this because I did.",
         "This has got to be my favorite movie of all times- i've watched it at least 50 times, and I know the entire script! its about a girls school, and they found out they're going to merge with a boys school, so they try to stop it at all costs. It shows i twisted version of how life was back then, and its hilarious to see all their plans to stop the merger. Kirsten Dunst is the leader, and she's great at it! Also Gaby Hoffman is the new girl and is split between whether to support th merger or be against it, as half the DAR(daughters of the American ravioli- they eat canned ravioli in a secret room in the attic of their school)love boys and want to go through with the merger, and the other ones think it will pull down their grade average, and all their friends will become bimbos to impress the boys. She doesn't want to lose either of her friends, so tries to be for it and against it at the same time. It shows that not all teenage girls at girls schools are obsessed with boys, and even though it's a bit over-the-top, it's so fun to watch. I give it 2 thumbs up- definitely a must see!"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Alliance Communications Corporation",
         "Redeemable Features"
      ],
      "summaries": [
         "If there's one thing this wild group of friends at an all-girls high school has learned, it's how to get what they want! So when word leaks out that their school is about to merge with an all-boys academy, some of the students strike back... devising a hilarious scheme to sabotage the plan get ready for a sidesplitting lesson in laughter, as the girls wage an all-out assault in an outrageous battle of the sexes!",
         "In the 1960s, a group of friends at an all girls school learn that their school is going to be combined with a nearby all boys school. They concoct a plan to save their school while dealing with everyday problems along the way."
      ],
      "budget": 0
   },
   "movielensId": 2172,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-21",
      "dvdReleaseDate": "2000-06-13",
      "directors": ["Sarah Kernochan"],
      "runtime": 97,
      "movieId": 2172,
      "title": "All I Wanna Do",
      "mpaa": "",
      "actors": [
         "Kirsten Dunst",
         "Gaby Hoffmann",
         "Lynn Redgrave",
         "Rachael Leigh Cook",
         "Tom Guiry",
         "Vincent Kartheiser",
         "Monica Keena",
         "Matthew Lawrence",
         "Heather Matarazzo",
         "Merritt Wever",
         "Roger Dunn"
      ],
      "imdbMovieId": "0120692",
      "originalTitle": "Strike!",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["gWZ-NsM5okY"],
      "plotSummary": "If there's one thing this wild group of friends at an all-girls high school has learned, it's how to get what they want! So when word leaks out that their school is about to merge with an all-boys academy, some of the students strike back... and the girls wage an all-out assault in an outrageous battle of the sexes!",
      "tmdbMovieId": 19381,
      "avgRating": 3.344,
      "releaseYear": "1998",
      "numRatings": 125,
      "posterPath": "/jM8kdUnKSzJKRJhzfBcAtVWPnjx.jpg"
   }
}