{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "black death",
            "id": 179870
         },
         {
            "name": "plague",
            "id": 188959
         },
         {
            "name": "cumbria",
            "id": 227003
         },
         {
            "name": "medieval england",
            "id": 235489
         },
         {
            "name": "14th century",
            "id": 237612
         }
      ],
      "imdb_id": "tt0095709",
      "video": false,
      "title": "The Navigator: A Medieval Odyssey",
      "recommendations": [
         41944,
         27811,
         85556,
         120518,
         94666,
         18262,
         226639,
         285856,
         91101,
         48833,
         91471,
         358912,
         187927,
         55204,
         36709,
         26964,
         27035,
         33250,
         47579,
         21764
      ],
      "backdrop_path": "/k9g9zuYQHcdRtMwkB9nMTwJvSIk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Connor",
               "gender": 0,
               "credit_id": "52fe45709251416c9103260d",
               "name": "Bruce Lyons",
               "profile_path": null,
               "id": 555927,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Arno",
               "gender": 2,
               "credit_id": "52fe45709251416c91032611",
               "name": "Chris Haywood",
               "profile_path": "/jMVWid44VE90tzmkOBKCWqvT9eW.jpg",
               "id": 3070,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Griffin",
               "gender": 0,
               "credit_id": "52fe45709251416c91032615",
               "name": "Hamish McFarlane",
               "profile_path": null,
               "id": 555928,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Searle",
               "gender": 2,
               "credit_id": "52fe45709251416c9103262b",
               "name": "Marshall Napier",
               "profile_path": "/tQiAPncJGKgw4O2jJAjopMZSaCi.jpg",
               "id": 227099,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ulf",
               "gender": 0,
               "credit_id": "52fe45709251416c9103262f",
               "name": "Noel Appleby",
               "profile_path": null,
               "id": 585902,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe45709251416c91032633",
               "name": "Paul Livingston",
               "profile_path": null,
               "id": 61351,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Linnet",
               "gender": 1,
               "credit_id": "52fe45709251416c91032637",
               "name": "Sarah Peirse",
               "profile_path": "/dILxeuQbDxtSxMCL863X4qum29X.jpg",
               "id": 15092,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Tog 1",
               "gender": 0,
               "credit_id": "52fe45709251416c9103263b",
               "name": "Mark Wheatley",
               "profile_path": null,
               "id": 585903,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Tog 2",
               "gender": 0,
               "credit_id": "52fe45709251416c9103263f",
               "name": "Tony Herbert",
               "profile_path": null,
               "id": 232410,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Esme",
               "gender": 0,
               "credit_id": "52fe45709251416c91032643",
               "name": "Jessica Cardiff-Smith",
               "profile_path": null,
               "id": 585904,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Grandpa",
               "gender": 0,
               "credit_id": "52fe45709251416c91032647",
               "name": "Roy Wesney",
               "profile_path": null,
               "id": 585905,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Grandma",
               "gender": 0,
               "credit_id": "52fe45709251416c9103264b",
               "name": "Kathleen-Elizabeth Kelly",
               "profile_path": null,
               "id": 585906,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45709251416c91032609",
               "name": "Vincent Ward",
               "profile_path": "/h2BFI6RUpevrK4xHsFk9iXhKEHm.jpg",
               "id": 9198,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45709251416c9103261b",
               "name": "Geoff Chapple",
               "profile_path": null,
               "id": 585900,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45709251416c91032621",
               "name": "Kely Lyons",
               "profile_path": null,
               "id": 585901,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55a27af3c3a3681cf5003776",
               "name": "Vincent Ward",
               "profile_path": "/h2BFI6RUpevrK4xHsFk9iXhKEHm.jpg",
               "id": 9198,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.898599,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "NZ",
            "name": "New Zealand"
         }
      ],
      "id": 34637,
      "vote_count": 23,
      "budget": 0,
      "overview": "In the 14th century a village seeking escape from the Black Death are guided by a boy's vision to tunnel into an abandoned mine and emerge into 20th century New Zealand.",
      "similar": [
         949,
         336843,
         1939,
         8834,
         10285,
         189,
         59967,
         1923,
         2163,
         9411,
         654,
         9631,
         72784,
         321258,
         9272,
         11020,
         1645,
         112454,
         313922,
         521
      ],
      "original_title": "The Navigator: A Medieval Odyssey",
      "runtime": 90,
      "poster_path": "/fdk0zSOsRE854vGF1ZFNestcESX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "New Zealand Film Commission",
            "id": 294,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arenafilm",
            "id": 14591,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "John Maynard Productions",
            "id": 29115,
            "origin_country": ""
         },
         {
            "logo_path": "/w7d3hoHQaC0XwjrxEG1yPeuUhu5.png",
            "name": "Australian Film Commission",
            "id": 417,
            "origin_country": "AU"
         }
      ],
      "release_date": "1988-09-16",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Vincent Ward"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Geoff Chapple",
         "Kely Lyons"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095709/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyMTEzMTcyMF5BMl5BanBnXkFtZTcwODAyMjA0MQ@@._V1_.jpg",
      "actors": ["Stars: Bruce Lyons, Chris Haywood, Hamish McFarlane | See full cast and crew »"],
      "reviews": [
         "I wish I could have a few minutes to hear Vincent Ward's take on the marketing of the movie, because I never have seen anything so mis-marketed. I could see some US film distributor scratching his head and saying, \"gee? how are we going to make this dreary arty movie about the black plague appeal to the lowest common denominator of the US market?\", \"Ok, let's slap sci-fi and time travel on it...\" Navigator is a beautifully filmed, well acted, impressive movie that (hear this!) has nothing to do with time-travel, or \"monks dodging 20th century stuff\"...it is an allegory! (look that up). What Mr. Ward does is, rather than rely on expensive and silly special effects to spice up fantasy dream sequences, simply juxtaposes 20th century settings with the 14th century time frame of the film to give life to a boy's fantastic visions, and story told to give hope and entertain the desperate people of his village...his visions, done in color and film with the 20th century as it backdrop is as fantastic to the people of his village, as if someone from the 14th century actually did travel through time. With premonitions of the arrival of the plague to his village (which turn out to be heeded), the villagers of a winter bound poor community hover in fear and look for any omen good or bad to give them some sign of what is coming. With a fantastic narration of a quest (ala the holy grail) to mount a spire on a church in a faraway land, that if done before sunrise would save the village, a boy describes his fantasy which is shown to us, complete with sea monsters and dragons (all represented by 20th century contrivances). For those seeking real time travel, stick to the true sci-fi, you will be disappointed... For those interested in seeing a dark, moving tale of the desperation that must have been felt by the people who lived through the plague without understanding what it really was...a tale where the fantastic is really our wonderfully mundane world...check this out.",
         "This film is almost unknown. None of the cast ever achieved fame, and Vincent Ward, while an able director, is not very prolific. However, I still cherish my memories of this movie. I saw it nearly 11 years ago, and every detail , and all of the performances, are still fresh in my mind. It is a fantasy of extraordinary beauty, which does not use a single special effect, and which conveys the thoughts and beliefs of \"mediaeval\" peasants better than a dozen high-priced epics.",
         "Not really well-known in most of the world, this New Zealand classic is one of the finest time-travel adventures ever to grace the big screen. A remarkable story indeed. Only by seeing it several times do you realise that every little detail is quite significant. This has been one of my Top 10 films of all time for over a decade. See it by all means, but see it more than once ... and pay close attention to everything.",
         "I just saw \"The Navigator\" for the first time last night, and I must say that it is a very well done film. Unlike Hollywood films, the medieval characters are not simply modern men in medieval garb, nor are they treated as ignorant buffoons. The portrayal of the characters is highly believable. They see everything with religious and medieval attitudes, and try to cope with the nightmare world of a modern city as best they can, in order to complete their pilgrimage / quest. This is perhaps the greatest strength of the film, as it helps the viewer to successfully suspend his disbelief and identify with the characters. It may be subtle, but there is also medieval symbolism used in the movie. There are some things in the movie that don't quite make sense, like the complete willingness for the foundry workers to help a group of people who should for the most part seem insane to anyone not knowing they are actually from the fourteenth century, or the apparent pathological need for every car driver in the movie to try to run the characters down, without any attempt to swerve, stop, or otherwise avoid them. These, however, are merely nit picking trifles, when placed in the context of the full story. It is not the greatest movie I have seen, but I would definitely say that it is worth a look. It's respect for and realistic depiction of it's medieval characters is a strength that really helps to hold the movie together. I give it a thumbs up.",
         "This is an extraordinary film, not to mention extraordinarily underrated. I first saw this film as a child and it has stayed with me ever since. Now I've seen it once more with adult eyes I can't help but wonder why it's not more renowned. The fact it defies standard genres has probably hampered its reputation, often getting it unfairly shelved as a sort of arty kid's flick. Undoubtedly there are elements here that will appeal to children - imagine a more sombre Terry Gilliam and you might be there - but it's much more than just that. And to describe it as merely fantasy is to ignore the power and universality of the story. Poetic and moving, The Navigator is a lost masterpiece of 80s cinema waiting to be rediscovered.",
         "I saw this movie for the first time about ten years ago, and was absolutely impressed on every level. The acting done is fantastic, and far beyond what you would expect from such a small budget. The directing leaves you with memorable scenes and the point is clearly made, big money does not equal big talent. Do not let this movie pass you by!",
         "Well, what can I say, of the 20 or so reviews below, there is a dissenting voice, this is a \"Truly Magical Movie\" I won't go into the story, read the reviews below below for that, I'll just say, put it at the top of your \"MUST SEE\" list, it's long time since I saw it, and I've been looking for a copy ever since (with NO luck I might add) Now stop reading and go watch it....... 'o) BUT!!! beware, like I said, it's Magical, and will entrance you.",
         "No, this is not the silly Disney movie in which the fat kid rides around in a spaceship shaped like a big green booger and generally annoys all forms of alien life to the tune of a bad Robert Palmer cover of a Little Richard song. This Navigator, \"The Navigator: A Mediaeval Odyssey\" is a sad, yet compelling story of time-travelers from the Middle Ages trying to save their small village from the Black Death. In this movie, the view is treated to how the modern world would appear as heaven (or even hell) to a person from Mediaeval times soley through the use of visuals. This film was the creation of master director Vincent Ward who has made such wonderful works as \"What Dreams May Come\" and \"Map of the Human Heart.\" As with all of his movies, Ward treats us to an array of stunning uses of color and texture to enhance a grand story. The Navigator only suffers having a bland name. Watch this film at least twice, once for the mind blowing story, the other for Ward's rich film work. This film is sure to become a Sci-Fi classic.",
         "On the Fourteenth Century, a small community is threatened by the black plague, which is soiling Europe. Griffin (Hamish McFarlane) is an eight years boy with visions. These visions show the salvation for his people: digging a hole to center of the earth and putting a cross on the top of a church. Griffin, his brother Connor and some locals starts their quest that brings them to the Twentieth Century. This is indeed a weird movie. Only yesterday I decided to watch it, and I do not dare to say that I liked or disliked it. First, because although being a very strange film, it is also very original. The black & white for the scenes of the dark Middle Ages and the colored ones for the present days is a technique very unusual. Second, the plot is totally unpredictable, with no clichés. And last but not the least, the unknown cast has a great performance. My vote is six.",
         "Led by a visionary young boy, a group of mediaeval men from England dig a tunnel through the Earth and end up in 20th century New Zealand on their quest to forge a cross for the steeple of a church in the hopes that this will avert the Black Death from coming to their village. This is the basic plot of The Navigator: A Mediaeval Odyssey, a wonderful dark fantasy. I first saw this movie on its initial VHS release in the late 1980's, loved it then and was very happy to find it on DVD recently, so that I could watch it again. It has a haunting soundtrack with music that seems very appropriate for the atmosphere and mood of the film. The use of black and white in the dream sequences and the stark settings that reminded me of those in FW Murnau's Nosferatu (1922) and deathly and religious imagery give the film an overall dark tone. And I do find the contrast between the black and white sequences and the colored sequences to be effective. There were also comedic parts in this film-the crossing of the highway scene, the group attacking the submarine as if it were a sea monster and Connor on the front of the train for instance, but interestingly, each time comedy is shown, it is immediately followed by a much more somber and dark scene. Overall, I highly recommend this film its dark and surrealistic vision, its haunting soundtrack and its portrayal of a desperate people."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Fantasy",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Arenafilm",
         "Australian Film Commission, The",
         "John Maynard Productions"
      ],
      "summaries": [
         "A young boy in 14th century Cumbria (north of England) keeps getting visions he cannot explain. His village has so far been spared from the black death, but the villagers fear its imminent arrival. With the boy as their guide, a group set out to dig a hole to the other side of the world, so as to fulfil the visions and save the village. At the 'other side' is 20th century New Zealand !.. N.B. Flips from B+W to colour frequently.",
         "Men seeking relief from the Black Death, guided by a boy's vision, dig a tunnel from 14th century England to 20th century New Zealand."
      ],
      "budget": 0
   },
   "movielensId": 2173,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-09-16",
      "dvdReleaseDate": "2001-02-27",
      "directors": ["Vincent Ward"],
      "runtime": 90,
      "movieId": 2173,
      "title": "The Navigator: A Medieval Odyssey",
      "mpaa": "",
      "actors": [
         "Bruce Lyons",
         "Chris Haywood",
         "Hamish McFarlane",
         "Marshall Napier",
         "Noel Appleby",
         "Paul Livingston",
         "Sarah Peirse",
         "Mark Wheatley",
         "Tony Herbert",
         "Jessica Cardiff-Smith",
         "Roy Wesney",
         "Kathleen-Elizabeth Kelly"
      ],
      "imdbMovieId": "0095709",
      "originalTitle": "The Navigator: A Medieval Odyssey",
      "genres": [
         "Adventure",
         "Action",
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "youtubeTrailerIds": ["gPLualk3hIw"],
      "plotSummary": "In the 14th century a village seeking escape from the Black Death are guided by a boy's vision to tunnel into an abandoned mine and emerge into 20th century New Zealand.",
      "tmdbMovieId": 34637,
      "avgRating": 3.53321,
      "releaseYear": "1988",
      "numRatings": 813,
      "posterPath": "/fdk0zSOsRE854vGF1ZFNestcESX.jpg"
   }
}