{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "american",
            "id": 14638
         },
         {
            "name": "pin",
            "id": 47024
         },
         {
            "name": "stranger",
            "id": 156104
         },
         {
            "name": "ruby",
            "id": 196433
         }
      ],
      "imdb_id": "tt0119033",
      "video": false,
      "title": "Déjà Vu",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sean",
               "gender": 2,
               "credit_id": "52fe4c4ec3a36847f822799b",
               "name": "Stephen Dillane",
               "profile_path": "/x86B8ZaOKrYJM0pUYtzKTlEn7SS.jpg",
               "id": 8435,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Dana Howard",
               "gender": 0,
               "credit_id": "52fe4c4ec3a36847f822799f",
               "name": "Victoria Foyt",
               "profile_path": null,
               "id": 990400,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Skelly",
               "gender": 1,
               "credit_id": "52fe4c4ec3a36847f82279a3",
               "name": "Vanessa Redgrave",
               "profile_path": "/hGxsPCZkwa30UE0XQdGTB9yT0jz.jpg",
               "id": 13333,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe4c4ec3a36847f82279a7",
               "name": "Michael Brandon",
               "profile_path": null,
               "id": 222894,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe4c4ec3a36847f82279ab",
               "name": "Glynis Barber",
               "profile_path": "/wJFTzWcTcFw3xjWwKAbH0yaRUeB.jpg",
               "id": 1222446,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Konstantine",
               "gender": 2,
               "credit_id": "54886e74c3a368414d001a7a",
               "name": "Vernon Dobtcheff",
               "profile_path": "/lcPki2IDdmRvqiBbv2RUBfgm3IH.jpg",
               "id": 649,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Dana's Father",
               "gender": 0,
               "credit_id": "54886e8192514151ff00200a",
               "name": "Graydon Gould",
               "profile_path": null,
               "id": 1218306,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "John Stoner",
               "gender": 2,
               "credit_id": "54886ed79251415202001871",
               "name": "Noel Harrison",
               "profile_path": null,
               "id": 140167,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Woman in Cafe",
               "gender": 0,
               "credit_id": "54886ee3c3a3684145001803",
               "name": "Aviva Marks",
               "profile_path": null,
               "id": 135885,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Fern Stoner",
               "gender": 1,
               "credit_id": "54886ef1c3a3684145001806",
               "name": "Anna Massey",
               "profile_path": "/hO6qoo665U7JAHmbH7PQ7L07DOO.jpg",
               "id": 8227,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Skelly's Mother",
               "gender": 1,
               "credit_id": "54886effc3a3684145001808",
               "name": "Rachel Kempson",
               "profile_path": "/sQmgd5mppHdCdB5w94mR12zLcKf.jpg",
               "id": 10653,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4c4ec3a36847f8227997",
               "name": "Henry Jaglom",
               "profile_path": "/yJRN22AlH1sDNXrq8rNqvL5ZpVo.jpg",
               "id": 117075,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54886e50c3a36841450017f6",
               "name": "Victoria Foyt",
               "profile_path": null,
               "id": 990400,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54886e5a9251415205001781",
               "name": "Henry Jaglom",
               "profile_path": "/yJRN22AlH1sDNXrq8rNqvL5ZpVo.jpg",
               "id": 117075,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.884193,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 161795,
      "vote_count": 1,
      "budget": 0,
      "overview": "L.A. shop owner Dana and Englishman Sean meet and fall in love at first sight, but Sean is married and Dana is to marry her business partner Alex.",
      "similar": [
         1024,
         24420,
         1259,
         276,
         1643,
         13523,
         226,
         44564,
         17612,
         1903,
         68718,
         50544,
         50546,
         46705,
         13,
         38,
         86331,
         28178,
         19913,
         272693
      ],
      "original_title": "Déjà Vu",
      "runtime": 117,
      "poster_path": "/2BeYSPf181arGt4lWhRmpfBKFWm.jpg",
      "spoken_languages": [
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Revere Entertainment",
            "id": 40955,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Jagtoria Films",
            "id": 40956,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Rainbow Film Company, The",
            "id": 27584,
            "origin_country": ""
         }
      ],
      "release_date": "1998-04-22",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "Your future is set...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Henry Jaglom"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Victoria Foyt",
         "Henry Jaglom"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119033/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3OTk3NDAzNV5BMl5BanBnXkFtZTcwMTYyNjAyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Victoria Foyt, Stephen Dillane, Vanessa Redgrave | See full cast and crew »"],
      "reviews": [
         "I can understand that `Déjà vu' isn't everyone's cup of tea. Personally I bought it because of the title which intrigued me. Being sort of a film freak I like all sorts of movies, and although being a middle-aged male I have a very special feeling for romantic dramas and comedies. And I must say I like `Déjà vu' very, very much. I didn't know anything about it when I started watching it, but was immediately drawn into the story. It isn't an ordinary Hollywood movie where things have to happen quickly all the time. Here people are allowed to talk. They are allowed to be uncertain, searching, confused, not knowing what to do with or how to express their feelings. But if you haven't experienced, or don't think it is possible to do so, what it is, or may be, to suddenly be hit by love and passion, then I understand if you can't relate to this film. But all who can will probably feel a sting in their hearts. As I said, to me `Déjà vu' is a very, very good movie, and I also like the way it is filmed. I have watched it several times and will certainly watch it several times more. Rowland",
         "By rights \"Déjà Vu\" should have been a huge success with wide audiences. The fact that it was not may have to do with it's fairly unknown leading actors as well as Jaglom's previous works, which in some cases would be understandably off putting. It's really a great pity, since \"Déjà vu\" is one of the great romantic movies, (certainly of the nineties.) \"Last Summer at the Hamptons\" indicated an as yet unseen maturity which had been so lacking in Jaglom's previous works. He was finally emerging from his fixated somewhat obsessive traits which may have garnered him a hard core fan base, but have more likely infuriated many. I would urge you, whether you have any knowledge of Jaglom's works or not, to simply give \"Déjà vu\" a chance. The conundrum whether two souls on this earth are meant for each other and the eventuality of them meeting (or not) is naturally intriguing. In lesser hands it could degenerate into mush, but Jaglom manages to keep the unbelievable believable in a really delightful and thought provoking manner. Stephen Dillane fits the lead role perfectly. A reputable stage actor, his movie credits have been less impressive, but in \"Déjà vu\" he proves he has the charisma vital for a leading man on the big screen. Victoria Foyt in the female lead is not as assuredly ready for leading lady status. (Jaglom has often cast his spouse of the time in his movies.) Foyt teeters between making it work or not, but in the final analysis she pulls it off; but just. The supporting roles are really a joy to behold. Vanessa Redgrave seems to be enjoying her role tremendously. Jaglom, a believer in his actors improvising, probably allowed her much room in developing her character. Rachel Kempson, her real life mother, appears in a cameo role as Redgrave's mother in the movie. They share a brief and terribly poignant scene which surely has much to do with their real life connection. Then there's Noel Harrison (Rex's son) and Anna Massey exuding subtle and captivating British humor. Whether you allow yourself to believe the \"Déjà vu\" story as it unfolds, or simply absorb it as an adult fairy tale, you will likely reap the benefits of a genuine \"feel good\" movie.",
         "Love and mystery. Imagination. This is one of Henry's most accessible films, one which should appeal to a wider audience. It is a well rounded story from beginning to end, and quite rewarding. I left the theatre with a smile from ear to ear.",
         "I wasn't expecting much of Deja Vu, but I was intrigued by the title. The fact that the cast included Vanessa Redgrave also intrigued me (she's among my short list of favorite actors). The movie was absorbing from the first moment. A beautiful woman, walking through a bazaar in Jerusalem. She seems at loose ends. What will happen to her? What happens is extraordinary, yet the story seemed real, as did the characters. Some less patient moviegoers might consider Deja Vu to be \"talky,\" but that made the movie even more intriguing. The conversations seemed not to be \"seen on film,\" but participated in. As you watched and listened, you were actually *there*. Only two other movies of recent memory (Babette's Feast and The Dead) gave me that feeling. The people were real, and (thank goodness) they were *adults*, each of whom had a fascinating story to tell. Deja Vu is a romance, a travelogue, a mystery, and a life lesson, all in one film.",
         "I can't recall a movie that has ever so totally charmed and captivated me. Like other Jaglom films, this one makes great use of Victoria Foyt, and uses the refreshing method of allowing actors to ad-lib many of their lines. I found this to give the film a fresh, unconstrained feeling well suited to this type of story. I came out of the theater enveloped in a dreamy, warm romantic glow that stayed with me to the next day. I've been checking for this movie to be available for purchase on video ever since! For anyone who believes in fate and its hand in our lives and loves, this is a movie you'll cherish.",
         "I loved Deja Vu. It's about love and magic, and being honest with yourself. Vanessa Redgrave is beautiful, and the relationships in the film are fascinating. The film made me think about my life, and the choices I've made, or have not made. I made changes in my life after seeing the film that were very good for me. This film has it all---mystery, love, humor, beauty. I saw it several times, and never got bored. Go see it, or rent it!",
         "Are you going where you think you're going? Are you really who you think you are? This quiet little film explores the lives of a man and a woman who are gently, but insistently, forced together by fate, or karma, or destiny(or whatever). Their romance was set into motion before they were even born, and although they try to avoid each other, plans are altered, \"coincidences\" happen, and mysteries unravel. Very romantic and wistful!",
         "This was one of the most romantic movies I've ever seen. The story is fascinating, beginning with the conversation at the cafe in Jerusalem with Dana and the mystery woman, through Dana's search in Paris, to the White Cliffs of Dover. To me, this movie is hope for women that there is one person out there who is truly meant for them and sometimes you are lucky enough to find that one person, as Dana was. The music was so fitting and made me weepy at times. I was really blown away at the ending, because I hadn't expected it, but it was so fitting. The final shot of the film says it all for me. Henry Jaglom and Victoria Foyt are truly the new wave of film makers and her beauty is extraordinary. As soon as the movie was over I wanted to watch it again.",
         "I must say I enjoyed this movie and I was taken by it from the first moments. It is full of wonderful characters and interesting acting. It was not replete with name actors and formula plots. The quiet moments when the characters waxed philosophical were the best parts of the movie. It was a script that I could put my spiritual teeth in. At first it was distracting to see Redgrave sitting among her \"lessers\" but as her role continued...I realized why she took the role. It spoke volumes about the central premise of fate and free will and added much to the film's story line. Plus, she delivered a marvelous performance. (It always fascinates me when someone states that THIS is the worst movie they have ever seen. To say that about THIS movie reveals that the reviewer has not seen many movies. I have seen some alarmingly bad movies where I am cringing throughout. That is bad folks. This is not Shakespeare nor Gone With The Wind...instead...it is charming.) Deja-vu was wonderful...a romantic movie for woman and men :)",
         "This movie reminds me of a Woody Allen film, only the actors haven't a script to memorize. They are given a rough outline of the story and are asked to improvise and we'll see how it all ends up. The premise of the story is pretty good; the implementation is fairly awful. There is very little background music, so the talkiness of the piece seems to become unbearable. If I had heard Dana say one more time, \"What are you doing here?\" I thought I'd throw something at the TV. The best things about the movie were the comments my wife and I made a'la Mystery Science Theater 3000. And its a shame that the nicest person in the film, the blond wife of the love interest was given such short rift. She was best thing about the movie. But if you like films where the selfish pursuit of self-interests, others be damned, is glorified, you'll want to suffer through this one."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Jagtoria Films",
         "Rainbow Film Company, The",
         "Revere Entertainment"
      ],
      "summaries": [
         "Dana, a young American woman traveling on business in Jerusalem, meets a mysterious older French woman at a café who shares a fascinating story of lost love revolving around the expensive antique ruby pin she's wearing. The woman exits the café abruptly, leaving the pin behind and Dana, who is on her way to meet her fiancé in London, finds herself forced to reschedule her trip - and her life - as an unexpected but expected stranger crosses her path. Or has he already?",
         "L.A. shop owner Dana and Englishman Sean meet and fall in love at first sight, but Sean is married and Dana is to marry her business partner Alex."
      ],
      "budget": 0
   },
   "movielensId": 2175,
   "movielens": {
      "languages": [
         "Magyar",
         "English"
      ],
      "releaseDate": "1998-04-22",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Henry Jaglom"],
      "runtime": 117,
      "movieId": 2175,
      "title": "Déjà Vu",
      "mpaa": "",
      "actors": [
         "Stephen Dillane",
         "Victoria Foyt",
         "Vanessa Redgrave",
         "Michael Brandon",
         "Glynis Barber",
         "Vernon Dobtcheff",
         "Graydon Gould",
         "Noel Harrison",
         "Aviva Marks",
         "Anna Massey",
         "Rachel Kempson"
      ],
      "imdbMovieId": "0119033",
      "originalTitle": "Déjà Vu",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["KR-kHtqs7vs"],
      "plotSummary": "L.A. shop owner Dana and Englishman Sean meet and fall in love at first sight, but Sean is married and Dana is to marry her business partner Alex.",
      "tmdbMovieId": 161795,
      "avgRating": 3.4252,
      "releaseYear": "1998",
      "numRatings": 127,
      "posterPath": "/2BeYSPf181arGt4lWhRmpfBKFWm.jpg"
   }
}