{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "girlfriend",
            "id": 5490
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "truck",
            "id": 9276
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "serial murder",
            "id": 11260
         },
         {
            "name": "pin",
            "id": 47024
         },
         {
            "name": "ex-wife",
            "id": 155816
         },
         {
            "name": "necktie",
            "id": 165546
         },
         {
            "name": "sack",
            "id": 239328
         },
         {
            "name": "potatoes",
            "id": 239329
         },
         {
            "name": "produce seller",
            "id": 239330
         },
         {
            "name": "murder victim",
            "id": 239331
         }
      ],
      "imdb_id": "tt0068611",
      "video": false,
      "title": "Frenzy",
      "recommendations": [
         5854,
         506,
         11219,
         21734,
         574,
         5780,
         2370,
         22527,
         940,
         31997,
         11462,
         4174,
         30159,
         381,
         845,
         1978,
         1580,
         303,
         260,
         13321
      ],
      "backdrop_path": "/szCaGTZQEHlgrNdPryLAIg9WGFS.jpg",
      "revenue": 12600000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Richard Ian Blaney",
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bf9",
               "name": "Jon Finch",
               "profile_path": "/jnOuNM9B99Qo5bGLkp6pcUn30bh.jpg",
               "id": 8223,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Robert Rusk",
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015c01",
               "name": "Barry Foster",
               "profile_path": "/o5kC4YPORcB7p9EfFmUHKHaaRJO.jpg",
               "id": 8225,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Brenda Margaret Blaney",
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015c0d",
               "name": "Barbara Leigh-Hunt",
               "profile_path": null,
               "id": 8228,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Barbara Jane 'Babs' Milligan",
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015c09",
               "name": "Anna Massey",
               "profile_path": "/hO6qoo665U7JAHmbH7PQ7L07DOO.jpg",
               "id": 8227,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Chief Inspector Tim Oxford",
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bfd",
               "name": "Alec McCowen",
               "profile_path": "/z9TmCKc1WAFQ0qn2CJjbKlna4MX.jpg",
               "id": 8224,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Mrs. Oxford",
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015c19",
               "name": "Vivien Merchant",
               "profile_path": "/zsXeQnbwrW3WC1VNcZvkt83bezL.jpg",
               "id": 35314,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Hetty Porter",
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015c05",
               "name": "Billie Whitelaw",
               "profile_path": "/5XSUS3oSuG2CtJQPiEBQd9AAmg4.jpg",
               "id": 8226,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Johnny Porter",
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015c1d",
               "name": "Clive Swift",
               "profile_path": "/5mbu41Ifih1JjYBxNxiClXj0bUU.jpg",
               "id": 33108,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Felix Forsythe",
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015c11",
               "name": "Bernard Cribbins",
               "profile_path": "/uxpXeSHWOJvDnozRaYr7tixWmHk.jpg",
               "id": 40943,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Monica Barling",
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015c15",
               "name": "Jean Marsh",
               "profile_path": "/7LLKosDRULvBm1FOOBunpkgoNdj.jpg",
               "id": 12657,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Gladys",
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015c21",
               "name": "Elsie Randolph",
               "profile_path": "/8NQehJNb2hL1gVvwrgd1rA8XzzS.jpg",
               "id": 40966,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Mr. Usher the Solicitor in Pub",
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015c25",
               "name": "Gerald Sim",
               "profile_path": null,
               "id": 91663,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Sir George",
               "gender": 0,
               "credit_id": "52fe4254c3a36847f8015c29",
               "name": "John Boxer",
               "profile_path": "/7i914AsImDLfYAUxQG1kqX2AnhE.jpg",
               "id": 1075445,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bb9",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bbf",
               "name": "Arthur La Bern",
               "profile_path": null,
               "id": 7749,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bc5",
               "name": "Anthony Shaffer",
               "profile_path": null,
               "id": 7750,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bcb",
               "name": "William Hill",
               "profile_path": null,
               "id": 7751,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bd1",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bd7",
               "name": "Ron Goodwin",
               "profile_path": null,
               "id": 7752,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bdd",
               "name": "Gilbert Taylor",
               "profile_path": "/in9qOKV8kLCTAO1Zlm0S9dzGEke.jpg",
               "id": 7753,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015be3",
               "name": "John Jympson",
               "profile_path": null,
               "id": 7754,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4254c3a36847f8015be9",
               "name": "Sally Nicholl",
               "profile_path": null,
               "id": 7755,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bef",
               "name": "Syd Cain",
               "profile_path": null,
               "id": 7756,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4254c3a36847f8015bf5",
               "name": "Robert W. Laing",
               "profile_path": null,
               "id": 7757,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.374202,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 573,
      "vote_count": 219,
      "budget": 3500000,
      "overview": "A serial murderer is strangling women with a necktie. The London police have a suspect, but he is the wrong man.",
      "similar": [
         281,
         357096,
         123109,
         158011,
         8090,
         12150,
         4771,
         1949,
         281957,
         948,
         979,
         4638,
         395834,
         22825,
         2760,
         984,
         276488,
         2142,
         25376,
         21484
      ],
      "original_title": "Frenzy",
      "runtime": 116,
      "poster_path": "/4SFvqrlSigAt9tnhXFSMyKeJWQk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1972-05-25",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Just an ordinary necktie used with a deadly new twist.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alfred Hitchcock"],
      "runtime": 116,
      "synopsis": "There is a serial killer working the streets in London raping and strangling women with a neck tie, the last of whom is discovered floating in the Thames. Richard Blaney (Jon Finch), a disillusioned former Royal Air Force officer working as a bartender, has just been fired for drinking on the job and is seeking career-direction with his bar-maid girlfriend Babs Milligan (Anna Massey). As Blaney hits the streets in search of another job he wanders to Covent Garden Market to chat with his friend Bob Rusk (Barry Foster), a local fruit dealer, to figure out what he will do. The police are clueless to the culprit in the ongoing crime and working on a solution casually speaking with Rusk whose sarcasm offsets the serious tone of the authorities. After having too many glasses of brandy, Blaney goes to see his ex-wife Brenda Blaney (Barbara Leigh-Hunt) whose matrimonial agency is moderately successful at putting people together. Brenda takes Blaney to dinner and surreptitiously puts money in his pockets which he discovers as he is sleeping the night at the local Salvation Army. When Brenda is raped and strangled by the necktie murderer the police suspect Blaney and a manhunt led by Chief Inspector Oxford (Alec McCowen) is initiated for him. Inspector Oxford seems to be experiencing his own form of gastronomical torture in his marriage with a wife experimenting in gourmet cooking by using her husband as a test subject. As the net tightens and the police eventually capture Blaney, suspicions arise in Oxford's mind about the possible true culprit.",
      "writers": [
         "Arthur La Bern",
         "Anthony Shaffer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068611/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM1NDA2Njc2NF5BMl5BanBnXkFtZTgwODUxMDY0MTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jon Finch, Barry Foster, Alec McCowen | See full cast and crew »"],
      "reviews": [
         "Hitchcock had been in a bit of an artistic slump when, after some thirty years, he returned to England for this, his next to last film--and the result was his final masterpiece. Scripted with ghoulish humor by Anthony Schaffer, FRENZY opens with a ceremony on the banks of the Thames in which Londoners inaugurate legislation to rid the river of pollutants... only to have the corpse of a naked woman wash ashore in the midst of their celebrations. She has been strangled with a tie--the latest victim of a serial killer who savagely rapes and then murders his victims by twisting his necktie around their throats. With the city in a panic and Scotland Yard desperate to catch the killer, suspicion falls on a down-on-his-luck bartender named Richard Blaney. Trouble is, he isn't the killer. In a sense, FRENZY has a strangely Dickensian flavor. It is a film that by and large seems to happen in public places: pubs, parks, offices, hotels, and most particularly Covent Garden with its constant hustle and bustle that serves to conceal horrors that occur inches away from the safety of the crowds. Indeed, the city seems almost a \"master character\" in the film, constantly pressing in upon the humans that inhabit it. Fans of the British comedy series \"Keeping Up Appearances\" will recognize Clive Swift in a minor role, but for the most part the cast consists of unknowns--but while they lack name recognition they certainly do not lack for talent, playing with a realism that seems completely unstudied. Leading man Jon Finch (Richard Blaney) is perfectly cast as the attractive but disreputable suspect on the run, and he is equaled by his chum Barry Foster (Robert Rusk.) A special mention must also be made of the two female leads, Anna Massey and Barbara Leigh-Hunt--not to mention the host of supporting characters who bring the entire panorama of the great city to life. In his earlier films, Hitchcock generally preferred to work by inference, implying danger and violence rather than openly showing it on the screen. PSYCHO broke the mold, and with FRENZY Hitchcock presents a sequence that many believe equals the notorious \"shower scene:\" a horrific rape and slow strangulation that leaves the viewer simply stunned. But having given us this horror, Hitchcock ups it with a scene in which we see no violence at all: just a camera shot that glides away from an apartment door, down the stairs, through the hall, and out into the busy street... as we shudder with the knowledge that the woman who just entered that apartment door is now being horrifically raped and murdered. Hitchcock made one more film, a comic wink with twists of suspense starring Karen Black, Bruce Dern, and Barbara Harris called FAMILY PLOT--and it is an enjoyable film in its own right. But it is FRENZY that is the final jewel in the Hitchcock crown, a film to rank among his best. The DVD presentation includes a number of extras--including numerous interviews with the cast--that Hitchcock fans will find fascinating. All in all, FRENZY is fearsome, wickedly funny, and strongly recommended... but not for the faint of heart! Gary F. Taylor, aka GFT, Amazon Reviewer",
         "After 30 years in the USA and after the disappointments of \"Torn Curtain\" (1966) and \"Topaz\" (1969), Alfred Hitchcock came back to his native Britain for this film -written by Anthony Shaffer from a novel by Arthur La Bern. \"Frenzy\" is his penultimate movie, certainly the best one of his last period. The way the Master films is very classic -deliberately old fashioned; at the same time all the charachters are very modern -they belong to a more and more decadent and neurotic London. Almost from the beginning we know who the criminal is, and Hitchcock enjoys himself in showing how the man tries to escape and how he betrays people. Director's trademarks are also back in force: suspense (a lot!) and humour -more sarcastic and sharper than ever. For \"Frenzy\" the Master doesn't get movie stars, instead he chooses local stage actors. In my opinion he does this because, first, he wants the film to be very English. Furthermore, he wants this time more ordinary faces for making the story more shocking (with famous actors in the main roles, the plot -in a certain way- could be identified mostly with them and loose strength, instead Hitchcock avoids that \"paradox\"...). Maybe \"Frenzy\" is not an unforgettable masterpiece like \"Psycho\", \"Vertigo\", \"Birds\" or many other works. But it is a great movie indeed.",
         "The grand man of suspense, Alfred Hitchcock, directs this dark film about a man that kills women with neckties with relish, aplomb, and an atypical grimness. The story is typical Hitch as an innocent man is pushed into a world of intrigue around him as everyone believes him to be the necktie killer. Jon Finch plays the innocent with earnestness and is quite good in his role. The rest of the cast is very effective as well. Hithcock, however, is the real star with his camera. Although much of the film is nothing more than tried and true material, Alfred Hitchcock makes the mundane spectacular with his camera and some great shots and spaces of silence. The scene where a girl coming back from lunch is awesome as we the audience are made to wait what seems an eternity for her to discover what has taken place since she left. The scene of the camera moving in and out of the house of the killer is also wonderful, as is the scene with the killer in the potato truck. That scene is easily the most suspenseful of the entire film. The film is particularly dark for Hitchcock as a women is raped rather abruptly(for lack of a better word) showing naked breasts and genuine terror. To counter-balance the more lurid aspects of the film is a subplot story of a police inspector, played with charm by Alec McCowen, whose wife constantly feeds him nothing but gourmet meals that sound and look quite horrible! These scenes are so funny and charming! A good thriller from the master of suspense!",
         "You should be warned that \"Frenzy\" has one of the most gruesome rape/murder scenes ever filmed - beautifully filmed, of course, so that you don't look away, but that makes it all the more terrible. It's followed by one of Hitchcock's great signature shots, as the camera draws back, out of the building, into the crowded and noisy streets, where the scene of the crime becomes just one room among many. That's \"Frenzy\" for you. It's one of Hitchcock's most assured and gripping films; but it's pretty grim. Everyone in London looks surprisingly ugly. Their characters, from hero to villain, are a trifle uglier too. But don't expect a happy ending. Things go just a little bit past the point where a happy ending is possible.",
         "After the disaster that TOPAZ represented, Alfred Hitchcock took a three-year hiatus, did an about-face from the United States, and returned to his native England to produce this extremely graphic, violent film which not only made him return full circle to his cinematic origins, but also sent him back to square one -- THE LODGER -- in which a wrong man is accused of a crime he didn't commit. If he had not made FAMILY PLOT it would be a fitting close to a remarkable film career. Despite the fact that FRENZY is a story about a rapist-murderer laying terror unto London, this is not a mystery by far. From the very beginning we're introduced to the man behind the murders, but also to the man who ultimately comes to be convicted for those very murders -- one of them his very own wife. Hitchcock, of course, loves the dark side of humanity and has expressed a need to tell stories about \"the wrong man\" as well as explore the natures of depravity hidden underneath a smiling surface, always with his trademark humor. That humor is as black as ever here, seen mainly in the scenes involving the inspector in charge of the investigation of the crimes and his wife (who can't cook to save her life), and especially in the grim sequence when the real killer goes through hell to retrieve his tie-pin which has remained within his latest victim's death grip. By far the most graphic film in his career, Hitchcock manages to pull some clever camera stunts which service not only the plot, but the sense of voyeurism as an experience. In a great shot, he pulls back from the scene where the killer and his victim enter his apartment, down a flight of stairs, and onto the indifferent streets of London. He's made us witnesses and therefore, accomplices, because he knows we can't do a single thing to save that woman's life.",
         "\"Frenzy\" was Alfred Hitchcock's next-to-last film. And though it's not a great classic like \"Psycho\" and \"North by Northwest\", it's still a very good movie. After making mostly American movies for four decades, Hitchcock returned to his native Britain to make \"Frenzy\". It's about a series of murders that's devastating London. These murders have two things in common: 1) The victims are all women; and 2) they're all raped and then strangled with a neck-tie. When a marriage counselor is murdered this way, the police suspect the woman's ex-husband is the culprit. But actually the husband is innocent, and is forced to hide out from the cops. \"Frenzy\" has all the usual Hitchcock elements: thrills, suspense, comedy, and Hitchcock's cameo appearence. The two best scenes in the movie are the hilarious moments when the police inspector (who's heading up the investigation of the neck-tie murders) is served two gourmet dinners by his wife. These scenes are very funny. The comic moments is what gives \"Frenzy\" a edge over Hitchcock's previous film \"Topaz\". Plus, it's a more entertaining thriller. *** (out of four)",
         "Hitchcock did one hell of a job! I was planning on watching this movie just for about 30 minutes before going to sleep and was gonna finish watching it the next day, but instead I was so engaged that I couldn't stop watching and stayed awake the whole 2 hours. I loved the irony of the actual rapist having no clues pointing to him and the innocent man having all clues pointing to him. The scene involving the rapist in the back of the truck, rummaging through a sack of potatoes (and that's all I'll reveal) is classic suspense. I also loved how Hitchcock left the rape scenes (excluding the first one) up to the imagination. There is a great shot where one of the victims is being raped and we don't even hear any off-screen yells or screams. The camera simply tracks backwards down a staircase and out the front door, where people walk by minding their own business, ignorant to the evil that's being committed a floor above. Any amateurish director would've went for true shock value and showed all the rape scenes in explicit detail. We don't call Hitchcock the master of suspense for nothing. The scene is still quite haunting. In horror and suspense, what you don't see can be a lot more frightening than what you do see, since the imagination is a powerful thing. The last line of the movie should go down in history. It had me bawling with laughter! Just that one line gave perfect closure to this wonderful film. My score: 8 (out of 10)",
         "I really enjoyed Frenzy. I think that Alfred Hitchcock, although he may not have been on top of his game was still sticking to his style. I particularly enjoyed all of the suspense, actors, and screenplay. It got me more and more curious until the end. I think that Hitchcock also stuck very well to his medium in this movie. He also picked the best spots in London to film it. Although I did not necessarily appreciate the rape and murder scene he showed because it was disgusting, I really enjoyed the action. Hitchcock also did a very good job of the camera angles in this movie. For the most part it is just a regular Alfred Hitchcock film except for the nudity,the rape scene, and some slight use of horror. Overall, I think it was just the time that Hitchcock had reached the end of his career and did his best to please his audience. With his age and his state of health, I think that he did an outstanding job of his second to last film.",
         "There's a necktie murderer running around London. He attempts to rape women (he can't he's impotent) and, in his rage, strangles them with his ties. A \"nice\" guy named Rusk (Barry Foster) is the killer but his best friend Richard (Jon Finch) is the one accused of it... Hitchcock's first (and last) film in London since the 1950 \"Stage Fright\". Something about London seemed to rejuvenate him--his two movies before this (\"Topaz\" and \"Torn Curtain\") were slow, uninvolving and deadly dull. This moves quickly, has a good script and large doses of VERY black humor--much blacker than Hitchcock had ever attempted before. The film was also Hitchcock's first to get an R rating for a pretty explicit rape/strangulation and flashes of female nudity. To be honest, it's pretty tame by today's standards but still disturbing. It's kind of surprising that Hitchcock would get so vicious...but \"Psycho\"s shower stabbing was considered shocking for its time as was the scissors killing in \"Dial M for Murder\". The acting varies wildly. Mostly everybody is very good--especially Foster, Jean Marsh (in a amusing small role) and Anna Massey. But Finch, as the main character, is terrible. He is handsome but his character is brutal, obnoxious and his acting is just horrendous. That drags the movie down as I didn't care for him at all. The movie also contains many incredibly-directed sequences--especially the potato truck sequence and a reverse shot sequence. Also it has an infamous--and very funny--final line. Bad acting from Finch aside this is a good movie and worth catching. I give it an 8.",
         "Those who blame Hitchcock for the intensity of the rape/strangulation scene should realize that he wrote neither the screenplay (which was written by playwright Anthony Shaffer, best known for his marvelous comic/mystery \"Sleuth\") nor the novel upon which it was based (\"Goodbye Piccadilly, Farewell Leicester Square\" by Arthur La Bern)...and that the scene in the film runs exactly the same course, with precisely the same detail as the scene in the book. In fact, now that I think of it, the scene in the film is actually tamer. Hitchcock's film does not, after all, make any reference to the post-mortem insertion of a letter opener. If anything, Hitch showed restraint with his version of the scene. Not as much restraint as is usual for him...but restraint, nonetheless. And he achieved what he set out to do. The scene is absolutely chilling. And not only is it memorable...it's the most unforgettable scene of its kind."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Universal Pictures",
         "Universal Pictures"
      ],
      "summaries": [
         "London is terrorised by a vicious sex killer known as the neck tie murderer. Following the brutal slaying of his ex-wife, down-on-his-luck Richard Blaney is suspected by the police of being the killer. He goes on the run, determined to prove his innocence.",
         "In London, a serial-killer is raping women and then strangling them with a neck tie. When the reckless and low-class with bad temper bartender Richard Blaney is fired from the pub Global Public House by the manager Felix Forsythe, he decides to visit his ex-wife Brenda, who owns a successful marriage agency. Her secretary Miss Barling overhears an argument of the couple, and Brenda invites Richard to have dinner with her in a fancy restaurant. Then she put some money in his overcoat and does not tell him to avoid his embarrassment with the situation. Meanwhile Richard's friend Bob Rusk visits Brenda in her office, rapes her and kills her with his neck tie. When Richard finds the money in his pocket, he visits Brenda but finds the agency closed; then he goes with his girlfriend Babs Milligan to an expensive hotel. Miss Barling sees Richard leaving the building and finds her boss strangled; she calls the New Scotland Yard and Richard becomes the prime suspect. When Bob kills Babs, he frames Richard that is arrested and sentenced to life. But the Chief Inspector Oxford that was in charge of the investigation is not absolutely sure that Richard is the serial-killer.",
         "Covent Garden wholesale fruit merchant Bob Rusk is an impotent serial killer who strangles women with a necktie. One of his victims is Brenda Blaney, the ex-wife of his best friend, Richard Blaney, who becomes a prime suspect. Fearing discovery, Rusk kills Blaney's girlfriend, a barmaid, and Blaney is arrested. Escaping from jail, Blaney is followed by the police to Rusk's flat, where he's headed to seek revenge for his wrongful conviction of the crimes.",
         "A serial murderer is strangling women with a necktie. The London police have a suspect, but he is the wrong man."
      ],
      "budget": 2000000
   },
   "movielensId": 2178,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-05-25",
      "dvdReleaseDate": "2001-03-06",
      "directors": ["Alfred Hitchcock"],
      "runtime": 116,
      "movieId": 2178,
      "title": "Frenzy",
      "mpaa": "R",
      "actors": [
         "Jon Finch",
         "Barry Foster",
         "Barbara Leigh-Hunt",
         "Anna Massey",
         "Alec McCowen",
         "Vivien Merchant",
         "Billie Whitelaw",
         "Clive Swift",
         "Bernard Cribbins",
         "Jean Marsh",
         "Elsie Randolph",
         "Gerald Sim",
         "John Boxer"
      ],
      "imdbMovieId": "0068611",
      "originalTitle": "Frenzy",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "0gWjZpkkkIs",
         "p-hz825qIjo"
      ],
      "plotSummary": "A serial murderer is strangling women with a necktie. The London police have a suspect, but he is the wrong man.",
      "tmdbMovieId": 573,
      "avgRating": 3.5957,
      "releaseYear": "1972",
      "numRatings": 1233,
      "posterPath": "/4SFvqrlSigAt9tnhXFSMyKeJWQk.jpg"
   }
}