{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "aids",
            "id": 740
         },
         {
            "name": "roommate",
            "id": 1253
         },
         {
            "name": "homicide",
            "id": 1849
         },
         {
            "name": "car journey",
            "id": 1926
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "homosexuality",
            "id": 10180
         },
         {
            "name": "escape",
            "id": 10685
         },
         {
            "name": "road movie",
            "id": 167043
         }
      ],
      "imdb_id": "tt0112571",
      "video": false,
      "title": "Boys on the Side",
      "recommendations": [
         40562,
         47608,
         17362,
         51321,
         30500,
         22625,
         26355,
         9079,
         47676,
         26626,
         83489,
         36259,
         34322,
         68430,
         18555,
         9089,
         38554,
         47818,
         77246,
         12280
      ],
      "backdrop_path": "/3t7PQdmlXjCcR3GV9MQBEFSqRyy.jpg",
      "revenue": 23450000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jane Deluca",
               "gender": 1,
               "credit_id": "52fe44f0c3a36847f80b2ed9",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Robin",
               "gender": 1,
               "credit_id": "52fe44f0c3a36847f80b2edd",
               "name": "Mary-Louise Parker",
               "profile_path": "/3e72qs1QuqMlpieIm2JZtX1WNg2.jpg",
               "id": 18248,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Holly Pulchik-Lincoln",
               "gender": 1,
               "credit_id": "52fe44f0c3a36847f80b2ee1",
               "name": "Drew Barrymore",
               "profile_path": "/y8GKPHsBXVGIGBdDzdNxjm0IbKF.jpg",
               "id": 69597,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Abe Lincoln",
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2ee5",
               "name": "Matthew McConaughey",
               "profile_path": "/jdRmHrG0TWXGhs4tO6TJNSoL25T.jpg",
               "id": 10297,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Alex",
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2ee9",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2eed",
               "name": "Billy Wirth",
               "profile_path": "/oyigYLUbcfdpkhC5SqAQuRyLA7p.jpg",
               "id": 39112,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44f0c3a36847f80b2ef3",
               "name": "Herbert Ross",
               "profile_path": "/5bKYVnMfWhjAOmMHv7Y6boqnOja.jpg",
               "id": 18378,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2ef9",
               "name": "Don Roos",
               "profile_path": "/xPnPpnylece1hzz2uUPbvbEHXZV.jpg",
               "id": 57579,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f0c3a36847f80b2eff",
               "name": "Patricia Karlan",
               "profile_path": null,
               "id": 57580,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2f05",
               "name": "Arnon Milchan",
               "profile_path": "/5crR5twLRcIdvRR06dB1O0EQ8x0.jpg",
               "id": 376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2f0b",
               "name": "Steven Reuther",
               "profile_path": null,
               "id": 1202,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2f11",
               "name": "Don Roos",
               "profile_path": "/xPnPpnylece1hzz2uUPbvbEHXZV.jpg",
               "id": 57579,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f0c3a36847f80b2f17",
               "name": "Herbert Ross",
               "profile_path": "/5bKYVnMfWhjAOmMHv7Y6boqnOja.jpg",
               "id": 18378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2f1d",
               "name": "David Newman",
               "profile_path": "/vncTIJaBWoYmpdNCPkDnA8hT3PM.jpg",
               "id": 3393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2f23",
               "name": "Donald E. Thorin",
               "profile_path": null,
               "id": 6490,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f0c3a36847f80b2f29",
               "name": "Michael R. Miller",
               "profile_path": null,
               "id": 5175,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.779171,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9382,
      "vote_count": 67,
      "budget": 21000000,
      "overview": "After breaking up with her girlfriend, a nightclub singer, Jane, answers a personal ad from Robin, a real estate agent with AIDS, seeking a cross-country travel partner. On their journey from New York City to Los Angeles, the two stop by Pittsburgh to pick up Robin's friend Holly, who is trying to escape an abusive relationship. With three distinct personalities, the women must overcome their differences to help one another.",
      "similar": [
         1213,
         9800,
         11356,
         862,
         158,
         920,
         1429,
         28178,
         100042,
         68718,
         376867,
         449176,
         8839,
         113833,
         1833,
         152532,
         397422,
         13523,
         7191,
         11006
      ],
      "original_title": "Boys on the Side",
      "runtime": 115,
      "poster_path": "/dcgbt8FkRLvQjaheVlylPSQeTKC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Alcor Films",
            "id": 644,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "Hera Productions",
            "id": 16192,
            "origin_country": ""
         },
         {
            "logo_path": "/hNuGhsKVlmhnwSRcmOejDBDjh6w.png",
            "name": "New Regency Pictures",
            "id": 10104,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-03",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "A motion picture that celebrates the art of survival, the gift of laughter and the miracle of friendship.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Herbert Ross"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Don Roos"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112571/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNzg4NDk3OF5BMl5BanBnXkFtZTcwMjcwNTgxMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Whoopi Goldberg, Mary-Louise Parker, Drew Barrymore | See full cast and crew »"],
      "reviews": [
         "Another film that I liked a lot more than I thought I would. Drew Barrymore was as adorable as ever, even though she was playing a ditzy blonde. Mary-Louise Parker really made this film. Her frail cuteness with the edge of toughness when necessary was perfect. And Whoopi Goldberg played it in an understated way that shows her talent, that she can handle a lot more than the over-the-top comedic roles that she is so famous for. Matthew McConaughey plays a caricature, so there is really no indication of talent there. The ending swims in poignancy, without getting (too) cloying. This film is definitely worth a look.",
         "'Boys on the side' is a very touching movie that looks essentially at what it means to be a woman, trapped inside a man's world. It also shows that friends really do stick together, through thick and thin. With the three leading ladies in roles that are really well written, here is a classy 'chick flick', that one guy really likes. It also looks into what it means to be sick, which I have been no stranger too, either.... Three women sharing a car going west, team up in this winning celebration of camaraderie, caring and friendship which quickly becomes a family, in 'Boys on the Side'. One is a wisecracking club singer, one is a finicky real-estate agent and one is a free spirit. Each has secrets to reveal, strengths to impart and vital moments of self-discovery awaiting. Now is their time. What a fine cast for such a dramatic movie. The three main girls in 'Boys on the side' include the 'lesbo' Jane (Whoppi Goldberg), Robin (well acted by the talented Mary-Louise Parker), who is being helped to drive across America by Jane, and the fun loving and partly liberated Holly (Drew Barrymore). All these women are amazing in their roles. I love how Jane stands up for herself and her sexuality, in addition to the fine music she can sing. Robin is a girl hiding a big secret, but we are aware that her life has not been an easy ride, which seems ironic, because of what the movie shows. Then what Holly is enduring, is quite staggering, being involved with a brutal man, Nick (Billy Wirth), that no woman should have to put up with. It is Holly's great personality and character that turn these best friends into a very close-nit family. Her situation is not as easy as it seems either. While men are not talked about in a very good light in the film, we do see some men that are decent to these women. Robin admits to having a thing for barman, and on the road trip she meets up with Alex (James Remar) a caring barman, who is really hooked on Robin. The way their relationship goes is an interesting aspect of the movie. James had an interesting character in HBO's 'Sex and the city'. Holly, with such a bubbly personality meets a cop cutely named Abe Lincoln (Matthew McConaughey). He dearly loves Holly, wants her as his wife, so she can live a life that can be happy and trouble-free. I am interested in seeing McConaughey's latest film, titled 'How to lose a guy in 10 days'. The director of BOTS was Hebert Ross (from the brilliant 80's movie, Steel Magnolias). He is a very game sort of director, and does not shrug away from any of the important issues within the film. I love how he brought out the movie's main themes of sex and sexuality (gay and straight), the empowerment of women, friendship, sickness, humour and what it means to be a family. But the movie's story was also a highlight from where I viewed it. Written by Don Roos, it was very touching and emotional, but also holds a large amount of subtle, clever humour. The way he wrote the three main characters was terrific, with them all having very different situations for us to learn about. This I believe allows us to fall in love with each one of them. The use of quick flashbacks is another aspect that was well written into the screenplay by Roo's as were some of the lines in BOTS, which are unforgettable. Lines like when Holly asks Robin at the dinner table, `We're you?' in reference to her and Jane having a sexual relationship, the next few lines are great. The title of the film was well thought up, considering the line that Robin's mother says to her daughter, `You can't fight nature, God knows you women keep trying, treating your men like side dishes, stick a fork in when needed, just like men used to treat us.' That line is basically what the film is all about. Another great part to this film was its soundtrack. It was not only clever to incorporate it via one of the movie's characters, that of Jane, it makes the whole movie all the more compelling. Whoppi Goldberg and Mary Louise Parker sing a fine solo of the Roy Orbison classic, 'You got it'. Then for the movie to have another performer actually sing the song, I found to be just original, as some films would just throw in the old song, but not here. Another ironic part of the soundtrack is a song written and sung by known lesbian Melissa Etheridge, titled 'I take you with me'. I am sure that the powers behind this movie wanted such a performer, considering one of the main characters in the film was also gay. I watched this film, just a few weeks after seeing a movie that I am sure inspired the writer of the script, that being 'Thelma and Louise'. Parts of 'Boys on the side' has a similar feel to 'Thelma and Louise' - that of women on a road trip, trying to break free of men's hold on them. While a lot of the film is original, it has a very touching ending, to what can only be described as a very emotional movie. I also feel that director Herbert Ross, allows us to experience what each character is going through in life and does not shrug away from any issues that other movies might simply try and avoid. With a cleverly incorporated soundtrack, 'Boys on the side', is a movie that we can all learn from, to try and improve not only our friendships that we have, but how we live our lives in a world that can be cruel, harsh and unfair. CMRS gives 'Boys on the side': 4 (Very Good Film)",
         "Absorbing, funny and incredibly aware comedy-drama about three ladies on a road trip: Whoopi Goldberg as a lesbian lounge singer, Drew Barrymore as a pregnant, unmarried waif, and Mary-Louise Parker as an uptight woman trying to loosen up (and suffering from HIV). Plot is contrived, but the interaction between the characters is definitely not. Screenwriter Don Roos writes vivid dialogue and touching scenes, and the cast plays it to the hilt. Barrymore is at her best here, Goldberg is outstanding, and Parker--while not a varied actress--does solid work. Nice direction by Herbert Ross, who hasn't been this focused in years. ***1/2 from ****",
         "Cynics might say its a chick flick or a dyke flick. Then remake me a chick or a dyke to get the kind of real, unbridled love -- romantic and platonic -- that these women have for each other and their hetero spouses/friends. Mary-Louise Parker's character is so sad, yet so rich. Barrymore's fatuous shenanigans in the bus window are hilarious. Whoopie is no-nonsense, a realist, a skeptic -- but not offensive or shrill. Minor characters are great, too. Fried Green Tomatoes goes to Arizona. Sound track is to die for.",
         "I LOVE this movie. It's touching, funny, sad, heartbreaking and inspiring all in one. I found Mary-Louise Parker's character so like myself that it was hilarious! Drew Barrymore, lovely as ever in her role, provided the much-needed sparkle to the movie. Some parts were a lot sadder and more sinister than others, but Drew was always there to bring the sunshine! It's so touching, it makes me cry every time. But I love it. It's not perfect by any means, but it's definitely one to watch with the girls. Boys are on the side.",
         "Count the chick-flick conventions: The revenge on the abusive boyfriend; the three so-different young women bonding; the mother-daughter conflicts; the road trip; the scene where somebody sings \"Happy Birthday\" to somebody amid much general rejoicing; the adorable baby; the tear-wringing incurable-disease character; etc. It's well-written -- Don Roos, who later wrote the superb screenplay to \"The Opposite of Sex,\" puts more curve on his dialog than most toiling in this genre -- but as with many sisters-united-in-adversity epics, it keeps wanting to yank emotions out of you rather than earn them honestly. The three leads are good, a young Matthew McConnaughey isn't yet annoying, and there are nice turns from Estelle Parsons and Anita Gillette, a Broadway baby decades earlier who matured into a proficient character actress. But Herb Ross is in his take-no-chances mode, and too much of the picture feels programmed and rote.",
         "Drew Barrymore really makes this movie what it is as the dizzy (blonde of course) Holly, with her fresh and upbeat view on life. The faces which Barrymore pulls to dramatize her part will keep you laughing (e.g whilst on the Greyhound bus, whilst in labor). Moreover, this film shows that Barrymore can not only play the slutty, seductive parts (e.g The Amy Fisher Story, Poison Ivy) but a role which mixes both. What will surprise you about this comedy (and tear jerker) is that it's not as predictable as you may except. Although the story line is simple, there are always the odd parts which you don't expect. The fight at the beginning with Nick will keep you shocked and probably laughing. It's definitely a chick flick (although the guys may drool over a blonde Barrymore.) However the actor who plays Abe Lincoln is an eye catcher. This is not one of Whoopi Goldberg's best roles and I didn't think her part as the lesbian was believeable, yet she did display both strength and humor to keep you interested. Mary Louise Parker was excellent and her performance was on line with her part. Definitely a movie for a Barrymore fan and if you need a heart warming movie to keep you interested at night. You go get it!",
         "I hadn't seen this film since it was in theaters, almost 20 years ago, but it is currently in heavy rotation on a cable movie channel. It has not aged well, influenced by popular 80s films like Thelma and Louise, Fried Green Tomatoes or Steel Magnolias -- female pal movies that were much better than this one. In fact, Mary-Louise Parker is pretty much reprising the same exact role from Fried Green Tomatoes only in contemporary dress. There is even an identical lesbian angle (Parker is the pretty straight girl who has a lesbian who adores her, futilely). My guess is that for most women, being adored by a mannish lesbian is not very flattering, but creepy and you wouldn't go on to hang around with that person as your \"bestie\" -- you'd avoid them. Drew Barrymore is about 20 years old here and just adorable with a mop of curly hair. There is also Matthew McConnaughey in his first role, as a straight arrow cop who loves Drew. And of course Whoopie Goldberg, basically playing herself -- she simply has no range at all. Her character is not very convincing as a lesbian, it seems like a plot device. She too is reprising her role from Sister Act -- the flamboyant lounge singer. So though the actresses are all quite attractive, and there is some cute, snappy dialog amongst them, the plot structure is ridiculous. Whoopie is driving from NYC to LA, and needs someone to share gas expenses (in a minivan?), and Mary-Louise joins her. They pick up Drew, who is running away from an abusive boyfriend (whom she accidentally murders). On the way, Mary-Louise's AIDS flares up, so they stop and STAY FOREVER in Tucson -- where none of them have roots or family or any reason to be there. Amazingly they are able to rent a huge adobe MANSION in the remote desert (???) though none of them has money or a job, and one is pregnant and one is dying of AIDS. How do they pay for this? It's like a $3 million dollar palazzo. BTW, I've been to Tucson and it is staggering hot desert country, something you'd never glean from the film -- it's like they picked Tucson by throwing a dart at map blindfolded -- for starters, it is NOT on the way from NYC to LA, but hundreds of miles out of the way. Let me repeat: none of them have real jobs, or health insurance, yet it's no problem to rent a huge house (constantly filled with hundreds of friends -- in a strange city -- and lavish parties). It's all about \"bonding\" between these 3 very different women who honestly have nothing in common, and one is dying and another has a deeply creepy crush on her. There is a time-line here set by Drew's character's pregnancy -- she is visibly pregnant as soon as they are in Tucson and has her baby near the end, so the whole film must be happened in under 7 months and more likely 3-4 months. Yet it is very clear in the plot that over a year goes by -- the longest pregnancy in history. Furthermore, it ends up that Drew's baby is fathered by some black guy who is never mentioned in the plot at all. Matthew recovers from this shock in a nanosecond, and presumably marries her anyways. In short, this is less about female friendship than pure science fiction. These are not dear friends but casual acquaintances from a road trip, and their stay-over in Tucson makes zero sense plot-wise or common-sense wise. Most treasured friendships evolve over a lifetime of shared experience -- not forced through contrived short-term events. It's beyond obvious this was written and directed by men.",
         "This is my favorite film of all time. It has everything you want in a film. It is funny and has plenty of action throughout. It is also so sad, anyone who doesn't cry must be emotionally retarded. I especially love Mary Jane Parker in this film even though all the actors are great.The film has so many great lines in it too and who would have known Whoopi Goldberg has a decent singing voice. I strongly recommend everyone to watch this. Its just a shame i cant get this on region 2 DVD anywhere so i have to watch it on video which is not great.",
         "POSSIBLE SPOLIERS AHEAD! Great movie about three women (Whoppi Goldberg, Mary-Louise Parker, Drew Barrymore) and their various adventures as they travel cross-country. Goldberg plays a lesbian, Parker plays a straight woman with AIDS and Barrymore a pregnant, unwed woman. All three are fantastic and the film manages (more or less) to juggle many plot elements (AIDS, lesbianism, pregnancy, drugs, violence, murder etc etc) and deal with them all effectively. Parker is probably the first woman ever to play a straight woman with AIDS in a major Hollywood film--quite a feat. Goldberg and Barrymore are just letter perfect in their roles. Also the unknown Matthew McConaughey (absolutely gorgeous with a buff body and blue eyes blazing) and Estelle Parsons (as Parker's mother) give strong supporting performances. The film is long but never dull and it all ends to a very moving final sequence--I cry every time I see it! Two minor quibbles--it takes Barrymore over a year to have her baby and there are obvious cuts in the second half of the movie (I assume this was to keep the film down to two hours). But these are minor problems. A very funny, very moving film. Don't miss it!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Alcor Films",
         "Canal+",
         "Hera Productions"
      ],
      "summaries": ["Jane is a night club singer, out of work. Robin is a quirky real estate agent looking for a ride-share to accompany her to California. Her advertisement is answered by Jane, who at first was uncertain about her. A stop in Pittsburgh picks up a third, Holly, escaping a violent and drug-dealing partner. Girls on the road, reaching understanding, respect, and care for each other. But this trio is different - Jane a lesbian, Robin suffering with AIDS, Holly running from her past, seeking one-night stands and a good man."],
      "budget": 21000000
   },
   "movielensId": 218,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-03",
      "dvdReleaseDate": "1999-04-27",
      "directors": ["Herbert Ross"],
      "runtime": 115,
      "movieId": 218,
      "title": "Boys on the Side",
      "mpaa": "R",
      "actors": [
         "Whoopi Goldberg",
         "Mary-Louise Parker",
         "Drew Barrymore",
         "Matthew McConaughey",
         "James Remar",
         "Billy Wirth"
      ],
      "imdbMovieId": "0112571",
      "originalTitle": "Boys on the Side",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["zr7YfmdIDjU"],
      "plotSummary": "After breaking up with her girlfriend, a nightclub singer, Jane, answers a personal ad from Robin, a real estate agent with AIDS, seeking a cross-country travel partner. On their journey from New York City to Los Angeles, the two stop by Pittsburgh to pick up Robin's friend Holly, who is trying to escape an abusive relationship. With three distinct personalities, the women must overcome their differences to help one another.",
      "tmdbMovieId": 9382,
      "avgRating": 3.28578,
      "releaseYear": "1995",
      "numRatings": 4423,
      "posterPath": "/dcgbt8FkRLvQjaheVlylPSQeTKC.jpg"
   }
}