{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "east germany",
            "id": 156026
         }
      ],
      "imdb_id": "tt0061107",
      "video": false,
      "title": "Torn Curtain",
      "recommendations": [
         2370,
         506,
         5854,
         573,
         574,
         11219,
         31997,
         4174,
         381,
         1978,
         21734,
         2761,
         11462,
         940,
         25670,
         13321,
         22527,
         260,
         12684,
         31667
      ],
      "backdrop_path": "/w4t3YpCg2tGzOmbWQBVjyhDK9iN.jpg",
      "revenue": 13000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Michael Armstrong",
               "gender": 2,
               "credit_id": "52fe4422c3a36847f80842e1",
               "name": "Paul Newman",
               "profile_path": "/my0Blo9IBy1WZ0QKbuxUzS0QwV5.jpg",
               "id": 3636,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sarah Sherman",
               "gender": 1,
               "credit_id": "52fe4422c3a36847f80842e5",
               "name": "Julie Andrews",
               "profile_path": "/yQ0J92DMiLtQYoytLJ6CuBkdeN0.jpg",
               "id": 5823,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Countess Kuchinska",
               "gender": 1,
               "credit_id": "52fe4422c3a36847f80842e9",
               "name": "Lila Kedrova",
               "profile_path": "/4yFdLNkEEhONH5hvbfXlOZnRXnw.jpg",
               "id": 45523,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Heinrich Gerhard",
               "gender": 2,
               "credit_id": "52fe4422c3a36847f80842ed",
               "name": "Hansjörg Felmy",
               "profile_path": "/t0GW92tBzVgbfhpjMddu1n8bch9.jpg",
               "id": 45524,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ballerina",
               "gender": 1,
               "credit_id": "52fe4422c3a36847f80842f1",
               "name": "Tamara Toumanova",
               "profile_path": "/aeOVZKaGp70NW7tZJT1ygEazhAD.jpg",
               "id": 41985,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Hermann Gromek",
               "gender": 2,
               "credit_id": "52fe4422c3a36847f80842f5",
               "name": "Wolfgang Kieling",
               "profile_path": "/7kkIf5WtM3ickLQglG9PoqeWn2e.jpg",
               "id": 26517,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gustav Lindt",
               "gender": 2,
               "credit_id": "52fe4422c3a36847f80842f9",
               "name": "Ludwig Donath",
               "profile_path": "/eJ91hF6spm3hYihu9TOTiwpHB9W.jpg",
               "id": 34405,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dr. Koska",
               "gender": 0,
               "credit_id": "52fe4422c3a36847f80842fd",
               "name": "Gisela Fischer",
               "profile_path": null,
               "id": 38100,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Karl Manfred",
               "gender": 0,
               "credit_id": "52fe4422c3a36847f8084301",
               "name": "Günter Strack",
               "profile_path": "/42nppsAL5ItJ3HSxctIehhTsehD.jpg",
               "id": 26349,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Farmer",
               "gender": 2,
               "credit_id": "52fe4422c3a36847f8084305",
               "name": "Mort Mills",
               "profile_path": "/1KmPkFX992nBkDBPzg5QoWB8v4K.jpg",
               "id": 45525,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Farmer's Wife",
               "gender": 1,
               "credit_id": "52fe4422c3a36847f8084309",
               "name": "Carolyn Conwell",
               "profile_path": null,
               "id": 45526,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f80842dd",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f808430f",
               "name": "Brian Moore",
               "profile_path": null,
               "id": 47113,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f8084315",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f808431b",
               "name": "John Addison",
               "profile_path": "/1i8eIwpaKeu4nM1m4MLn7xtlGt5.jpg",
               "id": 14930,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f8084321",
               "name": "John F. Warren",
               "profile_path": null,
               "id": 47114,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4422c3a36847f8084327",
               "name": "Bud Hoffman",
               "profile_path": null,
               "id": 47115,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f808432d",
               "name": "Willis Hall",
               "profile_path": null,
               "id": 111334,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4422c3a36847f8084333",
               "name": "Keith Waterhouse",
               "profile_path": null,
               "id": 111335,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "598f62ce92514167590175da",
               "name": "Hein Heckroth",
               "profile_path": null,
               "id": 1314532,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "598f62d892514167590175ea",
               "name": "Frank Arrigo",
               "profile_path": null,
               "id": 161975,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "598f62e9c3a36874a3017d9e",
               "name": "George Milo",
               "profile_path": null,
               "id": 6934,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "598f630192514167660179b6",
               "name": "William Russell",
               "profile_path": null,
               "id": 7309,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "598f630f92514167390173c4",
               "name": "Waldon O. Watson",
               "profile_path": null,
               "id": 7310,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.379064,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 5780,
      "vote_count": 155,
      "budget": 3000000,
      "overview": "An American scientist publicly defects to East Germany as part of a cloak and dagger mission to find the solution for a formula resin and then figuring out a plan to escape back to the West.",
      "similar": [
         34388,
         582,
         1669,
         341013,
         1247,
         2502,
         27576,
         7451,
         2253,
         104,
         1830,
         956,
         296098,
         49517,
         700,
         1374,
         9352,
         10386,
         203801,
         613
      ],
      "original_title": "Torn Curtain",
      "runtime": 128,
      "poster_path": "/pwiU7euYflFMaUbatvX3La0YgtO.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Norsk",
            "iso_639_1": "no"
         },
         {
            "name": "svenska",
            "iso_639_1": "sv"
         }
      ],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1966-07-13",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "It tears you apart with suspense!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alfred Hitchcock"],
      "runtime": 126,
      "synopsis": "On a cruise ship en route to Copenhagen, Michael Armstrong (Paul Newman), an esteemed American physicist and rocket scientist, is to attend a scientific conference. Once there, he begins acting suspiciously, eventually flying to East Berlin, where he is welcomed by representatives of the East German government. His assistant and fiancée, Sarah Sherman (Julie Andrews), follows him there, believing he has defected to the other side. Sherman, however, is extremely uncomfortable with this move, realizing if the apparent defection is in fact real, given the circumstances of the Cold War of the period, she would likely never see her home or family again. They are constantly accompanied by Professor Karl Manfred (Günter Strack), who took part in arranging Armstrong's defection to the East. It soon becomes apparent (to the viewer) that Armstrong's defection is in fact a ruse to gain the confidence of the East German scientific establishment, in order to learn just how much their chief scientist Gustav Lindt (Ludwig Donath) and by extension, the Soviet Union, knows about anti-missile systems. Armstrong has made preparations to return to the West. These plans are threatened, along with the entire escape network, known as \"Pi\", when he is followed to the isolated farm home of his contact by Hermann Gromek (Wolfgang Kieling), an East German security officer assigned to keep an eye him. When Gromek confronts Armstrong about the existence of \"Pi\" and of his real intentions, a violent struggle ensues within the farmhouse as Armstrong realizes he must kill Gromek to keep his charade up. Gromek is stabbed, beaten with a shovel, and eventually scumbes after being shoved into a gas oven stove. Armstrong leaves while the body is buried by the \"farmer\" (Mort Mills) and his wife (Carolyn Conwell). The taxi cab driver (Peter Lorre Jr.) who drove Armstrong to the farm, however, reports Armstrong's suspicious behavior to the police. The next day, Armstrong visits the physics faculty of Karl Marx University in Leipzig, where his loyalty is suspected because of the missing Gromek. The faculty try to interrogate his fiancée/assistant about her knowledge of the American \"Gamma Five\" anti-missile program, but she refuses to cooperate and runs from the room. At this point, Armstrong secretly confides to her his actual motives, and asks her to go along with the ruse. He finally goads Professor Lindt into revealing his anti-missile equations in a fit of pique over what Lindt believes are Armstrong's mathematical mistakes. When Lindt hears over the university's loudspeaker system that Armstrong and his fiancée are being sought for questioning by the police over the disappearance of Gromek, he realizes that he has given up his secrets while learning nothing in return. Armstrong must make a harrowing escape, along with Sherman, with the help of the university clinic physician Dr. Koska (Gisela Fischer). Michael Armstrong and Sarah Sherman travel to East Berlin, pursued by the Stasi, in a bus operated by the Pi escape network, led by Mr. Jacobi (David Opatoshu). Roadblocks, highway robbery by Soviet army deserters, and bunching with the real bus increase the suspense. The couple escape from the bus and they have a run-in on the street with the exiled Polish countess Kuchinska (Lila Kedrova) who befriends them and agrees to help the two fugitives escape by telling them about a ship which will take them out of the country which belongs to a traveling troupe at a local theater. Michael and Sarah go to the theater where a ballet show is playing, but they are spotted by the lead ballerina (Tamara Toumanova) who calls the police. (At the beginning of the movie, she flew to East Berlin on the same airplane as Armstrong, and mistakenly believed the press were there to greet her, rather than Armstrong.) When Armstrong sees the police moving into arrest him right inside the theater, he creates a diversion by yelling \"fire\" and a panic ensues. The couple escapes through the crowded theater and hide in a crate of props belonging to a traveling Czech troupe. The troupe travels by land to a dock and to a freighter that travels across the Baltic Sea to Sweden. The Russian ballerina suspects something and she makes a mistake in uncovering where Armstrong and Sherman are hiding on the ship. She orders her Soviet guards to fire on the two crates where the couple are hiding, but the wrong crates are fired on when already dangling over the pier, and Armstrong and Sherman are able to escape by jumping overboard and swimming to a Swedish dock and are free at last.",
      "writers": ["Brian Moore"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061107/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwMDA0OTg1NV5BMl5BanBnXkFtZTcwNTA2NTEwNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paul Newman, Julie Andrews, Lila Kedrova | See full cast and crew »"],
      "reviews": [
         "Hitchcock made a few clunkers in his day, but this isn't one of them, despite its reputation. I don't know if I could get away with saying it's one of Hitchcock's ten best features, but I found it to be easily one of his top ten most entertaining. I enjoyed watching Torn Curtain a lot more than some of his established classics, like Notorious and the Birds, even if it's not quite as psychologically complex as those films. The main thing about Torn Curtain is the photography. It's full of pretty pictures--one of the most beautifully filmed of all Hitchcock's films, with lots bold swaths of primary colors and attractive and constantly changing locations--some scenes look like they were shot on location, while others are wonderfully artificial studio creations, and they're blended together perfectly. Another cool thing about Torn Curtain is that it's constantly on the move. It never stagnates. The pacing is deliberate, but engaging. It's well-plotted and suspenseful. It's full of fantastic little directorial touches, like the scene where Paul Newman ducks into a bathroom to read his secret spy message. Hitchcock never shows us the room. He keeps the camera tight on Paul Newman, so we can't tell who or what might be in that room with us, just out of frame. It's totally simple, but it creates a highly effective feeling of uneasiness and paranoia. This movie also features one of the strangest and best-filmed death scenes I've ever seen. Hitchcock was still on top of his game here. Most of the bad reviews for Torn Curtain seem to focus on the acting. I don't know why. A lot of people bash Julie Andrews just for being Julie Andrews, and that hardly seems fair. Typecasting sucks. And while I wouldn't say she turned in one of the most memorable and overpowering performances of all time, her role didn't call for that. Torn Curtain wasn't a complex character study, it was a plot-based thriller. And Julie Andrews was perfectly adequate for that, even pretty good when she was given a chance to be. Paul Newman was perfect. He wasn't his usual charming self here. He was grim and tight-lipped and stiff--as would be appropriate for a scientist feeling out of his league, playing a spy in a hostile country, having to pretend to be a traitor--a role which he found objectionable--all with his girlfriend annoyingly tagging along and complicating everything. I understand that Paul Newman found working for Hitchcock objectionable. It makes me wonder if Hitch deliberately made life unpleasant for Paul just to get this kind of tooth-gritting performance from him. Whatever, Hitch and Paul were both great. And so was this film.",
         "The first time I watched \"Torn Curtain,\" I grew bored and turned it off before it was over. I've watched it in its entirety more than once since then. It's difficult not to conclude that the master director's age was beginning to take its toll by 1966. It could have been a great film except for some major flaws. First, the main characters. Newman and Andrews look distinctly ill-at-ease and their acting is wooden. There is very nearly no chemistry between them, and viewers are not really drawn into their somewhat implausible situation. Both actors are compelling in other films, but for some reason not in this one. Second, Hitchcock would have done better to keep his villains' identity less specific. In \"The Lady Vanishes\", \"The Thirty-nine Steps,\" and \"North by Northwest,\" the identity of the foreign agents is left deliberately vague and thus little plausibility need be attached to their actions. Here they are East German communists, of which we know rather a lot. Third, there are inconsistencies in the plot. At one point Newman and Andrews are forced to go out into an open space to avoid being overheard. But in another scene a pro-western spy communicates confidential information to Newman in a hospital room, seemingly oblivious to the possibility of wiretaps. Finally, there's John Addison's score, which seems to have been written quite independently of the film's action. A suspenseful scene is inappropriately matched with cheerful, melodic music. Everyone knows, of course, that Hitch's longtime musical collaborator, Bernard Herrmann, wrote a mostly complete score for the film, but the two had a falling out on the set and Herrmann was dismissed. Another example of poor judgement on Hitchcock's part. Herrmann's score would have immeasurably improved a mediocre film. (Look at \"Obsession\" nearly a decade later.) With all the recent film restorations, I would love to see someone redo \"Torn Curtain\" and put in as much of Herrmann's score as the composer was able to finish. (But perhaps there would be copyright problems.) Had Herrmann's score been used, the murder sequence in the farmhouse might have become as famous as the shower scene in \"Psycho.\" As I was watching the protagonists flee through the East German landscape in their efforts to reach the west, I found myself thinking that, if they had only waited another twenty-three years, the wall would have come down anyway and they could simply have walked out! That's how much their plight gripped me.",
         "In Hitchcock's \"Torn Curtain,\" Newman plays an American nuclear scientist who pretends to defect to East Germany, so that he can trick a scientist into revealing a missile formula\u0085 His bewildered, abandoned fiancée (Julie Andrews) follows to see what he's up to\u0085 Not wishing to involve her, he lets her think he's a traitor, but when her confusion jeopardizes his position, he tells her the truth\u0085 Overjoyed, she helps him, and they end up in a series of chases and escapes\u0085 Newman does come across as unemotional, or at least not very warm; in fact, critics complained that he was too intense and gloomy in a part that they thought required humor\u0085 But coldness and seriousness are actually essential to the character and to Hitchcock's conception\u0085 Initially, we are supposed to share Andrews' alienation from him\u0085 Later, when we learn that he's not a traitor, we may want to view him differently, but immediately afterward he commits a gruesome killing, of a most likable villain, which again distances us from him\u0085 From that point, even though he's apparently the \"hero,\" his actions are never purely motivated\u0085 His attitude toward Andrews is indicative: by following him, she endangers herself, which concerns him slightly, but she also endangers the mission, which is what really troubles him\u0085 Hitchcock, therefore, is portraying an anti-hero\u0097not a glamorous spy, patriotically following his country's orders, or an innocent, sympathetic victim (Cary Grant in \"North by Northwest\"), but a man on his own, deliberately pursuing a selfish goal (the formula might get him back his job). Newman is therefore well-cast: his indifferent rejection of the woman, his ruthlessness, his willingness to endanger lives and engender chaos, are familiar aspects of the Newman image\u0085 Here, since there isn't the balance of charm, humor or self-realization, he is non-involving\u0085 The \"neutral\" emotion may serve Hitchcock's plan, but it leaves the audience out in the cold\u0085",
         "If MARNIE was the Director's first out-right failure in more ways than one -- it didn't make money, it was reviled by critics who failed to read into the story, and tensions between he and Tippi Hedren came to a standstill -- TORN CURTAIN didn't help. The story of a double agent and his involvement on both side of the political wall was too convoluted and too unfocused to create any real tension, any suspense, and according to accounts, Hitchcock became totally uninterested with the product. So did I on viewing this. The introductory setup is good. Michael Armstrong (Paul Newman) defects to East Germany and his girlfriend (Julie Andrews) follows. There he meets Gromek (Wolfgang Kieling) who has been sent to do away with him. Their encounter leads to one of the most excruciating murder sequences committed to celluloid, and this is by far the best part of the movie. From there on, the plot meanders and it's as if Hitchcock had decided to go on autopilot and let matters resolve themselves, most notably in a lousy theatre sequence in which Armstrong, in an escape sequence, yells \"Fire!\" into a room full of non-English speakers. That it could have been better is obvious, but I believe Hitchcock had succumbed to the times and was in his short Cold War transition in which some of his technique shows but his choice of actors and story fails. Newman and Andrews have zero chemistry together and Andrews at times doesn't seem to know why the hell she's in this movie anyway. Lila Kedrova sticks out as a sore thumb -- why would a countess of all people be panhandling for American sponsors when her diplomatic status would have her able to come to the US with no problem? A complete distraction. Snippets of the theatre sequence are interesting, as when ballerina Tamara Toumanova whirls around in dance and spots Newmann hiding among the crowd: in photographic freeze-frames she pinpoints him out. Other than that this is a fairly routine effort, like the many routine efforts directors sometimes do when they're either in an unsettled period or want to buy themselves out of their contract with a studio. Hitchcock would do one more Cold War themed film, the disastrous TOPAZ, before returning to almost full form (and his English roots) in FRENZY.",
         "This hardly ever appears in the lists of the master's best films, but it is a real gem - superbly acted, inventively filmed with great music, dialogue and plot. Julie Andrews and Paul Newman work really well together - a very sexy scene early in the film is a delight, filmed in extreme close-up. And Lila Kedrova's cameo is Oscar worthy. This is also a memorable look at the Cold War at its height, and although the pro-West propaganda is a little thick at times, there is still a sense of the absurdity of the situation. And there is a murder scene of unbelievable savagery that really left me shaken - excellent work here from Newman and Carolyn Conwell. The most memorable scene is the bus pursuit sequence, and the theatre audience turning into an hysterical mob when Newman yells \"fire\" is a great Hitchcock moment. One of his best cameo appearances too. I think this film deserves re-examination.",
         "Paul Newman nuclear physicist has volunteered for an unusual espionage mission. He's to fake a defection in order to get close to East German scientist Ludwig Donath and find out what advances he personally has given the Soviet bloc. As he says to agent Mort Mills, he's one of the few people in the world who would know exactly what to look for. The trick is to make Donath write it down. Nice plan, except for that fact that intrepid Julie Andrews, Newman's fiancé suspects something's up and follows him first to Copenhagen and then East Berlin. It would have run so much easier without her, but then again there would have been no film. This was Alfred Hitchcock's last star vehicle. His last three films were done with second rank players. At the time this was made Julie Andrews was fresh from Mary Poppins and had all kinds of roles offered her. I suppose she couldn't turn down a chance to appear in a Hitchcock film, but she and Newman really have no chemistry at all. I suppose Newman also wanted to work with Hitchcock. There are some good moments in Torn Curtain. The highlight easily has to be the killing of an East German security agent by Newman and Carolyn Conwell with the creative use of a gas stove. The agent is played by German actor Wolfgang Kieling and has the best role in the film. Funny how during World War II, Germans were sometimes shown as colossally stupid, Kieling is not. He's a very tough and shrewd adversary who catches on to Newman's scheme and has to be eliminated. Hitchcock also stole from himself here. The ride and Newman and Andrews take on a bus from Leipzig to East Berlin that is stage managed by David Opatoshu is ripped off from Saboteur and the bus passengers are just like the circus people in Saboteur. Good, but done before. Devoted fans of the stars and of Alfred Hitchcock will want to see Torn Curtain, others might want to for curiosity's sake.",
         "Between \"The Birds\" and \"Frenzy\" Hitchcock made three consecutive critical and box office failures: \"Marnie (1964), \"Torn Curtain\" (1966), and \"Topaz\" (1969). It's natural to want to rehabilitate one or other of these, and most fans and critics, following (of course) François Truffaut, pick \"Marnie\". But the real hidden gem is \"Torn Curtain\". People have found all manner of trivial things to complain about. The leads, it is said, aren't Hitchcock leads. Julie Andrews certainly isn't: unlike most of Hitchcock's American actresses, she imbues her character with warmth and good sense, qualities that may well be out of place in other films - certainly they'd be out of place in \"Marnie\" - but which are needed here. And Paul Newman is as convincing and sympathetic a Hitchcock hero as any other. ANY other, including my personal favourite, Robert Donat. It's hard not to like Jimmy Stewart and Cary Grant, but (this cannot be denied) for some reason they're never at their best in Hitchcock films. Paul Newman is. Then there's the score - everyone has to take turns sinking their boots into the musical score. Yes, it's not by Bernard Herrmann. Yes, Bernard Herrmann was unceremoniously dumped from the project. Yes, Bernard Herrmann was one of Hollywood's best composers. Yes, if his score had been used instead (not that I've heard it), it would probably have changed the character of the film. For the best? That's hard to say. There's more than one musical personality capable of complementing a Hitchcock film, and if you ask me Miklós Rózsa (\"Spellbound\") and John Williams (\"Family Plot\"), writing very differently, do just as well as Herrmann would have with similar material. John Addison's score for \"Torn Curtain\" isn't quite as good, but it's pleasant, and it casts a warm glow over chilly grey surroundings, just as the photography does. And everyone admits the photography is wonderful - Technicolor greys and beiges, with flashes of red. Hitchcock had never been quite this good with colour before. (And no wonder. I just noticed this in the credits: the production designer was the Hein Heckroth - in fact, it was his last film. His first was \"The Red Shoes\".) Moreover it's one of Hitchcock's better stories. A man is sent to a foreign country on a mission he finds distasteful; his girlfriend follows him, suspicious about what he's planning to do; they must escape together. It's one of those stories where we can happily follow one party or the other without feeling cheated out of the other storyline. It was Hitchcock's first stab at the \"distasteful mission\" theme since \"The Secret Agent\" (1936), which was a failure - not BECAUSE the hero's mission was distasteful to us, but simply because it wasn't a good film in other regards. Hitchcock was wrong to think that when a character does dirty things we'll cease to like him. There's such a thing as moral sympathy: the compromising moral position into which Michael is pushed makes us care about him all the more. I'll never understand critical consensus about Hitchcock. When he takes one of his successful British films (\"The 39 Steps\"), one that can hardly be improved upon, and makes a pale imitation of it (\"North by Northwest\"), critics and audiences cheer. When he takes one of his weaker and more muddled British films and turns it into gold, nobody, not even Hitchcock himself, has a kind word to say. I don't get it. \"Torn Curtain\" has two fantastic scenes as good as anything Hitchcock ever did (the fight with Gromek, the consultation with the East German scientist) and one of his best bit-part characters (the older middle-aged woman who wants to migrate to America). And there's nothing - NOTHING - wrong with the rest of it.",
         "Too bad Hitchcock had to create this film in 1966. The spy vs. spy craze was at its height with super-spy James Bond played by ebullient Sean Connery at the top of the movie ladder. Dozens of Cold War espionage thrillers were marketed that year. Even non-spy films touched on espionage from time to time. Adding to the spy mill in 1966 were several espionage television series including the classic spy spoof show \"Get Smart,\" created by the comedic giants Mel Brooks and Buck Henry. So to most movie goers of the day \"Torn Curtain\" was just another film capitalizing on the spy vs. spy trend. \"Torn Curtain,\" however, is one of Hitchcock's best with two scenes that are among his most intense, the almost endless killing of communist agent Hermann Gromek, played with skill by Wolfgang Kieling, and the bus getaway that will keep you on the edge of your seat. The crying fire in a crowded theater is exciting but predictable--the viewer is just waiting for Professor Michael Armstrong (Paul Newman) to jump from his seat and yell. Lovely Julie Andrews has a juicy role as Dr. Sarah Louise Sherman, the soon to be Mrs. Armstrong if the good professor doesn't run away and leave her. When my wife watched this movie for the first time, she asked in a surprising tone of voice, \"Is that really Paul Newman and Julie Andrews together?\" This unlikely combination works. It works better than the movies Newman made with his wife, Joanne Woodward. The role of Dr. Sherman is also somewhat unique in that she is unwittingly involved in espionage without her knowledge, following her fiancée to Communist East Germany without knowing that he is on an extremely dangerous assignment which only a nuclear scientist can carry out. Hitchcock's film making was beginning to taper off in the twilight of his years. But the masterful hand was still orchestrating film techniques highly original and creative. Lesser directors would have used just anyone to play the small but significant part of the prima donna Countess Kuchinska. Instead Hitchcock searched and found just the right person with the right face and attitude for the role. Lila Kedrova was chosen because she could actually sing opera and because her face and mannerisms stand out in a crowd. In her first appearance when she is getting off the plane, she becomes agitated because Professor Armstrong is receiving all the attention from the press. Hitchcock zooms the camera in for a closeup of her face with its distinctive features. It's well over an hour later that Countess Kuchinska reappears. This reappearance is crucial for the development of the film. Because of Hitchcock's methods, the viewer automatically recognizes the Countess, instantly remembering that she had been upset with Professor Armstrong because of all the attention taken away from her and showered on the professor. She definitely has an ax to grind. Though it has not received much attention compared with many other Hitchcock films, \"Torn Curtain\" is among his best and should be savored by all. Even though political conditions have flip flopped since 1966 and there is no longer a communist East Germany, this Cold War delicacy is worth a bite. Oh, and watch the somewhat hidden ironic humor at the beginning where there's a room full of top scientists during the Cold War and the heat doesn't work.",
         "... have 'know' idea what they're talking about. It may not be Hitch's best movie, but 'watch at your own risk' is an utterly ridiculous appraisal of this movie. But yes, when discussing a Hitch movie, all the normal conventions of movie analysis fly straight out of the window; now it's time to take out the REALLY big magnifying glass. The nitpicking borders on the outrageous. The story is actually quite enjoyable, no more implausible than that of many of his other films, and contains the usual Hitchcockian set pieces and camera work. Whats not to love? Ya, Newman doesnt exactly carry around Jack Nicholson-like expressiveness; there may have been better actors up to the task, and the Old Woman scene feels strange and out of place not to mention over-acted, but even these cant bring the movie as a whole down. Seems like for years this film has the unlucky honor of being the scapegoat in the Hitchcock stable...unfortuanate, really. If you haven't already, see it for yourself, you wont be disappointed",
         "During Cold War a professor named Michael Armstrong(Paul Newman stars as a stoic and subdued scientific)and his fiancée/secretary named Sarah(an enticing Julie Andrews) find in a Sweden science congress. But the espionage embroils the couple in escape and murder.The scientific poses as a defector at Berlin in order to discover details of the soviet missile program by professor Lindt, located in Leipzig. Once again the protagonists get an information that comes across something what place them in jeopardy and winds up being chased all over the country. Then happens a violent grisly killing, filmed on an exciting and nail-bitingly images , proving how difficult it actually is to murder someone. The duo is being pursued by the communists and they go a bus guided by a resistance fighter(David Opatoshu). Newman apparently defecting to East Germany but the secret police are soon on his tracks, the couple go on the run and encounter a refugee Polish countess(an extravagant Lila Kedrova) who helps them. They attempt to escape the freedom , hiding into a costume baggage of a Czech ballet company but they're denounced by a ballerina(Tamara Toumanova). Tense/suspense/mystery abounds in this thriller from Hithcock who combines the elements of spy-genre with romance, drama and pursuits. Newman as a scientist pretending to be a defector, in one of his best performances , Julie Andrews as his fiancée whose tidy life is disrupted when she uncovers what Newman is a traitor. The first part is based on Julie Andrews's point of sight and after under point of Paul Newman. By time the film and acting received negative reviews , today is better considered. Colorful cinematography by John Warren, habitual cameraman from the 'Hour of Alfred Hitchock' and suspenseful musical score by John Addison. However I miss the Hitch's customary, the musician Bernard Herrmann and photographer Robert Burks. As usual ,Hitch's ordinary cameo, this time as a man in hotel lobby with baby. This good thriller by the master himself, who preys on the senses and keeps the suspense at feverish pitch.Hitchcock tells that inspiration about this movie resulted to be the disappearance of two English diplomats , Burguess and McLean, who left their country and defected to Russia. The movie is directed among ¨Marnie(64)¨and ¨Topaz(69)¨his worst movie, later Hitch directed ¨Frenzi¨ and ¨Family Plot¨ his last film. Rating : Better than average, worthwhile seeing thanks some Hitch's touches."
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "Professor Michael Armstrong is heading to Stockholm to attend a physics conference accompanied by his assistant-fiancée Sarah Sherman. Once arrived however, Michael informs her that he may be staying for awhile and she should return home. She follows him and realizes he's actually heading to East Germany, behind the Iron Curtain. She follows him there and is shocked when he announces that he's defecting to the East after the US government canceled his research project. In fact, Michael is there to obtain information from a renowned East German scientist. Once the information is obtained, he and Sarah now have to make their way back to the West.",
         "U.S. rocket scientist Michael Armstrong and his assistant/fiancée Sarah Sherman are attending a convention in Copenhagen. Michael is acting very suspiciously and Sarah follows him to East Germany when he apparently tries to defect to the other side.",
         "American scientist Michael Armstrong defects to Eastern Europe, followed by his reluctant fiancée Sarah Sherman. It's no surprise to learn that the defection is not genuine, and that his real mission is to steal a secret mathematical formula from a professor in Leipzig.",
         "While traveling by ship to a convention in Copenhagen, the reluctant Professor Michael Armstrong is pressed by his fiancée and assistant, Sarah Sherman, to discuss a possible schedule to their marriage. Later in the Hotel D' Angleterre, Sarah sees Armstrong receiving a plane ticket and he explains that he needs to go to Stockholm. However, the snoopy Sarah discovers that he is indeed flying to East Berlin with Professor Karl Manfred who is also attending the convention, so she decides to follow him.",
         "An American scientist publicly defects to East Germany as part of a cloak and dagger mission to find the solution for a formula resin and then figuring out a plan to escape back to the West."
      ],
      "budget": 6000000
   },
   "movielensId": 2180,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Norsk",
         "svenska"
      ],
      "releaseDate": "1966-07-13",
      "dvdReleaseDate": "2001-03-06",
      "directors": ["Alfred Hitchcock"],
      "runtime": 128,
      "movieId": 2180,
      "title": "Torn Curtain",
      "mpaa": "PG",
      "actors": [
         "Paul Newman",
         "Julie Andrews",
         "Lila Kedrova",
         "Hansjörg Felmy",
         "Tamara Toumanova",
         "Wolfgang Kieling",
         "Ludwig Donath",
         "Gisela Fischer",
         "Günter Strack",
         "Mort Mills",
         "Carolyn Conwell"
      ],
      "imdbMovieId": "0061107",
      "originalTitle": "Torn Curtain",
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "Hh11S0CHZ0k",
         "z2TlfRvNh8M"
      ],
      "plotSummary": "An American scientist publicly defects to East Germany as part of a cloak and dagger mission to find the solution for a formula resin and then figuring out a plan to escape back to the West.",
      "tmdbMovieId": 5780,
      "avgRating": 3.33076,
      "releaseYear": "1966",
      "numRatings": 647,
      "posterPath": "/pwiU7euYflFMaUbatvX3La0YgtO.jpg"
   }
}