{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "falsely accused",
            "id": 769
         },
         {
            "name": "lover",
            "id": 4320
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0042994",
      "video": false,
      "title": "Stage Fright",
      "recommendations": [
         30159,
         22527,
         31667,
         2370,
         31995,
         5780,
         4175,
         12684,
         573,
         11462,
         42597,
         31997,
         4174,
         2761,
         13321,
         26268,
         24197,
         21734,
         11219,
         940
      ],
      "backdrop_path": "/97G8umelca6lGI0ZqhlkqUIV21F.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Charlotte Inwood",
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803e9f7",
               "name": "Marlene Dietrich",
               "profile_path": "/eZFuvNCV0kkI9MHFKxTKYegAfIK.jpg",
               "id": 2896,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Eve Gill",
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803e9fb",
               "name": "Jane Wyman",
               "profile_path": "/nw2qjwNEEJvhJbgqSu9DmqBGY0W.jpg",
               "id": 20391,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Det. Insp. Wilfried 'Ordinary' Smith",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803e9ff",
               "name": "Michael Wilding",
               "profile_path": "/xZ2EIXq0pAW2tbgIhVdBi1l1uUm.jpg",
               "id": 20392,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jonathan Cooper",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea03",
               "name": "Richard Todd",
               "profile_path": "/asmQq1hLKEHiBQdQvvO4jXzfrNg.jpg",
               "id": 20393,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Commodore Gill",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea07",
               "name": "Alastair Sim",
               "profile_path": "/iAvHebiFHYIAJqDQWqLTB4NKvPo.jpg",
               "id": 20394,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Mrs. Gill",
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803ea3b",
               "name": "Sybil Thorndike",
               "profile_path": "/a32kzcTI7WMuo8WJBXwZt6962dt.jpg",
               "id": 20399,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Inspector Byard",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea3f",
               "name": "André Morell",
               "profile_path": "/3YpAUiuLp9ZXL67W99W2XYdJ3se.jpg",
               "id": 10029,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Nellie Goode",
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803ea43",
               "name": "Kay Walsh",
               "profile_path": "/4CmjZwzMKyAXgjxb7w12jt8Osgv.jpg",
               "id": 67615,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mr. Fortesque",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea47",
               "name": "Miles Malleson",
               "profile_path": "/5Zbh2FzelrTvyGAFfY2Mdeoi7Ps.jpg",
               "id": 47395,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Freddie Williams",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea4b",
               "name": "Hector MacGregor",
               "profile_path": null,
               "id": 1091865,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "'Lovely Ducks'",
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803ea4f",
               "name": "Joyce Grenfell",
               "profile_path": "/dpQNl9kHUrEyGywvARq0jYn8G05.jpg",
               "id": 80995,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Chubby Bannister",
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803ea53",
               "name": "Patricia Hitchcock",
               "profile_path": "/v4oJhzOA6HBnOScWAHiyoutjY1M.jpg",
               "id": 12500,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Sergeant Mellish",
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea57",
               "name": "Ballard Berkeley",
               "profile_path": "/pgZImT3EPy6hb8tuO4xGBoyHysa.jpg",
               "id": 129033,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Inspector Loomis (uncredited)",
               "gender": 0,
               "credit_id": "56b767c69251413c01005b70",
               "name": "John Harvey",
               "profile_path": "/2HDwZtlvwS9iSpgEFKqLSoj9nPb.jpg",
               "id": 1573982,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea0d",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea13",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4328c3a36847f803ea19",
               "name": "Selwyn Jepson",
               "profile_path": null,
               "id": 20395,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4328c3a36847f803ea1f",
               "name": "Leighton Lucas",
               "profile_path": null,
               "id": 20396,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea25",
               "name": "Wilkie Cooper",
               "profile_path": null,
               "id": 20397,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea2b",
               "name": "Robert Lennard",
               "profile_path": null,
               "id": 13320,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe4328c3a36847f803ea31",
               "name": "Terence Verity",
               "profile_path": null,
               "id": 20398,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4328c3a36847f803ea37",
               "name": "Harold V. King",
               "profile_path": null,
               "id": 7390,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4328c3a36847f803ea5d",
               "name": "Whitfield Cook",
               "profile_path": null,
               "id": 12492,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea63",
               "name": "James Bridie",
               "profile_path": null,
               "id": 131230,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe4328c3a36847f803ea69",
               "name": "Ranald MacDougall",
               "profile_path": null,
               "id": 31843,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4328c3a36847f803ea6f",
               "name": "Edward B. Jarvis",
               "profile_path": null,
               "id": 592418,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4328c3a36847f803ea75",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 5.67446,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 1978,
      "vote_count": 77,
      "budget": 0,
      "overview": "A struggling actress tries to help a friend prove his innocence when he's accused of murdering the husband of a high society entertainer.",
      "similar": [
         708,
         646,
         657,
         667,
         699,
         253,
         668,
         682,
         714,
         691,
         634,
         658,
         954,
         707,
         710,
         116,
         146216,
         259693,
         843,
         210479
      ],
      "original_title": "Stage Fright",
      "runtime": 110,
      "poster_path": "/1W7RzrENooOXQVeYMlF8Vx3EpAk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1950-02-23",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Love held its breath as sudden terror held the stage!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 110,
      "synopsis": "Eve Gill (Jane Wyman), an aspiring actress studying at RADA, is interrupted in the middle of a rehearsal by her friend, actor Jonathan Cooper (Richard Todd). The frantic Jonathan explains that he is the secret lover of flamboyant stage actress/singer, Charlotte Inwood (Marlene Dietrich). He claims that Charlotte visited him after killing her husband in an argument. She was wearing a bloodstained dress and Jonathan agreed to go back to her house and obtain another one. He found the body of Mr. Inwood at the residence, took a spare dress from the wardrobe and then tried to simulate a burglary gone wrong, only to be caught in the act by Charlotte's theatre maid and dresser, Nellie Goode (Kay Walsh). He is now on the run, wanted by the police. Eve has long had a crush on Jonathan, but accepts that he is not interested in her romantically. She takes him to hide in a house near the coast owned by her father, Commodore Gill (Alastair Sim). Persuaded to help, the Commodore then notices that the blood on Charlotte's dress has been smeared on deliberately, not by accident, and he and Eve suspect that Jonathan has been framed. He angrily rejects this, destroying the dress and thus the best evidence they have on Charlotte. Eve decides to investigate for herself. Posing as a reporter, she bribes Nellie Goode to pretend that she is ill and cannot work for Charlotte for a while. Eve then utilises her acting skills to affect the false identity and accent of a Cockney maid, claiming to be Nellie's cousin, \"Doris Tinsdale\", and takes the temporary job of replacing \"her cousin\" in order to infiltrate Charlotte's household. In the course of trying to clear Jonathan, Eve meets Detective Inspector Wilfred Smith (Michael Wilding). As Eve, she and Smith get quite friendly and she has to go to great lengths to cover the fact that she is also \"Doris\" the maid when Smith visits Charlotte to ask further questions. As Eve, she is not able to get much from him on the progress of the investigation. Out to court Eve, Smith visits her and her mother at their home in London. They are joined by the Commodore who drops subtle hints to Eve that Jonathan has left their house by the sea. Meanwhile, in spite of the tragedies that are surrounding her, Charlotte continues to perform at her West End musical show. She is secretly visited by Jonathan who wants her to accompany him abroad and tells her that he still has the dress with the bloodstain. Charlotte makes it clear that she will not give up her career for a hunted fugitive in any case she is secretly having an affair with her manager Freddie Williams (Hector MacGregor). Eve again helps Jonathan escape the police and he hides out at the Gill's London residence. He thanks Eve for her support, but she feels torn since she is starting to fall in love with Wilfred Smith. When Nellie Goode uncovers the deception that is going on, Eve manages to buy her off with blackmail money. With time running out, she persuades Smith to accompany her to a garden party where Charlotte is singing on stage in a large tent. During the performance, Commodore Gill gets a little boy to take a doll wearing a dress stained with blood, Gill's own, up to the stage. The sight causes Charlotte to collapse and Williams summons \"Doris\" for assistance. Seeing Eve attending to Charlotte and the stained doll's dress leads Smith to put two and two together. Smith confronts Eve and the Commodore over their \"amateur meddling\". They persuade him to set Charlotte up into making a confession. Once the theatre has closed for the evening, Eve comes out of character and confronts Charlotte near a hidden microphone Smith and his men listening in to the conversation from the loudspeakers. Charlotte admits her involvement in her husband's death (making her an accessory) but denies committing the murder itself, blaming Jonathan. Eve then sees that Jonathan has been brought to the theatre by the police, Smith having guessed that he was hiding in their house. She falls into hysterics, enabling Jonathan to get away. At this point Smith reveals to the Commodore that Jonathan really did kill Mr. Inwood and that he has actually killed before, though he got off on a plea of self-defence. Hiding below stage, Jonathan confesses to Eve that Charlotte goaded him into killing her husband but actually in order to make way for Freddie Williams. The story he told Eve when she agreed to hide him was all lies. He has a temper that makes him lash out when provoked. When he threatens to kill her as well, Eve escapes and in the confusion that follows Jonathan is decapitated by the stage's safety curtain.",
      "writers": [
         "Whitfield Cook",
         "Alma Reville"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042994/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODk3ODkyNzU2MV5BMl5BanBnXkFtZTcwOTM2MTAyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marlene Dietrich, Jane Wyman, Richard Todd | See full cast and crew »"],
      "reviews": [
         "I had never heard of this movie before and had low expectations. However, I was amazed at what a wonderful movie it is. Not only is it \"Hitchcocky\" and suspenseful, it is also humorous and touching. Jane Wyman and Richard Todd did particularly well in this film. I do not usually like Marlene Dietrich, but I have to admit that she did a splendid job as the flamboyant theater star. This movie is set in London, and Hitchcock did a wonderful job of picking out the crew's British actors and actresses such as Alistair Sim and Michael Wilding. Surprisingly he even gave his own daughter, Patricia Hitchcock, a bit part towards the end. It is too bad \"Stage Fright\" is not more well known, and I highly recommend it.",
         "black comedy that boasts great performances from Jane Wyman, Marlene Dietrich, Michael Wilding, Alistair Sim, Sybil Thorndike, Joyce Grenfell, Kay Walsh & Richard Todd. Great use of silent sequences, close ups, slow motion, black humor, and mood lighting, Hitch's most underrated talkie (Easy Virtue is is most underrated silent film), this murder mystery offers all kinds of plot twists and sly humor even though you know the outcome long before it unspools. It's irrelevent. Fun all the way, including the opening theatre curtain and the closing one (thump). Dietrich is a splendid bitch, and this may be the best performance Wyman ever gave. Also look for Everley Gregg, Patricia Hitchcock, Miles Malleson and Ballard Berkeley. Dietrich's final close up and the coach scene with Wyman and Todd are gems. Sim and Thorndike are hilarious, as is the always wonderful Grenfell as \"Lovely Ducks.\" A Must See.",
         "What a great flick. At times ill-paced, but the performances more than make up for it. What's not to love? Doe-eyed Jane Wyman shifts effortlessly between the roles of aspiring dramatist to lovestruck protectress of Richard Todd to infiltrating false maid of Marlene Dietrich. Managing also to string along Michael Wilding, as the ubercool Inspector \"Ordinary\" Smith, she might sound like some cold calculating wench who uses up people like Marlene goes through hats. But that wouldn't be strictly accurate. Her Eve Gill is sweet and naive, but her gentler qualities are tempered with a genuine acting talent that allows her to juggle identities with the slyness of a fox-chameleon hybrid. The scene at the garden party when she switches from Dietrich's cockney maid to Smith's innocent date with every turn is delightful. It is the masterful presence of the great Alastair Sim, however, that makes Stage Fright one of Hitchock's most enjoyable to watch. Few actors have his ability of making the most average of dialouges sound like a powerful oration, and as Eve's doting father, he makes the movie. His Commodore Gill is always at the ready to harbor a fugitive, clip off a snappy witicism, or scrounge blackmail money for his beloved daughter. He is equally at home playing comic relief as he is to serving as the plot glue that makes Eve's capers possible. But live with his wife? Thank you, no! He is content to live on his boat. Whether he is staging an amusing diversion to aid Eve, dispensing sage bits of fatherly advice, or merely strolling out in public, the man bleeds coolness with every move. Some can argue that Stage Fright gives but an average treatment to the usual whodunnit murder-suspense formula that Hitchcock (and countless others) have used. This is perhaps true. But compared to the whole lot of crappy facsimile suspense films made since 1950, Stage Fright is quicker to entertain than most. Be sure to check it out if you want to see Hitch cast his own daughter Patricia in the supporting role of \"Chubby Banister.\" Is that some kind of sick joke or was that name flattering in the fifties? P.S.-- I can't watch Marlene Dietrich anymore and not be reminded of Madeline Kahn's Teutonic Titwillow. Is there some free therapy I can get for this?",
         "This movie gets a very much undeserved amount of flack for being a lessor work of Hitchcock. I can see why it might not appeal to some people, being character driven rather than having children being chased by rampant birds or someone being attacked by a serial killer in an old lady's wig. The performances here are all excellent especially Jane Wyman and Marlene Dietrich as Charlotte Inwood, perhaps the laziest girl in town but also the most flamboyant. The secondary characters are also in fine form and make memorable impressions that adds to the enjoyment factor of this film. I don't know why some people feel tricked after watching the movie, seeing and believing are two different things, especially in an Alfred Hitchcock movie!",
         "Often considered to be one of Alfred Hitchcock's lesser known films, \"Stage Fright\" has unfortunately gotten a bad wrap. Even mediocre Hitchcock is better than most movies ever get, though. And this one is a solid, entertaining picture. With an eclectic cast one doesn't expect to see together, each diverse actor provides a little something for everyone. And with Jane Wyman, Marlene Dietrich, Richard Todd and Michael Wilding how can you go wrong? Wyman convincingly plays a drama student who gets involved over her head in a purely Hitchcockian case of murder. When her ex-lover Todd is suspected of killing Dietrich's husband, Wyman hides him and helps him allude the police. Meanwhile, Wyman disguises herself as Dietrich's maid to help find evidence to save Todd's freedom. Wyman falls into a dangerous trap, and danger surrounds her. Disappointingly underdeveloped as it starts, \"Stage Fright\" eventually turns into a first-rate thriller. While Wyman has been better, Dietrich is hilariously catty and Todd is wickedly suspicious. This is undoubtedly a Hitchcock film all the way around, but adding a nice twist to the formula is a soaring, romantic soundtrack. A seriously satisfying film, \"Stage Fright\" hits most of the right notes.",
         "I like this film. It has gotten a bad reputation due to Hitchcock's daring to break another film convention about the truth of a flashback. Hitchcock had already broken other conventions over the years, some being of a technical variety (the nine minute uncut takes on ROPE for instance). Here the film begins with Richard Todd describing what he claims happened to the murdered man to ex-girl friend Jane Wyman. Subsequently we learn that the explanation is not totally true. What I find interesting about this particular issue is that the same people who denounce Hitchcock for cheating on this probably have found other films acceptable despite similar \"cheating\". Take Billy Wilder's WITNESS FOR THE PROSECUTION. We hear Tyrone Power give Leonard Vole's version of what happened to the rich elderly woman (Norma Varden), about how they met, about what he was doing on the night she was murdered. We do not SEE the actual view of his activities for the night of the murder, but we accept his comments - until the end of the film shows what happened. Also check out Kurasawa's film classic RASHOMON, where we see flashbacks of five people who show \"what happened\" and at the conclusion we really don't know if we heard the truth or if everyone has lied. The same can be said of the American remake of RASHOMON, THE OUTRAGE. Even a musical comedy, LES GIRLS, leaves us all guessing at the end. Yet Hitchcock was condemned for his cheating. I think he should be praised for his daring, for this film (of all Hitchcock's movies) develops in a unique way. Wyman is determined to prove the truth of Richard Todd's story, and keeps meeting criticism and common sense from her father, Alistair Sim, and from the police led by Michael Wilding, who don't believe him. And as a matter of fact, at the conclusion, it turns out that some, if not all of Todd's flashback has elements of truth in it. Hitchcock told Francois Truffaud that he saw STAGE FRIGHT as an opportunity to work with some great British character actors (Sim, Joyce Grenville, Sybil Thorndyke, Kay Walsh). The film was definitely lower budgeted than other films (SPELLBOUND, even THE PARADINE CASE) that he had recently made. The most expensive aspect was working with Dietrich which was costly for her salary and her designer clothing. But Hitchcock wanted a chance to work with Dietrich here (just like he had made MR. AND MRS. SMITH to work with Carole Lombard in 1939). The results were quite good. The British character actors did the most with their parts (including Todd, who shows a nervousness and uncertainty in most of the film that is suggestive of possible insanity at the end). Dietrich also, in her closing moments on the screen, shows a bitterness and hatred that I don't think she ever showed in any other film role. Jane Wyman was criticized by Hitchcock for insisting on dressing up as the film progressed. However she does show a resourcefulness and pluck not usually seen in most of her movies. On the whole the film works pretty well to me.",
         "\"Stage Fright\" has become one of my favourite Hitchcock movies. Even though it's not in the same league as \"Psycho\" or \"Rear Window\", it's still an extremely delightful piece of film making. What makes it so enjoyable is the wonderful cast, which was mostly unknown to me before. Jane Wyman makes a lovely heroine for the audience to care about, and Marlene Dietrich is a riot as the stage diva, although I was a bit skeptical toward her at first. The scenes between Alastair Sim and Sybil Thorndike as Wyman's eccentric parents are hilarious. Richard Todd is perhaps a bit weak as the suspected murderer, but not distractingly so. All in all, I find this a far more preferable watching experience than some of his more acclaimed films like \"Notorious\" or \"The Birds\" which are kind of cold and sterile. See it if you have the chance.",
         "SPOILERS: Like any good film enthusiast, I consider Hitchcock one of the best directors who ever lived, right along with the likes of Fellini, Bergman, and Welles. Hitch consistently made films that were not only as entertaining as a film can possibly get, but also films that were extraordinarily intellectual and human. Films such as Lifeboat, Rear Window, and Vertigo work as art as much as any other films ever made, studying the human condition and utilizing the tools of cinema to the utmost. Hitch was also the most prolific film artist of all time. He made over 50 films. He made more masterpieces than any other filmmaker, too. Several, such as Vertigo, Psycho, and Rear Window, are bona fide masterpieces. No one in their right mind would disagree with their status as some of the best films ever made. But everyone has that one Hitchcock film that they feel that they understand better than anyone else, and always claim that it deserves to belong in the same status as the more accepted masterpieces. I seem to have discovered several. In fact, every time I see one of his less popular films, I think that it has gotten a bum rap. Rope is my favorite underrated Hitchcock film, but I think that it is starting to be accepted by the masses more. Two other great ones that are less popular are Lifeboat and I Confess; Lifeboat is well respected by Hitchcock fanatics, but I Confess is usually dismissed. This sort of dismissal happens because of financial failure upon first release. Hitch certainly was an artist, but, if you've read the Truffaut interview book, you realize that he took a film's financial success or failure very personally. Now we come to Stage Fright. I don't think that it was an enormous failure, but it was also not an enormous success. Truffaut says something like: \"this film neither added to nor took away from your reputation.\" The main complaint is that the opening flashback is a lie, and that audiences could never accept that. I think that that technique works better now than it may have in 1950. It was sort of daring, but it failed at the time. Although most people still don't want to ever think that the characters in a film are lying, you still see it, especially in neo-noir (think Chinatown, Body Heat, etc, although those aren't flashbacks, per se). Truffaut also derides it for being a whodunit, which Hitch did not like. I don't think that Stage Fright is at all a whodunit. We assume through the entire film that Marlene Dietrich is unquestionably guilty in the crime. There are just a few very minor problems in the film, most of them stemming from the trick ending: trick endings are in style right now, but they hardly ever work. This one does, mostly, but as soon as we realize we've been tricked, just as happens at the end of The Sixth Sense, a very good film otherwise, we begin to go over the earlier events to see if there was any cheating. There is in Stage Fright, and it loses a tiny bit of credibility from this. The other main problem is just how the police deal with the criminals at the end. It's hardly believable, and they kill the main criminal in a very gruesome way that I would think would get them reprimanded by their superiors (although it was cool). Anyway, it's nowhere near as bad as the way the police act at the end of Hitch's next film, Strangers on a Train, where a cop shoots randomly at a crowd (with the criminal in it) and accidentally kills an innocent man! The gold of this film comes in the complex situations and characters. One reason why Hitch's films stand so far beyond the run-of-the-mill thriller is that his characters are so well developed. The actors in Stage Fright are also superb. Jane Wyman, the main character, has an extraordinarily complicated role, where she has to act at several different levels (she plays an actress who believes that her skills can help her learn more about a murder); she pretends that she's someone else, and as she meets more people, the more difficult it becomes to handle the situation. She also \"switches horses in midstream,\" where she begins to doubt her relationship with the man whom she is helping and to fall for a detective on the murder case simultaneously. Richard Todd plays a man framed for murder. One excellent twist in the script is that his character is not intelligent. We're so used to characters being as astute as Sherlock Holmes in mystery films, but he's an illogical hothead who takes very stupid risks. Marlene Dietrich has a lot of fun here playing a demon-goddess. She's just hilarious, trying really hard to act depressed over her husband's death (and she's one of the most terrible singers you'll ever hear!). I love how she controls everyone in the film, even those who are trying to be her enemies. You just can't refuse Marlene! Possibly the most memorable and amusing performance in the film is that of Alastair Sim, most famous for playing Ebenezer Scrooge a year later. He's hilarious as Wyman's father. Micheal Wilding, playing the detective who is falling for Wyman, is also great, especially when he finds that she is betraying him and may have only been using him. There are a few very memorable cameos, too, including the \"bibulous gent,\" a turtle-like man who offers Wyman comfort, and the shooting gallery matron (the whole shooting gallery scene is great). Stage Fright has been trampled by the more outstanding Hitchcock pictures. It is a small gem, not boring in any way. It deserves to be rediscovered by more people.",
         "This superb film incredibly contains Marlene Dietrich and Alistair Sim among its great cast, in a blend of Hitchcock thrills and chills, humour and even musical interludes. It is mostly overlooked due to it's original 'failure' with fans and critics caused mainly by misguided hatred of a plot device used in the film. Also people fail to cope with the very different moods the film moves between. From whimsical British comedy to chilling psychological drama. It may not be one of Hitchcock's perfect 10/10 best but is easily 9 1/2 out of 10. Hitchcock did something in the film, as he did in his classic Sabotage, which upset filmgoers and critics because it was 'not the done thing'. I wouldn't wish to spoil the film for a 1st time viewer by saying what this was but it is mentioned in the spoilers section of trivia on this films IMDb homepage. It is a mistake, I feel to overlook this film, especially due to this 'unconventional plot device'. I find the 'unconventional plot device' in Sabotage one of a great many highlights of the film and it lifts it beyond what it would have been with the predictable/conventional resolution of that scene. The same is true in Stage Fright. Filmgoers who cannot cope with being confused by clever directorial choices are people I pity. The surprising, unusual aspects of this plot are terrific and Hitchcock was entirely correct in his choices which hugely add to the impact of the film. Apart from all that Stage Fright is simply thoroughly entertaining. It is very very funny with Alistair Sim as brilliant and hilarious as ever in a great role for him as well as an entirely satisfying cast. Marlene Dietrich is superbly cold in a wonderful, striking addition to her acting career and sings a classic Dietrich style song. The twists from humour to chilling suspense make terrific enthralling moments. A highly unusual and near perfectly executed film.",
         "With such an unusual set of components, it was probably inevitable that \"Stage Fright\" would be a little uneven, but most of it works well enough. By Hitchcock's standards, it's average at best, but it is still an entertaining movie with an interesting story and a number of good sequences. Simply seeing the distinctive persona of Marlene Dietrich and the enjoyably unique style of Alastair Sim in an Alfred Hitchcock film would make for an interesting combination in itself. They are joined by a generally solid group of performers, with their own individual styles, and there are several characters who all get fairly sizable roles. Hitchcock's own approach here is a somewhat surprising contrast from his usual style of story-telling, and some of the developments must have seemed even more unexpected to the movie's original viewers. Another aspect of this is that for much of the movie none of the characters really takes and holds the focus, and as a result there are times when it seems to lack some flow. Yet there are a number of good points to it as well. There are plenty of the usual Hitchcock details that make things more interesting, and most of the cast members give good performances in themselves. Most of Hitchcock's movies are rather better than this one, but watching \"Stage Fright\" is still a better use of one's time than watching the weak present-day efforts in the genre."
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "Jonathan Cooper is wanted by the police who suspect him of killing his lover's husband. His friend Eve Gill offers to hide him and Jonathan explains to her that his lover, actress Charlotte Inwood is the real murderer. Eve decides to investigate for herself, but when she meets the detective in charge of the case, she starts to fall in love.",
         "Eve Gill, an aspiring young actress, shelters a fellow acting student, Jonathan Cooper, from the police. He is suspected of murdering the husband of his mistress, Charlotte Inwood, a famous singer. Jonathan claims that he became implicated when he tried to help Charlotte destroy the evidence. Eve's eccentric father, Commodore Gill, agrees to hide Jonathan in his house while she proves his innocence. To do this, Eve becomes Charlotte's temporary maid. Eve's Father devises a plan to force Charlotte to confess in front of the inspector investigating the case, Wilfred Smith. When the plan doesn't work, Eve tries blackmailing Charlotte into a confession while the police listen outside her dressing room. Charlotte agrees to pay, but insists that Jonathan is the real killer.",
         "In London, the aspirant actress Eve Gill and her friend Jonathan Cooper are fleeing from the police in her car to her father's boat two hours far from the city. Eve has a crush on Jonathan that tells her that a couple of hours later, his mistress and actress Charlotte Inwood had come to his apartment with her dress covered of gore and telling that she had killed her husband. Jonathan decided to go to her apartment to bring a new dress for Charlotte, but her maid saw him in the crime scene and called the police that are chasing him as prime suspect. Eve's father Commodore Gill lodges Jonathan at his house and the man destroys the dress that is the evidence of the murder. Eve decides to investigate by herself to prove Jonathan's innocence and gets closer to Charlotte, working as temporary maid. Meanwhile Detective Wilfred Smith that is in charge of the case befriends Eve and they fall in love for each.",
         "Hoping that she will help hide him, Jonathan Cooper confides in his friend Eve Gill, a novice acting student at the Royal Academy of Dramatic Arts in London, that he is helping famed stage actress Charlotte Inwood, with who he is in love, cover up her accidental killing of her husband. Jonathan believes he is in trouble because Charlotte, who was wearing a blood stained dress, asked Jonathan to retrieve a clean dress for her at her supposedly empty house where he suspects he was spotted by the maid, Nellie Goode, just prior to Nellie finding the dead body. Eve agrees to help Jonathan since she is in love with him, and who she believes is being framed by Charlotte. Charlotte's blood stained dress, which she asked Jonathan to destroy but which he still has in his possession, is a key piece of evidence in implicating Charlotte. When the police get involved, Eve tries to find out as much as she can from the lead investigator, Detective Inspector Wilfred Smith - who she ends up calling Ordinary Smith on his request - without divulging her connection to Jonathan. With her equally sleuthing father Commodore Gill behind her, Eve, trying to demonstrate her acting skills, also infiltrates the Inwood household acting as Charlotte's temporary plain housemaid and dresser. These dual roles becomes difficult for Eve to manage, especially in keeping them separated from Ordinary as he continues his investigation, and from Charlotte. In the process, Eve, who still wants to protect her friend Jonathan, ends up falling in love with Ordinary. But as those concerned get closer and closer to discovering the truth behind Inwood's death with Charlotte's blood stained dress a key item in trying to expose the killer, Eve, without realizing it, becomes a possible second target for the murderer.",
         "A struggling actress tries to help a friend prove his innocence when he's accused of murdering the husband of a high society entertainer."
      ],
      "budget": 0
   },
   "movielensId": 2187,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-02-23",
      "dvdReleaseDate": "2004-09-07",
      "directors": ["Alfred Hitchcock"],
      "runtime": 110,
      "movieId": 2187,
      "title": "Stage Fright",
      "mpaa": "",
      "actors": [
         "Marlene Dietrich",
         "Jane Wyman",
         "Michael Wilding",
         "Richard Todd",
         "Alastair Sim",
         "Sybil Thorndike",
         "André Morell",
         "Kay Walsh",
         "Miles Malleson",
         "Hector MacGregor",
         "Joyce Grenfell",
         "Patricia Hitchcock",
         "Ballard Berkeley",
         "John Harvey"
      ],
      "imdbMovieId": "0042994",
      "originalTitle": "Stage Fright",
      "genres": ["Thriller"],
      "youtubeTrailerIds": ["dAQPzF1mphs"],
      "plotSummary": "A struggling actress tries to help a friend prove his innocence when he's accused of murdering the husband of a high society entertainer.",
      "tmdbMovieId": 1978,
      "avgRating": 3.52341,
      "releaseYear": "1950",
      "numRatings": 299,
      "posterPath": "/1W7RzrENooOXQVeYMlF8Vx3EpAk.jpg"
   }
}