{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119346",
      "video": false,
      "title": "I Married a Strange Person!",
      "recommendations": [
         69342,
         41313,
         89750,
         31502,
         16137,
         24979,
         47658,
         228692,
         35848,
         46991,
         21769
      ],
      "backdrop_path": "/jtjQIgnzerUD5V1gGe7YkCdGNjo.jpg",
      "revenue": 203,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Keri Boyer",
               "gender": 0,
               "credit_id": "52fe480ec3a36847f8155feb",
               "name": "Charis Michelsen",
               "profile_path": null,
               "id": 44905,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Grant Boyer",
               "gender": 0,
               "credit_id": "52fe480ec3a36847f8155fef",
               "name": "Tom Larson",
               "profile_path": null,
               "id": 1277319,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Larson P. Giles",
               "gender": 0,
               "credit_id": "52fe480ec3a36847f8155ff3",
               "name": "Richard Spore",
               "profile_path": null,
               "id": 171396,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe480ec3a36847f8155fe1",
               "name": "Bill Plympton",
               "profile_path": "/5wXN99sV4flkrgruQnseuASt9FM.jpg",
               "id": 126125,
               "department": "Crew",
               "job": "Creator"
            },
            {
               "gender": 0,
               "credit_id": "52fe480ec3a36847f8155fe7",
               "name": "Bill Plympton",
               "profile_path": "/5wXN99sV4flkrgruQnseuASt9FM.jpg",
               "id": 126125,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Animation",
            "id": 16
         }
      ],
      "popularity": 1.302788,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 51942,
      "vote_count": 13,
      "budget": 250,
      "overview": "A newlywed develops a strange lump on his neck that gives him the ability to transform people or objects at will. His wife is very upset. Meanwhile, the CEO of Smilecorp learns of this man and his ability and sees a way to achieve world domination if only the man can be taken alive. Animated movie by Bill Plympton.",
      "similar": [],
      "original_title": "I Married a Strange Person!",
      "runtime": 72,
      "poster_path": "/bnDHATLb13mAPn5XvdTMcK8QdRn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Bill Plympton Studios",
         "id": 41680,
         "origin_country": ""
      }],
      "release_date": "1998-08-28",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bill Plympton"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Bill Plympton",
         "P.C. Vey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119346/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NDIyODgxNF5BMl5BanBnXkFtZTcwMjU3NTc0MQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Charis Michelsen, Tom Larson, Richard Spore | See full cast and crew »"],
      "reviews": [
         "I feel sorry for the people that said they were bored during this movie and that was the only thing they had to say about it. This movie was a wonderful fantasy in which Plympton used the animated media to its highest potential. This movie does have something to offend just about everyone, from extreme profanity, extreme violence, to bizarre (but funny) sex scenes to quoting Hermann Goring?? The bird sex scene in the opening probably did a good job offending most of the population and let you know there was a really raunchy good time ahead; the facial expressions were great! Another great part to look for is when one character watches the \"How To Make Love To A Woman\" video. There was one segment I rewound the tape three times and STILL couldn't hear what was said because I was laughing SO HARD! WONderful movie and such an improvement over \"The Tune\".",
         "I've been a fan of Bill Plympton's ever since first seeing his Oscar-nominated short \"Your Face\" about 12 years ago as part of the traveling International Tournee of Animation. Plympton started out as a magazine cartoonist (an early version of \"How to Kiss\" was published in \"Rolling Stone\" in the early 80's), and his early short films were based around single gags or concepts. On the basis of these shorts I knew Plympton's animation was kind of primitive, that he had excellent timing, and that he had a flair for metamorphosis and the grotesque that recalled such distinguished predecessors as Otto Messmer and Tex Avery. Unfortunately, I found Plympton's first feature, \"The Tune\", rather disappointing. The story was weak, and the best parts were the shorts that were incorporated into the feature (\"Wiseman\", \"Push Comes to Shove\"). With this in mind, I approached \"I Married a Strange Person\" with some trepidation. I'd heard some good things about it, and it was such a shock to find it for rent here in Tulsa that I snatched it up right away. It turned out to be a pleasant surprise, so much so that I had a hard time figuring out just what I liked about the movie. All the usual virtues of Plympton's animation are there, and the story starts out nicely enough-a new bridegroom gets zapped in an accident involving a satellite dish and a pair of over-amorous birds, giving him strange and wondrous powers. What made the story work at first were the appealing characters set within it, the new husband Grant and wife Kerry. Most of the time their actions and reactions were very believable, whether the situation was realistic (the sexual tension between the newlyweds at the beginning-she's in the mood for love, he feels he's got to work overtime to support them) or fantastic (Kerry's alarm, and later anger, when Grant's stray imaginings begin coming to spectacular life). The quality of the animation and design helped, giving depth and texture to Plympton's characteristic style without making it unnecessarily slick. Tom Larson and Charis Michelsen, who voiced Grant and Kerry respectively, deserve considerable credit as well. Maureen McElheron's songs don't hurt either; where much of \"The Tune\" seemed to be an excuse for the songs, here the songs served the story by setting the mood. I especially liked \"Honey How'd You Get So Cute\", which (along with Plympton's animation) effectively captured some of the playfully absurd aspects of eroticism. Unfortunately, the quirky romantic fantasy at the beginning gets shunted aside when an unscrupulous media mogul learns about Grant's new powers and sends a paramilitary squad to capture him. This plot device reminds me of Disney's old comic fantasies-not the animated ones, the live-action ones, the ones with Fred MacMurray or Dean Jones or Kurt Russell as the hero and usually Keenan Wynn as the villain and they also had sentient-or-flying cars or teenaged computers-or-sheepdogs or stuff that bounced higher than the height from which it was dropped. Actually, I dug those films when I was a kid, and I bet Bill Plympton liked them too, but he does little to vary their formula when he applies it here, apart from dollops of sex and violence and a bit of satire. The plot also threatens to derail the characterizations that were established so well in the first part. Simply, all scenes where the characters' actions follow from their previous behavior work; when a scene doesn't work, it's usually because a character's integrity has been violated for the sake of a gag or the convenience of the plot. I don't know if this means Plympton and/or his collaborator P. C. Vey are still learning how to maintain a story at feature-length, or if they just couldn't resist their impulses to go for quick and dirty laughs, or both. Nonetheless, despite its flawed or hackneyed aspects, \"I Married a Strange Person\" is very watchable as a whole film. It is also evidence that Plympton and company have a really great film in them somewhere. Let's hope they put it all together next time.",
         "Yes, there are a few dull parts. I will admit that. However, there are also parts that will make you wish you had gone to the bathroom a few minutes ago, before you started laughing so hard that your bladder's about to burst. And then you start thinking about you bladder bursting. And just what it would look like. And you laugh harder. Then you want to go home and check what's really in the back of those wall sockets... Good movie. Not the greatest in the world, but very good. Jason",
         "I've been a fan of Bill Plympton since I first saw one of his shorts in a late-80s animation festival, and to me, \"I Married a Strange Person!\" is his best work. It's possible that I've missed something better -- I've seen many/most of his shorts, but only one other of his long-form works, \"The Tune\". This film, to me, is much funnier and more memorable than \"The Tune\", though not as deep, I suppose. Fans of the \"splatstick\" horror/comedy genre should enjoy this film, as it uses over-the-top gore to similar comedic effect. Don't get the impression that this is a film in the vein of \"Lupo The Butcher\" or something, though, with ultra-violence being used for ultra-violence's sake. Plympton's imagination is FAR too vivid for that to be the case. I'd have to say, in fact, that Plympton has the most unique and active imagination of any visual artist I'm familiar with, and this film is a great showcase for it, since the plot concerns a special brain lobe that causes imagination to become reality. Apart from the comedic gore, there are hilarious looks at sex. What Plympton has done for quitting smoking and other topics in his shorts, he does here for sex. Everything from people to animals to inanimate objects are seen engaging in the act here, to comic effect. One of the most imaginative images is the upper receptacle in an electrical outlet banging the lower receptacle from behind (with the three-prong receptacles having become faces). Another thing to mention is the film's great score. Funny, catchy, toe-tapping tunes that you'll feel like you've heard somewhere before. To sum up, buy this film! If you're at all a fan of animation or semi-risque comedy, you're sure to love it.",
         "I caught this movie by accident at 2am and found it highly entertaining. It dashes from one scene to the next at a rate of knots. The animation is good and it is very refreshing to see an adult oriented cartoon despite the bizarre nature of the story. I'll be watching out for more by Bill Plympton in the future.",
         "I've always found Plympton's animations intriguing (and at times a bit disgusting, but I mean that in the nicest possible way). I agree with other reviewers on this page that Plympton's style may not be too well-suited for a full-length movie, as I was quite bored at regular intervals. However, if you're into his style and sense of humour (which means that you don't mind gratuitous violence and sex scenes) you should get a kick out of this one. I found myself laughing out loud a couple of times (for instance, at the sex/balloon animals scene), and any movie that makes you do that deserves a pat on the back :).",
         "After newlywed businessman Grant Boyer is electrocuted by his satelite dish, he develops a strange lump on the back of his neck that gives him the power to bring his crazy thoughts and fantasies into reality. Of course, since this is a Plympton film, you can safely assume that this is merely an excuse to load the movie with lots of blood, sex, talking animals, bulging eyeballs, and more detached limbs than you can count. While extremely imaginative, well-animated, and generally fun to watch, the film runs its course within the first half-hour or so. Plympton is an amazing artist, but his art is best viewed in short-film form.",
         "I find Bill Plympton's animation on MTV to be interesting. Having said that, I think this theatrical release proves that his work is best limited to the short format. Numerous times during the screening, I found myself looking at my watch and marvelling that only five more minutes had passed since the last time I looked. The jerky animation had only a little to do with it; it was just simply not all that interesting as a whole. Not bad, but definitely not all that good either.",
         "This film was one of the best surreal films I actually enjoyed in a long time, great WILD style, love the way he animates the faces to its very creepy but awesome at the same time, I enjoyed the first half better than the last half though. It seems like an hour and ten mins is very short but like other people said the pacing is a bit over the top I found, the first half kept me purley entertained and never got bored once, but then the last half it felt like there were almost no breaks, it was just a wild rollar coaster until the end which was just as amazing and unique as the first half but its not as powerful because its just so much to take in so fast, it should of had bigger breaks towards the end, one other minor thing irradiated me was how they shoot at the woman and husband at the end point blank range for like 5 minutes and they just dodge them all, I know its not taken seriously but that just felt so dragged out and took away from the overall ending experience. But thats just the negative, go watch this film IT IS AMAZING its like nothing I have ever seen before, best words to describe it.... Fantasia on speed and acid.",
         "'I Married a Strange Person' is (I think) Bill Plympton's second full-length animated film (is that right? I'm not sure), and does not disappoint for a minute. Like 'The Tune', 'I Married a Strange Person' is a completely original animation film, done in Plympton's completely unique style, and is extremely visually inventive and creative. It's also incredibly funny, and creates some wonderful, hilarious characters. Even for Plympton, it's unusually twisted and bizarre, full of sex and violence at their most hilarious. Also some brilliant musical segments with songs by Plympton's old collaborator Maureen McElheron ('I'm happy, you're happy, everybody's happy...') So, for Plympton fans, and any fan of adult animation or underground cinema, this film is highly recommended. Still, to be fair, a few words of caution: 'I Married a Strange Person' is extremely hard-core, with very explicit (though hilarious) scenes of sex and violence. There is, in fact, one (funny and inventive) sex scene that lasts over five minutes. The plot, also, makes very little sense, and the movie often seems to be weirdness and sickness for weirdness' and sickness' sake. If that doesn't bother you, buy it, by all means. If you have a sense of humor and are not easily offended, 'I Married a Strange Person' will be a pleasure. If you're a Plympton fan, don't even think twice - this is one of his best works. If you're not familiar with his work, by all means familiarize yourself."
      ],
      "genres": [
         "Animation",
         "Comedy",
         "Drama",
         "Fantasy",
         "Sci-Fi"
      ],
      "productionCompanies": ["Italtoons Corporation"],
      "summaries": [
         "A newlywed develops a strange lump on his neck that gives him the ability to transform people or objects at will. His wife is very upset. Meanwhile, the CEO of Smilecorp learns of this man and his ability and sees a way to achieve world domination if only the man can be taken alive.",
         "When Grant Boyer's satellite TV dish is hit by two birds in mid-coitus, just days before his own wedding, he gains a special secret power. His imagination is no longer something that just goes on in his head - whatever he imagines actually happens in real life. Sexual fantasies, daydreams, flashes of random weirdness, they all come true, brought into being by a strange nodule at the back of his neck, the base of his brain. At first Grant's problems are domestic: his wife Keri is upset by the change that has come over him. During sex he fantasises about her as a nun, turns her breasts into balloon animals and imagines he's making love to three of her simultaneously, so she goes to live with her parents. After an ill-fated television appearance, SmileCorp, the fourth-biggest US television network plots to steal Grant's nodule for their own benefit. Chaos and musical numbers abound when Keri returns to help save the day."
      ],
      "budget": 250000
   },
   "movielensId": 2189,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-28",
      "dvdReleaseDate": "2000-04-28",
      "directors": ["Bill Plympton"],
      "runtime": 72,
      "movieId": 2189,
      "title": "I Married a Strange Person!",
      "mpaa": "",
      "actors": [
         "Charis Michelsen",
         "Tom Larson",
         "Richard Spore"
      ],
      "imdbMovieId": "0119346",
      "originalTitle": "I Married a Strange Person!",
      "genres": [
         "Drama",
         "Comedy",
         "Animation"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A newlywed develops a strange lump on his neck that gives him the ability to transform people or objects at will. His wife is very upset. Meanwhile, the CEO of Smilecorp learns of this man and his ability and sees a way to achieve world domination if only the man can be taken alive. Animated movie by Bill Plympton.",
      "tmdbMovieId": 51942,
      "avgRating": 3.46482,
      "releaseYear": "1998",
      "numRatings": 199,
      "posterPath": "/y0AVFqJEk5FGk31TL7HDWficCE5.jpg"
   }
}