{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "mississippi",
         "id": 787
      }],
      "imdb_id": "tt0112757",
      "video": false,
      "title": "The Cure",
      "recommendations": [
         17355,
         45179,
         244123,
         79783,
         38225,
         35645,
         49345,
         8895,
         19855,
         66469,
         19581,
         47939,
         5248,
         43079,
         86913,
         2348,
         308650,
         57012,
         31142,
         327175
      ],
      "backdrop_path": "/sYjYPTdteJYNNlRumjHxNVfCOzC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Erik",
               "gender": 2,
               "credit_id": "52fe4464c3a36847f8093569",
               "name": "Brad Renfro",
               "profile_path": "/t97fjAtDrBHTv9ABwwwHDzdKtpo.jpg",
               "id": 51214,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Dexter",
               "gender": 2,
               "credit_id": "52fe4464c3a36847f80935a7",
               "name": "Joseph Mazzello",
               "profile_path": "/zsBGvymDqB737PerJTqhS9dPuBd.jpg",
               "id": 4787,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe4464c3a36847f8093579",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Pony",
               "gender": 2,
               "credit_id": "52fe4464c3a36847f8093571",
               "name": "Nicky Katt",
               "profile_path": "/dbAeUQXzyf2HDFYtifWkHfE3SNW.jpg",
               "id": 18070,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Gail",
               "gender": 1,
               "credit_id": "52fe4464c3a36847f8093575",
               "name": "Diana Scarwid",
               "profile_path": "/1Z11dGfpfJygcL0r3CYLFREEU8l.jpg",
               "id": 2958,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Tyler",
               "gender": 2,
               "credit_id": "52fe4464c3a36847f809356d",
               "name": "Aeryk Egan",
               "profile_path": null,
               "id": 51215,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Male Nurse",
               "gender": 2,
               "credit_id": "59681551c3a36879cb00b737",
               "name": "Peter Moore",
               "profile_path": "/p4ai2SvW0XUDa2rfkOyDKcNf1Au.jpg",
               "id": 1255228,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4464c3a36847f809357f",
               "name": "Peter Horton",
               "profile_path": "/uq9ry9LRU2yn63LigCQFkB07CCY.jpg",
               "id": 44990,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4464c3a36847f8093585",
               "name": "Robert Kuhn",
               "profile_path": null,
               "id": 51216,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4464c3a36847f809358b",
               "name": "Mark Burg",
               "profile_path": null,
               "id": 2145,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4464c3a36847f8093591",
               "name": "Eric Eisner",
               "profile_path": null,
               "id": 52309,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4464c3a36847f8093597",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4464c3a36847f809359d",
               "name": "Andrew Dintenfass",
               "profile_path": null,
               "id": 52310,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4464c3a36847f80935a3",
               "name": "Anthony Sherin",
               "profile_path": null,
               "id": 52311,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.771757,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6715,
      "vote_count": 74,
      "budget": 0,
      "overview": "Dexter, age 11, who has AIDS, and his next door neighbor Eric, a little older and much bigger, become best friends. Eric also becomes closer to Dexter's mother than to his own, who is neglectful and bigoted and violently forbids their friendship upon learning of it. Dexter and Erik start the journey to find \"The Cure\" they had read about in the local newspaper.",
      "similar": [
         261,
         134,
         873,
         2024,
         1813,
         770,
         497,
         50014,
         1541,
         9359,
         1645,
         1633,
         109491,
         220,
         414425,
         1586,
         1951,
         961,
         7874,
         1632
      ],
      "original_title": "The Cure",
      "runtime": 97,
      "poster_path": "/keUrRrUsmALR7kOTSdrOIDcO67z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Island World",
            "id": 1595,
            "origin_country": ""
         }
      ],
      "release_date": "1995-04-21",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "The best cure for a disease is friendship",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Horton"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Robert Kuhn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112757/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTcyMDM2NjkzOF5BMl5BanBnXkFtZTcwNzg0MDcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Joseph Mazzello, Brad Renfro, Aeryk Egan | See full cast and crew »"],
      "reviews": [
         "The Cure is an outstanding real-life drama that deals with a very sensitive subject. It is the story of the profound and dear friendship between two boys, Eric and Dexter. The latter has acquired AIDS from a blood transfusion. Thus he and his mom (Annabella Sciorra) have become outcasts, shunned by the public and labeled as dangerous company, basically due to a common lack of public knowledge of the disease. When Eric (Brad Renfro, known from 'The Client' and 'Apt Pupil') and his mom move into the house next to them, he has to deal with public insults and the fear of catching AIDS himself. However, Eric overcomes his fear and risks everything. At first he starts talking to Dexter, but eventually he climbs over the fence and joins the witty boy (played by Jurassic Park's Joseph Mazzello) and his games. Very quickly he develops a real friendship with Dexter, who is delicately built and frail due to his condition. The central theme of the movie \u0096 the theme which makes it pervasively authentic and tragic at the same time \u0096 is how Eric and Dexter try to find the ultimate cure. At first they experiment with all kinds of plants and leaves \u0096 which is very naive, but also genuine at the same time, as it shows how young kids deal with such heinous diseases and how strongly they still believe in the magic of the world. When they hear about an alleged cure which has been developed in the South, they do not hesitate and take off for an adventure that will bring them even closer together and symbolizes the ultimate quest for hope. So they board a raft and head southwards on the Mississippi River. What starts as a real adventure becomes a dangerous undertaking, which is emotionally intriguing and instructive at the same time. The scene when Dexter reveals his fears and talks about the end of the universe, where everything is dark and cold, Eric hands him his sneaker, a symbol that wherever the boy may have to go, Eric is and will always be with him; he will never have to be alone. This sequence, which is one of the most compelling ones of the movie, features a very convincing interaction between the two actors, who manage to avoid awkward and corny dialogs and deliver a very genuine performance that is eventually smashing in its tenderness and honesty. I will not go any further in outlining the plot, as I do not intend to give away too much information. The ending however is emotionally tough and makes the audience so much a part of the tragedy that everyone who watches the movie will feel personally affected. This aspect makes this movie so strong, so outstanding and so convincing. The emotional burden on every character is so real and so thrashing that even the tougher members of the audience might need some hankies. A 10 is doing justice to this movie and is not too high a rating. There is hardly any other movie I have seen in my life so far that handles such an emotional issue with so much wit and sensibility. It is the story of how two boys make each other's life richer and how they teach each other lessons of life. Thus Dexter overcomes his isolation and sadness, and Eric learns what really counts in life; and both of them realize how much of a gift real friendship is when it comes to the hardest moments of life. This movie is tragic \u0096 but its message is sheer inspiration.",
         "For unknown reasons this beautiful masterpiece didn't get well-deserved recognition and has been vastly under-appreciated by many American movie critics. So it's easy to understand that I've met lots of troubles trying to find this movie. Finally I watched it and it was so beautiful, sincere and poignant that for the first time in my life I watched one movie five times in one week after getting the tape. The story is focused on the friendship between two young boys Erik and Dexter, eleven and twelve years old, who are very different from each other but they are becoming the best (and only) friends. The beauty and sincerity of their friendship have been shown in the Cure so sincere and naturally as it has never been before. There are so many beautiful, heartfelt and poignant scenes (particularly on the river), which strike the heart and can't leave any human indifferent to them. The movie also is full of incredibly powerful and emotional symbolism, (particularly strong with Erik's shoe) which also greatly increases visual impression from such beautiful work. The story, written by Robert Kuhn, is well written and on the contrary to overwhelming majority of modern Hollywood's products practically every scene, every phrase and every sentence in the movie is meaningful and bring something important about characters and relations between them. Peter Horton, who as I know had no major experience in movie directing before, showed his great abilities and talents in this sphere. The cinematography is also superb with perfectly selected locations for the movie, but the most important is perfect acting, which with all above mentioned makes The Cure one of the best movies ever. Both Brad Renfro as Erik and Joseph Mazello as Dexter created wonderful atmosphere of sincere friendship and magnificent chemistry between two main characters. Only one this movie (I haven't seen most of their other works) is enough to name them as one of the best actors of their generation. Annabelle Sciorra also give a terrific performance as Dexter's mother. It's terribly sad that such talented actors didn't get wide recognition, while numerous overrated stars enjoy enormous publicity and huge salaries. Finally it would be unfair not to mention amazing soundtrack written by David Grusin, and terrific Mark Cohn's song (one of the best songs that I've ever heard in the movies) My Great Escape. So all that I can say about The Cure is one simple word \u0096 great. At any point of view this movie is a beautiful, heartfelt and inspiring work of all people involved in making of this masterpiece. I have to credit all those people who put their hearts and souls into the movie and Universal Pictures, which among numerous formulaic commercial projects has found a way to make such a beautiful movie. But such movie so rarely come to movie theaters that very often studios themselves don't realize what gem they have made that they're unable to provide respective marketing campaign. The only one minor drawback about The Cure for me is its short length (only 97 minutes). I don't want to write more about the movie because it's simply impossible to put its beauty and sincerity into words, so if you have any opportunity for watching The Cure, rent it or buy it and you wouldn't be disappointed. 10 out of 10. Sorry for my bad English.",
         "This is one of the most touching films I had ever watched. No movie has effected me the way this one did. This is a great film and you have to see for yourself. I'm normally impregnable with these sob story movies but this one did it for me. I was in tears at the end. You'll yearn for the friendship that is portrayed in this movie. If I can give this movie a billion stars I could.",
         "I had seen The Cure when I was a kid and I loved it then. Now, years later, I got a hold of a copy almost by accident, and watched it again. Being a kid, you don't really have the ability to procure things for yourself that you want, that is usually a prerogative of your parents - but when I watched it again now I felt sorry that I did not do more to get a copy of this movie back then, and consequently almost forgot about it until today. This really is a beautiful movie. It tells the story of the unlikely friendship between a hard-edged, misfit kid - who takes his cues from his horrible, abusive mother - and his neighbor, a slightly younger boy who has AIDS. Right, you say. Another one of \"those\". A tear jerker. A bucket movie. A morality tail. Yeah, I know, I hate those too. Only this one isn't. It is one of the very few movies among those many I have seen that pulls off a very rare trick: it conveys a truly sad story (and yes, a morality tale) but without a single moment where it feels cheesy, forced or in any other way \"hollywoody\". It shows a REAL relationship between two REAL boys, who interact as REAL kids do. And through that interaction the good-natured, loving character of the older boy, Eric, starts to shine through his \"tough-guy\" persona, as he takes on a kind of big-brotherly care for Dexter, his HIV-positive younger neighbor. Together, they embark on an adventure to find a cure - which to Erik seems to be just around the corner - so that all this silly AIDS thing will go away and they can be friends forever. The production is top notch. But, of course, what really carries this movie, is the performances of the two leads - Brad Renfro and Joseph Mazzello. Especially Mazzello, who is simply stunning - he does convey a sense of frailty needed for an ailing boy, but at the same time he manages to make Dexter a truly energetic and determined character. He shines at the scene where the boys confront Pony: his impulse to protect his older friend lunges him forth, drives him to say what he says - and only afterwards, the horror is depicted on his face, as he realizes that what he himself said is true: his blood is poison... Renfro also has his moments, in particular the scenes with his mother: he depicts perfectly how this macho, street-wise kid is left completely frozen and numb when faced with his abusive, storming mother, and can't get a word in to contradict her as she forbids his relationship with the ailing boy out of her fear and ignorance. Annabella Sciorra also gives a memorable performance as Dexter's mother, who ultimately becomes, in a sense, a mother figure to Erik as well. I've first seen this film when I was at school back in America, and loved it - not at all a given concerning movies of this sort. But the behavior of the kids in this movie was so real, I could easily relate to them. Ironically enough, the teacher who had shown us this movie (a wonderful woman, I'm still in touch with her) got in trouble for it, as some uptight parent complained about it having the scene when the two boys are looking at a Playboy... Pathetic. Seriously, will Americans ever get over this ridiculous phobia, I do not know. There was a hardly-distinguishable shot of a playboy cover in the movie and thus it is not shown in schools... how sad. Kids need to see this movie. It is more inspiring and educational than all the \"official\" after-school specials put together. Oh, and one more thing. I know I'm rambling, but nevertheless... The score. It's great. I am a musician, and as such I know Dave Grusin from his records: he is a well known Jazz pianist and record producer. Up until this movie I really did not know that he did movie scores as well, even though when I later checked I found out that I had unknowingly watched several movies he worked on. Really, a wonderful job there. All in all, a solid Ten. I'd recommend this movie to anyone. And I'm definitely going to see it with my younger siblings - they can use watching a film like this among all the standard special-effect hysteria they usually see.",
         "Unbelievably close to real life feelings and emotions captured by Joseph Mazzello as a hemophiliac child affected by AIDS and his new young neighbor, a wanna-be tough redneck played to perfection by Brad Renfro. Although the story may seem slightly farfetched (the two boys attempt to river-raft several hundred miles to find a doctor who claims to have the cure to AIDS), the emotion, actions and interactions of all characters involved are tragically close to real life. Being a \"big brother\" to a boy in a similar situation who died a few years after this film was released, I strongly recommend this picture to anyone who has ever wondered what really happens in the life of a child with AIDS. Superb direction by Peter Horton creates the perfect mood and setting for each scene and draws the viewer into the various emotions affected by friendship, illness, prejudice and the final parting of two friends who fought hard to overcome adversity.",
         "The subject of children being terminally ill is difficult and saddening but 'The Cure' successfully portrays the idea that it doesn't have to be all doom and gloom and, if anything, children need to have hope and delight in their lives if they are to find peace before the end. It is also a film of remarkable bonds of friendship and the innocence of childhood. The film sees Erik, a dysfunctional adolescent boy with a distant mother, moving into a new area where their next-door neighbour is eleven-year-old Dexter, who contracted AIDS through a blood transfusion. After his initial fears and ignorance over AIDS are allayed, Erik befriends Dexter and their almost fraternal friendship sees them embark on a journey down the Mississippi to where they have heard about a New Orleans doctor who claims to have found a cure for the disease. The talent from the two young leads of Brad Renfro and Joseph Mazzello, who play Erik and Dexter respectively, is exceptional. Brad was able to portray Erik's harder edge without comprising the subtle childish innocence inherent to the character while Joseph depicts the sense of vulnerability to Dexter's character but injects the right amount of boyish enthusiasm and zeal to highlight that his illness doesn't mean he still isn't a child who wants to run and play like any other eleven-year-old boy. The pair's interactions create a feel in the audience that these are two boys who are genuinely close and they carry the film well. Annabella Sciorra also delivers a touching performance as Dexter's mother Linda, who adores her son and delights in seeing him thrive with this new friendship to Erik and eventually becomes a surrogate mother-figure to the other boy. Set against an excellent soundtrack, 'The Cure' is a very bittersweet film that manages to flawlessly weave the story of boyhood friendship that survives unflinchingly in the midst of prejudice and terminal illness without resorting to sappiness or unnecessary saccharine sweet scenes. A very interesting reflection in the film is that is it the adults who have the problem with Dexter's AIDS status whereas the children, even the 'bullies', come to accept him as they would any other. What is also very touching is how, despite Erik's streetwise nature, he is the more naive one in his determination to cure Dexter while the younger boy has this haunting sense that he knows his fate but is swept away by his best friend's enthusiasm for a cure. I highly recommend 'The Cure' for it is rare to find a film that is simultaneously sad and uplifting.",
         "Very nice movie! I was browsing the channels on my TV and I usually ignore the channels that air drama movies but then I saw this channel that airs old school movies and it is where I saw this movie. At first, when I saw the title \"The Cure\" I thought it's gonna be boring but then I got hooked when I saw Brad Renfro was in this movie (because of one of my favorite movie of all time is \"The Client\" where Brad also stars). Then the scenes was getting better and better. The story is so beautiful and very touching! I cried hard in this movie which I don't usually do. Great casting! and there are so many beautiful lines/quotes in this movie which is very striking and made me cry hard! Now, I bought my own copy on DVD and I always recommend it to everyone!",
         "Way back in 1996, One of the airliner pilots where I used to work gave me a copy of this film. He told me that It'll make me cry. I never believed him and we even made bets. After seeing the film....I cried a bucket! Even after the seeing the film, I found myself in the bathroom crying. It was actually the most touching film I have ever seen. I like the part where Dexter's mom confronted Eric's mother the line went something like... \"your sons' best friend just died today..and it's not gonna be easy...if you ever lay your hands on him again...I will kill you!\" The last part where Dexter took Eric's shoe was a scene that never left my mind until today. Honestly, just thinking about it makes my eyes teary. A story of what true friendship is all about. My girlfriend loved it too... She hated me for letting her see the film. I cried a bucket, she cried a river.",
         "The Cure is a great movie, the only drawback being the short length. The acting is amazing and the direction is great. Joseph Mazzello (Radio Flyer, Shadowlands) and Brad Renfro (The Client) delivered career best (and still best) performances and Annabella Sciorra (Hand that Rocks the Cradle) was good playing Dexter's (Mazzello) mom.",
         "'The Cure' is a touching film about a true friendship. A friendship that exceeds all of the preconceptions. I agree that this is a tale of happiness under tragic circumstances. Plus, it portrays an ignorant side of society. Many believe that AIDS is strictly a \"gay\" disease and transmittable through the air and mock and treat miserably those who have it. This movie can teach us all many lessons and morals. This story is about two unlucky boys with different personalities and some problems in common (both are rejected and unwelcome by society). Erik is, I assume, 12 years old (like Brad Renfro himself back then), an easy target for a bunch of dorks and his mother is a horrible person and ignorant (and so is his unseen grandmother). Erik's neighbor Dexter is 11 (like Joseph Mazzello at the time). Dexter has a loving mother but he is a cursed child. He is very nice and sweet but he got AIDS from a blood transfusion when he was a baby and just because of his illness he is treated by the ignorants as if he was a plague. This is Dexter's drama. Poor Dexter! Erik and Dexter got off to a bad start but Erik quickly learns to like and respect Dexter and they become great friends. Together they live adventures and moments of fun and happiness at the same time they attempt to find a cure to save Dexter. Their friendship has no boundaries and both find out they're braver than they ever imagined, as their courage helps them in sticky situations. Erik gives Dexter a chance to live life as it should be lived. There is a number of heartwarming moments, such as the scene when Erik gives his tennis shoe to Dexter to comfort him and make him feel safer. Another part that gets me every time is the tense sequence when Dexter stabs his hand and says the haunting line «My blood is like poison» and gets far weaker after this bravery act and has to be taken to a hospital. During Dexter's stay at the hospital, there are some fun moments which serve as a perfect comic relief under a tragic circumstance. The boys prank the doctors that Dexter is unconscious in two occasions. Dexter scares the hell out of the doctors and laughs a lot. But in a 3rd attempt to prank them, when Erik asks Dexter «Are you ready for another victim?» and Dexter smiles and nods \"Yes\", the sad irony is that Dexter no longer wakes up. The cure is not found. The nice tyke doesn't make it. The two boys take the movie all by themselves and shine like stars: Brad Renfro as Erik and Joseph Mazzello as Dexter. Brad Renfro was talented and always looked mature for his age. That and the fact that his voice sounded mature for the age made him look some years older than he really was. Shame he did put himself in a bad spot few years after this movie was made and passed away early. Joseph Mazzello always proved to be a fine young actor. He is simply wonderful in this serious role. And he was a very cute kid and had the cutest and most adorable voice, along with Judith Barsi. Annabella Sciorra's acting as Linda also deserves my praise. The soundtrack is worth of my praise too, it sounds so peaceful-minded, fits perfectly in the mood of the film. This movie is a classic, deserves much better luck than it got. Title in Portugal: 'Laços de Amizade'."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Universal Pictures",
         "Island World"
      ],
      "summaries": [
         "Dexter, age 11, who has AIDS, and his next door neighbor Eric, a little older and much bigger, become best friends. Eric also becomes closer to Dexter's mother than to his own, who is neglectful and bigoted and violently forbids their friendship upon learning of it. When they read that a doctor in distant New Orleans claims to have found a cure for AIDS, the boys leave home on their own, planning to float down the Mississippi river and find him.",
         "Dexter has AIDS and becomes friends with Erik, the kid next door. Erik becomes closer to Dexter's mom Linda than his own who is neglectful, bigoted, and violently forbids their friendship. When the boys hear of a doctor in New Orleans who has a cure for AIDS, they leave home and embark on a journey down the Mississippi River and find him.",
         "A boy, aged 11 called Dexter has AIDS and is a good target for being picked on. He and his neighbor, Erik become best friends and start the journey to find \"The Cure\" they had read about in the local newspaper."
      ],
      "budget": 0
   },
   "movielensId": 219,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-21",
      "dvdReleaseDate": "2004-11-23",
      "directors": ["Peter Horton"],
      "runtime": 97,
      "movieId": 219,
      "title": "The Cure",
      "mpaa": "PG-13",
      "actors": [
         "Brad Renfro",
         "Joseph Mazzello",
         "Annabella Sciorra",
         "Nicky Katt",
         "Diana Scarwid",
         "Aeryk Egan",
         "Peter Moore"
      ],
      "imdbMovieId": "0112757",
      "originalTitle": "The Cure",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["sa1tVnGSbXs"],
      "plotSummary": "Dexter, age 11, who has AIDS, and his next door neighbor Eric, a little older and much bigger, become best friends. Eric also becomes closer to Dexter's mother than to his own, who is neglectful and bigoted and violently forbids their friendship upon learning of it. Dexter and Erik start the journey to find \"The Cure\" they had read about in the local newspaper.",
      "tmdbMovieId": 6715,
      "avgRating": 3.60807,
      "releaseYear": "1995",
      "numRatings": 694,
      "posterPath": "/keUrRrUsmALR7kOTSdrOIDcO67z.jpg"
   }
}