{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "poet",
            "id": 5933
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "writer",
            "id": 13028
         }
      ],
      "imdb_id": "tt0119453",
      "video": false,
      "title": "Keep the Aspidistra Flying",
      "recommendations": [],
      "backdrop_path": "/pMpo2lAr2RJj8oezhBZEj9KyC2j.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Rosemary",
               "gender": 1,
               "credit_id": "52fe48aec3a36847f8174157",
               "name": "Helena Bonham Carter",
               "profile_path": "/rHZMwkumoRvhKV5ZvwBONKENAhG.jpg",
               "id": 1283,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Mrs Meakin",
               "gender": 1,
               "credit_id": "52fe48aec3a36847f8174153",
               "name": "Liz Smith",
               "profile_path": "/rFmFjKTl9Drjv7tA687miEyn1tG.jpg",
               "id": 7320,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Erskine",
               "gender": 2,
               "credit_id": "52fe48aec3a36847f817414f",
               "name": "Jim Carter",
               "profile_path": "/ycS14B6YHA2k4IlEPNgh0eQOv7u.jpg",
               "id": 20070,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Gordon Comstock",
               "gender": 2,
               "credit_id": "52fe48aec3a36847f817415b",
               "name": "Richard E. Grant",
               "profile_path": "/jMnSjjPQwCOAJ1kPRXLbh0WnsPa.jpg",
               "id": 20766,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48aec3a36847f817413f",
               "name": "Robert Bierman",
               "profile_path": null,
               "id": 51950,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48aec3a36847f8174145",
               "name": "George Orwell",
               "profile_path": "/uYbVtlVa6KB1wkXqHpderYEptgx.jpg",
               "id": 15870,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe48aec3a36847f817414b",
               "name": "Alan Plater",
               "profile_path": null,
               "id": 126454,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.672866,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 54795,
      "vote_count": 3,
      "budget": 0,
      "overview": "Gordon Comstock is a copywriter at an ad agency, and his girlfriend Rosemary is a designer. Gordon believes he is a genius, a marvelous poet and quits the ad agency, trying to live on his poems, but poverty soon comes to him.",
      "similar": [
         646,
         657,
         667,
         253,
         658,
         668,
         699,
         708,
         714,
         146216,
         634,
         691,
         210479,
         682,
         707,
         259693,
         1581,
         824,
         3933,
         1281
      ],
      "original_title": "Keep the Aspidistra Flying",
      "runtime": 101,
      "poster_path": "/exLDuRDE2Lsh1kgfnhk4lFiBPFD.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
         "name": "BBC Films",
         "id": 288,
         "origin_country": "GB"
      }],
      "release_date": "1997-11-20",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Bierman"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "George Orwell",
         "Alan Plater"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119453/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5OTk2NjE4OF5BMl5BanBnXkFtZTcwNTQ4NDYxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard E. Grant, Helena Bonham Carter, Julian Wadham | See full cast and crew »"],
      "reviews": [
         "In 1930's London, Gordon Comstock (Richard E. Grant) works in the advertising business as a copywriter. His work is so outstanding that he is one of the most valued employees of the firm. Yet Gordon longs to leave the mundane existence of the average worker and become \"a poet and a free man\". When one of his poems sells for a reasonable sum, he quits his job to devote himself to writing. However Gordon's girlfriend, Rosemary, is aghast. She had hopes for an impending marriage and a comfortable, middle-class life. When writing full-time proves difficult, Gordon sinks lower and lower in terms of places of residence and fiscal circumstances. Yet, he stubbornly pursues his dream, leaving Rosemary in a most unhappy state. Will Gordon come to his senses and return to the stable existence of the work force and the good graces of his lady love? This is an absolutely delightful movie that is a joy to watch. The main actors are excellent, the cinematography is outstanding, and the costumes and settings lovely to look upon. The script, based on a George Orwell book, is first-rate and engagingly humorous. There is also a level of sophistication that is as pleasing as it is approachable. Finally, there is a satisfying love story that will please any fans of romantic comedies. In short, this is a movie that should appear on lists of recommended films of the highest level. It is truly worthy of much praise.",
         "George Orwell wrote 'Keep the Aspidistra Flying' based in part on his own experiences as a young writer, with himself as the object of the satire. It may be hard to think of Richard E. Grant as Orwell, but he does an enthusiastic job of bringing the book's hero to life in this adaptation, portraying an immature, but genuine and brave character struggling to establish what is most important in his life. The setting may be 80 years ago, but director never allows his film to wallow in nostalgia, keeping it fresh instead of overplaying superficial differences from our own era (though the final use of a modern song over the final credits grates). What's a bit more disappointing is the complete absence of politics in the story, odd given Orwell's own passionate commitment; the film's conclusion could be summarised as \"if you're middle class, stop worrying and enjoy it\", which is not a sentiment I can imagine Orwell endorsing. A lively but slight film.",
         "I loved this film. It's much more cheerful than the book, but what's wrong with that? Artistic license can be a wonderful thing, and those who wanted it to be 1984 should go and watch 1984. When I watch this, I see Gordon Comstock engaged in a futile battle against his own intrinsic middle-classness. He's a pain at times and the film has endowed the character with more humour than he had in the book, probably so that the viewers understand why his friends don't just leave him to stew. Grant is perfectly cast as Comstock, and keeps him just this side of bearable. Bonham Carter is equally perfect as Rosemary, the long-suffering girlfriend. Add in an excellent supporting cast and there you have it. The soundtrack's beautiful, except for the song at the end which just shouldn't be there. The settings are stunning, as they rightly should be. All in all, it's a perfect, witty film and one I will never tire of.",
         "The British 'heritage film' industry is out of control. There's nothing wrong with filming classic novels, but why must they all be filmed by talentless nobodies? This film rips the guts out of Orwell's tough novel, turning it into a harmless, fluffy romantic comedy. 'Aspidistra' may not be Orwell's best work, but no-one who reads it can forget its superb depiction of poverty. Orwell emphasises not only the cold and the hunger, but the humiliation of being poor. In the novel, London is a bleak, grey, cold, heartless city, and Comstock prays for it to be blasted away by a squadron of bombers. But this film irons out anything that might be in any way disturbing, and creates instead a jolly nostalgic trip to charming 1930s London, in which everything is lit with shafts of golden sunlight, and even the slums of Lambeth are picturesque and filled with freshly scrubbed urchins and happy prostitutes. Comstock's poems about the sharp wind sweeping across the rubbish-strewn streets seem completely out of place in this chocolate-box world. Worst of all is the script's relentless bonhomie, ancient jokes, and clunking dialogue. It's so frustrating because Richard E. Grant is the perfect person to play Gordon Comstock, and the film is packed with great actors. But it's all for nothing. This film made me so angry! Britain's literary history is something to be proud of for its richness, complexity and power. And what do we do with it? We employ bland nobodies to turn it into soft-centred, anodyne pap for people who want to feel that they are 'getting some culture' while they drink their Horlicks and quietly doze off.",
         "If only more films were made with such clever and funny script, lively characters and downplayed irony! Comstock is perfectly embodied by Grant, and it's not hard to participate in his tribulations, as 90% of people have had money troubles and have tried to write a poem at one time or another in their life. I totally disagree with the comments which would like this film to be another Kafka-clone. We've had enough of that!",
         "I went to see the film as I saw parts of it being made. I wanted to see how Woburn Walk could be turned into a road in Hampstead. I liked the film. I wondered why the critics had such a downer on it. Then I read the book and could understand why. Richard E. Grant was not vicious enough as Comstock and somehow the poverty which Orwell depicted in his book has been cleaned up to the point that you just can't see why Comstock was having so much of a problem. Comstock's arrest has been cleaned up too and the ending was all wrong. If the film had been released under another name then it would probably have got a smoother ride and only been said to be a pastiche of Orwell's work. If you haven't read the book or seen the film, see the film first.",
         "This film, based on George Orwell's novel, manages to be entertaining and funny. It centres around a frustrated poet, Gordon Comstock (played by the excellent Richard E Grant (although Grant is a little old to play the role - in the novel Comstock was in his early 30s)) who tires of working for what we would now call \"The Man\" at New Albion advertising company and quits his successful career in order to persue his first love of poetry, particularly an opus called \"London Pleasures\". To this end he moves into rented accommodation, owned by a typical 1930s example of the \"respectable\" middle-class, who, of course, keeps an Aspidistra in Comstock's room. To Comstock, this plant represents all that he is rebelling against. Comstock struggles through most of the film attempting to get his poems published. He is helped and hindered by his Girlfriend, played by Helena Bonham Carter. She also acts as his conscience, badgering him for his foolishness and his pretentiousness. Comstock manages to get one of his poems published in the USA and is sent a cheque as payment. He manages, however, to blow most of this in one night and ends said night in the cells, arrested for drunkeness. Thrown out of his \"respectable\" accommodation for his crime, he moves into very cheap lodgings in a rough part of London and continues his epic poem \"London Pleasures\" Whilst living in this squalor, he discovers his girlfriend is pregnant. This is where the movie falls down. Admittedly, this is a problem with the book. The book has the same ending, but Orwell covered it more realistically. Comstock is forced to confront his responsibility and returns to his old job and gives up on his poetry. In the book, Gordon was loathe to surrender his poetry, but did so for the sake of his woman and child. In the film, Gordon is suddenly converted from idealistic poet to smug middle-class conformist. In the book, Gordon's embracing of the aspidistra was unpleasant but believable and even slightly knowingly ironic. In the film, it is, as above, smug and unlovable. This flawed ending drags down what could have been an excellent film. A shame, but that doesn't mean you shouldn't watch it for the great stuff that precedes it.",
         "How could anyone who had read the book and who had any respect for literature, especially a respected screenwriter such as Alan Plater, turn this story of glum penny-pinched '30's London into 1990's-style standard advertiser's jolly-jumpered \"Heritage\" golden nostalgia?. Not only did it do violence to the tone of the book, it did violence to its very essence. It does violence too to history - to what it was like to live in London in the 1930's on less than £2 per week. All the more reprehensible as the book was largely autobiographical. Comstock, a writer, believes that he has talent as a poet but instead is prostituting that talent writing crass advertising slogans in return for money and a comfortable life. This belief that he is wasting his real talent - and his life in this way causes him to attempt to reject the entire world of money, to live in (moderate) poverty and to devote himself to writing poetry. Having rejected \"the Money God\" he endures the consequences. In the book but not in the film the petty mean realities of poverty in cold 1930's London are spelt out in detail. They weigh him down, make him embittered - and obsessed with the very thing that he wished to escape: Money. His obsession takes the form not of a desire but of an increasing loathing where every kind of failure or slight he suffers is blamed on his lack of money and other people's veneration of it. Comstock's rejection of money makes his life complicated and extremely limited - deciding what each coin in his pocket might buy - can he smoke his single cigarette today or should he to save it for later in the week? His miserable lodgings are policed over by an ever-watchful landlady who neither allows female visitors inside the front door nor the making or consumption of hot drinks in the room, thus forcing Comstock to find furtive and frustrating ways round the latter and to conduct his romancing of his long-suffering girl friend Rosemary in the streets and public places. Comstock believes the reason Rosemary will not sleep with him is his Lack of Money. Worst of all - for him - he finds that having rejected money and enduring the consequences, he cannot even make any progress on his supposed life's work - his poetry. The book is in many ways glum. Comstock, as the author notes, becomes complaining and miserable. Comstock describes himself as \"moth-eaten\". His family had sacrificed all so that he alone would get a \"good education\" and thus consigned themselves to a life of meanness on his behalf. Comstock's consequent perverse decision to give up \"a good job\" thus distressed them and gives him occasional twinges of guilt. A large facet of the book is the way that the reader to some extent comes to share this mean and rather humiliating life. The glumness though is relieved by the self knowledge and perspective of the author making it at times wryly comical. Comstock is not a Socialist. He has no positive vision, only the negative one of the corrupting effects of money and even those Orwell portrays as being obsessive. His wealthy friend Ravelson, a Marxist, tries to enlist him without success. Orwell, in real life from a middle-class comfortable background himself, chose to lead a life which at best was hair-shirt. At worst had him \"Down and Out in Paris and London\" and a volunteer in the Spanish Civil War. No other writer in English had quite such a gloomy and masochistic lifestyle. Comstock chose to work in a badly paid job but will not sponge, he does not accept charity. He has a great deal of integrity especially concerning Art and cannot but be revolted and oppressed by the foolish images and slogans on billboards all around him, some of which he had written: \"Corner Table Enjoys his Bovex!\" His rather inconsistent scruples and artistic sensibility are a curse not a blessing. The book is presumably Orwell talking about what he felt, experienced and believed then. This production is pleasant but all that is notable in the book is missing. The instinct for those who respect Orwell's talent (and can endure his glumness) and have any sense of period might well be to throw their copy into the bin baffled at how such a travesty came to be made. But an excellent BBC TV version was made in the early 1960's starring the late Alfred Lynch and Anne Stallybrass which stayed true to the book. In black and white and studio bound it nevertheless stands head and shoulders above this later production.",
         "KEEP THE ASPIDISTRA FLYING is a novel by George Orwell , a novel that is in many ways the author's autobiography . There's a problem in that since it mirrors the life of a litery giant it becomes sacrilege to modify it , I couldn't help thinking that perhaps the story could have been updated to a very late 20th century setting On second thought perhaps not since 1930s London being replaced by 1990s LA with the plot centering on a young screenwriter wanting to break into the Hollyloot system does seem like sacrilege even if it would have increased the box office takings considerably , and as it stands I'm sure we can all relate to Gordon Comstock in someway , he is after all a frustrated poet with no money while most of the people who come to these pages are frustrated film critics with no money That's where much of the enjoyment of this film lies , we understand the fiery but naive idealism and optimism of Gordon as he tries to get his foot inside the publishing door only to be met with frustration . Richard E Grant might be playing a similar role to the one in WITHNAIL AND I but he is fairly good in these self centered type roles A fairly entertaining film about the hit and miss nature of writing for a living , though perhaps it appeals more to critics than to a mainstream audience",
         "I personally love any film featuring Richard E but this one is some of his finest work. He just has an amazing delivery. Sure the script is a real gem, but only a true actor could pull off the subtle humour of such an intellectual period black-comedy. Keep the Aspidistra Flying addresses two ever present topics; The search for self and art and the unstoppable progression of capitalist society, themes which remain relevant to all of us no matter who or where we are. For me, thats what makes dry British Comedy so funny, the light hearted attitude in reaction to impossible truths. Keep the british humour flying!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "BBC Films",
         "Bonaparte Films"
      ],
      "summaries": ["Gordon Comstock is a copywriter at an ad agency, and his girlfriend Rosemary is a designer. Gordon believes he is a genius, a marvelous poet and quits the ad agency, trying to live on his poems, but poverty soon comes to him."],
      "budget": 0
   },
   "movielensId": 2191,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-11-20",
      "dvdReleaseDate": "1999-06-01",
      "directors": ["Robert Bierman"],
      "runtime": 101,
      "movieId": 2191,
      "title": "Keep the Aspidistra Flying",
      "mpaa": "",
      "actors": [
         "Helena Bonham Carter",
         "Liz Smith",
         "Jim Carter",
         "Richard E. Grant"
      ],
      "imdbMovieId": "0119453",
      "originalTitle": "Keep the Aspidistra Flying",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Fj2yGl3wKYc"],
      "plotSummary": "Gordon Comstock is a copywriter at an ad agency, and his girlfriend Rosemary is a designer. Gordon believes he is a genius, a marvelous poet and quits the ad agency, trying to live on his poems, but poverty soon comes to him.",
      "tmdbMovieId": 54795,
      "avgRating": 2.97143,
      "releaseYear": "1997",
      "numRatings": 105,
      "posterPath": "/exLDuRDE2Lsh1kgfnhk4lFiBPFD.jpg"
   }
}