{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0139564",
      "video": false,
      "title": "See the Sea",
      "recommendations": [
         99002,
         49138,
         48561,
         44513,
         32712
      ],
      "backdrop_path": "/vRVy1Z2eFij6emXvtZTqF0xQdb6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Sasha",
               "gender": 0,
               "credit_id": "52fe470ac3a36847f81206e1",
               "name": "Sasha Hails",
               "profile_path": null,
               "id": 212971,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Tatiana",
               "gender": 1,
               "credit_id": "52fe470ac3a36847f81206e5",
               "name": "Marina de Van",
               "profile_path": "/jpRZo7wOLcxSIxJ4rOQWg8UmrJp.jpg",
               "id": 19359,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Sioffra",
               "gender": 0,
               "credit_id": "52fe470ac3a36847f81206e9",
               "name": "Samantha",
               "profile_path": null,
               "id": 535248,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "le mari de Sasha",
               "gender": 0,
               "credit_id": "52fe470ac3a36847f81206ed",
               "name": "Paul Raoux",
               "profile_path": null,
               "id": 262189,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470ac3a36847f81206b9",
               "name": "François Ozon",
               "profile_path": "/zcrMs8YX5f89Ax2mEDCtaLvwKiE.jpg",
               "id": 4387,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe470ac3a36847f81206bf",
               "name": "François Ozon",
               "profile_path": "/zcrMs8YX5f89Ax2mEDCtaLvwKiE.jpg",
               "id": 4387,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe470ac3a36847f81206c5",
               "name": "Isabelle Broué",
               "profile_path": null,
               "id": 280635,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe470ac3a36847f81206cb",
               "name": "Jeanne Moutard",
               "profile_path": null,
               "id": 416917,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe470ac3a36847f81206d1",
               "name": "Olivier Delbosc",
               "profile_path": null,
               "id": 4401,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470ac3a36847f81206d7",
               "name": "Marc Missonnier",
               "profile_path": null,
               "id": 4402,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe470ac3a36847f81206dd",
               "name": "Nicolas Brevière",
               "profile_path": null,
               "id": 24834,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe470ac3a36847f81206f3",
               "name": "Éric Neveux",
               "profile_path": null,
               "id": 70687,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.583765,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 46748,
      "vote_count": 7,
      "budget": 0,
      "overview": "Sasha, a young British woman, is living with her baby daughter at Ile d'Yeu, a peaceful beach community. A stranger appears. Her name is Tatiana, she's passing through, and pitches her tent in Sasha's yard. The two women build an odd rapport, and tension builds as events unfold.",
      "similar": [],
      "original_title": "Regarde la Mer",
      "runtime": 52,
      "poster_path": "/l8gnjkOv5GKg0fyW8hf7tA2dix4.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Local Films",
            "id": 1123,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fidélité Productions",
            "id": 147,
            "origin_country": ""
         }
      ],
      "release_date": "1997-12-03",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["François Ozon"],
      "runtime": 52,
      "synopsis": null,
      "writers": ["François Ozon"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0139564/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxODkwNjU4MV5BMl5BanBnXkFtZTcwMjk4NDIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sasha Hails, Marina de Van, Samantha | See full cast and crew »"],
      "reviews": [
         "It's not until a feature filmmaker reaches a certain status that their short films are released beyond the festival circuit. Now the short work of Francois Ozon is available on DVD after a short cinematic release. Ozon offers impressive tapas here, with concise, impeccably structured short films. Plot twists are reminiscent of Roald Dahl, while the sensual undercurrents approach Anais Nin's erotica, without being nearly as explicit. In Summer Dress (1996, 15 minutes), two gay teenagers are on holiday at French beach community Isle d'Yeu. While wasp-waisted Sebastian mimes to 'Bang! Bang!', by chanteuse Sheila, his lover Luc begs him to be more discreet. Until Luc dallies with the older, knowing Lucia at the local 'beat'. After Luc's forced to wear her dress home, he comes out of the closet. The cinematography is flashback 1950s, with azure sea, bronzed boys in swimming trunks and rose-red lips. But this nostalgia avoids sentimentality, instead increasing the dreamlike quality of Luc's experience. And the interplay between the characters demonstrates an essential sexual fluidity present in all Ozon's films \u0096 although his characters may have definite sexual orientations, there's no guarantee they'll follow them. In addition, as gay auteur Ozon's focus of desire is men, it liberates his women from the 'male gaze' and allows them to be more interesting. Sharing the same island setting as Summer Dress, the standout film of the collection is See the Sea (1997, 52 minutes). Englishwoman Sasha (Sasha Hails) is holidaying alone with her baby daughter when ill-kempt backpacker Tatiana (Marina de Van) pitches her tent in the backyard. From the first, something is not quite right about Tatiana, but lonely Sasha wants someone to babysit. As the suspense develops, Tatiana becomes more repellent but also fascinating, an earthy id to Sasha's ego. At the same time, while Sasha may be clearly normal, she is also a careless mother. While, the relationship between the two is reminiscent of Ozon's Swimming Pool, the outcome is much darker. ****/***** stars.",
         "I taped this due to the recommend in the NYT television section and it was right. I kept getting apprehensive from the moment the backpacker turns up. The suspense of approaching terror reminded me of the growing sense of horror in Chabrol's Le Ceremonie. Two quibbles: what mother would leave her baby in the bathtub for only a few seconds. And what mother would leave her baby alone on the beach? The mother obviously had a dark side to begin with; she was lonely (trying to reach her husband for several times without success) and was an easy prey to the backpacker. While the ending horrified me, it shouldn't have surprised me. What was great is the movie didn't drag on and was short. Definitely worth watching and it left me shaken for a long time after-wards. Like Le Ceremonie, it will remain in my memory. Horror doesn't mean slash and gore.",
         "This is flat out brilliant film-making - right up there with Hitchcock, Kurosawa, Ford, or anyone else you can name. It functions on multiple levels, the simplest of which is as a thriller which will keep you on edge for 52 minutes - and stays with you a long time after. It's done in a traditional French style - minimal dialogue, almost no music (1 pivotal scene), maximum use of visuals to tell story. The director doesn't need to tell the audience where to go emotionally with heavy handed music cues or dialogue - he knows exactly where he's taking us and lets the images speak for themselves. It's ironic that French films are sometimes thought of as pretentious, because this film is made so simply and fluidly. I heard it said that the best way to tell a story is to get out of its way and let it tell itself. I'd put this one in my top twenty of all time.",
         "See The Sea is one of those films that's truly horrifying. This is one of the few movies that gave me a true scare, not a cheap one. A mother and her child live in a cottage that's located by the sea. Her husband is always on a lengthy business trip, leaving the two alone for long periods of time. One day, a female drifter comes into their lives. This is when the fun begins. Mere words cannot describe what happens next. But the end results are down right scary. If you want a nice scare or if you enjoy a real good thriller every now and then, this one might be your cup of tea. Highly recommended. A-",
         "Francois Ozon once again demonstrates his confidence in his intensely brilliant story-telling abilities, creating a downright unsettling atmosphere where you, as the viewer, aren't sure what is going to happen but you sense it's not going to end well. And then afterwards, you are left thinking about what you've seen and realizing that the 'clues' were there all along, some subtle and some not-so-subtle. I would say this movie is basically a cautionary tale, about what can happen to one who is carelessly focused on one's own needs, who doesn't pick up on what is going on in a potentially dangerous situation. -=- SPOILER ALERT -=- The mother has all the signals that something is very wrong with the backpacker, particularly when she sneaks into her tent and finds the extremely disturbing book with her insane scribblings and drawings, but she is so consumed by her OWN needs that she overlooks these signals. Big mistake.",
         "Francois Ozon has proven himself an unflinching observer of the human animal's dark side. Its amazing how Ozon can infuse a short film about a seaside vacation with this much oppressive atmosphere and fright. The two characters are very human thanks to Ozon showing the good and bad of all parties. A film this gritty should never be called gratuitous. Rather it puts a good person and an evil one in a fishbowl for us to observe and although neither is perfect you are left with no question as to which is which at the end of one hour. Without a doubt worth your time and possibly purchase if someone else can speak to the quality of the DVD's available out there.",
         "I'm a big fan of horror movies, but it has been a long time since a horror movie actually horrified me. I didn't know \"See the Sea\" (or \"Regarde la mer\") was a horror movie when I began watching it. I knew only that it was a perhaps mildly suspenseful, but probably boring fifty-two minute French film being shown on Cinemax. I didn't expect much. I didn't even bother going on-line to look for reviews. So, how was I to know I shouldn't have watched \"See the Sea\" very late at night? As I said, I was prepared to be bored, figuring if I were bored to the point of nodding off on the sofa, I could turn it off and toddle off to bed, no problem. An hour later, having finished watching this amazing, subtle, disturbing film, I was wide awake and disquieted -- and another hour passed before I settled down enough to go to bed. The film's horror is psychological. It's in the relationship between two very different women, and it builds to a stunning conclusion. The last film that made me feel this creeped out was \"Repulsion\" in 1966, when I was a teenager. And that was a French film, too. Hmmm...",
         "The story begins with a crying baby and ends with a crying baby (but under very different circumstances) and in between we become involved in a intriguing and somewhat sinister drama about two very different women. The beauty of the beach location with its golden sand contrasts in an interesting way with the ugliness of the tragic events. Simmering not far below the surface is the sexual yearning of two women, each of them lonely in their own way. Baby Chiffre is a great little actress - smiling, gurgling, crying and doing all the right things at the right time. The two women made a nice contrast in characters - Sasha Halls as the lonely elegant wife and Marina de Van as the intruding back-packer. The development of the plot as the cunning back-packer with her insensitive questioning manipulates the wife into accepting her presence inside her home is an exciting thought somewhat frightening aspect of the story. There are a couple of details I would like to question: Firstly, would the obviously well-bred wife put the toilet roll at her feet on the bathroom floor? Secondly, whilst admitting she was very hungry, would the backpacker pick up her dinner plate and lick off the gravy with her big fat tongue? While the toothbrush scene might offend some people,I found it quite acceptable in the context of the desperate character. Husband Paul appears late in the film as a businessman returning from Paris. The shocking scene which he discovers on arriving home stuns him into absolute silence, hand over mouth to stifle his cry. I think a cry of terror, panic, disbelief - call it what you will, would have added more dramatic impact. Summing up: top quality film, interesting, exciting and disturbing. I am still trying to understand the significance of the title.",
         "Saw this film on the Sundance Channel a couple times now. It's really not anything new, but it's still a haunting story of frustration, need, and (mis)trust. Sasha seems to be happy (and even says so) with her current settled life, yet there are displays of her boredom and frustration throughout the film (the baby keeps her occupied, yet at the same time it also won't let her sleep, read, etc.). She is also in need of some sex, as a couple scenes prove. I suppose probably being as bored as she is more so than being polite, she befriends Tatiana after being wary of her at first. Strangely, she starts to place way to much trust in this person (leaving her to watch the baby, etc.), but that just shows Sasha is so pent up that she'll take any chance she gets to have some relief. As they get chummier, Tatiana starts to show to the audience signs of being a bit unstable (you got to see one such scene for yourself!), and later Sasha finds her weird notebook drawings but doesn't seem to think much of it (we all doodle, right?). Later when Sasha offers her most trusting friendliness, Tatiana finally does what she has to do, starting with a scene that at first looks more a return of friendship than what really happens. (Even though what finally happens is a bit predictable, it doesn't take away from its impact since such a thing is always disturbing and tragic.) Overall, this was an enjoyable film, if you are into concise, well shot and acted drama with talented actresses. Also, for this particular film, it's length was just right, at just under an hour. A-",
         "Ozon certainly has talent. It's obvious from See the Sea (it's even more obvious from his infinitely superior Water Drops on Burning Rocks). See the Sea is impeccably shot and directed. If only some of the other areas were better. Rarely does such an obvious thriller come along, where you can tell from second one where it is going. Ozon might as well have not showed the final shot. It's mostly the fault of the actress playing the camper (apparently the two women had names, but I don't remember them ever being said), or, more correctly, the casting agent who cast her (or Ozon himself, if he's responsible, which he probably is). It's just far too easy to hire this scowling goth chick whom the audience can boo and hiss at - she might as well tied the mother down to a train track and played with her curling mustache. When the mother finds the book with the drawings of gallows and skulls, I had to suppress a laugh. I liked the scene in the graveyard better - it was more subtle. Why didn't Ozon just leave it at that? And I really liked the angle of the mother's sexual frustration. That was excellent, and there are two very explicit, very erotic scenes involving her (although I don't quite believe she'd leave her baby alone on a beach; of course, Ozon does do a good job developing this woman's motherly instincts throughout the film). The end is just cheaply shocking. See the Sea is a decent stylistic exercise, but it is rather a forgettable film. 7/10."
      ],
      "genres": ["Thriller"],
      "productionCompanies": [
         "Fidélité Productions",
         "Local Films"
      ],
      "summaries": ["Sasha, a young British woman, is living with her baby daughter at Ile d'Yeu, a peaceful beach community. A stranger appears. Her name is Tatiana, she's passing through, and pitches her tent in Sasha's yard. The two women build an odd rapport, and tension builds as events unfold."],
      "budget": 0
   },
   "movielensId": 2192,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1997-12-03",
      "dvdReleaseDate": "2001-05-14",
      "directors": ["François Ozon"],
      "runtime": 52,
      "movieId": 2192,
      "title": "See the Sea",
      "mpaa": "NR",
      "actors": [
         "Sasha Hails",
         "Marina de Van",
         "Samantha",
         "Paul Raoux"
      ],
      "imdbMovieId": "0139564",
      "originalTitle": "Regarde la Mer",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Sasha, a young British woman, is living with her baby daughter at Ile d'Yeu, a peaceful beach community. A stranger appears. Her name is Tatiana, she's passing through, and pitches her tent in Sasha's yard. The two women build an odd rapport, and tension builds as events unfold.",
      "tmdbMovieId": 46748,
      "avgRating": 3.07746,
      "releaseYear": "1997",
      "numRatings": 71,
      "posterPath": "/l8gnjkOv5GKg0fyW8hf7tA2dix4.jpg"
   }
}