{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parking garage",
            "id": 4530
         },
         {
            "name": "freighter",
            "id": 181385
         },
         {
            "name": "fundraiser",
            "id": 195410
         }
      ],
      "imdb_id": "tt0120724",
      "video": false,
      "title": "Knock Off",
      "recommendations": [
         10861,
         10596,
         9405,
         10413,
         3513,
         10908,
         17466,
         9103,
         9091,
         19277,
         17774,
         9924,
         19167,
         10366,
         2019,
         9399,
         8831,
         18214,
         9594,
         37632
      ],
      "backdrop_path": "/8ljH6GYfWyA4FRfRq7uqf6LPdR3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marcus Ray",
               "gender": 2,
               "credit_id": "52fe464f9251416c910504cf",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "order": 0
            },
            {
               "cast_id": 25,
               "character": "Han",
               "gender": 0,
               "credit_id": "5a3d8c700e0a2620ec00321d",
               "name": "Michael Wong",
               "profile_path": "/bpqmMC4oUPtke5g3XiWCnMGmbzi.jpg",
               "id": 64896,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Tommy Hendricks",
               "gender": 2,
               "credit_id": "52fe464f9251416c910504e7",
               "name": "Rob Schneider",
               "profile_path": "/vDbjHkAc4OMKObi9W5xW9OuDhDI.jpg",
               "id": 60949,
               "order": 2
            },
            {
               "cast_id": 22,
               "character": "Mechanic [cameo]",
               "gender": 2,
               "credit_id": "5a3d8c339251413d390032ca",
               "name": "Leslie Cheung",
               "profile_path": "/jY0eInsklo9aYc1Som6vEdVd4OL.jpg",
               "id": 69637,
               "order": 3
            },
            {
               "cast_id": 23,
               "character": "Choy/Eddie Kid",
               "gender": 2,
               "credit_id": "5a3d8c470e0a2620e600322f",
               "name": "Dennis Chan",
               "profile_path": "/qZiaEH1JJt8c0WUPJl9gqArGT2P.jpg",
               "id": 64662,
               "order": 4
            },
            {
               "cast_id": 24,
               "character": "Ling Ho",
               "gender": 0,
               "credit_id": "5a3d8c5f9251413d690032e0",
               "name": "Carman Lee",
               "profile_path": "/5dyZjZWUPWfITjdBZ29yj43Nijs.jpg",
               "id": 110845,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Karen Lee",
               "gender": 1,
               "credit_id": "52fe464f9251416c910504d3",
               "name": "Lela Rochon",
               "profile_path": "/9DBu3r5O4fBosSS4FnSzFCVpm0O.jpg",
               "id": 51359,
               "order": 6
            },
            {
               "cast_id": 4,
               "character": "Harry Johanson",
               "gender": 2,
               "credit_id": "52fe464f9251416c910504d7",
               "name": "Paul Sorvino",
               "profile_path": "/exgIZR8So9SOuivI1EjyNKPflzT.jpg",
               "id": 7004,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Bear",
               "gender": 2,
               "credit_id": "52fe464f9251416c910504eb",
               "name": "Mark Houghton",
               "profile_path": "/cNXgbzlsbucTlj0w3PHhMDCLe0K.jpg",
               "id": 26782,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Chip",
               "gender": 1,
               "credit_id": "55160f7cc3a36834850005d9",
               "name": "Kim Maree Penn",
               "profile_path": "/vWRg6MExfS2CcJgHAEy8iPUYxGA.jpg",
               "id": 954000,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c910504dd",
               "name": "Steven E. de Souza",
               "profile_path": "/vdNUgaeJEZy67vhwTeJnftfBRzB.jpg",
               "id": 1726,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe464f9251416c910504e3",
               "name": "Tsui Hark",
               "profile_path": "/spPu64ewZ4Gwo2UzBfKIjfAj9BT.jpg",
               "id": 26760,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "534cfab0c3a3686088000abb",
               "name": "Nansun Shi",
               "profile_path": "/gUcgpW3egrOpR1K1DogAp7kuDfu.jpg",
               "id": 66769,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "534cfac4c3a368608f0009fc",
               "name": "Illana Diamant",
               "profile_path": null,
               "id": 585506,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "534cfad9c3a368608f0009fe",
               "name": "Lauris Freeman",
               "profile_path": null,
               "id": 960203,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "534cfb51c3a3686088000ac5",
               "name": "Ron Mael",
               "profile_path": null,
               "id": 960067,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "534cfb68c3a368607c0009eb",
               "name": "Russell Mael",
               "profile_path": null,
               "id": 961004,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "534cfc4bc3a3686088000ad5",
               "name": "William Fung Kwun-Man",
               "profile_path": null,
               "id": 66005,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "534cfc73c3a36860a3000aa3",
               "name": "Mabel Kwan",
               "profile_path": null,
               "id": 960069,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "534cfc8fc3a3686075000a92",
               "name": "Ben Luk",
               "profile_path": null,
               "id": 127801,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5a0cfc10c3a368130b004caf",
               "name": "Arthur Wong",
               "profile_path": null,
               "id": 26731,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a3d8c1e0e0a2620dd0031e6",
               "name": "Sammo Hung",
               "profile_path": "/hpqwIMmLLpn0mMmpi4EhzARK24K.jpg",
               "id": 62410,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "5a56179d9251417aa002382d",
               "name": "Samuel Hui",
               "profile_path": "/wX0VlIQXA8w4q6xUKnhW9TWH5XJ.jpg",
               "id": 26728,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.852198,
      "production_countries": [
         {
            "iso_3166_1": "AW",
            "name": "Aruba"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 37498,
      "vote_count": 88,
      "budget": 33000000,
      "overview": "Marcus Ray (Jean-Claude Van Damme), a sales representative for \"V SIX\" jeans, and his partner, Tommy Hendricks (Rob Schneider), are about to be busted for selling \"knock off\" jeans. Their American contact, Karan Leigh, who by the way is not only their employer but a CIA agent sent to find the mole in their operation, is threatening them with a jail term if they do not prove their innocence.",
      "similar": [],
      "original_title": "Knock Off",
      "runtime": 91,
      "poster_path": "/pDGYcWlxSUwX3oibN8owWYZvjAu.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film Workshop",
            "id": 3618,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MDP Worldwide",
            "id": 10828,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Knock Films A.V.V.",
            "id": 21848,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Val D'Oro Entertainment",
            "id": 21849,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-04",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "There is no substitute.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Aruba",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hark Tsui"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Steven E. de Souza"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120724/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3NzAxNTcyNl5BMl5BanBnXkFtZTcwMzM2ODAyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Claude Van Damme, Rob Schneider, Lela Rochon | See full cast and crew »"],
      "reviews": [
         "I didn't expect Knock Off to be the film it was. I thought it would be another lame bit of Van Dammage, just like all the others, but wow! This is in a league of it's own. First of all, let me say this: it's not a good film: of course, it isn't! The script's diabolical, the acting is dreadful and the plot has got to be one of the silliest ever written. Oh yes, but Knock Off works because it is truly bonkers. Truly out of its mind. Tsui Hark is a great director (check out the insane Zu: Warriors of the Magic Mountain, as well as the Hark produced A Chinese ghost Story, which is truly wonderful) and his irreverent approach works wonders here. Some of the camerawork here has to be seen to be believed: here, we have a shot from the inside of a shoe, the camera moving through a wall and through a computer...while, the action is wildly OTT and hilariously preposterous. Rough around the edges it may be, but the action is genuinely imaginative stuff. Like Van Damme's Hard Target, Knock Off has been blessed with a director who can stage great action, but unlike the irritatingly melodramatic john woo, Hark directs as though he's having a great time: even the dramatic (!) scenes border on intentional parody. And then there's Jean Claude Van Damme, easily the funniest out of all the Schwarzenegger/Stallone/Seagal crowd. Funniest? Why? Cos he really looks like he's trying, bless 'im! The scenes where he gets all emotional (check out the bit when he confronts Hendricks on the roof top: 'YOU LIED TO ME!') are painfully funny because he just can't act at all. And because of his accent, lines like 'Don't you understand what you do....i-fax me?' (the 'i-fax' is supposed to be 'affects') sound highly amusing. Unlike that dullard Steven Seagal, van Damme's limitations as an actor are precisely what makes him watchable. Then there's the deeply stupid Rob Schneider, who plays EXACTLY the same role in everything he's ever done, and Paul Sorvino, who continues to destroy whatever credibilty he gained starring as Pauly Cicero in GoodFellas. Plus, what's with the green explosions? The walkie-talkie dropping into the gangster's hand from nowhere? The bullet-shot that goes through the can of beans? Rob Schneider whipping Van Damme with a fish? The song at the end of the film? It's a complete mess! Knock Off is easily Van Damme's best film, without a shadow of a doubt. It's utter rubbish, yet it's one of the funniest films I've ever seen. Of course, you need plenty of irony and an appreciation for stupid action movies to really get the most out of this. there are some people who will think that Knock Off is absolutely atrocious. And you know what, they're probably right too. But what's also correct is that in some deeply disturbing, dangerously perverse way, it is a work of genius.",
         "Knock off is Van Damme`s second movie to be directed by Hong-Kong director Tsui Hark. The story and acting of this movie is not important at all, because it focuses mainly on its many actionsequences. Van Damme is good as always, and the movie contains many well-directed actionscenes. Don`t watch it if you prefer quality acting, realistic characters and stunning special-effects, because this movie is a low-budget action-flick made for the fans of Van Damme. 8/10",
         "Tsui Hark's career took a serious down turn when he decided to try his chances in Hollywood. To be fair though, this seems to be true of pretty much everybody that decides to try a career in Hollywood. Tsui got off to a bad start when he was teamed up with Jean Claude Van Damme (an indignity every HK director seems to have to suffer on arrival in the US) to make the movie DOUBLE TEAM. I haven't seen DT, but it seems to be universally despised. However, so is KNOCK OFF for the most part, which I find to be very unfair as it has a lot to offer. To properly appreciate the film, however, one has to take it in the proper context. One has to realise that Tsui Hark realised he was not going to be taken seriously in Hollywood, and would probably be consigned to cheesy action B-movies for ever if he stayed. I have no doubt he already planned to return to Hong Kong when he made KNOCK OFF, and decided to have a little fun first - and channel a lot of Hollywood money into Hong Kong hands at the same time. Keeping this in mind whilst watching the film reveals a whole level to it that I suspect most viewers do not appreciate. It's clear that the script for the movie is rather absurd, but quite cleverly so. The concept of the Russians trying to take over the world by fitting miniature bombs in knock off children's toys is not one that was ever meant to be taken very seriously. Having the Russians as the main villlains is a quaintly out-dated set up, but the real interest is in the backdrop, where Tsui shows a little love for the people of Hong Kong and worries about the hand over to China in 1997. He also decides to have a little fun at the expense of Van Damme, who is given a rather ridiculous role that makes fun of his usual image (perhaps this is why Van Damme fans don't like the movie? Though VD himself seems quite a willing participant in the fun-poking). Rob Schneider is quite amusing but dangerously annoying as the comedy side kick, whilst Lela Rochon is particularly attractive as the primary glamour interest (who also kicks no small amount of ass). Few woman sharing a movie with Carmen Lee could come away looking good, but she manages it. The rest of the cast are an assortment of anonymous alleged russians and CIA agents, and some familiar Hong Kong faces round out most of the rest of the cast. Tsui Hark handles the script tightly, sticking close to its B-movie heart but using it to set up some fun and playful scenes. It should all be taken a little tongue in cheek - those that have seen Tsui Hark's better works should appreciate that straight away. As well as fun with the script and with JCVD, Tsui Hark also decides to have a *lot* of fun with his camera. Hyperkinetic camera work has always been his trademark, and here he decides to hold nothing back. There are some amazingly sophisticated and inventive shots and movements, giving the film a unique visual style (that Tsui revisited and expanded on when he returned to Hong Kong and made TIME AND TIME). It is for the visionary camerawork that the movie should really be seen. There's also some pretty good action though, well above the average for Jean Claude Van Damme - thanks to Sammo Hung and Yuen Bun's involvement as the 2nd unit crew, no doubt. JCVD is usually something of a one-trick pony, and has barely a 10th of the physical agility and skill of his Asian contemporaries. The action directors manage to use him well here though, and the camerawork makes him look far better than he's ever done before. It's a sad fact that most of the people that watch KNOCK OFF will probably be Jean Claude Van Damme fans, because to be honest anybody that thinks JCVD is a good martial artist probably doesn't have the experience to appreciate a Tsui Hark film. On the other hand, many Tsui Hark fans will avoid KNOCK OFF because of the presence of Jean Claude Van Damme. This is a shame, as it's really more a Tsui Hark film than a Van Damme film. Whilst it may be Van Damme's best movie, few would dream of arguing that it's Tsui Hark's best, despite his inventiveness being in pretty good shape. It's still broadly bound by the limits of a Hollywood action movie, though, and no match for works like ONCE UPON A TIME IN CHINA or THE BLADE. It would be nice to imagine that his time in Hollywood would lead to more Americans appreciating his groundbreaking Hong Kong movies, but I doubt that it has. Still, the movie is recommended for Tsui Hark fans. Not his best, but delivers plenty of entertainment none-the-less.",
         "How can anyone hate such a beautiful film? The combination of poor dubbing, Van Damme's \"acting\" and \"grasp of English\", Schneider's queer-ass jokes, and Lela Rochon's breasts, I thought, would make Knock Off an Oscar contender for sure. In addition, it is a valuable tool for young amateur cameramen. They clearly just bought a new camera before they started filming, and were trying out all the new gadgets (when Van Damme reaches into the box of watches, or when they go into the barrel of the gun, or when they pan up from everyone's feet, or use multiple exposures to create the illusion of a quality film). As for the soundtrack, Ron and Russell Mael deserve a Grammy, or, at eh very least, a Source Award. I mean, \"It's a Knock Off\" emerges as the single that will truly be the soundtrack for the lives of teens in the new milennium. All-Star Sam Hui also contributes to the album. His ground-breaking \"Ten Girls\" ,which goes a little sumthin' like this: \"Sal pon ass hi cow go yang si ming ming hi lo how wow bom hi sam chung gay yeah chop hay bing si ching chun may li chow mo so pli\" ...is sung by Van Damme. It speaks to you. It tells you to leave the theater. Another interesting aspect of this film is that it was the only Western film allowed to be in production in Hong Kong during the handover to China. They try to work this into the first action sequence (which is 90 minutes long and followed by the credits)by making sporadic, frenzied, obscure references to the ceremony that don't make sense or have any effect on the outcome of Van Damme's struggle against the Russian mafia. Ultimately, if you want to see green explosions, Paul Sorvino returning from the dead, Rob Schneider and Van Damme engage in S&M during a rickshaw race, Lela Rochon's breasts, and a Russian with bronchitis chop people up with his eyeglasses, Knock Off is the movie for you.",
         "I can understand why people would like to knock Knock-Off but as an action film it is brilliant. There are some really well planned out shots and the fight scenes were top notch as well. The movie starts at a fast pace and keeps it up for the whole picture. The supporting cast is wonderful here the movie actually has some good character development. I like the fact that Van Damme isn't the only hero here. Rob Schneider is very funny plays the part well as does Lela Rochon, Paul Sorvino, and Michael Wong. That's a good cast right there! The movie is also a good take on the ever-present knock-off artists that flood Hong Kong, as well as most big cities with cheap brand name crap. \"Lets put bombs in the knock-offs so we can threaten the entire world!\" Not a bad idea for an action movie. I thought that the Russian bad guys were aptly stereotypical and I especially liked the \"Coughing Guy\" character. Visually, the movie is crazy. There are some innovative shots here, like the inside the shoe shot, the inside the gun shot, and my favorite, the what's inside of the box shot. It makes me love this movie even more! So don't knock down Knock Off until you give it a chance. See it for the humor and the wacky plot, appreciate it for the cinematography and fight scenes, and enjoy it for all it's worth. There's a lot going on in this movie. Tsui Hark's direction is always fresh and fast paced, so if you liked any of his other movies, you'll appreciate this offering. One of my all time favorites.",
         "Formulas are good. Be it the DIE HARD clone, or the buddy-picture. Action formulas win. It's got to be by the book. Or it dies. Action movie directors rarely break the mould. Instead the mould breaks them. Ringo Lam and John Woo both came to the US when the Hong Kong action style was in vogue. But action movies need more talk and less action to satisfy American audiences. So in trying to replicate THE KILLER, they make a mess like REPLACEMENT KILLERS. Until now that is. KNOCK OFF got abysmal reviews and audiences hated it. I don't dig that many action movies. And I loved it. Director TSUI HARK injects such enthusiasm into things it is almost impossible not to enjoy. Hark treats us to an unrivalled, and insane array of camera tricks to liven up proceedings. Entirely unpretentious, it is action to the power of ten. Bad guys defy gravity and inertia, and the same hooded goons get beaten up time after time. There is even one character who dies, and returns inexplicably not once but twice. Ridiculous? Yeah. But gloriously unapologetic. KNOCK OFF promises action and delivers. If you want to take it seriously then do so, vent your rage and kill it on the sliding scale. The joke is on you. KNOCK OFF invites ridicule. It also defies it. For that reason I'll give it a ten.",
         "American audiences failed to appreciate one of the first serious attempts to bring pioneering Hong Kong cinematic techniques to Hollywood standards. John Woo's complete selling-out of originality to the lowest common denominator of American action films has emphatically NOT been followed by Taiwanese genius Tsui Hark. Twenty years from now, critics will look back and wonder in dismay how they could have ignored the MOST cutting edge film to be released in the 90's. \"Knock Off\" is this decade's \"Blade Runner.\" Jean-Claude Van Damme shows amazing acting range and comedic talent-at times he is reminiscent of Stoney Face Buster Keaton himself. Hark clearly learned from his weaknesses in \"Double Team,\" this time willingly emphasizing them to get a laugh and then showing Van Damme's strengths as we've never seen them before. Rob Schneider manages to get some real acting in, a much superior sidekick role to the similar one he played in \"Judge Dredd.\" Paul Sorvino literally chews the scenery as the mastermind Johanssen. The camera-work is incredible. Arthur Wong takes us inside of a doll's eye, allows us to see from two angles at once, shows us x-ray shots of a sneaker's soles and utilizes freeze-frames to maximize suspense. At one point a tiny doll on a desk seems to be holding the two principles by their necks. Later their boss seems to grow to a superhuman stature as she chews them out for wasting company money. It may take a while for this movie to be appreciated in the States, but word has it it was better appreciated in Asia. It's little surprise, this is one of the most Asian films ever to star Western actors.",
         "Now I 'm sure there are some naysayers out there, but this film is total genius. It is one of my favorites from the 1990's. There is such mastery and control here, that though the line readings are sometimes awful the film's surreal nature saves that from being a flaw, and turns it into an asset. The chaos of the film is mirrored in the chaos of the story, and Van Damme our cipher, stuck in the middle with no one to trust. Chance is more likely to solve problems than force is, and the film is dizzying in it's sense of spacial relations. From the foot car races to the end this film never stops. More so than The Matrix, this is the future of film making.",
         "Sure it's bad. If you aren't expecting a bad film, then you really don't like HK action films, do you? Tsui Hark is the only HK action director I've seen to get a Hollywood cast to perform action sequences with a real HK sensibility! John Woo's Hollywood films are trying too hard to be good, and the action suffers. With Knock Off, Tsui Hark delivers just the sort of dizzying, senseless, impeccably-timed, and frenetically-paced action we've come to expect from Hong Kong directors.",
         "John Woo failed, so did Ringo Lam, but Tsui Hark did it. He made a movie in Hollywood, as good as his previous Hong Kong-movies. This is easily the best Van Damme movie to date. The story is actually pretty good(and funny), the acting is great and the action kicks ass. Very stylishly directed by Hark, this is an outstanding effort from the Van Damme/Hark-team(who also worked together on Double Team). I can´t understand why so many people is putting this movie down. I think it is a very enjoyable action movie, and for Van Damme-fans, this is a must-see. I give it 9 out of 10"
      ],
      "genres": [
         "Action",
         "Comedy",
         "Thriller"
      ],
      "productionCompanies": [
         "Knock Films A.V.V.",
         "MDP Worldwide",
         "Film Workshop"
      ],
      "summaries": [
         "A Hong Kong fashion designer (Jean Claude Van Damme, if you can believe that billing) who had previously been involved in knock offs of major label merchandise, such as \"Pumma\" running shoes, attempts to go straight with the help of his new partner (Rob Schneider), who is secretly an undercover CIA agent involved in an investigation of the black market. Their main product, jeans, is involved in the knock offs, which brings a representative (Lela Rochon) of the American company to investigate. Paul Sorvino also appears as the head of the CIA operation in Hong Kong. However, just as Schneider is not as he initially seems, everyone in the film switches roles by film's end.",
         "It is June of 1997. In 72 hours, Hong Kong will return to Chinese rule after 150 years as a British-ruled colony. Marcus Ray and Tommy Hendricks are sales reps for V SIX Jeans, and they are enjoying life in Hong Kong in this time before the island nation's transition back to Chinese rule. While Tommy busily prepares for the latest fashion show, Marcus is off looking at knock off goods -- imitation watches, jewelry, and baby dolls, in which his longtime friend Eddie Wang and his Hong Kong associate, Skinny Wang, are involved. When Marcus and Tommy's supervisor Karen Leigh arrives and informs them that much of their last shipment of jeans was filled with knock off imitations, the two can't believe her, but they agree to help in raiding a warehouse to prove their innocence. After a violent encounter that involves local police Ling Ho and Lieutenant Han, Marcus eventually learns that Tommy is an undercover CIA agent, and so is Karen. Meeting with their boss, agent Harry Johansson, Marcus learns of a conspiracy involving the Russian mafia and their attempts to smuggle tiny, but highly explosive \"microbombs\" to the worldwide terrorist black market. And these are bombs that explode into green flame when detonated. Marcus, Tommy, and Karen set out to stop the conspiracy and figure out who's behind it.",
         "Action star Jean Claude Van Damme plays a fashion designer who must join forces with a C.I.A. agent to combat terrorism."
      ],
      "budget": 35000000
   },
   "movielensId": 2196,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1998-09-04",
      "dvdReleaseDate": "1998-12-29",
      "directors": ["Tsui Hark"],
      "runtime": 91,
      "movieId": 2196,
      "title": "Knock Off",
      "mpaa": "R",
      "actors": [
         "Jean-Claude Van Damme",
         "Michael Wong",
         "Rob Schneider",
         "Leslie Cheung",
         "Dennis Chan",
         "Carman Lee",
         "Lela Rochon",
         "Paul Sorvino",
         "Mark Houghton",
         "Kim-Maree Penn"
      ],
      "imdbMovieId": "0120724",
      "originalTitle": "Knock Off",
      "genres": [
         "Action",
         "Adventure",
         "Thriller"
      ],
      "youtubeTrailerIds": ["5Txm_I4usB0"],
      "plotSummary": "Marcus Ray (Jean-Claude Van Damme), a sales representative for \"V SIX\" jeans, and his partner, Tommy Hendricks (Rob Schneider), are about to be busted for selling \"knock off\" jeans. Their American contact, Karan Leigh, who by the way is not only their employer but a CIA agent sent to find the mole in their operation, is threatening them with a jail term if they do not prove their innocence.",
      "tmdbMovieId": 37498,
      "avgRating": 2.17647,
      "releaseYear": "1998",
      "numRatings": 357,
      "posterPath": "/pDGYcWlxSUwX3oibN8owWYZvjAu.jpg"
   }
}