{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "england",
            "id": 392
         },
         {
            "name": "estate",
            "id": 155881
         },
         {
            "name": "governess",
            "id": 165468
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0119125",
      "video": false,
      "title": "Firelight",
      "recommendations": [
         51548,
         26271
      ],
      "backdrop_path": "/hLa5e8k8BLFG4onam5PnfodKZp3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Elisabeth Laurier",
               "gender": 1,
               "credit_id": "52fe46ca9251416c9105fd0b",
               "name": "Sophie Marceau",
               "profile_path": "/xrMvKw3bAuCyXKSc4IQIoOPBQZV.jpg",
               "id": 1957,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Charles Godwin",
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fd0f",
               "name": "Stephen Dillane",
               "profile_path": "/x86B8ZaOKrYJM0pUYtzKTlEn7SS.jpg",
               "id": 8435,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Louisa Godwin",
               "gender": 1,
               "credit_id": "52fe46ca9251416c9105fd13",
               "name": "Dominique Belcourt",
               "profile_path": null,
               "id": 137602,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "John Taylor",
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fd17",
               "name": "Kevin Anderson",
               "profile_path": "/roCItER7LbrJJvAV1Fku3jG9g8k.jpg",
               "id": 51805,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lord Clare",
               "gender": 2,
               "credit_id": "591361bbc3a36864c6059bbc",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fd01",
               "name": "William Nicholson",
               "profile_path": "/kfAuyOIK4vBpwCRg7kVrV6cOX3f.jpg",
               "id": 933,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46ca9251416c9105fd07",
               "name": "William Nicholson",
               "profile_path": "/kfAuyOIK4vBpwCRg7kVrV6cOX3f.jpg",
               "id": 933,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.315877,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 38621,
      "vote_count": 16,
      "budget": 0,
      "overview": "Firelight is a period romance/drama film written and directed by William Nicholson. It was Nicholson's first, and to date only, film as director.",
      "similar": [
         253,
         77949,
         646,
         657,
         667,
         699,
         708,
         714,
         6114,
         634,
         691,
         210479,
         146216,
         658,
         668,
         682,
         707,
         259693,
         65086,
         1581
      ],
      "original_title": "Firelight",
      "runtime": 103,
      "poster_path": "/f4egZQ37unTkD1SW74gIy7i5l3U.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Wind Dancer Productions",
            "id": 8116,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1997-09-14",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Passion has no limits",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Nicholson"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["William Nicholson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119125/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwOTgxNjY2N15BMl5BanBnXkFtZTYwNzg1NTg5._V1_.jpg",
      "actors": ["Stars: Sophie Marceau, Stephen Dillane, Dominique Belcourt | See full cast and crew »"],
      "reviews": [
         "I have to admit that I watched this the first time because of my admiration for the performances of Sophie Marceau. I watched it several times more because of the interesting portrayal of the power of desire presented by oustanding acting and a rich \"period piece\" production. Should your friends belittle the story as formulaic and the ending as too easy, ignore them. They have missed the richness of the flow of events in this movie that portrays a more repressed world where women (and, to a lesser degree, men) had different and more limited options and necessarily pursued their opportunities differently. This movie was so well done, it leaves you wishing it were an hour longer.",
         "The artistry of this movie is not evident the first time you watch it because you notice nothing but the actors' brown eyes and the blue cold rooms of the mansion. But watch it a few more times and you realize how balanced the story is, how themes of birth and death parallel heat and cold, love and hate. The script is simple because silence and secrecy drive the plot. Compared to Jane Eyre, it is rather sparse, but so what? I gave it a 10.",
         "The title led me to expect \"Firelight\" would be a \"chick flick\", yet the inclusion of the beautiful Sophie Marceau made viewing imperative. The astonishing credibility of the actors' performances was aided by an impeccable script coupled with masterful direction. Add to that award-winning cinematography and achingly beautiful music reminiscent of gypsy violins and the result is an extremely moving love story. How this film came to be ignored by the US public is one of the great mysteries of our time. Every word, every sigh, every gesture and every scene appears uncontrived yet at the same time is testament to breathtaking genius. If only director William Nicholson would bring his ensemble together again for more of the same! Just thinking about \"Firelight\" brings tears to my eyes. No other movie has had such an effect on me. File this one under \"U\" for \"Unforgettable\" in the illustrated dictionary.",
         "No film can be all things to all people. However, \"Firelight\", a simple film which when taken in and of itself, is no less than a masterpiece. From a carefully crafted minimalistic script to superb acting by a few well cast and well directed principals to artful cinematography and lush scenic beauty, this little film is powerfully compelling. \"Firelight\" explores the depths of passion, desire, and love amidst the circumstance and social order of 19th century England using elegantly subtle brushstrokes. This film will be most appreciated by mature audiences.",
         "I originally watched this on Encore Indie and it touched me in a way only a few movies or stories ever do. The subject matter could have become tawdry if not handled well, which it was. All the characters had their place, even the American who offered Charles an option of a place to go, to be free of all the pretense and obligation of his life, being also a main theme of the story, obligation and responsibility, as well as the desire to break free of them. And watch it several times, the nuances that come out are amazing and also listen to the background talk, some interesting facts come out which help you understand the characters and stories even more. I actually watch it with headphones on to hear all the conversations going on. And Charles, watch his facial expressions, they are absolutely priceless and perfect. My father actually sat and watched it, and trust me he's a ESPN guy, not romance movies. Anyway, it was just amazingly beautiful and passionate.",
         "I greatly enjoyed this movie, and quite understand why reviews range from the euphoric to the vitriolic. Some will love it, and some will hate it. I have given it five stars out of ten, just to place myself precisely in the middle. For quality it is worth more, and because it may be construed as condoning aspects of immoral behaviour, less. Whether it does actually condone that which is wrong is open to debate. So, too, is the matter of predictability. Are you expecting blissful lovers to disappear into a glorious sunset? For this period drama, you do have to suspend reality and accept the parameters required for the film to work. We are asked to believe that, way back in the first half of the nineteenth century, a comatose woman, seemingly unable even to blink, would have survived for years, and still have significant life expectancy. Medical science makes such a thing possible in our time, but how would the patient have been fed in those days? Don't let such considerations put you off. For other titles, we accept time travel, real people living inside computer memory, oriental gentlemen waving scimitars who run up vertical walls and jump over tall buildings, and still enjoy the show. Sophie Marceau's acting was outstanding. Who would have thought that Elisabeth Laurier in 'Firelight' and Lila Dubois in 'Lost & Found' were played by the same person? Stephen Dillane, playing Charles Godwin, was more than adequate as the other main lead. The rest of the characters were well cast, each contributing significantly to this very moving tale. 'Firelight' covers part of the lives of two essentially principled people trying to find a way through the distressing circumstances with which each was faced. If they took a wrong turn, which of us is going to throw the first stone? Judgment of every individual is God's prerogative. If this film does nothing else, it does show why there is a debate about euthanasia. I had two special adult friends outside our immediate family early in life, one as a child and one as a youth. Both had flaws in their characters, but were excellent mentors. I chose to adopt some of their traits, but not others. A couple of years past retirement age, I bought my first television, and have since discovered films. I find these very instructive, giving me insights into the human condition which I would not have otherwise. As with my mentors, I am using my discrimination when assessing any messages suggested by each movie. I found 'Firelight' emotionally stimulating, its characters eminently admirable in many respects, but used my beliefs and discretion in determining the validity of any moral that may be inferred from its plot. Isn't this what we all do? Some review comments seem to be denigrating Charles Godwin unfairly. It was Lord Clare who ruined the estate by his profligacy. Charles, on the other hand, was trying to keep the boat afloat as a sheep farmer. To suggest that Charles viewed Elisabeth as little more than a chattel doesn't ring true with me. I gained the impression that he was considering her as well as himself right from the beginning. I also felt that their motives tended towards the welfare of others rather than their own selfish ends. The firelight allegory might also be less simplistic than is being suggested. If I am recalling events correctly, I thought the initial use was to introduce a plot continuity. This was progressed to a vehicle used by Elisabeth to allow her daughter the opportunity to break free of her antagonistic attitudes. At some point, the firelight rekindled a significant memory. Finally, for Amy, the firelight was conspicuous by its absence. Were the words, \"May God have mercy on us\", just a common expression, or were they spoken from the heart? Judge for yourself. I looked for the DVD, hoping that it would have an audio commentary. Guess what? Buena Vista has allowed the title to become currently 'out of print', so I couldn't even buy the film itself (!) That surprised me, considering the number of reviewers and the high average rating. I'm looking forward to seeing this film again, but will have to wait for it to come around once more on TV. Do keep an eye open for it in your programme guides. If and when it appears, it's well worth watching.",
         "I saw it four years ago, and loved it so much that saw it a few more times over several days. The actors are all very good. I think the film delivers everything that is required of a period drama/romance, including the breathtaking visual, and on top of that, the situation that the characters have to deal with is every bit contemporary, so you don't have to stretch yourself to feel for them. The psychology of each character is very natural and convincing, including the little girl's. Because it is convincing, at the end of the story, you share the emotions of the characters 100%, which is the point of watching an intensely emotional drama like this. Unplug the phone and turn off the mobile and make sure there is no interruption while you watch this, because the tension should not be broken. You will be deliciously rewarded.",
         "This is a wonderful movie about how a woman's love can overcome major obstacles. Sophie Marceau is a beautiful governess, who seven years prior was hired by a rich Englishman to conceive a baby because the man's own wife had been seriously injured but did not die after a riding accident. Marceau's motivation is to pay her father's debts and get him out of prison. Thus the two principal characters are having this weekend \"affair\" out of a sense of duty to others. Unlike many movies set in the mid-19th century, the rich people in this movie are not one dimensional and heartless, and the poor people are not powerless victims. Marceau manages to track down her child after 6 years and becomes her governess. The girl has become a spoiled brat, and Marceau is the first to teach the girl how to read, and much about life. There is not exactly a happy ending, in the Hollywood sense. In order to get something, one must take risks and be willing to give up other things.",
         "A wonderful photographed movie with a convincingly playing Sophie Marceau. Absolutely recommendable for fans of historical romances.",
         "It's 1838 and Elisabeth Laurier, a Swiss young woman, must get money to pay for her father's debts. She agrees to enter into what might be viewed as an indecent proposal with Charles Godwin, a well to do English landowner, in having a sexual relation for the sole purpose of giving him a child his sick wife can't give him. Elisabeth must renounce to all claims of the baby. What starts as a pure sex, with Elisabeth suffering quietly while Charles has his way with her, suddenly turns into pleasure, seen on the young woman's face. Imagine Charles' horror when he returns from a trip to find out his sister-in-law Constance, has engaged Elisabeth as his daughter's governess. Louisa, who has terrorized previous attempts at receiving an education, rebels against this new stranger. Since by this time Charles' wealth has suffered a reverse, and having assured a moth's wages to Elisabeth, he consents in her staying. Charles' wife who is sick, is dying a slow death. It's inevitable that Elisabeth will have an effect on Charles and that she will be able to tame the wild Louisa into accepting her. William Nicholson, who wrote and directed \"Firelight\", created a film of great beauty. As it is, there are elements of other, better made movies, within the screen play, although it makes good entertainment. Nic Morris' cinematography gives the picture a glossy look that is appealing to the eye. Christopher Gunning's musical score serves the movie well. Sophie Marceau, an actress of great beauty makes an impression as Elisabeth. Stephen Dillard's Charles is equally appealing as the man tormented between duty and new found passion. Dominique Belcourt is perfectly bratty as Louisa. Joss Ackland appears as Charles' father and Lia Williams is Constance. As Gothic romance, \"Firelight\" will delight fans of the genre. William Nicholson directed his own story with great visual style."
      ],
      "genres": [
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Carnival Film & Television",
         "Hollywood Pictures",
         "Wind Dancer Productions"
      ],
      "summaries": ["In 1838, lovely governess Elisabeth agrees to bear a child of anonymous English landowner, and he will in return pay her father's debt. At birth she, as agreed, gives up the child. Seven years later she is hired as governess to a girl on a remote Sussex estate. The father of the girl, Charles Godwin, turns out to be that anonymous landowner. So Elisabeth has to be her own daughter's governess, and she can't reveal the secret of her tie with little Louisa."],
      "budget": 0
   },
   "movielensId": 2197,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1997-09-14",
      "dvdReleaseDate": null,
      "directors": ["William Nicholson"],
      "runtime": 103,
      "movieId": 2197,
      "title": "Firelight",
      "mpaa": "R",
      "actors": [
         "Sophie Marceau",
         "Stephen Dillane",
         "Dominique Belcourt",
         "Kevin Anderson",
         "Joss Ackland"
      ],
      "imdbMovieId": "0119125",
      "originalTitle": "Firelight",
      "genres": [
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["4qvtoymwZwE"],
      "plotSummary": "Firelight is a period romance/drama film written and directed by William Nicholson. It was Nicholson's first, and to date only, film as director.",
      "tmdbMovieId": 38621,
      "avgRating": 3.48795,
      "releaseYear": "1997",
      "numRatings": 166,
      "posterPath": "/f4egZQ37unTkD1SW74gIy7i5l3U.jpg"
   }
}