{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dance music",
            "id": 18395
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0139468",
      "video": false,
      "title": "Modulations",
      "recommendations": [],
      "backdrop_path": "/703NMdNBXxfyK3SGMIegqdx1ptj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4983c3a36847f819e135",
               "name": "Karlheinz Stockhausen",
               "profile_path": null,
               "id": 1206804,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4983c3a36847f819e139",
               "name": "Moby",
               "profile_path": "/AmgaMF4Z8xYalPHPfoigTvqPkIu.jpg",
               "id": 39121,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e13d",
               "name": "Afrika Bambaataa",
               "profile_path": null,
               "id": 1096822,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e141",
               "name": "Derrick May",
               "profile_path": null,
               "id": 1135186,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4983c3a36847f819e145",
               "name": "Genesis P-Orridge",
               "profile_path": "/cIOJ0ci3v4RCMd97LqTXS6U2moz.jpg",
               "id": 556908,
               "order": 4
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4983c3a36847f819e131",
            "name": "Iara Lee",
            "profile_path": null,
            "id": 1006852,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.436508,
      "production_countries": [],
      "id": 59138,
      "vote_count": 4,
      "budget": 0,
      "overview": "Less a documentary than a primer on all electronic music. Featuring interviews with nearly every major player past and present, as well as a few energetic live clips, Modulations delves into one of electronica's forgotten facets: the human element. Lee travels the globe from the American Midwest to Europe to Japan to try to express the appeal of music often dismissed as soulless. Modulations shows that behind even the most foreign or alien electronic composition lies a real human being, and Lee lets many of these Frankenstein-like creators express and expound upon their personal philosophies and tech-heavy theories.  Lee understands that a cultural movement as massive and diverse as dance music can't be contained.",
      "similar": [
         258480,
         244772,
         401898,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         27586,
         370663,
         10735,
         43923,
         540,
         340485,
         250124,
         11216,
         1581
      ],
      "original_title": "Modulations",
      "runtime": 75,
      "poster_path": "/gNQOhfUPPzWX1gIraRW60FbX0kH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-18",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "Cinema for the Ear",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Iara Lee"],
      "runtime": 75,
      "synopsis": null,
      "writers": ["Peter Shapiro"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0139468/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5ODA5NjE2NF5BMl5BanBnXkFtZTcwNzcyNTIyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Arthur Baker, Afrika Bambaataa, Carl Cox | See full cast and crew »"],
      "reviews": [
         "A broad range of people linked to the current and past techno scene have made it into the film and it would be mean not to note how great Holger Czukay's dancing is. But the publicity for Modulations says it \"traces the evolution of electronic music\", which is not quite true. There's quite a leap from the jumble of clips involving Pierre Henry and John Cage into the familiar material on disco, Kraftwerk and Derrick May. A more serious documentary might have challenged what the techno movement has to say about itself. Techno's rhetoric is borrowed from the modernists of the 50s and 60s, but maybe the real story is a more familiar one for pop music: the dancefloor's appetite for the next big thing.",
         "I saw Modulations as part of a film festival here in Adelaide; i wish now that i had gone and seen it twice. I finally found out WHY i like dance/electronic music while watching it. The first feeling i had as i walked out of the theatre was \"ALL my friends need to see this so they can understand me better!\" Unfortunately not one of them has- but i am still hoping!! For anyone who hasn't seen it; and are into dance or electronic music of any kind; GO SEE IT. You'll probably find your roots, come to a new and better understanding of your self and learn all sorts of amazing facts about the history and evolution of the newest form of music. For the producers.. not that you'll ever read this!! Make a second film.. there's so much happening in dance culture today that there needs to be another chapter written covering 88-2000 there have been huge advances in our culture!",
         "This documentary film takes a look at the electronic music scene all over the globe. Loads of great music, picture material from big venues, parties and of course great interviews with experts like Derrick May, Frankie Bones, Squarepusher, Mixmaster Morris, Carl Craig etc etc. This documentary is huge, it covers the whole electronic music era from the beginning of 19th century. Essential!",
         "a great movie for electronic music lovers. the only complaints are not even complaints. such as, too short. i could have sat there for 5 hours. missing artists. klaus schulze, tangerine dream. ambient music lovers check out Baraka(1992).",
         "Being a fan of electronic music for several years now, I was surprised that a full scale documentary on the history of techno was produced. I got a chance to catch it at the Motor Lounge in Hamtramick and what I saw surprised me. This documentary is incredibly well done. It covers the history of electronica from its earliest origins in the 1950's to the modern day rave scene. The audio is fantastic and any music lover should appreciate the facts presented within the movie. Modulations covers most of the bases, including the various techno scenes across the world. They interview many artists and the man who started it all (inventing the Moog Synth). This is great stuff..... The audio and video are fantastic and I hope that they release this on DVD in the near future.",
         "If you are at all interested in electronic music - in just about any form, but especially techno/jungle/acid/dnb/house/etc. make sure you see this movie. \"Modulations\" is a brilliant little (73 minutes) film that is a perfect visual complement to the subject matter - including trippy graphics, beat-synched cinematography, thought-provoking interviews, live shots of wired-up ravers, and of course, a ripping soundtrack. Get your head together and check it out - you'll be glad you did.",
         "Pretty fine documentary. Whole thing concentrates almost exclusively on club-oriented electro-music, be House, Ambient, Illbient, Techno-Acid-Wash-Trance-Electro-Acoustic-Drumming or whatnot. I would've much preferred to see more variety included: Xenakis, Japanoise, etc. But then again there's only so much film that can be shot. Above all worth seeing again and again, if only for the wisdom of Genesis.",
         "Modulations attempts to cover too wide a subject area in too little time. Electronic music is an all-encompassing label that is applied to musicians as diverse as Can, John Cage, and the Prodigy(!!). There are great segments here with pioneers such as Cage, Robert Moog, Karl-Heinz Stockhausen, and Pierre Henry. There are too many segments of talent-short and ego-long knob twiddlers. And there's an inexcusable total lack of Kraftwerk or Cabaret Voltaire, the two groups who pioneered the crossover of 'electronica' from fringe to pop. And why no interview with Afrika Bambaata? He made it onto PBS' Rock n Roll Series, and he should have been talked to here. The lowpoint is reached when a German techno artist says that techno has absolutely no revolutionary potential....except for his own special brand of hardcore jungle!! Modulations is a fascinating but frustrating once over lightly look at this ever evolving music scene.",
         "Smash cuts! Hardcore coverage! Dozens of dizzying locations around the globe, get ready to enter the world of electronica and meet its makers and mad doctors, blending the sounds to breathe electric life into the air \u0096 injecting culture\u0085breeding a living being with a generation riding the tide of true music and electric emotion. From filmmaker Lara Lee comes this epic, documentary examining the electronic music scene on a global level. Spanning its history in culture from its earliest beginnings, get the music, slamming dancefloor footage, and interviews with all the exotic experts who exist within the electronic universe where all minds may enter!"
      ],
      "genres": [
         "Documentary",
         "Music"
      ],
      "productionCompanies": ["Caipirinha Productions"],
      "summaries": ["The evolution of electronic music and its many genres. How the wide range of styles and scenes formed through experimentations on sound formation."],
      "budget": 0
   },
   "movielensId": 2198,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-18",
      "dvdReleaseDate": "2003-02-18",
      "directors": ["Iara Lee"],
      "runtime": 75,
      "movieId": 2198,
      "title": "Modulations",
      "mpaa": "",
      "actors": [
         "Karlheinz Stockhausen",
         "Moby",
         "Afrika Bambaataa",
         "Derrick May",
         "Genesis P-Orridge"
      ],
      "imdbMovieId": "0139468",
      "originalTitle": "Modulations",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Less a documentary than a primer on all electronic music. Featuring interviews with nearly every major player past and present, as well as a few energetic live clips, Modulations delves into one of electronica's forgotten facets: the human element. Lee travels the globe from the American Midwest to Europe to Japan to try to express the appeal of music often dismissed as soulless. Modulations shows that behind even the most foreign or alien electronic composition lies a real human being, and Lee lets many of these Frankenstein-like creators express and expound upon their personal philosophies and tech-heavy theories.  Lee understands that a cultural movement as massive and diverse as dance music can't be contained.",
      "tmdbMovieId": 59138,
      "avgRating": 3.45775,
      "releaseYear": "1998",
      "numRatings": 71,
      "posterPath": "/gNQOhfUPPzWX1gIraRW60FbX0kH.jpg"
   }
}