{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gambling",
            "id": 395
         },
         {
            "name": "gambling debts",
            "id": 5305
         }
      ],
      "imdb_id": "tt0119892",
      "video": false,
      "title": "Phoenix",
      "recommendations": [
         25576,
         69007,
         40506,
         48017,
         20863,
         66566,
         44895,
         61418,
         136727,
         44181,
         39411,
         26861,
         21878,
         191094,
         33135,
         32029,
         63437,
         31922,
         28494,
         2095
      ],
      "backdrop_path": "/5W0fBGnTISJhZI7lgLgjmptJOqe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Collins",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c523",
               "name": "Ray Liotta",
               "profile_path": "/o4jJSH3sri9dSIJwsCgT4de1535.jpg",
               "id": 11477,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mike Henshaw",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c527",
               "name": "Anthony LaPaglia",
               "profile_path": "/22sOEc37TsxxcnIl1XmucuW3IDl.jpg",
               "id": 57829,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Leila",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c52b",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "James Nutter",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c52f",
               "name": "Daniel Baldwin",
               "profile_path": "/vDLkhz6EliUtYumpJdFTquUvdfp.jpg",
               "id": 24516,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Fred Shuster",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c533",
               "name": "Jeremy Piven",
               "profile_path": "/qtho4ZUcValnVvscTGgyWfUr4VP.jpg",
               "id": 12799,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Lt. Clyde Webber",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c537",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Louie",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c53b",
               "name": "Giancarlo Esposito",
               "profile_path": "/d39hOi5lTfqekjFK4JKKPeuGNdW.jpg",
               "id": 4808,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c53f",
               "name": "Brittany Murphy",
               "profile_path": "/jktbTmFE3TVaKUqPDWw8VZ5rXqc.jpg",
               "id": 328,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Katie Shuster",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c543",
               "name": "Kari Wuhrer",
               "profile_path": "/2WmKU8E0lMmdBcC7F9iLLz7S2Qc.jpg",
               "id": 56152,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Joey Schneider",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c547",
               "name": "Giovanni Ribisi",
               "profile_path": "/jvq2pimmpNdQj8o75Au9RKC7E1z.jpg",
               "id": 1771,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Chicago",
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c557",
               "name": "Tom Noonan",
               "profile_path": "/cpINV4Q8IeVgSLyKz9ldzzAGr5n.jpg",
               "id": 119232,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Esther",
               "gender": 1,
               "credit_id": "52fe4575c3a368484e05c55b",
               "name": "Kathryn Joosten",
               "profile_path": "/kkPEyfRYwrbSdQQwOwQo8qFTiKP.jpg",
               "id": 106935,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Dickerman",
               "gender": 2,
               "credit_id": "58cce908c3a36850e900771a",
               "name": "Royce D. Applegate",
               "profile_path": "/clLumMCdFDvaLa8wMR5L6WkP1u6.jpg",
               "id": 22251,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Waitress",
               "gender": 1,
               "credit_id": "58cce916c3a368508c007aa3",
               "name": "Tamara Clatterbuck",
               "profile_path": "/tDH8CQPqUJ54ralcDy8xJkxu1Fz.jpg",
               "id": 100961,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Cop",
               "gender": 2,
               "credit_id": "58cce924c3a36850c000701f",
               "name": "Al Sapienza",
               "profile_path": "/rWTWUwOcNj5SsLb9FS3dbseosWv.jpg",
               "id": 154917,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Anti-Abortionist",
               "gender": 2,
               "credit_id": "58cce945c3a3685104007887",
               "name": "Glenn Morshower",
               "profile_path": "/ighVr61WoYsMVGvKeRXvubI0AkF.jpg",
               "id": 12797,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Video Game Stripper",
               "gender": 1,
               "credit_id": "58cce9579251415a610085d4",
               "name": "Sandra Taylor",
               "profile_path": "/2PO8r6s8IgfzWHc2ajfDgdp95JR.jpg",
               "id": 32291,
               "order": 16
            },
            {
               "cast_id": 20,
               "character": "Burt",
               "gender": 2,
               "credit_id": "58cce9699251415a39008029",
               "name": "Peter Spellos",
               "profile_path": "/sj2YF20Rqe8uvS1QQajCV5bdaky.jpg",
               "id": 9659,
               "order": 17
            },
            {
               "cast_id": 21,
               "character": "Locksmith",
               "gender": 2,
               "credit_id": "58cce9759251415a74008337",
               "name": "Carmen Filpi",
               "profile_path": "/a1XRRqiUDBC4Wlg5fklVhfvnWLx.jpg",
               "id": 154073,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c54d",
               "name": "Danny Cannon",
               "profile_path": "/9E4Km6y1O0bK3dUSds3smzu20KI.jpg",
               "id": 33279,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4575c3a368484e05c553",
               "name": "Danny Cannon",
               "profile_path": "/9E4Km6y1O0bK3dUSds3smzu20KI.jpg",
               "id": 33279,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.758396,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28047,
      "vote_count": 17,
      "budget": 0,
      "overview": "Gambling fever -- along with a brutal bookie -- leads three crooked cops into a double-dealing scheme that lands them in hot water way over their heads.",
      "similar": [
         309242,
         8065,
         10220,
         8052,
         298,
         146238,
         36557,
         9029,
         1701,
         186,
         2034,
         104,
         161,
         75656,
         22947,
         265208,
         396371,
         18785,
         16538,
         44896
      ],
      "original_title": "Phoenix",
      "runtime": 107,
      "poster_path": "/enUCZk5FiHxhYmXTKla1UTN4nnl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-04",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "In this town, the heat can kill you.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Danny Cannon"],
      "runtime": 107,
      "synopsis": null,
      "writers": ["Eddie Richey"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119892/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTU2Mzk5MzU4MV5BMl5BanBnXkFtZTcwNDQ2NDgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ray Liotta, Anthony LaPaglia, Daniel Baldwin | See full cast and crew »"],
      "reviews": [
         "I was somewhat shocked at just how good this film was. I should not have been, the cast is outstanding! Moreover, when you have Ray Liotta in the lead role, you are going to be pretty good. However, this film goes way beyond pretty good and close to perfection. The Movie tells the story of four Phoenix detectives, each of which is somewhat less than perfect (to say the least). In fact, a couple of them are criminals (Anthony LaPaglia is great). The story centers around that of Ray Liotta's character, a hopeless gambler. However, to Liotta, gambling is somewhat of an honorable tradition (one carried down from his father). He speaks of gambling as if it was his religion. He bets on everything. He starts conversations with people he considers lucky, in attempts to get some kind of a hidden tip on a horse. He sees a cute little girl and asks her her name, she says Betsy. So he looks for a horse named Betsy. However, like he tells one of his partners, \"I don't gamble to make money.\" His partner's response, \"no s**t.\" The more bets Liotta makes, the more he loses. Pretty soon, he is in pretty heavy to a loan shark named Chicago (played brilliantly by Tom Noonan). When his fellow partners suggest arresting or killing the loan shark (that is starting to lean heavy on Liotta), Liotta is shocked, there is no honor in welshing on a bet. From here, we see the downward spiral of all people involved in the story. I mentioned the cast in this film and it is an incredible group. What is greater, is that each is given a real character to play, with unique flaws and traits. Each scene is wonderful to look at, visually. Be it a rainy night, a heist with animal masks, or a brutal Arizona desert. The dialog is sharp and very witty. The images are gritty and slick. Symbolism abounds in every scene. This is really a tremendous film! **** out of ****.",
         "This film was a complete surprise. One of those rarities that come out out of nowhere and knock your socks off without much effort. Danny Cannon, it's director must be given credit for bringing this story to the screen, or video, as probably was the case. Any film where Ray Liotta appears, is worth a look. Now, if one adds the great Anthony LaPaglia, one of the best actors around, it has to be outstanding. Mr. LaPaglia has never struck a wrong note in whatever I've seen him do. He shines here playing against type and almost stealing the film from Ray Liotta. The story about bad cops in Phoenix is presented with a total sense of honesty, no pun intended. There are a bunch of these guys in every police department in large cities. The director packs a lot of action into this movie. It will keep the viewer glued to the screen. In addition to Ray Liotta and Anthony LaPaglia, there are brief glances at Anjelica Houston, Brittany Murphy, Jeremy Piven, Giancarlo Esposito and others that make this film a delight for fans of thrillers. Either catch it on cable, or run to the video store and rent it. You won't regret it!",
         "Harry is a police officer - he is also a degenerate gambler in debt to bookie Chicago for $32K. That's basically the plot, it seems simple but it is enough to drive the film's core once it has been surrounded by plot twists, tension, strong performances, interesting characters and good dialogue. Hats off to Danny Cannon - he was the great British hope once after making Young Americans and going to the US he then messed up with Judge Dredd. But here he shows that he does have talent to lead a dark thriller successfully - albeit he is helped greatly by the plot and his actors. The film follows Harry and his 3 colleagues as they revolve around several loan sharks and bookies whilst also trying to have lives and relationships. The main focus is Harry's addiction to gambling in all areas of his life. There is also a subplot involving Angelica Huston which is meant to represent Harry's potential redemption, but this is not well developed and is secondary to the main story. The story eventually turns into a heist-gone-wrong movie but even then has enough twists to keep the interest. The main strength of the film lies in the actors that are assembled together here. Liotta plays the role well, making it possible to like this person but also making his gambling side believable - it's hard not to feel for him and his bad luck as the film progresses. Anthony Lapaglia, Daniel Baldwin, Jeremy Piven are all excellent for different reasons as his colleagues. Piven good as the cop drawn into things he doesn't want to do and Baldwin and Lapaglia are as solid as every in corrupt roles. Both Ribisi and Huston are capable of great performances but neither have a lot to work with here in terms of time or plot involvement. Giancarlo Esposito is as good as ever in a small role as Louie the loanshark - but then I've never seen him put in a bad performance, even in a bad film. Overall the plot is similar to many other crime thrillers out there. What makes this rise above the normal TV material is a dark atmosphere from Danny Cannon, a strong lead in Liotta with uniformly great support from the rest of the cast and tension an twists throughout.",
         "Once in a while you come along a movie that, even though it is already several years old, you have never heard of before. \"Phoenix\" is such a movie. The only reason why I gave it a try and taped it is because there is a famous actor in it who I usually like to see playing (Ray Liotta) and because I hoped that the story might be something nice (most of the time I like crime movies). And because I really didn't know what to expect from it, it's only good that I didn't see that cover photo first. That ugly thing doesn't really give a good impression of what this movie is like. When watching that picture, my first impression is that this will be a typical action flick, Stalone or Jean-Claude Vandamme style, while in reality that certainly isn't the case. \"Phoenix\" tells the story of Harry Collins, a cop whose life isn't exactly going all too well. He's a hopeless gambler who only loses a lot of money and never wins anything. But that's not how he sees it. He considers gambling not as something to make money with, he sees it as as an honorable tradition which he has inherited from his father. He gambles on anything he can possibly think of and he really sees a hidden tip in everything: the name of a girl, a conversation with some people who he considers to be lucky... Pretty soon he has a lot of debts with a loan shark named 'Chicago', which he can't possibly pay. When his colleagues suggest that they could arrest or even kill the man, he is shocked. There is no honor in doing such a thing, but from one thing comes another and soon Collins and his colleagues find themselves in a downward spiral of corruption, deceit, murder... A movie with Ray Liotta in it is always worth watching, no doubt about that. Even a movie that isn't that good can be saved by his appearance. But this movie didn't need to be saved at all. This was actually a very nice film with some well-developed characters and a nice storyline. I might even say that this entire movie was a big surprise to me, as it kept my attention from the first moment until the last. And not only Ray Liotta is worth mentioning. Anthony LaPaglia, Daniel Baldwin, Jeremy Piven,... all did a very nice job in this movie. Still, in the end I'm not surprised why so little people know this movie. OK, it has a cast with some famous people in it like Anjelica Huston, Jeremy Piven and Ray Liotta, but this is also the work of the same director who gave us movies like \"Judge Dredd\" and \"I Still Know What You Did Last Summer\". I'm really wondering what made that man decide to do this project in the first place and where he ever found so much excellent inspiration. Anyway, there is one thing that I'm absolutely sure of: I will definitely recommend it to everybody who wants to hear it. I give this movie at least a 7.5/10.",
         "Did you ever see one of those awful action thrillers or crime dramas (where, as Jon Stewart once pointed out, \"all the action takes place in a strip club\"), usually starring Mickey Rourke, Eric Roberts, Rutger Hauer, Michael Madsen, or some refugee from the Brat Pack, on late night cable? Well, \"Phoenix\" is the \"Chinatown\" of those movies. Which, in case you miss my meaning, means it's really quite good. This is a supremely fun film if you like (or hate but have seen) any of these B action flicks. It should be used in film schools when teaching this overlooked genre (\"Contemporary exploitation films,\" they'd probably call them.). This movie has a loan shark, a bookie, crooked cops, bagmen, a strip joint that figures prominently in the plot, a sultry siren in bed with everybody, a cleverly masked heist, a lucky fill-in-the-blank item, a burned out beauty with a sexy jailbait daughter, and a hero with a chance at redemption, if only he can keep from screwing everything up. This movie's got everything, and that's the point. Ray Liotta stars (in, for my money, the best performance of his career) and, although one of the aforementioned crooked cops, has an incorruptible sense of honor. For example, he has accumulated a substantial gambling debt, but won't let anyone else pay it off or make it go away because he refuses to \"welsh.\" It's a piece of advice given to him by his late gambler father, you'll probably not be surprised to learn. The plot is, to pay off the sizable debt, Liotta and three of his fellow crooked cops mastermind a heist in a strip club where everything goes wrong while they wear funny animal masks. \"But,\" as I often tell people, \"it's not like it sounds.\" If you're still not convinced, the fact that Anjelica Huston is a part of this film's great cast should tell you something. Also, watch out for the amazing Tom Noonan as a lisping bookie and a scene with Giovanni Ribisi where you can see the conclusion coming but is still satisfying even if you've already figured it out because of Liotta's intense performance. 3 out of 4 stars on the fun scale. (Probably less on the quality scale.)",
         "I caught this on HBO and was totally taken with it. I don't remember it ever playing at the theater and that is a shame. As far as cops and robber movies go, this one is outstanding. The movie has a gritty and dirty sense about it. One really senses that they are involved in these sordid tales that take place in the arid Arizona wasteland that is Phoenix. Although this is a movie with no real good guys, Ray Liotta is a pretty good guy. The only problem with Liotta, is that he cannot stop gambling and this keeps him in trouble with a local shark, who might be willing to forgive a debt for a favor. Did I mention that Liotta is a cop? Of course, Liotta has interesting partners that work with him, all more dirty and corrupt than himself. Great character actors assembled for this one, but Liotta is the shining star here. His witty observations and philosophies on life serve as great filler as we wait for the next action to take place. Through out the movie we see Liotta break a number of laws, however the one thing he will not corrupt is what he holds sacred to himself, gambling. Just watching these cops attempting to dig out of the hot messes they create for themselves is worth the price of this rental. However, many more people will want to see it again, as they root for their hapless Liotta to get out of the mess he is in. Very good movie!",
         "I, too, had never heard of this movie. I never saw it advertised, and I never saw it at theaters. I happened to stumble on this on cable one night. Man, what an excellent movie. A dark, brooding movie of desperation and corruption. Ray Liotta is as good as I've ever seen him, and Anthony LaPaglia nearly steals the movie with his portrayal of an evil, brutal cop, whom you will hope and pray you never cross paths with. Just an excellent little movie that, it appears, not too many people knew about. Very well done!",
         "Sometimes I question why one movie gets theatrical distribution while another does not. To be fair, I think things generally swing the right way. Movies that call video their home do it for sometimes a much deserved reason: they stink. This is not the case with Phoenix however. It's a breath of fresh air to take a chance on a direct-to-video quickie and have it turn out this good. The story is tight and look at all the recognizable faces in the cast. That helps me out. The whole police officer-gambling junky angle is different - Liotta as the lead carries it off well and Phoenix is just all around better than most cop boilers I've seen in the last six months. It sure ain't lacking in clichés of the genre, but that has come to be expected. Phoenix is just a well filmed, nicely acted piece of work from director Danny Cannon who makes amends for the theatrical bomb Judge Dredd. Worth a look on a slow night or for Liotta fans.",
         "This superb thriller features an array of colourful characters and some beautiful cinematography which not only looks great but also complements the rather menacing atmosphere of the piece. The action takes place in an environment in which everyone is corrupt and the threat of violence is ever present. Harry Collins (Ray Liotta) is a police detective with a gambling addiction whose work brings him into contact with violent criminals and a group of colleagues who are all thoroughly corrupt and untrustworthy. In amongst all this moral bankruptcy, Harry is something of an exception as he, at least, has some (albeit unorthodox) ethical standards which govern his conduct. His inability to control his compulsion to gamble, however, eventually gets him into a tight spot when his losses increase to $32,000 and local gangster Chicago (Tom Nonnam) wants to be repaid promptly. Harry's desperation grows as he knows he'll be killed if he's unable to pay his debt but then he's presented with two opportunities to resolve his problem. Chicago promises to cancel his debt if he kills a young man called Joey (Giovanni Ribisi) who's in police custody because Chicago fears that he might give the police information about his operations in order to get a lighter sentence. Harry isn't prepared to do what Chicago wants and also refuses an offer from his unscrupulous fellow detective Mike Henshaw (Anthony LaPaglia), who's willing to kill Chicago. In order to extricate himself from the fix he's in, Harry devises a plan to relieve a nightclub owner called Louie (Giancarlo Esposito) of the considerable amount of cash that he knows he regularly keeps in his office safe. Then, with the assistance of three of his colleagues, he goes ahead with the robbery so that he can pay off Chicago and pursue his relationship with the empathetic barmaid Leila (Anjelica Huston) who he thinks provides him with his best opportunity for a better future. \"Phoenix\" has a great soundtrack, some entertaining dialogue and well rounded characters but it's the quality of the acting that's most impressive. Harry Collins is a very troubled and psychologically complex man and Ray Liotta's portrayal of him is extremely powerful. Anthony LaPaglia is tremendous as the completely amoral Henshaw and Anjelica Huston shows the rather resigned manner and cautious nature of someone who carries the emotional scars of the past. The performances of the supporting cast are also strong and make their characters very memorable.",
         "Many films try to examine the corruption of the human character, but only a very few succeed. Phoenix is one of those few. Writer Eddie Richey truly understands emotion. It's not a hero vs villain gratuitous action flick like the god awful Matrix series. The story's conflict is produced by the protagonist himself. And Ray Liotta is amazing. James L. Carter's cinematography is beautiful and Graeme Revell's score is moving. Director Danny Cannon's resume is embarrassing, but it's redeemed by this masterpiece. Phoenix is the very essence of human drama."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Trimark Pictures",
         "Lakeshore Entertainment",
         "Graham / Nevinny Productions"
      ],
      "summaries": [
         "In Phoenix, Arizona, all is not well at the local police station as some of the colleagues are not good of heart. Superstitious cop Harry Collins is on the take. He a compulsive gambler who is forced to plan a heist with fellow cops Mike, James, and Fred to rip off local pimp and overall bad guy, Louie, to pay off gambling debts run up with \"bookie\" Chicago.",
         "A cop (Liotta) with a gambling addiction plots a theft from the bookies who are putting pressure on him to pay off or else."
      ],
      "budget": 0
   },
   "movielensId": 2199,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-04",
      "dvdReleaseDate": "1998-11-24",
      "directors": ["Danny Cannon"],
      "runtime": 107,
      "movieId": 2199,
      "title": "Phoenix",
      "mpaa": "",
      "actors": [
         "Ray Liotta",
         "Anthony LaPaglia",
         "Anjelica Huston",
         "Daniel Baldwin",
         "Jeremy Piven",
         "Xander Berkeley",
         "Giancarlo Esposito",
         "Brittany Murphy",
         "Kari Wuhrer",
         "Giovanni Ribisi",
         "Tom Noonan",
         "Kathryn Joosten",
         "Royce D. Applegate",
         "Tamara Clatterbuck",
         "Al Sapienza",
         "Glenn Morshower",
         "Sandra Taylor",
         "Peter Spellos",
         "Carmen Filpi"
      ],
      "imdbMovieId": "0119892",
      "originalTitle": "Phoenix",
      "genres": [
         "Drama",
         "Thriller",
         "Crime",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Gambling fever -- along with a brutal bookie -- leads three crooked cops into a double-dealing scheme that lands them in hot water way over their heads.",
      "tmdbMovieId": 28047,
      "avgRating": 3.17614,
      "releaseYear": "1998",
      "numRatings": 88,
      "posterPath": "/enUCZk5FiHxhYmXTKla1UTN4nnl.jpg"
   }
}