{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "penitentiary",
            "id": 3310
         },
         {
            "name": "class society",
            "id": 4034
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "run away",
            "id": 7028
         },
         {
            "name": "alcoholism",
            "id": 7464
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0042004",
      "video": false,
      "title": "Under Capricorn",
      "recommendations": [
         44098,
         63225,
         2761,
         31995,
         8208,
         52713,
         36102,
         68440,
         685,
         45213,
         44626,
         142373,
         142374,
         35832,
         15007,
         59087,
         36056,
         24197,
         2370,
         52782
      ],
      "backdrop_path": "/afyO3DOXyiluXqecGHSjVwvZewM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lady Henrietta Flusky",
               "gender": 1,
               "credit_id": "52fe43b0c3a36847f8067ed1",
               "name": "Ingrid Bergman",
               "profile_path": "/jXEE0P6705JbMAJ2nwtHjmqkd5F.jpg",
               "id": 4111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sam Flusky",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067ed5",
               "name": "Joseph Cotten",
               "profile_path": "/bTUTrTnzacCQV4F0rs1xH4QaETf.jpg",
               "id": 7664,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Charles Adare",
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067ed9",
               "name": "Michael Wilding",
               "profile_path": "/xZ2EIXq0pAW2tbgIhVdBi1l1uUm.jpg",
               "id": 20392,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Milly",
               "gender": 1,
               "credit_id": "52fe43b0c3a36847f8067f07",
               "name": "Margaret Leighton",
               "profile_path": "/cONUWV4s2sYTO9Nx1PSZf8BMJ6M.jpg",
               "id": 80255,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "The Governor",
               "gender": 2,
               "credit_id": "55e0af589251416f960005c5",
               "name": "Cecil Parker",
               "profile_path": "/62aOulE64RjUEDWAVqJeWMS9JM3.jpg",
               "id": 14300,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Mr. Corrigan",
               "gender": 2,
               "credit_id": "55e0af679251416f9900060f",
               "name": "Denis O'Dea",
               "profile_path": "/99k96REtKxhOxJW3LNMLbVLmiUd.jpg",
               "id": 85410,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Winter",
               "gender": 2,
               "credit_id": "55e0af749251416f880006a1",
               "name": "Jack Watling",
               "profile_path": "/d6g1UNXikvpKxXsPB69UVgnzsUg.jpg",
               "id": 123905,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "The Coachman",
               "gender": 2,
               "credit_id": "55e0af87c3a36805da00061b",
               "name": "Harcourt Williams",
               "profile_path": "/cpPBPKse0jWYqWTlLXWYRfatQ4j.jpg",
               "id": 12000,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Mr. Potter",
               "gender": 0,
               "credit_id": "55e0af9ac3a36805c9000610",
               "name": "John Ruddock",
               "profile_path": null,
               "id": 123902,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Mr. Banks",
               "gender": 0,
               "credit_id": "55e0afaac3a36805da000624",
               "name": "Bill Shine",
               "profile_path": null,
               "id": 115608,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "The Reverend Smiley",
               "gender": 0,
               "credit_id": "55e0afd49251416f8e000651",
               "name": "Victor Lucas",
               "profile_path": null,
               "id": 1243112,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Man at Governor's Reception",
               "gender": 2,
               "credit_id": "55e0aff89251416f940005cc",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067edf",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067ee5",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067eeb",
               "name": "Jack Cardiff",
               "profile_path": "/3WSJNaLdjX2ToZ3QrNhkpBS9fe6.jpg",
               "id": 6603,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067ef1",
               "name": "Richard Addinsell",
               "profile_path": null,
               "id": 37467,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067ef7",
               "name": "Bert Bates",
               "profile_path": null,
               "id": 10185,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b0c3a36847f8067efd",
               "name": "Thomas N. Morahan",
               "profile_path": null,
               "id": 37468,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b0c3a36847f8067f03",
               "name": "Sidney Bernstein",
               "profile_path": null,
               "id": 17666,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067f0d",
               "name": "John Colton",
               "profile_path": null,
               "id": 128436,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b0c3a36847f8067f13",
               "name": "Margaret Linden",
               "profile_path": null,
               "id": 1172623,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b0c3a36847f8067f19",
               "name": "Helen Simpson",
               "profile_path": null,
               "id": 108626,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067f1f",
               "name": "Hume Cronyn",
               "profile_path": "/zcEvBQlYHT8QzfTe7YIGHsjz0oY.jpg",
               "id": 7668,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b0c3a36847f8067f25",
               "name": "James Bridie",
               "profile_path": null,
               "id": 131230,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.921362,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 4175,
      "vote_count": 32,
      "budget": 0,
      "overview": "In 1831, Irishman Charles Adare travels to Australia to start a new life with the help of his cousin who has just been appointed governor. When he arrives he meets powerful landowner and ex-convict Sam Flusky, who wants to do a business deal with him. Whilst attending a dinner party at Flusky's house, Charles meets Flusky's wife Henrietta who he had known as a child back in Ireland. Henrietta is an alcoholic and seems to be on the verge of madness.",
      "similar": [
         637,
         1374,
         1381,
         334,
         44264,
         858,
         101,
         164,
         616,
         1124,
         745,
         5123,
         2289,
         1562,
         335,
         8960,
         425,
         559,
         675,
         744
      ],
      "original_title": "Under Capricorn",
      "runtime": 108,
      "poster_path": "/gBRR6vYZNyXij4Cdf6khIQPS68q.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Transatlantic Pictures",
            "id": 1554,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1949-09-08",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Mystery, murder and passion from the master of suspense!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 111,
      "synopsis": "It is 1831. British King William IV has appointed a new governor ( Cecil Parker) for New South Wales in Australia. In full dress military redcoat and cocked hat at an arrival ceremony, he gives a brief speech that is marred by disrespectful comments from some rowdies in the crowd. A younger cousin of the governor, Charles Adare ( Michael Wilding) has traveled with him from Ireland. Even before the end of the speech, Charles is approached by a local banker who offers his services. Charles admits he doesn't have a penny, yet hopes to make his fortune in Sydney. The banker says he can help anyway, so Charles agrees to meet him the next day. During the next day's appointment, a powerful local landowner named Sam Flusky ( Joseph Cotten) enters the bank and the banker points him out to Charles as an example of what fortunes might be made in Australia even with a convict background. Charles asks to be introduced, as he seems to recall the last name. The banker warns him that in Australia it is not acceptable manners to ask about a person's past or convict status. Upon introduction, Flusky recognizes the name Adare, and almost immediately proposes a business deal requiring no capital when he learns that Charles is a cousin of the Governor. Flusky offers Charles a temporary loan to acquire a certain land parcel that Flusky wants but cannot purchase directly because of legal limits on land grant applications, and Charles agrees to help with the promise of a huge quick profit. Charles later tells his uncle about the plan. But when the uncle wants to know about Flusky, Attorney General Corrigan ( Denis O'Dea) strongly discourages any deals, saying that Flusky is now acting within the law but is a very unsavory character with a criminal past. The Governor then orders Charles to avoid Flusky. Since he wants the easy money, Charles disobeys the uncle and accepts an invitation to dine at Flusky's home. He comes to dinner at Flusky's large and elegant home in a carriage. The driver comments on Flusky's low social prestige despite his wealth and translates a motto displayed at the entrance: \"Minyago Yugilla?\" means \"Why Weepest Thou?\" Charles walks around the house before ringing the entrance bell, overhears and witnesses things that tell him that Flusky is using him to climb in social standing because he is the Governor's relative, and also that Milly the housekeeper ( Margaret Leighton) is a willful tyrant who keeps the kitchen staff under control with a whip. As other guests arrive, including Attorney General Corrigan, they are all male, as all wives invited give an excuse not to attend. And, as reported by Milly, Sam's wife is not well, and also will not attend. Halfway through the meal, Sam's wife ( Ingrid Bergman) comes down the stairs in bare feet and dressed in something that is more like a nightgown than a dinner dress. She welcomes the gentlemen, and walks unsteadily to sit at the head of the table. Charles recognizes Mrs. Flusky as Lady Henrietta, an aristocratic neighbor he remembers as a child growing up in Ireland. \"Hattie\" was a friend of Charles's sister. He sits next to Hattie, she recognizes him, and is happy to recall events of their past. But it appears Hattie is an alcoholic and on the verge of madness. After a short while Hattie decides to go upstairs to her room, but on arriving there, she utters a terrified scream calling for Charles. Charles rushes up and finds Hattie trembling outside the door and talking about the horrible thing on the bed. Charles enters the bedroom, finds nothing, yet shoots into the fireplace and comes out comforting Hattie and saying nothing can hurt her any more. Af the guests leave, Sam expresses his displeasure at the guests' wives who snubbed his invitation, and his gratitude to Charles because he saw that Hattie had been genuinely pleased and interested to have seen him. Sam encourages Charles to come again hopes that the younger man's friendship will be able to cheer up his wife. In Sam's view, Hattie's condition is the result of isolation and of being snubbed by the social establishment, and the fact that they became different people in a different environment after the years of his imprisonment. They're now an unhappy couple who are shunned by established society. Charles agrees to try to help her regain a sense of stability. Meantime, Milly is seen giving alcohol to Hattie and spying suspiciously on Charles. Charles recalls the details of the scandal back in Ireland: Lady Henrietta, of the landed gentry and Sam Flusky, a groom on her estate eloped to England. They were pursued by her brother, and when they were found, Flusky shot him dead. As the brother was armed and had also fired a shot, Flusky was not hung but taken to Australia. Lady Henrietta followed him to Australia and waited for his seven year term to end. When Sam was released they found they had much changed during those years, and the marriage was not happy. Sam concentrated on becoming rich and being able to afford material goods for Hattie, but it wasn't enough, Hattie started to drink and lost interest in everything. In the following years, the relationship with Sam had not recovered, and had been made worse by Henrietta's increasing alcoholism. Meantime the household is run by Milly. who keeps it functioning, and keeps Lady Henrietta under control. Charles insists on completing the land deal with Flusky. This angers his cousin the governor, who expels him. As Charles has as yet no money, he turns to Sam, who invites him to move in and try to cheer up and rehabilitate Hattie, getting her to become interested in horseback riding, in clothes, and life itself. He moves in, and slowly revives the self-reliant woman that Hattie was once. One of his first successes is to convince Hattie to look at her own reflection, as in a mirror, for the first time in years. But Charles' efforts to rehabilitate Hattie conflict with Milly's aspirations of control. Milly keeps throwing up various snags to upset the recovery. Charles begins to notice this, but not Sam. At one point, Hattie becomes confident enough to try to run her own household and kitchen without Milly. However, Milly has undermined Hattie's authority with the kitchen staff. The kitchen help, used to Milly's control, disobeys, and Hattie realizes that she has no say in her own house. She locks herself in her bedroom and refuses to come out. Charles, encouraged by Sam, enters her bedroom through a balcony and convinces Hattie not to give up. When Milly is called to the bedroom to help the mistress undress for bed, she knocks and because the door is locked and Charles is there she accuses them to be in a physical relationship, despite the fact that Sam had been standing below outside and probably was aware of everything that went on in that room. In desperation, Milly arranges to expose Hattie's hidden collection of empty wine bottles from the bedroom to humiliate her in front of the servants. This last trick backfires, Milly threatens to resign and leave, and, to her surprise, she is ousted from the house. Once Milly is ousted, Hattie takes real control of the kitchen, and her recovery proceeds ever faster. One day, Charles brings in an invitation to the Governors ball, addressed to Sam and Hattie. A dress is ordered, Hattie dresses up beautifully, but at the last minute Sam refuses to go and insists that Charles escort Hattie in his place. He is feeling rejected because he bought a spectacular ruby necklace that he intends to give to Hattie, but before he gives it, Hattie and Charles comment that ruby color isnt the best match for the coloring of the dress she is wearing. At the ball, Hattie is stunning and catches the Governor's eye. Before he realizes who she is, he shows her great deference and admiration. Meantime, the reception staff has identified her invitation as a forgery. But the governor insists that she stay, including Charles, whom he had ordered expelled from the ball shortly before. Right after Hattie and Charles leave for the ball, Milly, approaches Sam at his home, and asks to be taken back. It is clear that she is in love with Sam and wants to replace Hattie. Sam listens to her long plea in a speech that insinuates in all conceivable ways that Hattie is either having an affair with Charles or in any case is humiliating Sam by appearing in public with Charles instead of her husband or failing that, that everyone will think they are in love and thus humiliate Sam even more and the results could be socially disastrous. She also works in that Charles and Hattie are of a different social class from Sam, that they have views and conventions that allow them to do things that would be considered shameful for ordinary, non-aristocratic people. At first Sam does not react, since, after all, Charles is substantially younger than Hattie, and anyway his demeanor throughout has been that of a male who is not interested in women, much too interested in clothing, and always impeccably dressed. But Milly eventually manages to make Sam enraged about the situation. Sam goes to the ball, makes a scene, humiliates Hattie, who returns home upset and weeping. Charles follows Hattie home and attempts to calm her. Hattie tearfully confesses to Charles how she deeply loves and is honor bound to Sam, because it was she who shot her own brother, not Sam, and Sam took the blame to save her from prison. Sam returns to the house, demands that Charles leave for good. Charles takes a horse but regretfully the horse stumbles and breaks a leg, forcing him to return. Sam gets a gun, kills the horse, and as he re-enters the house, in a combination of anger and accident, Charles is shot. Sam is immediately incarcerated, as his convict past demands immediate jail for any violent offense. Hattie, in an attempt to save Sam, confesses to having shot her brother, the crime that led to Sam's original conviction. But such a confession brings complications, in that Sam would be freed only if Hattie were sent back for trial. They are in a real dilemma: If Sam corroborates Hattie's confession, he goes free and she goes to jail. If he does not corroborate her confession, he goes to prison for good. The Attorney General is not being helpful, since the governor wants to jail somebody for having shot his cousin. Corrigan gives Sam twenty four hours to make up his mind about what his story is. Meantime, Milly, seeing her chances to get Sam slipping away, attempts to poison Hattie. She is discovered in her plot, found to have planted a shrunken head at the bed to frighten Hattie from time to time, and ousted. Meantime Charles has recovered from the wound, and, at the critical moment, reappears to vouch that he was shot in a true accident and not in a violent act by Sam. Charles is put back on a ship to return to Ireland and is waved goodbye by the now happy Sam and Hattie.",
      "writers": [
         "John Colton",
         "Margaret Linden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042004/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjQxMTY0ODc0OF5BMl5BanBnXkFtZTYwMzU5NzM5._V1._CR18,96,256,365_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ingrid Bergman, Joseph Cotten, Michael Wilding | See full cast and crew »"],
      "reviews": [
         "It's a real shame (and also rather difficult to believe) that this film is so little-known and difficult to view. Even though it was directed by the famous Alfred Hitchcock (in my opinion, the most brilliant film director who ever lived), it has too often been dismissed as one of his \"lesser works.\" To each his own, I suppose, but _Under Capricorn_ boasts some of the most beautiful photography and eloquent, literate dialogue to be found in any Hitchcock film. Although the plot and structure of the film are familiar (the quintessential love triangle, ala _Wuthering Heights_), Hitchcock's treatment raises it above the ordinary. The costumes and sets are actually quite lavish, and pay particular attention to the unique musical score! Hitchcock's experiments with the \"ten-minute take\" (with which he experimented in his previous film, _Rope_) also add to the film's interest. The film is not, of course, an artistic triumph for Hitchcock alone. Ingrid Bergman and Joseph Cotten (to name only two) are stars of the caliber that one just doesn't see anymore, and they give worthy performances. Casting Ingrid Bergman as an Irish noblewoman is, of course, rather bizarre casting against type, but this great actress makes it work. Joseph Cotten possesses the rougher qualities that his part demands, but his performance also elicits sympathy from the viewer (such as the scene where he is going to present his wife with a collar of rubies but then decides to hide his gift when she and Charles Adair comment that it wouldn't go with her gown). The other actors, mostly little-known to American audiences, fill their roles well more than adequately and the very fact that they are unfamiliar makes them easier for the viewer to see as the characters they play rather than as \"stars.\" All in all, _Under Capricorn_ is an underrated masterpiece that is surely one of the best \"costume\" pictures of the 1940s. It is not for anyone seeking vicarious thrills or shocks, but for discriminating viewers who demand a coherent storyline, color photography that is aesthetically pleasing, literate dialogue and interesting casting, _Under Capricorn_ will fill the bill. I recommend it enthusiastically!",
         "With a great director, a good cast, and a relatively interesting premise, it's surprising that this doesn't work better than it does. The Australian setting has potential, as does Joseph Cotten's character and the tangle of relationships in his household. But, despite some good scenes, it never really comes together, and even when things start to happen, it never feels as if it has hit its stride. There's little fault to be found with the settings, which are convincing enough. Some of the characters never really come to life, but there is still an interesting mix of them. The pace is one area that definitely could have been improved, and the pre-occupation with the long takes certainly doesn't help at all. The technique worked very well in Hitchcock's \"Rope\", because it meshed with the setting and the subject matter. It doesn't fit so well here in \"Under Capricorn\", and it often dilutes the suspense rather than increasing it. By no means is it a total clinker - the story does have some interesting parts, and with a different approach it could have been suspenseful, even memorable. Hitchcock's technical skill is still present in many respects, and even Hitchcock's lesser achievements are still worth seeing. The movie's overly-polished feel is consistent with the approach that was chosen. It's at least one case where the more familiar, less affected Hitchcock style would have resulted in a much better film.",
         "If your approach to reviewing this movie is to compare it with Hitchcock's usual style, Under Capricorn will surely not compare. If, however, you can suspend your expectations and view it with an open eye and mind, you might see that, in its own right, it is an excellent film of the type I refer to as the \"Victorian soap opera.\" Being an aficionado of this \"genre\", perhaps I'm biased; but I enjoyed immensely the leisurely pace, extended dialog (which unlike other reviewers, I found to be intelligent, graceful, and poetic). I found it to be gently suspenseful, never really being sure who would get the girl in the end, or even who might survive to the end. Joseph Cotton was appealing, even though his character throughout much of the movie seemed to be villainous, and his reasons for being that way were quite apparent by the end of the film. My suspension of disbelief centered around Bergman's casting as an Irish aristocrat: once in awhile she managed to say a word that had an Irish flavor, but mostly she just sounded Swedish. However, that did not detract at all from her usual thoughtful performance. Michael Wilding irritated me a little with his foppish ways, yet even he managed to come off as a human being with faults and virtues...just like the rest of us. Leighton was superb and she, like Cotton, seemed to be a treacherous yet sympathetic character. I think it was the portrayals of complicated people with no one being painted as totally good or bad, the nuanced characterizations that I found so artistic yet real. If you approach this movie without preconceptions, you might be drawn into it and appreciate Hitchcock's genius in an entirely different way.",
         "While certainly uncharacteristic of Hitchcock's American films this film still has the Master's unmistakable imprint. Joseph Cotton is excellent in his role as a common man who resents the upper class of which he can never be a part. The rest of the actors do a fine job including Ingrid Bergman's turn as Cotton's drunk half mad wife. Perhaps the best and most interesting aspect of the film is the gorgeous Technicolor cinematography by Jack Cardiff. Cardiff who is probably best known for his work with Powell and Pressburger does a great job bringing the rich color of this period piece to the screen. The camera work is also characteristically Hitchcock with many long traveling shots with wonderfully complex compositions. The pace is slow and lacking suspense, but the characters and the situations are interesting and make the film work despite the pacing problems. Certainly not one of Hitchcock's strongest films, but definitely worth watching.",
         "Transatlantic Pictures (Hitchcock's own production company) must've rubbed their hands with glee when they decided to co-produce this film with Warner Bros. For not only did they have the world's leading female actress (Ingrid Bergman) in their film, they also had gifted stars Joseph Cotten, Michael Wilding and Margaret Leighton lending support, and naturally the great Alfred Hitchcock at the helm. If ever a film was sure to be a critical and commercial hit, Under Capricorn was it. Such a shame, then, that Under Capricorn emerged as the worst film of Hitchcock's career. The critics roasted it, the public ignored it, and Transatlantic Pictures went bust. Irish aristocratic lady Henrietta (Bergman) elopes to Australia with her cruel lover Sam Flusky (Cotten). She gradually develops the illness dipsomania, what with her lover controlling her every move with over-bearing authority and their maid Milly (Leighton) plying her with drink. A childhood friend of Henrietta's, Charles Adare (Wilding) turns up and, realising pretty quickly that all is not well, tries to help her regain a sense of stability. The film is a laughably overwrought costume melodrama, totally ill-suited to Hitchcock's playful, suspenseful directing style. A year previously, the director had made the thriller Rope, using experimental ten minute takes, and in this film he still seems to be in the habit of allowing scenes to go on and on (maybe not ten minutes, but some bits last for six or seven minutes without a single cut). Frequently, the film feels tediously unspooled as a result. The actors seem to over-act much of the time, but it's hard to see how they could've avoided this as much of the screenplay requires them to handle some horribly overripe dialogue and reactions. Under Capricorn is undoubtedly the least interesting film that Hitchcock ever made. Those who try to persuade us that it is a misunderstood masterpiece are, I'm sorry to report, well and truly kidding themselves.",
         "Under Capricorn, is along with Notorious, I Confess and Rear Window Hitchcocks greatest film. Under Capricorn has been greatly under appreciated mainly because it was a commercial failure and because Hitchcock talked the movie down saying that he only made it for Ingrid Bergman. The truth is that he had been working on getting it made for years, would he really put his production company under pressure on it's second project with a $2.5 million budget if he didn't care for it. Maybe part of its mixed reputation is because it's not a thriller, being a character driven movie, at just under two hours long its not you're typical Hitchcock movie. But the story is revealed in a wonderful way, with such a great romantic feeling that I'm amazed that it's not more highly thought off by the general public. If there ever was a more beautifully film movie I've never seen it. Ingrid Bergman is as she always is, brilliant; her 10-minuet scene in which she tells wilding the whole story of what happened is pure magic. Another great moment is when Bergman has locked herself in her room and wilding comes through her window. Joseph Cotton is also on top form. Really all that I've got left to say is if you haven't yet seen this film and you get the chance to don't waste that chance. I wish it would come out on DVD or video I've nearly worn my copy out.",
         "This is one of Hitchcock's very best films. 1831: Irishman Charles Adare arrives in Australia to make his fortune, and soon hooks up with Sam Flusky, a wealthy landowner with a shady past and a business proposition. Ignoring the orders of his cousin, a local Governor, Charles continues to associate with Flusky and his alcoholic wife Henrietta, who was a friend of Charles' sister many years ago back in Ireland. The long takes the film is composed of are often masterful. Whereas his previous film Rope felt like a gimmicky experiment (albeit a successful one), here the technique is perfected, and actually serves a purpose. It widens the scope to allow the actors room to deliver fine performances, and to exploit the lavish sets. It also serves to narrow the scope, either to focus attention or withhold crucial information until the last moment (it's especially effective at these two). This focusing/concealing also adds to the sense of Bergman's isolation and entrapment in her environment, and allows for some of the film's best shots. I'm not a fan of Jack Cardiff, but his colour cinematography is considerably less jarring here than in his Powell-Pressburger outings, and although it does take a while to adjust the eyes, it's perfectly suited to the mood and setting. Ingrid Bergman delivers what I consider to be her best performance. Henrietta is frail and very vulnerable - a pathetic creature. Yet the strength and dignity that she once possessed is glimpsed at the outset, and gradually comes to the fore without ever completely displacing that vulnerability. Joseph Cotten likewise does an excellent job. His crippling inferiority complex dictates everything he does, and it's where the film gleans much of its drama. In his own way he's equally as pathetic as Henrietta; trapped in a different kind of mental prison. Sometimes he's unaware of his cruelty, believing himself to be doing the right thing; at others it's as if he can't help himself. He's a man who constantly tries to do good things, yet at every turn he's thwarted either by his own secret past, or his fear of that past. For a man so ostensibly powerful he's easy to knock down, and his reaction to these setbacks just reinforces his own negative perception of himself. This conflict is written on his every gesture and expression. Michael Wilding's performance as Charles is less technically brilliant, but as the carefree, opportunistic cad who sees in Henrietta the chance to do an act of great kindness he's wonderful. There is great humanity in all three leads, but it's most overt and infectious in Wilding.",
         "In 1831, the new Governor (Cecil Parker) arrives in Sydney, Australia, with his noble but broken Irish cousin Charles Adare (Michael Wilding). On the next morning, Charles unsuccessfully goes to the local bank expecting to raise money to start a business and he meets the powerful landowner Sam Flusky (Joseph Cotton), an ex-convict that has raised a fortune in the colony. Sam proposes a business with lands with him and invites Charles to have dinner with him at his farm. Charles learns that Sam is not accepted by the local society but he goes to the dinner party, where he meets Sam's wife Henrietta Flusky (Ingrid Bergman), an old acquaintance of his childhood in Ireland. Sooner Charles discovers that Henrietta is alcoholic and a totally unstable woman controlled by the housekeeper Milly (Margaret Leighton), and Sam was the groom of her family in Ireland. They had fallen in love with each other and Henrietta elopes with Sam. However, her brother hunts them and Sam kills him and is deported to Australia. Charles stays in Sam's farm to help Henrietta and sooner he falls in love with her. Meanwhile Sam is manipulated by Milly and his jealousy gets him into trouble and discloses dark secrets from his past with Henrietta. \"Under Capricorn\" is a melodramatic romance by Alfred Hitchcock set in Australia in 1831, in the period of colonization of this great nation by convicts from the United Kingdom. The genre is unusual in the career of the master of suspense, but supported by magnificent cinematography and cast, highlighting Ingrid Bergman, Joseph Cotton, Michael Wilding and Margaret Leighton in a small but very important role. This film is not among my favorite Hitchcock's film and could be shorter. However it is worthwhile watching it to see some aspects to the colonization of Australia. My vote is six. Title (Brazil): \"Sob o Signo de Capricórnio\" (\"Under the Capricorn Sign\")",
         "Soon after this film began, it was obvious why this is one of the least famous of Hitchcock's films of the era. First, there really isn't any mystery or suspense--it's just a costume drama. Second, and I am surprised no one else seemed to pick up on this, but the film looked ugly despite the nice costumes and sets. This is because it looks like everything was shot in a sound stage--even the outdoor shots. In addition, the matte paintings are among the least realistic and ugly I have ever seen. It just too me out of the mood to see sloppy and flat paintings which were supposed to be mansions. The film is set in 1831 in the colony of Australia. Oddly, the film stars an American (Joseph Cotton), a Swede (Ingrid Bergman) and an Englishman who plays an Irishman (Michael Wilding). Wilding is a poor relative of the new Governor and is looking for a way to earn his fortune in this new land. He meets up with the brooding Cotton--who is immensely wealthy and an ex-convict (of course, MOST of Australia was settled by convicts during this period). But, when he goes to dinner at Cotton's home, he sees that he knows the man's wife (Bergman). Sadly, she is an alcoholic--and a pathetic one at that. So, Wilding makes it his job to help rehabilitate her--and obviously falls for her in the process. Standing in the way is the contemptible Milly--the housekeeper who does a great job of keeping house but also seems to enjoy keeping the mistress of the house drunk and ineffectual. She is a viper--and much like the crazed housekeeper in \"Rebecca\". In addition, the husband is a deeply screwed up man--and this becomes obvious the more his wife tries to regain normality. In other words, he and the housekeeper both seem to be working very hard to keep her an emotional invalid. This is a pretty dull and ponderous film from start to finish. While it could have been interesting, oddly it wasn't. Intense music and great twists, signs of Hitchcock, are strangely absent in this slow, slow, slow film. It just lumbers along to its conclusion. Truly a disappointment and indifferently made --and you just can't believe a director as talented as Hitchcock could make such an uninspired film. It's not terrible...just not very good or interesting.",
         "As a lover of Hitchcock I couldn't take 2 viewings of this one. The story has potential but the characters are horribly developed. The acting is fine, since the cast was superb. However, I wouldn't have wanted to be an actor in this one. Without spoiling, there is just too much anger without explanation. Too many characters lack character. The utter blindness of the leads to the glaring and painful flaws in the antagonists is almost comical. Finally, the sudden restoration of everyone's honesty and peace in the last scene is intolerable. A story is believable if the characters act like real humans would act. This film is an attempt to fool the viewer into thinking that a leopard can change it's spots in the blink of an eye! It is interesting to note that, even in a melodramatic story driven piece, Hitch still found a place for the falsely accused in the plot. Hitchcock was great, there will never be an equal, but, even he made a dud.. makes me feel better about myself!"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Transatlantic Pictures"],
      "summaries": [
         "In 1831, Irishman Charles Adare travels to Australia to start a new life with the help of his cousin who has just been appointed governor. When he arrives he meets powerful landowner and ex-convict Sam Flusky, who wants to do a business deal with him. Whilst attending a dinner party at Flusky's house, Charles meets Flusky's wife Henrietta who he had known as a child back in Ireland. Henrietta is an alcoholic and seems to be on the verge of madness.",
         "Charles Adare arrives in Australia in 1831 with his uncle, the new governor. Unsuccessful in Ireland, Charles hopes to make his fortune in Sydney. He is befriended by Samson Flusky, a prosperous ex-convict. Sam's wife, Lady Henrietta, \"Hattie\", was a friend of Charles's sister in Ireland. Sam hopes that the young man will be able to cheer up his wife, who is a mentally unstable alcoholic. Meanwhile the attractive housekeeper, Milly, secretly loves Sam, and encourages Hattie's drinking. Sam has been sent to an Australian prison after he confessed to a killing that Hattie actually committed. She had followed him and waited for his release. Charles's efforts to rehabilitate Hattie conflict with Milly's intentions. Eventually, Sam becomes jealous, and in a rage, accidentally shoots Charles. This time Hattie accepts the blame for the shooting. Milly, seeing her chances to win Sam slipping away, attempts to poison Hattie.",
         "In 1831, the new Governor arrives in Sydney, Australia, with his noble but broken Irish cousin Charles Adare. On the next morning, Charles unsuccessfully goes to the local bank expecting to raise money to start a business and he meets the powerful landowner Sam Flusky, an ex-convict that has raised a fortune in the colony. Sam proposes a business with lands with him and invites Charles to have dinner with him at his farm. Charles learns that Sam is not accepted by the local society but he goes to the dinner party, where he meets Sam's wife Henrietta Flusky, an old acquaintance of his childhood in Ireland. Sooner Charles discovers that Henrietta is alcoholic and a totally unstable woman controlled by the housekeeper Milly, and Sam was the groom of her family in Ireland. They had fallen in love with each other and Henrietta elopes with Sam. However, her brother hunts them and Sam kills him and is deported to Australia. Charles stays in Sam's farm to help Henrietta and sooner he falls in love with her. Meanwhile Sam is manipulated by Milly and his jealousy gets him into trouble and discloses dark secrets from his past with Henrietta.",
         "A young gentleman goes to Australia where he reunites with his now married childhood sweetheart, only to find out she has become an alcoholic and harbors dark secrets."
      ],
      "budget": 0
   },
   "movielensId": 2200,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1949-09-08",
      "dvdReleaseDate": "2003-06-17",
      "directors": ["Alfred Hitchcock"],
      "runtime": 108,
      "movieId": 2200,
      "title": "Under Capricorn",
      "mpaa": "",
      "actors": [
         "Ingrid Bergman",
         "Joseph Cotten",
         "Michael Wilding",
         "Margaret Leighton",
         "Cecil Parker",
         "Denis O'Dea",
         "Jack Watling",
         "Harcourt Williams",
         "John Ruddock",
         "Bill Shine",
         "Victor Lucas",
         "Alfred Hitchcock"
      ],
      "imdbMovieId": "0042004",
      "originalTitle": "Under Capricorn",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["BBPnal-FYi8"],
      "plotSummary": "In 1831, Irishman Charles Adare travels to Australia to start a new life with the help of his cousin who has just been appointed governor. When he arrives he meets powerful landowner and ex-convict Sam Flusky, who wants to do a business deal with him. Whilst attending a dinner party at Flusky's house, Charles meets Flusky's wife Henrietta who he had known as a child back in Ireland. Henrietta is an alcoholic and seems to be on the verge of madness.",
      "tmdbMovieId": 4175,
      "avgRating": 2.76606,
      "releaseYear": "1949",
      "numRatings": 109,
      "posterPath": "/gBRR6vYZNyXij4Cdf6khIQPS68q.jpg"
   }
}