{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "femme fatale",
            "id": 9016
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "lake district",
            "id": 227002
         },
         {
            "name": "cumbria",
            "id": 227003
         }
      ],
      "imdb_id": "tt0039694",
      "video": false,
      "title": "The Paradine Case",
      "recommendations": [
         4175,
         1978,
         15007,
         2370,
         24197,
         30159,
         31995,
         2762,
         31997,
         2761,
         5780,
         44626,
         25670,
         12684,
         35832,
         4174,
         47695,
         26718,
         20213,
         573
      ],
      "backdrop_path": "/3g1JzPixIPTkhGV3I072E3v69QM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anthony Keane",
               "gender": 2,
               "credit_id": "52fe44959251416c91015d49",
               "name": "Gregory Peck",
               "profile_path": "/ycs6o0UoohQ7nV7A6VWaTkoIkCQ.jpg",
               "id": 8487,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gay Keane",
               "gender": 1,
               "credit_id": "52fe44959251416c91015d4d",
               "name": "Ann Todd",
               "profile_path": "/wfu0f5SZxx4BVa4hDXkNANYeIpJ.jpg",
               "id": 100784,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Judge Lord Thomas Horfield",
               "gender": 0,
               "credit_id": "52fe44959251416c91015d51",
               "name": "Charles Laughton",
               "profile_path": "/vEfcV6RA6tJr035OAG9U9o4uRyL.jpg",
               "id": 10921,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Sir Simon Flaquer",
               "gender": 2,
               "credit_id": "52fe44959251416c91015d79",
               "name": "Charles Coburn",
               "profile_path": "/vuQEpr6ae3vcvpDxw2V9iKB1wUT.jpg",
               "id": 11169,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Lady Sophie Horfield",
               "gender": 1,
               "credit_id": "52fe44959251416c91015d7d",
               "name": "Ethel Barrymore",
               "profile_path": "/24OXA0rGmxbF09D5aK7aiWe6HCB.jpg",
               "id": 97777,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Andre Latour",
               "gender": 2,
               "credit_id": "52fe44959251416c91015d81",
               "name": "Louis Jourdan",
               "profile_path": "/qRFaub1dgsdARpNzE85Lrop0nVX.jpg",
               "id": 10508,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Mrs. Paradine",
               "gender": 1,
               "credit_id": "52fe44959251416c91015d85",
               "name": "Alida Valli",
               "profile_path": "/p2aBH2hXwNPjQGRNuMUfycku0Za.jpg",
               "id": 15385,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Sir Joseph",
               "gender": 2,
               "credit_id": "52fe44959251416c91015d89",
               "name": "Leo G. Carroll",
               "profile_path": "/xTxzUMrwj00ZXa3iWOqP5w1xgO5.jpg",
               "id": 2642,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Judy Flaquer",
               "gender": 1,
               "credit_id": "52fe44959251416c91015d8d",
               "name": "Joan Tetzel",
               "profile_path": "/jVyDvLNfMYR7DuQZ2fceYosHCo2.jpg",
               "id": 114287,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Innkeeper",
               "gender": 0,
               "credit_id": "52fe44959251416c91015d91",
               "name": "Isobel Elsom",
               "profile_path": "/ccoA79FB3Buw1rooFBkCSqVnrpt.jpg",
               "id": 95263,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Cabby (uncredited)",
               "gender": 2,
               "credit_id": "57b573e592514137b3000642",
               "name": "'Snub' Pollard",
               "profile_path": "/sAuWqpvncM3oVvytfZ8VHcAkPOf.jpg",
               "id": 85778,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d45",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44959251416c91015d57",
               "name": "Robert Hichens",
               "profile_path": null,
               "id": 53795,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d5d",
               "name": "David O. Selznick",
               "profile_path": null,
               "id": 3248,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d63",
               "name": "Ben Hecht",
               "profile_path": "/is5faYjaFObagG3b8xgwocMkUcX.jpg",
               "id": 4341,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d69",
               "name": "David O. Selznick",
               "profile_path": null,
               "id": 3248,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d6f",
               "name": "Franz Waxman",
               "profile_path": null,
               "id": 8619,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d75",
               "name": "Lee Garmes",
               "profile_path": null,
               "id": 13338,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44959251416c91015d97",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44959251416c91015d9d",
               "name": "James Bridie",
               "profile_path": null,
               "id": 131230,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "573e527e92514108d1000208",
               "name": "Mel Berns",
               "profile_path": null,
               "id": 4352,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.69262,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31667,
      "vote_count": 55,
      "budget": 4258000,
      "overview": "The beautiful Mrs. Paradine is accused of poisoning her older, blind husband. She hires married Anthony Keane as her lawyer and when he begins to fall in love with her, she encourages him.",
      "similar": [
         1645,
         9800,
         389,
         392982,
         37257,
         314365,
         396371,
         11560,
         11975,
         9623,
         9032,
         881,
         1592,
         1813,
         819,
         8055,
         402,
         629,
         634,
         59
      ],
      "original_title": "The Paradine Case",
      "runtime": 125,
      "poster_path": "/kSlUZFHmAqqSE7A1LoHDqgzrIMy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Vanguard Films",
            "id": 614,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Selznik Studio",
            "id": 62,
            "origin_country": ""
         }
      ],
      "release_date": "1947-12-31",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Alfred Hitchcock"],
      "runtime": 125,
      "synopsis": "The police arrest Maddalena Anna Paradine (Alida Valli) for poisoning her late husband, Col. Paradine. She claims innocence, and hires solicitor Sir Simon Flaquer (Charles Coburn) and barrister Anthony (a.k.a Tony) Keane (Gregory Peck, with an occasional British accent) as her defense team. Anthony Keane is very successful and happy at both his career and in his marriage with Gay (Anne Todd). Sir Flaquer and Keane have been friends for many years, and Gay considers Judy Flaquer (Joan Tetzel) her best friend. The presiding judge, Lord Thomas Horfield (Charles Laughton) and his wife, Lady Sophie (Ethel Barrymore) represent the legal and popular views about the case. Spoiler alert: During the pretrial period, Keane's affections changes, as he falls under Maddalena's spell, starting at their first meeting. Gay Keane realizes her husband has fallen for Mrs. Paradine. She confides in Judy, who advises her to confront Keane about this. But Gay refuses to leave or condemn him She knows he still loves and values her, because Keane has not chosen to leave, yet. In fact, Gay wants Mrs. Paradine to be acquitted so she can fight against a living woman instead of a lost love. The suspects narrow down to Maddalena or Andre LaTour (Louis Jourdan), Col Paradine's valet of many years. She claims to love her blind husband. Their marriage had no problems. Andre argued with Col. Paradine earlier that night, about an unknown subject, and was dismissed. There is great uncertainty in the motives and actions of many people that fateful evening. The butler brought Col Paradine that glass of brandy, something he rarely requested at bedtime. Maddalena claims to have laid out her husband's sleepwear but did not go near the brandy. Andre was pounding on Col Paradine's bedroom door, and saw Maddalena enter her room after he started. Andre said the brandy glass still had a few drops when he forced his way inside. However, the police found the brandy glass cleaned and wiped. Just before the trial starts, Andre warns Keane that Maddalena is evil and he hates her because she brought so much turmoil into their lives. As a defense witness, Andre claims that Col. Paradine dismissed him as his valet, but to be reassigned to some other household role. He did put down the Colonel's hunting dog last year, but claimed to have disposed of the poison at that time. The glass still contained some brandy when he went to find the butler and call the doctor. Under more pressure, Andre reveals that he was Maddalena's lover and had confessed to Col. Paradine that day. At this point,Maddalena forces Keane to stop this line of questions. Disillusioned, Keane realizes that she has hidden motives for both her husband's murder and not implicating Andre as the murderer. The next day, Keane puts her on the stand and proceeds to question her relationship with Andre. Shortly after this begins, Sir Flaquer tells Keane of Andre's suicide. At this news, Maddalena breaks down and confesses to poisoning her husband out of love for Andre, who had come to hate her for betraying his Colonel. She receives the death sentence, and Keane goes back to his wife, sadder but more appreciative of his wife's love.",
      "writers": [
         "Robert Hichens",
         "Alma Reville"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0039694/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ3NDI0NzA4M15BMl5BanBnXkFtZTYwOTU0NTA5._V1._CR1,42,260,431_SX214_AL_.jpg",
      "actors": ["Stars: Gregory Peck, Ann Todd, Charles Laughton | See full cast and crew »"],
      "reviews": [
         "\"The Paradine Case\" has gotten an undeserved bad reputation as one of Alfred Hitchcock's least interesting films simply because it does not use any of the gimmicks and brilliant visual touches Hitchcock is famous for: a man being chased by a crop duster, inventively shot murder scenes in locations such as the ones in \"Psycho\", people dangling from Mt. Rushmore, unusual settings such as a cramped lifeboat. As if these touches were all that made Hitchcock great! If these touches are all we watch Hitchcock for, it's as shallow a reason for watching films as going to see summer movies merely to see special effects. A great director like Hitchcock deserves more credit than that. \"The Paradine Case\" is, on the contrary, one of Hitchcock's most entertaining films, if you are willing to concentrate on dialogue and characterization rather than flashy visuals. Gregory Peck is the barrister assigned to defend Mrs. Paradine, a woman on trial for the cold-blooded murder of her blind husband, and it is immediately obvious that Peck is so besotted by this beautiful, mysterious woman that he is in no position to be objective about his client. Peck does quite a good job, but one can only wonder how Laurence Olivier, who was busy filming \"Hamlet\" at the time, and who was Hitchcock's first choice for the role, might have played it. Hitchcock wanted Greta Garbo for the role of Mrs. Paradine, but was unable to get her, and settled for Alida Valli, who is excellent, if not as beautiful and mysterious as Garbo. Louis Jourdan plays a suspicious-looking witness in the case, but Hitchcock wanted Robert Newton (famous for playing Long John Silver and other disreputable characters) for the role, and Newton would have provided a far more different and repulsive characterization (apparently Hitchcock's intention). Charles Laughton unforgettably plays the judge at the trial as a sadist and a supremely dirty old man, who hates Peck because Ann Todd (as Peck's wife) refused his advances once, and Ethel Barrymore, brilliant in her limited screen time, is Laughton's intimidated and submissive wife. The majority of the film does take place in the courtroom, but so does \"Witness for the Prosecution\", and no one has a bad word to say about that film. (Would they have done so if Hitchcock had made that one? The Agatha Christie thriller doesn't contain any flashy visual touches either.) Those who love Hitchcock for only his \"trademarks\" perhaps need to look a little harder and think a little deeper, and then they will appreciate this excellent film.",
         "Often unjustly dismissed as one of director Alfred Hitchcock's `lesser works,' THE PARADINE CASE stands up as well as any 1940's courtroom drama when taken on its own terms. And the central theme: that of a lawyer passionately (and wrongly) convinced of a beautiful and intelligent client's innocence because he wants to trust his emotions and not the evidence, certainly seems to strike a chord with audiences. It has been used countless times from the silent era to the present day (e.g., MADAME X, GUILTY AS SIN, BODY OF EVIDENCE, etc..). Unlike reviewer stills-6, I found the central triangle-between lawyer Peck, his wife Ann Todd, and lovely client Alida Valli (whose motives are always kept nebulous until the end) believable and surprisingly complex. Each has his/her own agenda; with Peck wavering between the lovely, warm Todd and the beautiful, coldly mysterious and sensual Valli, who seemingly represents an attitude toward love and life he has presumably never known but finds appealing nevertheless. Valli has the most difficult role here, having to both woo Peck to her cause while keeping him emotionally at a distance, but Todd also acquits herself admirably by bringing depth and sensitivity to what could have been just a run-of-the-mill suffering wife role. She refuses to suffer in silence, and uses words to argue her cause passionately, saying wryly at the end: `That's what comes from being married to a lawyer.' Of course, a cynic could point out that when Todd insists Peck defend and acquit Valli she is being unjustly noble-but I think Todd's stoic suffering and her explanations to Peck quickly undercut this idea. (And in fact, if Peck did follow up on his offer to Todd to quit the case halfway through, this wouldn't be much of a movie!) Indeed, the wordiness of this film seems to be one of its detractors' biggest complaints. But in this I think Hitchcock has (perhaps unintentionally) made a sly point: the characters talk circles around each other (particularly Peck and the always deliciously malevolent Laughton), but manage most of the time to completely miss the realities of the situation. Only the women--the silent Valli, the barely repressed Todd, and the caustic Joan Tetzel--recognize the truth. The men, doomed to arguing and finagling, miss the point-and the truth-completely, in their attempts to sacrifice each other to their own individual causes. Even considered strictly within the Hitchcock pantheon, it's clear THE PARADINE CASE has many Hitchcockian trademarks: dazzling cameras moves, wonderful imagery, sweeping romantic themes, blurred triangles of love, desire and hate between all the principle characters, brutal men, devious women, an impending sense of doom, and even a character noted for her `masculine' interest in the legal technicalities of the case. (Clearly, Hitchcock found these women pursuing `masculine' interests fascinating, as they seem to pop up in many of his films (e.g., Patricia Hitchcock in STRANGERS ON A TRAIN, Barbara Bel Geddes in VERTIGO). But I also find in the women here a darker prelude of Hitchcockian things to come. No one in THE PARADINE CASE is entirely happy (or even, one might argue, happy at all), but each sticks firmly to her own emotional path, able to see the potential tragic outcome but unwilling to waver enough to change it. (Kim Novak's character follows a similarly torturous internal journey in VERTIGO, as does Tippi Hedren in MARNIE). So if you have the time to be absorbed by this imperfect but still compelling drama, take another look at THE PARADINE CASE. You might be surprised.",
         "Because this movie has so few of the features normally associated with a Hitchcock picture, it has a rather poor reputation. But it has a fine cast, most of whom perform quite well, and if the story is taken on its own merits it is interesting, although slow-moving and heavily dependent on the characters' conversations with one another. If it had been made by someone else, it might seem like more of an accomplishment. In \"The Paradine Case\", Mrs. Paradine (Alida Valli) is arrested and tried for the murder of her husband. She is defended by the great lawyer Anthony Keane (Gregory Peck), who quickly becomes intoxicated by his client and loses all objectivity. Even as evidence mounts that she may have done the crime after all, he risks his marriage and reputation on the slightest of chances to find new evidence. It moves quite slowly, but is helped by the presence of many good supporting characters and a fine cast that portrays them convincingly. Things come together in a lengthy courtroom sequence that is sometimes uncomfortable to watch, but tense and realistic. Many viewers feel let down by the film because it lacks the energy and excitement found in most of Hitchcock's films, and because the courtroom setting creates expectations that are not quite filled. Indeed, it does have its faults, and it's hard to believe that someone of Hitchcock's creative genius could not have thought of some ways to give more life to the body of the picture, because there are times when it really crawls along. But taken on its own merits, it is a pretty good movie, carefully filmed as always, and one that gives the viewer plenty to think about. There are some good scenes, with the best one being the subtly crafted opening sequence of Mrs. Paradine being arrested in her elegant home and taken to prison. Many Hitchcock fans will not particularly enjoy this one, although if you like his more somber masterpieces such as \"Vertigo\", you might at least want to give this one a try - not that it is nearly as good as \"Vertigo\" (how many films are), but it is somewhat similar in tone. It works much better as straight drama, rather than as suspense or mystery, and as such it is worth watching.",
         "I loved the film not because it of its courtroom drama but because of Hitchcock's ability to deal with the drama outside the courtroom. First, take in the shots that lead up to Alida Valli's character being arrested and locked up in the cell. Hitchcock is at his best building up the positive and elegant side of the character by enhancing the details--the expensive jewelry, the lady ensuring her hair is in place before receiving visitors, the humanist care taken to inform the valet that she would not be having her dinner, etc., etc. The build-up of the character within a few minutes of reel time for the viewer is considerably intelligent right up to the loud slamming of the cell door and the effect it has on the inmate (Hitchcock's own phobia?). The second sequence that is unforgettable for me is the camera zooming in on Ann Todd's naked shoulder followed by the lecherous Charles Laughton caressing Todd's hand hidden away from her husband's vision, leading up ultimately to Todd's rejection of Laughton's advances. What is of consequence is not the performance of Todd or Laughton, but Hitchcock's sequence of visuals deftly edited to enhance the effect. A third unusual image of the film is the introductory shot of Louis Jordan. This is the only film in my memory where a character is introduced without the least shred of light falling upon his/her face--his legs and hands are quite visible, but not his face. Finally, the meetings in the jail between Valli and Peck smolders without a kiss or a physical touch. In my view, the performance of Valli is outstanding. Her remarkable turns in films by Visconti (\"Senso\") and Bertolucci (\"1900\") proved her capability. The film belongs to Hitchcock, Valli and the camera-work of Lee Garmes (shots within the courtroom--probably the angles were suggested by the director). It is an unusual Hitchcock film with an elegant turn by Alida Valli. It is a film that cries out loud for a reassessment among Hitch's body of work. It is a major film of the director--though it is not an obvious one. Hitchcock seems to ask the viewer at the end of the film a difficult question--who is the true heroine of the film? And he has a macguffin...",
         "There are some films that are forever lost that one wishes still existed: the complete GREED and THE MAGNIFICENT AMBERSONS (Welles final cut)for examples. In the cinema of Alfred Hitchcock, THE PARADINE CASE as he originally shot would have been of great interest. Whether it would have been better is another matter. THE PARADINE CASE is generally conceded as among Hitchcock's lesser films. It's most interesting parts of the performances of the leads (except for Alida Valli, who is quite dull), and the famous sequence of the portrait of Valli whose eyes seem to follow the camera (standing in for Gregory Peck/Anthony Keane) as it passes from one room to the next. Hitchcock told Francois Truffaut that he felt the casting was wrong. He wanted Greta Garbo for Mrs. Paradine (but Selznick had Alida Valli signed up). He wanted Ronald Colman or Laurence Olivier as Keane (but Selznick had Gregory Peck signed up). He did not want Louis Jourdan as LaTour, but wanted Robert Newton. Again Selznick said no. As a result of our general respect for Hitchcock the suspense film artist we sympathize with his comments, and dismiss Selznick as a bullying producer who destroyed a masterpiece. I seriously question this view. First of all, David Selznick (for most of his career as a producer) was way ahead of the majority of such Hollywood figures because of his taste and ability. Anyone who could create GONE WITH THE WIND, David COPPERFIELD, SINCE YOU WENT AWAY, and other high caliber movies is not one to dismiss so cavalierly. Most of the films he did with Hitchcock (whom he brought to Hollywood in 1939) were very good films: REBECCA, SUSPICION, SHADOW OF A DOUBT, LIFEBOAT, FOREIGN CORRESPONDENT - they were not crappy. Secondly, he was aware of difficulties in getting performers: Olivier was working in England in 1948. Colman was working mostly at MGM, but was a bit too old for the role. And Peck was not an unknown talent: He had worked with Hitchcock already. As for Garbo, she had been in retirement for six years, and there was no sign she was interested in a film come-back. The Jourdan - Newton problem is another matter. LaTour, in the film, is Colonel Paradine's loyal batman, now a valet and groom on the estate. Mrs. Paradine has made a play for his affections, and he has rejected them out of loyalty to his master. Hitchcock felt that Robert Newton, with his physical appearance, would have looked more like a man who worked in the mire of a stable than Louis Jourdan did, although as Jourdan remained the Colonel's personal servant that seemed a minor casting point in favor of Newton. Hitchcock also skirted the issue (soon to be handled in ROPE, STRANGERS ON A TRAIN, and NORTH BY NORTHWEST) of a homosexual relationship between his characters. LaTour was supposed to be more openly close to the Colonel in Hitchcock's opinion. But it was a 1948 film - how close was the relationship supposed to be? Furthermore, Selznick as producer would be aware of one defect regarding Newton not found in Hitchcock's account to Truffaut: Newton's alcoholism. Given the size of Newton's benders he was a poor risk in most film acting roles (no matter how available he was). Not so with Louis Jourdan. The film was brought in under 93 days, and that record would not have been possible if Newton had been in the cast and kept getting drunk. As for the homosexual relationship, it never is fleshed at all in the film. But would a 1948 audience have been willing to accept that? I don't think so. The supporting players, particularly Ann Todd, Charles Laughton as the sadistic Mr. Justice Lord Hawfield, and Ethel Barrymore as Lady Hawfield, gave good accounts of themselves in the film, especially Laughton as the Judge who takes out his frustrations with Mrs. Keane (ANN TODD) to wreck her husband's case. His best scene, where he compares a walnut to a human brain sums up the character's beastliness. I think that what Hitchcock fans fail to notice here is that it is Hitch's only real courtroom film. While his characters face hearings and sentencing in court (like in the start of NOTORIOUS), they rarely are shown being tried. I CONFESS is an exception - and the bulk of the film is not a trial. Here the bulk of the film is the trial of the anti-heroine Mrs. Paradine. It is not typical Hitchcock, and fails to fascinate the audience. The highpoint is the verbal clashes between Laughton and Peck (sometimes assisted by Leo G. Carroll as the prosecutor), Jourdan's collapse in the witness box when Keane attacks him for secretly betraying his master with the defendant, and Valli's final condemnation of Keane in court. But the circumstances and the dialog do not fascinate the viewers. Compare the way the trial in THE PARADINE CASE compares with those in Billy Wilder's WITNESS FOR THE PROSECUTION, and in TO KILL A MOCKINGBIRD. Laughton's Sir Wilfred Robarts enlivens the film, and his tactics in attacking Torin Thatcher's case for the prosecution of Tyrone Power are solid and interesting in the former. Gregory Peck's Atticus Finch, in defending Brock Peters on a rape charge in a segregated, bigoted South, are cutting and sensible. The key is the script - both of those films have better scripts, based on better writings (Agatha Christie and Harper Lee) than the Robert Hitchens novel. One can bemoan the loss of the three hour version or the 119 minute version that we lack now, but if it was anything as dull as the slow moving courtroom sequences of the currently extant film, I doubt that any improvement would have appeared.",
         "This is a disappointing effort from the team of Hitchcock and Selznick. Probably its greatest shortcoming was its inability to ingeniously circumvent the Production Code (as accomplished in \"Notorious\") to present its adult themes. As a result, even though it is obvious that the case itself is not the subject of the film so much as a backdrop for an awkward arrangement of love triangles and its effect on one \"involved\" attorney, the courtroom scenes are the most compellingly watchable of the film. In contrast, the final scene of the film does not carry the weight that it should and feels like a cheat rather than the resolution it pretends to be. Some fault may be given to the just-OK performances from usually dependable actors such as Peck and Ann Todd. The stand-out performances here are from supporting characters such as Charles Coburn, Louis Jordan, Joan Tetzel, Charles Laughton and Ethel Barrymore, but they are either given very little to do or, in Barrymore's case, feel like they were interesting characters in sub-plots that were incompletely edited out of the film (usually a sign of a poor adaptation). In the final analysis, this is a film that will probably only appeal to devotees of Hitchcock and/or Laughton.",
         "Why does this movie seem so dull? The acting isn't bad once you get past Gregory Peck's British accent. None of the performances are outstanding, they're just not bad. The roles restrict the performers' range. I think Alida Valli smiles once. Louis Jourdan seems to have only one expression, a bitter, barely controlled anger. If he tried to smile he might crack. The actor given the best lines is Charles Laughton, who hams it up and brings a bit of life to the screen. \"Remarkable how the convolutions of a walnut resemble those of the human brain.\" And that flabby, sweaty palm as he takes the hand of Peck's wife, squeezes it lasciviously, and places it on his thigh. Well, I can think of three reasons why it's dull. (1) It's overwritten. The script needed somebody like Daryl F. Zanuck to hack out some of the underbrush. Peck is questioning Valli in court. It goes something like this: Peck: \"What did you say to Latour.\" Valli: \"I told him to leave the room.\" Peck: \"But why did you tell him to leave?\" Valli: \"Because I no longer wanted him present.\" Peck: \"And why did you no longer want him present?\" Valli: \"His presence was disturbing.\" And so on. How did the jury stay awake? Some of the scenes are pointless. Not the sort of interesting meanders you might find in other Hitchcock movies. Just pointless. Peck visits a country house to talk to Latour, who promises to show him the garden and then beats it pronto. An hour or two later Latour shows up banging on the window of Peck's room at the inn, having changed his mind for no apparent reason. The five-minute conversation that follows could have been condensed into half that time and benefited from some supplementary bits of business. Instead the two adversaries sit there like mahogany idols hiding information from one another. That's a poor script for you. (2) Hitchcock's imagination seems to have been asleep during the shooting. Perhaps the director himself was asleep. (It happened from time to time.) It isn't necessary for every Hitchcock film to have a bravura shot in it. The camera needn't always swing down from an upper story and wind up with a closeup of the key in someone's hand. But there is, maybe, one shot in this flick that bespeaks Hitchcock. When Andre Latour is first called into the courtroom as a witness, Hitchcock keeps the camera focused on Valli's face in the defendant's chair and circles it slowly around her so that we see Jourdan walking slowly into the room past her, behind her, and can almost feel her incandescent desire to turn around and look directly at him. (3) Hitchcock had a great sense of humor and it's entirely absent from this movie. It must in fact rank among the least humorous films he's ever made. And it's surprising, because he was usually able to insert some piece of business into even his most serious works. (Not including \"Vertigo.\") Often the humor centers around meals. A dowager stubs out a cigarette in a jar of cold cream, or the yolk of a fried egg. A police inspector is forced to eat fancy dishes that a Kurdish camel driver would turn up his nose at. Or the humor lies in montage, as in \"The Man Who Knew Too Much,\" when Jimmy Stewart escapes from a clumsy set-to with the staff at a taxidermist's and the scene ends with a shot of a stuffed lion's head gaping at the slammed door. SOMEthing, anyway, to lighten things up. But not here. Put it all together and you have a pretty dull movie, one of the several serial flops that Hitchcock ground out in the post-war period. It isn't exactly painful to sit through. It's just that it's not very enjoyable.",
         "A master chef, lavish preparation, fine ingredients in the choice of actors, great sets, costumes - but no imagination in the story. It's still enjoyable because upper middle class London in the 1950s, the relationships among the people, their entertainments, the beauty of the homes, the clothes, the accents, is a pretty enjoyable place to be for this movie's duration. However, the story - an uneasy mix of an uninvolving outdated sappy soap opera story of the torn man and his nobly suffering wife, with a murder trial that has drama but no surprises at all - is pretty bad. We're in the world of The Reluctant Debutante, Witness for the Prosecution, Dial M for Murder, Midnight Lace - upper middle class 1950s London (it's the sort of movie where, as they change from black tie and gown, they might say: \"Did you enjoy the Philharmonic tonight, darling?\" \"Well, the oboes were a trifle off\". \"Don't forget we have Lord and Lady X coming for dinner tomorrow\". He pulls a face; she smiles, embraces him and praises him.). You both love this atmosphere - it doesn't seem stifling at all - yet understand how the \"Angry Young Men\" and then the Beatles could have wanted to blow it up. A major criticism: this movie has the kind of mindset that launched feminism. Women exist either to ensnare men to their doom with their beauty or to nobly suffer, praise and forgive their heroic, if unfaithful-in-the-heart, men. Time and again, we hear of the \"unfeminine\" curiosity of one woman (whose interest is entirely prurient), and we see the absolute SHOCK on Peck's face when his client says that an adulterous affair in her past was at her initiation. A minor criticism: there is no explanation why an American (Peck) is a barrister. Rex Harrison would have been a better choice. Another minor criticism: the dialogue is so repetitive. E.g., how often is Peck told he's tired? Sometimes four times in a single Another minor criticism: the music is too heavy, the story just isn't enough to really grab us - so the music must tell us what we are supposed to feel. Yet the movie is still enjoyable - the characters of Gregory Peck, Charles Laughton, Charles Coburn and Louis Jourdan are well-drawn and enjoyably relate to each other. Laughton is particularly good - loathsome yet real-seeming. Alida Valli IS beautiful and exotic. Ethel Barrymore has obviously had FAR far better roles - Ann Todd is actually quite a good actress in other things, but has absolutely nothing to work with here, so the viewer will find her tiresome (not the movie's intention). If Hitchcock and these stars were not involved in this movie, no one would ever watch it, and it would probably still sit gathering dust somewhere, unreleased for home viewing. So, see it - it IS enjoyable to see these stars in this atmosphere, but expect some irritation and don't expect to remember it in a year.",
         "I wish some other star rather than Gregory Peck had played the lead role. Someone like a Ronald Coleman (whom Hitchcock wanted) or Laurence Olivier (whom Selznick wanted). I personally would have loved Robert Donat, but any of the above would have served better. I like Peck normally, but in this film, he's too young and never convincingly English, despite his accent. Even without the accent, he doesn't suggest someone who is passionately and irrationally swept away, as the role calls for. That said, I still love the film. Some Hitchcock films I love more--as I guess we all do--but I prefer this one over others. View THE PARADINE CASE and then compare it with the master's three movies that followed, those he directed without Selznick (ROPE, UNDER CAPRICORN, STAGE FRIGHT), and you'll see the touch that pervades those he made with Selznick. All the Selznick/Hitchcock flicks are wonderful; they are the director's most glamorous and romantic movies.",
         "This was Gregory Peck's second and last film with Alfred Hitchcock. He plays an English barrister who starts crushing out on his beautiful client who in this case is Alida Valli. Kind of hard to understand because at home he's got a porcelain goddess in the person of Ann Todd who definitely rates as one of Hitchcock's cool blonds. I guess Valli had a touch of the exotic for him as she did for Joseph Cotten in The Third Man. For an English based film most of the cast is American. The English in this film are Charles Laughton, Ann Todd, Leo G. Carroll, and Joan Tetzel. Had Hitchcock had his way he would have gotten Sir Laurence Olivier over here to play Peck's part. Peck does his best, but I think Olivier would have been really something in the part. His performance as George Hurstwood in Carrie which is a similar role proves that. Peck is suggested as counsel by Charles Coburn, solicitor for Alida Valli. She's been arrested for allegedly poisoning her rich and blind husband who was a war hero. The only other one around when the crime occurred was valet Louis Jourdan. The thing I've always found curious about The Paradine Case is that while Peck's courtroom skills are brilliant as he tries alternative theories of the crime, he still allows himself to be ruled by the client because of his male member. A lawyer not so emotionally involved would have just sat Valli down and told her the legal facts of life. Valli refuses to let that happen. Among the supporting cast look for a deliciously malevolent performance as Judge Horfield by Charles Laughton. Both at home where during a dinner party he makes a clumsy attempt to seduce Ann Todd and later on in court where during the trial he slams Peck at every opportunity. Laughton is a picture of corpulent corruption. In the films of Alfred Hitchcock, the most expensive part of the film is the set of Old Bailey courtroom which is completely rebuilt to scale. The set is quite impressive. Although Hitchcock had experimented with a one set film with Rope and later on Dial M for Murder was done almost entirely in a small apartment, the set really is most like the set in Rear Window. Nearly the entire cast is present in Old Bailey, each in his assigned location like the people in the courtyard apartments in Rear Window. Visually I find it quite impressive. Although Peck is not well cast, he's a good enough player to overcome the obstacles. The Paradine Case did not do as much for him as his earlier film for Hitchcock, Spellbound. Still it hurt no one's careers by association with it."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Vanguard Films",
         "Selznick Studio, The"
      ],
      "summaries": [
         "The beautiful Mrs. Paradine is accused of poisoning her older, blind husband. She hires married Anthony Keane as her lawyer and when he begins to fall in love with her, she encourages him.",
         "Highly successful London barrister Anthony Keane takes on the case of Italian Maddalena Paradine who is accused of poisoning her blind military hero husband. Keane comes increasingly under her spell, threatening both his marriage and his career.",
         "In London, the upper-class Mrs. Maddalena Anna Paradine is arrested accused of poisoning her blind wealthy husband Colonel Paradine. Her friend Sir Simon Flaquer recommends the experienced lawyer Anthny Keane to defend her in the court.",
         "A happily married London barrister falls in love with the accused poisoner he is defending."
      ],
      "budget": 4258000
   },
   "movielensId": 2201,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1947-12-31",
      "dvdReleaseDate": "1999-09-07",
      "directors": ["Alfred Hitchcock"],
      "runtime": 125,
      "movieId": 2201,
      "title": "The Paradine Case",
      "mpaa": "",
      "actors": [
         "Gregory Peck",
         "Ann Todd",
         "Charles Laughton",
         "Charles Coburn",
         "Ethel Barrymore",
         "Louis Jourdan",
         "Alida Valli",
         "Leo G. Carroll",
         "Joan Tetzel",
         "Isobel Elsom",
         "'Snub' Pollard"
      ],
      "imdbMovieId": "0039694",
      "originalTitle": "The Paradine Case",
      "genres": [
         "Drama",
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": ["HCKqAc1z72w"],
      "plotSummary": "The beautiful Mrs. Paradine is accused of poisoning her older, blind husband. She hires married Anthony Keane as her lawyer and when he begins to fall in love with her, she encourages him.",
      "tmdbMovieId": 31667,
      "avgRating": 3.24627,
      "releaseYear": "1947",
      "numRatings": 268,
      "posterPath": "/kSlUZFHmAqqSE7A1LoHDqgzrIMy.jpg"
   }
}