{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bomb",
            "id": 258
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "bus",
            "id": 992
         },
         {
            "name": "cinema",
            "id": 1388
         },
         {
            "name": "aquarium",
            "id": 2269
         },
         {
            "name": "horse",
            "id": 2673
         },
         {
            "name": "time bomb",
            "id": 3562
         },
         {
            "name": "saboteur",
            "id": 6845
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "explosion",
            "id": 14601
         },
         {
            "name": "death",
            "id": 34079
         }
      ],
      "imdb_id": "tt0028212",
      "video": false,
      "title": "Sabotage",
      "recommendations": [
         2761,
         8208,
         31995,
         25670,
         2762,
         260,
         22527,
         11462,
         31997,
         1978,
         13321,
         940,
         30159,
         4174,
         11219,
         32044,
         36049,
         29740,
         23330,
         22112
      ],
      "backdrop_path": "/hVOJksEtCV9D1eNEk886oVrsL2i.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Mrs. Sylvia Verloc (as Sylvia Sydney)",
               "gender": 1,
               "credit_id": "52fe45139251416c7504ae07",
               "name": "Sylvia Sidney",
               "profile_path": "/eUDO5p5Zra4e51yQW4IdNifhzlc.jpg",
               "id": 528,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Karl Anton Verloc (as Oscar Homolka)",
               "gender": 2,
               "credit_id": "52fe45139251416c7504ae0b",
               "name": "Oskar Homolka",
               "profile_path": "/jhKFc29QjUTfgqNMQqpAO79swQq.jpg",
               "id": 29661,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Sylvia's Young Brother Stevie",
               "gender": 0,
               "credit_id": "52fe45139251416c7504ae0f",
               "name": "Desmond Tester",
               "profile_path": "/p0W4ytKqsqAD3x78w1qYv4FxzQs.jpg",
               "id": 102885,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Detective Sergeant Ted Spencer",
               "gender": 2,
               "credit_id": "52fe45139251416c7504ae13",
               "name": "John Loder",
               "profile_path": "/iAzLp7ELhCFdjriFNMsxVh1iitb.jpg",
               "id": 29127,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Renee",
               "gender": 0,
               "credit_id": "52fe45139251416c7504ae17",
               "name": "Joyce Barbour",
               "profile_path": "/tYltom0gyhOX1XqdSk6vWu8azO9.jpg",
               "id": 102886,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Superintendent Talbot",
               "gender": 0,
               "credit_id": "52fe45139251416c7504ae1b",
               "name": "Matthew Boulton",
               "profile_path": "/xtYte3vjCSrDcbFBfbJifkrU5CN.jpg",
               "id": 102888,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Hollingshead",
               "gender": 0,
               "credit_id": "52fe45139251416c7504ae1f",
               "name": "S.J. Warmington",
               "profile_path": null,
               "id": 102889,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Professor A.F. Chatman",
               "gender": 2,
               "credit_id": "52fe45139251416c7504ae23",
               "name": "William Dewhurst",
               "profile_path": null,
               "id": 102891,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "The Cook Mrs. Jones (uncredited)",
               "gender": 1,
               "credit_id": "5a11a35bc3a368628f04e27c",
               "name": "Clare Greet",
               "profile_path": null,
               "id": 37870,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45139251416c7504adeb",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45139251416c7504adf1",
               "name": "Joseph Conrad",
               "profile_path": "/e9K1LVshKNQUziyAgSrB3uCjMOZ.jpg",
               "id": 8327,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe45139251416c7504adf7",
               "name": "Charles Bennett",
               "profile_path": null,
               "id": 3599,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45139251416c7504adfd",
               "name": "Bernard Knowles",
               "profile_path": null,
               "id": 3606,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45139251416c7504ae03",
               "name": "Charles Frend",
               "profile_path": null,
               "id": 27920,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55b12a129251411e0b00e7d3",
               "name": "Ian Hay",
               "profile_path": null,
               "id": 27918,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "55b12a209251411e0b00e7d5",
               "name": "Helen Simpson",
               "profile_path": null,
               "id": 108626,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "55b12a499251411e1800e714",
               "name": "E.V.H. Emmett",
               "profile_path": null,
               "id": 980520,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 0,
               "credit_id": "55b12a789251411e0600e951",
               "name": "Oscar Friedrich Werndorff",
               "profile_path": null,
               "id": 27921,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "584dc71392514118e4002af4",
               "name": "Albert Jullion",
               "profile_path": null,
               "id": 27924,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "584dc71ac3a36832280026e8",
               "name": "Joe Strassner",
               "profile_path": null,
               "id": 27922,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "584dc724c3a36832280026f5",
               "name": "Pen Tennyson",
               "profile_path": null,
               "id": 27923,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 6.527055,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 12684,
      "vote_count": 84,
      "budget": 0,
      "overview": "A Scotland Yard undercover detective is on the trail of a saboteur who is part of a plot to set off a bomb in London. But when the detective's cover is blown, the plot begins to unravel.",
      "similar": [
         916,
         14043,
         949,
         1572,
         4771,
         238636,
         75780,
         189,
         562,
         379149,
         392044,
         336843,
         11929,
         1939,
         300671,
         1923,
         223,
         49021,
         302,
         10651
      ],
      "original_title": "Sabotage",
      "runtime": 76,
      "poster_path": "/9DM9MPN6jtvIhqvadCFTPBQZwiW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Gaumont British Picture Corporation",
         "id": 4978,
         "origin_country": ""
      }],
      "release_date": "1936-12-02",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "...A Bomb Plot ...A Killing ...Justice",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 90,
      "synopsis": "First we see a dictionary page highlighting SABOTAGE, then a power station with one chimney smoking in the moonlight, then a gaudily lit London street at night. The lights in the streets go out. Lit only by flashlight, we see a large machine half in water. Several hands excitedly fuss with the machinery, digging up a muddy substance. A first voice says: \"Sand!\", then another voice \"Sabotage!\", and a third : \"Who did it?\" The face of Karl Verloc (Oscar Homolka), walking in the shadows, emerges to fill the screen. Customers at the BIJOU cinema exit to the street after the power goes off. Some loudly insist on getting a refund. At the box office, the clerk and the owner's wife are hesitant to refund anything, as they are short of cash. A youngish man Ted Spencer (John Loder) stands on a step and spouts off comically as though he knows the law and repeats there is no need to return money, as there is no fault by the cinemas owners. Meanwhile, Verloc comes into the BIJOU surreptitiously although Ted observes him. He quietly goes to bed at the dwelling in back of the screen and lies down as if he had been napping. Verloc's young wife Sylvia (Sylvia Sidney) is hesitant to give refunds, and believes her husband is still out, but Ted tells her he saw him come in, so she goes into the apartment, finds Verloc, and asks whether to refund the money. Verloc tells her to go ahead and give refunds, as he will be getting some money shortly. Just as refunds are about to be given, the power comes back on, customers laugh and reenter the BIJOU. The Verlocs are the owners of the BIJOU. They live, together with her little brother Stevie (Desmond Tester), in the rear apartment. Right after the blackout, the cook leaves, leaving Stevie in charge of finalizing dinner. Stevie fumbles and breaks a dish, which he hides in a drawer. Scotland Yard suspects Verloc is an agent for a foreign power, part of a gang planning other attacks. Detective Sergeant Ted Spencer was assigned to investigate Verloc under cover, and attempt to get hard evidence against him. Spencer poses as a greengrocer's helper, selling fruit and vegetables in a shop right next to the cinema. The family comes into the shop often, and he ingratiates himself with Stevie and his sister by providing many extra services. Ted is attracted to the beautiful Sylvia but she wants nothing to do with his advances. Ted invites Stevie and Sylvia to a full lunch at Simpson's, a fashionable restaurant. At the lunch, Sylvia explains that her husband is a good man who has been kind to her and her little brother. She is an American who came to London with Stevie to escape the Depression in America, but when the economy crashed in England, too, they were down on their luck and to survive she married a kind older man who protected them. They are running the BIJOU, but struggling economically. Verloc receives a phone call and goes to the London aquarium to receive pay and more instructions. He is tailed by police, who want to identify the entire saboteur gang, but knowing the foreign bosses are \"people you and I will never catch\" as one policeman tells another. Verloc meets his contact in front of an illuminated tank where a huge turtle is swimming. A passerby (Charles Hawtrey) enthusiastically describes the reproduction of fish at the aquarium and compares them to humans. Verloc is paid but scolded because his power station stunt was disappointing. \"London must not laugh\" is the order given to Verloc. \"We want the English to worry about what happens in England and thus pay no attention to what happens elsewhere in Europe\". Agents must not fear retribution to earn their money. Then the contact assigns Verloc to put a bomb in Piccadilly Circus station \"the center of the world\", and produce fear, not laughter. Verloc isn't a forceful villain, just a weak, man of no moral fiber who objects to the idea of murder but decides to go through with it for money. The bomb is to be prepared by an agent who runs a pet shop as a front. Verloc realizes that he is in over his head, and tries to get out of the fearsome responsibilities, but he is scolded again and he accepts. In a dreamy sequence the scared Verloc sees the fish swimming in the tank and imagines them as motor cars filled with passengers moving around Piccadilly Circus when an explosion demolishes all buildings around. Suddenly the fish in the tank reappear. Again tailed by Scotland Yard, he proceeds to the pet shop. At the pet shop, an old biddy wants to return a canary that won't sing. The shop owner Professor Chatman (William Dewhurst), has no trouble getting the bird to warble, implying that it's the lady's fault. Verloc is led to a stuffy kitchen where a chaotic nconventional family of three, a father, daughter, and granddaughter live, to talk to Chatman. Chatman opens a cabinet, reaching for bomb making stuff and first finds the granddaughter's doll in the cabinet. He then explains to Verloc that the bomb is up to Chatman, only the delivery will be up to Verloc. They agree to disguise the bomb in a cage with canaries, addressed to Stevie, who will enjoy the birds. A clandestine meeting for gang members is arranged for Verloc's apartment. Ted has no difficulty identifying something is afoot, since anyone wanting to see Verloc must walk up to the front of the Bijou, pass into the dark screening room, walk along its side to a curtain next to the screen. Behind the curtain is Verloc's door. Ted gets Stevie to show him how to get behind the screen to a window from which he might overhear what is going on at the meeting Verloc is having with other shifty-eyed foreigners in ill-fitting suits. Unfortunately, he is spotted by the conspirators and pulled into the room. The conspirators end their meeting, telling Verloc the job is his alone. Verloc exits to talk to his neighbor the greengrocer, and elicits comments that confirm that Ted is a policeman under cover. Meantime Sylvia has become gradually more suspicious about Verloc's activities. However, she hesitates and delays. Professor Chatman sends Stevie a pair of canaries in a cage, with the package bomb concealed in a drawer underneath. Verloc reads a sealed message that the bomb is set to go off at 1:45. Ted admits he is a detective and detains Verloc asking him details over and over, pretending he has no suspicions of Verloc himself. Verloc, wanting an alibi for the time of the explosion, arranges for Stevie to take the package to Picadilly and leave it in the station cloakroom by 1:30. The excuse is that a film canister needs to be returned nearby. It must be walked over, because it is inflammable and it cant be carried on a bus. The heartbreakingly cheerful brother is carrying the bomb along with film canisters labeled \"Bartholomew the Strangler. Because the Lord Mayor's parade is on that day, Stevie is delayed by all manner of events. A street vendor pulls him out of a crowd in order to demonstrate a new toothpaste. He's stopped from crossing a street because the parade is marching by. He enjoys watching the parade. The parade has snarled traffic. When he gets on a bus the conductor ironically warns, \"Don't set fire to me or the other passengers.\" The bus keeps hitting red lights. There are many cuts between the oblivious Stevie, with a time bomb in a package under one arm while petting a fluffy puppy with his free hand and talking to an old lady, those big outdoor clocks whose arms get ever closer to 1:45, until the explosion. Ted receives orders to go to the explosion scene. When Stevie does not get back home for a meal, Sylvia starts to worry and ask questions, and learns the awful truth from Verloc. Verloc confesses his part in the sabotage, while standing near the model boat which she and her brother had made, then blames Spencer for Stevie's death, saying he prevented Verloc from delivering the bomb himself. Verloc suggests to Sylvia that they could have a child of their own, as if to compensate for her loss. Sylvia, deeply depressed and confused at the revelation, hears laughter from the audience. She wanders into the theater in shock, and sits to watch \"Who Killed Cock Robin,\" a 1935 Disney cartoon featuring a parody of Mae West. Momentarily, she laughs, but when the arrow is loosed and slays poor Cock Robin, the laughter on her face changes to an expression of agony and terror. Her eyes and expressions subtly convey an emotional cascade of stunned realization, immense sadness, and suppressed hysteria. She realizes what a monster her husband is. Sylvia explodes after sitting to dinner with Verloc. He orders his still shocked and dazed wife to a \"get a grip\" and get prepared to deny everything. He goes on to order her to scold the cook about the overcooked cabbage soup on the dinner table. Without dialogue, the camera shifts from her face, to Verloc's, to the food they are eating, to her hold on a carving knife, until they both rise, stare at each other, and it happens: she stabs him in the stomach with the knife. Meantime, Ted discovers, at the scene of the blown up bus, part of the film canister from the BIJOU that most likely was carried by Stevie, so he returns to the BIJOU. We see Sylvia sitting, dazed, right past the doorway, and in the foreground, the feet of the slain Verloc. When Spencer arrives at the apartment, he realizes what has happened, but insists that Sylvia shouldn't admit that she knifed her husband. He takes her out of the apartment and tries to convince her that he is in love with her, and talks about getting on a boat crossing the Channel to France and together escape the police. Professor Chatman's daughter berates him for leaving a bird-cage with the shop's identification at Verloc's, and insists he go back to retrieve it. Chatman enters the apartment just ahead of a squad of detectives coming for Verloc. When the detectives knock, he locks the door and announces he has a bomb and will blow it up if they enter. The detectives at the door assume they are hearing Verlocs voice, and take the threat seriously. They evacuate the building. They argue about who should stay near the apartment: the single guy says he will stay and let the married ones go to a safer place, but one of the marrieds jokes that since hes already married, his life is over anyway so he might as well stay. Sylvia is dazedly responding to Ted's love declaration, and kisses him, but she refuses to run away, and is just on the edge of confessing to a policeman when an explosion and fire at the cinema intervenes. The evidence of her crime is destroyed, and effectively prevents the policeman from remembering whether it was before or after the explosion that she said, \"My husband is dead!\" At the end we see Sylvia and Ted walk away together.",
      "writers": [
         "Joseph Conrad",
         "Charles Bennett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028212/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MDAwODU2MV5BMl5BanBnXkFtZTgwNTEzMTE4MzE@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Sylvia Sidney, Oskar Homolka, Desmond Tester | See full cast and crew »"],
      "reviews": [
         "Like most Hitchcock films, \"Sabotage\" is a great thriller directed with a fluid, self-assured style. But given its thriller genre what makes \"Sabotage\" unique is that moments into the movie we know the identity of the saboteur, we know who is the undercover detective, and we know that the police have all but solved the case. So Hitchcock's suspense must come from somewhere else and in the meantime he must entertain us with character development. And that task falls to his heroine. Hitchcock had an uncanny ability to cast actresses who were a perfect fit (at that exact point of their career) to play a particular heroine. Fortunately he again makes the right choice and we are treated to a fine performance from Sylvia Sidney (imagine an expressive Sasha Cohen without ice skates). The film is essentially a Sylvia Sidney vehicle as she plays a woman who slowly realizes that her husband is a monster. She is a young American woman who married an older European (nationality unknown) man who apparently showed kindness to her and her young brother Stevie (played by Desmond Tester) when they were down on their luck. They moved to London to run the Bijou, a struggling movie house. Among the notable scenes is the meeting between Sidney's husband (played by Oskar Homolka) and a spy contact at the London aquarium; to the backdrop of a huge turtle swimming in an illuminated tank. The tank cross-dissolves into Piccadilly Circus as it is demolished in his imagination. Another is late in the film when Sidney sits in the theater in numb shock, watching a Disney cartoon ( ( \"Who Killed Cock Robin ?\" )). There is not a word of dialogue but her eyes and expressions subtly convey an emotional cavalcade of stunned realization, immense sadness, and barely suppressed hysteria that will stay in your memory forever. It is a rare example of the visual power of film and an illustration of what acting for the camera is all about. And perhaps most amazing is the long and unbearably suspenseful journey of young brother Stevie across London, unaware that he's carrying a ticking time bomb.",
         "\"Sabotage\" is one of Alfred Hitchcock's least known features, but it is part of a string of fine films he made during his last few years in England, and is well worth watching for any Hitchcock or thriller fan. The picture is based on a classic novel by the great Polish-English writer Joseph Conrad. This is a tense, atmospheric thriller, without much humor. It is more like \"Vertigo\", \"I Confess\", or \"The Birds\" than \"North By Northwest\" or \"The 39 Steps\". Instead of humor, Hitchcock concentrates this time on carefully constructing the world of the Verlocs, the family at the center of the film. The setting, in a movie theater where the family works and lives, is an important part of the themes and questions explored in the film. The characters are constantly walking in and out of the theater while movies are in progress, or discussing the movies being shown as they go about the main actions of the (actual) film. The obvious themes of appearance and reality parallel the lives of the Verloc family, and especially Mr. Verloc (Oskar Homolka) whom we know from the beginning to be a terrorist, albeit an amateurish one, and not the mild-mannered family man he appears to be. The settings of Verloc's meeting with his co-conspirators, an aquarium and a bird shop, are also carefully chosen to demonstrate the contrast between the everyday appearance of the terrorists and their actual agendas. Besides the obvious implication that such persons may be those we would not suspect, there is also the strong suggestion that these conspirators do not themselves realize the serious nature of the game they are playing. Certainly Verloc himself quickly realizes that he is in over his head, and he tries desperately to get out of the fearsome responsibilities he has accepted. Hitchcock buffs will enjoy watching the film repeatedly to catch all of the carefully crafted detail, and to enjoy the trademark Hitchcock touches. There are two particularly riveting sequences. One occurs when Verloc sends his wife's young, unsuspecting brother on a dangerous errand, leading to a sequence of excruciating tension. Hitchcock later said he should have ended the sequence differently, and many viewers might agree, but what happens is in keeping with the themes and plot of the movie, and the suspense sequence is also masterfully done. Also well-known from \"Sabotage\" is the sequence when Mrs. Verloc (Sylvia Sidney) learns the truth about her husband's activities, and the awful consequences of his latest plot. There is first a touching sequence in the theater, when the Disney movie playing on the screen first provokes Mrs. Verloc to involuntary laughter, then to deepened sadness when it too closely parallels her own experience. Then there is a tense, famous scene at the dinner table, filmed as an absolutely masterful montage by Hitchcock. These scenes, and the finely crafted atmosphere of \"Sabotage\", make it worthwhile despite a few small faults, and despite the possibility that many viewers will not be comfortable with some of the plot developments. Watch it at least once if you are a Hitchcock fan, or if you like spy stories or thrillers.",
         "For reasons that are left unexplained -- and maybe it should be so -- Karl Verloc (Oscar Homolka) is working for unknown forces by terrorizing London natives as he sets off bombs. His wife's brother Stevie is the patsy given these packages to be delivered once they reach their destination at a certain time. Until one delivery goes terribly wrong and causes the innocent Stevie his life. It's the sequence that is Hitchcock's earliest depictions of what he describes as suspense. The boy, whom we have grown to like over the course of the film, is on his way to a location on a bus carrying the bomb inside a package. Hitchcock cuts between the package, the street, the Big Ben, over and over and over until the tension becomes so unbearable and is finally released in an explosion which kills the boy. While Hitchcock in his interview with Truffaut would later state that putting the boy in this situation is something that he resented because the audience at that time reacted negatively at this, I think this is a mistake. Because there is another character, Mrs. Verloc (played by Sylvia Sidney), who will eventually come to realize what she has been slowly fearing all along -- that her husband is the person behind the acts of sabotage -- she has to lose a person close to her to take action. In the climactic sequence which resembles a silent film, Mrs. Verloc brings murder and retribution home without a line of dialogue but only using her survival instincts and those sad, expressive eyes. Hitchcock shifts from her face, to Homolka's, to the food they are eating, to her holding the knife, until we cannot bear it anymore and in a moment of almost casual surprise, it happens. It's too bad Hitchcock and she did not work again; she would have made an excellent Hitchcock heroine. The Director would explore the theme of the suspicious wife time and again on two other films. In the correctly titled SUSPICION, Joan Fontaine would be the wife who has to come to terms with the gnawing fact that her dashing husband's love may be killing her, and in DIAL M FOR MURDER would bring to focus what was implied in SUSPICION.",
         "What an opening. The power goes off all over London as the camera gives the viewer a sweeping panorama of the situation, light, shadow, blackness, panning throughout the city with emphasis on historical sites. Then one word utterances from several different persons in charge of keeping the power up and running. This beginning grabs the audience's attention better than any other film this side of \"The Letter\" and Hitchcock's own \"Rebecca.\" But unlike \"The Letter\" where the opening is the high point of the entire film, \"Sabotage\" keeps getting better and better. The opening is truly just the beginning of a cinema masterpiece. Hitchcock uses old film techniques such as cross cutting in novel ways. One of the best scenes takes place in a zoo aquarium where water creatures are compared with the human creature. Listen to the dialog between the two saboteurs as the camera zooms in on the sea turtles. Later the bomber thinks of the fish swimming in the tank and then sees motor cars filled with passengers speeding along the streets. An explosion. Suddenly the fish in the tank again flash through the bomber's head. To savor this splendid moment of cinematic brilliance, the viewer may need to zip back and watch and listen as the scene is repeated. What a wonderful acting job Sylvia Sidney does. Hitchcock used all his influence and bargaining power to have Sidney play the part. Unfortunately Hitchcock and Sidney did not jell. Their personalities clashed. So the gifted actress refused to have anything else to do with the masterful director. Such a great loss for each. The way Hitchcock handles the delicate situation involving the cute boy, Mrs. Verloc's (Sylvia Sidney)little brother, riding the bus with a time bomb in a package under one arm while petting a fluffy puppy with his free hand is necessary for what happens at the end of the film. For once, however, Hitchcock misread his movie patrons who were outraged. Never again would he make a similar mistake. An interesting feature of this Hitchcock outing is a cinema owned by the bomber (Oskar Homolka) and his wife (Sidney) where clandestine meetings among the saboteurs occur. Several features are shown in the background from time to time during the film but one stands out, \"Who Killed Cock Robin,\" a Disney short from 1935 featuring a parody of Mae West among others. Hitchcock skillfully blends the clip from \"Cock Robin\" into his story of \"Sabotage.\" Mrs. Verloc deeply depressed and confused following her brother's death hears the laughter coming from the audience. She sits down and joins in with the gaiety. When the arrow is loosed and strikes poor Cock Robin, the laughter on her face changes to an expression of agony and terror. Reality replaces fantasy and make believe. Now she fully realizes what a monster her husband truly is, not the noble sensitive caring man of her dreams. One is reminded how a later director/writer Preston Sturges would use a similar technique with a Mickey Mouse cartoon in his classic \"Sullivan's Travels.\" There is also a clear message by Hitchcock on sabotage, today terrorism; those so-called martyrs for a cause are in reality misguided devils who end up killing the innocent and helpless instead of the ones their feeble minds believe to be the deceivers and exploiters of the human race.",
         "Ah, yet another Hitchcock movie that is less than famous but then turns out to be one of the best films ever made. Every Hitchcock film that I see just makes me want to the rest of his films. Sabotage has a lot going for it. It is based on a novella by Joseph Conrad, the master writer who wrote Heart of Darkness (truth be told, that's the only novel of his that I've read the whole of, but I've been told that he has plenty of great novels besides that; I guess after Sabotage, I'm now obliged to read up). The story is excellent. Mix that with great characters played by great actors, and you've got yourself yet another Alfred Hitchcock masterpiece. Maybe this film is not popular because it is atypical for Hitchcock. It contains tons of suspense, maybe more than any of his films besides Rear Window, especially in a sequence where he demonstrates his famous theory that a bomb that does not go off creates the suspense. No, this film is atypical because it lacks Hitchcock's masterful humor. This is usually taken as one of his trademarks, but I've seen several of his films that lack humor (or at least reduce it), and I find them just as good (I Confess, Rope, and The Birds). Instead, Sabotage may be the most emotionally affecting Hitchcock film, competing with the likes of Vertigo and Rebecca. It gives you characters to care about, especially Mrs. Verloc, played masterfully by Sylvia Sydney as a happy wife who discovers the hard way that her husband is a terrorist (don't worry, no spoilers here; we find this out in the first scene). John Loder plays Ted, a detective who falls in love with Mrs. Verloc, although she is clearly not willing, while undercover at a grocer next door. The best performance is Oskar Homolka's, who plays Mr. Verloc. Only Norman Bates is a more sympathetic villain than Mr. Verloc. We never do see why exactly he wants to sabotage things (and in this way, this movie is quite xenophobic), but we see that he does not wish to harm anyone, and that when he does he only does it through compulsion. He also cares greatly for his wife and her brother. Even at the end of the film, we understand why Mrs. Verloc wants nothing to do with Ted's advances. The film ends with an easy escape, but guilt remains heavy. 10/10",
         "Most buffs and fans of Alfred Hitchcock point to 39 STEPS or LADY VANISHES as his best work before he hit Hollywood in 1940. SABOTAGE is really the first time we see a pure thriller, specifically a spy thriller, which became so commonplace throughout the master's career. The main character is an undercover agent, looking to break up a ring of saboteurs bent on destroying London. Hitch places the head villain within, what else, a cinema, something that adds to the already rich atmosphere. The film was also shot on location, an oddity for Hitch. Check out the camera movements and use of shadows in regard to the villain (played by a creepy looking Oscar Homolka). They reveal a lot to us the viewer and lead us to hope for his wife to figure it all out. An ominous image of London falling is depicted from the point of view of Oscar. This is pretty basic stuff, but, considering how old the film is, it still packs a punch. The scene on the bus, where a young boy carries a film tin which may or may not carry a bomb is extremely suspenseful and well-done. We even see a British crowd in the movie theater watching a Disney flick (which is well noted in the opening credits). 1934's THE MAN WHO KNEW TOO MUCH was an effective early thriller, better than the 1956 remake, however, this is the film to start with if studying Hitchcock's career. You may find yourself preferring some of his British films, like MAN WHO KNEW, to his work in Hollywood. SABOTAGE provides the goods for the first time.",
         "\"Sabotage\" is one of a series of six films in the mid 1930s that firmly created the public image of Alfred Hitchcock as a major film director and artist. The others were \"The Man Who Knew Too Much\" (1934), \"The Secret Agent\", \"The Thirty-Nine Steps\", \"Young and Innocent\", and \"The Lady Vanishes\". The films caught attention in American (especially \"The Thirty-Nine Steps\" and \"The Lady Vanishes\"), and Hitchcock was invited to come to America by David Selznick, who would be his producer from 1939 onward. The other comments on this film have pointed out some of the best moments, such as the explosion scene and the death of Verloc (Oskar Homolka). The film was quite well made, but the film had to be modernized for it's 1937 audiences. Although the foreign power that is behind Homolka's gang is never mentioned, a 1937 audience would have probably considered it was Nazi Germany (which was the suggested enemy in \"The Lady Vanishes\", and \"The Thirty-Nine Steps\". In the original story Verloc is acting for the government of Tsarist Russia, who has sent a high ranking official to London to tell Verloc to commit a terrorist act (to spur anti-Immigrant feelings in London). Verloc does not run a cinema (as in the movie - the novel came out in 1907), but a small store. However, he does sell contraceptive devices, which Conrad hints at but doesn't name. Verloc lives in a fool's paradise with his wife Winnie and her simple-minded brother. He thinks that his wife adores him, but she only tolerates him for the sake of giving her brother a home. When Verloc's plan destroys the brother, it destroys the household. Verloc's world is that of the foreign anarchists in London, none of whom are worthy of the respect their breast beating comments make them think they deserve. One of them is at total war with society, and wears an outfit that a modern suicide bomber would not find amiss (this character is kept in the film, but his impact is reduced by script changes). In the novel, when this \"brave\" anarchist goes out into the public wearing his booby-trapped coat, he suddenly sees the vast multitudes in the street and realizes that no matter how many he kills or maims thousands and millions will replace them - and nobody will replace him! Conrad's \"The Secret Agent\" was called the most completely ironic novel in English. If not it comes close, and is possibly his best novel (\"Lord Jim\" and \"Nostromo\" may be better). The twisted irony of the plot (for all the destruction nothing really changes) is first rate in the writing, but it does not translate too well in this film version. Watch the film for Hitchcock's touches and his directing of Homolka, Sylvia Sydney, and the rest. But read the novel by Conrad for the real treat.",
         "What you'll find is signature Hitchcock touches. Such as the brilliant mobile framing, and how he lets the players use their eyes to tell the story in visual terms. Watch how Mrs. Verlock's face is suddenly stricken when she sees the bird get killed in the cartoon movie right after the moments she tries to laugh her grief off. Look at the beautiful graphic match of the turtle aquarium to Mr. Verlock's sick fantasy of what happens to some buildings. I also really liked the intense scene in the dinner table, that Hitch accentuates with his beautiful camera movement. And oh, that wicked angle when we see Mrs. Verlock right past the doorway, and in the F.G., the feet of the slain Mr. Verlock. I really don't know how Hitch did that double-decker explosion. It was really clever as it was really quick. I hafta see this film again to figure out how they did that train blast. People say this is an elaborately detailed thriller; I can see part of that --- you'll laugh when you watch the last scene where the police officers realize something they didn't earlier. Best of all, SABOTAGE is only 75 minutes in runtime. Yes sir, better than a hundred or 110. Retitled A Woman Alone in the U.S. Grade A+ 10/10",
         "This film makes use of clever reference to locations, often at their darkest and most shadowy - Mr Verloc sabotages Battersea Power Station and brings darkness but his wife Winnie, (Sylvia Sydney) is always radiantly lit. In fact, Hitchcock the illusionist, created the 'locations' with giant photographs (stills exist of the shooting). His classic 'business' is perfectly in place - the contrast between the growing menace of Verloc and the 'English' humour is a characteristic which he refined here. An early cameo of Charles Hawtrey explaining the lives of fish at the aquarium while Verloc plots a bombing, the old lady arguing about a canary with the pet-shop owner who is also a homicidal bomber who keep ingredients in the larder! The latter is also henpecked by his gawky daughter (played by an unrecognisable Martita Hunt, not in Ms Havisham mode).Stevie, the heartbreakingly delightful brother is carrying the bomb to the Lord Mayor's show, while every device a crowd offers holds him up and builds the tension. The scene where Winnie stabs Verloc (Oscar Homolka) is a triumph of understatement - it is banal evil: a struggle over the dinner table - Winnie stabs Verloc almost in one motion without effort, and without a clear purpose. Typically, having disposed of the villain, a trick leaves her free- the bomber strikes before the police can find Verloc's body. Hitchcock shies away from Conrad's bleak ending where Winnie is tricked out of the money and throws herself off a channel ferry. That would not be Hitch's style and this film is very much about style.",
         "French intellectuals probably love Sabotage: Story and pace might not hold the interest of the general public for long, but this movie is a multi layered affair with a lot of stuff to analyze. I read Joseph Conrad's sadly prophetic novel about terrorism in our modern day world before I knew that a Hitchcock treatment existed, and I just admire how the master of suspense succeeded in adapting the story (written around the year 1900) to the conditions in \"Hitchcockland\". There is suspense, there are funny scenes, but Sabotage is, compared with The Man Who Knew Too Much or The 39 steps, a rather serious movie that investigates the dark sides of the condition of human nature in modern times. There are different particularities that I think are quite unique and worth a comment. POSSIBLE SPOILERS AHEAD Certain parts of Sabotage seem to pay tribute to the silent era expressionist and avant garde heritage of Germany and the Soviet Union. The movie starts in an impressive, unforgettable way: First we see a dictionary, then Battersea Power Station with one smoking chimney in the moonlight, then a gaudily lit city street at night. The lights in the street go out; change to a piece of big machinery half in water, lit only by a flashlight; several hands excitedly fussing with the machinery, digging up a muddy substance from the water, rubbing the substance between the fingers. Then the first words of the movie are spoken by an anonymous voice: \"Sand!\". Then another voice \"Sabotage!\". Then a third voice: \"Who did it?\" With a quick succession of different scenes \u0096 partially accompanied with a nasty humming sound like from a generator - the viewer is brought right into the movie. The audience is now informed about the dark nature of the subject \u0096 terrorism - and the wanted atmosphere is firmly established. The use of spaces or spatial sequences is extraordinary. They have a symbolic significance that in my opinion is uncommon in later Hitchcock movies. The main character, Mr. Verloc, operates a small, shoddy movie theatre, the Bijou. He lives, together with his young wife and her brother, in a small appartment behind the movie screen. Whoever wants to visit the Verlocs walks up to the ridiculously pompuous, brightly lit front of the Bijou, passes through the front into the dark, stuffy small screening room, walks towards the screen, passes it and is at the Verloc's door. Mr. Verloc, a twisted character without discernible ethnic or ethical roots, executes acts of sabotage or terrorism for whoever pays him. The sequence of light and darkness that lead from the outside to the \"brain\" that concocts acts of madness is repeatedly shown in the movie. A detective tries to squeeze himself into the space behind the screen in an attempt to spy, but there he is unprotected and spotted by the people in the appartment. At the end of the movie, Mrs. Verloc, fleeing from the appartment when she understands that Mr. Verloc caused her brother's death, gets stuck in the \"dream zone\" of the screening room. She stops and watches a sequence of a Disney animated picture, somehow re enacting her brother\u0091s carefree life and its brutal end. The movie in the movie makes her state of distress more acute. She turns back to the appartment and finally stabs Mr. Verloc to death. A similar spatial sequence as in the Bijou is shown in a pet shop. In its back room a bomb is prepared for Mr. Verloc by the owner, an equally miserable and twisted character. Again there is a \"respectable\" front, a middle zone with a surreal situation (many caged exotic animals), and a stuffy back room for a chaotic unconventional family of three (in this case father, daughter, granddaughter) where modern-day sciences are turned into a senseless destructive force. The meeting between Mr. Verloc and his anonymous employers (as in Conrad's novel, it is never explained who they are and in whose favor the acts of terrorism should be) takes place in the zoo, in a dark cavern with windows into different aquarium (I strongly suspect Orson Welles of having copied the set with few alterations for The Lady from Shanghai). The conspiracy thus takes places in a subterranean commando bunker (a predecessor of Ken Adam's war room) from which you do not see a clearly defined \"battlefield\" but just murky waters and strange, silent creatures moving through space in slow motion. In a short, dream like sequence the scared Mr. Verloc sees through one of the aquarium windows Piccadilly Circus distorted and destroyed by the bomb he is ordered to plant there. In Sabotage the sets are very important. The character's lives are conditioned by their surroundings. They move little. There is not too much action and the viewers of the movie are required to watch carefully. Maybe this is Hitchcock at his most uncommercial ..."
      ],
      "genres": ["Thriller"],
      "productionCompanies": ["Gaumont British Picture Corporation"],
      "summaries": [
         "Mr. Verloc is part of a gang of foreign saboteurs operating out of London. He manages a small cinema with his wife and her teenage brother as a cover, but they know nothing of his secret. Scotland Yard assign an undercover detective to work at the shop next to the cinema in order to observe the gang.",
         "Mr. Verloc, a cinema owner, is part of a gang of saboteurs in London. He lives with his wife, Sylvya, and her young brother, Stevie. They know nothing about Verloc's secret. Scotland Yard assigns an undercover detective, Ted, to work in a shop near the cinema and investigate the man. The head of the gang assigns Verloc to put a bomb in the metro. The man sends Stevie there with the \"bag\".",
         "A Scotland Yard undercover detective is on the trail of a saboteur who is part of a plot to set off a bomb in London. But when the detective's cover is blown, the plot begins to unravel."
      ],
      "budget": 0
   },
   "movielensId": 2210,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1936-12-02",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Alfred Hitchcock"],
      "runtime": 76,
      "movieId": 2210,
      "title": "Sabotage",
      "mpaa": "NR",
      "actors": [
         "Sylvia Sidney",
         "Oskar Homolka",
         "Desmond Tester",
         "John Loder",
         "Joyce Barbour",
         "Matthew Boulton",
         "S.J. Warmington",
         "William Dewhurst",
         "Clare Greet"
      ],
      "imdbMovieId": "0028212",
      "originalTitle": "Sabotage",
      "genres": [
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": ["EMmBpc1hSgo"],
      "plotSummary": "A Scotland Yard undercover detective is on the trail of a saboteur who is part of a plot to set off a bomb in London. But when the detective's cover is blown, the plot begins to unravel.",
      "tmdbMovieId": 12684,
      "avgRating": 3.70083,
      "releaseYear": "1936",
      "numRatings": 605,
      "posterPath": "/9DM9MPN6jtvIhqvadCFTPBQZwiW.jpg"
   }
}