{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "switzerland",
            "id": 1223
         },
         {
            "name": "world war i",
            "id": 2504
         },
         {
            "name": "suspense",
            "id": 9937
         }
      ],
      "imdb_id": "tt0028231",
      "video": false,
      "title": "Secret Agent",
      "recommendations": [
         2762,
         12684,
         36049,
         31995,
         8208,
         52748,
         4175,
         25670,
         5780,
         52907,
         26718,
         48140,
         144690,
         53425,
         47695,
         49275,
         59195,
         41647,
         50916,
         36236
      ],
      "backdrop_path": "/lcHctJFRqt2LFvZyGlspXsGGJOy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 22,
               "character": "Edgar Brodie/Richard Ashenden",
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052c15",
               "name": "John Gielgud",
               "profile_path": "/jvTSqk7cuOrsdtf037olQ9BKRAe.jpg",
               "id": 11857,
               "order": 0
            },
            {
               "cast_id": 23,
               "character": "Der „General“",
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052c19",
               "name": "Peter Lorre",
               "profile_path": "/6V1Jd8qN0PV76xJce7cJsqkQ55R.jpg",
               "id": 2094,
               "order": 1
            },
            {
               "cast_id": 24,
               "character": "Elsa Carrington",
               "gender": 1,
               "credit_id": "52fe436bc3a36847f8052c1d",
               "name": "Madeleine Carroll",
               "profile_path": "/pDsBAfEuYtjd36RXvEqzSm10LeL.jpg",
               "id": 3610,
               "order": 2
            },
            {
               "cast_id": 25,
               "character": "Robert Marvin",
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052c21",
               "name": "Robert Young",
               "profile_path": "/yD74ANflpVXQPci4cihAg63BfK7.jpg",
               "id": 14868,
               "order": 3
            },
            {
               "cast_id": 26,
               "character": "Caypor",
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052c25",
               "name": "Percy Marmont",
               "profile_path": "/p3DIyvlxx6B0SVIxcDaPUPlEV0U.jpg",
               "id": 27929,
               "order": 4
            },
            {
               "cast_id": 27,
               "character": "Mrs. Caypor",
               "gender": 1,
               "credit_id": "52fe436bc3a36847f8052c29",
               "name": "Florence Kahn",
               "profile_path": null,
               "id": 27930,
               "order": 5
            },
            {
               "cast_id": 28,
               "character": "„R“",
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052c2d",
               "name": "Charles Carson",
               "profile_path": "/qc6tbPVk6zV2OOk8fO2c6YjUl9s.jpg",
               "id": 27931,
               "order": 6
            },
            {
               "cast_id": 29,
               "character": "Lilli",
               "gender": 1,
               "credit_id": "52fe436bc3a36847f8052c31",
               "name": "Lilli Palmer",
               "profile_path": "/9nEJhELLIkkdlhYwnhGuLYnihbE.jpg",
               "id": 27932,
               "order": 7
            },
            {
               "cast_id": 30,
               "character": "Army Captain (uncredited)",
               "gender": 0,
               "credit_id": "584553309251416a74014ff1",
               "name": "Michael Rennie",
               "profile_path": "/ebIHXyh1wx0HJqSpNEnGhYdmTvd.jpg",
               "id": 12282,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052b9f",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052ba5",
               "name": "W. Somerset Maugham",
               "profile_path": "/mseHL0TUkLcRXds5Pwjmbec8hyt.jpg",
               "id": 27916,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052bab",
               "name": "Campbell Dixon",
               "profile_path": null,
               "id": 27917,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bb1",
               "name": "Charles Bennett",
               "profile_path": null,
               "id": 3599,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052bb7",
               "name": "Ian Hay",
               "profile_path": null,
               "id": 27918,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bbd",
               "name": "Jesse Lasky Jr.",
               "profile_path": null,
               "id": 27919,
               "department": "Writing",
               "job": "Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bc9",
               "name": "Michael Balcon",
               "profile_path": "/jBxdXgRs386mJztdmYtCQznwtIi.jpg",
               "id": 3601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bcf",
               "name": "Ivor Montagu",
               "profile_path": "/ghOw5IggdsSW7y2pteCyblaTxQW.jpg",
               "id": 3602,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052bd5",
               "name": "Hubert Bath",
               "profile_path": null,
               "id": 3603,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bdb",
               "name": "Bernard Knowles",
               "profile_path": null,
               "id": 3606,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052be1",
               "name": "Charles Frend",
               "profile_path": null,
               "id": 27920,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052be7",
               "name": "Oscar Friedrich Werndorff",
               "profile_path": null,
               "id": 27921,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bed",
               "name": "Joe Strassner",
               "profile_path": null,
               "id": 27922,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bf3",
               "name": "Albert Jullion",
               "profile_path": null,
               "id": 27924,
               "department": "Costume & Make-Up",
               "job": "Set Dressing Artist"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052bf9",
               "name": "Phillip Dorté",
               "profile_path": null,
               "id": 27925,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052bff",
               "name": "Stephen Dade",
               "profile_path": null,
               "id": 27926,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052c05",
               "name": "Reg Johnson",
               "profile_path": null,
               "id": 27927,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe436bc3a36847f8052c0b",
               "name": "Gerry Massy-Collier",
               "profile_path": null,
               "id": 27928,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe436bc3a36847f8052c11",
               "name": "Louis Levy",
               "profile_path": null,
               "id": 3613,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 4.155639,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 2761,
      "vote_count": 43,
      "budget": 0,
      "overview": "After three British agents are assigned to assassinate a mysterious German spy during World War I, two of them become ambivalent when their duty to the mission conflicts with their consciences.",
      "similar": [
         681,
         954,
         37724,
         36669,
         2502,
         646,
         668,
         949,
         956,
         189,
         213,
         27576,
         36955,
         49517,
         336843,
         341013,
         691,
         8834,
         916,
         56288
      ],
      "original_title": "Secret Agent",
      "runtime": 86,
      "poster_path": "/i1LsfCAuZWZsI5S5ewvQ3RCrXOc.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Gaumont British Picture Corporation",
         "id": 4978,
         "origin_country": ""
      }],
      "release_date": "1936-06-12",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 86,
      "synopsis": "It is 1916 after the beginning of the First World War, in London. A somber group is filing past a casket surrounded by candles. The butler sees everyone out, locks the door, then takes down the casket, which is empty. Next we are at a British intelligence office in the middle of an air raid, and an officer in uniform comes in, holding a newspaper that seems to announce his own death. The officer, a writer by profession, (John Gielgud), is given false passports with the name Ashenden, introduced to an assistant (Peter Lorre) who goes by the nickname General, and told to proceed in disguise to Switzerland, Hotel Excelsior, and await further instructions. The instructions are to identify a German undercover agent who is at the hotel and about to leave Switzerland for Istanbul, then to prevent the German agent from reaching his destination by any means necessary. In Switzerland we see an old man buy a bar of chocolate, open it, and read a hidden message that a British spy is expected to arrive at the hotel Excelsior. Ashenden checks into the hotel and learns that Mrs. Ashenden (Madeleine Carroll) had arrived the day before. He goes to the rooms reserved for the couple and finds Mrs. Ashenden in conversation with an American, Mr. Marvin (Robert Young), who has been insinuating himself to her. The fake Ashenden couple have their initial conversations to get acquainted, and the General comes in also. Ashenden and the General go to the church to meet the organist, a supposed double agent, to get more information, but they find the organist dead at the organ, with a special type of button in his fist. Back at the hotel they strike up a conversation with a British tourist, they all go to the casino together, and are surprised when the torn button appears to come from the British tourist's coat sleeve, supposedly identifying the tourist as the killer of the organist. The group, including Marvin, have dinner at the same table, and meet the wife of the tourist, who is German and says this trip is the first time she has ever been out of Germany. Ashenden and the General make bets about which of them is a better mountain hiker. They convince the British tourist to go up a nearby mountain the next day, where they plan to murder him. Ashenden has misgivings in participating in a murder, and tries to turn back from the climb, but the General continues up the mountain and pushes the tourist off a cliff. Back at the hotel they receive word that they have identified the wrong man and thus murdered an innocent Briton. This causes consternation and conflict between the Ashendens, he taking the view that he was on an assignment in wartime, she that the murder of an innocent is too high a price to pay even in wartime. This moral conflict is a continuing source of much anguish for both of them, who are otherwise much attracted to each other. Meantime, the General has snooped around and found that the chocolate factory is a center for spy messages, and talks Ashenden into going there to try to get more information from the boyfriend of one of the hotel maids, who has a job at the factory. Mrs. Ashenden decides she wants to resign from her spying assignment and separate herself from her fake husband, and, having no special place to go, she decides to go with Marvin on the next leg of his train trip. At the chocolate factory Ashenden and the General are fingered as British spies and the police is called. They stage an emergency and pull a fire alarm to create chaos, and succeed in evading the police and returning to the hotel, where they find Mrs. Ashenden gone (accompanying Marvin) and also get a coded telegram that identifies Marvin as the agent. They manage to get to the train station, warn Mrs. Ashenden that Marvin is their target, and she agrees to resume her spy duties by pretending to be romantically interested in Marvin. They get on a train that eventually crosses into neutral territory and then into another country at war against Britain. As they confront Marvin in a compartment and he admits being a German agent, British planes attack the train, producing a train wreck. Marvin is mortally wounded, the General is shot dead, and Mr. and Mrs. Ashenden, now in love with each other, are able to return to England without having had to physically murder anyone. A brief epilogue follows, showing the triumph of British forces in the Eastern (Turkish) front.",
      "writers": [
         "Campbell Dixon",
         "W. Somerset Maugham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0028231/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxMjI1MjE1NV5BMl5BanBnXkFtZTgwOTIzNTQ1MjE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: John Gielgud, Madeleine Carroll, Robert Young | See full cast and crew »"],
      "reviews": [
         "A young British army officer is 'killed off' on the Western Front so that he can assume a false identity and go to Switzerland on a secret mission. Brody (or Ashenden, as he is now known) finds the dirty business of espionage distasteful, but is determined to see his mission through to a successful conclusion. In this early Hitchcock thriller, John Gielgud plays Ashenden as a cheerless snob. His acting is wooden and unappealing, and his embraces with Elsa (Madeleine Carroll)are cold and unconvincing. Peter Lorre is an over-the-top delight as 'the General', the exotic and nasty little assassin. His toilet-paper tantrum is great fun, and he moves the plot along with superb little nuances of gesture (as when he follows the progress of the chocolate-box note). There are some striking Hitchcockian moments. Is that the Master himself, coming down the ship's gangway ahead of Ashenden? The dead organist is 'playing' a constant discord alone in the Langenkirche, because his lifeless head is slumped on the organ keys. In a classic piece of tension-building, Hitchcock makes the organ sound swell dramatically as Ashenden and the General, unsuspecting, approach the body. Of course the corpse shouldn't be able to increase the organ's volume. That doesn't matter. The effect is great. The scene shifts from London in an air raid to the Swiss Alps (and as a postscript, to the Bulgarian-Greek border). The main locations are attractively depicted, London's sky a lattice of searchlights, and Switzerland a mountain idyll. Hitchcock plays clever tricks with the button found in the dead man's hand. It sets our heroes off in pursuit of Caypor, and then it comes back to haunt Elsa's conscience. When the folk singers swirl coins in bowls, Elsa can see only the infernal button. It does not bother the viewer that the coincidences surrounding the button are far-fetched, because the pace and confidence of the story-telling suppresses any incipient scepticism. The incident on the Langen Alp is in many ways the film's climax, with Hitchcock's trademark suspense-building very much to the fore. As the much-dreaded moment draws near, the cuts to the polite German conversation class raise the viewer's anxiety to an unbearable pitch. Caypor's frantic dog is a masterly touch: the women and the pet know intuitively that the worst has happened. Soon afterwards, Elsa sits silent in her misery between Ashenden and the General, who both chat blithely across her. The camera closes in on her, explaining her feelings of guilt better than any dialogue could. Throughout his long career, Hitchcock pursued a specific ideal of feminine beauty. Kim Novak and Tippi Hedren were its 1960's manifestation, and here in 1936 Madeleine Carroll is the fresh-faced girl with the fine bone structure and the blonde bob. The arbitrary deaths in the final reel are silly, and the crash of the model train even sillier, but by this stage the director has eschewed exposition and is hurrying to tie up the plot's loose ends. Even if the viewer thinks hard, he is at a loss to explain what Ashenden was ever doing in Switzerland in the first place: but the trick is not to think too hard.",
         "While not one of Hitchcock's most well-known films, \"Secret Agent\" is one of his most creative. His version of the world of espionage is quite different from, and much richer than, the usual James Bond-type spy story. This movie is also distinguished by large doses of good humor and by some creative uses of the story's setting in Switzerland. John Gielgud plays Ashenden, an English spy in World War I. He is assigned to go to Switzerland, determine the identity of an important German agent, and then stop the enemy agent before he can carry out his mission. Gielgud has two assistants: a young agent posing as his wife (Madeleine Carroll) and an eccentric assassin (Peter Lorre). What makes the film interesting is that Gielgud's character is not at all the stereotyped dashing movie spy, and he has a keen sense of the human cost involved in what he is doing. By contrast, his two assistants are both excited about the mission, and look forward to the game of tracking down and eliminating their quarry. As the story proceeds, it is the reluctant but responsible Ashenden who persists in continuing the mission in spite of some bad surprises, while the once enthusiastic \"Mrs. Ashenden\" quickly begins to lose heart when she realizes what espionage is really all about. At the same time, the twists and turns of the mission itself lead to some interesting and tense developments. This is all handled with Hitchcock's usual mastery of suspense and irony. Hitchcock also makes full use of the setting, and typical Swiss themes like mountain climbing, chocolate, and folk dancing are all part of the plot. Hitchcock makes use of these elements in a natural way, not forcing them into the plot, and the whole production is nicely crafted. There are some excellent scenes, including a scene in an old country church that combines humor and suspense, and a chase through a chocolate factory. Because its hero has a reluctance about his mission that we do not expect in our spy heroes, \"Secret Agent\" has never been one of Hitchcock's most popular films. And the story does have some odd aspects to it. But this is quite a good film, worthy of attention, and one that shows many aspects of the great director's skill and imagination.",
         "This, in my opinion, is one of the master's best early films, so good, in fact, that it begs for repeat viewing. That is the only way I know to absorb the subtle verbal repartees (observe the fascinating expressions and body language of Madeleine Carroll as she repeatedly defends herself from the blandishments of the affable American played by Robert Young); the hilarious malapropisms and convoluted syntax courtesy of the unpredictably eccentric Peter Lorre (there is good reason to believe this was unfeigned because Mr. Lorre, a Hungarian by birth who had achieved a well-deserved reputation as a chilling screen presence in German cinema before leaving for England following the National Socialist take-over, had not yet mastered the nuances of the English language); the classic understatement by that most aristocratic of all British actors, John Gielgud; and for those of us who never tire gazing at the incomparably beautiful Madeleine (Elsa) Carroll, the camera angles finally do justice to her divinely-wrought features (she also delivers her usual elegantly controlled performance). And, of course, there is all of the excitement and suspense one comes to expect from the great Alfred Hitchcock... Needless to say, I highly recommend this film.",
         "\"Secret Agent\" seems to be one of Hitchcock's most (unjustly) overlooked films. It may be flawed and technically creaky, but Hitchcock's talent is evident throughout. It's made with precision and has several first-rate sequences (the one involving a dog's howling is probably the greatest). Lorre overacts unnecessarily in this film, but the other actors are effective and convincing. Gielgud brings depth to a character whose motives aren't always clearly explained by the script. The plot, after the first big twist, gets quite predictable but still sustains the viewer's interest. Overall, this is an absorbing film and the director's fans will definitely appreciate it.",
         "Despite the abject absurdity of Hitchcock's \"Secret Agent\", I adored it. The film starts off as a farcical story following John Gielgud and Madeline Carroll - two novice British spies - hunting down a German agent with the help of a more experienced man - \"The General\" - a Mexican hilariously played by Peter Lorre. With these principal players, it should be no surprise that the performances are top-notch. However, given the fact that Lorre was, at the time, at one of the lowest points in his tumultuous but brilliant career, it is possible that his over-the-top and uncharacteristically comedic performance at least began unintentionally (and was exploited by the great director as a last-ditch effort to complete the film successfully). The story is based rather loosely on a Somerset Maugham story translated for theater by Campbell Dixon then adapted by Hitchcock favorite Charles Bennett. Quite a bit, as you can well imagine, changes as a result of the translations from medium to medium. The drama turns on a developing romance between Gielgud and Carroll's characters - and the burgeoning consciences which accompany it. Will they be able to carry out their patriotic duty if and when they finally track down their opponent, or will they fail? Furthermore, what will the zealous and perhaps a little psychotic General do if his co-conspirators drop out of the spy business at the last instant? Typical Hitchcock plot devices (i.e. trains, quirky romantic relationships, European ethnic stereotypes) make cameo appearances at appropriate points in the story, and enhance the experience for Hitchcock aficionados. The script and general story-line is not one of the best Hitchcock would have access to throughout his career, but it is quite rich compared to some of the plots he worked with earlier in his career, and the director develops the comedy, suspense, and human drama economically and affectively, if not fully. The camera-work is, of course, good, but not nearly as experimental or interesting as many of Hitchcock's earlier and later films. This is generally true of most of Hitchcock's excellent efforts for Gaumont British Pictures of America during the 1930s (I.e. Sabotage, 39 Steps, etc) - very British films made with American/British casts and production for an international audience. Though less suspenseful than many of Hitchcock's contemporaneous efforts, Secret Agent remains a good and entertaining example of Hitchcock in the 1930s.",
         "When the topic of spy movies comes up, James Bond is usually one of the first names to arise. But even spy movies had a beginning, and sure enough, in the first couple decades of cinema, who was there making spy movies? Alfred Hitchcock. Like the other spy movies he did, (Take Torn Curtain and Topaz for instance, two of his later works. How much later? Nearly 40 years later), Secret Agent is a spy movie without lots of explosions or car chases or shootouts. Instead it is about a man who goes undercover to break up a potentially disastrous international agenda of some kind, and along the way falls in love with his partner and realizes that he's not up to the task of murdering someone. This 1936 movie is another in Hitchcock's decade-long run of British talkies: highly-contrasted black and white, under 90 minutes generally, and devoid of major stars (except for Peter Lorre, who appears in this movie two years after he did The Man Who Knew Too Much). But unlike many of the movies surrounding it (Young and Innocent, The 39 Steps), this one isn't quite as good. Not that Secret Agent is a bad movie, far from it: The directing is fine, and the church-murder scene is a beautiful mix of sound and picture. Lorre is much like the male version of Bette Davis - overacting and proud of it. His role as the womanizing yet clever \"General\" is much lighter than his usual horror-laced stuff, and he still pulls it off with ease. The leads are equally good. And the humor laced throughout is genuinely funny. (Note that, even in 1936, it is obvious that Hitchcock was already looking for the actress that would be fulfilled in Grace Kelly - the strong, feisty, beautiful blonde leading lady.) But there's nothing here to just make the jaw drop and the eyes widen. It is a good movie, and from a director that has had whole decades worth of *great* movies, it just seems subpar. A previous commentor was right: This was the movie for Hitchcock to remake in the 1950s (with color and Cary Grant and Grace Kelly - heck, maybe even a minor role for Jimmy Stewart), not The Man Who Knew Too Much, which was one of his best British films. Overall, it is good and worth the watch - especially for Hitchcock fans, but it's just not quite *there*. 7/10",
         "Actually Gielgud is not bad at all as the novelist turned soldier turned spy. He has a fine, brittle way with a one-liner. Madeleine Carroll is excellent. This being Hitch, there are some tense scenes, like the one where the alleged baddie's wife is giving Madeleine a German lesson. As she stumbles over \"Was kostet es...?\" she can't help thinking about what's happening to the woman's husband. So the gossip is that Gielgud was persuaded to play the role because it was \"Shakespearean\", and his disappointment shows through? What an incredibly silly theory. Next you'll be telling me that you can see ghostly figures in the net curtains. But I can believe Hitch told Gielgud the character was like Hamlet. What happened to Hamlet? (Now listen carefully, this could help with your English essay.) He was told by a mysterious figure that it was absolutely necessary for him to kill a man. He spends a lot of the play wondering if he should, and wondering about the moral implications, and incidentally kills an innocent bystander. Now d'you get it?",
         "This espionage film concerns about Ashenden (John Gielgud), a secret agent is sent Switzerland to kill an unknown enemy spy . There he deals with various characters , as a quirky Mexican general (Peter Lorre), a smart gentleman (Robert Young) and a gorgeous woman (Madeleine Carrol) who poses as his wife , causing the classic loving triangle (Gielgud , Carrol , Young). The movie is based on Somerset Maughan's novels titled : Ashenden , taken from ¨The Traitor\" and \"The Hairless Mexican\" spy stories. This enjoyable picture blends action , a love story , comedy , adventures , thriller , suspense and results to be quite entertaining . Hitchcock said about this film being well developed in Switzerland , it's plenty of typical elements , such as : folkloric dances , Swiss Alps , lagoons and a chocolate factory . Alfred Hitchcock convinced John Gielgud to play the lead by describing the hero as a modern day Hamlet ; Gielgud, however, ended up hating that his character was an enigma and felt Hitchcock made the villain more charming than the hero . Besides , it contains the usual Hitch's touches and the elegant as well as intelligent baddie (repeating in posterior films as James Mason at ¨North by Northwest¨) , the enticing blonde (as later happened with Grace Kelly and Kim Novak) , the filming on the train (a very agreeable vehicle for the director) . It's an uneven movie and Hitch wasn't proud but it had excessive irony as he said in the famous interview with Francois Truffaut . Rating : Good , well worth watching . The motion picture will appeal to Hitchcock fans . Essential and indispensable seeing for Hitch lovers .",
         "One of the more ignored early Hitchcock thrillers, and unjustly so. In 1916 Switzerland, Bookworm John Gielguld, Beautiful Maddeline Carroll and and Pesky, over sexed Peter Lorre are three very unlikely enlisted civilians made to assassinate an unknown foreign agent. One right after another fall superb Hitichcock scenes, high on visuals, in no need of dialog. Such scenes include Gielguld and Lorre discovering a murdered agent in a noisy Swiss church, an assassination seen through a telescope while the victim's dog howls mournfully, a chase through a chocolate factory. What hurts the film is Lorre's shameless overacting, and the too neat ending. It's as if Hitchcock decided \"This is beginning to ramble, let's have an explosion here.\" Don't be put off by co-star Robert Young's comic relief, there's a reason for it. I could picture a 1950's remake, in Vistavision in color with Cary Grant, Grace Kelly and a more restrained Peter Lorre.",
         "Hitchcock was an extremely visual film-maker as a rule and this film took an entirely different direction. What I remember most are the sounds - or more specifically, the noises. The discordant sound of the organ, for example, stands out. It isn't pretty and why should it be? The organist's dead after all. The noise in the chocolate factory is a continuous din relieved only by a fire alarm! Then, two of the main characters are caught in the bell-tower of a church when the bells begin to ring. Again, the sound isn't pleasant at all but quite annoying. A \"musical\" scene with yodelers ends up with coins being swirled around plates and is almost overbearing. The dog's howling in its psychic moment is long and unnerving. In all, these sound effects set the audience on edge which I think was part of the original plan. The two central characters are uneasy with their task and we are made to suffer too. This is an unusual film for Hitch and well worth the time. Curtis Stotlar"
      ],
      "genres": [
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Gaumont British Picture Corporation"],
      "summaries": [
         "During the first world war, novelist Edgar Brodie is sent to Switzerland by the Intelligence Service. He has to kill a German agent. During the mission he meets a fake general first and then Elsa Carrington who helps him in his duty.",
         "Novelist-turned-soldier Edgar Brodie is recruited by British intelligence during World War I to ferret out a mysterious German spy and eliminate him. Brodie is given a new identity by his \"handler,\" R, and teamed with two professional agents, an amoral, but amusingly deadly assassin known as The General and Elsa Carrington, a beautiful blonde who will pose as his wife and cover for his new identity. After they mistakenly target an innocent old man as the operative and The General cold-bloodily murders him, both Edgar and Elsa question the morality of the mission, especially when The General only finds amusement in the blunder. When they eventually discover the spy's true identity, Elsa is determined to stop her two fellow agents from fulfilling the mission.",
         "British soldier and novelist Edgar Brodie returns home during WWI to find that a government agency has faked a report of his death. They get him to change his name to Richard Ashenden and travel to Switzerland to track down a German agent.",
         "After three British agents are assigned to assassinate a mysterious German spy during World War I, two of them become ambivalent when their duty to the mission conflicts with their consciences."
      ],
      "budget": 0
   },
   "movielensId": 2211,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1936-06-12",
      "dvdReleaseDate": "1999-07-24",
      "directors": ["Alfred Hitchcock"],
      "runtime": 86,
      "movieId": 2211,
      "title": "Secret Agent",
      "mpaa": "PG",
      "actors": [
         "John Gielgud",
         "Peter Lorre",
         "Madeleine Carroll",
         "Robert Young",
         "Percy Marmont",
         "Florence Kahn",
         "Charles Carson",
         "Lilli Palmer",
         "Michael Rennie"
      ],
      "imdbMovieId": "0028231",
      "originalTitle": "Secret Agent",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "After three British agents are assigned to assassinate a mysterious German spy during World War I, two of them become ambivalent when their duty to the mission conflicts with their consciences.",
      "tmdbMovieId": 2761,
      "avgRating": 3.40824,
      "releaseYear": "1936",
      "numRatings": 267,
      "posterPath": "/i1LsfCAuZWZsI5S5ewvQ3RCrXOc.jpg"
   }
}