{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "concert",
            "id": 6029
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "shootout",
            "id": 10950
         },
         {
            "name": "scream",
            "id": 13124
         },
         {
            "name": "clue",
            "id": 33514
         },
         {
            "name": "dentist",
            "id": 33780
         },
         {
            "name": "hypnotism",
            "id": 156835
         },
         {
            "name": "ski resort",
            "id": 162328
         },
         {
            "name": "brawl",
            "id": 174244
         },
         {
            "name": "assassination plot",
            "id": 179577
         },
         {
            "name": "corrupt church",
            "id": 236595
         },
         {
            "name": "cymbals",
            "id": 236911
         },
         {
            "name": "sharpshooting",
            "id": 239769
         },
         {
            "name": "royal albert hall",
            "id": 239770
         },
         {
            "name": "band of criminals",
            "id": 239772
         },
         {
            "name": "worship service",
            "id": 239773
         }
      ],
      "imdb_id": "tt0025452",
      "video": false,
      "title": "The Man Who Knew Too Much",
      "recommendations": [
         2761,
         31995,
         12684,
         31997,
         260,
         4175,
         2762,
         940,
         543,
         22527,
         47695,
         11462,
         36049,
         4174,
         2760,
         25670,
         31930,
         13321,
         52748,
         30159
      ],
      "backdrop_path": "/tHl3s4uIB3N1AuVRxVid94YTFZE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Bob Lawrence",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e89f",
               "name": "Leslie Banks",
               "profile_path": "/3gElBkEymTBwbLX8sWyOSAP7cgG.jpg",
               "id": 20502,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Jill Lawrence",
               "gender": 1,
               "credit_id": "52fe4496c3a36847f809e8c3",
               "name": "Edna Best",
               "profile_path": "/6tMqTNRUC4y9fV75e6XEyrjeMi6.jpg",
               "id": 88569,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Abbott",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8a3",
               "name": "Peter Lorre",
               "profile_path": "/6V1Jd8qN0PV76xJce7cJsqkQ55R.jpg",
               "id": 2094,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Ramon Levine",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8af",
               "name": "Frank Vosper",
               "profile_path": "/wugGmN7jgfep7ZWJQiA4NOxg9nB.jpg",
               "id": 54036,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Clive",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8ab",
               "name": "Hugh Wakefield",
               "profile_path": "/jabwCFl1FVspfB79nvqJmkZeQx3.jpg",
               "id": 54035,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Betty Lawrence",
               "gender": 1,
               "credit_id": "52fe4496c3a36847f809e8b3",
               "name": "Nova Pilbeam",
               "profile_path": "/l6oHJaRYrVxsvoTSmMS5wIXaei5.jpg",
               "id": 27939,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Louis Bernard",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8a7",
               "name": "Pierre Fresnay",
               "profile_path": "/wrNThmczgvtyyzxGtrHvFdlO6jV.jpg",
               "id": 11546,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Nurse Agnes",
               "gender": 1,
               "credit_id": "52fe4496c3a36847f809e8b7",
               "name": "Cicely Oates",
               "profile_path": null,
               "id": 54037,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Binstead (as D.A. Clarke Smith)",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8bb",
               "name": "D.A. Clarke-Smith",
               "profile_path": null,
               "id": 54038,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Gibson",
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8bf",
               "name": "George Curzon",
               "profile_path": null,
               "id": 27942,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Mrs. Brockett (uncredited)",
               "gender": 1,
               "credit_id": "5a114fa0925141618400344f",
               "name": "Clare Greet",
               "profile_path": null,
               "id": 37870,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "The Dentist George Barbor (uncredited)",
               "gender": 2,
               "credit_id": "5a11502ac3a368628004dd31",
               "name": "Henry Oscar",
               "profile_path": "/gXizk8UgTrPrZNj9vdTQbSQN39e.jpg",
               "id": 47396,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e889",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e88f",
               "name": "Michael Balcon",
               "profile_path": "/jBxdXgRs386mJztdmYtCQznwtIi.jpg",
               "id": 3601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4496c3a36847f809e895",
               "name": "Hugh Stewart",
               "profile_path": null,
               "id": 54033,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4496c3a36847f809e89b",
               "name": "Curt Courant",
               "profile_path": null,
               "id": 29548,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4496c3a36847f809e8c9",
               "name": "Charles Bennett",
               "profile_path": null,
               "id": 3599,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4496c3a36847f809e8cf",
               "name": "D.B. Wyndham-Lewis",
               "profile_path": null,
               "id": 1174346,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 11.07383,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 8208,
      "vote_count": 94,
      "budget": 0,
      "overview": "While vacationing in St. Moritz, a British couple receive a clue to an imminent assassination attempt, only to learn that their young daughter has been kidnapped to keep them quiet.",
      "similar": [
         123109,
         8090,
         4771,
         562,
         27576,
         984,
         1266,
         357096,
         1696,
         158011,
         26390,
         37645,
         9299,
         1949,
         979,
         96,
         275,
         948,
         1572,
         4638
      ],
      "original_title": "The Man Who Knew Too Much",
      "runtime": 76,
      "poster_path": "/AvOa83nHSNJBpOPK0IJLz01r0c6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Gaumont British Picture Corporation",
         "id": 4978,
         "origin_country": ""
      }],
      "release_date": "1934-11-30",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Public Enemy No. 1 of all the world...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "£",
      "directors": ["Alfred Hitchcock"],
      "runtime": 75,
      "synopsis": "Thrilling Hitchcockian adventure where Banks & Best run into intrigue as their daughter is kidnapped, so that they will not reveal information that has come into their possesion. Sinister characters led by Lorre make sure they cannot approach the authorities. Thrilling climax for even those of us jaded by decades of thrillers produced since this gem was produced",
      "writers": [
         "Charles Bennett",
         "D.B. Wyndham-Lewis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0025452/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5MDQ4NDUyM15BMl5BanBnXkFtZTgwNDkzNjY3MzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Leslie Banks, Edna Best, Peter Lorre | See full cast and crew »"],
      "reviews": [
         "Both versions of Hitchcock's \"The Man Who Knew Too Much\" are well worth watching, and each one has its own strong points. While this British version cannot match the Hollywood remake in terms of star power and lavish production, it has several strengths of its own: it is fast-paced, filled with wit, and nicely atmospheric. Despite being 20 years older, it is also more 'modern' in its portrayal of the woman whose child is kidnapped. Aside from Peter Lorre, always a big plus to any movie, the cast does not have too many names that would be familiar to today's audiences, but they all are good actors who fit in well with the style of Hitchcock's British films, exuding self-control and good-natured wit even in the most trying of circumstances. Edna Best as the heroine is noticeably different from Doris Day, lacking the glamour but giving a convincing performance as a more determined, resourceful mother. There are some interesting settings in this version, too, with much of the action taking place in some interesting buildings in a less elegant neighborhood in London. A lot of it looks a bit murky in the old black-and-white print, but in a sense even that adds to the atmosphere. Certainly there are those who have good reasons for preferring the remake, but every Hitchcock fan should watch the original, too. Hitchcock's British films had a pleasant style all their own, and while this one might not measure up to \"The Lady Vanishes\" or \"The 39 Steps\", it's still very entertaining.",
         "In the novel, THE SECRET AGENT, Joseph Conrad had dissected the world of anarchists, double agents and spies, and police in the East End of London of 1894, the year that an attempt to destroy the Greenwich Observatory occurred. Alfred Hitchcock used Conrad's novel for his film SABOTAGE in 1936. But two years earlier he did the film THE MAN WHO KNEW TOO MUCH. It was the first of two films in which Peter Lorre was directed by him. It was also the only one of his movies that he remade complete with title. But he decided to use the film to film a scene from British criminal history - the January 1911 \"Siege of Sidney Street\". There had been an incident in December 1910 when several Russian aliens were involved in a burglary in Houndsditch. The proceeds of their robberies (aside from supporting themselves) helped fund anti-Tsarist activities in Russia. They killed three constables in making their escape from the shop. They were eventually tracked down to a house on Sidney Street, and fired at the police who tried to get them to surrender. The Home Secretary of the day (a politician named Winston Leonard Spencer Churchill) sent out troops, sharp shooters, and artillery. The cannon set the house on fire, and the men found inside were found to be dead. The best account of the event is Donald Rumbelow's THE SIEGE OF SIDNEY STREET called THE HOUNDSDITCH MURDERS in Great Britain. Here, instead of radicals (called anarchists in 1911) we have foreign conspirators planning an assassination in London of a foreign head of state. Peter Lorre is the leader. Leslie Banks and his family are on vacation to Switzerland. Banks witnesses the murder of a Frenchman (Pierre Fresney, a great French star of the period - this English film is a rarity for him). Fresney reveals the assassination plot to Banks, and Lorre and his associates kidnap his daughter (Nora Pilbeam) to keep his mouth shut. But the police are aware that he heard something from Fresney, and try to pressure him to talk. So we watch Banks try to track down his daughter (and get captured himself) while his wife goes to the Albert Hall to see what she can do. The finale of the film is based on the Siege - with some exceptions (one of the bobbies in the Houndsditch tragedy is shot and killed in the start of the movie's version of the incident). But Hitchcock maintains the suspense to the end, when the last villain is taken care of. It's an interesting film - not a great one. And it is somewhat different from the 1956 remake.",
         "Perhaps a bit hard to watch for younger generations, but this is the superior version of the yuppie couple whose only child is kidnapped and held for ransom (remade under the same title in the 50s by the same director, Alfred Hitchcock). The film doesn't live up to \"The 39 Steps\" or \"The Lady Vanishes\" as one of Hitch's early works, but it is a superb example of classic low-budget filmmaking at its best. Yes, the effects (like the opening ski slope run) are incredibly laughable, but hey--it was filmed on a virtually empty budget by a relatively unknown director at the time with a low-budget cast in Britain. Superb. 5/5 stars. - John Ulmer",
         "Whilst on holiday in Switzerland to compete in winter sports the Lawrence family inadvertently meet a spy who is killed in front of them. He passes information to them relating to an assassination but, before they can pass on the information their daughter is kidnapped for their silence. Back in London they decide to start looking for the kidnappers and prevent the assassination themselves. Hitchcock's strength here is that an wholly unlikely plot which is full of holes is masked by a sense of wit and good feeling that covers the flaws. The whole thing falls down under scrutiny and as a thriller it doesn't really cut it as well as I'd hoped \u0096 it certainly doesn't compare to The 39 Steps. However the film is very classy and very, very British. I expect to American audiences nowadays that the very polite gentleman like approach of the film is very strange but it works quite well. The final shoot out lacks excitement simply because it is unrealistic in the extreme but it's still quite enjoyable and has it's moments. Lorre is good as the villain but lacks the smarmy qualities he brought to later films. Leslie Banks is very good as the solid British hero and Best is good as his sassy (if underused) wife. Wakefield has a good comedy role as Banks' side kick. Overall the age of the film means it feels very stagy and very stiff but there's still much to enjoy with good settings, comedy and vintage Hitchcockian touches.",
         "Although Alfred Hitchcock made several better films than this, including the 1956 remake, The Man Who Knew Too Much is a milestone film for the rotund master of suspense. It was the first film that got him noticed outside the United Kingdom, it led to bigger budgets for Hithcock to work with in British film industry and eventually to his departure for America. Leslie Banks and Edna Best, Mr.and Mrs. upper class British couple on holiday in Switzerland with their adolescent daughter Neva Pilbeam. A Frenchman they befriend, Pierre Fresnay, is killed right in front of them on a dance floor and he whispers something to Banks about a planned assassination in London to occur shortly. The spies suspect what the dying Fresnay has said to Banks and grab Pilbeam to insure the silence of her parents. The rest of this short (75 minute) feature is Banks and Best trying to both foil the assassination and get their daughter back. At the climax Best's skill at skeet shooting becomes a critical factor in the final confrontation with the villains. Peter Lorre made his English language debut in The Man Who Knew Too Much and was very effective with the limited dialog he had. I've often wondered why Hitchcock never used Lorre more in some of his later features. Although the 1956 version has far better production values, this version still holds up quite well and is worth a look.",
         "The first time I watched this film, I could barely differentiate characters I was so unused to watching old, high-contrast B&W films. By the third time around, I had made everything out and it became one of my favorite movies of all time. The 50's remake, though James Stewart is one of my favorite personalities in the history of civilization, just isn't the same film. First and foremost, Peter Lorre. Anyone who has seen him in M, then laments his minor roles in Hollywood films, should see this film. It's too bad that Hollywood couldn't create more roles like this for him. Abbott is one of the greatest of Hitchcock's sympathetic villains... better than Claude Rains in Notorious, better than James Mason in North by Northwest, comparing favorably to Robert Walker in Strangers on a Train and Shadow of a Doubt's Joseph Cotton, in a fraction of the screen time. He is charming, well-mannered, and portrays more warmth, humanity, and poetry in his words and actions than any of the above. On the other hand, he is an assassination plotter and kidnapper and this is light-hearted entertainment (unlike the second version, which is all nerves and no wit). The cinematography is wonderful. The thing I love most about very early Hitchcock is the German influence (he interned at UFA and his first film, the Pleasure Garden, was a German co-production). Of all of Hitchcock's great works, this is the one most in tune with the aesthetics of silent film, and an important benchmark for one of the few directors whose careers encompass so much of film history. Even the classic 39 Steps filmed the following year does not make such extensive use of \"camera tricks\" (as Hitch would come to deride them later in his career). The closeups of Frank Vosper's hair, the pin associated with Nova Pilbeam, the POV shots of Edna Best's fainting and Hugh Wakefield tuning out at the church, the entire Albert Hall sequence... they're wonderful touches from the era of telling stories strictly through pictures that you just won't find even in Hitch's later British work. There are plenty of striking frame compositions (over the shoulder, through the gate, formations of people, and that beautiful shot towards the beginning of silhouetted father and daughter looking out the window at Mum) and revealing pans a la Carl Dreyer (my favorite are when Peter Lorre swirls from Vosper to Leslie Bank's face as the music on the radio crescendos, Banks raising a cigarette to his mouth... and at the very end with the police, camera pans to the door, rifles rise.) Hitch also milks the soundtrack for all it's worth. The early films of both Lang and Hitch stick out for their creative and stylistic use of sound. Most overtly, M had Peer Gynt, The Man Who Knew Too Much has the Stormcloud Cantata. There are plenty of more subtle audio cues, the best of which is Peter Lorre's chiming pocket watch. Using music as a cover-up is a motif, as well as sounds of warning and interruption. Compare and contrast the instances, intelligent patterns emerge. This is one well thought out little thriller. When the characters talk, they usually have something clever to say. Leslie Banks has the perfect voice for delivering the obligatory dry British wit... \"just leave me a bone on the mat,\" \"sir, you have beaten my wife and she has run off with another man... you are a dirty dog,\" and, my favorite, \"has it been fireproofed?\" But if Banks has the best lines, Lorre has the best speech, in the scene setting up the Albert Hall sequence. **possible spoilers on horizon** In the 50's version, this scene is purely informational, basically the villains filling in the audience on the particulars of the plot. But in the original, this is the money scene. Lorre brings in little Nova for a \"touching scene\" of father and daughter reunited, relates with flair and humor the assassination setup to Vosper, then the whole \"Shakespeare... a great poet\" speech. Nova is torn from Daddy and the scene ends with a closeup of the obviously moved Lorre, slowly casting his eyes down. Also scope that earlier quick cutaway shot of him, eyes downcast, framed by four co-conspirators. Nice composition. Is the acting solid? Wouldn't normal people be really thrown off by these events, like in the 50's version or the more recent Ransom? Let's say the acting is great in the context of the film. Banks and Lorre, of course, carry the film. Cicely Oates is a prototypical Mrs. Danvers. Nova Pilbeam, who I never noticed much until after watching Young and Innocent, smiles, frowns, looks back and forth between adults, and cries \"daddy, daddy!\" to sink your heart. Lovely. Edna Best turns away from the camera to show she is crying. She gets nicely worked up in the Albert Hall sequence, but she has nothing on Doris Day in the remake (nor Frank Vosper on Reggie Nalder). But the camerawork carries the day. Kudos also to the bit parts of all the policemen at the end. The many brief but poignant (or at the very least discernible) characterizations keep us caring after the emphasis shifts from the main characters. An extremely subjective 10 out of 10. This is not a \"great film\" in the manner of M or Shadow of a Doubt. It's mind and eye candy, probably best appreciated by silent film buffs. I'd recommend it to students of German expressionism, fans of early Lang, etc. And, of course, British Hitch fans shouldn't overlook this in all the accolades given to 39 Steps and Lady Vanishes. Same goes for Young and Innocent and Sabotage. Even Secret Agent has interesting things about it, though not that many and Peter Lorre is reduced to a role more like the kind he is delegated to in many a Humphrey Bogart movie.",
         "One of Hitchcock's best films, and entirely undervalued. I love most of Hitch's films. His bigger productions of the mid-1950s to the mid-1960s are probably best loved, but I really like his grittier, more reality-based films as well. During that period, The Wrong Man is almost entirely overlooked, despite being one of his greatest achievements. This kind of film was most common during his British career, where he had less money to work with. I myself am least familiar with the first chunk of the man's career, but I have seen enough of them. My favorite so far is definitely Sabotage (1936), which is another criminally underrated film. The first version of The Man Who Knew Too Much is a close second favorite. A terrorist group (led by Peter Lorre) kills a secret agent in Switzerland. Bob and Jill Lawrence discover that the group is planning to assassinate a foreign diplomat in London in the upcoming days, so the group kidnaps their daughter to keep them quiet. They're unwilling to tell the police about the kidnapping, and eventually take it upon themselves to find her. They have to do it quickly, for, if the diplomat is killed because they withheld information from the police, a second World War could rest upon their shoulders. The story isn't particularly complex, but Hitchcock's cinema is as spectacular as it ever was, while aiming for a low key. There are a dozen memorable scenes in the film, most notably the concert with the slowly revolving camera as Jill Lawrence scans the room for the assassin. And I love the realistic standoff near the end of the film, as the police slowly move citizens to safety as the terrorists shoot from the dark. The acting is also very good, with Edna Best (as Jill Lawrence) and especially Peter Lorre (how can you not love this guy?) standing above the rest. 10/10.",
         "Hitccock's first major release in the USA and Peter Lorre's first English-speaking role are two firsts scored by this 1934 thriller. This is, of course, also Hitchcock's first attempt to to make this film. His second, released in the mid-50s was more successful and better funded. This very British and relatively pithy film retains most of the character of Hitchcock's earlier efforts, but is lean and economical, with less camera play and simpler cinematography and pacing. The acting is generally very good. Of the main cast, Nova Pilbeam, who plays the kidnapped daughter of Leslie Banks and Edna Best, is the only survivor today, at the age of 87. Most of the action centers on Banks,and he is fine, but (and I tend to think this is Hitchcock's doing) very emotionally compressed throughout the film. Banks' Bob Lawrence has a loving, flirty, wife (Best) and a delightful young daughter (Pilbeam). They are away on holiday in the alps when a new friend of their is shot dead while dancing with Best. As he dies, he passes along some information which creates the family's predicament. Lorre and his people kidnap young Pilbeam in exchange for Banks' silence, and he must then decide what to do. It seems that no matter what he does, his daughter is likely to die. It is remarkable that Lorre did not even know what he was saying throughout most of this performance. The legendary actor, as usual, dominates all of his scenes and gives the film a creepy, psychotic feeling that would have been difficult to achieve without him. The plot is a bit light on logic, but brisk, satisfyingly convoluted and entertaining. The script is OK, but often maintains too stiff an upper lip. A few opportunities for elaboration were missed - probably a limitation inherent in the original Wyndham Lewis story. I think it would have been interesting (and more credible) if the authorities had followed up on their knowledge that Banks knew something and trailed him throughout the film. This could have added an extra layer of potential suspense, mystery and obfuscation, since Best's heightened paranoia might have lead him to suspect all sorts of things about anybody keeping tabs on him. Hitchcock definitely knew he had a potential gem here, and it is a credit to him that he revitalized the film with Jimmy Stewart in the 1950s - after establishing himself as a force to be reckoned with. Worth seeing for Hitchcock fans and those interested in early British film as well as fans of the 1950s version. O/w only very mildly recommended.",
         "I must confess that I rather like this earlier version more than the definitely more polished, bigger budgeted 1956 version. Don't get me wrong, that film is a fine film too, but the lower budget, the quick pace, and the presence of Peter Lorre make this one a gem. Alfred Hitchcock, the undeniable maser of suspense, shows his early skills as a director able to create suspense and engineer circumstances that affect individuals who would normally NOT be affected by them - a Hitchcock trademark. Here we have Leslie Banks and Edna Best playing the parents of a young teen girl who has been kidnapped because her parents were the last ones spoken to by a man(a friend) at a party in a European country. Intrigue abounds, the man tells Best who then tells Banks of a note in a brush handle that alerts them to some international incident that will occur in England. Well, the kidnappers alert them of what they have done and shut them up. But through parental devotion, once in England, the father begins to hunt for his daughter. This film has all those Hitchcock trademarks that we know Hitchcock for. We have the normal person(s) put into extremely difficult and complicated situations. We have expressive camera angles. We have humour amidst taut, tense action. We have good, all-around acting. Banks, just a year or so removed from his awesome portrayal of General Zaroff in The Most Dangerous Game, gives an incredibly low-key, convincing performance as a father trying to find his daughter no matter what. He is able to inject light touches of humour here and there to make his performance all the more real. Best is adequate although a bit wooden. Hugh Wakefield as the uncle is a real hoot. Cicely Oates as a nurse is also very convincing. Peter Lorre; however, solidifies his English/American career as a heavy. Coming from a Hungarian background and not able to speak English yet, Lorre learns his part phonetically - which is all the more impressive when you see his performance as a killer with little scruples yet a generous sense of humour. Lorre conveys menace in his ever-alert eyes and his almost sugary voice. Hitchcock knows just how to use him and the climatic scene really is pulled off rather well. This movie is not very long and it is a tad creaky. It has little budget as well, but it conveys lots of action and suspense and has some very good performances. The air of conspiracy, another director's trademark touch, pervades the film almost from beginning to end.",
         "Very few artists have done as much for the thriller genre in film as British director Alfred Hitchcock, who not only was a pioneer of many of the techniques that would become widely used nowadays, but also across his career he literally invented a great amount of the rules that would shape the genre. While his career didn't seem to have started on the best way (his first movie, \"The Pleasure Garden\" was a failure), after the success of \"The Lodger\" in 1927, Hitchcock would become one of the most popular young directors in the United Kingdom, and it wouldn't take him much to be recognized worldwide. That recognition came in 1934, when his thriller \"The Man Who Knew Too Much\" was released, becoming his most acclaimed and successful movie to date and the one that would make him to be noticed by Hollywood. Not only this movie would introduce Hitchcock to America, it would also introduce one of cinema's most important actors: Peter Lorre. \"The Man Who Knew Too Much\" begins in Switzerland, where Bob and Jill Lawrence (Leslie Banks and Edna Best) are on a winter sports holiday with their teenage daughter Betty (Nova Pilbeam). The reason for their visit is that Jill competes in a target shooting competition, and a family friend, Louis Bernard (Pierre Fresnay) competes in a skiing event. During a dinner, Bernard is murdered by an unseen shooter, but before dying he informs the Lawrences about a conspiracy to kill an important diplomat in London. The Lawrences are confused at first by the spy's revelation, but soon the confusion becomes a preoccupation, as the conspirators have kidnapped their daughter Betty in order to keep them quiet. Now the Lawrences know too much, and that knowledge may cost them their daughters, but while unable to tell the police their situation, the couple decides to find their daughter themselves. The screenplay for \"The Man Who Knew Too Much\" was written by Edwin Greenwood and A.R. Rawlinson, although it was based on a story co-written by D.B. Wyndham-Lewis and Charles Bennett. While the writing of the film was a cooperative effort, it is Charles Bennett's style the one that's shown the most through the story. Bennett's plays and screenplays became the basis of many of the most representative Hitchcock thrillers, and one could say that along with the Master of Suspense, he shaped the genre in its early days. \"The Man Who Knew Too Much\" includes many of Bennett's trademarks such as criminal spies, their political conspiracies and the innocent people that are dragged unto them; all spiced up by a very British humor that makes the whole thing even more enjoyable. While by 1933 Hitchcock already had made several remarkable films, \"The Man Who Knew Too Much\" is probably the first of his movies that truly can be considered as an emblematic Hitchcock film, as his style is finally shaped in this movie. Taking the best of Wyndham-Lewis and Bennett's story, Hitchcock brings to life a captivating tale of adventure and mystery that literally takes its innocent characters to the darkest alleys of London. Visually, the movie is a joy, as with the excellent work by cinematographer Curt Courant, Hitchcock shows the influence of German expressionism in his work and creates wonderful images of striking contrast between light and shadows. His dominion of suspense shines in many scenes of the film, particularly in an impressive sequence that serves as climax of the movie, where Hitchcock takes full advantage of the introduction of sound to movies. The performances by the actors are of an excellent quality, with Leslie Banks leading the cast with his charming presence and very British wit. His ability to mix drama with comedy makes his character a very real and likable person, that portrays remarkably the everyman placed in an uncommon situation. While Banks truly makes a great job, the real star of the film is the amazing Peter Lorre as the leader of the conspirators. In this his first work in English, Lorre shows off his enormous talent and steals every single scene he appears in, a remarkable task considering this was his first movie in English and that he had to learn his lines phonetically. Edna Best is good, albeit nothing spectacular; quite the opposite are Frank Vosper and Nova Pilbeam, who make an amazing work considering their limited screen time. Hugh Wakefield has a very funny supporting role where he masterfully displays his talent for comedy. When most people hear about \"The Man Who Knew Too Much\", the instant memory is often that of Jimmy Stewart and Doris Day trying to recover their kidnapped son in the 1956 version of the movie. That is because Alfred Hitchcock decided to remake this classic in color and with the benefits of being a more experienced filmmaker and having a bigger budget to do it. But even when the Master himself prefer the remake, personally I think that the original movie is the superior version. True, the 1934 version of \"The Man Who Knew Too Much\" is not a perfect film, it has an irregular pace (at times too slow, at times too fast) and its plot has some very unlikely situations; however, it has a great charm and a powerful style very difficult to ignore. It is certainly dated by today's standards, but while the remake is technically superior, this one has a heart. After making this movie, the Master's career would only go higher and higher, as the next year he would follow the success of this film with another legendary masterpiece, penned again by Bennett: \"The 39 Steps\". It has been quoted many times that Hitchcock named this underrated movie, \"the work of an amateur\", as he stated his preference towards the 50s remake, but here I must disagree with the Master, as personally I think that this is the version of \"The Man Who Knew Too Much\" that should be seen. 8/10"
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Gaumont British Picture Corporation"],
      "summaries": [
         "While holidaying in Switzerland, Lawrence and his wife Jill are asked by a dying friend, Louis Bernard, to get information hidden in his room to the British Consulate. They get the information, but when they deny having it, their daughter Betty is kidnapped. It turns out that Louis was a Foreign Office spy and the information has to do with the assassination of a foreign dignitary. Having managed to trace his daughter's kidnappers back to London, Lawrence learns that the assassination will take place during a concert at the Albert Hall. It is left to Jill, however, to stop the assassination.",
         "Bob and Jill Lawrence are on a winter sports holiday with their teenage daughter Betty. When their friend Louis Bernard is shot whilst dancing with Jill, he tells Bob of an assassination about to take place in London. Fearing that their plot will be revealed, the assassins kidnap Betty in order to keep the Lawrence's quiet. Bob and Jill return to London and take matters into their own hands.",
         "Bob Lawrence and his crack-shot wife, Jill are holidaying in Switzerland when their French friend, Louis Bernard is gunned down, warning them, with his dying breath, of an imminent diplomatic assassination. To ensure the couple's silence, the conspirators kidnap their daughter. However, Abbot and his comrades have fatally underestimated British pluck.",
         "Jill and Bob Lawrence are on a winter holiday with their daughter, Betty. While he is dancing with Jill, the secret agent Louis Bernard is shot to death. With his last words he tells Jill about an assassination planned by some terrorists, about to take place in London. Fearing their plan would be revealed, the spies kidnap Betty and carry her off to London with them. Bob and Jill come back to London too, searching for their daughter.",
         "A man and his wife receive a clue to an imminent assassination attempt, only to learn that their daughter has been kidnapped to keep them quiet."
      ],
      "budget": 40000
   },
   "movielensId": 2212,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-11-30",
      "dvdReleaseDate": "1999-07-24",
      "directors": ["Alfred Hitchcock"],
      "runtime": 76,
      "movieId": 2212,
      "title": "The Man Who Knew Too Much",
      "mpaa": "",
      "actors": [
         "Leslie Banks",
         "Edna Best",
         "Peter Lorre",
         "Frank Vosper",
         "Hugh Wakefield",
         "Nova Pilbeam",
         "Pierre Fresnay",
         "Cicely Oates",
         "D.A. Clarke-Smith",
         "George Curzon",
         "Clare Greet",
         "Henry Oscar"
      ],
      "imdbMovieId": "0025452",
      "originalTitle": "The Man Who Knew Too Much",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "vGOaQLVZIlY",
         "cZeBA1G8adE"
      ],
      "plotSummary": "While vacationing in St. Moritz, a British couple receive a clue to an imminent assassination attempt, only to learn that their young daughter has been kidnapped to keep them quiet.",
      "tmdbMovieId": 8208,
      "avgRating": 3.75485,
      "releaseYear": "1934",
      "numRatings": 1391,
      "posterPath": "/AvOa83nHSNJBpOPK0IJLz01r0c6.jpg"
   }
}