{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "musical",
         "id": 4344
      }],
      "imdb_id": "tt0024747",
      "video": false,
      "title": "Waltzes from Vienna",
      "recommendations": [
         97867,
         58732,
         53830,
         80040,
         52748,
         20213,
         170898,
         23997,
         47695,
         53051
      ],
      "backdrop_path": "/rkgQ0Abo9x5dEvIHZLlZ8DxVD68.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Johann Strauss, the Elder",
               "gender": 2,
               "credit_id": "52fe4849c3a36847f815fbc5",
               "name": "Edmund Gwenn",
               "profile_path": "/6IL8cwEo3yPZs6hLq07YC0boUoI.jpg",
               "id": 22600,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Johann Strauss, the Younger",
               "gender": 2,
               "credit_id": "52fe4849c3a36847f815fbc9",
               "name": "Esmond Knight",
               "profile_path": "/ka4eJaGtMlghVQnVcQOFSFEb2uA.jpg",
               "id": 56875,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rasi",
               "gender": 1,
               "credit_id": "52fe4849c3a36847f815fbcd",
               "name": "Jessie Matthews",
               "profile_path": "/x1PRui1KMUnxvSe4OY15qLQebrF.jpg",
               "id": 238576,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 1,
               "credit_id": "5358c4e5c3a36856110096b9",
               "name": "Fay Compton",
               "profile_path": "/mRUOqVsfufXejXWqFfR4IXdEg9h.jpg",
               "id": 131449,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "5358c4efc3a36856190097e9",
               "name": "Frank Vosper",
               "profile_path": "/wugGmN7jgfep7ZWJQiA4NOxg9nB.jpg",
               "id": 54036,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Ebezeder",
               "gender": 0,
               "credit_id": "5ab095e092514111be005454",
               "name": "Robert Hale",
               "profile_path": null,
               "id": 1463317,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Valet",
               "gender": 0,
               "credit_id": "5ab095ef92514111d3005459",
               "name": "Charles Heslop",
               "profile_path": null,
               "id": 1094811,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Leopold",
               "gender": 0,
               "credit_id": "5ab095fe0e0a2676c900585b",
               "name": "Hindle Edgar",
               "profile_path": null,
               "id": 1194736,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Anton Drexler",
               "gender": 0,
               "credit_id": "5ab0960e92514111c7005634",
               "name": "Marcus Barron",
               "profile_path": null,
               "id": 1381956,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Lady's Maid",
               "gender": 1,
               "credit_id": "5ab0961e0e0a2676d8005a12",
               "name": "Betty Huntley-Wright",
               "profile_path": null,
               "id": 993305,
               "order": 9
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4849c3a36847f815fbc1",
            "name": "Alfred Hitchcock",
            "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
            "id": 2636,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.470914,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 52907,
      "vote_count": 12,
      "budget": 0,
      "overview": "The story of Johann Strauss the elder and younger.",
      "similar": [
         812,
         10530,
         872,
         11224,
         38757,
         224141,
         14128,
         16119,
         8587,
         11631,
         114,
         10882,
         15121,
         824,
         10545,
         703,
         252,
         3933,
         15969,
         18947
      ],
      "original_title": "Waltzes from Vienna",
      "runtime": 81,
      "poster_path": "/jnXsVjBSfcgRxFOmxZpbwCe2Mrg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Gaumont British Picture Corporation",
         "id": 4978,
         "origin_country": ""
      }],
      "release_date": "1934-03-15",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Heinz Reichert",
         "Ernst Marischka"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0024747/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMzgwMzM5MV5BMl5BanBnXkFtZTgwMzkzNjA1MjE@._V1_SY317_CR14,0,214,317_AL_.jpg",
      "actors": ["Stars: Edmund Gwenn, Jessie Matthews, Fay Compton | See full cast and crew »"],
      "reviews": [
         "This is a fairly entertaining pre-War cheaply made British musical comedy which sadly fails in a number of ways: it was the 3rd film with Jessie Matthews and Edmund Gwenn, and definitely the least satisfying of them; it was Hitchcock directing a non-thriller with his heart not in it; Hitchcock and Matthews didn't get on, and it showed in his screen treatment of her - Britain's top singing and dancing star at the time; and a ridiculously fictitious plot. Hitch thought it was the worst film he'd ever made and Jessie thought it was \"perfectly dreadful\". It was an adaptation of a London musical stage play which apparently ran for over a year: Johann Strauss II played by Esmond Knight wants to be a composer like his father, I (Gwenn), who is arrogantly dismissive of his talents throughout. I'm afraid I won't see Gwenn as Santa quite the same again. II eventually succeeds spectacularly with the help of Countess Fay Compton (was she ever anything but elderly and wistful?) and barmaid girlfriend Matthews - incidentally Robert Hale who played her father was her real-life father-in-law. Jessie was as usual good to look at (personally speaking) but unfortunately didn't really get to sing much, and Hitchcock was excellent as usual but didn't get to show off much. Most people will be disappointed with the latter, but for myself it was with the lack of Jessie's beautiful singing voice in what was after all billed as a musical, and with her name over the title. On the other hand, Hitchcock seemed to be mining the One Hour With You stylistic vein a lot of the time albeit in a cheaper but still pleasant British way, there were some nice sets and of course there was Louis Levy's orchestrations for The Blue Danube to admire when it arrived. The less said about how II was supposed to have composed it here, the better! It's a pleasant enough 76 minutes for someone like me who isn't a Hitchcock completist, but probably will be a real chore if you are.",
         "\"Listen to this! I've just composed a song right here in your bakery! Danube so blue, so blue, so blue \u0096\" \"I've been showing you how the famous Ebersader chocolate rolls are made, you're composing a song? It's sacrilege, that's what it is. Good gracious me, I've shown the very best of musicians through this bakery! Franz Schubert \u0096 why, I brought him down here. He was writing the Unfinished Symphony at the time, but did he try to finish it? No. He ate cakes.\" It's a fair bet that Waltzes From Vienna would be completely forgotten today if it weren't for its director, although even the notion of Alfred Hitchcock making a fluffy romantic musical comedy (co-written by his wife Alma Reville) about Johann Strauss the Younger trying to get his work published, his father's approval and marry the baker's daughter has only made it almost entirely forgotten, and only recalled as a brief side note to Hitchcock's career. That he thought it his worst film doesn't help. That said, taken on its own terms, this screen version of the 'great success at the Alhambra, London' (which had originally boasted musical arrangements by Erich Wolfgang Korngold) is no worse than most Jessie Matthews musicals of the Thirties. Awfully, awfully well-spoken and coming over as a cross between Joyce Grenfell's prettier sister and a hamster, Matthews was Britain's biggest musical star of the day (a claim, it has to be said, somewhat akin to being Baffin Island's premier kangaroo boxer), but her character's insistence than Esmond Knight's distinctly uncomfortable Johann give up the music for a career in confectionery to keep him out of the clutches of Fay Compton's scheming countess marks her out as a selfish nag who'll probably make the poor bugger's life hell for years to come. A fairly lavish production, there are a few amusing bits of business, such as the Count automatically assuming Junior is a servant and throwing his hat to him without looking, while Hitch throws in the odd directorial flourish in an attempt to keep himself interested, and Edmund Gwenn's vain, bitter and surprisingly nasty Strauss Senior adds some welcome darkness to the proceedings but the most memorable thing about it is still the infamous scene where Strauss Jr composes The Blue Danube thanks to the rhythmic bread roll throwing and bagel stacking of the Ebersader bakers. Still, Universal's uncut French DVD boasts excellent picture quality and even includes one of Hitchcock's silent melodramas, 1927's Ivor Novello vehicle Downhill.",
         "In 1933 Hitchcock found himself without a picture to direct and signed on for this unlikely choice of a musical just so he could keep working. That being the case, it probably helps explain why it doesn't seem to have a Hitchcock feel to it or any of the elements you might otherwise expect from the master of suspense. I don't think his heart was really in it. The term musical is a little loosely used as really there are only the Strauss's waltzes for music as there was no money in the budget for any other music. So no one breaks out into song for no reason in this picture. Other than the fact it doesn't seem like a Hitchcock movie, it's a nice little story about the younger Strauss struggling for the respect of his father with a nice bit of romance and jealousy thrown in on the side. The most amusing scene for me was when the younger Strauss was coming up with the music for his waltz at the bakery. I also enjoyed the opening scene of the fire brigade racing to a fire and the \"rescue\" of the damsel. Apparently there wasn't much of a budget for special effects, because we never actually see the fire. A pleasant enough film, just not very Hitchcockian. *** (Out of 4)",
         "Biography of the Strauss boys set in Vienna in mid 19th century. The stars are Jessie Matthews as Rasi, the daughter of a confectioner, Esmond Knight as Strauss Jr., and Edmun Gwenn as Strauss Sr. Also notable are Fay Compton as the countess, Frank Vosper as the count, and Robert Hale as the confectioner. What makes this film notable is that the director is Alfred Hitchcock. Alma Reville is listed as one of the writers. From the opening scene, the film is unusual. The film starts with a closeup of a fire team racing to a fire in a confectioner's shop. The scene is obviously fake because of the background and the fake horses. The actors jostle about and spout wisecracks. At the scene of the fire, we see a madhouse of onlookers and employees. The employees are taking tables and chairs out of the shop and setting them up in the street to avoid losing customers. The confectioner is in a panic as he tries to save a huge wedding cake. Smoke billows from the building but upstairs there is music and singing as Strauss and Rasi go through one of his compositions. The sequence is manic, full of pratfalls and sight gags. At a dress shop across the street the countess is trying to buy a dress but the models are all watching the fire. When a bumbling fireman carries Rasi down a ladder, she tears her dress off and must run to the dress shop for clothing. She meets the countess who is asking to meet the man playing that piano. Thus begins the triangle. Almost as a subplot, we get the adversarial relationship between the father and son since the film really focuses on the \"love story.\" Although Hitchcock always thought this film his worst, there is much to enjoy. The pacing is brisk. The dramatic story is lightened by comic episodes. The direction is very fluid (if not florid) like the music, and the music is terrific, especially the climactic \"Blue Danube\" number. Also notable are the sets. You would expect very fussy, claustrophobic rooms filled with furniture and ponderous draperies but the sets are mostly spartan, white, softly lit. In one scene the countess sits having coffee in a huge white room before huge curtainless windows. Not what you'd think of for 1850s Vienna. The acting is uneven, with Matthews and Knight overacting and Gwenn and Compton underacting. The comic scenes are very broad and involve pratfalls into cakes, slapping, falling down stairs, etc. Yet it all seems to work. Matthews hated this film and Hitchcock. England's premiere musical star of the time doesn't get to dance and only warbles here and there. She definitely takes a backseat to the Strauss music, but she's at her prettiest in this film. Esmond Knight's character reminded me of Marius Goring's manic composer in THE RED SHOES right down to the hair cut. Gwenn, for all his billing, gets less screen time than Matthews, Knight, and even Fay Compton.",
         "I've been working through a few British Hitchcocks lately. I decided to try \"Waltzes From Vienna\" {1935} a rather lesser known work about which Hitchcock himself wasn't really very enthusiastic. I think that a fluffy romantic comedy was just too much out of his comfort zone. Esmond Knight {Johann Strauss Jr} was only adequate in the role and Jessie Matthews' singing ability was very much under-utilised, as was the opportunity to use more of the entertaining music of the Strauss family. One could never really engage with the romantic relationship between the characters Knight and Matthews played. Fay Compton's Countess was reasonable enough, but again somehow seemed to lack conviction. The humour, in my opinion, was frequently forced, slapstick, predictable and unconvincing. On the other hand, the set designs are frequently quite nice for a relatively low-budget film by the standards of his later works. There was a pleasant performance of \"The Blue Danube\" but one has to wait so long for it and the utterly silly explanation of its inspirational source beggars belief! What makes the film worth watching is the great performance of Edmund Gwenn as the angry, jealous and dark Johann Strauss Sr. Fittingly, he has the last word in the film when he finally relents and signs his name for a young autograph hunter. Until this point he has been the only Johann Strauss. Now he finally recognises the merit of his son's work as he adds \"Senior\" to his name when the autograph is signed. It's a good moment and maybe just worth the wait. All-in-all, it's a film that makes no real demands but is worth having as an example of a very unusual sortie into the genre of the romantic musical by Hitchcock. And despite my reservations about it, I think that all Hitchcock fans would like a copy in their collection.",
         "A Great Musical Film by Hitchcock. He made this film when he was at the lowest point of his career. But he put all of his efforts into this project. I love the humor used in this film. I love the scenes where Esmond Knight develops his music by watching workers arrange the bread and other food. \"Fear\" is one of the major elements in a Hitchcock film. In this film, we see the fear of being ignored, fear of failure, fear of losing someone you love.\" Edmund Gwenn was brilliant as Johann Strauss Sr. We can really see his fear through his actions and emotions. He is a man who is dedicated to the world of music. But he is getting old. And he is afraid that his career as a composer is almost over. And he is also afraid that he will be forgotten in the future years as a great composer who put all his great efforts for the world of music. For Example, Johann Strauss says to his son Young Strauss \"You think I am already at a standstill. Perhaps even a back number.\" This is mentioned before Young Strauss plays his music in front of his father and other composers in the middle of the film. This is connected to Hitchcock's life during that time. When Hitchcock was making this film, his career was in trouble. Like Gwenn's character Johann Strauss Sr, Hitchcock did think about his future years as a filmmaker. But I heard through Truffaut/Hitchcock audio interview that it didn't fortunately reach to a point where he \"believed\" his career was over. But he didn't have any projects for thriller genre during that time. So he ended up picking this musical project so that there will be some hope for him in the future as a great filmmaker. With the help of his wife Alma Reville, he puts his fear into the character of Johann Strauss Sr. and his son Young Strauss. His wife Alma Reville co-wrote the screenplay. Young Johann Strauss Jr. is afraid that he will never become a successful composer in the future. During that time, Hitchcock was concerned about his future career. Hitchcock's 2 previous films (Rich and Strange, No. 17) before this film were failures. Jessie Matthews (Rasi) fears that she may lose Young Strauss to Countess Helga (Fay Compton). That's why she is jealous of Countess Helga. Fear can lead a human into becoming a cruel person. That's what see in character Johann Strauss Sr (Gwenn). In Hitchcock's film Saboteur (1942), Blind Man (Vaughan Glaser) asks his niece Patricia Martin (Priscilla Lane) a question \"Are you frightened, Pat? Is that what makes you so cruel?\" We see this through the character of Strauss Sr too. Gustav (Frank Vosper) fears that his wife is having affair with another man. Hitchcock puts some of the film's humor through Gustav. Hitchcock used lengthy shots in this film. Hitchcock used long take technique for the first time in Juno and Paycock. Here we see some lengthy shots in the film. This film also shows Hitchcock's ability to make a film outside thriller genre. Although this film is ignored, still I think it is a great film from Alfred Hitchcock. Even though Hitchcock wasn't really interested in this project, still he put a great deal of effort into this film through the script and the direction. Like I mentioned before, another thing I love about this film is the personal elements applied by Hitchcock. For Example, the scene where Rasi's father comes and talks to Rasi about Johann Strauss Jr (Esmond Knight). Rasi's father says this to Rasi - \"He (Strauss Jr.) will never make a baker. He hasn't his heart in it.\" This is like Hitchcock saying \"I am not interested in making musicals. I am interested in making films in the thriller genre.\" I think these elements make this film stronger, because Hitchcock is giving his personal statements to the audience through this film in a subtle way. In a way, I \"thought\" Countess Helga was a cunning lady villain. Countess Helga \"really\" did want Strauss Jr. to become a successful musician. But she cunningly used the idea of providing a successful music career to Strauss Jr. so that she could eliminate the love relationship between Strauss Jr. and Rasi. She was interested in Strauss Jr. romantically and she also knew that Rasi was jealous. But the love Strauss Jr. and Rasi have for each other comes from the bottom of their hearts. When Rasi tries to leave Strauss Jr. in the middle of the film, Strauss Jr. comes to her and tells her that he loves her and he sacrifices his whole music career for her by becoming a baker. Even after Rasi tries to end the romantic relationship, she comes to save her beloved Strauss Jr. when she finds out that he is in danger. It must be noted that Strauss Jr. becomes a successful music career \"mainly\" because of Rasi. Strauss Jr.'s musical work comes to \"fruition\" only after Rasi gets involved in his work. It was Rasi who gives the \"music tune\" of success to Strauss Jr. Not Countess Helga. Through Rasi, Strauss Jr. succeeded with his musical work. Although Strauss Jr. gets his great success as a composer, still he reveals to Rasi that he is nothing without Rasi. Despite all the conflicts, the deep romantic feelings they (Strauss Jr. and Rasi) have for each other brings them back together in the end. I liked performances especially from Jessie Matthews, Esmond Knight, and Edmund Gwenn. My request is give this film a second chance. Afterall, it is a film from Hitchcock. I rate this film 10 out of 10.",
         "It is not his best, not even close, but his worst film is Juno and Paycock with Jamaica Inn and Champagne not far off. Number 17, Under Capricorn and Topaz are also towards the bottom. Waltzes from Vienna does look lovely, sumptuous sets and costumes, good photography and some nice visual flourishes. The music sparkles with beauty and energy throughout, while Edmund Gwenn gives a great performance, Jessie Matthews is charming enough and there's also the Blue Danube scene which is by far the highlight of the film. Esmond Knight does look uncomfortable and can have a tendency to over-act, while Fay Compton under-characterises. The direction has its moments but there is a sense that Hitchcock wasn't particularly interested in the project. The comedy scenes are rather forced and are played too broadly, while the story has a little charm but can be a little dull and silly, with some underdeveloped characters and relationships- that of Johann and Rasi is rather un-engaging- and sub-plots that serve little point and the script is on the talky side. Overall, one of Hitchcock's weakest but not his worst like he considered it to be, of the films of his personally seen there are at least 6 or 7 that are worse. 5/10 Bethany Cox",
         "Hitchcock frequently dismissed this film as the worst he ever made \u0096 it falls into the \"lowest ebb\" of his career that film analysts often refer to (the films he made, often reluctantly, between 1930 and 1934). It is always interesting to hear film-makers and film stars passing comment on their own work, particularly when naming their most and least favourite titles. What never ceases to amaze me is the way they often pick completely the wrong film to call their worst. Jack Benny despised The Horn Blows At Midnight; Frank Sinatra believed The Kissing Bandit was the nadir of his career; Michael Caine rated Ashanti as the absolute bottom of his acting barrel\u0085 yet in every case, they've picked on the wrong movie. And so it is with Waltzes From Vienna. Hitchcock may have been unhappy whilst making the film, and dismayed at the finished product, but in all fairness it is nowhere near as bad as its reputation suggests. Johann Strauss Jr (Esmond Knight), or Schani as he calls himself, is a fairly talented young musician living under the immense shadow of his father, Johann Strauss Sr (Edmund Gwenn). Strauss Sr is a fearsome tyrant of a man, a musical legend with an ego as big as his reputation. Schani spends much of his time teaching his sweetheart Rasi (Jessie Matthews) to play the piano, and writing tunes which he dedicates to her. One day, he is approached by the wealthy Countess Helga Von Stahl (Fay Compton) who wants him to compose a waltz to go with some lyrics she has written. Rasi is engulfed with jealousy as her beloved Schani spends all his time with the Countess. And Schani himself is racked with self-doubt about his ability to come up with a suitable tune. His father has made him feel somewhat inept as a musician and he is totally convinced he isn't up to the job. In the end, Schani almost accidentally produces the Blue Danube waltz\u0085 a piece of music so spine-tingling, so perfect, that it becomes an instant sensation, much to the chagrin of his father. There are stories of Hitchcock unleashing his frustration upon his actors during the production, often bullying them and forcing them to work unthinkable hours to get the film completed on time and on budget. If these rumours are true, it is a credit to the actors that they give such generally likable performances. Knight and Matthews are a little wooden as the lovestruck leads, but Gwenn is simply fantastic as the domineering Strauss Sr and Compton delivers a memorable turn as the designing Countess. There is a nice element of comedy in the film, and scene for scene the whole thing has been worked out cleanly and economically from start to finish. Perhaps Hitchcock's main beef with this film is that it is a soft, light-hearted romance with some features of a musical. He always was at his best doing man-on-the-run thrillers or black comedies. It is a very uncharacteristic film, and perhaps the master of suspense couldn't find anything to set his pulse racing in such material. However, my advice is: give Waltzes From Vienna a go. It's a good deal better than you might anticipate!",
         "Young composer Esmond Knight (as Johann \"Schani\" Strauss) goes to work in a bakery. He meets and falls in love with singer Jessie Matthews (as Rasi). Their relationship must survive interfering father Edmund Gwenn (as Johann Strauss) and tempting older woman Fay Compton (as Helga von Stahl). Watching the bakers toss rolls, as well as mix batter, inspires Mr. Knight to write \"Strauss' Great Waltz\" (the US title of this film). A full orchestral version of \"The Blue Danube\" is eventually heard. The British cast and director Alfred Hitchcock have reputations greater than this dull affair. *** Waltzes from Vienna (3/34) Alfred Hitchcock ~ Esmond Knight, Jessie Matthews, Edmund Gwenn, Fay Compton",
         "Strauss's Great Waltz will go down as your most atypical Alfred Hitchcock film. Mainly because at this time he was not an icon in the film profession but a contract director Gaumont-British Pictures. The Hitchcock stamp is definitely not on this one. But it is the only musical in his career so you would think something better would have come from it, especially since he had the United Kingdom's number one musical star at the time Jessie Matthews. Who has no real musical numbers, talk about strange. Her singing and dancing talents may have been left on the cutting room floor. The story was covered far better in MGM's high gloss film, The Great Waltz. Young Johann Strauss, Jr. is considered by his father to be the least promising of his offspring and the senior Strauss Edmund Gwenn ridicules his efforts at composing at every opportunity. Young Strauss who is Esmond Knight in this film has even gone to work in a bakery, in real life Strauss wanted his son to be a banker. Countess Fay Compton however encourages Knight's genius and we all know what happened after that. The musical with book and lyrics by Guy Bolton had a nice run on the London Stage. Obviously Hitchcock just didn't have his heart in this assignment and sadly the results show."
      ],
      "genres": [
         "Biography",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Gaumont British Picture Corporation",
         "Tom Arnold Films"
      ],
      "summaries": [
         "Schani, Johan Strauss Jr., is forced by his father to forget music and to work in a bakery. Here he falls in love with Resi. The girl gets very jealous when a rich and beautiful contessa asks Schani to write a waltz for her. Schani writes and plays it, but he is always loyal to his girlfriend.",
         "The story of Johann Strauss the elder and younger."
      ],
      "budget": 0
   },
   "movielensId": 2213,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1934-01-31",
      "dvdReleaseDate": "2009-12-23",
      "directors": ["Alfred Hitchcock"],
      "runtime": 81,
      "movieId": 2213,
      "title": "Waltzes from Vienna",
      "mpaa": null,
      "actors": [
         "Edmund Gwenn",
         "Esmond Knight",
         "Jessie Matthews",
         "Fay Compton",
         "Frank Vosper"
      ],
      "imdbMovieId": "0024747",
      "originalTitle": "Waltzes from Vienna",
      "genres": [
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of Johann Strauss the elder and younger.",
      "tmdbMovieId": 52907,
      "avgRating": 1.97917,
      "releaseYear": "1934",
      "numRatings": 24,
      "posterPath": "/jnXsVjBSfcgRxFOmxZpbwCe2Mrg.jpg"
   }
}