{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "runaway train",
            "id": 163228
         },
         {
            "name": "macguffin",
            "id": 207681
         },
         {
            "name": "stolen necklace",
            "id": 236523
         },
         {
            "name": "runaway bus",
            "id": 236524
         }
      ],
      "imdb_id": "tt0023285",
      "video": false,
      "title": "Number Seventeen",
      "recommendations": [
         35832,
         52748,
         31930,
         36049,
         31995,
         20213,
         77668,
         53522,
         85507,
         53830,
         50474,
         94608,
         8208,
         31667,
         2761,
         47695,
         347,
         44626,
         192938,
         105067
      ],
      "backdrop_path": "/5cFtPfrPfWSXvNM7GHisojqUz2l.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ben",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff1b",
               "name": "Leon M. Lion",
               "profile_path": null,
               "id": 77669,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nora - The Girl",
               "gender": 1,
               "credit_id": "52fe462e9251416c7506ff1f",
               "name": "Anne Grey",
               "profile_path": "/oJrmc0f3KcNM27UsOW3ZDsLXpyd.jpg",
               "id": 77670,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Barton - The detective",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff23",
               "name": "John Stuart",
               "profile_path": "/zZzUldf0EqwbrNVHx9anw7YInHp.jpg",
               "id": 30709,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Brant - Nora's Escort",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff27",
               "name": "Donald Calthrop",
               "profile_path": "/7IpGIXC6gRz5VCdMnhSW53JliJn.jpg",
               "id": 7384,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Henry Doyle",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff2b",
               "name": "Barry Jones",
               "profile_path": "/3ppMtMy28TXB0H4rpr8EjZ4hw9G.jpg",
               "id": 48959,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Rose Ackroyd",
               "gender": 1,
               "credit_id": "52fe462e9251416c7506ff2f",
               "name": "Ann Casson",
               "profile_path": null,
               "id": 77671,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mr. Ackroyd",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff33",
               "name": "Henry Caine",
               "profile_path": null,
               "id": 77672,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sheldrake",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff37",
               "name": "Garry Marsh",
               "profile_path": "/s5eOlGPaoeeURUzvb8TfGuQ90Vv.jpg",
               "id": 77673,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "The Guard on Train (uncredited)",
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff41",
               "name": "Herbert Langley",
               "profile_path": null,
               "id": 553844,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe462e9251416c7506ff3d",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe462e9251416c7506ff47",
               "name": "Adolph Hallis",
               "profile_path": null,
               "id": 553845,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe462e9251416c7506ff4d",
               "name": "A.C. Hammond",
               "profile_path": null,
               "id": 553848,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe462e9251416c7506ff53",
               "name": "C. Wilfred Arnold",
               "profile_path": null,
               "id": 7388,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe462e9251416c7506ff59",
               "name": "Joseph Jefferson Farjeon",
               "profile_path": null,
               "id": 553843,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 1,
               "credit_id": "52fe462e9251416c7506ff5f",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe462f9251416c7506ff65",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe462f9251416c7506ff6b",
               "name": "Rodney Ackland",
               "profile_path": null,
               "id": 236446,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe462f9251416c7506ff71",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe462f9251416c7506ff77",
               "name": "Bryan Langley",
               "profile_path": null,
               "id": 97235,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.962999,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 15007,
      "vote_count": 26,
      "budget": 0,
      "overview": "A gang of thieves gather at a safe house following a robbery, but a detective is on their trail.",
      "similar": [
         44048,
         17774,
         314226,
         61483,
         379643,
         311099,
         459633,
         113044,
         277890
      ],
      "original_title": "Number Seventeen",
      "runtime": 63,
      "poster_path": "/iLCy8ca0xfZNwCU23nEWfLFVOA5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1932-07-18",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 66,
      "synopsis": null,
      "writers": [
         "Joseph Jefferson Farjeon",
         "Joseph Jefferson Farjeon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023285/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzY5NjgyODU5NV5BMl5BanBnXkFtZTgwNTExNzA1MjE@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Leon M. Lion, Anne Grey, John Stuart | See full cast and crew »"],
      "reviews": [
         "One of Alfred Hitchcock's British (earlier) movies, \"Number Seventeen\" shows his touch in many of its interesting and creative details, and it is an entertaining film, although the plot is rather chaotic and often confusing. The story concerns a vacant house (\"number seventeen\") on which several different persons converge for various reasons. Most of them are interested in one way or another with a big jewel theft that has occurred, but it is hard to figure out just what everyone is doing there, and it takes a good while before the audience finds out who everyone is and what each of the characters wants. If you watch it over again, you realize that everything does fit together pretty well, but it is quite hard to catch everything the first time through. The somewhat confusing plot is redeemed by a lot of Hitchcock touches. The gloomy abandoned house makes possible a lot of surprises and atmospheric details, and there is also a fast-paced and suspenseful closing sequence. It's very short, just over an hour, and a lot of things happen during that time. After a rather slow beginning, it gets your attention and keeps it until the end. \"Number Seventeen\" probably could have been a much better movie if the plot and characters had been developed more carefully, but it is still pretty entertaining as it is. While probably only of particular interest to those who are already Hitchcock fans, there should be enough of Hitchcock here to satisfy those who are.",
         "For starters, I think the proper context for evaluating this film would be: 1932 thrillers. And judged against its competition, this film ain't so bad. Hitchcock overdoes the mood, and there were times when I was tired of the frightening shadows cast upon walls by unexplained light sources. Characters holding candles, for instance, would throw full-body shadows upon walls, and the movements of those shadows would be exploited for mood effect. But the movie isn't as terrible as its cruelest critics suggest. The early thirties in England blurred distinctions between stage and screen, and the stage qualities of the film are quite strong. You have to imagine that you're watching a play, perhaps in the West End, with a cast of aging Victorian and Edwardian actors, in order to get the full context of this film. If you are only capable of watching modern Hollywood movies, or if you can only evaluate film in the context of E.T. and MTV, then by all means stay away from this film. On the other hand, if you like early films, black and white film, silent movies, and moody thrillers from the 20s and 30s, then this film is quite good. There are unexplained details, yes, but watch the film nonetheless. It won't damage you, as other viewers have suggested. The hour of your life will not be wasted: you will have gained an understanding of the important link between film and theatre, between screen-acting and stage-acting, and you will have a more full understanding of Hitchcock's background. Besides, I dare you not to be drawn into the plot near the middle of the film. Halfway through, you realize: Not a single one of the characters has been contextualized properly, and any one of them could be lying about their identities and reason for being in the empty house. Some have faulted this as a \"problem\" in storytelling -- but I would suggest that it's what creates the suspense. You are interested in the story because of the unexplained. Stop complaining, eh?",
         "After seeing \"Blackmail\" and \"Murder\" I wasn't expecting very much of \"Number Seventeen\". I was very pleasantly surprised. It's certainly not up to the standard of Hitchcock's later work, but it's a moderately enjoyable film both in itself and for the insight it offers into Hitchcock's development as a director. The plot is rather complex and can be a bit difficult to follow at times. But nearly every element - concept, plot, characterization, and so forth - is superior to his earlier work. There are some action scenes toward the end that are strikingly exciting for a movie from 1932. My favorite part of the movie, however, is the first third or so, where Hitchcock achieves a perfect \"spooky old house\" atmosphere. If this were a long movie, I would hesitate to recommend it to anyone but Hitchcock fanatics. But it's only 63 minutes - if you can find it, take the hour and watch it. At worst, you'll learn some things about Hitchcock's developing technique. At best, you'll discover a highly enjoyable little movie.",
         "Being a Hitchcock fan, I sat down to watch this film expectantly. Within 10 minutes, I was scratching my head, hardly believing what I was seeing. This was not only a poor film by Hitchcock standards, it was bad by ANY measure. This film has it all--horrible editing, inexplicable turns, over acting, ridiculous situations, unbelievable and sometimes stilted dialogue, and yes, inadequate, puzzling direction. A real mess. The plot involves a jewel heist that occurs before the film's beginning. Four men, two women, and a body eventually end up at the house where the jewels (a necklace) are hidden. Just who these people are, is, in some cases never adequately explained. **MILD SPOILERS** There is a deaf-mute, who suddenly begins to speak and hear (okay, she was pretending--but why?). We have the dead body suddenly disappearing, and then reappearing, now walking and talking (why was he pretending to be dead, or why was he unconscious?). Two of the men, who arrive at the house at the same time, have never seen each other, yet there is hardly any suspicion about each other. Why? These and many other questions are left unanswered. Then we have the uneven acting. Two of the jewel thieves are played with such laconic understatement, in SUCH a relaxed manner, it seems completely at odds with their situation. Then we have Ben, played by Leon Lion, for whom the term \"over-acting\" is an understatement. Because of these, and other problems, the film never generates any tension--until the finale. Even then, the tension is often undercut with some arresting implausibilities, and amateurish editing (e.g., during the runaway train sequence, they use the same bit of film with our two jewel thieves looking out the door of the engine, at least three different times). This was an awkward era for movies. Sound had been introduced just three or four years previously, and film-makers were still struggling to incorporate the new technology. If generous, we might allow this as an explanation for some of the problems with \"Number Seventeen,\" but by no means all. \"Murder,\" for instance, was directed by Hitchcock two years earlier, and is by FAR a better film. So, whence cometh \"Number Seventeen?\" In order to make this inexplicable aberration explicable, we need only remind ourselves that, no matter how talented, Mr. Hitchcock was only human, after all, and thus capable of error. This film provides all the proof of that we could ever need. 4/10",
         "NUMBER SEVENTEEN is one of the very few films Alfred Hitchcock made that has aged poorly. It's bizarre to find a movie he made that doesn't improve on a second viewing; even JAMAICA INN and THE SKIN GAME get better the more you look at them. Here's an unfortunate exception. While it doesn't lack merit as a rollicking little caper, the story is too confusing for the film to be enjoyed, and surprisingly enough the direction is clumsy and the whole thing ends up rather incoherent. There may be a reason for this. Hitchcock made this in a hurry to get to a project he was eager to work on, RICH AND STRANGE, one of his most offbeat and personal films (actually released before this one). As a result, this very short and very stagy little comedy/thriller feels like the work of someone who didn't really care. While this is something that rarely happens in his catalog as director, you can sense the same thing to a lesser extent in STAGE FRIGHT and THE SKIN GAME, yet the technical competence of the former and the fine source material and performances of the latter make those more fun and interesting to see than this. The real crime here is witnessing the failure of one of Hitch's only stabs at an old-dark-house mystery; it's a severe disappointment that he didn't explore the potential of the story to a greater degree. NUMBER SEVENTEEN is locked into its time and doesn't have anything close to the resonance of BLACKMAIL. To a fan of the director, it's essential but a bit off-putting. One good point is the closing chase sequence, which takes up a major chunk of the movie's second half (the total running time is only an hour). Despite the obvious use of miniatures, it's amusing to see the director play with buildup and action in an otherwise dismal effort.",
         "By far my favourite pre-Hollywood Hitchcock, this one has nearly all the characteristic elements, the tangled plot that seems for a moment about to get clarified only to reveal another level of complication, the thread of humour running through even the most menacing episodes, the mysterious and assumed identities, the shadows. A well-dressed man (John Stuart) enters an empty house, where he encounters Ben, an amusing cockney drifter (Leon M. Lion), and then a corpse, and then a pretty girl from the house next door (Ann Casson) falls through the skylight, the corpse disappears, several bad guys show up on the doorsteps with Nora, a lovely deaf-mute woman (Ann Grey), and the advantage keeps shifting. There's something about a necklace, and another bad guy\u0097the one who wasn't really dead\u0097has it, but Ben picks his pocket. All the bad guys have a sort of railway ticket as an identifying sign. They're planning to take the boat train to Europe with the diamonds, and the first man misses the train, and commandeers a bus which careens across the countryside, past an inn with a sign \"Dainty Teas.\" The train scenes are incredibly active and suspenseful, and the advantage keeps shifting. The deaf-mute is neither. None of the bad guys has the necklace. They identify one of their group as the detective Barton and chase him; he gets away but the bad guys accidentally kill the fireman and engineer and the train crashes spectacularly into the ferry. The first man saves the formerly deaf-mute woman, the supposed policeman grills the woman and the first man, who laughs and calls him by name\u0097in fact, he's been the detective Barton all along, funny that the crook he was chasing chose his identity to hide with. And Ben reveals, grinning his idiot grin, that he still has the necklace. Some might say the difficulty in following the plot is a failing, but I think it's deliberately confusing. Hitchcock plays with his audience, teasing us into thinking we know what's happening and then turning the tables on us. The story starts in the middle of events, and it isn't until the very last minutes of the movie that the pattern begins to make sense.",
         "This might just be a problem with only me, but I tend not to be able to clearly hear some of the speech of the actors in old movies like this. It could be that the film is old or the actors don't annunciate(not sure if I spelled that right) enough. Overall, the film is like what the other reviewer said: slow at first, but once you know generally what is happening, it draws you in immediately. Also, this is one film that I demand to be remade, for it looks quite dated in some parts, even a little cheesy. Another reason is that this movie should be given a wider audience. It deserves it. The remake might have to be a bit longer, though, since I'm not sure how a modern crowd would feel about paying money to see only a 63 minute movie. In summary, see this to be entertained but prepare to be forgiving for the, shall we say, \"time gap.\"",
         "Number 17 was made at a crossroads point in Alfred Hitchcock's career. After the success of crime thrillers Blackmail and Murder!, and the mediocrities of stage adaptations Juno and The Paycock and The Skin Game, he now knew where his real strength lay. Unfortunately for him, his bosses hadn't quite caught on yet, which is why his early 30s output is rather uneven. For this, his return to the crime genre, he was lumbered with another adapted play, and a plodding and cliché-ridden one at that. However, Hitch knew full well that Number 13 was daft pot-boiler material and so, rather than attempt to take it seriously, he and his wife (and then, closest collaborator) Alma Reville stirred it up into a farcical self-parody \u0096 adding yet more clichés, camping up the villains and piling plot twists upon plot twists. Hitchcock also used the film as an arena for technical experimentation, and as such it contains a number of Hitchcock \"firsts\". By this point it was becoming increasingly important in a Hitchcock picture to immediately rope the audience in with a series of attention-grabbing, dialogue-free images, and in Number 17 the opening sequence is actually the strongest piece of film-making in the whole piece. We open with an eerie, wind-blasted street scene, into which comes an anonymous man \u0096 his back to the camera. We then follow the mystery man to the front door of the titular \"Number 17\" and, in a single, smooth tracking shot follow him inside. It's a neat trick to bring the audience into the action, having us become the camera and discover the environment, and yet at the same time keeping the man's identity and purpose unknown. What follows is a steady descent into the depths of farce, with exaggerated performances, sped-up fist fights and too many ridiculous plot twists and character introductions to really keep up with. In tone it borders on that of Bride of Frankenstein. A couple of nods to the cast are in order - Donald Calthrop is the archetypal upper class criminal, and Leon Lion plays the ultimate \"Lord-love-a-duck\" cockney rogue. Leon Lion, who also produced Number 17, was actually a playwright. Along the way however, Hitch gets to experiment. Silly as it is, this is really the first of Hitch's adventure thrillers, what I call the clinging-to-the-side-of-trains pictures. This type of thriller \u0096 as oppose to the more domestic crime stories of Blackmail and Murder! \u0096 would make up the best part of his late 30s work and would eventually result in North by Northwest twenty-five years later. It's also the first of his films to be mostly set in one location (like the later Lifeboat, Rope and Rear Window), although this seems to be more coincidental rather than the start of a trend. On top of that it's the first time Hitch gets to play with scale models, and the beginning of his recurring association with trains. Oh, and there's even the first true MacGuffin in the form of a stolen necklace. The trouble is, because this picture is done as a genre spoof, you can't expect any of the suspense elements to work. Number 17 may contain motifs and techniques used to great effect in, say, The 39 steps and The Lady Vanishes, but it's nowhere near as exciting as those classics. And, although it's a credit to Hitch's playful touch and self-awareness, with the exception of the occasional great line from Leon Lion Number 17 isn't really very funny. It's worth watching for anyone studying Hitchcock, as a prime example of his most experimental and innovative period, but it doesn't stand up on its own as entertainment.",
         "The plot of this early Gothic/comic thriller by Hitchcock will make your head spin. It is about as convoluted as possible, with multiple cases of mistaken identity, role-switching, cons and counter-cons. A detective has gotten a lead on a very expensive necklace which has disappeared, and expects to find it, along with the perpetrators, in an old, somewhat decrepit house. A couple of innocent bystanders wander in and find one of these characters knocked unconscious, and the rest eventually begin to pour in through the front door bit by bit, or through the ceiling, as the case may be. Eventually, the entire cast will end up in a mad chase between a runaway train carrying the bad guys and a bus commandeered by the good guys (or so it seems). Thoough not one of Hitchcock's best early films, Number 17 is certainly amusing and contains a lot of intentional comedy that many critics seem to want to ignore, keeps a steady, if hectic, pace and boasts some pretty affective use of miniatures for the 1930s. Recommended for fans of pre-noir thrillers and British comedy.",
         "The picture deals with a deserted house in London as scenario where we find a suspecting hobo (Leon Lion , film producer and he played similar role at stage) , a young girl called Nora (Grey), a detective and a gang of thieves involving the robbery of a necklace . This early British film (shot before ¨39 steps¨) contains humor , tension , action with superb ending pursuit and results to be quite entertaining . It's a comical thriller with parody elements and suspense appears threatening and lurking in every stairs , corridor , hallway and rooms . The movie gets a Germanic expressionist atmosphere in lights and shades creating dark scenarios . Runtime is short-time for that reason is quickly seen ; one hour , approximately . As the famous interview Truffaut-Hitchcock , he said this film was a disaster , he contracted several cats for shooting scenes at home but they wander and was impossible to control them for its numerous proprietaries . The film has various Hitchcock touches as well as the ¨McGuffin¨ , this time seem to be the robbed necklace ; furthermore , the overlong and exciting chase sequence of a train and a bus realized with a maquettes and miniatures . Thirty four years later , Hitchcock will repeat bus pursuit in ¨Torn curtain¨ . His screenwriter Alma Reville ,Hitchcock's wife , wrote a confusing and no well developed screenplay . The following Hitchcock film would be his first great success :¨The man who knew too much¨."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "Detective Gilbert is searching for a necklace robbed by a gang of thieves. In the beginning, the gang is in a house in London, then they are running away from police. It will not be easy for the detective to recover the jewel.",
         "A gang of thieves gather at a safe house following a robbery, but a detective is on their trail."
      ],
      "budget": 0
   },
   "movielensId": 2214,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-07-18",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Alfred Hitchcock"],
      "runtime": 63,
      "movieId": 2214,
      "title": "Number Seventeen",
      "mpaa": null,
      "actors": [
         "Leon M. Lion",
         "Anne Grey",
         "John Stuart",
         "Donald Calthrop",
         "Barry Jones",
         "Ann Casson",
         "Henry Caine",
         "Garry Marsh",
         "Herbert Langley"
      ],
      "imdbMovieId": "0023285",
      "originalTitle": "Number Seventeen",
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A gang of thieves gather at a safe house following a robbery, but a detective is on their trail.",
      "tmdbMovieId": 15007,
      "avgRating": 2.95625,
      "releaseYear": "1932",
      "numRatings": 80,
      "posterPath": "/iLCy8ca0xfZNwCU23nEWfLFVOA5.jpg"
   }
}