{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "inheritance",
         "id": 10911
      }],
      "imdb_id": "tt0023395",
      "video": false,
      "title": "Rich and Strange",
      "recommendations": [
         52748,
         42811,
         31930,
         36055,
         35832,
         44592,
         70322,
         47695,
         36054,
         20213,
         45219,
         36056,
         45215,
         2761,
         134750,
         2762,
         15007,
         52907,
         113252,
         45218
      ],
      "backdrop_path": "/l5z8WRtoGesGrI8HObV7WmzNB20.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Fred Hill",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e5cb",
               "name": "Henry Kendall",
               "profile_path": "/dT1X8mpKlB27hrLhafzdEoGmUYs.jpg",
               "id": 114768,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Emily Hill",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e5cf",
               "name": "Joan Barry",
               "profile_path": "/ytLF5h5CPeWA9VcfP9RFwEXVgIl.jpg",
               "id": 115153,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Commander Gordon",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e5eb",
               "name": "Percy Marmont",
               "profile_path": "/p3DIyvlxx6B0SVIxcDaPUPlEV0U.jpg",
               "id": 27929,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "The Princess",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e5ef",
               "name": "Betty Amann",
               "profile_path": "/ggAZUi7OV019dysiER3UTVxFk35.jpg",
               "id": 222671,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "The Old Maid",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e5f3",
               "name": "Elsie Randolph",
               "profile_path": "/8NQehJNb2hL1gVvwrgd1rA8XzzS.jpg",
               "id": 40966,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Colonel (uncredited)",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e5f7",
               "name": "Aubrey Dexter",
               "profile_path": null,
               "id": 554106,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mrs. Porter (uncredited)",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e5fb",
               "name": "Hannah Jones",
               "profile_path": null,
               "id": 553486,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e5c7",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e5d5",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e5db",
               "name": "Dale Collins",
               "profile_path": null,
               "id": 554105,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e5e1",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e5e7",
               "name": "Val Valentine",
               "profile_path": null,
               "id": 96377,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e601",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e607",
               "name": "Adolph Hallis",
               "profile_path": null,
               "id": 553845,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e619",
               "name": "Winifred Cooper",
               "profile_path": null,
               "id": 554108,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e61f",
               "name": "Rene Marrison",
               "profile_path": null,
               "id": 553480,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e625",
               "name": "C. Wilfred Arnold",
               "profile_path": null,
               "id": 7388,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5319ce3092514177c20026db",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5319ce4092514177b7002791",
               "name": "Charles Martin",
               "profile_path": null,
               "id": 554107,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.506551,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 36049,
      "vote_count": 19,
      "budget": 0,
      "overview": "A couple, Fred (Henry Kendall) and Emily Hill (Joan Barry) , living a mundane middle-class life in London, are given a small fortune by an uncle as an advance against their future inheritance so that they can enjoy it in the present. Immediately Fred takes leave from his job as a clerk and they leave on a cruise for \"the Orient\". Fred quickly shows his susceptibility to sea-sickness while crossing",
      "similar": [
         193435,
         247601,
         289777,
         10112,
         209244,
         46738,
         9378,
         11775,
         2022,
         4584,
         37265,
         2020,
         11597,
         6283,
         28411,
         28571,
         449755,
         32600,
         388440,
         277967
      ],
      "original_title": "Rich and Strange",
      "runtime": 83,
      "poster_path": "/eDMrDdi85s2kHU1tBR5jS5lStkb.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1931-12-10",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 92,
      "synopsis": "In the amusing opening sequence, in silent movie style, the routine and regimented activities of Fred Hill (Henry Kendall) at work and his navigating the rush hour going home are choreographed to a musical score. The long rows of desks, the masses going down stairs at exactly 6 PM, the crowd of bowler hats, the umbrellas, the crushing indignities of transportation in the underground are highlighted. Fred annoys many around him as he ineptly tries to read a newspaper. Fred and his wife Emily (Joan Barry), are an average couple living a boring middle class life in London. Emily prepares steak and kidney pie every other day, and sews clothes on the dining room table to economize. He begrudges their lot while she accepts it. Their black cat believes his rightfully place is atop the dining room table, and Fred shoos him down with repeated annoyance. One day they receive a letter from an uncle, announcing they will receive a small fortune as an advance against a future inheritance. They believe that the unexpected extra money will bring them happiness. Fred takes leave from his job as a clerk and they leave on a rich people's world cruise. Fred first shows his susceptibility to sea sickness while crossing the English Channel. In Paris, the two go sightseeing. A montage of famous landmarks is shown with their heads flipping suddenly from left to right over and over. Both are scandalized by the topless women dancers at the Folies Bergère. Both of them drink too much. As they ride the hotel elevator, Fred sets his watch to agree with the floor number dial, and is very puzzled by the quick changes in the number. As he is about to get into bed, he stumbles and falls on his knees in a night prayer position. After sailing out of Marseilles they at first enjoy a cruise life: drinks, dancing, pool and deck games, strolling on the decks. However, Fred's sea sickness interferes day after day. When a steward enters the stateroom to offer him food, he is so nauseous the menu item names jump out at him. Comedy relief is provided by a spinster with thick glasses (Elsie Randolph) in search of a man, any man about the cruise ship, oblivious to how she is constantly making a fool of herself. (Hitchcock often features a plain-looking woman in glasses in his films.) Commander Gordon (Percy Marmont), a dapper, popular bachelor initiates conversations with Emily to get away from the spinster. Emily finds it easy to talk to Gordon. They soon talk about the characteristics of love and marriage. Gordon has never been in love. Emily says she finds it difficult to talk to Fred because she fears displeasing him with what she says, because she loves him so much. Gordon shows Emily photographs of himself sitting next to an empty chair in his house near Singapore. Emily draws a cartoon of herself sitting in the empty chair. Finally feeling well enough to appear on deck, Fred is immediately smitten with a German \"princess\" (Betty Amann) who meets him while retrieving the rope ring used to play deck tennis. The affairs developing are shown by increasingly pairing the lovers together in one shot, and how they sightsee separately in Port Said. Emily and Gordon's first kiss is broken by the abrupt stop of accordion music being played on the deck below as an argument breaks out. In an intensely awkward scene, Fred tries to kiss the princess, who is wearing a harem costume, and he can't figure out how to get around the veil covering her face. After Fred agrees to meet the Princess in stateroom 19, all numbers he sees turn into 19 in huge sizes. As the ship arrives in Singapore, each plans to abandon the marriage to run off with a newfound love. The collapse of the marriage is symbolized when the couple are riding in rickshaws going in opposite directions, get wedged together so that neither can proceed, and neither is willing to make way for the other. Emily leaves with Gordon for his nearby home. Gordon offers her a decent life, saying outright that her husband is hopeless and that she and Fred are horrible together. When Gordon reports that the Princess is a con artist, the daughter of a Berlin laundry owner, a common adventuress who often undertakes to relieve wealthy men of their money, Emily realizes she wants to protect Fred, because he's such an impractical wimp, and returns to Fred in his hotel room, where she finds the Princess and Fred preparing to leave for Burma. The Princess leaves the room after telling Emily that she's stupid not to leave Fred for Gordon. Fred and Emily take some time to try to talk things through. Fred's frustration is taken out multiple times on the janitor who enters the room to clean, by screaming at him to get out. Fred is told the Princess is a fake, a fact that is confirmed soon after. She has embezzled 1000 pounds from him and taken off for Burma alone. Warning Emily not to tell him, \"I told you so\", he advises her not to rub it in. Emily gets a touching farewell letter from Gordon, and the letter blurs out of focus as her eyes fill with tears. The couple are left with barely enough money to pay their hotel bill and to book passage home on a cheap tramp steamer. The ship suffers an at-sea collision while they sleep. In a scene shot entirely within the stateroom, they hear the collision noise, Fred is knocked out, and while Emily tends to Fred, shouts of \"Abandon Ship!\" are heard, followed by loud thumping noises of people running and scrambling onto lifeboats. When Fred recovers consciousness, they find their stateroom door is jammed tight, they can't leave, and no one pays attention to their knocks and cries for help. The sounds recede, the power goes off, water levels are slowly rising, they hug to comfort each other, and resign themselves to die together, vowing that they both were each others great love in life, after all. At first light, the ship has pitched somewhat so they see they can exit by the porthole, and find the ship derelict and drifting, the other survivors having all been rescued. They're in their night clothes, so they find in another stateroom something to put on, \"in case somebody comes\". They step over a dead crew member, find a brandy bottle and gulp down a drink. A black cat exits to the outer deck in front of them. Further sinking seems inevitable, so Emily talks about what to do: \"Perhaps we should find a raft or something.\" Soon they sight a Chinese junk approaching. The Chinese crew of the junk boards quickly and begins to search for stuff that can be salvaged, paying scant attention to Fred and Emily, who transfer into the junk. Only a few moments later, the steamer gives a shake and a lurch, a warning that it may sink at any minute. The Chinese crewmen quickly abandon the steamer, transferring to the junk only the black cat and a few items, then slowly retreat from the sinking ship. One sailor, in the mad scramble, gets one foot caught in a rope, and dangles head down, attached to the sinking ship, and drowns while Fred, Emily and his comrades watch in helpless fascination. The large ship goes down. The junk's cook, a very pregnant woman, brings two bowls with food to Fred and Emily, which they first try to eat with chopsticks. They find the dish tasty and wolf it down one handful at a time. After they finish, they notice a black cat's pelt being stretched out to dry. They realize they've inadvertently eaten the cat! Some time later, they hear baby cries and see a group gathered at the kitchen door, so they figure the cook's baby has been born. The man who seems to be the father carries the crying baby in his arms and bathes it by simply pouring a bucket of cold sea water over it. Emily's maternal instincts are aroused and she becomes indignant at the rough treatment. \"Leave them alone,\" advises Fred, \"The Chinese breed like devils anyway.\" After several days aboard the junk, they approach land. They enter their old apartment, together and happy. Steak and kidney pudding and an ordinary life should do just fine from now on. Fred has really changed, since he takes the black cat down from the dinner table affectionately. In the last shot, the pair are seen arguing in a manner reminiscent of the scene prior to the arrival of the uncle's letter, only it is SHE who wants changes, like a bigger house, and HE is satisfied with the status quo.",
      "writers": [
         "Dale Collins",
         "Alfred Hitchcock"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023395/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzNDU2Mzk2NV5BMl5BanBnXkFtZTgwMDMyMDU4MTE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Henry Kendall, Joan Barry, Percy Marmont | See full cast and crew »"],
      "reviews": [
         "This change-of-pace from Hitchcock is quite an interesting film, often pleasantly witty and at other times a bit unsettling in its observations on human nature. It won't appeal to those looking for Hitchcock-style suspense (although there is one such sequence), but it is worth watching for some other reasons. The story is about Fred and Emily Hill, an average couple living a routine middle class life. The opening sequence, which is very nicely done using many of Hitchcock's silent film skills, immediately makes you feel the boredom and shallowness of Fred's world, while being amusing as well. Suddenly Fred receives word that a rich relative is giving him a large sum of money so that he can see the world, and the Hills are off on an extended trip to several foreign countries. The substance of the movie is in the ways that their new-found wealth and the many unfamiliar environments affect them and their marriage. Their new world is one of a couple of possible meanings of the title \"Rich and Strange\", in addition to the Shakespeare allusion. The cast is very small, and consists of actors little known today, but they are generally good and make their characters believable. As the Hills encounter hazards, temptations, and adventure, the question is whether they have really changed or learned anything from their experiences - the amusing last scene gives one possible answer, and along the way there are a lot of other subtle points. While not at all like Hitchcock's more famous films, in a different sense it is all Hitchcock - a distinctive movie, and carefully crafted. While only a minor effort among his many masterpieces, it is still worth a look for those who enjoy older comedies.",
         "I have been a Hitchcock fan for years yet had never stumbled on this early classic. Although several posters have commented that this film can't keep to a genre and seems to be all over the place, I disagree. RICH AND STRANGE is strictly comedy, albeit quite dark at times. It is Hitch's most British of satires and with an adventure setting to boot. A young couple goes off on a world trip after being advanced some inheritance money. The adventure starved office worker husband, seeking to sail the world, finds he can barely survive crossing the English channel and the subservient housewife willing to sacrifice all for her beloved quickly finds another when left alone for a few days. The ensuing travels shift the two from spectators in Paris to participants in the middle east to victims in the far east. It all proves they belong together. Among the classic Hitchcock touches of dark humour are the indignities of transportation and a cat who rightfully believes he belongs on the dining room table. Some scenes contain primitive experimental camera techniques that are quite funny when you think about it. The \"look left, look right\" Paris travel montage, the drunken scenes and the play on the number 19 are quite unique and funny in their right. I think steak and kidney pudding and a predictable life will do just fine from now on.",
         "RICH AND STRANGE is certainly nothing like stereotypical Hitchcock. Even early movies like The Lodger -- which was some five years older than this one -- contained some sort of crime or mystery. Even his comedies -- The Trouble With Harry, for example -- revolved around murder and mayhem. But not this movie. It's old and it's a comedy, but its title really says it all. Rich and very, very strange. Hitchcock's sense of humor is very plain here, and there are several laugh-out-loud scenes (when Fred Hill tries to set his watch, and later when he tries to get into bed, for example). But as the movie goes on, they become less frequent. The action stops focusing on the comedic aspect of this young couple's acquiring a great sum of money and spending it on a world cruise. Instead it focuses on the serious aspects of their dual extra-marital affairs on the ship, and later their actions when it wrecks and sinks. And once there, the movie is hardly comedic at all. Hitchcock's darker side comes out when a sailer drowns while his comrades watch on in fascination, and the scene with the rescued black cat is especially disturbing. So what to say about Rich and Strange? The acting is fine, Hitchcock's directing is up to par (especially with the silent opening scenes), and the plot is engaging. But the movie goes from screwball hilarity to morbid survival, and then ends where it began so abruptly that the viewer is left wondering when he or she dozed off and missed the last half of the movie. It's not stereotypical Hitchcock at all, but by no means does this make it a bad movie. The film is quite good but hard to stomach on account that it is so bizarre. 7/10",
         "For an early 'talking picture', this is an excellent film. Hitchcock fans will probably be disappointed, but I was not. Having been born in London in the 30's, I found the opening sequences fascinating and so well directed and edited. Anyone interested in Hitchcock should at least view the first 10 minutes or so of this film. One begins to see what a great director Hitch was - even without the mystery and horror.",
         "What an unusual Hitchcock film this is! For one thing, in this film, he doesn't focus on themes of murder and suspense as he is well remembered for. Instead, he takes a satirical look at the complexities of marriage and fidelity, with rich, quirky, and even disturbing humor. (It's interesting to note that Elsie Randolph returned in another twisted Hitchcock \"comedy\", \"Frenzy\", forty years after this film.) The editing is a bit crude by today's standards, although you just have to appreciate the mix of titles and audible dialogue to represent the transition from silent films to \"talkies\". Still, it's a funny film you can enjoy, with numerous Hitchcock elements clearly evident. Enjoy!",
         "This movie is interesting to me because of it's concentrating on Hitchcock's romance formula which runs through most of his films. In this film it IS the story. Hitch's recurring theme of romance is the partnership of man & woman; the way that partnership is formed, renewed & nurtured. I have always liked his concept of love & romance. It greatly enriches his films. It is a truer & nobler view of this part of life than is usually seen. I like to think that it mirrors the relationship of him & his wife (billed in the titles as Alma Reville; her maiden name). There is certainly more than a hint of things to come. The hero obsesses in much the way as the master did over several of the women he made stars of. I would imagine that Alma had to play much the same role as Joan Barry at some point. Oh well, Hitch was Hitch. He was supposed to be a cruel practical joker too. The movie starts out way too slow for modern audiences. Hang in there or fast forward if you can't stand it. The structure is quite interesting in that it is a hybrid of the silent & sound movie. The first sequence is silent & music is cleverly used in the bit with the umbrellas. All thru the movie portions are silent with faux sync or other tricks. Sometimes the sound quality is awful but bear in mind that getting ANY sound at all was a technical feat in those days. Could probably be cleaned up with Cakewalk (sound program) or similar. Somebody should make the effort. The film lab work too is less than stellar. I have worked the film labs & I really think some of the footage was developed in strong British tea. All in all a quirky & somewhat dated film but good for those who are studying the master.",
         "This 1931 movie is of interest simply because it is one of Alfred Hitchcock's early films that he made in Great Britain. It is also of interest because of the titles between sections of this film as though it were a silent film. That makes us very aware that silent movies had just been replace by 'talkies'. The copyright date is shown as 1931 on the film, not 1932 as IMDB has it listed. A man whose life has become mundane and tiresome is given money by a relative to enjoy life with. He and his wife set off on a cruise around the world. \"Rich and Strange\" begins well and certainly has its interesting moments. However, it bogs down after about the first half hour and doesn't recover until the last few minutes. Far too much time is spent aimlessly following the relationships outside the marriage by both the husband and wife of the couple. It seems that this part of the film is overblown. A highlight of the film is the spinster played by Elsie Randolph who is quite hilarious. Joan Barry is also very watchable as Emily. However, \"Hitch\" had not quite hit his stride yet and his best work was yet to come. This movie is mainly for diehard Hitchock fans.",
         "Rich and Strange or East of Shanghai, is a British romantic comedy dating from the transitional period between silent and sonic film. It was not very popular at the box office, but remains one of the director's (Alfred Hitchcock) favorite works from the period. The reasons seem obvious enough. Unlike the classic Hitchcock thriller/mystery/comedy \"The Lady Vanishes\" released several years later, Rich and Strange was an adaptation of a semi-comedic novel which was not plot-heavy but did rely on equally strong characterization. Hitchcock took the change of pace for a ride, and played with visual experiments, jokes and even visual metaphors which, if you notice them and think about them, actually enhance character development. Some reviewers have complained about the use of placecards - actually I think this was intended to enhance the comedic aspect of the film. Take a look back two years at Hitccock's \"Blackmail\" for comparison. This film was originally intended and partially shot silent. Hitchcock neither used placecards nor did he need them to convey his points in Blackmail. There are some classic bits of Hitchcock camera-work here. During meaningless conversations, meaningless framing is used seemingly to mock the action of the film itself. The classic example of this is a pair of symmetrically arranged scenes where two of the main characters are walking to and from a social event on a cruise ship, blathering away, while the camera follows their feet and Emily's (Joan Barry) dragging dress. Jarring, yet humorous! Joan Barry's stunning and adorable portrayal of Emily -our protagonist- is a bit of a perverse male fantasy - she is beautiful, intelligent (when she needs to be) and undervalues herself terribly - so her loyalty to a husband deserving of much much less is a bit exasperating. She is married to a whining, opportunistic, bore named Fred, and becomes romantically attracted to the charming Commander Gordon. The story boils down to this: Emly and Fred lead a life which causes Fred to whine (but this, it becomes clear later, is genetic and part of the fiber of his being). One night, they receive an early inheritance and decide to take a cruise around world and live the good life. Fred, however, remains the miserable lout he was at the beginning, but adds to his follies alcoholism, philandering, and seasickness. Money does not cure everything - a bit of cliché, but, with Rich and Strange, it doesn't end there. All of the acting is quite good, though as some have noted, it is sometimes over-the-top (perfectly appropriate for a comedy, IMO).",
         "Like Hitchcock's earlier film \"Blackmail\", \"Rich and Strange\" contains elements of silent film as a holdover from an earlier era. It features extended scenes uninterrupted by voice, and the use of inter title cards from time to time. Considering the lack of a murder victim, the movie plays out interestingly as it follows the infidelities of a married couple on board a round the world cruise. Some of it works, and some of it doesn't. What I enjoy in the early Hitchcock films is the experimentation with themes that will become a hallmark of the director's style in later years. The use of humor is abundant in the early going, starting out with the choreographed umbrella routine in an early scene. There's also the three shipboard friends that appear from time to time that walk and gesture in unison. Elsie Randolph's running gag as the Old Maid is also a frequent comedic break, that just about runs it's course by the story's end. The troubled marriage at the heart of the story is believable enough, as Fred Hill (Henry Kendall) and wife Emily (Joan Barry) find comfort in the arms of shipboard strangers. It's when The Princess (Betty Amann) ditches Fred and absconds with his money that he's finally confronted with the sham and phoniness of his life by Emily. Why Emily goes back to him is a question mark though, that's not explored sufficiently, especially since she found her own soul mate aboard ship in Commander Gordon (Percy Marmont). Maybe it was Gordon's age, he appeared to have about twenty years on the disarmingly attractive Emily. I don't know about you, but I would have certainly made more of an effort to escape my cabin once I realized the cruise ship was sinking. Fred and Emily didn't strike me as being too panic stricken, with voices not much above normal. The black cat that passed by once they managed to escape was nice touch, though the bad luck fell on the unlucky feline. I guess Chinese food had a reputation even back in the 1930's. The first time I saw the upside down drowning technique used in a movie was in the 1970 spaghetti Western \"Cry Blood, Apache\", but here it's used some forty years earlier, and with no malice involved. However it seems to me that the crew of the Chinese junk might have made an effort to save their buddy. The trade off for a newborn baby was a redemptive moment. If you watch the film again, pay attention to the Gordon photograph that Emily draws herself into with a marker. It's shown at three different times, and each time the drawing is slightly different. I wonder why they do that; was it a precaution against the possible loss of one of the pictures? A similar situation with an altered photo occurs in \"Mr. Moto's Last Warning\". I rather enjoyed \"Rich and Strange\", it's informative and fun to see the early work of a director of Alfred Hitchcock's stature. It's not often the title of a film also describes it's own action, this one is indeed both rich and strange.",
         "In this early Alfred Hitchcock film, some more production values were invested in Rich and Strange than you would normally find in an early British sound film for 1931. Hitchcock did actual location shooting in Port Said and in Marseilles in this travelogue of a movie. Marrieds Henry Kendall and Joan Barry seem to have settled in a very comfortable rut in their marriage. Might have been different had they had some children, but apparently that was not to be the case. Certainly if a small legacy hadn't come their way they would not have invested it in a round the world cruise. But spend it that way they did and it proves to be an adventure of sorts. Both go on some flirtatious flings and a shipwreck in the China seas manages to bring them both together. One thing I did like was the special effects in handling the sinking of their ship, quite good for its time. The dramatic highlight of the film is Kendall and Barry who were left on the drifting hulk of the ship, there and later on the Chinese junk that rescues them. The Chinese are portrayed with unusual sensitivity in terms of Kendall and Barry recognizing that while they're different and appear strange, they've got no right interfering in their culture. Still its not what you would expect from Hitchcock, no chases after the McGuffin, no intricate murder or spy plots. He's out of his element, but to be fair he wasn't big enough to be calling his own shots then."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "Fred and Emily Hill are leading a boring life in London. They receive a big inheritance by a rich relative and now they can realize all their dreams. They leave for a cruise behaving as rich people....but this is the beginning of the end. Richness makes they soon forget their love and family.",
         "Fred and Emily Hill lead a boring life in the London suburbs. They decide to escape from it all by writing to a rich relative and asking for their inheritance in advance. Using the money they go on a world cruise and get into a series of misadventures.",
         "Believing that an unexpected inheritance will bring them happiness, a married couple instead finds their relationship strained to the breaking point."
      ],
      "budget": 0
   },
   "movielensId": 2215,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1931-12-10",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Alfred Hitchcock"],
      "runtime": 83,
      "movieId": 2215,
      "title": "Rich and Strange",
      "mpaa": null,
      "actors": [
         "Henry Kendall",
         "Joan Barry",
         "Percy Marmont",
         "Betty Amann",
         "Elsie Randolph",
         "Aubrey Dexter",
         "Hannah Jones"
      ],
      "imdbMovieId": "0023395",
      "originalTitle": "Rich and Strange",
      "genres": [
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A couple, Fred (Henry Kendall) and Emily Hill (Joan Barry) , living a mundane middle-class life in London, are given a small fortune by an uncle as an advance against their future inheritance so that they can enjoy it in the present. Immediately Fred takes leave from his job as a clerk and they leave on a cruise for \"the Orient\". Fred quickly shows his susceptibility to sea-sickness while crossing",
      "tmdbMovieId": 36049,
      "avgRating": 2.8913,
      "releaseYear": "1931",
      "numRatings": 92,
      "posterPath": "/eDMrDdi85s2kHU1tBR5jS5lStkb.jpg"
   }
}