{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0022395",
      "video": false,
      "title": "The Skin Game",
      "recommendations": [
         36049,
         52907,
         31930,
         15007,
         36056,
         2761,
         20213,
         47695,
         70322,
         36055,
         44592,
         35832,
         38576,
         36054,
         24197,
         53051,
         45218,
         31995,
         54200,
         54479
      ],
      "backdrop_path": "/pyne43WulZjidsKuNFmqUtZPo0U.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mr. Hillcrist",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e46d",
               "name": "C.V. France",
               "profile_path": null,
               "id": 47667,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mrs. Hillcrist",
               "gender": 1,
               "credit_id": "52fe4841c3a36847f815e471",
               "name": "Helen Haye",
               "profile_path": "/57ZsJTrHg6aFPWZkkxo0kpYFBaw.jpg",
               "id": 3674,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Jill Hillcrist",
               "gender": 0,
               "credit_id": "52fe4841c3a36847f815e475",
               "name": "Jill Esmond",
               "profile_path": "/6ycUNWGU6Du41sf9XhbO2llKApy.jpg",
               "id": 122910,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr. Hornblower",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e479",
               "name": "Edmund Gwenn",
               "profile_path": "/6IL8cwEo3yPZs6hLq07YC0boUoI.jpg",
               "id": 22600,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Charles Hornblower",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e47d",
               "name": "John Longden",
               "profile_path": "/rsCoUEx2ThNIz12fBR6vPncCICk.jpg",
               "id": 7383,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Chloe Hornblower",
               "gender": 1,
               "credit_id": "52fe4841c3a36847f815e487",
               "name": "Phyllis Konstam",
               "profile_path": "/sJmYM2ZC6CWg0GDvGpmxrfNyKPO.jpg",
               "id": 553482,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Rolf Hornblower",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e48b",
               "name": "Frank Lawton",
               "profile_path": "/sxTEwrrSKf7DucjwZm69E8HPGtE.jpg",
               "id": 96764,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Mr. Jackman",
               "gender": 0,
               "credit_id": "52fe4841c3a36847f815e48f",
               "name": "Herbert Ross",
               "profile_path": null,
               "id": 554378,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Mrs. Jackman",
               "gender": 1,
               "credit_id": "52fe4841c3a36847f815e493",
               "name": "Dora Gregory",
               "profile_path": null,
               "id": 554379,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Dawker",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e497",
               "name": "Edward Chapman",
               "profile_path": "/560SL2ZjiLozbRyWGIMyBk2Aquy.jpg",
               "id": 33267,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "First Stranger",
               "gender": 0,
               "credit_id": "52fe4841c3a36847f815e49b",
               "name": "R.E. Jeffrey",
               "profile_path": null,
               "id": 553487,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Second Stranger",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e49f",
               "name": "George Bancroft",
               "profile_path": "/oIenpHjZT2tssS6ss4rmdooGDkT.jpg",
               "id": 13555,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Auctioneer",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e4a3",
               "name": "Ronald Frankau",
               "profile_path": null,
               "id": 554380,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Man at Auction (uncredited)",
               "gender": 0,
               "credit_id": "52fe4841c3a36847f815e4a7",
               "name": "Rodney Ackland",
               "profile_path": null,
               "id": 236446,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Man at Auction (uncredited)",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e4ab",
               "name": "Ivor Barnard",
               "profile_path": null,
               "id": 89209,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Van Driver (uncredited)",
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e4af",
               "name": "Wally Patch",
               "profile_path": "/fAD7tIoaRPPk46SrcQjB4cTgvjB.jpg",
               "id": 554381,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e469",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e483",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e4b5",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4841c3a36847f815e4bb",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4841c3a36847f815e4c1",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4841c3a36847f815e4c7",
               "name": "John Galsworthy",
               "profile_path": null,
               "id": 127022,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.043461,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 52748,
      "vote_count": 18,
      "budget": 0,
      "overview": "An old traditional family and a modern family battle over land in a small English village and almost destroy each other.",
      "similar": [
         274,
         10285,
         1949,
         949,
         910,
         996,
         654,
         1939,
         8834,
         12150,
         2832,
         4638,
         189,
         181283,
         336843,
         845,
         28902,
         9272,
         1923,
         10424
      ],
      "original_title": "The Skin Game",
      "runtime": 77,
      "poster_path": "/oIAqrTSB42jWNlbW8Q5SLYwhO4Z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1931-02-26",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "John Galsworthy",
         "Alfred Hitchcock"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0022395/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5MjcwNzI4N15BMl5BanBnXkFtZTgwODQ2NjA4MzE@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Edmund Gwenn, Jill Esmond, C.V. France | See full cast and crew »"],
      "reviews": [
         "The early 30s were a time of experimentation for Hitchcock, with theme as much as with technique. After discovering that the crime thriller was his forte with Blackmail and Murder!, his at the time zigzagging career lead him to attempt a talkie drama adapted from a fairly mediocre stage play concerning a feud between the families of an aristocrat and an entrepreneur. In attempting a straight ahead drama without any major thriller elements, Hitchcock nevertheless employs all the techniques he had been perfecting in his earlier crime pictures \u0096 dynamic editing, a focus on the psychology of guilt and fear, as well as some of the sound techniques of his previous talkies. Sometimes it works, other times it doesn't. He tries to inject some tension into an auction scene with whip pans and quick editing, which is a fairly good display of technique but we don't really care enough about the outcome of the bidding to get really drawn in at this point. For some of the more talky scenes, Hitchcock tries to move beyond the story's theatrical roots by focusing on reactions and having dialogue take place off screen. This helps to give weight to the second half of the film. In particular, Hitch's dwelling on the face of Chloe, the innocent victim of the feud, makes the audience feel sympathy for her character, which in turn makes the climactic scenes work and prevents them from slipping into ridiculous melodrama (which the stage version may well have done). For some of the more subdued scenes, Hitchcock preserves an unbroken take but still takes the focus on and off different characters by smoothly dollying in and out. This same method would be used by Laurence Olivier when he began directing Shakespeare adaptations in the 1940s. However, too many of the dialogue scenes in The Skin Game are simply a lot of panning as the camera tries to keep up with extravagant theatrical performances. This is a fairly good go at theatrical drama for Hitchcock, but it was made at a time when he was coming to realise not only his strength in the suspense thriller, but his weakness in (and utter distaste for) every other genre. He was probably beginning to look at this kind of project as a rather dull waste of time, and definitely at odds to his sensibility. As an example, this is one of the very few Hitchcock pictures to take advantage of natural beauty, and yet he makes this aspect a victim of his playful irony, by taking his most beautiful countryside shot, then pulling out to reveal it is merely a tiny picture on a sale poster, surrounded by Hornblower and his cronies laughing over the deal they have just made. The Skin Game is rarely gripping, but at times it is powerful, and in any case it has a short enough running time to prevent it from getting boring. Hitchcock however was looking now to have more fun with crime and suspense, and this sense of the dramatic (not to mention a sense of genuine sympathy for the victim) would not return until his later Hollywood pictures, and even then only occasionally.",
         "Technical crudities, print/sound deficiencies and dated acting styles taken into consideration, \"Skin Game\" still has innovative (for the time) camera techniques and thematic ambiguity (who is right and who is wrong? Who are the true villains of the story?) and is generally better than other, more \"typical\" Hitchcock films of the period, like \"Murder!\" from 1930.Edmund Gwenn is terrific and Phyllis Constam is quite sexy. (**1/2)",
         "Hitchcock may be the master of suspense, but this movie doesn't show that mastery fully-developed. The movie starts out strong, and builds to a great climax, but then wraps up abruptly. The movie shows much of Hitchcock's skill at building suspense, but doesn't deliver an ending to match the rising tension. It's too bad, because the build-up is very strong. Pay attention to the epilogue scene for great use of irony. About the title: A \"skin game\" means a swindle, trick, or scam. The movie starts with Hornblower (Edmund Gwenn) buying property from the proud, proper English landowner Hillcrest (C.V. France), assuring him that the tenant farmers would be allowed to stay. Soon Hornblower evicts them to build factories, because he is a man of progress and industry. Hillcrest is outraged, and sets out to stop Hornblower's efforts to buy up land for more factories. Hillcrest attempts to slow down Hornblower's land purchases by rigging an auction on some property that's up for sale. But Hornblower figures out the scheme, and outsmarts Hillcrest with his own tricks. Hillcrest escalates the feud by hiring a man to dig up dirt on Hornblower and his family. To avoid spoilers, read no further ... The hired investigator manages to dig up a secret about Chloe Hornblower (Phyllis Konstam) that's so horribly scandalous that the characters in the 1931 movie can't even explain it in plain language: She went with men to help them get their divorces. The Hillcrest family blackmails Hornblower with the threat of revealing the secret. Hornblower sells the property he had bought back to Hillcrest, at a loss, to keep the dirty secret quiet, and Hillcrest solemnly promises to say nothing. But the secret, once discovered, can't be kept hidden by mere promises, and it comes out. Chloe is desperately shamed, and kills herself. Hornblower is ruined, his his family name smeared and his wealth greatly diminished. Hillcrest has won the feud, but at the cost of his pride as an honorable landowner. Ironically, when the tenant farmers appear to thank him for being able to return to their rented farm, Hillcrest doesn't even remember Hornblower's original offense.",
         "I feel many writers and critics, David Sterritt, Donald Spoto to name but two are too dismissive of this movie. With the technological restrictions of the very early talkie, Hitchcock as used his artistry to compose fluidity and cinematic suture to a rather stolid Galsworthy play. Already mentioned are the innovative zip pans, he also has intelligent use of dissolve, symbolism aplenty within montage sequences, sheep v horn (Hillcrest v Hornblower). The juxtaposition in the opening sequence of the car and the horse sets the theme beautifully. Occasionally there is daring reverse shots of the same objects defying the 180 degree rule, especially noticeable as we break into the proscenium arch of theatre.",
         "\"The Skin Game\" is one of Alfred Hitchcock's earlier sound pictures, and although the story held potential, it is a rather bland film despite a couple of good Hitchcock touches. The story centers on a rivalry between two neighboring families who have very different views on the future of their community. Mr. Hornblower (Edmund Gwenn) wants to see the land developed and used for factories and businesses, while the Hillcrest family wants to see the traditional homes and countryside preserved. The resulting conflicts hold some real potential, and lead to some good moments as the families try to outwit each other in a \"skin game\", but the movie as a whole is never really very compelling. It's hard to pinpoint exactly why this is not a better film. There are no big names in the cast, but Hitchcock made several fine movies with just this sort of cast. Gwenn is good in his role, and Phyllis Konstam is believable and sympathetic as his daughter-in-law whose troubled past eventually provokes a crisis between the two families. Perhaps Hitchcock stayed too close to the play on which the film is based (it does have a bit of a stage-bound feel), or perhaps for once he did not have a strong sense of the material's potential. Hitchcock saved his best for the movie's most important scene, when a crucial parcel of land is auctioned off. The auction scene, and a confrontation afterwards between the main characters, is well-done with some good twists. There are also some nice ironic touches at the end. Hitchcock fans should still watch \"The Skin Game\" at least once, to notice the ways that the director's usual touch can be seen, but this movie may not be of much interest to others.",
         "....this is good early Hitch! good screenplay,good directing and good acting!Phyllis Konstam is the stand-out .Her portrayal of Chloé can still grab today's audience . Good scenes: -the auction sale,twenty-eight years before \"North by Norwest\" ,is one of the most suspenseful moments of the Master's English era.And there's a brilliant unexpected twist when we think it's over! -when Chloe takes refuge in her father-in-law's enemy's house,the things seem to have a life of their own:the door,the window,the curtains.. And in 1931,Hitchcock avoids over-simplification:who is good,in the end?who is evil?The local squire and his lady or the arrogant nouveau riche?Who did you have to save?the old couple or the ill-fated Chloé? In the Truffaut/Hitchcock book,the master says \"I did not choose that subject and there is nothing to say about it.\"",
         "I recently saw Hitchcock's \"Rich and Strange\" and really enjoyed it, so I was game for another go at this early 1930's British cinema, in my attempt to become a \"Hitchcock completist.\" Please keep in mind that I'm an American with a pretty-good ear for British dialog, but there are some speeches contained here that I couldn't understand in the least. But only a fairly small portion that is. The early sound equipment doesn't help either. The title \"The Skin Game\" refers to a heated altercation that leaves no holds barred, and no prisoners taken. The plot line is essentially a \"Hatfields and McCoys\" family feud over land rights, with a lot of dirt being dug up on both families involved. Like pretty much all early sound films, there is a heavy reliance on dialog and the spoken phrase, which makes \"The Skin Game\" obviously derived from the stage. At the beginning there's a long take with probably ten pages of dialog in it, using a medium shot of three characters, with the camera panning between them. At least once, someone was speaking dialog while not on camera, which I always find distracting -- a minor flaw I admit, but noticeable. Hitchcock's pacing feels relatively quick considering, and he keeps interest in these scenes with dramatic exits and entrances of characters, and revelations of plot details. Really some of these takes were so long that actors coughed, dropped things and retrieved them, and other apparent flubs that were never re-shot. Seems like once the director was five minutes into a scene he couldn't afford the film stock to begin again, so there are a lot of miscues and such, which kind of adds to the immediacy. Especially considering that I'm certain that even the young Hitchcock was keenly aware of every missed cue and dropped line, and it had to drive him to distraction! I was certainly impressed by this early Hitchcock effort and I'm sure that audiences back then went away from this one with the feeling that they got their money's worth. It was apparent that an extremely talented film maker was at work here, trying to keep the audience involved every step of the way. And he did succeed actually. For instance, there is a scene at an auction house that lasts for about ten minutes, and Hitchcock sets it up in such a way to keep the audience anxiously awaiting the outcome. He has the camera making very fast pans from one bidder to the next, slowing down only when the bidding does. The audience has some background information about the proceedings, but not enough to spoil the surprise at the end. It's early sound cinema -- so most viewers today can't bear this kind of thing, but if you're familiar with and enjoy films of the early 20Th Century, it's extremely enjoyable and does have a payoff at the end! *** out of *****",
         "\"The Skin Game\" is a great example of Hitchcock's trek into the cinematic master that was to become. His 15th film as a director, the first 10 being silent films, and the film's soundtrack suffers from the same sort of distractions that all cinematic innovations seem to generate; early color films often used overly intense and saturated colors, the first widescreens spread the action out simply because they could, and 3D movies used deliberate dimensional effects that had no real part of the movie (the paddle-ball guy in \"House of Wax\" comes immediately to mind). There are several sequences where people are shouting, dogs are barking, and car horns are blowing - having absolutely nothing to do with the plot, but certainly it stunned the audience of its day with ACTUAL SOUND! The soundtrack was very obviously redubbed (and rather poorly in places) probably due to the camera equipment being so noisy. To make matters worse, the dogs barking sound suspiciously like people, and there are a lot of sequences of dialog where the actors deliberately turn their backs to the camera - redubbing is much easier when you don't have to lip-sync. There are also several scenes that have a noticeable lack of sound effects until the characters begin speaking (example: Hornblower leaves a house, closes the door, walks to his car and gets in, all in complete silence... something that the audiences of the day would probably never have noticed). I won't duplicate the descriptions that others have left - the plot is not very complicated, so long as you can follow the dialog through the poor soundtrack and the various British accents. Even the DVD soundtrack is horribly inconsistent, but the film is still worth the time for any Hitchcock fan. This is a film that could benefit greatly from having subtitles - and the DVD does indeed have subtitles - but only in French, Spanish, and Portuguese... no English! The conflict of old money versus new money and the unstoppable progress of industry eroding away at the established lifestyle of the days of the land-owners figure prominently in the plot. The film \"bookends\" in a truly bittersweet way with an elderly couple and their cottage, which results in what was easily the most stunning comment of the entire film (far more startling than the \"big secret\" that the film really revolves around). If you look close enough, there's a really significant story... and it's worth the effort. I'd give it a 6 out of 10 for today, but probably a 7.5 for its day. ANTI-SPOILER: Don't look for the traditional Hitchcock cameo. He doesn't make an appearance in this film. ;)",
         "Few movies retain the structure of the stage play that preceded them more than this one. There are entrances and exits, blocked moves across stage-set great rooms, and only two or three major locations, and a few others thrown in. In some outdoor scenes the painted sets are almost painfully obvious, and the shot of a factory, smoke billowing from the stacks and all, is obviously a model. The story pits two families against each other: Mr. Hornblower (Edmund Gwenn) is a successful entrepreneur of a vaguely industrial class and accent, set on expanding his factory in a beautiful plot of land and evicting old tenants as well. The Hillcrists set out to stop him by bidding on the property, but his agent buys the property for him. Mrs. Hillcrist sets out to do battle, and her operatives discover an unpleasant secret about young Charlie Hornblower's wife Chloe (Phyllis Konstam), who in a previous existence had taken money to be photographed with a man for divorce cases. She and the Hillcrist agent Dawker force Hornblower to sign over the property and promise to do no harm, in exchange for silence. Chloe is terribly upset; she's in love with her husband, and pregnant as well, and when he finds out about the secret\u0097from the unprincipled Dawker, she throws herself into a reflecting pool. As an epilogue Mr. Hillcrist tries to apologize, sincerely, and Mr. Hornblower says he'll do whatever he can to hurt the family and the village. The movie ends with an old tree being chopped down. The acting is mostly tepid and stagy, except for Konstam, who looks anxious and desperate and trapped\u0097her voice, however, falls into the \"thrilling\" category, with nearly as much vibrato as Billy Burke. But the best by far is Gwenn, a little dynamo, cheerfully pugnacious, a self-made man, unscrupulous in public and loyal at home, and determined to bring down old traditions of snobbery. Not a mystery.",
         "Not to be dismissed. After a slow and confusing start, this early Hitchcock talkie version of a John Galsworthy play kicks in and gets interesting. It's still stagy for Hitchcock, but not bad at all. The plot revolves around 200 acres of land and two families fighting for possession of it. One is the local squire who is afraid the crude upstart will snatch it up and ruin his lifestyle. So it's a story of money and class in England. Edmund Gwenn plays the crude little man who boasts about the \"skin game\" he'll be playing with the snooty squire and his wife (C.V. France and Helen Haye). They don't quite get it. The film really picks up steam at the public auction where the squire's wife snubs Gwenn's daughter in law Chloe (Phyllis Konstam). We don't learn about her til later. The auction ends with the squire thinking he has stopped Gween from winning the land but is crushed to discover the \"skin game\" was that Gwenn had planted an agent to bid for him. The squire and wife decide to get something on the daughter in law and get back at Gwenn. In the meantime we learn that Chloe is pregnant and does indeed have a shady past. The squire's daughter Jill (Jill Esmond) starts to soften toward the troubled woman but her mother is relentless. The mother forces Gwenn into selling back the land for half the price he paid in return for their silence. Unfortunately the husband gets wind of this and goes nuts. A melodramatic ending ensues. Gwenn is very good in a rare turn as the assumed villain. Konstam has a terrific scene when she confronts the squire and wife. Haye is good as the wife. Esmond gets better as the film goes on. France is very stagy. No one else registers very strongly. There are a few Hitchcock flourishes but it's mostly a filmed stage play. Phyllis Konstam had already made two films with Hitch, Blackmail and Murder, and she seems to sense the way the camera works more than the other actors. The downside of this film is the very bad editing and the bad sound. Stick with this one; it's not so bad."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "A rich family, the Hillcrests, is fighting against the speculator, Hornblower, who sends away poor farmers to build factories on their lands. When Mrs. Hillcrest finds out that Chloe Hornblower was a prostitute, she uses this secret to blackmail the speculator and force him to stop his business.",
         "When nouveau riche, social climber Mr. Hornblower buys property abutting their estate from the aristocratic Hillcrist family, he promises that the tenant family on that land can live there in perpetuity. The relentlessly pushy Hornblower goes back on his word and evicts them anyway when a second anticipated land deal falls through. When Hillcrist finds out that Hornblower plans to turn the pastoral farmland into a chimneyed factory complex and house blue collar workers on the grounds adjoining his beloved manor, he vows to fight back and never accept the Hornblower Family as equals. After Hornblower outwits Hillcrist in an auction for an additional piece of area property, the aristocratic Hillcrists find their beloved estate totally surrounded by the upstart Hornblower. After Mrs. Hillcrist counters with blackmail involving Hornblower's daughter-in-law and threatens to make salacious details of her past life known unless the debated land is returned, tragic consequences result.",
         "An old traditional family and a modern family battle over land in a small English village and almost destroy each other."
      ],
      "budget": 0
   },
   "movielensId": 2216,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1931-02-26",
      "dvdReleaseDate": "1999-07-24",
      "directors": ["Alfred Hitchcock"],
      "runtime": 77,
      "movieId": 2216,
      "title": "The Skin Game",
      "mpaa": "",
      "actors": [
         "C.V. France",
         "Helen Haye",
         "Jill Esmond",
         "Edmund Gwenn",
         "John Longden",
         "Phyllis Konstam",
         "Frank Lawton",
         "Herbert Ross",
         "Dora Gregory",
         "Edward Chapman",
         "R.E. Jeffrey",
         "George Bancroft",
         "Ronald Frankau",
         "Rodney Ackland",
         "Ivor Barnard",
         "Wally Patch"
      ],
      "imdbMovieId": "0022395",
      "originalTitle": "The Skin Game",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "An old traditional family and a modern family battle over land in a small English village and almost destroy each other.",
      "tmdbMovieId": 52748,
      "avgRating": 2.80556,
      "releaseYear": "1931",
      "numRatings": 54,
      "posterPath": "/oIAqrTSB42jWNlbW8Q5SLYwhO4Z.jpg"
   }
}