{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0021015",
      "video": false,
      "title": "Juno and the Paycock",
      "recommendations": [
         35832,
         36055,
         36049,
         99886,
         52748,
         20213,
         52907,
         43384,
         48133,
         48140,
         15007,
         36054,
         2762,
         4175,
         31995
      ],
      "backdrop_path": "/wXk3CKiwdEvAPWzXh80fPLndGP1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "The Orator",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b861",
               "name": "Barry Fitzgerald",
               "profile_path": "/qT8v92uSb19IsHxuqBGNU43iVJ6.jpg",
               "id": 13820,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Maisie Madigan",
               "gender": 0,
               "credit_id": "52fe4740c3a36847f812b865",
               "name": "Maire O'Neill",
               "profile_path": null,
               "id": 119669,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Captain Boyle",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b869",
               "name": "Edward Chapman",
               "profile_path": "/560SL2ZjiLozbRyWGIMyBk2Aquy.jpg",
               "id": 33267,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "'Joxer' Daly",
               "gender": 0,
               "credit_id": "52fe4740c3a36847f812b86d",
               "name": "Sidney Morgan",
               "profile_path": null,
               "id": 147524,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs Boyle, \"Juno\"",
               "gender": 1,
               "credit_id": "52fe4740c3a36847f812b871",
               "name": "Sara Allgood",
               "profile_path": "/rNTIjpZXtXurKCyTzCNbMQ5ljwR.jpg",
               "id": 7381,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Johnny Boyle",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b875",
               "name": "John Laurie",
               "profile_path": "/fOo2XHmHSDSeo7TUpm0l64C6ZOq.jpg",
               "id": 3673,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jerry Devine",
               "gender": 0,
               "credit_id": "52fe4740c3a36847f812b879",
               "name": "Dave Morris",
               "profile_path": null,
               "id": 147525,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Mary Boyle",
               "gender": 1,
               "credit_id": "52fe4740c3a36847f812b87d",
               "name": "Kathleen O'Regan",
               "profile_path": "/hS3POYsYey6wlIRMYBuEnmaGKsj.jpg",
               "id": 147526,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Charles Bentham",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b881",
               "name": "John Longden",
               "profile_path": "/rsCoUEx2ThNIz12fBR6vPncCICk.jpg",
               "id": 7383,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "The Mobiliser",
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b885",
               "name": "Dennis Wyndham",
               "profile_path": "/3Zoj3QjdGIxTcc3OWOL7jSpuD2D.jpg",
               "id": 147527,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Mr Kelly",
               "gender": 0,
               "credit_id": "52fe4740c3a36847f812b889",
               "name": "Fred Schwartz",
               "profile_path": null,
               "id": 147528,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b85d",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b88f",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4740c3a36847f812b895",
               "name": "Emile de Ruelle",
               "profile_path": null,
               "id": 7387,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b89b",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4740c3a36847f812b8a1",
               "name": "Sean O'Casey",
               "profile_path": null,
               "id": 147529,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4740c3a36847f812b8a7",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4740c3a36847f812b8ad",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.836056,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 47695,
      "vote_count": 12,
      "budget": 0,
      "overview": "During the Irish revolution, a family earns a big inheritance. They start leading a rich life forgetting what the most important values of are. At the end, they discover they will not receive that inheritance; the family is destroyed and penniless. They must sell their home and start living like vagabonds.",
      "similar": [],
      "original_title": "Juno and the Paycock",
      "runtime": 85,
      "poster_path": "/lGsScGu3pktbddUApGfLp0m6I9G.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1930-06-29",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 85,
      "synopsis": null,
      "writers": [
         "Sean O'Casey",
         "Alfred Hitchcock"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0021015/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzOTcwMjYzMF5BMl5BanBnXkFtZTcwNDgxODUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sara Allgood, Edward Chapman, Barry Fitzgerald | See full cast and crew »"],
      "reviews": [
         "Most people don't like this film, not realizing that a) it's one of Hitchcock's very first British films, on a low budget; and b) that it's not a thriller or suspense film, but based on a masterfully written comic tragedy by Irish playwright Sean O'Casey. Very faithful to the play, this film is fairly well acted, and fairly well cast. Though most seem to think Sara Allgood is the standout as Juno, I particularly like Sidney Morgan's wonderful portrayal as Joxer, and Edward Chapman's performance as Captain Boyle is also very good, But writing and acting aside, this film is not without its flaws. Obviously on a tight and tiny budget, the quality of film and sound are fairly awful, and Hitchcock's direction and cinematography is less than stellar, with a rash of low shots and cut-off heads. Still, the poor quality of film and filming can be excused for budgetary constraints, and the fact that this is such an early Hitchcock film. Definitely worth watching if you like the play, which I do, but don't expect and thrills or shocks; this is a talk-heavy play about Irish troubles during the uprising with some very sharp and wicked humour and some very tragic commentary. Not Hitchcock's best by a longshot, but severely underrated. 6/10.",
         "Adapting a heavy-handed play into a successful film is a gamble which can produce a masterpiece, like O'Neill's A LONG DAY'S JOURNEY INTO NIGHT, or a complete misfire such as in this case. O'Casey's JUNO AND THE PAYCOCK, considered one of his greatest works, could and should have been a better, more mobile dramatic film under the hand of Alfred Hitchcock who had already produced THE LODGER and BLACKMAIL -- early masterpieces of suspense -- but it seems as though the Director did not really know the material or did not know how to approach such a story in a visual way. There are times when the story becomes so still that it seems as though one is watching paint dry. What saves the film from total oblivion is the very theatrical performance of Sara Allgood as Juno Boyle: she carries the emotional weight of the drama that plays itself out, and her outcry at the end is very potent. Hitchcock would only direct another similarly themed movie called THE SKIN GAME two years later, but it's clear that at this point of his career he was experimenting with sound and would move on to much better films as the Thirties progressed.",
         "Sean O'Casey's play does not translate to the screen very well. A bit talky, it may have worked fine on stage, but it is not movie material. Still Hitchcock has moments where he shows his genius as a filmmaker. There are camera shots and editing cuts that tell more of the story than any of O'Casey's dialog. Still, I would not recommend this film for anyone who is new to the work of Alfred Hitchcock. Save this one for the advance class, and let the beginners view \"The Secret Agent,\" \"Shadow of a Doubt,\" \"Vertigo,\" and \"Psycho,\" just to name a few.",
         "Yes, it's \"talky.\" Possibly because it's a film version of Sean O'Casey's seminal stage play about poverty, class, betrayal and death in the slums of Dublin during the Irish Civil War.\" Dull?\" This film is taut enough that a common votive light becomes as frightening as the appearance of a ghost. And a doomed young man's descent into paranoia and babbling fear fairly bursts on the screen. The discerning viewer will not only be rewarded with a moving story; the Hitchcock touches are there as well. A young director already finding his voice while handling serious material. The dark humor (The Trouble with Harry), the suspense that builds in silence (Lifeboat), and the immediate presence of the camera in the midst of life (Rope). All there. Studios often resort to misleading packaging in attempts to lure the unsuspecting into renting/seeing/buying a movie that would otherwise not attract them. Those who only like their Hitchcock with a boy in mama's dress or a bird on a wire WILL hate this gem. Their loss.",
         "Having been a Hitchcock fan for forty years I have not been able to see this until now, thanks to a very cheap and poor quality DVD. This straightforward fill of Sean O'Casey's play turns out to be a powerful piece of admittedly primitive early film-making. This is from a time when sound editing was impossible - scenes had to be taken in long takes with four cameras and cut ins added in - very much like studio TV. I am shocked that one reviewer refers to bad photography with heads cut off. That's the bad transfer on the disc which cuts quite a lot of the image, often cutting of heads. If we could see a good print this would be powerful stuff with, surprisingly, a lot of very strong Hitchcock moments - including a ma in atrench coat waiting in the street - to execute JOhnny who was betrayed his republican group. It's also an extraordinarily authentic picture of an intensely catholic world. Ireland is still suffering from internal fighting but the is celebrating independence - but at the same time these people suffer from extreme judgemental attitudes. The rejection of the pregnant daughter by her previous boyfriend is simple and chilling. We desperately need restorations of Hitchcock's pre 1934 films. The silents are excellent when you see them pristine. The copies in circulation are only hints of what they are really like. In its way a key work in Hitchcock's oeuvre. He may have dismissed it in the TRuffaut interviews, but take that with a pinch of salt. He avoids any mention of Fritz Lang influence too - and yet if you see Spione, M, or the Mabuse films you see how much he owed to Lang.",
         "Extremely well-done film, crisp and merciless. The B/W despair of the Dublin slum, and Juno, the woman trying to cope with two adult children in a time of Civil War are presented sharply. The prospect of a small inheritance leads \"Capt.\" Boyle into wild extravagance, shadowed by his hysterical son, who has lost an arm in the conflict, and is hiding, terrified, by the vigil light. The daughter Mary's innocent ambition to escape the tenement is betrayed twice. Two young men die in the embattled streets. The end is one great cry: \"Take away our hearts o'stone and give us hearts o' flesh.\" (NB: If you're expecting a jolly Honeymooners sitcom, skip this!)",
         "Juno and the Paycock is very much like Sean O'Casey's other filmed work, The Plough and the Stars. Both plays are centered on typical Irish families in Dublin trying to survive in times of strife. Plough and the Stars takes place during the Easter Rebellion and Juno and the Paycock takes place during the Civil War after the British leave everything but Ulster. The Boyle family who are the protagonists are not the noblest clan ever put on film, but I think a lot of us would recognize ourselves more than we care to admit. Sara Allgood is mother Boyle, nicknamed Juno who bears all kinds of tribulations for the 90 minutes of the film. She has one useless husband who'd spend all his time in the pub if he could, a son who's an amputee lost in the fighting, and a daughter who gets taken in my an English solicitor who brings news of an inheritance and then takes advantage of the daughter. Sean O'Casey got good and slammed after these two plays were produced, showing a side of Irish life that wasn't pleasant. Today they are masterpieces. Juno and the Paycock could probably use a more modern production now. This was one of Alfred Hitchcock's earliest sound features, but it really is a photographed stage play for the most part. When John Ford did The Plough and the Stars he very cleverly cut in a lot of newsreel footage from the Easter Rebellion giving a real feeling for the times. What Ford did and what Hitchcock didn't do was inject typical John Ford touches in the film so it is more Ford and O'Casey. Hitchcock was hardly as well known in 1930 as opposed to the reputation he later developed. The Hitchcock touches that we all later came to know are hardly present here. In fact this really isn't a Hitchcock kind of film at all. But he did it as a contractual obligation. Because it wasn't his kind of film, Hitchcock dismissed it. But the film is definitely true to what O'Casey was trying to convey.",
         "This is a work of socialist realism, showing the lives of the working-class from the worker's point of view. It is shocking and raw, but contains a great deal wit and humor. It is certainly a surprise to see Hitchcock handling such overtly political material. He does it with a great deal of sensitivity. He allows Sean O'Casey's wonderful dialogue to carry the film and does not allow any cinematic tricks to get in the way. This is a must-see film. For those who think that Hitchcock is all technique and no ideological substance, it will be a surprise and a revelation. Only \"The Skin Game\" matches it for overtly Marxist political drama.",
         "The DVD I own of this film is of dire quality. It is, like other botched, cheapo versions of Hitchcock's early films, a disgraceful transfer from poor quality source. People's heads are cut off by the zoomed in picture, the foggy, grainy picture and awful sound quality detract greatly from viewing pleasure and yet I loved this film! Bear in mind this is a very early talkie with the disadvantages all early talkies have (even famous classics such as Frankenstein etc) namely: 1. Very static, plain camera work due to huge, unwieldy camera/sound equipment (the master Hitchcock naturally does better than others with this but his genius camera-work IS hampered) 2. Slightly theatrical acting by some actors as they ARE theatrical actors, not used to screen acting which had previously been silent. This is clearly a film of a play and therefore Hitchcock himself wasn't fond of it but he did a superb job as did most of the cast. It is amazingly hard-hitting, moving, emotionally involving and at the same time has gripping scenes of tension and classic Irish humour. I am disappointed this is so little known and not appreciated. It is a truly excellent film within its limitations. It is a disgrace that no company has released a restored version of this still!",
         "This is a very early sound movie; therefore, many of the technical aspects are very primitive, so you must use a bit of patience. But, some of the acting is top-notch, and of course, the play is a classic of the Irish stage. The two standouts as actors is the man who played the outlandish sponge and hanger-on, Jockster, and Sara Algood (sp?) always a dynamite character actor--as Juno, she shines. All in all, this Hitchcock adaption of the play is well done. \"Juno and the Paycock\" eventually goes in a direction that you would not expect, but in any event, the way in which it looks at Dublin's poor is rather unflinching."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "During the Irish revolution, a family earns a big inheritance. They start leading a rich life forgetting what the most important values of are. At the end, they discover they will not receive that inheritance; the family is destroyed and penniless. They must sell their home and start living like vagabonds.",
         "During the Irish revolution, a family earns a big inheritance. They start leading a rich life forgetting what the most important values are."
      ],
      "budget": 0
   },
   "movielensId": 2218,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1930-06-29",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Alfred Hitchcock"],
      "runtime": 85,
      "movieId": 2218,
      "title": "Juno and the Paycock",
      "mpaa": "",
      "actors": [
         "Barry Fitzgerald",
         "Maire O'Neill",
         "Edward Chapman",
         "Sidney Morgan",
         "Sara Allgood",
         "John Laurie",
         "Dave Morris",
         "Kathleen O'Regan",
         "John Longden",
         "Dennis Wyndham",
         "Fred Schwartz"
      ],
      "imdbMovieId": "0021015",
      "originalTitle": "Juno and the Paycock",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "During the Irish revolution, a family earns a big inheritance. They start leading a rich life forgetting what the most important values of are. At the end, they discover they will not receive that inheritance; the family is destroyed and penniless. They must sell their home and start living like vagabonds.",
      "tmdbMovieId": 47695,
      "avgRating": 2.38,
      "releaseYear": "1930",
      "numRatings": 50,
      "posterPath": "/lGsScGu3pktbddUApGfLp0m6I9G.jpg"
   }
}