{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "bride",
            "id": 3582
         },
         {
            "name": "fisherman",
            "id": 5420
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "secret love",
            "id": 7879
         },
         {
            "name": "deception",
            "id": 9758
         },
         {
            "name": "unrequited love",
            "id": 10048
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "best friend",
            "id": 12392
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "young wife",
            "id": 174534
         },
         {
            "name": "guilty conscience",
            "id": 189931
         },
         {
            "name": "coastal village",
            "id": 191485
         },
         {
            "name": "moral dilemma",
            "id": 198423
         },
         {
            "name": "isle of man",
            "id": 209979
         },
         {
            "name": "abandonment",
            "id": 216734
         },
         {
            "name": "seafarer",
            "id": 236465
         },
         {
            "name": "deemster",
            "id": 236488
         },
         {
            "name": "public disgrace",
            "id": 237185
         }
      ],
      "imdb_id": "tt0020142",
      "video": false,
      "title": "The Manxman",
      "recommendations": [
         35832,
         36054,
         36055,
         7983,
         52748,
         36049,
         47695,
         52907,
         31995,
         43884,
         64398,
         42226,
         44163,
         68440,
         15007,
         84981,
         38770,
         38687,
         685,
         45218
      ],
      "backdrop_path": "/tH9ZSvUyzjKfCeobbB3qSBXg6s7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Pete Quilliam",
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e00294b",
               "name": "Carl Brisson",
               "profile_path": "/zR8dEttW0duwVVjaYoHDIgRRwMw.jpg",
               "id": 115155,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Philip Christian",
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e00294f",
               "name": "Malcolm Keen",
               "profile_path": "/kH1sBRZZKh5vBGBzciKGbg4FC4k.jpg",
               "id": 27914,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Kate Cregeen",
               "gender": 1,
               "credit_id": "52fe43ddc3a368484e002953",
               "name": "Anny Ondra",
               "profile_path": "/2QsxUTTexDPhCluiZcOtVRl7juB.jpg",
               "id": 7380,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Caesar Cregeen",
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e002957",
               "name": "Randle Ayrton",
               "profile_path": null,
               "id": 553224,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Mrs. Cregeen (as Claire Greet)",
               "gender": 1,
               "credit_id": "52fe43ddc3a368484e00295b",
               "name": "Clare Greet",
               "profile_path": null,
               "id": 37870,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Ross Christian (uncredited)",
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e00295f",
               "name": "Kim Peacock",
               "profile_path": "/8QCPypkV40NkPHbv3HlO6Bx6Rk8.jpg",
               "id": 553225,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Wardress (uncredited)",
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e002963",
               "name": "Nellie Richards",
               "profile_path": null,
               "id": 553226,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Doctor (uncredited)",
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e002967",
               "name": "Wilfred Shine",
               "profile_path": null,
               "id": 553227,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Man (uncredited)",
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e00296b",
               "name": "Harry Terry",
               "profile_path": null,
               "id": 553228,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e002923",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e002929",
               "name": "Hall Caine",
               "profile_path": null,
               "id": 553223,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e00292f",
               "name": "Eliot Stannard",
               "profile_path": null,
               "id": 27905,
               "department": "Writing",
               "job": "Scenario Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ddc3a368484e002935",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e002941",
               "name": "Emile de Ruelle",
               "profile_path": null,
               "id": 7387,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ddc3a368484e002947",
               "name": "C. Wilfred Arnold",
               "profile_path": null,
               "id": 7388,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5377e48d0e0a26142200312e",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.800352,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 20213,
      "vote_count": 15,
      "budget": 0,
      "overview": "A fisherman and a rising lawyer who grew up as brothers fall in love with the same woman.",
      "similar": [
         339397,
         59,
         167073,
         50725,
         9611,
         1902,
         95610,
         11472,
         18148,
         49022,
         16642,
         631,
         13018,
         1628,
         74997,
         44564,
         3059,
         25431,
         32868,
         1405
      ],
      "original_title": "The Manxman",
      "runtime": 100,
      "poster_path": "/6cpyL7msoojckIUmGPXkj7PPWJe.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1929-01-21",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Hall Caine",
         "Eliot Stannard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0020142/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MjE2MjEzMF5BMl5BanBnXkFtZTcwNzk5OTY1NQ@@._V1._CR33,48,291,391_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Anny Ondra, Carl Brisson, Malcolm Keen | See full cast and crew »"],
      "reviews": [
         "This beautiful film is Alfred Hitchcock's last silent creation. Truly wonderful, this is a bit of a thought piece as the characters struggle with the moral dilemmas inherent in the plot. Should one stay loyal to a friend's trust or choose personal happiness at the expense of another's? Is status and appearance worth the sacrifice? Can love be forced or forgotten? This is a film that leaves you twisted and thoughtful. The actors, particularly Carl Brisson and Anny Ondra, are all wonderfully expressive. Words aren't needed to know what they are saying and what they are feeling. Miss Ondra was ethereally beautiful and heartbreakingly convincing as Kate. Very highly recommend for all true Hitchcock fans and a must for the connoisseur of the silent genre.",
         "This film is one of the finest examples of how refined a medium silent cinema actually was. There is nothing clumsy or primitive in this one, the complicated, almost \"soapy\" story is told extremely fluently in images alone (with the help of the odd caption). Granted it does not exhibit the same sort of liberated camera movements than Sunrise or The Crowd, but nevertheless The Manxman has sustained a degree of freshness totally missing from most of the early talkies.",
         "Hitchcock's final silent film is another drama focusing on a love triangle \u0096 his primary plot basis in these early days before he became the master of suspense. In many ways The Manxman can be seen as something of a loose remake of The Ring (1928), following a similar story of a love triangle between a man, his wife and his best friend, with similar characters and circumstances and the same lead man in Carl Brisson. However while that earlier boxing drama eventually pulled its punch (excuse the pun), The Manxman is a far harsher affair, with a ruthless disregard for its characters' fates that prefigures film noir. As was Hitchcock's style from his earliest works, his aim here as a director is to place the audience inside the scenario, no matter how uncomfortable it makes them. The film is almost entirely composed of point-of-view shots, and an unusually large number of them in which an actor looks straight into the camera. Time and time again Carl Brisson's big innocent face stares out at us, as if implicating us in the guilt of the other two leads. This also happens to be one of a small number of Hitchcock pictures which is very beautiful to look at. There are plenty of exquisite location shots and great use of natural lighting, in ironic counterpoint to the darkness of the story. While not quite the best of them, The Manxman is perhaps the most confident of Hitchcock's silent pictures. Whereas the majority of his silents relied too much upon rather obvious expressionist camera techniques, The Manxman is shot much more straightforwardly, and yet it still has a smooth, flowing style and isn't cluttered up with too many title cards. For me though, Hitchcock didn't really become an interesting director until he started making talkies.",
         "This is a lovely, lovely film set on the Isle of Man, a place unfamiliar to many. The camera swoops over the cliffs and sea to highlight the stark beauty of the landscape which is the star of the film. Don't expect the usual Hitchcock touches that were present in his later films...he developed them more fully in his very early talkies \"Murder\" and \"Blackmail\" and somewhat in his silent \"The Lodger\". The use of inter-titles is limited and works well. The cast here is good, Carl Brisson (who would later become the father-in-law of Rosalind Russell) and Anny Ondra who Hitchcock would use again in \"Blackmail\"; however, some of the plot lines are not fully developed and one rather important element is left unsaid in the story's ending. Be that as it may, if you are a fan of the Master, it's required viewing. It will fill in the history of his work and although it is atypical of his later films, it is worth the watch.",
         "For me, this movie was an education in silent cinema. It is crucial to see silent movies in a good print. The Studio Canal Manxman is not pristine but is as good as any movie that old is ever likely to be. Because I wasn't peering through scratches at jumpy, faded, fuzzy images, I could finally appreciate how good even very early cinematography was and that silent movie acting wasn't just crude gesticulating. Anny Ondra is a revelation and the movie is worth watching for her alone. However... The movie is a love triangle. Inn-keeper's daughter Kate is in love with lawyer Phil, but agrees to marry his boyhood friend Pete, who then goes abroad to seek his fortune. She learns that Pete has died and gets closer to Phil. Pete unexpectedly returns and marries Kate. They have a child. Although Pete is a good husband and father, she continues to pine after Phil. Finally she leaves her husband, but Phil will not commit himself to her. She tries to reclaim her daughter, revealing that Pete is not the father. He refuses to give up the child and in despair she tries to commit suicide. She ends up in Court, where Phil is now the presiding magistrate. His role in the affair is revealed and he resigns his office to go off with Kate and their child. Pete is left distraught. This is not a typical Hitchcock movie and he was always dismissive of it. He had no reason to be. It is a finely wrought melodrama with many effective and moving scenes and is as well made as any of his more characteristic films of the era, but it also illustrates the limitations of silent cinema as a dramatic medium. I haven't read the book on which The Manxman is based, but I suspect its whole thrust is quite different to this movie. Phil loves Kate, but feels marriage to her would damage his legal career. With Pete away he becomes increasingly infatuated with her and eventually seduces her. He ought to marry her, but is still torn between love and ambition. When he learns that Pete is alive and coming home to claim his bride, he uses loyalty to his friend as an excuse to evade his responsibility, but is still tortured to see her marrying another man. He goes away to pursue his legal career and achieves his ambition to be made 'Deemster'. When Kate leaves her husband he still prevaricates. It takes Kate's attempted suicide and his denunciation in Court to force him into the decision he should have taken years before. It is really Phil's story and his moral dilemma is at its heart. All of this can clearly be glimpsed in the movie, but doesn't drive it. For example, Phil's Aunt warns him against an imprudent marriage, but it is never clear that he is ambitious enough to heed her warning, so when he helps Pete to court Kate it is not obvious that his pain is largely self-inflicted: he actually comes across as a sad, romantic Cyrano de Bergerac figure. Later, when he steps aside in favour of Pete the duplicity of his motive can be inferred, but isn't really shown. Rather, he seems both honourable and generous. Even when Kate has left her husband, his internal conflict is not fully realised. His indecision seems almost accidental: the telephone always seems to be ringing at the wrong time. Because the movie cannot quite get to grips with Phil's story, it becomes Kate's story by default. I don't think this is simply a failure of Hitchcock or his scenarist. It is also a failure of the medium. There are many great scenes in the movie: Phil helping Pete woo the woman he secretly loves himself; Kate's unexpected reaction to news of Pete's death; Phil's misreading of the situation when Pete wants to tell him that Kate is pregnant; Pete's discovery that his wife is missing; and many more. These are the sort of scenes that silent movies did best, so it is inevitable that the movie organises itself around them. But it also means that Phil's story loses its specificity and its central role. A whole generation of movie critics bitterly regretted the passing of the silent cinema and its 'universal language', but I think they misread the situation. By the early Twenties, movie-makers were becoming more and more ambitious and they were soon trying to tell stories that could not be told adequately in pantomime. They wanted to make drama, but the medium was always pushing them towards melodrama. One clue to their dilemma was the tendency to overuse title cards to explain the more subtle and complex stories they were now trying to tell. For example, The Hunchback of Notre Dame has some great visual images, but is so peppered with title cards that you end up reading the movie rather than watching it. The problem for silent cinema is that people talk: that is what they do - most of the time! When The Manxman was made, silent movies had long been crying out for sound. The silent cinema had a universality that sound movies lost, but it was bought at a heavy price. Silent cinema may have been a universal language, but it was not much more than a pidgin language. Pidgin languages are useful for passing a few simple ideas across a language divide, but they cannot convey the richness of thought that natural languages can. The issue here is not that you cannot make great silent films. Clearly you can. People did! It is that most stories don't make good silent films - and those were the stories movie-makers increasingly wanted to tell. I am belatedly coming to appreciate the considerable achievements of the silent cinema, but I cannot regret its passing.",
         "Hitchcock's final silent, 'The Manxman', has two stars you'll see elsewhere in his films - Carl Brisson, from 'The Ring', and Anny Ondra, from 'Blackmail'. It's a tale of three friends, a promise, a search for riches, and forbidden love. Malcolm Keen plays the friend who finds his loyalties tested while he strives to make good in his chosen career of the law. Beautifully shot and quite modern in tone, this boasts a lovely performance from Ondra, while Brisson convinces as a fisherman who trusts too much and sees too little. At times this story seems to veer towards the tragic, but has an ending which does work. The Cornish scenery which stands in for the Isle of Man is lovely, while the Hitchcock trademarks are clearly there. Well worth a look and very enjoyable.",
         "First time of watching this simple silent, and of course I like it as I wouldn't comment on (subjective of course) crap! It's a plain tale of a love triangle set on the Isle of Man, the woman (Ondra) falls in love with the best friend (Keen) of her absent husband-to-be (Brisson). Thanks to having to get round the censorship rules, you have to pay attention about 48 minutes in (out of 82 minutes running time on my tape) although it should be fairly obvious what was going to happen. As the immortal Bard, Charlie Chaplin said in The 1942 Gold Rush \"Buzz Buzz Buzz\". As Ondra stays dressed I can only surmise that this was the angle from which Hitch got his kicks. And Anny Ondra is wondrous to behold, she was a real beauty who still looks modern all the way from '29 and worth the price of any DVD alone. She held my attention anyway, and whatever the outcome of the story would have been I would have been on her side! But what she saw in either of her lovers is beyond me I'm afraid - Brisson couldn't stop laughing and Keen looked as if he'd never smiled in his life. It's not quite up to the level of Flesh and the Devil, but there's so few British silent films extant that it's well worth a look, or even just to view Hitchcock's early efforts.",
         "Though it is a lesser Hitchcock, \"The Manxman\" has several strengths, and indeed it could have been a fine film if not for some major flaws in the story. The settings and photography are excellent, the acting is generally good, and the story's setup is believable and had possibilities. The best part of the movie is the setting on the Isle of Man, which is done very nicely, with well-chosen settings and terrific photography. The setting is woven into the story very well, and many of the scenes are given backgrounds and props which re-emphasize the distinctive setting and/or give useful symbolism to the events in the plot. Fishing boats, an old water mill, and the island's rocky beauty are all used effectively. The characters are presented well, and you quickly get to know them and sympathize with them. The first part of the story moves quickly, and efficiently establishes the love-triangle theme. The three leads (Carl Brisson, Anny Ondra, and Malcolm Keen) are all quite good in this part. Unfortunately, the rest of the story is rather a disappointment, moving very slowly at times, and often painful to watch because of some notable flaws in the ways the characters act. All this really detracts from the continuing good direction and camera work. There is a very nicely conceived jump cut at one point that could have been very powerful if the story were better, and the climactic sequence does hold some real irony and suspense, but it just doesn't have the impact that it could have had. Hitchcock does his best with things, but it's too bad that he did not have a freer hand with the material, which was apparently based on a novel that for whatever reason had acquired a certain popularity at the time. Ultimately, this movie is just average. But there are still some strengths here, and it is probably worth a look for silent film fans who especially appreciate good black-and-white photography, or for devoted Hitchcock fans who will appreciate the touches he added to an otherwise unsatisfying story.",
         "Though immortalised for his thrillers, Alfred Hitchcock always wanted to try his hand at other genres, especially in his earlier British films. This film and 'Jamaica Inn' are two cases in point. Above all what he wanted to do was to engage the audience with the emotions of the characters, and this he successfully achieves with what is essentially soap opera material with his usual technical mastery - such as the stern father seen from the fiancée's perspective through the glass of a window, or the girl's diary where she turns the pages and finds her true love's name gradually dominating her life. The locations are also uncommonly rich and beautiful for a Hitchcock film - more so than 'North by Northwest' or 'Vertigo' - with Cornwall very atmospherically standing in for the Isle of Man! It was Hitch's last *total* silent ('Blackmail' came out in both sound & silent versions),and showcases the first Hitchcock blonde of sorts, pretty little Anny Ondra, whose career was sadly numbered once talkies came along - in 'Blackmail', her Swedish-accented voice was dubbed by Joan Barry. Knowing it's Hitch, you expect a big action finale or an attempted murder of some kind, but it never happens. In terms of style I actually find Anthony Asquith's similar 'A Cottage on Dartmoor' much more exciting. But viewers should wash preconceived notions aside, and just enjoy the film for what it is.",
         "I was pleased with this. I'm a great fan of Hitchcock, but I've not seen many of the early films. This one did not disappoint. It is the sad eternal triangle. It's a time when a man's oath to his best friend supersedes all, even if it means giving up the woman he truly loves. The young lady in question is of the lower classes and beautiful. It would be normal for her to marry the laughing sailor. The lawyer is actually above her station. When news comes that he betrothed has died, it would be natural for her to marry the lawyer. However, he is fraught with contradictions. His father was a failure and he is in line for a judgeship. He gets her pregnant but won't fess up. The sailor returns from the sea. News of his death was incorrect. So now we have the problem. She loves the lawyer. She doesn't love the sailor. But she has given her word to wait. Instead of being honorable, the lawyer wants it both ways. it has a pretty harsh ending which I won't spoil. I thought for a film of 1929 this was pretty good"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "Despite their differing backgrounds, fisherman Pete and lawyer Philip have been life long friends on the Isle of Man. Pete wants to marry Kate, the landlord's daughter at the local inn, however Kate's father doesn't think he is good enough. Pete leaves the island to seek his fortune abroad and entrusts Kate to Philip, but they start to be attracted to each other.",
         "Poor fisherman Pete falls in love with Kate, the daughter of a landlord on Man island. Pete decides to leave on his ship to earn some money and then to marry the girl. Before leaving, Pete asks his friend Philip to take care of Kate, but the young man is in love with her too. There comes the tragic news: Pete's ship is wrecked. Philip and Kate have to hide no more and they plan to marry; however, Pete is not dead.",
         "A fisherman and a rising young lawyer, who grew up as brothers, fall in love with the same girl."
      ],
      "budget": 0
   },
   "movielensId": 2220,
   "movielens": {
      "languages": [""],
      "releaseDate": "1929-01-21",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Alfred Hitchcock"],
      "runtime": 100,
      "movieId": 2220,
      "title": "The Manxman",
      "mpaa": "",
      "actors": [
         "Carl Brisson",
         "Malcolm Keen",
         "Anny Ondra",
         "Randle Ayrton",
         "Clare Greet",
         "Kim Peacock",
         "Nellie Richards",
         "Wilfred Shine",
         "Harry Terry"
      ],
      "imdbMovieId": "0020142",
      "originalTitle": "The Manxman",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A fisherman and a rising lawyer who grew up as brothers fall in love with the same woman.",
      "tmdbMovieId": 20213,
      "avgRating": 2.8,
      "releaseYear": "1929",
      "numRatings": 35,
      "posterPath": "/6cpyL7msoojckIUmGPXkj7PPWJe.jpg"
   }
}