{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "scotland yard",
            "id": 770
         },
         {
            "name": "blackmail",
            "id": 1936
         },
         {
            "name": "knife",
            "id": 4728
         },
         {
            "name": "gloves",
            "id": 44449
         }
      ],
      "imdb_id": "tt0019702",
      "video": false,
      "title": "Blackmail",
      "recommendations": [
         2760,
         2762,
         1405,
         8208,
         35832,
         163230,
         36055,
         36054,
         899,
         95134,
         2761,
         3060,
         12684,
         31995,
         15007,
         93313,
         24197,
         36049,
         52782,
         25670
      ],
      "backdrop_path": "/r5KLSgU3bK34Yw71cFiDxg7XPPS.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Alice White",
               "gender": 1,
               "credit_id": "52fe424fc3a36847f80144f5",
               "name": "Anny Ondra",
               "profile_path": "/2QsxUTTexDPhCluiZcOtVRl7juB.jpg",
               "id": 7380,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Mrs. White",
               "gender": 1,
               "credit_id": "52fe424fc3a36847f80144f9",
               "name": "Sara Allgood",
               "profile_path": "/rNTIjpZXtXurKCyTzCNbMQ5ljwR.jpg",
               "id": 7381,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Mr. White",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014505",
               "name": "Charles Paton",
               "profile_path": null,
               "id": 7382,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Detective Frank Webber",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f80144fd",
               "name": "John Longden",
               "profile_path": "/rsCoUEx2ThNIz12fBR6vPncCICk.jpg",
               "id": 7383,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Tracy",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014501",
               "name": "Donald Calthrop",
               "profile_path": "/7IpGIXC6gRz5VCdMnhSW53JliJn.jpg",
               "id": 7384,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Mr. Crewe, The Artist",
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014539",
               "name": "Cyril Ritchard",
               "profile_path": "/4hFgt3BrViXVILR6v4hWmm8JD9V.jpg",
               "id": 7393,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "The Landlady",
               "gender": 0,
               "credit_id": "53235c309251411f77004e61",
               "name": "Hannah Jones",
               "profile_path": null,
               "id": 553486,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "The Chief Inspector (sound version)",
               "gender": 0,
               "credit_id": "53235d1e9251411f8c004bcb",
               "name": "Harvey Braban",
               "profile_path": null,
               "id": 47683,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "The Detective Sergeant (as Ex-Det. Sergt. Bishop - Late C.I.D. Scotland Yard)",
               "gender": 2,
               "credit_id": "53235d639251411f7a004daf",
               "name": "Ex-Det. Sergt. Bishop",
               "profile_path": null,
               "id": 1024637,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Man on Subway (uncredited)",
               "gender": 2,
               "credit_id": "53235d809251411f85004ef2",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f80144e5",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f80144eb",
               "name": "Charles Bennett",
               "profile_path": null,
               "id": 3599,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f80144f1",
               "name": "Benn W. Levy",
               "profile_path": null,
               "id": 7379,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f801450b",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f8014511",
               "name": "Hubert Bath",
               "profile_path": null,
               "id": 3603,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014517",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f801451d",
               "name": "Emile de Ruelle",
               "profile_path": null,
               "id": 7387,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f8014523",
               "name": "C. Wilfred Arnold",
               "profile_path": null,
               "id": 7388,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f8014529",
               "name": "Harold V. King",
               "profile_path": null,
               "id": 7390,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f801452f",
               "name": "Harry Miller",
               "profile_path": null,
               "id": 7391,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f8014535",
               "name": "Dallas Bower",
               "profile_path": null,
               "id": 7392,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "52fe424fc3a36847f801453f",
               "name": "Frank Mills",
               "profile_path": "/iHfknf51T7otwyiR8IvMdRNKwjs.jpg",
               "id": 47001,
               "department": "Crew",
               "job": "Second Unit"
            },
            {
               "gender": 2,
               "credit_id": "52fe424fc3a36847f8014545",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 5.031169,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 543,
      "vote_count": 58,
      "budget": 0,
      "overview": "Alice's boyfriend Frank is a Scotland Yard detective who seems more interested in police work than in her. When she agrees to go out with another man, he attacks her and she defends herself and kills him. When the body is discovered, Frank is assigned to the case. He quickly discovers that Alice is the killer, but so has someone else, and they are threatening blackmail.",
      "similar": [
         30159,
         4771,
         320,
         10528,
         3597,
         3600,
         1645,
         9445,
         521,
         9769,
         260,
         376570,
         12149,
         910,
         19959,
         4944,
         2252,
         1586,
         1949,
         2832
      ],
      "original_title": "Blackmail",
      "runtime": 84,
      "poster_path": "/u27rAiqJ305y6a4pUnW7cACQT0h.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1929-06-30",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "See and Hear It - Our Mother Tongue As It Should Be Spoken",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 85,
      "synopsis": "A tire is spinning. A police van speeds along city streets. Inside, a Morse Code radio message containing an address is received. The van stops at a seedy building, and two plain clothes police go up some stairs. Quietly, they crack open the door of a room where a man lies atop a bed, reading a paper. A gun is on his bedside table. The man realizes he is about to be arrested and makes a move towards his gun, but the detectives move faster, and arrest him. The man is in a lineup in a patio with dozens of others. A young woman slowly passes by the men, and identifies the man, suggesting a rape charge will follow. The detectives work is finished, they ride home on a train. A fat man {Hitchcock} one seat away is being annoyed by a little boy who pulls down his hat, Scotland Yard Detective Frank Webber (John Longden) goes out for the evening with his capricious girlfriend Alice White (Anny Ondra), first going to a crowded tea house. As they jockey for a table, she misplaces one glove and Frank must go back to retrieve it. They bicker in a series of minor quarrels. Frank seems more interested in police work than in her. They talk about going to a movie, a new crime film. Frank scoffs, claiming its too unrealistic, but Alice comments: I heard they got a real criminal to direct it. Alice capriciously changes her mind back and forth driving Frank off. She has a note from another man arranging to meet in that teahouse, and she spots him and they make signs. Frank decides he has had enough, pays and leaves, but stays near the door. Alice leaves with Mr. Crewe (Cyril Ritchard), an artist. Frank sees them leaving the restaurant and follows them for a while. Alice is invited by Crewe to visit his studio, she demurs coyly but finally agrees. We learn that Alice lives with her father and mother in their tobacco shop, a short distance away. A suspicious looking man is lurking around, observing them. Crewe finds a note at the entrance. He goes behind the stairs ask the concierge Mrs. Humphries (Hannah Jones) at what time the note was left. Alice is already several steps up the stairs, so Mrs. Humphries does not see her. The camera follows Crewe and Alice as they climb multiple flights to the top floor. The artist's intentions are obvious, but Alice is unaware and innocently flirts with the artist by saying she might like to be his model, cooing with delight over his attentions. At his studio, a finished painting of a jester laughing at the viewer draws Alice's attention. Alice asks how the pallette is held, then paints a head on an empty canvas, which she playfully signs. Crewe then sketches a nude female body to go with the head. Crewe says he will paint her if she puts on a dancer's costume that is hanging on a screen. Crewe sings and plays \"Miss Up-to-Date\" on the piano while we watch Alice undress behind the screen. They have some fun and the guy tries to push too fast forward as he forces a kiss on Alice. She says she wants to go home. After she takes off the costume, he takes hold of her street clothes and flings them out of reach, and assaults her, dragging her to his bed. In silhouette we see the couple struggling wildly behind a curtain that hides the bed. A bobby patrolling outside below the apartment window while Alice screams hears nothing. To defend herself, Alice grabs a nearby knife and stabs him to death. She walks back from the bed in a daze, the knife gleaming in her hand. The jester painting appears to be looking at her, and she uses the knife to stab at the canvas. The camera swoops about to convey Alice's disorientation. Alice removes evidence of her presence in the flat. She obliterates her signature on the canvas and looks around carefully as she picks up her belongings. However, she forgets one glove behind. She sneaks noiselessly down stairs, opens the door and leaves. The mysterious man is still lurking around, watching. Alice walks aimlessly along empty streets which seem filled with reminders of the murder. In her eyes, a neon advertisement showing a cocktail shaker becomes a hand plunging a dagger. Whenever she sees an extended right hand, she thinks of Crewe's hand extending from the deathbed. Alice wanders back into her home at dawn before anyone else has risen. She takes off her murdering clothes in a kind of purging moment, lies down in the bed and pretends to sleep when her mother (Lisa Evans) brings her a cup of tea. The concierge discovers the body very early the next morning, calls police, and soon after, the murder is the talk of the neighborhood. During the family breakfast that morning, Alice listens to a customer neighbor carrying on about the killing. \"Oh, it wouldn't be so bad if the victim were bopped over the head with a brick -- that's a British way. But a knife! How could anyone use a knife?\" Alice is asked to slice the bread, and her hand trembles as she grasps the knife. The neighbor babbles on. We hear only the word \"knife\" stabbing at Alice's conscience, the rest of visitor's nonstop comments become softer and softer, but the word KNIFE stays loud. A last one is practically a scream, and the bread knife leaps out of Alice's hand. Alice's father (Charles Paton) yells \"Ere! You might've cut someone with that!\" Meantime, Frank has been assigned to the case and finds one of the gloves at the murder scene. He recognizes the glove as Alice's, so Frank uses his position to subvert the investigation by hiding it in his pocket. Assuming that Alice is the killer, he goes to visit Alice at her father's shop. Frank takes Alice aside to talk in a phone booth, making it clear it that he loves Alice and will protect her. He is clearly devastated as he confirms she indeed is the killer. At this point, petty thief Tracy (Donald Calthrop), the lurking suspicious figure who saw Alice entering and leaving the artist's flat, interrupts the two and attempts to blackmail the couple, showing he has the other glove with him. First he just asks Frank to pay for an expensive cigar. To gain time, Frank and Alice tell the family he is a very special business friend of Frank's. The blackmailer, befuddling Alice's parents, demands breakfast, and relishes it, while Frank watches in disgust. Tracy seems to be as slimy as they come, until we realize that he's dirt poor and only wants some breakfast, some pocket money and the occasional cigar. \"One's got to live, you know!\" he says. Frank predicts Tracy's blackmail will fail. His conflicted willingness to cover up for Alice receives an unexpected boost when Tracy is fingered as a suspect in Crewe's death. The concierge identifies him as being at the scene of the crime. Tracy has a police record so suspicion falls on him. Frank receives the new information and sneers when he goes back to face Tracy with it, and announces he has called the police to make an arrest. The same police van of the early scenes rushes along the streets. To avoid arrest, Tracy jumps out, shattering a back window. The camera, as if startled by the commotion, dollies backward and we see the posse of lawmen rushing after Tracy. After being taken into custody, while being transported in a van, Tracy simply jumps out of the van at a traffic stop, and the pursuit continues on foot. He attempts to shake off the pursuers by losing them inside the vast British museum. While the museum chase is going on, Alice sits in her bedroom, meditating and reflecting on her situation. The camera cuts back and forth between Alice's meditation and the chase. Tracy is first chased in large rooms with display cases, corridors, then Tracy flees down a hanging rope while an enormous Egyptian stone face stares impassively. After being surrounded, he clambers to the top of the main dome and dies after falling through the skylight. Alice's reflections end and she resolves to go to Scotland Yard and confess. She asks to talk to the Chief Inspector (Harvey Braban) about the murder. When she is ushered in, Frank is already there. She is interrupted, first by Frank, then by a phone call, before she has her say. The Chief Inspector announces her statement would be meaningless, as the police have closed the case, and Frank escorts her out. On the way out, the torn jester's painting is being brought in, troubling Alice's conscience. She wants to talk more about the case, and reveals to Frank that she was about to be raped. Frank turns to Alice and tells her she acted in self defense. He clenches his fists and stares towards the camera as if to claim his deception has been vindicated. All seems well between Alice and the relieved Frank, as he and Alice walk away together, hand in hand, yet one senses Alice's unease behind her eyes in the final images.",
      "writers": [
         "Charles Bennett",
         "Alfred Hitchcock"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0019702/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjMxMDQzODI1M15BMl5BanBnXkFtZTgwNDgzNjYzMjE@._V1_SY317_CR15,0,214,317_AL_.jpg",
      "actors": ["Stars: Anny Ondra, John Longden, Sara Allgood | See full cast and crew »"],
      "reviews": [
         "While remembered as the first sound picture made by Alfred Hitchcock (or anyone else in Britain), there is much more to \"Blackmail\" than merely historical interest. It reveals the director's subtle creativity, with a carefully structured story that also produces some real suspense, with one of Hitchcock's best cameos and an entertaining chase sequence as bonuses. The movie has a unique feel, as Hitchcock was still using many silent film techniques at the same time that he was experimenting with sound. Not all of this works perfectly, but it does not detract from the film's many positive features. Alice White (Anny Ondra, voice dubbed by Joan Barry) goes out for the evening with her boyfriend, who is a police detective (John Longden). When they have a series of minor quarrels, Alice decides to go her own way, and meets an artist friend. The artist's intentions are obvious, but Alice is innocently unaware. When he brings her to his studio, there is soon an unpleasant confrontation that sets in motion a turbulent series of events. The story is carefully constructed not just to produce suspense but also to raise interesting questions in the viewer's mind. Alice feels a terrible sense of guilt and fear over what has happened - communicated to the viewer in a variety of creative ways - but of what is she really guilty? The behavior of the detective boyfriend is partly well-intentioned, but he certainly is not faultless. The moral ambiguity is often subtle, because it takes a back seat to the suspense, and it takes a couple of viewings to appreciate all that is going on. There is a particularly nice symmetry to the beginning and ending, pointing to the greater significance of the action in between. The opening sequence (filmed in silent movie style) shows the detective and his partner dealing with a suspect in a routine way, not caring about him as a person. In the final scenes, when the detective must help Alice make a final report on everything that has happened, he sees his job in a far different perspective. \"Blackmail\" is of the darker type of Hitchcock, like \"Notorious\" or \"Vertigo\". While clearly made in a different era, it has the same kind of depth and craftsmanship that distinguished those later, more well-known masterpieces.",
         "Considering the technical limitations confronting Hitchcock (the part-sound/part-silent format; the bulky, graceless early sound camera; a leading lady who barely spoke English, etc.), \"Blackmail\" remains one of the director's most impressive productions. The visual and sound quality is excellent, especially for a 1929 film, and already Hitchcock is using distinctive camera angles to create memorable effects. (Notice the shadowy interior of the Artist's loft, and the way Hitchcock swoops the camera about to convey Alice's disorientation after the murder.) I also love the way Hitchcock depicts the Blackmailer's flight after his climactic confrontation with Alice and the Detective. We never see the Blackmailer at all - the camera remains frozen on the face of the Detective, who reacts to what is going on. At the moment the Blackmailer shatters the window, the Detective lets out a shout, and the camera - as if startled by the commotion - dollies backward. We immediately cut to the busted window, with a posse of lawmen rushing toward it. It's a wonderful device (what other director in 1929 would have approached the scene in this way, I wonder?). The performances in \"Blackmail\" are remarkable and eccentric, in the best sense of the word. Donald Calthrop and Cyril Ritchard, playing the disheveled blackmailer and the lecherous artist, etch themselves in your memory. Anny Ondra is fine as Alice, gamely committing herself to the role, even though she was pantomiming lines. Her dazed reactions at the climax of the murder sequence are shocking. She's like a demented robot, yet the behavior rings true for me. Lastly, let me say I admire John Longden's performance most of all. His role as Frank, the detective, is in no sense that of a traditional film hero. He often bullies Alice, turns moody and childish during arguments and is willing to pin murder on an innocent (albeit not very nice) man. Longden realizes all the not very appealing attributes of Frank's behavior (how he sneers when the tables finally turn on Calthrop), but he also makes clear that he loves Alice and is trying to protect her. He is clearly devastated as he talks with Alice in the phone booth and realizes she is indeed guilty. In summary, few of Hitchcock's 1930 British films are on a par with \"Blackmail.\" The depth of its characterizations will remain unmatched until \"Rebecca\" a decade later. Reflect on how \"Blackmail\" compares - technically - with America's first sound film and you start to see the true measure of Hitchcock's genius.",
         "If a modern audience sat down to see this film, Alfred Hitchcock's first talkie, they'd squirm in their seats - at first. Unconvincing sound effects and an unmoving camera seemingly bolted to the floor don't help as we watch a prim Scotland Yard detective (John Longden) on a date with his hard to please girlfriend, Alice (Anna Ondra) But, when Alice has to defend herself against a letch who picks her up, the film becomes classic Hitchcock. Rather than use the newfound medium of sound solely to record the audio, Hitchcock uses sound in an expressionistic, experimental manner. After Alice kills the artist, common sounds becoming annoying blasts to the skull! Hitchcock ends the film with a silent (except for music) chase through the British Museum. Not only does this scene anticipate key moments in THE 39 STEPS, SABOTEUR, VERTIGO, and NORTH BY NORTHWEST, it's a companion piece. Fun viewing.",
         "\"....knife....knife...knife....(etc.)\" -this is probably the most celebrated line of dialog from early Hitchcock. In 1929, Alfred Hitchcock was halfway thru production of \"Blackmail\", a silent film, when the studio told him to remake the film at once as a talkie. He did, and it became the first films to boldly experiment with the art of talking pictures. The plot is so simple, it's almost boring: a detective and his girlfriend, Alice, argue during a dinner date and go separate ways. She goes off with an artist to his loft, where he tries to rape her. In self defense, she stabs the artist to death. A local neer-do-well (Donald Calthrop in a fine, sleazy performance!) goes to blackmail her and her cop boyfriend. The police accidently blame the blackmailer for the murder. After a chase thru the British Museum, the blackmailer falls to his death. The police close the case, and the girl and her boyfriend have to live the feelings of guilt. \"Blackmail\" abounds with the Hitchcock touch. It begins with a silent, detailed study of a typical arrest, letting us know, Scotland Yard is a fearful force not to be messed with. When Alice leaves the artist's corpse in his loft, the streets are filled with gruesome reminders of the crime. In her eyes, a neon advertisment showing a cocktail shaker becomes a hand holding a dagger, whenever anyone extends a hand in the street, it reminds her of her victim's extended dead hand, and there's the most famous scene from this film: a neighbor gabs on and on about the murder, repeating the word knife. Hitchcock had the entire gabbing reduced to a low mutter except for the oft- repeated word knife, which is made louder. The chase thru the British Museum seems to be an early rehearsal for all the other Hitchcock films where somebody is chased thru a famous landmark. \"Blackmail\" is credited as the first British talkie. It solidified for the then 30 year old Alfred Hitchcock that thrillers were his territory.",
         "Saw this for the first time the other night on Turner Classic network. The movie is really is a \"proto-Hitchcock\" style; You could catch a glimpse of the future \"Bruno\" (Robert Walker, Strangers on a Train) in the blackmailer. I suppose we can discuss character development and so on, but after all it was 1929,the first British talkie, and therefore at the beginning of a whole new concept. The scenes in the artist's bedroom were certainly risqué by American standards at the time. I understand the movie initially began as a silent film and a silent version was indeed filmed. Probably every future Hitchcock twist and turn in the plot is in there and I found it quite enjoyable.",
         "It's an art film by todays standards. But it's also classic Hitchcock. Not only does it build suspense, which for a film of this time seems hard to do through the typical camera distance and theatrical acting which this film has plenty of, but still Hitchcock does it and does it well. It begins as a silent film as we watch an arrest take place. This arrest feels out of place because it doesn't tie into the story. But it leads into an atmosphere of conviction and guilt. This is the films opening. The first dialogue scene occurs in a stylized way, by todays standards, as we follow two detectives walking, one Frank Webber, as they joke around. There are many shots where the camera sits, static, displaying a nice composition, as action happens, dialogue and story unfold. And in between these shots are shots of faces reacting, which incites more psychological participation in the viewer, a very Hitchcock device. The characters feelings, uneasiness, a general tension, become more subjective, not just something we figure we are suppose to get. We actually feel it. Actually, I was very surprised to hear Blackmail is from 1929. Sure it has many technical errors, jump cuts, sounds glitches, and lighting changes, overplayed acting, yet all this aside the story progresses very realistically and sadistically on the part of the guilty lead actress and her mate which in the end feels all very current. I figured this film was from the late 30's if not 40's. The film ends with a kind of uneasiness as we are left with two guilty characters, more so the female lead, who we can imagine will have trouble coping with her conscience. And that is the irony, because after all they are free, and convicted of nothing. But in this case free to dwell in their quiet guilt seems a very harsh punishment filled with more suffering than any jail could provide. In all, a great film to see.",
         "Hitchcock's Blackmail might have been a total train wreck in the hands of a lesser talent. Instead, it is a remarkable piece of cinematic history, and still tremendously entertaining after 78 years. The film was partly shot when Hitchcock learned that he would have access to sound equipment. His female lead was a talented German silent picture actress, whose accent was too heavy for sound, so an off-camera reader had to be used, plus a decent amount of expensive film had already been used and had to be integrated into the 'talkie' as well. All considered, the movie is probably the best example of the transition from these two cinematic paradigms that can be found. The silent portion of the film establishes John Longden's character as a hard-nosed young Scotland Yard detective. Anny Ondra plays the lovely young lady who is engaged to him,and who soon becomes the center of our attention. One night after they argue over some petty matters, they part company and Anny meets up with a male artist friend, who, unbeknownst to her, is interested in more than just pleasant conversation. Frank (Longden) spots them leaving the restaurant and follows them for a while. The artist coaxes Alice (Ondra) up to his flat, and things take a sinister turn in short order. Over the second half of the film, the plots unfolds, and the emotions and consciences of the protagonists are sorely tried. What immediately blew my mind was what a great silent director Hitchcock was. Shouldn't have been too surprising since Hitchcock has always struck me as a master cinematographer. The first 20 minutes of the film are completely silent,and there are no interruptions from distracting story boards. Nevertheless, through incredible use of lighting, camera work, and evocative acting, you understand everything that is going on clearly, and are drawn straight into the edgy atmosphere so familiar to those who appreciate the work of this great director. The acting is mostly very good. Only Longden sometimes seems to over or under-act his part, and Ondra is really wonderful all the way through. I was not surprised to learn of her lengthy and productive career both before and after this film and will now look for more of her work.It is also interesting to see how the actors adapted so readily to the new medium. Although some have said that the sound portion of this film seemed over-acted because the actors were still clinging to silent film conventions, I really can not agree. Some of the characters (Alice, for example) required very evocative, rather physical performances, and I can't imagine how she could have done better. Highly recommended for the amazing photography, exceptionally professional though very early use of sound, and the typically perfect pace.",
         "Review for the silent version - What a treat to see Hitchcock exploit the visuals and string together a neat thriller. The final chase sequence at the British Museum and the Library is one of his best. Don't let the silent movie trademark of ham acting spoil it for you because that is part of the fun.",
         "A common motif in Alfred Hitchcock's movies is the guilty woman: \"Blackmail\", \"Psycho\" and \"The Birds\" are all prime examples. In \"Blackmail\", Alice White (Anny Ondra) goes home with an artist one night and he tries to rape her. She murders him, and from then on everything reminds her of it. The jester painting appears to be looking at her (or she at it?), a billboard looks like a knife, and a woman keeps uttering the word knife. But in the end, everything blows up in Alice's face. Hitch was certainly showing his chops here. The camera angles, scenery, and other such things all combined to make what we would expect in a Hitchcock movie. I try to imagine being a moviegoer in 1929 watching \"Blackmail\" for the first time, wondering what Hitchcock's subsequent work would be like.",
         "The most recent previous reviewer, Robert_Maxwell wrote: \"Any conclusion is left hanging, and I didn't get the impression this was intentional ambiguity.\" I agree with the first part of this remark, but must disagree entirely with the main point. The ambiguity is indeed intentional. Although the heroine is now seemingly free of any legal charge of murder, we know that she is certain to marry her detective boyfriend, who knows of her culpability in the death of the rapist. She will thus be living in a state of perpetual 'blackmail,' married to the one man who can expose her secret at his leisure. Not a very pleasant thought - and this is not a very pleasant film. The whole story, after all, hinges on an implicit assumption - if she had not killed the rapist, and had the rape become known, the society in which she lives would have held her accountable for the rape - the crime for which the victim, rather than the perpetrator, was considered guilty (and still is, unfortunately, in many regions). This is, of course, the real reason she covers up the killing, since (she has good reason to believe) the authorities would not recognize a claim of self-defense against rape, and she would be held doubly responsible - for 'enticing' the man, then killing him for acting out his 'understandable' sexual urges that she 'aroused.' So she remains in a state of unredeemable guilt - guilty of murder, guilty of having been the victim of rape, guilty of having been too beautiful, guilty of loving a man who could at any time betray her - indeed, guilty of being innocent. Guilty, in short - of being a woman. While Hitchcock's film-making savvy is everywhere in evidence, and the pace is fairly swift, this is one of the master's heaviest, darkest, most depressing films. A good film, necessary to see at least once, but very troubling nonetheless."
      ],
      "genres": [
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "Alice White is the daughter of a shopkeeper in 1920's London. Her boyfriend, Frank Webber is a Scotland Yard detective who seems more interested in police work than in her. Frank takes Alice out one night, but she has secretly arranged to meet another man. Later that night Alice agrees to go back to his flat to see his studio. The man has other ideas and as he tries to rape Alice, she defends herself and kills him with a bread knife. When the body is discovered, Frank is assigned to the case, he quickly determines that Alice is the killer, but so has someone else and blackmail is threatened.",
         "Alice White, the daughter of a tobacconist, has been dating Frank Webber, a young up and coming detective at Scotland Yard. After successfully ditching Frank one evening on a date, Alice instead meets up with a young male artist who she really wanted to be with that evening. After going up to the artist's studio apartment, he tried to rape her. She ended up stabbing him to death in self defense, after which she tried to wipe out any evidence of being in his apartment, followed by sneaking out of the apartment and wandering the streets in a shocked daze over what she did. Frank ends up being one of the detectives assigned to the case, he who sees evidence only known to him of Alice having been in the artist's apartment, and recognizing the dead man as the person Alice sneaked off with after she ditched him the night before. Frank decides to hide the evidence he knows to implicate Alice from his fellow detectives but confront Alice with it to see what she says. But before she answers, an unsavory type named Tracy implies that he knows what happens and blackmails the pair in return for his silence. Eventually, Frank learns that Tracy is a wanted criminal. So Frank comes up with an idea of pinning the murder on Tracy. The questions become whether such a move will actually work, and if so whether Alice's conscience will allow an innocent man, however unsavory, be charged with a crime he didn't commit.",
         "Alice White, detective Frank Webber's girlfriend, is invited by an artist to visit his studio. The man tries to rape Alice and she kills him with a knife to defend herself. A criminal sees the murder and he keeps the lady's glove from the crime scene in order to blackmail her. Frank is assigned to the murder case."
      ],
      "budget": 0
   },
   "movielensId": 2221,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1929-06-30",
      "dvdReleaseDate": "1999-07-20",
      "directors": ["Alfred Hitchcock"],
      "runtime": 84,
      "movieId": 2221,
      "title": "Blackmail",
      "mpaa": "",
      "actors": [
         "Anny Ondra",
         "Sara Allgood",
         "Charles Paton",
         "John Longden",
         "Donald Calthrop",
         "Cyril Ritchard",
         "Hannah Jones",
         "Harvey Braban",
         "Ex-Det. Sergt. Bishop",
         "Alfred Hitchcock"
      ],
      "imdbMovieId": "0019702",
      "originalTitle": "Blackmail",
      "genres": [
         "Drama",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Alice's boyfriend Frank is a Scotland Yard detective who seems more interested in police work than in her. When she agrees to go out with another man, he attacks her and she defends herself and kills him. When the body is discovered, Frank is assigned to the case. He quickly discovers that Alice is the killer, but so has someone else, and they are threatening blackmail.",
      "tmdbMovieId": 543,
      "avgRating": 3.47248,
      "releaseYear": "1929",
      "numRatings": 218,
      "posterPath": "/u27rAiqJ305y6a4pUnW7cACQT0h.jpg"
   }
}