{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "riches",
         "id": 12203
      }],
      "imdb_id": "tt0018756",
      "video": false,
      "title": "Champagne",
      "recommendations": [
         36055,
         20213,
         36049,
         35832,
         47695,
         52782,
         36056,
         31995,
         15007,
         64398,
         33390,
         52748
      ],
      "backdrop_path": "/vBBbKVyw66ITZT271qS9GnOwIhw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Betty",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e645",
               "name": "Betty Balfour",
               "profile_path": "/ySuWYFHZ4p9YZPBYXfDWMxeqJwz.jpg",
               "id": 115154,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e649",
               "name": "Gordon Harker",
               "profile_path": "/ywuVcZk1QmIyvx70rJ0joNLK5Er.jpg",
               "id": 114808,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "The Boy",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e64d",
               "name": "Jean Bradin",
               "profile_path": null,
               "id": 322397,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "The Man",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e651",
               "name": "Ferdinand von Alten",
               "profile_path": null,
               "id": 35423,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e655",
               "name": "Fanny Wright",
               "profile_path": null,
               "id": 577691,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "5919b6b192514105da050993",
               "name": "Alexander D'Arcy",
               "profile_path": "/7f1EopCDNIiEbAO4gectFke9Vkz.jpg",
               "id": 77159,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e641",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e65b",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e661",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e66d",
               "name": "Walter C. Mycroft",
               "profile_path": null,
               "id": 108624,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "5377e49e0e0a2614250030a9",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.066307,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 36054,
      "vote_count": 15,
      "budget": 0,
      "overview": "Betty, rebellious daughter of a millionaire, decides to marry the pennyless Jean, against her father's will. She runs away to France and she starts living a life of luxury on the profits from her father's business. The rich man decides to put a stop to her behavior pretending his business crashed. Betty now has to find money by herself and she gets a job in a night club.",
      "similar": [
         24152,
         53287
      ],
      "original_title": "Champagne",
      "runtime": 93,
      "poster_path": "/uQ4J0umdET3WHPHd6VsDpIoddnx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1928-08-19",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 86,
      "synopsis": "'Father'( Gordon Harker), a rich American businessman, reads angrily news about his daughter 'Girl' (Betty: Betty Balfour) taking his plane to meet her lover 'Boy' on an ocean liner. The plane lands in the sea and is salvaged by a lifeboat. Betty goes aboard. Besides 'Boy' (who easily gets sea-sick - Jean Bradin), there's also a mysterious mustached 'Man' ( Ferdinand von Alten) she frequently runs into. As 'Boy' and Betty develop some quarrel, she goes to Paris without him and enters a luxurious life with fashion-shopping, cocktail-mixing, and partying. The party (where 'Boy' and 'Man' both appear) is over when her father arrives and tells her that his fortune was lost on Wall Street. Betty offers to sell her jewellery, but on the way it is stolen from her bag. Betty and her father move into a cheap room. Betty starts to learn cooking and baking, not with much success, as well as making beds. 'Boy' visits them in the room and, appalled by the poverty, offers to find a better place for Betty. She insists that she would never leave her father back, and there's such a thing as pride. She decides to search a job, and finds an ad where models for toothpaste advertising are wanted. At the model agency, she says she came because of \"Teeth!\", but is told they are only interested in legs (amply demonstrated), and refer her to a cabaret. There she is hired as flower girl (to present flowers to gentlemen in evening dress), and later meets both the 'Man' and the 'Boy'. The 'Boy' is terrified by her situation and goes to call the father. When both return, Betty quarrels with them and leaves, remembering a note that the 'Man' gave to her in which he promised to be a friend in need. At the 'Man's place, he is surprised and tells her that he is going back to America the next morning. Betty implores him to take her home. They go by train to Cherbourg (presumably), while the 'Boy' chases them in an open car. On the ship, the 'Man' locks Betty in their cabin. She arms herself with a metal towel-hanger, and when the door opens, beats the 'Boy' on his head. Enter the 'Man', shortly followed by the father. After some short wrestling between 'Boy' and 'Man', they are separated and informed that the father sent the 'Man' to keep an eye on Betty. The father agrees to the marriage, and the man looks through his champagne glass as Betty and the 'Boy' start quarreling about the modalities...",
      "writers": [
         "Alfred Hitchcock",
         "Walter C. Mycroft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0018756/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjI4MDcwMTc5OF5BMl5BanBnXkFtZTgwMDQ3NTIwMjE@._V1_SY317_CR14,0,214,317_AL_.jpg",
      "actors": ["Stars: Betty Balfour, Jean Bradin, Ferdinand von Alten | See full cast and crew »"],
      "reviews": [
         "One of Alfred Hitchcock's silent-film comedies, \"Champagne\" is good light, bubbly entertainment, much as the title might suggest. It is very interesting to see the future Master of Suspense at work with such different material, and it's a good little film in its own right. The story-line is very simple: a spoiled rich girl defies her powerful father to meet her boyfriend, and her father, convinced that the boyfriend is only a fortune hunter, resorts to a variety of tactics to try to break off the relationship. Meanwhile, everywhere the girl goes, the same mysterious stranger seems to pop up. It's not much of a plot, but Hitchcock does some nice things with it. The visuals make the movie fun to watch - attractive sets, good sight gags, interesting detail. As the rich daughter, Betty Balfour is charming and is especially good in a couple of scenes where her character has to perform some unfamiliar tasks. Gordon Harker is, as always, quite funny as the father. His timing works nicely with Hitchcock's pacing. Hitchcock's dry British wit made most of his silent comedies very pleasurable to watch. If you admire Hitchcock, or if you enjoy silent films, treat yourself to some \"Champagne\".",
         "For those of you used to Hitchcock mysteries, whodunits and what nots, this VERY early work will come as a big surprise. But it's not surprise that this is quite the feast for the eyes, and quite amazing to watch for it's technical details. The plot is simple, but yet detailed. A rich socialite daughter elopes with the man she wants to marry (with quite an amazing entrance with the female character), they flee to Paris, where she finds out her rich daddy is rich no more, and suddenly, she must face the glamourous 1920's world from a very different perspective.. Hitchcock fills the screen with a lot of details in this one, and one quite marvels at all the amazing camerawork going on. The special effects and finally the COSTUMES (!) are quite incredible as well. A cool movie!",
         "Silent. Black & white. Hitch said it was his worst movie. But still... I watched \"Champagne\" three times in four days now, and can't get tired of it. Of course it's almost 80 years old, and far away from the world of 2007. But it made me curious. Betty Balfour is just such a cutie in her very various acts. (Reminds me somehow of German chancelloress Angela Merkel, but never mind.) Although it's mostly a comedic romance, there are indications of Hitch things to come - in the cabaret, staircase scenes, and a 360 degree shot that I before thought was pioneered in Frankenheimer's \"Manchurian Candidate\" (1962). Betty was extremely charming and versatile here (I'd love to see some Squibs, her most famous movies...), but after the introduction of talkies she was more Rain than Singing. Anyway, this snapshot conserves special moments (the dress-changing, the rolling of the dough, the chair dance, ...) Highly recommended if you go for museum pieces (and \"read lips\" instead of waiting for inter-titles). Not everybody's taste, but surely mine :^)",
         "This is another mundane Hitchcock silent film, difficult to believe that he actually directed it. There is not a whole lot to this film except a lesson learned and, much like champagne itself, the characters are bubbly and provide a tickle or two. This might be as close as the fabled director would come to romantic comedy. Wall street champagne magnet Gordon Harker, a Hitch silent veteran, wants to teach his spoiled rich daughter Betty Balfour the age-old lesson that money does not grow on trees. She's completely out of control spending daddy's money with her lover (Jean Bradin) when Daddy Warbucks lowers the boom by telling her the champagne business is kaput. Some of the usual Hitch camera tricks keeps the plot interesting as the story moves from an ocean liner to Paris and back to the liner. It is fascinating to watch the photography and camera placements because at least one (the view through the bottom of a glass) would be reused by Hitchcock later in his career. Balfour is fine as the ditsy girl and she does show versatility going through a gamut of emotions. Harker, who would continue his career in talkies, is demonstrative to the nth degree and is this close to overacting. Ironically, this film shows a Wall Street millionaire looking at the stock market tables constantly in 1928, and the great stock market crash does happen for real the next year. If for nothing else than the twisty ending, this film does bear watching. That is, if you are not expecting a suspenseful Hitchcockian thriller. There are a few laughs, but the earth does not move, and we are left with a glimpse of a slice of life from 80 years ago.",
         "There's not much to this film of Hitch's, a bit like champagne itself but not so mirth-inducing. Maybe you already know it but he went on make better films than this \u0096 many of 'em in fact, but notwithstanding that I still find this one an enjoyable watch. Spoilt little rich girl Betty Balfour is taught a salutary if convoluted lesson by her Wall Street father ably played by Gordon Harker on how to behave as befits the daughter of a millionaire. In this exercise he sorts out the problem of the genuineness of Betty's suitor too. Some of the sets were as flimsy as the plot (almost diaphanous!) but would have made do for the audience that would only see it the once, and some of the photography and ideas were excellent with some, like the view through the bottom of the glass re-used by Hitch years later. Gurning through a wide range of emotions Betty Balfour kept on Bouncing Back in the same manner as Squibs, her famous role, whilst Gordon Harker excelled at playing this type of role before he started parodying himself in the '30's and playing up his down to Earth voice and mannerisms. And even Claude Hulbert made a 3 second appearance on the club stairs in one of his first film roles. If nothing else, it's worth a watch for the sinister Hitchcockian twist at the very end. All told, not a great but an interesting film with a pleasant atmosphere, but because there's so few extant it's definitely a satisfying British silent film.",
         "Hitchcock was one of cinema's most aggressively experimental film makers, a fact largely unnoticed because, first, he worked largely in known genres rather than straight drama, and also because many of his experiments worked so well, they were adopted everywhere as conventions of film making. But when his experiments fail, they scream out for attention. Champagne is one of the latter, pretty much a failure in terms of everything but the camera work. The main story is the the main problem. There's nothing about the characters' little problem here - and it's a very little problem when you think about it - that would lead us to grow concerned about their resolution to it. That gives us an unfortunate opportunity to ask whether we actually find the characters appealing - and we don't. The father is vile, his friend is vile, the lover is an airhead, the daughter is an airhead. So we're left with more than an hour of vile airheads trying to determine what virtue among the wealthy might be. As if they could possibly know. Strong, intelligent women do not make much of an appearance in Hitchcock's silent films; the young Hitchcock had an ambiguous attitude towards women, whom he frequently presented as both victims of male cruelty and simpering imbeciles. That's very much in evidence here. And Hitchcock struggled artistically with what may have been a real personality problem his whole life - the one word that can link all of his films is 'paranoia.' No one can be fully trusted in a Hitchcock film, making his world a treacherous place, even in his 'comedies' - the real \"Trouble with Harry\" (in that film) is not that he's dead, but that nobody gives a dam' that he is. This paranoia informs this supposed comedy throughout, as well, and in fact defines its experimental nature - Hitchcock repeatedly paints his characters with ominous shadings, setting up scenes of potential violence, potential madness, potential rape; fortunately none of which ever happens - but we're supposed to laugh at this?! My sense is that this was the question Hitchcock wanted to raise, that's the experiment going on here. But nobody really wants that question raised, answering it doesn't give us a very good time. Lesser Hitchcock, to be sure.",
         "The recent BFI restoration of the Hitchcock silents brought to light the unhappy truth that the negative of \"Champagne\" held in the National Archive -- which on research proved to be the ultimate source of every other surviving print around the world -- is explicitly labelled as the studio's 'second negative', in other words a substandard back-up copy assembled from the shots that weren't quite good enough for the distribution print. The digitally restored version looks good, and some improvements have been made where shots were obviously spliced out of sequence, but since we now know that there are specific problems in this negative with poor editing/pacing (e.g. shots being held a little too long) and the use of reaction shots that didn't originally make the grade, it's hard to be sure how many of the film's issues are due to this fact and how many to an actually weak storyline. Given that the major problems are the complaint that the film seems to drag and that characters' reactions just don't seem to make sense, I'm afraid that \"Champagne\" as originally released may well have been substantially superior to the only version that we will ever be able to see :-( This was apparently a case of a film where the title and star were decided upon in advance, and then a scenario had to be constructed around them! Hitchcock's original plan was for a rags-to-riches-to rags plot (as opposed to the riches-to-rags-to-riches version ultimately used) in which a girl working at a rural champagne plant would go up to Paris and see for herself how the drink fuelled dissipated night-life, only to return disgusted to her poor but honest job. However, it was felt that the great British public would much prefer to see glamour celebrated on the screen rather than have their illusions popped -- cinema was an escapist medium for those whose life was hard -- and so a completely different scenario was developed. (It is interesting to wonder, however, how much of the cabaret sequence derives from this original concept.) Like most of Hitchcock's early films, this is not a typical \"Hitchcock\" production -- the director was expected to do his job as paid by the studio rather than provide his own material -- and is of interest to those who enjoy films of the era rather than to those who are looking for traces of \"The Master of Suspense\". Betty Balfour is the quintessential Twenties Girl here: wilful and bubbly with a Cupid's-bow pout, cropped curls and the ambition to dictate her own life rather than acquiesce to the plans of the male half of the population. The plot is thin and in places rather contrived, but as this is by no means rare in comedies of the period (or later ones...) I think the problem is with the handling of the material rather than with the storyline per se. The beginning is good (I particularly liked the description of the young man as a 'cake-hound'. a wonderfully period insult), and the wordless comedy of sea-sickness is very well handled without being merely crude: I love the way the Boy veers between outraged determination to confront his supposed rival and qualms from his uncertain stomach. The concept of forcing the spoilt flapper to fend for herself (echoing Buster Keaton's hapless couple on board the \"Navigator\") is obviously intended as a major comedy hook for the plot, although it's not played intensively for laughs. I have to say that this is the first time I've ever seen a director actually get comic business out of the actual process of cooking (as opposed to simply miming that the rock-cakes are rock-hard) and did wonder if it reflected an impressive degree of domestication on Mr Hitchcock's (or Mr Stannard's) part! The main problem with the film is I think the cabaret sequence, and I do wonder if this is a left-over from the original scenario. Instead of developing the comedy inherent in a girl who 'makes a mess of everything she gets her hands on' (including the back of her lover's jacket...!) looking for a job, we are plunged into what turns out to be a rather confusing and portentous sequence of events, as her 'job' at the cabaret seems to get forgotten in favour of sexual innuendo: the prostitutes, the lesbians, the would-be rapist... The plot becomes muddled (not helped by what turns out to be an interpolated dream/nightmare sequence) and ends up with the girl running off to throw herself on the mercy of a man she has previously -- and soon again subsequently -- seemed to be afraid of. Considered dispassionately, much of this section seems to be a digression that neither develops the comedy nor furthers the plot mechanics (although it is probably the most 'Hitchcockian' part of the picture!) Having contorted the characters into the required situation to create the final comic set-up -- the showdown of mistaken intentions on board the returning liner -- the film concludes fairly happily with some genuine laughter through unforced farce. The acting is by and large good -- save for those moments when it is simply totally confusing! -- and the basic plot is a promising set-up for a typical light comedy of the period, complete with showy costumes for the leading lady and a hint of slapstick. The pacing is just a bit off; and, knowing what we now know, I do wonder if there is missing material -- intertitles, for instance! -- or even excess shots where alternate takes/ideas were *both* included in the compiled negative for a decision at some future point...",
         "Hitchcock liked to isolate people on trains and ships and force them to interact with whomever was in that setting. In this one, the spoiled brat daughter of tycoon lives the life of a princess on her father's money. She is wasteful and shallow and draws attention in that Paris Hilton kind of way. We know that she must have a good heart but now, anything that happens to her is deserved. Enter her father, who wants to teach her a lesson. After all, she has embarrassed him time and time again. She is going to elope with her nice young man, who finds her a bit insufferable at times. He hangs in there while she tests the limits of her entitlement. She is eventually reduced to fending for herself. Hitchcock does a decent job with this but I think there could have been a bit more to it. He got just a bit lazy here. Still, it is billed as a comedy, not \"The Scarlet Letter,\" so there is a lighter touch. It's certainly worth a peek.",
         "Champagne was among the last of Hitchcock's silents, and made at a period when Hollywood was already turning fast towards the talkies. Perhaps because of this, the young and naive Hitchcock appears to be cramming in as much visual technique as possible. Right from his first picture, Hitchcock had loved the point-of-view shot. Champagne makes heavy use of what I call \"extreme\" point-of-view shots \u0096 that is, ones which really draw your attention to the fact that we are seeing a character's-eye-view, for example where we see the actor's hands in front of us, or the camera moves as the character walks. To this end Hitchcock even had giant props built to wave in front of the lens. There are also copious other techniques which aim to literalise the experience of the characters \u0096 for example shaking the camera around when the ship is rocking. Although the later Hitchcock would sometimes use such tricks (far more subtly) to draw the audience into the character's world, here and now it's just a bit of overt stylisation that in no way enhances the film. Trickery for trickery's sake is often worse than useless. When Betty Balfour is told her father has lost his fortune, there is a superimposition of a room spinning. If Balfour is good enough, she could convey what is going on inside her character's head. I think I speak for most audience members when I say I would rather look at a good acting performance than a post-production special effect. It's a pity Hitch felt he needed to dress up his shots so much, because even at this early stage he had good timing for basic point-of-view and reaction shots, allowing him to smoothly reveal intentions and opinions. His basic film grammar is good enough to keep down the number of intertitles. By the way, the difference between a picture like this and those made around the same time in the US (which tend to be very wordy) is not that the Hollywood directors were bad at visual storytelling, it's that their pictures were often full of unnecessary title cards, whereas in Europe the goal was generally to keep them to a minimum. It's a mercy too that the acting in Champagne tends to be fairly naturalistic, the only touches of theatricality being for the sake of comedy. None of them is exceptional, but none of them is really bad either. I'm not quite convinced though by Gordon Harker as a millionaire, but perhaps this is because I'm so used to seeing him playing earthy working class types. All else I have to say about Champagne is that it is just a bit dull \u0096 a comedy drama that is not enough of one thing or the other. A reasonable plot, a handful of good gags, but ultimately lifeless. At this point Hitchcock was really just saying, through his camera, \"Look at me! I'm the director! Look what I can do!\" when he should have been turning all those audience-involving techniques into gripping entertainment - as he later would.",
         "Although the film shows plenty of evidence of being made by the Master, most viewers will probably find it light compared to the 'more substantial' 'serious' films. But Hitchcock's metier is cinema, not suspense, and Champagne contains some choice examples of how Hitch thought cinematically in a way that no other director has done. A case in point is the magnificent visual joke towards the end of the film, when our heroes are aboard an ocean liner. From time to time they are bothered by a drunk who staggers into them and other passengers. However, before long, the ship hits a storm and sways around like a cork, causing everyone to stagger from wall to wall... except the drunk... On a more profound thematic level, this is one of the earliest Hitchcockian essays on the necessity of lying in one's bed if one has made it (cf The Birds). Incidentally, it's just occurred to me how much the Betty Balfour character in this prefaces those of Grace Kelly in Rear Window and Melanie Daniels in The Birds."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "A spoilt rich girl leads a life of luxury on the profits from her father's champagne business. To bring her back down to earth he tells her that all the money has been lost so she goes to seek her fortune.",
         "Betty, rebellious daughter of a millionaire, decides to marry the pennyless Jean, against her father's will. She runs away to France and she starts living a life of luxury on the profits from her father's business. The rich man decides to put a stop to her behavior pretending his business crashed. Betty now has to find money by herself and she gets a job in a night club.",
         "A spoiled heiress defies her father by running off to marry her lover. But Daddy has a few tricks up his sleeve."
      ],
      "budget": 0
   },
   "movielensId": 2222,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1928-08-19",
      "dvdReleaseDate": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 93,
      "movieId": 2222,
      "title": "Champagne",
      "mpaa": "",
      "actors": [
         "Betty Balfour",
         "Gordon Harker",
         "Jean Bradin",
         "Ferdinand von Alten",
         "Fanny Wright",
         "Alexander D'Arcy"
      ],
      "imdbMovieId": "0018756",
      "originalTitle": "Champagne",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Betty, rebellious daughter of a millionaire, decides to marry the pennyless Jean, against her father's will. She runs away to France and she starts living a life of luxury on the profits from her father's business. The rich man decides to put a stop to her behavior pretending his business crashed. Betty now has to find money by herself and she gets a job in a night club.",
      "tmdbMovieId": 36054,
      "avgRating": 2.16667,
      "releaseYear": "1928",
      "numRatings": 24,
      "posterPath": "/uQ4J0umdET3WHPHd6VsDpIoddnx.jpg"
   }
}