{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "short",
         "id": 214549
      }],
      "imdb_id": "tt2140519",
      "video": false,
      "title": "The Farmer's Wife",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "The Auctioneer",
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7cf1",
               "name": "James Cartwright",
               "profile_path": null,
               "id": 1120400,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "The Farmer's Wife",
               "gender": 1,
               "credit_id": "52fe4b169251416c750f7cf5",
               "name": "Geraldine James",
               "profile_path": "/uRapxZIWwfcmOl2rzlz77oCC1e4.jpg",
               "id": 11855,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Denise",
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7cf9",
               "name": "Alex Kelly",
               "profile_path": null,
               "id": 976738,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Man",
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7cfd",
               "name": "Martin Preston",
               "profile_path": null,
               "id": 1120401,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7cbd",
               "name": "Jonas Grimås",
               "profile_path": null,
               "id": 107652,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7cc3",
               "name": "Lee Hickman",
               "profile_path": null,
               "id": 1120398,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b169251416c750f7cc9",
               "name": "Francis Lee",
               "profile_path": null,
               "id": 192852,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7ccf",
               "name": "Lynn roberts",
               "profile_path": null,
               "id": 1120399,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7cd5",
               "name": "John Parish",
               "profile_path": null,
               "id": 44692,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b169251416c750f7cdb",
               "name": "Gary Shaw",
               "profile_path": null,
               "id": 165708,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b169251416c750f7ce1",
               "name": "Marianne Kuopanportti",
               "profile_path": null,
               "id": 998347,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b169251416c750f7ce7",
               "name": "Francis Lee",
               "profile_path": null,
               "id": 192852,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b169251416c750f7ced",
               "name": "Francis Lee",
               "profile_path": null,
               "id": 192852,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.061657,
      "production_countries": [],
      "id": 143750,
      "vote_count": 1,
      "budget": 0,
      "overview": "As her surroundings are invaded by outsiders, THE FARMER'S WIFE stoically carries out her daily tasks in preparation for what will be her final day on her farm, the only land she has known. Unable to accept this forced future, subconscious memories return that ultimately lead her to connect more to the countryside of her youth than ever before.",
      "similar": [
         21385,
         568,
         49026,
         10530,
         19,
         37135,
         150540,
         157336,
         597,
         155,
         363676,
         74643,
         11544,
         10693,
         3933,
         10882,
         10895,
         10555,
         12092,
         38757
      ],
      "original_title": "The Farmer's Wife",
      "runtime": 18,
      "poster_path": "/ePPNVWyIKYBdsGrOrYVaPKM8DlM.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-06-20",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.thefarmerswifefilm.co.uk/",
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Eden Phillpotts",
         "Eliot Stannard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0018876/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzNzkxNDM3MV5BMl5BanBnXkFtZTcwNTk5OTY1NQ@@._V1._CR32,39,292,407_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jameson Thomas, Lillian Hall-Davis, Gordon Harker | See full cast and crew »"],
      "reviews": [
         "\"The Farmer's Wife\" is a charming rustic, semi-romantic comedy from the silent picture era. Without seeing the credits, you might never guess that it was made by the \"Master of Suspense\", Alfred Hitchcock - but if you know who the director was, it is easy to see the masterful touches Hitchcock was known for. The story is a simple one. Farmer Sweetland (Jameson Thomas) has lost his beloved wife some time ago, and comes to decide that he should marry again. He methodically evaluates, and plans to propose to, all of the eligible women he can think of. But all the while he overlooks the best, and obvious (to the audience) choice: his devoted housekeeper Araminta (Lillian Hall-Davis, who is charming in the role). \"Minta\" is far wiser, sweeter, and prettier than the other candidates, and she also cares for Sweetland in a way they never will. The plot, therefore, revolves around whether he will figure this out before he gets stuck with an unsuitable mate instead. Hitchcock applies the creativity and attention to detail that he would later use in his great suspense films, and makes out of a simple plot a movie that is very funny, and also at times quite touching. A great deal of the characters' feelings and thoughts are communicated without dialogue cards, through masterful silent camera work. The most powerful recurring image is a pair of chairs near the fireplace, where Farmer Sweetland had obviously spent many happy hours with his dear departed first wife. Early in the film, as he hosts a wedding dinner for his daughter, he begins to look longingly at the chairs, and we know what he is thinking even before the dialogue cards tell us. As the film proceeds, we occasionally come back to the fireplace, and eventually \"Minta\" begins to sit with him by the fireplace, sympathizing and helping with his disappointed matrimonial projects. The suggestion is obvious to everyone but Sweetland. In the lead role, Thomas responds to Hitchcock's direction, sometimes making his character appear somewhat ridiculous in his miscalculated plans, and at other times evoking our complete sympathy and pity for his loneliness. The rest of the cast works very well too, especially Gordon Harker, whose expert comic timing plays wonderfully in the role of Farmer Sweetland's handyman. There is one long, hilarious comic sequence, at a house party hosted by one of Sweetland's prospective mates, and you have to watch it two or three times to catch all of the detail Hitchcock packed into the sequence. The rest of the movie is filled with lighter comic touches, and concentrates on giving us a surprisingly tender look at the characters' lives. Hitchcock fans should take delight in seeing how the master used his talents in such a different genre, and any fan of romantic comedies who is willing to try a silent film should also enjoy \"The Farmer's Wife\".",
         "The first half is rather slow, but keep going - it's definitely worth it. The humour in Hitchcock's films is generally based around great character actors (e.g. Jessie Royce Landis in To Catch a Thief and North by NorthWest), and here not one of the actors disappoints. Lillian Hall Davis has a better part in the Ring (also 1928 - Gordon Harker is again very amusing in it too), but is lovely in this film. Sound would have added nothing. My 8-year old daughter was apprehensive about watching a silent film, but once things started to get going in the second half, was hooked. Hitchcock referred to it in later years as one of his \"photographed plays\", but the action occurs in several locations, so is nowhere near as constrained as many of his films (plays or not). In fact, even though the location shots are few and far between, they really give this film a non-studio feel. All of Hitchcock's films are notable for their visual storytelling (look at the initial scene-setting in Rear Window that speaks volumes without a single word being uttered), and it is interesting to see the origins of this, and the great influence of German Expressionism.",
         "I never would have guessed in a million years what a pleasant surprise \"The Farmer's wife\" turned out to be for me. I love Alfred Hitchcock and consider him one of my favorite filmmakers but I still have to admit that I'm not too impressed about all of his earliest efforts. I started to watch this charming little-known gem with a very low expectations since I knew it wasn't even a thriller and therefore not Hitch's number one genre but I certainly didn't expect it to be as funny, warm-hearted and downright irresistible as it actually was. Actors were marvelous, humor was brilliant and most important of all the story was timeless. I honestly can't remember the last time I got such a good feeling from a movie. I'll promise you if you like films of the silent era this one is definitely a gem you don't want to miss!",
         "I have both versions, long and short, of \"The Farmer's Wife\", and they are identical except for the speed at which they were recorded onto tape/DVD. I strongly recommend against the 129-minute version, as it is slower than real-life speed and drags the humor from the film. The shorter version is much funnier and more like Hitchcock, whose films weren't known for their dragginess. Jameson Thomas, who plays Samuel Sweetland, was at the time of filming a huge star in England. In 1930 he and his wife left England for Hollywood, where he played a few leads in \"B\" pictures and then settled into a continuous second lead/character groove. He's the doctor at the end of \"The Invisible Man\" who tells Henry Travers of Claude Rains' demise: \"I'm afraid the end will be rather terrible.\" He also played Mr. Semple, the twitchy false heir, in \"Mr. Deeds Goes to Town.\"",
         "This film made me (and my wife) laugh... the pathos and the humor both STILL work. The composition in the outdoor shots is excellent, and the work shows a lot of planning. (In one scene two hens scuttle across the road from left to right, as the farmer approaches a hidden intersection... he follows them to the right a few moments later. I would love to know how they got the hens to participate...) In some places the acting is a bit 'broad', but a lot is communicated by very slow pacing and a lot of subtlety -- in facial expressions, glances, and body language as well as the well-written title cards. (There could have been more of them, but the acting usually filled in well for the deficit). The title cards are written in dialect, which helps if one is familiar with the way in 'country-folk' talk in rural England. This film is worth seeing two or three times to catch the easily missed (almost subliminal) details...",
         "I saw this years ago, enjoyed but forgot about it. On retrospect it seems a very long drawn out 96 minute comedy film with a flimsy plot, even so I wonder what a 129 minute version would be like. Jameson Thomas plays thicko widower farmer who can't see beyond the end of his nose when it comes to looking to honour a woman by marrying him. It's obvious from the first reel what the story will be and the eventual conclusion, but for all that it's still well worth watching. Some of the outdoor shots are delightful, portraying the English countryside impressionistically, the indoor usually portray people in the throes of pigging themselves within slapstick routines. The farmers' handyman Gordon Harker was even stranger than his master, with make up absolutely caked on his face for some reason. Altogether, a nice little film, totally inconsequential but with some nice touches from Hitch and fluid camera movements, all helping maintain interest.",
         "Although his name will forever be linked with 'suspense' films, this 1928 silent feature from Alfred Hitchcock shows the man had considerable comic sensibilities, too. The story concerns a widowed farmer (Jameson Thomas) who decides he needs a wife...129 minutes later, he finds that the perfect woman he was after was under his nose the entire time. Thomas is great as the desperate for love farmer -- watch how he makes a list of desirable women and goes to each one individually to propose, crossing each off the list when they turn him down. It may be overlong (those who've seen the edited 97 minute version yearn for this extended one...personally I think it too long), but the wry humour and the charming characters make this a nice enough early effort from Hitch.",
         "Very funny. I never realized Hitchcock could do slapstick. Surprised to find the story and characters easy to follow and identify with even with the near lack of title cards. The best silent Hitchcock film I have seen and maybe the funniest film he ever made.",
         "What a great film and the 129 min. didn't bother me too much. I couldn't stop laughing at the handyman but it was too predictable or I would have given it a higher rating. The wedding of his daughter sparked the lonesomeness Mr. Sweetland was feeling and felt he needed a companion. The story flowed right along and the imagery was displayed to where you could almost picture yourself in the same position. Mr. Sweetland asked for Minta's help and almost hinted at the idea of asking her to marry him. Well that was not the case as he picked his selections on a piece of paper. He decided to ask each person from top to bottom of the list to marry him. As each one rejected him in their own way and Mr. Sweetland didn't take rejection lightly as his charm went out the window. He finally got to the point that he ran out of ideas and sat in his chair defeated. Well Minta sat down and gave him the perfect idea through the imagery of asking her to be his wife. Then two of the women that were asked to marry him argued about this issue and they had a competition of who he would choose to marry. He chose none and stuck with Minta. What's interesting to me was there was comedy throughout and it was genuine not like Mr. and Mrs. Smith which was more forced. Everyone was comedic in their own way and set a light overtone. Also, getting around the censors was Hitchcock's genius as Minta played with her buttons on her blouse enough to indicate she had an interest in Mr. Sweetland more than her boss and their was a sexual overtone. I never laughed as much though all 53 movies I've watched of Hitchcocks as this one. I have to say, he knew how to experiment and make things work and with genre he did just that.",
         "The Farmer's Wife is the story of a farmer who is seeking a wife. It is a slapstick comedy that at times is very funny. The farmer, Mr. Sweetland has trouble finding a wife after the death of his first. He makes a list with the help of his maid, who is secretly in love with him. He has four eligible women on his list and they all turn him down in one way or another. All of these small stories are very funny, especially the Thirza Tapper story, with a hilarious performance by Maud Gill as Tapper. Gordon Harker as Ash, the handyman is also very funny. This is a different genre for Hitchcock and he succeeds. He tried comedy later with Mr. and Mrs. Smith and did not succeed but The Farmer's Wife shows that he was a genius and a true artist. This very charming and touching romantic comedy is one of the best of its time or anytime"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "Farmer Sweetland is a lonely old widower. He is determined to marry again and he enlists the help of his housekeeper Minta to pick a wife from the local single women.",
         "Farmer Sweetland is an old and lonely widower who manages to marry again. He likes three ladies, but they all reject him, instigated by Aramintha, the farmer's maid who is secretely in love with her master. The farmer seems to start thinking love is no more his business, but he realizes that the right woman has always lived by his side. She is Aramintha herself.",
         "After his daughter weds, a middle-aged widower with a profitable farm decides to remarry but finds choosing a suitable mate a problematic process."
      ],
      "budget": 0
   },
   "movielensId": 2223,
   "movielens": {
      "languages": [""],
      "releaseDate": "1928-03-02",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Alfred Hitchcock"],
      "runtime": 98,
      "movieId": 2223,
      "title": "The Farmer's Wife",
      "mpaa": "",
      "actors": [
         "Jameson Thomas",
         "Lillian Hall-Davis",
         "Gordon Harker",
         "Gibb McLaughlin",
         "Maud Gill",
         "Louie Pounds",
         "Olga Slade",
         "Ruth Maitland",
         "Antonia Brough",
         "Haward Watts",
         "Mollie Ellis"
      ],
      "imdbMovieId": "0018876",
      "originalTitle": "The Farmer's Wife",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Successful middle-aged farmer Samuel Sweetland becomes widowed, then his daughter marries and leaves home. Deciding he wishes to remarry, Sweetland pursues some local women he considers prospects, not realizing his devoted housekeeper Minta is in love with him and would make the perfect mate.",
      "tmdbMovieId": 143750,
      "avgRating": 2.8913,
      "releaseYear": "1928",
      "numRatings": 46,
      "posterPath": "/34Nw8Ely0wKyakaeC5vNJGTkeUz.jpg"
   }
}