{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "boarding school",
            "id": 6271
         },
         {
            "name": "stage show",
            "id": 6415
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "headmaster",
            "id": 181203
         },
         {
            "name": "fall guy",
            "id": 186714
         },
         {
            "name": "expulsion",
            "id": 189438
         },
         {
            "name": "misfortune",
            "id": 209222
         },
         {
            "name": "school student",
            "id": 236482
         },
         {
            "name": "wrongly punished",
            "id": 236483
         },
         {
            "name": "dancehall",
            "id": 236484
         },
         {
            "name": "paid dance companion",
            "id": 236485
         },
         {
            "name": "stage show performer",
            "id": 236486
         }
      ],
      "imdb_id": "tt0017825",
      "video": false,
      "title": "Downhill",
      "recommendations": [
         28480,
         294543,
         52907,
         36056,
         20213,
         35832,
         86750,
         277582,
         191381,
         121703,
         27999,
         4175,
         31656,
         20362,
         277796,
         174351,
         36054,
         27507,
         53712,
         212849
      ],
      "backdrop_path": "/aGDTfr3tTwBvQ4F6Vv6vC9EcJkC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Roddy Berwick",
               "gender": 2,
               "credit_id": "52fe4842c3a36847f815e8d5",
               "name": "Ivor Novello",
               "profile_path": "/uk9HvlinIVPtQ0x5CXziCrJ3CGb.jpg",
               "id": 27915,
               "order": 0
            },
            {
               "cast_id": 16,
               "character": "Mabel",
               "gender": 1,
               "credit_id": "53c2f2b8c3a3684cdf008e78",
               "name": "Annette Benson",
               "profile_path": "/sqS9UiASEuewQrC3XhmdBSiPVA9.jpg",
               "id": 1341128,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Julia",
               "gender": 1,
               "credit_id": "52fe4842c3a36847f815e8dd",
               "name": "Isabel Jeans",
               "profile_path": "/xSFhrYx7JMUcvrJ4lgIUIIIJ9A7.jpg",
               "id": 100781,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Archie",
               "gender": 2,
               "credit_id": "52fe4842c3a36847f815e8e1",
               "name": "Ian Hunter",
               "profile_path": "/7fnMM8p9lSdRtXX0Mqg1NPJrfHL.jpg",
               "id": 8731,
               "order": 3
            },
            {
               "cast_id": 24,
               "character": "Dr. Dawson",
               "gender": 2,
               "credit_id": "5a49618e0e0a262dc80047ad",
               "name": "Ben Webster",
               "profile_path": null,
               "id": 22601,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Sir Thomas Berwick",
               "gender": 0,
               "credit_id": "52fe4842c3a36847f815e8f5",
               "name": "Norman McKinnel",
               "profile_path": null,
               "id": 1068089,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Tim Wakely",
               "gender": 0,
               "credit_id": "52fe4842c3a36847f815e8d9",
               "name": "Robin Irvine",
               "profile_path": null,
               "id": 146660,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Sybil Wakely",
               "gender": 0,
               "credit_id": "52fe4842c3a36847f815e8e9",
               "name": "Sybil Rhoda",
               "profile_path": null,
               "id": 1064081,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Lady Berwick",
               "gender": 1,
               "credit_id": "52fe4842c3a36847f815e8ed",
               "name": "Lilian Braithwaite",
               "profile_path": "/hIU380ChEN18ZYJJvSMBi28PAXu.jpg",
               "id": 1064082,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "The Poet",
               "gender": 1,
               "credit_id": "52fe4842c3a36847f815e8f1",
               "name": "Violet Farebrother",
               "profile_path": "/s3ldvLGdSxN3s0opmrMr9PvfnS6.jpg",
               "id": 553492,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4842c3a36847f815e8bf",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4842c3a36847f815e8c5",
               "name": "Ivor Novello",
               "profile_path": "/uk9HvlinIVPtQ0x5CXziCrJ3CGb.jpg",
               "id": 27915,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4842c3a36847f815e8cb",
               "name": "Constance Collier",
               "profile_path": "/zgRvb7EpW4K6lsDEkxcRBDEQUkS.jpg",
               "id": 17660,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4842c3a36847f815e8d1",
               "name": "Eliot Stannard",
               "profile_path": null,
               "id": 27905,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 2,
               "credit_id": "56d5dae09251410bd1005a44",
               "name": "Michael Balcon",
               "profile_path": "/jBxdXgRs386mJztdmYtCQznwtIi.jpg",
               "id": 3601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56d5dae89251411884003023",
               "name": "C.M. Woolf",
               "profile_path": null,
               "id": 1484336,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56d5daf09251413932003de9",
               "name": "Claude L. McDonnell",
               "profile_path": null,
               "id": 1140591,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56d5daf9925141719e001e7a",
               "name": "Lionel Rich",
               "profile_path": null,
               "id": 1473495,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56d5db009251410bd1005a4a",
               "name": "Ivor Montagu",
               "profile_path": "/ghOw5IggdsSW7y2pteCyblaTxQW.jpg",
               "id": 3602,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56d5db089251411884003026",
               "name": "Bertram Evans",
               "profile_path": null,
               "id": 27908,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56d5db45c3a3681e500162e9",
               "name": "Frank Mills",
               "profile_path": null,
               "id": 1585030,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.133815,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 52782,
      "vote_count": 15,
      "budget": 0,
      "overview": "After public school student Roddy Berwick takes the blame for a friend's transgression and is expelled, his life goes downhill.",
      "similar": [
         234567,
         5698,
         44494,
         17700,
         31135,
         25126,
         38580,
         50081,
         23282,
         49275,
         58159,
         90056,
         16464,
         67703,
         194079,
         195124,
         78394,
         109325,
         94967,
         41571
      ],
      "original_title": "Downhill",
      "runtime": 110,
      "poster_path": "/p3ZTJIjcl1jBzlXfrmQXFbjvtCy.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "Gainsborough Pictures",
         "id": 1221,
         "origin_country": ""
      }],
      "release_date": "1927-10-24",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Constance Collier",
         "Ivor Novello"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0017825/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0OTI5NzQyM15BMl5BanBnXkFtZTgwNzExNzA1MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ivor Novello, Ben Webster, Norman McKinnel | See full cast and crew »"],
      "reviews": [
         "The story, of course, is not acceptable now. It's based on a play written by two performers who were major stage figures in their time but are now principally remembered for a few film roles (Novello in Hitchcock's THE LODGER, Collier as the has-been actress teaching acting to young girls in LaCava's STAGE DOOR). The story tells of the long, melodramatic, total downfall and degeneration of a son of wealth with a seemingly bright future, the hero of the rugby field, who is disgraced when he takes the rap for his impoverished roommate at his British school. Modern audiences tend to find this sort of melodrama, no matter how well done, a bit ridiculous. The anguished query of young Novello when he's told that he's expelled, \"Does this mean, sir, that I won't be able to play rugby for the Old Boys?\" is justly famous for its fatuousness. But the film itself is not fatuous, or ridiculous in the slightest. It shows Hitchcock to be one of the greatest of all the masters of the silent cinema, using an array of sophisticated film techniques to build a narrative complexity that goes far beyond the melodramatic plot. The pictorial quality of the film is lush and dense and the photography is sophisticated. For one thing, he uses very few titles. Of course, he was not alone in trying to keep silent-film intertitles to a minimum. But directors like Murnau tended to tell simple \"timeless\" stories with very formal pictography, the story told through a series of strong, simple, iconic images, the characters hardly speaking. Hitchcock has preserved verisimilitude by having his characters talk as much as they want. If what they're saying isn't important, such as the small talk among the rugby spectators at the beginning, why show it in titles? The casual milieu is established more clearly, in fact, if one doesn't know exactly what's being said. Hitchcock's use of this technique is even more evident in THE FARMER'S WIFE (also adapted from a play), where the characters talk and talk, but rarely is there a title. We talk constantly in real life, and one of the things that makes some silents seem stilted is the refusal to have the characters say anything unless what they say is shown in a title. Even when characters reveal their inner feelings to each other, the words they speak are often not the best communicators. Hitchcock shows relationships through subtle facial expressions, body posture, and observant human movements, through editing, little close-ups or vignettes of action, and placement of camera. All sorts of naturalistic bits of business are used to make the story clear and dramatically interesting. These techniques convey subtle relationships even more strongly when titles are not there to \"explain\" the content in words to the viewer, undercutting the images. Amid symbolic images of his \"descent,\" such as traveling down London's endless escalators to the underground trains, and riding down in an elevator, the story of Novello's decline is laid out in melodramatic detail. A few incidents, and Hitchcock's handling of them, are described below. The film opens on the day of a big rugby game, and the visiting families dine with the students in the school's great dining hall. At one point, the sister of Novello's poor roommate steps into a stairwell and sees two small boys fighting on the stair. Then a door opens, and she glimpses Novello toweling up after a shower. Nothing comes of either of these incidents (she doesn't see Novello again); they are just original, well staged, atmospheric moments. Having attended a British boarding school for a year in the fifties, I can attest that these are particularly telling touches. Long, aimless, vicious fights were a hallmark of that existence, and I also remember incidents of women embarrassed at being out of place in a boys' school. The roommate gets a note from the attractive waitress to meet him at the sweet shop where she works. At the same time, she flirts with Novello. The two young men visit the girl at the sweet shop, and there's a long scene where each of them dance with her in a back room. She obviously favors Novello, and Hitchcock cuts from shots of Novello dancing with the shop-girl to the gradually disapproving stare of his companion. However, as the other fellow goes out, she points to the sign \"Closed Wednesday Afternoons,\" a typical example of visual storytelling which not only economically indicates (without titles) that she has asked him to return, but also the furtive nature of the invitation. Later, she comes to the school and accuses Novello of making her pregnant (not of theft, as the IMDB synopsis and other sources state). She accuses him, apparently, because she was mad at him for ignoring her, and because he's rich and can presumably pay off. The actress playing the shop girl (Daisy Jackson, per a photo caption in the Citadel Hitchcock book, though she isn't in any credits listing, including in that book and IMDB) is very attractive and an excellent silent film actress. After Novello is cast out of his father's house, the scene changes, with a title, \"Make Believe.\" We see Novello in a tuxedo, talking. The camera pulls back and we find him a waiter. After some action, the scene is revealed to be part of a musical; he's a stage actor now. \"Make believe\" for sure; first we think he's in high society, then a waiter, finally an actor! After falling further, we find him in France, a male taxi-dancer under the thumb of an iron-handed battle-ax. He spends an evening at the table of an older woman (Violet Farebrother) who sympathetically listens to his life story. But at the end of the evening, so late that it's now morning, a man has an attack and the windows are opened to let in fresh air. The glaring sunlight floods into the foul night-spot, and Novello looks around at the dissipated, apathetic revellers, looks at the now-much-faded \"interesting\" older woman, and realizes the horror of his surroundings. The scene exudes a profound sense of revulsion and loathing, a depth of feeling on a plane rarely found in Hitchcock. Finally, Novello is fever-stricken and delirious in a dockside dive, cared for by scruffy blacks. As they pile him on to a small steamer, his shaky passage to the ship, on the gang-plank and into the cabin is presented in striking hand-held point-of-view shots. The sophisticated narrative style, the profusion of telling details, the richness of the visuals, all made the film gripping and dramatic, despite the hoary plot and a slight over-length. Before Hitchcock found his \"niche,\" he used his talents to make quite a few unexpectedly eclectic films that showed a remarkable talent, constantly inventive and original, continually using film in creative ways. His silent films are largely ignored because they, for the most part, do not conform to the Hitchcock subject matter. But he's one of the great silent directors! He understood the medium and used it more subtly and creatively than many more famous practitioners.",
         "I watched Alfred Hitchcock's DOWNHILL (1927) starring Ivor Novello. I thought this was a fascinating film although it's not very well regarded. Novello plays a wealthy Oxford student who stupidly takes the blame after a vindictive waitress points him out (his father is rich) as her seducer. The real seducer is his friend, but he takes the blame, assuming it will all blow over. But he gets expelled and sent home where his father pitches a fit and calls him a liar. Novello storms out of the house. Cast into the cruel world, Novello must find his own way. In a brilliant sequence, following an intertitle that announces \"make believe\" we see a well dressed Novello holding a cup of coffee, but as the camera pulls back we see that he is holding a tray and serving coffee to a flashy couple (Isabel Jeans, Ian Hunter). Well at least he has a job! But then as the couple heads to the dance floor the camera pulls back again and we suddenly realize that, as the couple starts dancing, they are on a stage. The audience comes into view and a line of high-kicking dancers races out onto the stage. Jeans turns out to be a selfish woman involved with Hunter. There is never enough money. Novello becomes a hanger-on until he receives a telegram with news about an inheritance. Jeans quickly marries Novello and starts spending freely. Time passes. Jeans and Hunter are sitting in a lavish bedroom. She's endlessly sitting at dressing tables, admiring herself and her jewels. Novello comes home and find a pile of bills, an overdrawn notice from the bank, and Hunter in the closet. The apartment is in her name and he's thrown out into the cruel world. Next we find Novello as a taxi dancer in Paris. He seems to have a \"manager\" who sells his dances and possibly more. While he dances we see a middle-aged age woman (Violet Farebrother) sitting at a table. She can't take her eyes off him. She arranges for an introduction. He babbles away, telling her his sad story while her eyes frankly devour him. Amazing sequence. But as morning dawns and the blinds are raised, Novello finally see this tawdry world of drunks and dissolutes and once again goes out into the cruel world to Marseilles. Sick and broke, Novello is saved by a pair of sailors and put on a ship back to England after they find a returned letter. Do they think there will be a reward? During the voyage, Novello hallucinates and relives his past accounts with all the horrid women in his life. This is a beautifully done scene. Finally he arrives home. I cannot think of another film from this era where the male is the societal victim and who, through nobility, suffers as he descends to the depths at the hands of women. Novello is actually playing a twist on the many Ruth Chatterton roles where she follows this sort of journey to find redemption and/or death. Along with The Lodger, this may be Ivor Novello's best film performance. As for Hitchcock, there are many great scenes here and lots of symbolism as Novellos is seen on escalators and elevators going down, down, DOWN.",
         "With their theatre play Down Hill Ivor Novello and Constance Collier produced another lampoon dealing with British boarding school life and the layers of society it depends upon. Ivor Novello attended a school like that himself (Magdalen College, Oxford) and the theme of his play seems authentic in its unlikeliness. A school boy takes the blame for 'getting a girl into trouble' although a friend is to blame. He is expelled not only from school but also from his posh family home. Without his father's backing life quickly goes down hill. After a short career as a Paris gigolo he ends up in the slums of Marseille. Hitchcock filmed Down Hill with his typical mix of 'suspense' and humour throughout the film. The camera zooms into terrified faces, goes down hill on an escalator and an elevator and picks up every shadow and shade on its way. Apparently Hitch had the final scenes tinted in a horribly yellowish green when the protagonist feels ill. Apart from the almost unneeded final act Downhill is a downright Hitch. Its climax is the Paris night club scene where the young and inexperienced taxi dancer and gigolo is awaited by a horny elderly woman who has already compensated his services yet to be rendered.",
         "My copy of this movie is truly silence with no musical score. Whenever I watch a movie that is completely silent, initially I find it a little hard. But when the film is well made, as this one is, it doesn't take long to adjust and focus on the story as you are drawn into it. I feel Hitchcock was a master of the silent film genre with his ability to tell such a deep story with very few intertitles. Relying instead on the expressions of the actors and written notes and signs in the movie, without having to cut away to an intertitle, which allows the film to flow more fluidly instead of constant cutting between the live action and the title cards. Ivor Novello in the lead role of Roddy and in his prior work with Hitchcock in The Lodger really impressed me with his talent of conveying his feelings strictly through facial expressions and acting without the use of sound. Hitch is also good at using subtle exaggeration and focus on action to help take the place of the sound in his silent films. The story is that of a young man in school who is falsely accused of theft by a lady that he had danced with and he is willing to take the blame for a friend of his and is expelled from school. This leads to the downhill spiral of his life as leaves home after his father calls him a \"LIAR!\". Things get worse from there as ends up working as a gigolo in Paris, getting in fights, losing a large sum of money, and eventually hitting bottom. In this film we really begin seeing a lot of Hitchcock's visual style that he is so famous for. He has some really good use of fades and graphic matches between scenes. Two of my favorite where the fading out on the pocket watch and into a large clock, and the other being the scene where he fades out on a photograph and then back in on the real person. I really enjoyed the symbolic shot of Roddy heading down the escalator, showing us that is in heading downhill in his life. And my favorite \"Hitch\" shot in this movie was the point-of-view shot when the lady was leaning back in her chair and it cuts to Roddy walking into the room and we see him upside down on the screen. I also thought Hitchcock did a great job of portraying Roddy's seasickness towards the end of the film. I really enjoy seeing Hitchcock's style developing in his early silent films, that will become so prominent in his later, more famous movies. I also really appreciate Hitch's working in comedic scenes into his serious movies. My favorite humorous scene in this movie is the peashooter scene early in the film. Without giving too much away, I would have liked to see a more typical Hitchcock ending to this film. *** (out of 4 stars)",
         "This story is sort of like the parable of the Protigal Son with LOTS of changes--mainly, the son is a total idiot and the father actually is the one who is the judgmental jerk. It begins with a couple of college chums. One is rich and nice (in other words, a total patsy) and the other is poor and went to school on a scholarship. When the poor one does something stupid, the rich friend takes responsibility (why, we must only assume because he's an imbecile). When he's then thrown out of school, his father disowns him. Here is where it's more like the Protigal Son, as the young moron spends his new inheritance on drunken living among rich low-lifes and he proceeds to throw his life away--though, once again, we are unsure why. After all, with this inheritance he should have a lovely life even after having been thrown out of school (30000 Pounds was a HUGE sum of money in 1927). In the end, the young guy is a total physical and mental wreck when he somehow manages to struggle home. Even by the standards of the silent era, \"Downhill\" (also known as \"When Boys Leave Home\") is an incredibly old fashioned and overly moralistic sort of film--the sort you would never associate with Alfred Hitchcock. However, at this point in his career, there was no 'Hitchcock style' and he made a wide range of films--not just suspense and murder films. However, the story itself is so totally lacking that it really didn't give this fine director much with which to work. However, in his defense, at least he did an exceptional job when it came to the cinematography and the film had a wonderful artistry about it that sets it apart. In fact, it's so lovely that I still mildly recommend the film--even with the rather dumb plot.",
         "Downhill is a mostly uninspired and clichéd example of a director paying his dues and working his way up as Ivor Novello's school hero Roddy finds himself on the road to ruin when Mabel at Ye Olde Bunne Shoppe makes a 'serious charge' that she's got a bun of her own in the oven. Naturally it was Roddy's pal Tim, the vicar's son, who done the deed (you only have to look at Novello to know that he's so obviously batting for the other team that even Liza Minnelli wouldn't marry him), but he's the one whose family has the money and rather than risk his pal's scholarship takes the blame and finds himself on a downward spiral that involves working as a chorus boy in a West End show, a gigolo dancing with manly women in a Paris nightclub for 50 francs a dance before finding himself delirious among the wharf rats and white actresses in unconvincing blackface in Marseilles before a reconciliation. If that sounds suspiciously like an episode of Michael Palin and Terry Jones' Ripping Yarns, it's tempting to believe that it's because this was one of their influences \u0096 when he is expelled, Roddy even forlornly asks the headmaster \"Won't I be able to play for the Old Boys?\" (at 34, Novello might even be too old for the Old Boys even if he weren't disgraced). At times you suspect that Hitchcock is trying to subvert both the material and his star's matinée idol status (one sequence has him getting into the closet to find his wife's lover), with much of the film's exposition workmanlike. There are a couple of minor coups in the last act \u0096 a scene where unforgiving daylight is suddenly cast on the Paris club as a man has a heart attack and a delirious dream where he is taunted by the face of his unforgiving father, shot like the template for Frankenstein's monster, in almost everyone he sees \u0096 but this may well have felt horribly dated even when it came out.",
         "In \"Downhill\", Ivor Novello's character life goes all downhill after a false accusation made by a girl who ruins his life as a rich schoolboy. He lost his only friend (Robin Irvine), abandoned his family after being thrown out of school, and all that happened because a pretty girl falsely accused him of getting her pregnant (there's a whole debate over what was the accusation because the film doesn't explain it so clear), which was a shocking thing at the time considering the societies conventions of the period. In a stunning dramatic exercise, way before his suspense films Alfred Hitchcock presents in \"Downhill\" the story of a man who lost everything trying to protect others but not himself, rejected his father because the last didn't believe in him, calling of him a liar, but this man realizes that he made a big mistake but not telling the truth to anyone, living a low-life with people of inferior classes, marrying with another troubled girl and more. And everything (methaporically and literally) spins around and around over this poor guy, so it's all downhill. This was my first experience on watching a Hitchcock silent film and it was a great pleasure to see how everything about it was brilliant, important, the way he moves with his camera, edition, direction of actors, the whole package. Novello's performance as the main character living in a constant delirant state, showing a sorrow that doesn't need to be overacted or appear to be so emotional, no, he has an expressive face that says more than we can see, you can feel his desperation and sadness in simple gestures. There's some bit humored parts (the fight between Novello and his wife lover at the apartment) that calm down the almost depressive story. One of my favorite parts (and to you might sound pointless) is a transition scene that fools the viewer in a magic way. Right after Novello left home we see him working as waiter in a restaurant, attending a couple that walks away from the table and start to strangely dance followed by other people. The image opens up without cutting and we see a stage, musicians and a whole crowd watching the dancers scene, Novello and other waiters start to dance too and we are fooled because he's not a waiter, he is an actor in a musical play. It's a very humorous transition scene and way ahead of its time, very brilliant and well made. I watched the film in the Public Archive (the link is present here on IMDb) so there's a few things to complain about their version, and another one that helped me watching the film. First: the final minutes of the film are missing, very significant five minutes (gladly, I found the missing part on YouTube). Second: their version doesn't feature the musical score presented in it which leads to the thing that helped me watching it; I selected classical musics to go with the film and that was very clever of my part, because the absence of sound (in this case) made me think on other things than the film, the problems of life and things like that. But after watching \"Downhill\" hearing instrumental music made the experience even better, and it wasn't distractive as I thought it would be. So my suggestion is that if you watch the film in the Public Archive do that, listen to Tchaikovsky, Strauss or film composers scores, that will help you a lot. From the very first scene at the school with the boys playing in the park until the last similar scene at the ending, \"Downhill\" justifies only the story as being a downhill thing, because looking at its magnificence it's a memorable and upper film. One of Hitchcock's best works even though it's not a work of suspense. 10/10",
         "Alfred Hitchcock, despite all his ability, was undeniably a largely mechanical filmmaker. His approach was one of planning and manipulation rather than aesthetics or feeling. Not a bad thing in itself, so long as that cold mechanical mind could be put to the purposes of intrigue and excitement, as it would at the peak of his career. The trouble then with his earliest efforts is that they have all that technical intricacy without that much needed focus on reaching the audience as entertainment. His silent films in particular seem to lurch all over the place, and are proof that the term \"experimental film\" generally means a bad one. After all, if you know how to do it properly you don't need to experiment, do you? Downhill, unlike the films made immediately before and after, has less of the camera trickery that characterises Hitch's early work, the exceptions being a couple of mobile point of view shots in the Headmaster's office scene, and the rather extravagant finale, which believe me is nothing compared to the obtrusive bag of tricks Hitch employs in, say, Champagne (1928). Instead, the director focuses far more on the expression and gesture of the actors and the cunning arrangement of shots to reveal what is going on. Much of this is technique that Hitch appropriated from screenwriter Eliot Stannard, who actually predates Eisenstein in theories of montage, and the various inserts of reactions and concurrent bits of business \u0096 like the crosscutting from the courting couple to Ivor Novello dealing with the young customers in the shop scene \u0096 seem to fit in with the theories Stannard set out in film articles in the 1910s. A more Hitchcockian manoeuvre on display here is the beginning of scenes with close-ups, with gradual pull-back-and-reveal shots to give context. Often the opening shot, focusing on a single character or an item like a cap with the word \"honour\" on it, serves almost like a chapter heading. Gradually the shots become wider, giving more context to the scene, often finishing with a hauntingly empty wide shot \u0096 one that in another director's work might introduce a sequence. In one scene Hitchcock playfully confounds our expectations several times over, by starting with Novello in a posh outfit, pulling back to reveal he is in fact a waiter, then pulling back again to reveal the restaurant is part of a stage set. This more subtle approach by Hitchcock is very welcome, but the trouble is he seems a little over-confident in his own abilities. Downhill contains very few intertitles, but the action is not quite coherent enough to make up for them. The shop scene in particular is very confusing, and synopsis writers cannot even seem to agree whether Novello is being falsely accused of stealing or getting a woman pregnant. The latter is less obvious but makes much more sense. The focus on people and their actions is a bonus at least, and we get to see a bit more character from Ivor Novello as compared to his rather leaden personality in The Lodger, but the handsome chappy still cannot really act. And it's nothing but mugging and crazy stares from the rest of the cast, I'm afraid. But perhaps I am missing the point. The incident in the shop could be regarded as an early example of the \"MacGuffin\" \u0096 an otherwise unimportant device which serves only to drive the plot forward \u0096 and as such its details are of no consequence. And certainly, this rather trite plot of a man disowned by his family for some social misdemeanour, who descends the slippery slope until he ends up becoming a gigolo for fat French women\u0085 is certainly one which could bear a bit of style over substance. And isn't it in some ways the essence of cinema to conjure up atmosphere or visual delight, with coherence and plot detail being of secondary concern? All this is true, and yet the purpose of a motion picture is to tell a story, whether it be the ostensible one of plot, or an emotional one at a more human, character-driven level, and this is something Downhill fails to provide.",
         "A slapdash early effort by young director Alfred Hitchcock, \"Downhill\" a. k. a. \"When Boys Leave Home,\" delivers moments of brilliance undone by an underbaked plot. Young Roddy (Ivor Novello) is expelled from his boarding school when he is charged with a major infraction involving a woman at a local bake shop. No use appealing to his father, who stares at him with frightening disgust. Roddy makes his way alone in life, coming up against a pair of theatrical con artists before landing in a seedy music hall, providing dances for lonely women at 50 francs a whirl. It all gets to be too much for the frail boy. Poor Roddy can't catch a break, even in cyberspace. A lot of reviewers, both here at IMDb.com and elsewhere, have at the fellow for one deathless line he delivers when his headmaster drops the hammer: \"Can I - Won't I be able to play for the Old Boys, sir?\" It's a line dripping with ingenuousness, but actually works better in context. Roddy is a true believer in the code of his school who runs up against a world that doesn't allow for second chances. Based on an adaptation of a play Novello co-authored with Constance Collier under the pseudonym \"David L'Estrange,\" \"Downhill\" pushes the action from one setpiece to another with little explanation or character development. Hitchcock seems far more enthusiastic about his set pieces and camera tricks than giving the viewer anything to hold onto. Even dialogue cards are kept at a minimum in this very non-verbal silent film. The best sequence, a section called \"The World Of Make-Believe,\" plunges Roddy into the harsh world of show biz, where conniving actress Julia (Isabel Jeans) and her significant other Archie (Ian Hunter) set up a suddenly cash-rich Roddy. Watching Archie as Roddy pledges his love to Julia, smoking and drinking and looking frightfully bored as he awaits the chance to offer his casual blessing to their ersatz union, features terrific acting from all concerned. Hitchcock does well in this section by playing up the humor of the situation. But when it's over, there's no explanation or attempt at grounding things. What's this kid going to do about his new marriage? We just follow Roddy to his next stop on his downhill journey. Hitchcock presents us with some arresting images. One favorite of mine shows a daytime view of Roddy's boarding school dissolving into a scene of London at night. Anyone curious at how England looked in the 1920s will enjoy these views for their travelogue value, anyway. Novello is worthy, too, carrying the film as he must. He's too old for the part, but believably earnest even as he goes from bright student to all-around chump. A better film would give us more of a basis for this, but all we get is some eye fluttering from Novello to tell us of his deer-in-the-headlights state. It worked for Novello's female fan base at the time, but not for us. Hitchcock too often works in this surface manner. He shrugs off any subtlety in pursuit of the big effect. The worst of these feature Roddy's father, Sir Thomas (Norman McKinnel), who bears a striking resemblance to Nosferatu and shows up late in the film in Roddy's wracked point-of-view in a slew of implausible guises. Still, I was interested enough in Roddy's journey, if only as a matter of historical interest. Early on, we see he is the genuine article, a real believer in the world he inhabits, holding a cap emblazoned with the word \"Honour.\" There's a scene, arrestingly similar to the deconstructive Lindsay Anderson film \"if\u0085\", where Roddy and his friend meet that girl in the bake shop. No playing tiger in this one, Roddy just dances with the girl a little and tries to make a polite exit, but the damage is just as much as if he broke out the tommy guns like Mick and company in that later, anarchic classic. \"Downhill\" is a coming-of-age movie that only really works as a look at Hitchcock's own coming of age \u0096 before he arrived.",
         "During my youth in the sixties and seventies silent films were quite regularly shown on British television, but today are they are few and far between even on specialist movie channels, and are hardly ever shown on terrestrial television, perhaps because the generation that can remember the silent era are mostly dead. Many people therefore do not realise that Alfred Hitchcock made a number of silent films during the twenties; they are much less well-known than his Hollywood films of the forties, fifties and sixties, and even than the British talkies like \"The Lady Vanishes\" which he made in the thirties. \"Downhill\", recently shown on Sky Classics, is one of them, dating from 1927, towards the end of the silent era. (It was released in the same year as the first talking picture, \"The Jazz Singer\"). As the film opens its hero, Roddy Berwick, appears to be a fortunate young man. The son of an aristocratic family, he is School Captain at an exclusive public school. He is popular, intelligent and the school's star rugby player. His world collapses when Mabel, a waitress at a local café, announces to the headmaster that she is pregnant and that Roddy is the father. The real culprit, in fact, is Roddy's best friend Tim, but Mabel appears to have singled Roddy out because his family is wealthier than Tim's and she is hoping that she can blackmail them. Out of loyalty to his friend, however, Roddy accepts the blame and expulsion from the school. This is not the end of his misfortunes, however. He is disowned by his father, who believes him guilty of the accusation. He goes to work as an actor and marries a famous actress named Julia, but the marriage is an unhappy one and she leaves him for another man. He inherits £30,000 from a relation, but loses it all, largely due to Julia's extravagance. He becomes a gigolo in Paris, but quits this line of work in disgust and ends up penniless and starving. The theme of Mabel's pregnancy is treated very obscurely, so much so that some have misinterpreted these scenes and incorrectly concluded that Roddy is expelled on a false accusation of theft. This is because the British censors discouraged any discussion of sexual matters. Although the American Hays Office was not set up until the 1930s, its British equivalent, the British Board of Film Censors, had been established in 1912, with the result that film censorship in Britain during the twenties tended to be stricter than in America (and, indeed, than in many European countries). In later years Hitchcock was to become famous for his suspense thrillers; nearly all his Hollywood films, with \"Mr and Mrs Smith\" a rare exception, fall into this category. In his early British period, however, he made numerous films in other genres as well, and \"Downhill\" is a melodrama rather than a thriller. It does, however, show evidence of some of the techniques that were later to make him famous, particularly in films like \"Spellbound\" in which he could indulge his love of the surreal and dreamlike. In one scene Roddy, taken ill while on a ship, experiences a delirious nightmare. Hitchcock also makes use of shots of a descending escalator, not for any literal meaning but as a visual metaphor for Roddy's descent into misfortune, which is of course the significance of the title \"Downhill\". (It is strange how English and many other languages use the expression \"going downhill\" as a metaphor for a change in one's fortunes for the worse, even though in reality the lowlands at the foot of a hill are often a more pleasant place to be than the hilltop itself). True colour films were very rare in the twenties, but \"Downhill\", in common with a number of other monochrome films from the period makes use of the device of film tinting, in which different scenes are tinted in different shades. Orange is normally used for interior scenes and daytime exteriors, blue for nighttime exteriors and green for scenes set at sea and the nightmare sequences. Only a few scenes are in straightforward black-and-white. Even in my youth, most of the silent movies shown on TV were comedies. Indeed, at the time I formed the quite erroneous impression that during the silent era nobody ever made films about serious subjects and that my grandparents' generation only ever went to the cinema to laugh at the antics of Charlie Chaplin, Buster Keaton or Laurel and Hardy. The sort of slapstick at which these comedians excelled has passed the test of time better than the serious films of the era which can look very alien today, largely because they required non-naturalistic acting techniques with which we are unfamiliar. Dialogue had to be supplied by title cards, and in \"Downhill\" Hitchcock keeps his use of these to a minimum. Emotion had to be conveyed through facial expression and gesture alone, something which must have appeared strange to British people in the twenties who generally believed in keeping a stiff upper lip and regarded gesticulating while talking as a foreign eccentricity. \"Downhill\", however, shows just how powerful silent film could be as a story-telling medium. The film's happy ending may seem sentimental today, but at the time \"vice punished and virtue rewarded\" was an established dramatic convention, and Roddy's misfortunes are due not to his vices but to an excess of virtue, which enables the cowardly Tim and the manipulative Julia to take advantage of his good nature. Once one gets used to the melodramatic acting techniques, one can appreciate the power of some of the performances here, especially from Ivor Novello (today better remembered as a musician and composer than as an actor) as Roddy, Annette Benson as the scheming Mabel and Isabel Jeans as Julia. The film makes compelling viewing for anyone with an interest in Hitchcock's work. 8/10"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Gainsborough Pictures"],
      "summaries": [
         "Public schoolboy Roddy Berwick is expelled from school when he takes the blame for a friend's charge and his life falls apart in a series of misadventures.",
         "Roddy, first son of the rich Berwick family, is expelled from school when he takes the blame for his friend Tim's charge. His family sends him away and all of his friends leave him alone. Roddy decides to go to Paris where he spends what little money he has and starts working as a dancer. He soon becomes a victim of alcoholism. Roddy manages to move to England's colonies but some sailors send him back to his rich family hoping for a reward."
      ],
      "budget": 0
   },
   "movielensId": 2224,
   "movielens": {
      "languages": [""],
      "releaseDate": "1927-10-24",
      "dvdReleaseDate": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 110,
      "movieId": 2224,
      "title": "Downhill",
      "mpaa": null,
      "actors": [
         "Ivor Novello",
         "Annette Benson",
         "Isabel Jeans",
         "Ian Hunter",
         "Ben Webster",
         "Norman McKinnel",
         "Robin Irvine",
         "Sybil Rhoda",
         "Lilian Braithwaite",
         "Violet Farebrother"
      ],
      "imdbMovieId": "0017825",
      "originalTitle": "Downhill",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "After public school student Roddy Berwick takes the blame for a friend's transgression and is expelled, his life goes downhill.",
      "tmdbMovieId": 52782,
      "avgRating": 2.12963,
      "releaseYear": "1927",
      "numRatings": 27,
      "posterPath": "/p3ZTJIjcl1jBzlXfrmQXFbjvtCy.jpg"
   }
}