{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bad mother-in-law",
            "id": 2374
         },
         {
            "name": "french riviera",
            "id": 9813
         },
         {
            "name": "based on play or musical",
            "id": 10181
         }
      ],
      "imdb_id": "tt0017843",
      "video": false,
      "title": "Easy Virtue",
      "recommendations": [
         36054,
         36049,
         47695,
         35832,
         20213,
         36056,
         38730,
         73420,
         52748,
         2760,
         84772,
         95242,
         52907,
         113252,
         45218,
         64398,
         22943,
         543,
         31995,
         70368
      ],
      "backdrop_path": "/xV8MSLYxyjTX0L1jeCOhGMsDsmX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Larita Filton",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e687",
               "name": "Isabel Jeans",
               "profile_path": "/xSFhrYx7JMUcvrJ4lgIUIIIJ9A7.jpg",
               "id": 100781,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Aubrey Filton",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e68b",
               "name": "Franklin Dyall",
               "profile_path": null,
               "id": 47677,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Claude Robson - the co-respondent",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e68f",
               "name": "Eric Bransby Williams",
               "profile_path": null,
               "id": 1064079,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "The Plaintiff's Counsel",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e693",
               "name": "Ian Hunter",
               "profile_path": "/7fnMM8p9lSdRtXX0Mqg1NPJrfHL.jpg",
               "id": 8731,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "John Whittaker",
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e697",
               "name": "Robin Irvine",
               "profile_path": null,
               "id": 146660,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mrs. Whittaker",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e69b",
               "name": "Violet Farebrother",
               "profile_path": "/s3ldvLGdSxN3s0opmrMr9PvfnS6.jpg",
               "id": 553492,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Colonel Whittaker",
               "gender": 0,
               "credit_id": "5861874a92514115d3034ad9",
               "name": "Frank Elliott",
               "profile_path": "/d0J7uCeT0WGZQU7YBolZLL2t212.jpg",
               "id": 120455,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Marion Whittaker",
               "gender": 0,
               "credit_id": "586187709251414e3a00f37d",
               "name": "Dacia Deane",
               "profile_path": null,
               "id": 1689200,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Hilda Whittaker",
               "gender": 0,
               "credit_id": "586187cac3a3681a620361c1",
               "name": "Dorothy Boyd",
               "profile_path": "/hl5uY8P4EJOguWJ27gMv5UzXt0W.jpg",
               "id": 1074208,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "58618806c3a3681a6f033990",
               "name": "Enid Stamp-Taylor",
               "profile_path": null,
               "id": 288221,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Man with Stick Near Tennis Court",
               "gender": 2,
               "credit_id": "5861882f92514115d3034bae",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Telephone Receptionist",
               "gender": 1,
               "credit_id": "5861886692514115d3034be3",
               "name": "Benita Hume",
               "profile_path": "/1TU1zl2UbZ0HOtZjEjLV7hVENJK.jpg",
               "id": 131726,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e683",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5326f9949251411708003833",
               "name": "Eliot Stannard",
               "profile_path": null,
               "id": 27905,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58618562c3a3681a6502f89f",
               "name": "Noël Coward",
               "profile_path": "/MgPU3ByatARQZDAqpQAMVKrfwN.jpg",
               "id": 12718,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5861857bc3a3681a72038364",
               "name": "Claude L. McDonnell",
               "profile_path": null,
               "id": 1140591,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "586185c9c3a3681a6b03416c",
               "name": "Ivor Montagu",
               "profile_path": "/ghOw5IggdsSW7y2pteCyblaTxQW.jpg",
               "id": 3602,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5861862d92514115c0034282",
               "name": "Michael Balcon",
               "profile_path": "/jBxdXgRs386mJztdmYtCQznwtIi.jpg",
               "id": 3601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58618651c3a3681a6502f95e",
               "name": "Clifford Pember",
               "profile_path": null,
               "id": 1141776,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.94531,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 36055,
      "vote_count": 18,
      "budget": 0,
      "overview": "Larita Filton is named as correspondent in a scandalous divorce case. She escapes to France to rebuild her life where she meets John Whittaker. They are later married, but John's well-to-do family finds out Larita's secret.",
      "similar": [
         458,
         459,
         457,
         16436,
         8346,
         888,
         4379,
         5393,
         13652,
         1937,
         10872,
         781,
         2264,
         421452,
         1697,
         35987,
         427027,
         289984,
         350160,
         152135
      ],
      "original_title": "Easy Virtue",
      "runtime": 85,
      "poster_path": "/blrQSfCOBJAKxWptjRnVI3AYvH2.jpg",
      "spoken_languages": [{
         "name": "No Language",
         "iso_639_1": "xx"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Gainsborough Pictures",
         "id": 1221,
         "origin_country": ""
      }],
      "release_date": "1928-03-05",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 80,
      "synopsis": null,
      "writers": [
         "Noel Coward",
         "Eliot Stannard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0017843/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MjMxNjU3Nl5BMl5BanBnXkFtZTgwNzg5NzgwMzE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Isabel Jeans, Franklin Dyall, Eric Bransby Williams | See full cast and crew »"],
      "reviews": [
         "This silent Alfred Hitchcock drama gets decent mileage out of a rather simple story. Isabel Jeans stars as a young woman who, because of a messy divorce in her past, is unfairly considered a woman of \"Easy Virtue\", and she must struggle constantly against the ways that her past affects how she is perceived by others. This kind of drama was probably more popular and more familiar in previous eras, and many stories of the kind don't hold up very well now. This one does often show some signs of age, but it also has some of Hitchcock's creative touches that move it along and make it worth watching. One of the best is Hitchcock's treatment of Jeans responding to a marriage proposal - it's quite innovative, and a nice way to avoid the often banal treatments of romantic scenes. This is nothing like the movies for which Hitchcock is usually remembered, and it's really not even among his best silent work. But it's not bad, and if not always compelling, it is sometimes interesting in its look at the characters' social attitudes and perspectives.",
         "\"Easy Virtue\" is an early and impressive Hitchcock in which the master displays a range of innovative filmic devices (such as the way we learn about a marriage proposal by watching the eavesdropping hotel switchboard operator rather than by seeing the man or woman talking on the phone). The story is based on a play by Noel Coward and (contrary to the other posted IMDB comment on the film) I believe the movie is excellent. The solo organ score on the videotape I watched was absolutely stunning. The film tackles a range of issues relating to divorce that would become taboo after adoption of the Production Code in 1934. Our heroine Larita is married to a drunken brute. After he catches her almost (but not quite) being seduced by the artist who has been painting her picture, he brings suit for divorce. Adultery is the only ground for divorce in England at this time and we see a gripping trial scene in which the jury has to decide whether to believe Larita's denials. Of course, the jury can't see beyond its Victorian preconceptions (if she's alone with him all day, of course they've slept together) and it finds her guilty. Now a disgraced woman of \"easy virtue,\" Larita takes to the Riviera where she ensnares a rich young suitor (after he hits her in the eye with a tennis ball). Unfortunately, she doesn't tell him about her checkered past and naturally Larita's family hates her on sight. This story takes on a range of highly relevant divorce issues. The film skillfully lampoons the absurdity of fault divorce and the need to try questions of adultery to a jury. It takes quite seriously the way that society treated a divorced woman as damaged goods. It attacks the sexual double standard with zeal and skewers the stuffy English aristocracy to great effect. After 1934, divorce didn't exist in the movies (except in comedies where the spouses remarry in the end) and the important legal and social issues raised by divorce and female sexuality were erased from the screen by the censors. Very few early films (silent or sound) ever dealt so candidly with the harsh realities of divorce; \"Easy Virtue\" compares favorably to the outstanding \"One More River\" (1934) in its straightforward and quite moving treatment of the issues.",
         "While many have dismissed this silent film of Hitchcock as an insignificant work, I found this film anticipates the virtues of the later works of the director. Hitchcock often relied on strong stories/scripts/plays whether it was du Maurier or Ernest Lehman or Ben Hecht or Anthony Shaffer to make his cinema tick. In this film it was the brilliant playwright Noel Coward. Just as \"Frenzy\" (script of Shaffer) ends with the words \"\u0085you are missing your tie,\" the final words of \"Easy Virtue\" are the explosive \"Shoot! There is nothing left to kill.\" The word \"shoot\" refers to the cameras of the paparazzi not guns. Visually, Hitchcock would revert to the same scene in \"Notorious\", in \"Torn Curtain\" and even as a weapon of defense in \"Rear Window.\" The underscoring of the irony of final scenes of Hitchcock films are interesting to note. Coward and Hitchcock were really sensitizing the viewer on the social perceptions of marriage and divorce. Coward and Hitchcock seem to ask us the connection between slandered reputation and \"easy virtue.\" In \"Blackmail\" the jester (the painting) seemed to scoff at the so-called justice meted out by the law keepers in final sequence. Visually the most poignant shot (repeated twice) in the film is the shot of the judge's wig from above his head as he looks up. The interiors of the sets seem remarkably similar to scenes from Russian (Eisenstein's \"Ivan the Terrible\") and German expressionist cinema. Who should be credited more for what the film offers\u0097Coward or Hitchcock. Probably both, in equal measure.",
         "A very little seen Hitchcock, and a decent British silent film, from a Noel Coward play. It's surprisingly visual for a stage play, with titles kept to a minimum. As with a lot of early HItchcock the copies circulating are pretty bad. It must have looked good when it was new. The courtroom sequence has some typical Hitchcock touches - views through the judge's monocle. The strangest link with later films is an odd prophecy of Marnie. The blonde wife with a mysterious past is brought home to the country house, with crusty colonel father in law and brunette sister in law meeting her. A bit later on you expect to see Strutt turn up at a party to identify her. Almost the same thing happens and at the final party Isobel Jeans glams herself up and makes a grand entrance down the staircase. I am developing a theory that the things Hitchcock says nothing about in the Truffaut book are the important ones! Isobel Jeans reappeared in Suspicion 13 years later. Is she the original Hitchcock blonde? If only (BFI please note) there were proper bright restorations of these early Hitchcocks. The only one I've seen looking good is The Lodger. It makes a huge difference.",
         "\"Virtue is its own reward,\" they say - but \"Easy Virtue\" is society's reward for a slandered reputation. In the prologue, director Alfred Hitchcock crosscuts courtroom drama with flashbacks... Attractive Isabel Jeans (as Larita) is in divorce court, after a scandalous incident results in the death of a painter for whom she was sitting. Her drunken husband interrupted artist Eric Bransby Williams (as Claude Robson) as he was making play for the modeling Ms. Jeans. The painter wounded brutish rival Franklin Dyall (as Aubrey Filton), before killing himself. Jeans gains nothing but her freedom at trial. But, she was named in the dead painter's will. Notorious, Jeans goes for a vacation on the Mediterranean, intending to relax and stay away from men. Instead, she finds the latter when well-heeled bachelor Robin Irvine (as John Whittaker) hits her in the head with his ball while playing tennis. After apologizing, Mr. Irvine begins courting Jeans. \"It was like a cool breeze sweeping away the ugly memories of the past.\" The two whirlwind themselves into man and wife. Then, Irvine brings Jeans home to live in the family mansion. There, matriarchal Violet Farebrother senses something lurid in her daughter-in-law's past. Will Jeans' sordid history ruin her chances for happiness? But, of course. \"Easy Virtue\" may be considered rather ordinary, albeit a Noel Coward play directed to film by Alfred Hitchcock. But, as a silent melodrama, it's not only above average, but a little innovative. The location and settings are very nice. Most of the featured players are held over Hitchcock's previous \"Downhill\" (1927). \"Mother-in-law\" Farebrother makes the bulk of the film interesting, as she endeavors to rid her son of his bride. Their witty exchanges were written by Eliot Stannard, not Mr. Coward, by the way. Farebrother has a pleasantly sharp tongue, asking, \"John, who is this woman you have pitchforked into the family?\" She shoots to kill. ****** Easy Virtue (3/5/28) Alfred Hitchcock ~ Isabel Jeans, Robin Irvine, Violet Farebrother, Ian Hunter",
         "I will admit that at times this movie seems slow. However, if you take a look deeper at the time frame in which this movie was presented you can easily see the risk that Hitchcock took. In the movie the main character is divorced and disgraced by her horrible husband. When she tries to regain some normalcy by marrying again, the ghosts of her past come to prevent any happiness in her future. Once again she is shamed, disgraced, and helpless prey for the photographers and newspapers who use her high social standing and demise to sell their goods. A very compelling look into hypocrisy and judgment in a time when both were at their highest peak.",
         "One of Hitchcock's English silent films, based on a Noel Coward play, this demonstrates the difficulty of making a full-length complex-plotted film without dialogue. Sometimes it almost seems like a sequence of charades, with projections of character and scenery and reactions. Larita (Isabel Jeans), unhappily married to a smug brute, is having her portrait painted by a handsome artist, who falls for her, and though she doesn't succumb, the husband catches them in what appears to be a compromising position and threatens the artist who wounds him with a pistol. A divorce trial ensues in pantomime, with a woman on the jury taking notes, and the judgment goes against her. Larita escapes from scandal in the south of France, where she is courted by a young man who says he doesn't need to know about her past. She marries him and goes home to Moat House, Pevil, where her mother-in-law glares at her. After her past re-emerges, the husband takes it badly, and Larita leaves, allowing him to divorce her as she sits in the balcony in tears. Scandal bad. One piece of ingenious narrative takes place earlier when she talks to her husband-to-be about his marriage proposal on the hotel telephone\u0097the operator (Benita Hume) sits at the console spellbound, surprise, apprehension, romantic tension, and delight succeeding each other on her pretty, expressive face. Unlike Hitchcock's later work, this is not a mystery but a melodrama, and must be judged according to standards of that genre. Beautiful photography, by the way.",
         "This is my first Hitchcock silent film. this film grew on me as i watched it, i thought it started out slow . but slowly developed into something very interesting. i was upset that i missed Hitch's cameo.. he's a sneaky one. this is my 4th silent film that i have watched, and this one compares almost to the other ones, but the others are classics.. phantom, Dr Jekyll, and hunchback. so this one kinda had some unfair competition. like i said before it started slow, but it quickly engrossed me after the part where she goes to his parents house to meet the family.. i thought her character was unfairly judged by his family to the point where i was glad she didn't marry him, i admired her character for standing up to the mother in that one,, what s really awful mother in law. without ruining the ending for those who haven't seen this early Hitchcock gem,, i loved the ending.",
         "Throughout the 1920s and the early 1930s, it's obvious that the Master of Suspense was still finding his feet. 'The Lodger (1927)' was Hitchcock's first sign of future promise, a truly effective silent thriller, and many of the film-making techniques he experimented with would later form an integral part of his many masterpieces. We are all aware, of course, that the director's specialty always lay in suspense, coupled with his audacious brand of dark humour. Perhaps, at this time, he was still unsure of which direction he wanted to head, or maybe he simply tried his hands at anything in order to maintain an income. Either way, 'Easy Virtue' \u0096 his eighth film \u0096 is a rare opportunity to see Hitchcock attempt a melodrama, and the results are interestingly mixed. The story was based on a Noel Coward play, a medium upon which the director would rely heavily for many of his later films.'Easy Virtue' starred British actress Isabel Jeans, who had previously appeared in Hitchcock's 'Downhill (1927)' and would later return in 'Suspicion (1941).' The story concerns a young lady named Larita Filton (Isabel Jeans), who had experienced a difficult and much-publicised divorce when her infidelity with an artist led to her husband being wounded and the artist's suicide. Frustrated by the constant pursual of photographers, Larita takes a peaceful holiday to France, where she meets a kind and gentle man named John Whittaker (Robin Irvine), whom she soon marries, much to the surprise of the man's family. While John's father (Frank Elliott) and his former sweetheart Sarah (Enid Stamp-Taylor) do their best to accept this new addition to the family, John's stern and suspicious mother (Violet Farebrother) does her best to destroy their relationship. The acting all-round is quite good, particularly Farebrother, whose character immediately evokes an intense feeling of dislike. Jeans is something of a two-sided character; we understand her plight for happiness, and yet she's got such a sense of arrogance about her that we're much more sympathetic towards her conflicted husband. At just 60 minutes in length, 'Easy Virtue' outstays its welcome by a good quarter of an hour. The centre section of the film drags on without really going anywhere, but is partially made up for by an interesting beginning and end. The court trial in the film's opening was quite brilliant, with Hitchcock displaying the technical imagination that would ultimately make him great. His use of match cuts to lead into the flashbacks \u0096 such as the judge's swinging spectacles and the grandfather clock, and the focus on the drinks pitcher \u0096 demonstrate a keen eye for the editing technique, and I would have been happier had more of the film been dedicated exclusively to the trial. The ending is also noteworthy, with the film denying us the usual happy ending, offering us a full serving of bitter pessimism; Larita emerges from the court room, completely beaten, and accepts that her life will never be the same again.",
         "Easy Virtue is one of Hitchcock's interesting but not great films, that is neither among his best or worst. Not a terrible one but this is really not the master of suspense at his best. When it comes to his silent films, Easy Virtue is perhaps one of his weaker ones, with his best being The Lodger and his weakest being Champagne. It has a lot of good things. There are some very clever shots and Hitchcockian touches like in the opening courtroom scene with everything being shot like from the perspective of the judge through his monocle and the proposal over the phone showing only the reactions of the telephone operator. Hitchcock directs very well, though there is understandably the sense that he was still finding and developing his own style. The sets and costumes are lovely to watch, while Violet Farebrother plays her role with tremendous gusto and Isabel Jeans brings a lot of charm to hers. Robin Irvine is very bland though and the rest of the acting can feel rather overheated and exaggerated even with a silent melodrama. The characters do come across as stock and somewhat cardboard, there's little dimension to them and you don't really care for them either. The story is a let down, it begins brilliant and ends just as satisfyingly but there's half-an-hour at least of tedious melodrama and staid storytelling, the romance also lacks passion and you don't ever really feel the love between them. And some have made a good point about the benefits of having dialogue instead here, I have great appreciation for silent films but Easy Virtue was the sort of film being a comedy-social drama where dialogue would have helped it come alive. Overall, not terrible, not great, mixed view here if anything. 5/10 Bethany Cox"
      ],
      "genres": [
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Gainsborough Pictures"],
      "summaries": [
         "Larita Filton is named as correspondent in a scandalous divorce case. She escapes to France to rebuild her life where she meets John Whittaker. They are later married, but John's well-to-do family finds out Larita's secret.",
         "Laurita Finton is accused by her husband of being in love with an artist. There is a trial, but the artist, who has been rejected by the girl, kills himself. Laurita's world is destroyed so she decides to leave, changing her identity and starting a new life. She falls in love with a rich young man, John Whittaker, but his family doesn't like Laurita, a girl with an \"easy virtue\". John's mother finds out about the shadows in Laurita's past and tells everything to her son.",
         "A divorcée hides her scandalous past from her new husband and his family."
      ],
      "budget": 0
   },
   "movielensId": 2225,
   "movielens": {
      "languages": ["No Language"],
      "releaseDate": "1928-03-05",
      "dvdReleaseDate": "1999-08-10",
      "directors": ["Alfred Hitchcock"],
      "runtime": 79,
      "movieId": 2225,
      "title": "Easy Virtue",
      "mpaa": "",
      "actors": [
         "Isabel Jeans",
         "Franklin Dyall",
         "Eric Bransby Williams",
         "Ian Hunter",
         "Robin Irvine",
         "Violet Farebrother",
         "Frank Elliott",
         "Dacia Deane",
         "Dorothy Boyd",
         "Enid Stamp-Taylor",
         "Alfred Hitchcock",
         "Benita Hume"
      ],
      "imdbMovieId": "0017843",
      "originalTitle": "Easy Virtue",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Larita Filton is named as correspondent in a scandalous divorce case. She escapes to France to rebuild her life where she meets John Whittaker. They are later married, but John's well-to-do family finds out Larita's secret.",
      "tmdbMovieId": 36055,
      "avgRating": 2.62195,
      "releaseYear": "1928",
      "numRatings": 41,
      "posterPath": "/blrQSfCOBJAKxWptjRnVI3AYvH2.jpg"
   }
}