{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "boxer",
            "id": 2792
         },
         {
            "name": "woman between two men",
            "id": 7439
         },
         {
            "name": "silent film",
            "id": 154802
         },
         {
            "name": "prize fighter",
            "id": 166812
         }
      ],
      "imdb_id": "tt0018328",
      "video": false,
      "title": "The Ring",
      "recommendations": [
         64398,
         52748,
         52782,
         20213,
         36049,
         53230,
         7983,
         148357,
         35832,
         36055,
         53424,
         174924,
         86750,
         43487,
         122699,
         55700,
         4175,
         78507,
         109383,
         36106
      ],
      "backdrop_path": "/3bB3bPZ4PfetntLLd5K1zu6DgJP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "'One-Round' Jack Sander",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6bd",
               "name": "Carl Brisson",
               "profile_path": "/zR8dEttW0duwVVjaYoHDIgRRwMw.jpg",
               "id": 115155,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Mabel (as Lilian Hall Davis)",
               "gender": 1,
               "credit_id": "52fe45c99251416c9103e6c5",
               "name": "Lillian Hall-Davis",
               "profile_path": "/lqT30UOaYy0E5t0aPov04NDlhIG.jpg",
               "id": 114807,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bob Corby",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6c1",
               "name": "Ian Hunter",
               "profile_path": "/7fnMM8p9lSdRtXX0Mqg1NPJrfHL.jpg",
               "id": 8731,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "The Promoter",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6e1",
               "name": "Forrester Harvey",
               "profile_path": "/fmvJQjFEgDY8fVTl9zCO5QxZRxR.jpg",
               "id": 3371,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "The Showman",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6e5",
               "name": "Harry Terry",
               "profile_path": null,
               "id": 553228,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Jack's Trainer",
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6e9",
               "name": "Gordon Harker",
               "profile_path": "/ywuVcZk1QmIyvx70rJ0joNLK5Er.jpg",
               "id": 114808,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Fortune Teller (uncredited)",
               "gender": 1,
               "credit_id": "5a11a0dc92514138f3052b53",
               "name": "Clare Greet",
               "profile_path": null,
               "id": 37870,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Spectator (uncredited)",
               "gender": 2,
               "credit_id": "5a11a17ac3a3686280056484",
               "name": "Tom Helmore",
               "profile_path": "/gQdVpqYmetgOIH499Fe3xBLsj56.jpg",
               "id": 5731,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Man-Dipping Attraction Worker (uncredited)",
               "gender": 2,
               "credit_id": "5a11a107c3a368628605436d",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6b9",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6cb",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c99251416c9103e6d1",
               "name": "John Maxwell",
               "profile_path": null,
               "id": 7385,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c99251416c9103e6dd",
               "name": "C. Wilfred Arnold",
               "profile_path": null,
               "id": 7388,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5377e4b10e0a2614160030a3",
               "name": "Jack E. Cox",
               "profile_path": null,
               "id": 7386,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 3.095805,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 36056,
      "vote_count": 22,
      "budget": 0,
      "overview": "Both Jack Sander and Bob Corby are boxers in love with Mabel. Jack and Mabel wed, but their marriage is flat. The young wife looks to Bob for comfort.",
      "similar": [
         1374,
         289,
         1246,
         1366,
         1903,
         19,
         70,
         1578,
         1367,
         42888,
         222936,
         522,
         1278,
         116,
         45317,
         167073,
         7972,
         74643,
         194,
         680
      ],
      "original_title": "The Ring",
      "runtime": 116,
      "poster_path": "/gQRoIfnyWbBtMjLqbDY0wPulBfX.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "British International Pictures",
         "id": 305,
         "origin_country": "GB"
      }],
      "release_date": "1927-10-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Two boxers compete for the love of a woman.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 116,
      "synopsis": null,
      "writers": ["Alfred Hitchcock"],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0018328/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMxNTQyMTY4MF5BMl5BanBnXkFtZTcwNjY5OTY1NQ@@._V1._CR97.88333129882812,40.53334045410156,159,404_SX159_AL_.jpg",
      "actors": ["Stars: Carl Brisson, Lillian Hall-Davis, Ian Hunter | See full cast and crew »"],
      "reviews": [
         "The Ring was made from the only screenplay Hitchcock wrote himself and it deals, as many of his earliest pictures do, with a love triangle. At first glance, it looks like a more cynical update of the infidelity-themed morality comedies of Cecil B. De Mille, but more than that it is the first really competent Hitchcock picture. Even if he was not yet using the ideas and motifs of suspenseful thrillers, he was at least developing the tools with which to create suspense. As well as being a student of the German Expressionist style, the rhythmic editing style of Sergei Eisenstein had had its impact upon Hitchcock. But here he keeps tempo not just with the edits but with the content of the imagery. This is apparent from the opening shots, where spinning fairground rides brilliantly establish a smooth tempo. And like Eisenstein, the editing style seems to suggest sound \u0096 for example when a split-second shot of the bell being rung is flashed in, we almost subconsciously hear the sound because the image is so jarring. There is also a contrast, particularly with silent films from the US, in that The Ring is not cluttered up with too many title cards. As much as possible is conveyed by imagery, and Hitch has enough faith in the audience to either lip-read or at least infer the meaning of the bulk of the characters' speech. And it's not done by contrived symbolism or overacting, it's all done by getting the right angles and the right timing, particularly with point-of-view shots, as well as some strong yet subtle performances. There are unfortunately a few too many obvious expressionist devices (particularly double exposures), many of which were unnecessary, but there is far less of this than there is in The Lodger. Let's make a few honourable mentions for the aforementioned actors. First up, the stunningly handsome and very talented Carl Brisson in the lead role. In spite of his talent I was at first a bit confused as to why he got the role, as to be honest he looks more like a ballet dancer than a pugilist! But that just goes to show how much I know, as it turns out Brisson was in fact a former professional boxer and inexperienced in acting. Playing his rival is the competent Ian Hunter, who would go on to have a lengthy career in supporting roles right up to the 60s. The most demanding role in The Ring has to be that given to Lillian Hall-Davis, torn between two lovers. She pulls it off very well however with an emotive, understated performance, and it's a shame her career never lasted in the sound era. And last but not least the great Gordon Harker provides some comic relief in what is probably his best ever role. The Ring's climactic fight scene is among the most impressive moments of silent-era Hitchcock. Martin Scorcese may have had his eye on The Ring when he directed the fight scenes in Raging Bull, as his watchword for these scenes was \"Stay inside the ring\". The fight in The Ring starts off with some fairly regular long shots, but when the action intensifies Hitchcock drops us right in the middle of it, with close-ups and point-of-view shots. Hitchcock's aim always seems to have been to involve his audience, and this was crucial in his later career where the secret of his success was often in immersing the viewer in the character's fear or paranoia. The Ring really deserves more recognition than the inferior but better known The Lodger. It's a much more polished and professional work than the earlier picture, and probably the best of all his silent features.",
         "The symbolic use of objects, form editing, the position of characters in the scene... these were all used with such joyous abandon by Hitchcock that you can really see what a fertile genius he had. The way the wife moves from one corner of the ring to the other as the fight progresses, the editing when the wedding ring is placed on her finger... while these may seem a bit obvious by todays standards, in the silent era they spoke volumes about the story without a word being spoken. Even the title has a least four meanings that I can see; the boxing ring, the wedding ring, the bracelet the lover buys, and the love triangle at the heart of the story.",
         "\"The Ring\" is, for me, Hitchcock's best silent feature. It is a nippy little romance which sprints along with a surprisingly swift pace. There's the typical early Hitch experimentation - the camera getting \"knocked out\" in a boxing scene is a prime example and some fine comedic moments in what is otherwise a pretty serious story of love and betrayal although, with the boxing backdrop, the rather mundane story is slightly more exciting. Less gimicky than the more famous \"The Lodger\", and therefore more believable, \"The Ring\" is an underrated, early effort from the man who went on to become one of the most celebrated directors in the world. NB. Catch hold of the BFI release of this video if you can - the score is superb and by far the best new music I have heard composed for a silent movie.",
         "It's basically just a love-triangle story, but Hitchcock's storytelling skills and mastery of silent film techniques make \"The Ring\" well worth watching. There is a lot of visual detail and symbolism that add meaning to a basically routine story about small-time boxer Jack, his girl, and the champion who gives Jack his big break but who also tries to steal his girl. The opening sequence establishes the triangle amidst the colorful atmosphere of a traveling show, where Jack takes on all comers inside a tent. It is filled with a lot of detail, especially the bracelet that Bob, the champion, gives to Jack's girl, which is important as a plot element and as a symbol. (This \"ring\" is one of several meanings of the film's nicely-chosen title.) Most of the plot that follows is predictable, as it is clear from the beginning that someday Bob and Jack will have to square off in the ring with more than Bob's title at stake. But if the story is routine, Hitchcock's technique is not. There are a lot of creative touches that develop the characters and story, and that add humor and interest. The cast is pretty good, and some of the secondary characters from the traveling show are very funny in the earlier scenes. This is certainly an old-fashioned movie, and won't be of general interest today, but it's a nice little film. Anyone who likes silent films or who wants to see something quite different from the \"Master of Suspense\" should find this worth a look.",
         "Surprisingly good early effort from Alfred Hitchcock. One of the only original screenplays written by Hitchcock himself, this film shows remarkable story structure. It kicks off with a rousing boxing match in which carnival champ \"One Round\" Jack loses to a challenger from the audience who happens to be a professional prizefighter. The movie then slows down to develop the characters and introduce a love triangle between Jack, his girl and the professional boxer. The rest of the film is a dramatic buildup to the rematch between the two men, this time for the heavyweight crown. Even in this early film, Hitchcock shows his talent for meaningful cinematography and prop placement. An armband bought for the girl by the boxer continues to pop up throughout the movie as a symbol of her unfaithfulness. The only big detractor of this film is that the art of filming a boxing match had not yet been perfected in 1927. The final match, as a result, ends up being somewhat anticlimactic. The story, though, is what carries this film through.",
         "At first, I thought the Ring would be a more than normal movie with it's ordinary plot. How surprised was I! Of course, the plot is simple - one girl is in love with two men - but Hitchcock brings it to us on a silver platter, with laughter and fear, with compassion and anguish. The way he depicts the popular crowds of the fair, the strength of the attraction of the girl to both men, the tragic elements that come together with techniques that open the mind to most of his greatest movies(North by Northwest, the Rope, etc.). The master did it great even before his thirties!",
         "This early film has its flaws-- a predictable plot and some overlong scenes of dubious relevance-- but it already clearly demonstrates Hitchcock's mastery of editing and the use of powerful images. It's also among the most expressionist of his films stylistically; note, for examples, the weird distortions he uses during the party sequence and the frequent echoes of both title and plot in the imagery. Its core, though, remains the final match, which is still among the more exciting examples of cinematic boxing. Even though you know that the hero has to win, it becomes quite believable that he will lose, and the movement of his wife from the champion's corner to his, motivating the final plot pay-off, is very well entwined with the progress of the match. The inserts of the stopwatch do exactly what they should; you can almost hear the ticking (even though this is a silent film, the visuals often have a surprisingly auditory feel to them). The pacing becomes astonishingly rapid, and the viewer gets sucked into the excitement and brutality of both the match and the sexual jealousy which underlies it. The only DVD release with which I am familiar is that of Laserlight, a public domain company. As with each Hitchcock silent they've released, they've attached various musical selections, mostly orchestral, to the action. The sound editing is frequently sloppy, and the sound quality varies widely, but some genuine care seems to have gone into most of the actual choices, and the music accompanying the final match works extremely well; it is unlikely that this sequence will ever be better accompanied than it is here. This is a much more impressive film than its present obscurity would suggest. It deserves an honorable place in both the Hitchcock canon and the slender list of worthwhile boxing films.",
         "Hitchcock displays his already developed understanding for visuals in this early silent film. The plot of the film, involving two boxers fighting over a girl, is straight-forward drama without much to recommend it. Hitchcock's talent, though, is found in his stunning use of images. Nearly every shot is filled with visual symbols. Especially memorable is the jewelry that one boxer gives the girl just before she marries the other boxer. He slides it up her arm in a clearly sexual way and with one simple movement Hitch has shown us all we need to know. The boxing scenes are handled well with some interesting point-of-view shots that again prove how far ahead of his time Hitchcock was. The film also gives insight into his later treatment of women. The object of the boxers' desires is driven by money and lust, not reason or love. The only other women in the film are either beautiful party girls who make open offers of sex or old crones who help to destroy happy relationships. All in all, the Ring is a must for anyone interested in Hitchcock's early work and his development as a visual storyteller.",
         "I sometimes grow weary of reading reviews of some of Hitchcock's lesser known films, because almost every single one starts out with someone saying this film is grossly overlooked or this is a hidden Hitchcock gem or a true Hitchcock great or some other generic if - only - people - would - watch - this - they - would - see - that - this - is - a - great - Hitchcock - film - just - as - much - as - Vertigo - North - by - Northwest - Psycho - Rear - Window - etc. So, that being said, I would just like to say that if - only - people - would - watch - this - they - would - see - that - this - is - a - great - Hitchcock - film - just - as - much - as - Vertigo - North - by - Northwest - Psycho - Rear - Window - etc. Now, that may be overshooting a little bit, The Ring is not by any stretch of the imagination even in the same league as any of those films mentioned twice above, but compared to the other films that Hitchcock made in the late 1920s and early 1930s, I really think that The Ring is one of the best photographed and performed films of mostly all of them. As an almost brand new director, there are some astonishing dream sequences and brilliant segments of editing which show why Hitchcock was generating so much attention early in his career. Granted, the film does start with, among other things, the highly disturbing spectacle of an idiot black circus performer (and I use idiot in the definitive manner, the way Stephen King so often does) having eggs and fruit thrown at him by a crowd of not the classiest looking white people. I suppose this only illustrates how incredibly different such circuses and people were back then, but I think it is one of the most off-putting sequences in any Hitchcock film I've seen. The main attraction at the circus is a fighter who claims to be able to knock any man down in one round, but when he meets his match, it is against a man that challenges his authority not only in the boxing ring but also in the ring around his wife's finger. So begins an entertaining if not very tense challenge for the love of one woman, who seems to sway from one man to the other effortlessly and thoughtlessly. (spoilers) There is, for example, a scene where her husband watches her from above as she is dropped off at home late at night and, just before going into the building, she is coaxed back to the car for a kiss. This kiss is never explained, and there is also the fact that, even at the end when she proves faithful to her husband, or at least ultimately chooses him, they look into each other's eyes but do not actually kiss. The film is certainly beautifully photographed, even more so than several films that Hitch released in subsequent years. There is also a performance by Gordon Harker as One Round Jack's trainer who, in his stone faced expressionism, reminds me quite often of the brilliant Buster Keaton. Hitch leaves it a bit ambiguous, but this is a great sample of his early work.",
         "Another silent love triangle film from Hitchcock, not a mystery, but very English, very well-paced and photographed. Smooth boxer Bob Corby (Ian Hunter) recruits circus boxer \"One Round\" Jack Sander (Carl Brisson) to be his sparring partner, partly to keep the pretty but fickle Mabel (Lilian Hall-Davis) nearby. There are lots of character actors and grotesques\u0097at Jack and Mabel's wedding the verger, standing in the aisle of the church, registers shock at the sight of the very tall and the very short men, the fat lady, the conjoined twins who, of course, argue about which side of the aisle to sit, and the wedding feast is amusing. The rest of the movie has Jack losing Mabel and boxing his way back to her heart, or something like that. It was another era altogether, with the audience in evening dress, and the boxers dressing up, too, when out of the ring. The camera angles, the pace, the use of symbols, the cutting\u0097all very stylish and masterful. The camera-work and editing of the last boxing match is very gripping. Brisson's good looks are well-used in this one; his smiling is not so oblivious of what's going on around him as he is in Hitchcock's The Manxman, and so is not annoying. But can boxers have such dimples?"
      ],
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["British International Pictures (BIP)"],
      "summaries": [
         "Jack Saunders and Bob Corby are two boxers in love with Nellie. Jack and Nellie are married but their marriage is flat so she starts to look to Bob for comfort.",
         "\"One round\" Jack is a boxer who fights in bazaars. He is engaged to Nelly. Without revealing his true identity, the Australian champion Bob Corby, who is falling in love with Nelly, challenges Jack. \"One round\" loses and Bob, who wants to be close to Nelly, hires Jack as his sparring partner. A short time passes until Bob and Nelly run away together. Jack is now in training for his revenge. He challenges Bob in the Albert Hall.",
         "Two boxers compete for the love of a woman."
      ],
      "budget": 0
   },
   "movielensId": 2226,
   "movielens": {
      "languages": [""],
      "releaseDate": "1927-10-01",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Alfred Hitchcock"],
      "runtime": 116,
      "movieId": 2226,
      "title": "The Ring",
      "mpaa": "",
      "actors": [
         "Carl Brisson",
         "Lillian Hall-Davis",
         "Ian Hunter",
         "Forrester Harvey",
         "Harry Terry",
         "Gordon Harker",
         "Clare Greet",
         "Tom Helmore",
         "Alfred Hitchcock"
      ],
      "imdbMovieId": "0018328",
      "originalTitle": "The Ring",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Both Jack Sander and Bob Corby are boxers in love with Mabel. Jack and Mabel wed, but their marriage is flat. The young wife looks to Bob for comfort.",
      "tmdbMovieId": 36056,
      "avgRating": 3.07447,
      "releaseYear": "1927",
      "numRatings": 94,
      "posterPath": "/gQRoIfnyWbBtMjLqbDY0wPulBfX.jpg"
   }
}