{
   "tmdb": {
      "original_language": "de",
      "keywords": [],
      "imdb_id": "tt0016230",
      "video": false,
      "title": "The Pleasure Garden",
      "recommendations": [
         36056,
         20213,
         30266,
         36054,
         36055,
         24565,
         42116,
         44379,
         15324,
         35832
      ],
      "backdrop_path": "/u4yYlkHN8xsmlaTaFeUTdjq91Dx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Patsy Brand",
               "gender": 1,
               "credit_id": "52fe46d9c3a368484e0a7111",
               "name": "Virginia Valli",
               "profile_path": "/1FbXVX54iaWLes6ce8TNULaqZwd.jpg",
               "id": 532628,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Jill Cheyne",
               "gender": 1,
               "credit_id": "52fe46d9c3a368484e0a7115",
               "name": "Carmelita Geraghty",
               "profile_path": "/i69f5OZK21UxgKB4N60ioCUsGVg.jpg",
               "id": 538924,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Levett",
               "gender": 2,
               "credit_id": "52fe46d9c3a368484e0a7119",
               "name": "Miles Mander",
               "profile_path": "/bdpwtvVZjOgkaOXXA38tfYuiBT5.jpg",
               "id": 19329,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hugh Fielding",
               "gender": 2,
               "credit_id": "52fe46d9c3a368484e0a711d",
               "name": "John Stuart",
               "profile_path": "/zZzUldf0EqwbrNVHx9anw7YInHp.jpg",
               "id": 30709,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr Sidey",
               "gender": 0,
               "credit_id": "52fe46d9c3a368484e0a7121",
               "name": "Frederic K. Martini",
               "profile_path": null,
               "id": 577669,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mrs Sidey",
               "gender": 0,
               "credit_id": "52fe46d9c3a368484e0a7125",
               "name": "Florence Helminger",
               "profile_path": null,
               "id": 347630,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Oscar Hamilton",
               "gender": 0,
               "credit_id": "52fe46d9c3a368484e0a7129",
               "name": "George Snell",
               "profile_path": null,
               "id": 577670,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d9c3a368484e0a710d",
               "name": "Alfred Hitchcock",
               "profile_path": "/rKYyX58azJv1SZNXQWOJyNyvB9F.jpg",
               "id": 2636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d9c3a368484e0a712f",
               "name": "Michael Balcon",
               "profile_path": "/jBxdXgRs386mJztdmYtCQznwtIi.jpg",
               "id": 3601,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d9c3a368484e0a7135",
               "name": "Erich Pommer",
               "profile_path": "/oClAs4W1TRc2jtYCU4CdtXlEhPZ.jpg",
               "id": 67,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d9c3a368484e0a713b",
               "name": "Baron Ventimiglia",
               "profile_path": null,
               "id": 416764,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d9c3a368484e0a7141",
               "name": "Oliver Sandys",
               "profile_path": null,
               "id": 413599,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe46d9c3a368484e0a7147",
               "name": "Alma Reville",
               "profile_path": null,
               "id": 3681,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "52fe46d9c3a368484e0a714d",
               "name": "Eliot Stannard",
               "profile_path": null,
               "id": 27905,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.352004,
      "production_countries": [],
      "id": 64398,
      "vote_count": 13,
      "budget": 0,
      "overview": "Patsy Brand is a chorus girl at the Pleasure Garden music hall. She meets Jill Cheyne who is down on her luck and gets her a job as a dancer. Jill meets adventurer Hugh Fielding and they get engaged, but when Hugh travels out of the country, she begins to play around.",
      "similar": [],
      "original_title": "The Pleasure Garden",
      "runtime": 75,
      "poster_path": "/kxYHrcru3l0vpEraoJGBRPCunXP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Münchner Lichtspielkunst",
            "id": 29577,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bavaria Film",
            "id": 1704,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gainsborough Pictures",
            "id": 1221,
            "origin_country": ""
         }
      ],
      "release_date": "1925-11-03",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 75,
      "synopsis": null,
      "writers": [
         "Oliver Sandys",
         "Eliot Stannard"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0016230/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTc5MzUzOTAxOV5BMl5BanBnXkFtZTgwNTQ0NzY2MjE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Virginia Valli, Carmelita Geraghty, Miles Mander | See full cast and crew »"],
      "reviews": [
         "The Pleasure Garden is the first film that Alfred Hitchcock directed to completion. It's a nice look into the earliest directorial thoughts and techniques of the master. Even in this earliest film, we can see signs of what would become some of his signature trademarks. I enjoyed some of the point of view shots early in the film with the blurred view of the man looking through his monocle as well as the gentleman looking through the binoculars at the show girls legs. There is also a spiral staircase in the opening of this movie. Not that it was used like the staircase in Vertigo, but it made me smile thinking of how important that would be in his later film. The story deals with the idea of infidelity. Jill (Carmelita Geraghty) is an aspiring dancer who gets engaged to Hugh (John Stuart) who has to leave for work overseas. Patsy (Virginia Valli), who has helped Jill get her start, starts to worry about Jill keeping her promise to wait for Hugh. Jill's career is taking off and she begins to fool around with other guys. Patsy marries Levett (Miles Mander), Hugh's friend who also goes overseas to work with Hugh. Unlike Jill, Patsy remains true to her husband, thinking only of being with him. She receives a letter that her husband has taken ill and scrapes up the money to go be with her husband in his time of need. When she arrives, she finds that he has taken to drinking and island women. That's when the trouble ensues. I enjoyed Hitch's first film. It's a little slow starting, but picks up pace as it goes along. I liked seeing Cuddles, the dog, thrown in for a little comic relief to contrast the seriousness of the film, which of course is another of Hitchcock's trademarks. There was also a nice, subtle score by Lee Erwin, that fit the film well. *** (Out of 4)",
         "Hitchcock's first film is fascinating in that him shows him leaping, almost fully formed, onto the screen with his lifelong themes and his jaundiced views present and shockingly incorrect. The Pleasure Garden tells the story of a chorus girl, Patsy, who gives the gift of friendship to a newcomer, a rube of a girl called Jill who gets herself robbed on her first visit to the theatre and who lacks a friend, contacts and a place to stay. Patsy gives her all of these. At first the film seems that it is going to be Jill's story, as we follow her hiring by the masher of an impresario and her quick elevation to the star of the lowbrow dance show the theatre is presenting. But it gradually becomes apparent that Patsy is the focus of the tale, as she is romanced by a friend of Jill's earnest fiancée Hugh, a rodent of a man called Levett. Levett and Patsy marry, whilst Hugh finds himself sidelined by Jill's new found stage-door-Johnny admirers. Levett and Hugh sail away to their overseas job in the colonies, leaving Patsy to pine for her husband and Jill to romance a roué Prince. Patsy and Levett's marriage is a curious thing. He asks her that they \"share our loneliness together\" before he sails back to his job, which she takes as a proposal of marriage (we get the impression he was after some temporary female company). Once back in the colonies, Levett shows his true colours, shacking up with a dusky native maiden and drinking like a soak. Patsy gets word that he's sick and decides to ship out to see him, but the fare isn't easy to raise; her now wealthy old friend Jill refuses to help her point blank, and only the cosy old couple who run the house where she boards save the day. Unfortunately for Patsy, the first thing she sees when she arrives at Levett's lodgings is her husband in his native maiden's arms. There follows a denouement of rather rancid melodrama, as Levett kills his mistress, is haunted by her ghost, almost kills Patsy, is killed himself by a deus ex machina colonial superior, leaving Patsy and Hugh free to realise that they love each other. Levett's cynical view of women (he quickly recognises Jill for what she is), his view of marriage as a mutual sharing of loneliness, his sexual obsession with his Other of a mistress, his murder of her when she puts his respectable life at risk and his haunting by the dusky temptress is a pretty lurid and provocative portrait of white middle-class masculinity soured by experience and conflicting desires. That he has to die for Hugh and Patsy to get together suggest that Hitchcock and his sources were up to the idea that respectable petit bourgeois marriage is built on the grave of all that it excludes long before the cultural and queer theorists were writing their stuff. Levett is a fascinating character, far richer and far more unknowable than the rather bland leads - the first in a long line of portraits of human oddity from The Maestro. The film's opening sequence, as Charles Barr points out in his introduction to the recent Region 2 Network release in their The British Years box-set, has a dirty old man sitting in the front row of a theatre looking through a lens at the bodies of the dancing girls - voyeurism, the male gaze, women subjected to it all ready to go in old Hitch's very first sequence in his début film.",
         "This was Hitchcock's first ever film as director to be completed and it is indicative of his huge talent. Despite its age and therefore somewhat primitive production the young Hitch does a superb, professional and classy job. The film maintains interest throughout and is still funny, entertaining and impressive when viewed today! Hitchcock imbues it with directorial flourishes of brilliance with clever, interesting camera shots, intelligent storytelling and little bits of his psychological themes which strengthen all his films. In conclusion this is a superb film considering its age and the fact it is Hitchcock's debut.",
         "Looking at Hitchcock's early pictures, one struggles to see signs of his future greatness, like looking through every manger for the baby with the halo. But this, the first complete Hitchcock movie, shows no signs of his future greatness. He is clearly a journeyman director, some one who shows promise, but sent to Berlin for his final exam. On the plus side, this movie starts off surprisingly well, with a snappy, American-paced chorines-on-the-town plot. If they had cast Marion Davies and Marie Prevost in this, it would be typical, if rather underwritten. The start moves fast, plot points pop up, and suddenly we take a turn and the story descends into melodrama. Fairly typical of Hitchcock, you might say and you would be right, but he hasn't got any sense of what his chosen symbols are -- both leads are brunettes, which will come as a surprise to anyone who knows Hitchcock's taste for icy blondes. The symbolic items are standard and not particularly shocking -- Virginia Valli's wedding-bed deflowering is indicated by an apple with a large chunk bitten out of it -- and the actors are not really up to their jobs. Hitchcock was never a great director of actors but a great director of scenes. By 1927 his visual flair got his bosses to invest in great actors for his pictures, starting with Ivor Novello for THE LODGER. But here, everyone is.... at best, adequate, with Miles Mander very stagy and whoever plays his native lover -- still miscredited in the IMDb as Nita Naldi -- seemingly brain-damaged. There are a couple of interestingly composed visual glosses: the door that Mander must go through looks like a Turkish harem door and the decoration on either side differs dramatically; on one side is life, on another death. But this is UFA, with great cameramen and all the technicians who made great expressionist fare like CALIGARI and modernist masterpieces like Lang's work ready and eager to work.... and there's none of that here. I find it hard to give this an exact rating: the great start is sunk by the foolishness of the ending, and Hitchcock at the the start of his career is not the great film maker he would be in another thirty years -- or even four. But it is Hitchcock, and therefore demands our attention, so I'll give it a good mark for that. But if it weren't Hitchcock's first film, no one would care. It probably wouldn't even still be in existence.",
         "I was quite pleasantly surprised by this film. It's true that little of the Hitchcock we've come to love comes through but there are quite a few touches at that and all of them work. The travel scenes at Lake Como and somewhere in the South Sea work very well indeed and there's precious little in this film that doesn't contribute meaningfully to the movie. I would agree with one reviewer that Cuddles the dog gives some of the scenes humor. The transformation of two of the characters for the worst is loud and clear and the plot is not only crystal clear but quite effective. I'm glad to say I've seen this one - my last of all the Hitchcocks! Curtis Stotlar",
         "The Pleasure Garden is notable for being the first complete film of Alfred Hitchcock, one of the greatest and most influential directors in film, so it is one of great historical interest. It's not one of his best, there is somewhat of a primitive look, some of the pacing does get pedestrian in the middle and the scripting at times suffers from being overly talky. Hitchcock has definitely done worse though, and The Pleasure Garden is a decent film. Even for such an early effort, Hitchcock's direction does shine through with great use of camera angles and directorial flourishes. No signs of phoning in. The story is intelligently explored, the script serves the actors and Hitchcock competently(though of course there have been much better scripts since) and while the pacing is uneven the beginning and ending are solid enough. The acting give their all, maybe with some over-playing here and there, but there is signs of effort. All in all, a quite decent first complete film, though Hitchcock definitely went on to much better since. 7/10 Bethany Cox",
         "Compared to the industries in Hollywood and Germany, precious few British films from the silent era have been preserved and deemed worthy of study. The Pleasure Garden would probably have been consigned to the dusty bin of obscurity, were it not for its being the debut of one Alfred Hitchcock. Hitchcock was of course destined for greatness, so this picture inevitably gets scrutinised for hints of said greatness, or at least traces of Hitchcockiness. A point-of-view shot of the legs of a chorus line in the opening scene is often referenced as an example of such, a bit of pure voyeurism that is at odds with the moralist plot line. A slightly more story-orientated point-of-view shot occurs when a pickpocket eyes up Virginia Valli's handbag. Hitchcock was clearly interested from the beginning by the idea of putting the audience in the place of a character, and the latter example helps to tell the story visually, but it is of little long-term value. Neither the thief nor the leg-viewer become established characters, so there is really no need for us to \"become\" them. The way these early scenes are shot may be aimed to cut down on the intertitles by conveying the story visually. You see, during his apprenticeship Hitchcock had done some art direction work on Der Letzte Mann, a picture best known for containing no intertitles whatsoever except one at the beginning and one near the end. While the resultant excess of technique is in fact more distracting than title cards, the idea obviously fired the young Hitch's imagination. To avoid having to \"tell\", he goes to somewhat forceful lengths to \"show\". Then again, it could just be because the 26-year-old director really liked to look at women's legs. But after those showy opening sequences, The Pleasure Garden gets bogged down in a series of \"talking\" scenes. By contrast the interaction here is shot rather flatly, and there are suddenly lots of intertitles. This middle section of the picture is incredibly slow and boring. The plot is muddied by a lack of well-defined, memorable characters and the fact that the two female leads look very similar is especially confusing. In the melodramatic climax there are some vague attempts at psychological manipulation, with a few close-ups of a menaced Valli, but it's too little too late. The Pleasure Garden is full of tricks, many of which can be seen as corresponding to the technique of the later Hitchcock \u0096 \"God\" shots, point-of-view shots, close-ups to focus us on a particular object. But these are all things any monkey could pick up after hanging around a few film sets, and the director does not yet know how to put them to best use. The Pleasure Garden may pique the interest of Hitchcock completists, but other than that it is simply dull.",
         "Interesting composure and camera-work, and the dog, are about all this one has going for it. Interesting, slightly voyeuristic opening shot of dancers pouring down a spiral staircase, in sepia-tinted brown. A bit of mild, subtle humour as we see a bored man among the first row of otherwise thrilled patrons at the revue. Top hat'd Hamilton smoking a cigar while standing in front of a 'Smoking Prohibited' sign. People coming home to find their dog has chewed up their clothes These bits show the director already having a sense of humour, and playing with his audience, but not yet really knowing what to do with the fairly uninvolving story present, a sort of behind-the-scenes melodrama at a revue; infidelity, and the murder at the beach house. Surprisingly dull and lackluster results, considering the way it all sounds, although the climax does have a little bit of action to it. A lot of the sets are well done, as is the director's humorous flair in filming some of them, but quite frankly, the plot is just boring and uneven. Were it not for the fact that this is one of Alfred Hitchcock's first films as director (it is his first solely-directed feature film, but third film to be released) , no one would remember, or care about, this one.",
         "This is a moral tale of a couple of women, one good and the other lost in her own self- importance. It's also about two men who find themselves on the opposite side of fence as well. One is a kind, caring guy and the other a selfish womanizing cad. The first part of the show is about how two women in a chorus line evolve. One knows she has it and immediately demands the attention of everyone. She has been embraced by her friend who has been in the chorus for a while, but one she gains popularity, she has no time for the other woman. A marriage of convenience takes place and things really unravel. Also, the young starlet begins to realize that all her attention can't seem to make her happy. Things get kind of weird when the cad ends up in some island paradise with a native cookie whom he uses in every way possible. There are some really ridiculous confrontations and overacting by the principles. Everything gets wrapped up kind of neatly. Hitchcock was obviously learning the camera. I disagree with a previous comment about a monkey hanging around a film set being able to come up with this film. There are already hints of a style coming to the fore. It's too bad a couple of other first efforts have been lost to the inevitable decomposition of film (or simply lost)."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Bavaria Film",
         "Gainsborough Pictures",
         "Münchner Lichtspielkunst AG (Emelka)"
      ],
      "summaries": [
         "Patsy Brand is a chorus girl at the Pleasure Garden music hall. She meets Jill Cheyne who is down on her luck and gets her a job as a dancer. Jill meets adventurer Hugh Fielding and they get engaged, but when Hugh travels out of the country, she begins to play around.",
         "Patsy Brand works in a theatre called \"Pleasure Garden\" as a dancer, she marries Levett, soldier of fortune, who is going to reach English colonies in the Tropics. Before leaving for her honeymoon she meets Jill, the girlfriend of her husband's friend Hugh; thanks to Patsy's help Jill starts working in the theatre. Levett and Hugh move to the colonies and Patsy goes on with her life in London; Jill easily forgets her boyfriend and lives a luxurious life. When she knows her husband is ill, Patsy goes to the Tropics, but she finds out Levett is an alcoholic and he lives with a native; the girl is very angry and leaves her husband. After the native's death Levett seems to go mad and he tries to kill his wife."
      ],
      "budget": 0
   },
   "movielensId": 2229,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1925-11-03",
      "dvdReleaseDate": null,
      "directors": ["Alfred Hitchcock"],
      "runtime": 75,
      "movieId": 2229,
      "title": "The Pleasure Garden",
      "mpaa": null,
      "actors": [
         "Virginia Valli",
         "Carmelita Geraghty",
         "Miles Mander",
         "John Stuart",
         "Frederic K. Martini",
         "Florence Helminger",
         "George Snell"
      ],
      "imdbMovieId": "0016230",
      "originalTitle": "The Pleasure Garden",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Patsy Brand is a chorus girl at the Pleasure Garden music hall. She meets Jill Cheyne who is down on her luck and gets her a job as a dancer. Jill meets adventurer Hugh Fielding and they get engaged, but when Hugh travels out of the country, she begins to play around.",
      "tmdbMovieId": 64398,
      "avgRating": 2.45,
      "releaseYear": "1925",
      "numRatings": 20,
      "posterPath": "/kxYHrcru3l0vpEraoJGBRPCunXP.jpg"
   }
}