{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "motel",
            "id": 2669
         },
         {
            "name": "barn",
            "id": 3875
         },
         {
            "name": "waterfall",
            "id": 5739
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "mentally ill",
            "id": 191043
         },
         {
            "name": "child like",
            "id": 209071
         }
      ],
      "imdb_id": "tt0118980",
      "video": false,
      "title": "Digging to China",
      "recommendations": [
         32013,
         51321,
         32309,
         112969,
         20328,
         20468,
         60631,
         61418,
         25088,
         68426,
         44999,
         78529,
         338107,
         83412,
         52856,
         31546,
         15651,
         78133,
         83443,
         104732
      ],
      "backdrop_path": "/tZd5ZIDdI3HuwRDEtAHc6Pgrtp4.jpg",
      "revenue": 33556,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harriet Frankovitz",
               "gender": 1,
               "credit_id": "52fe44919251416c9101552b",
               "name": "Evan Rachel Wood",
               "profile_path": "/8FlQq58MYv3Wd91R8WV6jrWIeLy.jpg",
               "id": 38940,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ricky Schroth",
               "gender": 2,
               "credit_id": "52fe44929251416c9101552f",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gwen Frankovitz",
               "gender": 1,
               "credit_id": "52fe44929251416c91015539",
               "name": "Mary Stuart Masterson",
               "profile_path": "/jQLmmJWumj0MsxE2DjvMHbf5ysz.jpg",
               "id": 31140,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Leah Schroth",
               "gender": 1,
               "credit_id": "52fe44929251416c9101553d",
               "name": "Marian Seldes",
               "profile_path": "/cWrSeYJOSbYfvxKRwAxBEsY9Hnf.jpg",
               "id": 41293,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mrs. Frankovitz",
               "gender": 1,
               "credit_id": "52fe44929251416c91015541",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44929251416c91015535",
               "name": "Timothy Hutton",
               "profile_path": "/ypC4mzLExwmG0QHfi8vFe9LTeSi.jpg",
               "id": 16327,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5481ba9fc3a36829ae005aa3",
               "name": "Karen Janszen",
               "profile_path": null,
               "id": 56909,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5768da18c3a3680d5b0010cd",
               "name": "Jörgen Persson",
               "profile_path": null,
               "id": 23331,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5768da20c3a368025e00135a",
               "name": "Cynthia Millar",
               "profile_path": null,
               "id": 1531237,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.128629,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31641,
      "vote_count": 13,
      "budget": 0,
      "overview": "Harriet, a ten-year old girl, lives together with her big sister and her alcoholic mother out in the countryside. The family runs a motel. Harriet is different from the others, as she owns a great creativity and has nobody to play with. Her infinite world exists only in her mind. One day, Ricky comes along. He is a grown-up, but retarded son of an elderly lady. Soon, Harriet and Ricky share their experiences of life from a different point of view and become close friends. But his mother still plans to give Ricky away into professional care in a home, because she won't live forever to be there for him",
      "similar": [
         19913,
         44564,
         50725,
         23168,
         40807,
         8065,
         13,
         509,
         489,
         28178,
         68718,
         394117,
         290762,
         397422,
         226,
         862,
         72105,
         41630,
         62211,
         50544
      ],
      "original_title": "Digging to China",
      "runtime": 98,
      "poster_path": "/7EGGfidMvY8xOGP0JjByWOoRHor.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ministry of Film, The",
            "id": 21085,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Digging to China LLC",
            "id": 7856,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Davis Entertainment Classics",
            "id": 7070,
            "origin_country": ""
         }
      ],
      "release_date": "1997-07-07",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Two innocent outcasts. One incredible friendship.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Timothy Hutton"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Karen Janszen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118980/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MTUxMjI1MV5BMl5BanBnXkFtZTcwMTk2NjM0MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Evan Rachel Wood, Kevin Bacon, Mary Stuart Masterson | See full cast and crew »"],
      "reviews": [
         "Digging to China is an unpretentious little movie. No great moral lessons are promoted here. It plays out within the limited area of a small resort motel, an old barn, the surrounding woods and streams, an elementary school, the connecting highways, a deserted caboose, and a school bus - with brief side trips to a cemetery and a hospital. No profound messages are involved; it doesn't probe the depths of the human condition. It's merely the story of the friendship between ten-year-old Harriet, a bright, imaginative loner, and Ricky, a man with special learning and behavioral handicaps. The relationship grows as each faces a major emotional life adjustment. For a little movie, Digging to China is loaded with fantastic, deeply affecting, unforgetable images. Tim Hutton is to be congratulated for putting this simple story together as a, yes, classic movie. Mary Stuart Masterson, quite possibly the most under-rated actress of our time, brings dignity to the evolving character of Gwen, who is determined to learn her new responsibilities. Kevin Bacon reads the part of the hurting Ricky with great sensitivity. By its nature, the whole movie rides on the tiny shoulders of Evan Rachel Wood, and she carries it flawlessly. She can display a range of emotions many more experienced actors would kill for. In a few short minutes Miss Wood's features can slide subtly from questioning, to hopefully anxious, to happy, to forlorn - a masterpiece of acting. Sensitive viewers will feel better for seeing it.",
         "I came across the start of this movie on TV at work, and despite having pressing things to do, I found myself absolutely compelled to keep watching the entire movie. It was a very, very captivating, touching, sweet and just plain well-crafted movie, with utterly amazing performances all round. Evan Rachel Wood (looking not unlike a child-version of Meg Ryan) was incredible as the 10-year-old so much wiser than her years, yet still embroiled in the imaginative and emotionally out-reaching world of childhood. The story felt extremely honest and uncommercial, *although* I could have done without the whole suspected child molesting theme, which was a bit over the top. Fortunately, however, it ultimately didn't really affect the characters' fate. The ending was bittersweet, as this kind of story has to be, but one still wishes that a better solution had been possible. A great work. 8 out of 10.",
         "Awesome movie, people. Not the best, but awesome. I saw this movie a while ago so I'll have to rely on what I remember. This movie had a wonderful story. It was very moving, for me, in the way that it showed great character depth. In other words, it showed people as they are, and gave you another perspective on how people see the world and the people who live on it. It showed why people act they way they do, and what you can do to help people. I don't see how anyone, after watching a movie like this one, could not be moved, possibly enough to reach out to someone and help them.",
         "Timothy Hutton and the cast of \"Digging to China\" deserve an \"A\" for effort and for having their hearts in the right place. Despite some awkward writing and a not entirely successful performance by Kevin Bacon, this film mostly succeeds by making you feel the deep need the characters have to connect with one another. Some scenes feel contrived, but the performances overcome this for the most part. Bacon is OK once you get used to him, but his performance feels a bit studied and overly mannered -- it doesn't flow as naturally as Leonardo DiCaprio's similar performance in \"What's Eating Gilbert Grape?\" This movie shares some plotting and themes with \"Lawn Dogs\" -- in both films an older man befriends a lonely and odd young girl; people misunderstand and violence results -- which to me was a better movie. But \"Digging to China\" certainly deserves more attention than its gotten. The performance of Evan Rachel Wood as Harriet is one of the most amazing performances by a young actor I've seen in ages.",
         "I didn't mean the summary title to say that there'd be lots of nudity in this movie; what I meant was that this movie reveals a lot of what many people still have - a fear of the unknown. This can be seen when Gwen Frankovitz (Masterson) has to take charge of her sister Harriet (Wood ) when their mother dies, and when Harriet befriends a mentally-retarded adult (Bacon) with whom she intends to run away with. The toll of having to take care of a ten-year-old child combined with her unpreparedness for it and her relationship with her boyfriend makes for a stressful home, thus making Harriet want to leave home even more. But it is Harriet's relationship with Ricky that is the most heartwarming. Only a child like her can see through the exterior and love what's inside, which leads to some heart-tugging scenes later in the movie.",
         "Director Timothy Hutton together with an ensemble of right on performances turns what could be a weepy tale of friendship between a retarded man and an 11 year old girl into a deeply moving story on the power of love the need for human connection. Evan Rachel Wood is without a false note in her portrayal of Harriet, a little girl who searches for escape from her dreary life into an elaborate and eccentric fantasy world. She is looked at as slightly goofy by her classmates, a spirited handful by her alcoholic 'mother', and a major pain in the butt by her promiscuous older 'sister'. It isn't until Ricky, played by Kevin Bacon, and his mother come to stay at the family's motel cabins, on their way to bringing Ricky to an institution, that Harriet finds a real kindred spirit. After Harriet's 'mother' is killed suddenly in an auto accident (she had a tendency to drive on the wrong side of the highway) a crucial family secret is revealed. The friendship between these two outsiders begins to deepen. Despite the obvious obstacles of age and mental condition each provides a connection which the other needs, a relationship which allows Harriet's imagination to flourish and Ricky to feel valued and fully human for the first time. As the two other women in Harriet's family (who all look surprisingly alike enough to be a family), Cathy Moriarty and Mary Stuart Masterson are beautifully understated in their performances. Despite the problems in lives of these women each is characterized with the same indomitable spirit. We see the same spark in each of their personalities, each at a different stage of defeat and resignation. The struggle for them is not to let life's circumstances defeat them. For Harriet and for Ricky there develops a real love and friendship which is unique and wonderful but, as the title suggests, it is a relationship which is both dangerous and inevitably hopeless. First time director Timothy Hutton brings the same intelligence and thoughtfulness to his directing that he brings to his acting. He has created a great looking film and helped create some marvelous and honest performances. The visual scheme of the film effectively captures many its themes of connection, entrapment, secrecy, and fantasy. His camera also tends to sit low, giving us a child's eye view. He sometimes allows the camera to literally participate in the world through Harriet's imagination. By not burdening us with extraneous details concerning the women's relationships with male characters (except for Ricky) the characters to exist in their own emotional space. The music is artfully chosen. Digging to China captures the struggles of coming of age as well as to make our connections to one another richer and stronger. It is a carefully conceived, powerfully acted, and beautifully directed film. It goes beyond the familiar territory with style and grace. Take the kids and transcend the cynical. This is one of the best films I've seen all year.",
         "I will have to say that I enjoyed this movie and that is saying something! I caught the movie on cable tv and I stayed with it to the end and I am glad that I did. Kevin Bacon not only proves he is one of the finest actors around but his young costar is a shining example of the talent in Hollywood! Check this one out, Greg",
         "I turned this movie on about halfway through, so I've yet to see the entire thing, but I was crying within minutes. I have NEVER liked Kevin Bacon, for no real reason other than he was in \"Wild Things\" which I thought was absolutely horrible. His performance as Ricky had me crying in just a few minutes, at the friendship Ricky and Harriet shared that no one else could touch. The end upset me greatly as I always hope for happy endings and would've loved to see Harriet grown up and revisiting her old friendship, or something along those lines... but I'm a sap that always wants a happy ending. ;) In any case, this one movie has completely changed my opinion and made me respect Kevin Bacon utterly for not only taking such a challenging role, but moving me to tears in it. Evan Rachel Wood was awesome as well, and I had no idea she'd been \"around\" for this long! A wonderful movie, even though the ending left me feeling a bit ripped off.",
         "This is a poignant film that few moviegoers are familiar with. It is redolent of such recent works as Manny & Lo (featuring Scarlett Johanssen, the girl from Horse Whisperer) and Lawn Dogs (a decidedly darker vehicle, starring Sam Rockwell). Don't pass this one by, if you have a heart.",
         "I just fell in love with this movie. The story was pure and sweet. A young girl is open to another who is different from her. That is refreshing. Letting go is also something the young girl faces. This movie is great for kids, and for adults it is reminding them the feelings and thoughts from when they were young."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Davis Entertainment Classics",
         "Digging to China LLC",
         "Ministry of Film, The"
      ],
      "summaries": [
         "10-year-old Harriet dreams of leaving her home, where she doesn't feel she's needed by her mother and sister Gwen. When her mother dies in a car accident, she really starts to make plans for leaving and she finally does so together with her childlike (mentally ill) friend Ricky.",
         "Harriet's alcoholic mother owns a hotel, she and her promiscuous sister Gwen live there. Harriet is a lonely child, she doesn't like her life, or her world and keeps looking for an escape to a better one, her plans include digging to china and leaving on a UFO. One day a car breaks down near the hotel and the couple inside takes a room. The couple is Ricky, an intellectually disabled man, and his sick mother Leah. Ricky's mother is dying of cancer and they were on their way to a home so that he would be taken care of after she is gone. Harriet and Ricky become friends over their common interest in a different life. Their bond and their desire for escape grows stronger after Harriet's mother dies, as he stands by her during her grief she try's to do the same in helping him deal with the fact that he is different and will soon be very alone. They are each others best and only friends and as they cling on to each other as for dear life, Gwen who doesn't understand their relationship tries to keep them apart.",
         "Harriet, a ten-year old girl, lives together with her big sister and her alcoholic mother out in the countryside. The family runs a motel. Harriet is different from the others, as she owns a great creativity and has nobody to play with. Her infinite world exists only in her mind. One day, Ricky comes along. He is a grown-up, but intellectually disabled son of an elderly lady. Soon, Harriet and Ricky share their experiences of life from a different point of view and become close friends. But his mother still plans to give Ricky away into professional care in a home, because she won't live forever to be there for him."
      ],
      "budget": 0
   },
   "movielensId": 2233,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1997-07-07",
      "dvdReleaseDate": "2006-12-26",
      "directors": ["Timothy Hutton"],
      "runtime": 98,
      "movieId": 2233,
      "title": "Digging to China",
      "mpaa": "",
      "actors": [
         "Evan Rachel Wood",
         "Kevin Bacon",
         "Mary Stuart Masterson",
         "Marian Seldes",
         "Cathy Moriarty"
      ],
      "imdbMovieId": "0118980",
      "originalTitle": "Digging to China",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["ZGbMnlO1hKw"],
      "plotSummary": "Harriet, a ten-year old girl, lives together with her big sister and her alcoholic mother out in the countryside. The family runs a motel. Harriet is different from the others, as she owns a great creativity and has nobody to play with. Her infinite world exists only in her mind. One day, Ricky comes along. He is a grown-up, but retarded son of an elderly lady. Soon, Harriet and Ricky share their experiences of life from a different point of view and become close friends. But his mother still plans to give Ricky away into professional care in a home, because she won't live forever to be there for him",
      "tmdbMovieId": 31641,
      "avgRating": 2.89552,
      "releaseYear": "1997",
      "numRatings": 67,
      "posterPath": "/7EGGfidMvY8xOGP0JjByWOoRHor.jpg"
   }
}