{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0165857",
      "video": false,
      "title": "Let's Talk About Sex",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michelle",
               "gender": 1,
               "credit_id": "52fe4e109251416c7514a1d9",
               "name": "Paget Brewster",
               "profile_path": "/4yzWN3Up7HXvAmuq8D4CBxGjtlz.jpg",
               "id": 15423,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lena",
               "gender": 1,
               "credit_id": "52fe4e109251416c7514a1dd",
               "name": "Randi Ingerman",
               "profile_path": "/wKvnPikIUUNEgainp0JT0H93R4R.jpg",
               "id": 120612,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "58c770f192514179f700604b",
            "name": "Troy Byer",
            "profile_path": "/ljDK3Ti3y0Ty8TYLnnLaLCIPJlc.jpg",
            "id": 42974,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.173589,
      "production_countries": [],
      "id": 223318,
      "vote_count": 0,
      "budget": 0,
      "overview": "Woman interviews her friends, talking about sex.",
      "similar": [],
      "original_title": "Let's Talk About Sex",
      "runtime": 82,
      "poster_path": "/59uXfJH41SvByO9CXfQ5ATkEN26.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-09-11",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Troy Byer"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Troy Byer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165857/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4MTc0NTc3OV5BMl5BanBnXkFtZTYwOTgzNzg5._V1_.jpg",
      "actors": ["Stars: Troy Byer, Paget Brewster, Randi Ingerman | See full cast and crew »"],
      "reviews": [
         "The most melodramatic piece of GARBAGE I've seen. This is the movie that makes men believe women are overly-dramatic, menstrual, and impossible to understand. It's a total generalization of women, as all the characters are typical stereotypes of lifetime watching, upper-middle class women with too much time on their hands and not enough brains in their heads. I felt absolutely no sympathy for any of these people, not even the one who couldn't have children. Boo hoo, I guess you'll just have to go get your hair done and buy yourself another Gucci suit. I'm female by the way, and this vulgar display of feminine instability is insulting and untrue. Perhaps one of the worst scenes in this movie is shortly after the girls discover the tape they've been working so hard on has been destroyed and in an attempt to distract themselves they each find an area of their comfortable loft to clean and cry while cleaning products fly in the air. We also get gratuitous cleavage shots while vacuuming. This movie is not about sex. It's about fakey women getting in touch with how incredibly self-involved they are as they revel in their mediocre problems. All this is done to soft, girly Lilith Fairesque music and soft camera lighting. Plus, as a special treat, all of these women are beautiful and have less than an ounce of fat on them. But you know how difficult life can be when you're beautiful and have little to worry about.",
         "I happen to love the actresses in this movie. Paget Brewster is one of the most under-rated actresses of any time. The movie (in a nut shell)is about someone making a documentary about sex and trying to sell it to a network. She enlists her friends to help her and a good time is had by all. This is all well and good but the ending to this film was so bad that I have to share it so that no other unsuspecting person doesn't rent the movie. There's a mix up with the tapes and the documentary ends up being erased and replaced with a lesbian sex tape. So what would you do in this situation? I would scream or yell or get even but these women...they...CLEAN! Yes, that's right they run around the house in hysterics, tears streaming down their faces, dumping Comet on the tile and trying to clean. I didn't know whether to throw my high heel at the TV or just start laughing. Another reviewer wrote that this film made women look like emotionally unstable idiots. To be fair, most of us are, sometimes. This movie made women seem like sad, annoying, some what psychotic, estrogen crazies.",
         "But truthfully, that's the way that life sometimes works! Which is what I think this movie is actually about. It is a shame that Troy Beyer didn't focus more on the poignant and emotional parts of her three main characters long before the end of this movie. I honestly wasn't hoping for skin footage when I grabbed this video off the shelf. Paget Brewster as Michelle was the only reason I rented it from Blockbuster anyway--there was a recent cycle of her as \"Kathy\" on Friends broadcast on CBS recently. I found her presence as an actress and character intriguing, besides her large warm eyes and mammoth smile. In \"Let's Talk About Sex\" the gratuitous, raw sexual footage seemed overdone. But, it did serve to set the musky mood for this film's sexual side. The grainy video footage of women who were interviewed for a possible TV show called \"Girl Talk\" was impressive and disturbing for me, a guy, who has enough problems trusting some of you already. Their stories and opinions on sex, men, and being women did serve to add depth to the story; nevertheless, I found myself wanting to see more of the emotionally bruised and honest sides of the main characters, more of their history, as well as the sincere parts of the strangers they interviewed for \"Girl Talk\". To me, it was two different works melded together...the vulgar, clay side of sex along with the more ethereal feelings found within humans as sexual, emotional beings...somehow this film never seemed to find a segue from one into the other without making me lurch from the impact of the pace changes. Two sides of the same coin, I think that this is an honorable work: Like most films that have good merit, this one ends with the three friends each having their own much needed epiphany. That the characters learned something and had their ships come in is enough for me. I did take something really good from it.",
         "There are two things going on in Let's Talk About Sex. One part of the story is the making of a videotape that is to be the pilot of a cable TV program - a talk show where women talk about sex. This aspect of the film works well - it really does capture the feel of things (though the answers given are remarkably forthright; I suspect that you'd have to do a LOT of editing to get anything like that in real life), and the answers are entertaining and sometimes insightful. The other aspect of the story is a look at the love lives of the three principal characters - the one making the film, and the two friends that she lives with. This part of the film doesn't work nearly as well; the characters just didn't involve me. Let's Talk About Sex could have been an even better film if it had been done as a straight-up mockumentary. But there's enough good stuff here to make it worth a look.",
         "This movie is a must-see for adult women of all races and sexual preferences. It deals with all the major issues facing women who are in, seeking, and/or leaving relationships. I loved it, and I love Troy Beyer for making it happen. It also wouldn't hurt the male race to see the movie for what it is. A great film about women and their sexuality.",
         "I really liked this film a lot. I think Troy Beyer really nailed this. She is a natural talent. I was hooked in the minute the movie started. The interviews are great too. This is one of those movies for every woman's movie collection and one every guy should see. I wanted to know what was going to happen with each character. As a woman, this film made me feel empowered, sexy and wanting to call my girlfriends for a good talk. It shows women as strong, sexy, confident, self reliant people who can still be vulnerable at times. I bought this movie for my guy friends to see. If you are a man and reading this review, I urge you to get this film. You will be entertained as well as educated.",
         "What a horrible piece of \"profanity\". This movie is tolerable only as a comedy about how to make a bad movie. While there are some beautiful women in this movie, this fact alone does not make it worth the time investment to watch this badly acted, badly written over-wrought movie. Watch only a tape of this movie , so that you may fast forward through the horribly set up plot points that pay off in predictable and laughable ways. When things go wrong for a character that you see coming in the scene before, it is truly a gut buster, they could not be funnier if they tried. Back to the women in this movie, there are some attractive women in this movie, of the main three, there is one who is attractive in a plastic way, but that is as good as it gets, the next semi-attractive one spends the entire movie with some horrible gel-crap in her hair making her look like she's perpetually running late, and just ran a wet comb through her flattened greasy looking locks, is this a look anyone would want to look at for two hours ? Answer: No! The last of the main trio of women is short in stature with an unfortunate short hair cut, and really short on natural acting talent, maybe classes would help, certainly a better script would. Why comment on the looks and hair of the various women? Well, there is so little else of real substance in this movie that one finds other things to look at as a distraction. The truly sad thing about this movie is that it represents a whole lot of effort by a lot of well intentioned people, and that it purports to be about women talking about sex, real women have real thoughts, and they don't deliver them perfectly the first time they attempt to express them, or if they do, they are at least believably expressed.",
         "I really didn't like this movie. The acting wasn't too bad (in fact I think they did a nice job with the casting), but the plot (what little of it there was, outside of the female-power home video clips) was disconnected and the director overplayed almost every sensitive scene, making the viewer care less and less about more and more. By the end of this movie, I was checking the \"time remaining\" display on my VCR and cracking dirty jokes about Michael. And I'm sure that whenever women become extremely upset, they all go on mass cleaning sprees. It's in the movie, it must be true, right? Overall: Don't watch this movie unless you want to see women talk trash about sex.",
         "I *love* movies - I can usually find something to enjoy about almost any film, but this one was just -bad-. Over acted, messy editing, no story to speak of, overwrought, so full of cliches and stereotypes it was ridiculous. My girlfriend selected it. She thought it was bad enough to offer to give my back my money. I can't understand how this thing made it into theaters at all.",
         "I caught this movie on cable the other night. Its funny because I saw the cover for it in the video store and it has the three main actresses with skimpy halter tops painted onto their bodies. Nice try to get men to watch, but guys if you're looking for nudity, forget it. Anyway, these three skirts all live together in a nice apartment in downtown New York. We got a black girl named \"Jazz\", (because the black characters in a movie all should have cool nicknames associated with music, that's how we know they're cool!), a jewess, and an italian chick. The italian girl is supposed to be the extra-spicy slut, but the jewish girl, played by Paget Brewster, is exceptionally hot. But then I have a thing for jewesses so go figure or who knew or whatever. Anyway, Jazz wants to make a movie about girls talking about sex. We get the usual super-smart fem-banter, like \"You go girl!\",\"Men are dogs!\" and \"Why can't a man be faithful, damn girl!\" Then her dumb friends somehow lose all her footage and she freaks out and cries a lot. I don't know why she was so upset, her movie sucked. Except the part where they get women to talk about walking around topless. That gave the filmmakers an excuse to do a dream sequence of girls sitting at a cafe topless, but since the girl I liked wasn't one of them I didn't give a red-hot damn. Juicy sideplots like the italian girl being a big slut and the jewish girl doing stuff, (ironically I can't remember what her purpose was, even though she was my favorite - probably cuz everytime she was onscreen I was fantasizing about those big juicy lips of hers) all fail to distract from the fact that this is just one big fat tease. If I were one of these actresses, I would've demanded that I have a nude scene. These up and comers think they will go anywhere with trite crap like this, they're fooling themselves. C'mon, you ain't big till you show it girls. This \"suggested sexuality\" doesn't fly with the people with most of the money, i.e. the ticket buying public, i.e. men. Yeah baby, the blood is racing to my imagination already. Let me recite a short but sweet list: Meg Ryan, Nicole Kidman, Demi Moore, Julianne Moore, Mena Suvari, Kim Basinger, even Meryl Streep. What do they all have in common? They all got naked at one point in their careers. Get with the program ladies. Oh yeah, so back to the movie. Jazz forgets all about her dumb-ass movie once the man in her life comes back to her, which is a great message to send to women looking for an inspiration to be independent. This big black stud comes along and just whips her right back into girlfriend shape in no time, good work my friend, good work. That's sort of unintentionally funny, I guess. Another highlight is when the jewish girl cries about something, she looks really hot for some reason. It reminded me of when I was 5 and I was reading Archie comics and got turned on for the first time ever because Archie was pulling Veronica's hair and she was crying. Of course I didn't know why it turned me on, and I still don't know why this one did either. Worth a look for laughs, and to see how women who don't exist and will never date you interact with each other. 1 and a half stars out of 4."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Island Digital Media",
         "Sphinx (II)"
      ],
      "summaries": ["An aspiring African-American talk show host sets out with two girlfriends to videotape interviews with multicultural women about life, love and sex. She interviews her friends Michelle, who is a vixen, and Lena, who is more vulnerable about their views on sex. Through the course of the project, all three women work out their sexually problems and questions, and work on their relationships with men."],
      "budget": 300000
   },
   "movielensId": 2234,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-09-11",
      "dvdReleaseDate": null,
      "directors": ["Troy Byer"],
      "runtime": 82,
      "movieId": 2234,
      "title": "Let's Talk About Sex",
      "mpaa": "R",
      "actors": [
         "Paget Brewster",
         "Randi Ingerman"
      ],
      "imdbMovieId": "0165857",
      "originalTitle": "Let's Talk About Sex",
      "genres": [""],
      "youtubeTrailerIds": ["tJPFjvo1oo0"],
      "plotSummary": "Woman interviews her friends, talking about sex.",
      "tmdbMovieId": 223318,
      "avgRating": 2.72667,
      "releaseYear": "1998",
      "numRatings": 75,
      "posterPath": "/59uXfJH41SvByO9CXfQ5ATkEN26.jpg"
   }
}