{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "illegitimate son",
         "id": 183886
      }],
      "imdb_id": "tt0124879",
      "video": false,
      "title": "Simon Birch",
      "recommendations": [
         53151,
         21845,
         20726,
         22797,
         31220,
         26441,
         31306,
         3526,
         9263,
         21433,
         118991,
         17745,
         25969,
         25088,
         43076,
         42158,
         24795,
         12664,
         1873,
         47818
      ],
      "backdrop_path": "/eZJKlIedhOJ6YzNjJtFL2gmLYtf.jpg",
      "revenue": 18253415,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Rebecca Wenteworth",
               "gender": 1,
               "credit_id": "52fe444fc3a368484e01befd",
               "name": "Ashley Judd",
               "profile_path": "/3bgmRDt02iGFVjhqCqstVyEeiwG.jpg",
               "id": 15852,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Simon Birch",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf07",
               "name": "Ian Michael Smith",
               "profile_path": null,
               "id": 1021869,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Joe Wenteworth",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf0b",
               "name": "Joseph Mazzello",
               "profile_path": "/zsBGvymDqB737PerJTqhS9dPuBd.jpg",
               "id": 4787,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ben Goodrich",
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf0f",
               "name": "Oliver Platt",
               "profile_path": "/an9n3aUKFAN50GDsbqwIkvWlcus.jpg",
               "id": 17485,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Rev. Russell",
               "gender": 2,
               "credit_id": "59ce81bf9251416c8601b578",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Grandmother Wenteworth",
               "gender": 1,
               "credit_id": "59ce81c9c3a3686a6301c6b6",
               "name": "Dana Ivey",
               "profile_path": "/12mxrB5iT1TAwCzIZvmcFGLBQ52.jpg",
               "id": 13314,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Hilde Grove",
               "gender": 0,
               "credit_id": "59ce81d39251416c5901b884",
               "name": "Beatrice Winde",
               "profile_path": "/gj8UhsDJ2xad8mRrO1VDsGPLdiA.jpg",
               "id": 168638,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Miss Leavey",
               "gender": 1,
               "credit_id": "59ce81da9251416c7701c124",
               "name": "Jan Hooks",
               "profile_path": "/9XIElHw7adTbQ0rAPucRmQAnxG1.jpg",
               "id": 129332,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Marjorie",
               "gender": 0,
               "credit_id": "59ce81e1c3a3686abc01b7f2",
               "name": "Cecilley Carroll",
               "profile_path": null,
               "id": 1398393,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 2,
               "credit_id": "59e392f99251410b6700031c",
               "name": "Jim Carrey",
               "profile_path": "/5tVf0ow8MX4OwjmVoSa5v7qUDka.jpg",
               "id": 206,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Junior Lamb",
               "gender": 2,
               "credit_id": "5a0856cb9251414bc6018149",
               "name": "Sean Flynn",
               "profile_path": "/pq6BwfLHCredsEkOLWEuWmsiVXe.jpg",
               "id": 22474,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf03",
               "name": "Mark Steven Johnson",
               "profile_path": "/6trChNn3o2bi4i2ipgMEAytwmZp.jpg",
               "id": 16837,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe444fc3a368484e01bf15",
               "name": "Mark Steven Johnson",
               "profile_path": "/6trChNn3o2bi4i2ipgMEAytwmZp.jpg",
               "id": 16837,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59ce8168c3a3686ad701ac76",
               "name": "Marc Shaiman",
               "profile_path": "/aesoPh8jPR5qDKjjt7o5uj9kS3W.jpg",
               "id": 9251,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59ce81809251416c5901b7f5",
               "name": "Aaron Schneider",
               "profile_path": "/2r5HYyw5E9xWhxWqITneAyQ9FbW.jpg",
               "id": 58292,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59ce8186c3a3686a7e01ab37",
               "name": "David Finfer",
               "profile_path": null,
               "id": 18387,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59ce818f9251416c6d01c1d3",
               "name": "David Chapman",
               "profile_path": null,
               "id": 3286,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "59ce8195c3a3686a2301c562",
               "name": "Dennis Davenport",
               "profile_path": null,
               "id": 29219,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "59ce819d9251416c2001d62b",
               "name": "Carolyn 'Cal' Loucks",
               "profile_path": "/iy7lqjMdb3Qn6W0lLo0b6kcWZLz.jpg",
               "id": 107420,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "59ce81a49251416c8601b544",
               "name": "Betsy Heimann",
               "profile_path": null,
               "id": 11802,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "59ce81ab9251416c6d01c20f",
               "name": "Abram Waterhouse",
               "profile_path": null,
               "id": 1525195,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.798153,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22796,
      "vote_count": 71,
      "budget": 20000000,
      "overview": "Simon Birch tells the story of Joe and Simon's heart-warming journey of friendship. Simon Birch was born with a condition that makes him much smaller than all the other kids in town. Now, due to his condition, Simon thinks God made him this way for a reason and highly believes in God. Together, Joe and Simon go on a journey of trust and friendship to find the answers to many things. Their friendship is put to the test when some unfortunate events happen.",
      "similar": [
         693,
         1364,
         10098,
         946,
         11159,
         4286,
         10305,
         48883,
         6630,
         6720,
         1403,
         2803
      ],
      "original_title": "Simon Birch",
      "runtime": 114,
      "poster_path": "/wB6JV6KflRFoNpVnJxR99fhgTJ3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-11",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Destiny has big plans for little Simon Birch.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mark Steven Johnson"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Mark Steven Johnson",
         "John Irving"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0124879/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5MDg2OTM0Ml5BMl5BanBnXkFtZTgwNDczMzk5MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ian Michael Smith, Joseph Mazzello, Ashley Judd | See full cast and crew »"],
      "reviews": [
         "I have watched the movie twice, once with my wife and once with my children. It is a great movie and totally undeserving of some of the juvenile comments posted here. It is a story of a 12 year old extremely undersized boy who is a freak to many, a best friend to another and ends up being a hero. All through the movie he talks of God having a plan for him and that his small stature is a part of that plan. Don't compare it to the book it is \"suggested\" from. Neither does justice to the other. Don't miss it.",
         "Fantastic movie! I had avoided this one in the theaters last Fall because of the theme. Consider this movie in light of the other \"suffering child\" movie that came out around the same time, \"Patch Adams.\" Bless those \"Patch\" folks, they really tried, but that movie was dense, depressing, and the characters were tedious if implausible. \"Simon Birch,\" however, succeeded in every sense. It evoked the late 1950's and early 1960's very well. Not just the look of an American small town, but the vibe of the folks, especially the adults, rang very true for me (I was there, same age as the Joe character). The movie itself was wonderful to look at, and easy to lose one's self within. The other key aspect of the movie was title character, Simon. When I first saw the previews for this, I thought that it could be good, but it could also be awkward and painful to watch. There is a place for painful and awkward movies, I suppose, but most often I choose to avoid them. When I rented the DVD of \"Simon Birch,\" I was willing to watch, but was still expecting it to be somewhat of an ordeal, like taking bitter medicine. I was so surprised! It does convey the considerable pain of the characters' circumstances, yet it is also a story that is fluid with grace and tremendous joy. I was touched, and I was also happy and uplifted. The entire cast was stellar, especially the young boys who played Simon and Joe. Everyone was awesome. What an accomplishment! I gave it a 10.",
         "Simon Birch is an amazing, touching and emotional drama about 12 year old Simon Birch, a small boy who can't grow and believes he has a destiny. The movie is one of the most amazing movies I have ever seen. It's a very well made movie and VERY sad, especially the ending which had me in tears. There were even a couple of funny bits here too, like the scene at the school play. Simon Birch is played brilliantly by the amazing Ian Michael Smith who gives a fantastic and touching performance. I REALLY hope to see more of him in the future. Joseph Mazzello also gives a great performance as Simon's best friend, Joe Wenteworth. Oliver Platt is also really good here too as Ben Goodrich. Like I've already is Simon Brich is a brilliant movie and should be watched by everyone of all ages as it's really amazing. It's one of those movies which deserved some Oscar winnings. I give Simon Birch a 10/10. See this movie now, if you haven't already.",
         "This film is by far one of the most moving, well filmed and acted films I have seen in many years. The touching story shows the life of young Simon played perfectly by Ian Michael Smith in a very small, and not always understanding community. It is set beautifully in the 1950s and shows how the inner strength and enormous faith shown by such a little boy afflicted with so many physical problems can have such an influence on those around him along with the respect he would command amongst his piers. The film also stars well known child actor Joseph Mazzello who plays Joe Wenteworth ( Simon's best friend.) Mazzello also starred in Jurassic Park, The River Wild, The Curse etc I think this was Joseph's finest performance yet. It was also very nice to see a cameo performance by Jim Carrey as the grown up Joe, and to see how Jim can be a very convincing serious actor too ! I would like to see more roles of this type from Jim for maybe the years to come ? The photography was so well executed, and showed such lovely changing seasons through the year it was set. For me there were so many 'post card 'scenes. The pop songs of the 50s used blended perfectly with the film, and also had one of the most lovely and very memorable soundtracks too written by Marc Shaiman. I must recommend this film to all who have not yet seen it. It scores a 10 on the 'weepie' scale too so be warned !!",
         "There was something that compelled me to see this movie. I don't know what it was, maybe subliminal messages in the TV ads or something. After all, why would I watch a movie like this when some of my favorite films are \"Blood Sucking Freaks\", \"Nekromantik\", and \"Cutting Moments\"? Anyhow, I eventually rented this movie and watched it, and to my surprise, I really enjoyed it. The story was very well acted, well written, and tear-jerking. Sure, there were a FEW flaws, which was why I rated it with an \"8\", such as some ridiculous, unrealistic plot twists, and the film's attempt to be TOO upsetting. It was like the director/writer said \"All right. We're gonna make this film for the sole purpose of having our viewers cry, dammit! And we're not just gonna have 'em cry once, we're gonna MAKE them cry THROUGHOUT THE ENTIRE LENGTH OF THE MOVIE! And they're gonna like it, dammit!\" (Not that I cried THIS much, but you can tell they obviously tried.) All in all, a good film that shouldn't be avoided.",
         "This film is a coming of age piece about a young man with obvious disadvantages that would have beat down most people. Yet he manages to find God's plan for him while showing those who doubted him that he had the right stuff all along. There are other subplot misdirections but that is the main thrust. Ian Smith, who plays the title lead, is very small in stature, but he has giant talents. I'm surprised he hasn't been cast in other films yet. An engrossing, sometimes funny and sometimes sad film that I found to be remarkably well made. Everyone involved should be proud of it. One of the better little films I've seen lately and frankly it is better than some major films release lately. Very pleasantly surprised when I stumbled onto it on WGN and plan to view it again uninterrupted on DVD as soon as I can. Why haven't I heard of this film before? An excellent screenplay, skillful direction, plus tight period music, art direction and wardrobe add up to a great early 60's feel. Natural editing, good casting, clear sound even during the big exciting scenes show this to be a well made film all the way around. This is a film for adults about guys growing up physically and emotionally. This is not suitable for children under 18. Not because there is something they shouldn't see in this movie, but instead because they just won't get it. I saw it last night and I'm still chuckling to myself now and then about the Christmas play scene. Thanks to all involved for making a really, really good movie! It has some laughs, but also made me stop to question what God's plan for my life might be. It restored some of my faith that He does have a plan for those of us who are willing to give Him a chance to lead us to our opportunity to become His instrument. If none of that makes sense to you, you haven't seen this movie!",
         "A film of many charming features, indeed, but what struck me as the most impressive quality of it, was its delicate balance between comedy and tragedy. Strolling ahead on a tight rope, with abyss on either side - that of despair and that of burlesque - and never falling. It even succeeds in a most daring balance between pity and parody. Portraying a boy with such a severe physical handicap, and with terrible parents at that, would normally tie any director's hands and feet, and the result would be sweet, at best. In this film, though, we are even allowed to smile at the odd clashes between the normal and that which is not, and laugh at the situation comedy evolving. The result is endearing, truly compassionate. And the acting is tremendous, especially from Joseph Mazzello and Ian Michael Smith, the two boys in a very odd couple friendship. Mazzello is breathtaking in scenes of such emotional complexity that most actors would be wise to find an easy way out. I have no idea how he does it, but certainly it is by talent - no schooling gives that kind of tools. The plot is overly complex, with several 'deus ex machina' events uncalled for, et cetera - probably in fear that the skilled balance of the film and the nerve of the acting would not suffice. But they do, and then some.",
         "A lad with stunted growth who holds out with brave optimism and sheer good-naturedness is able to go through school life and survive any antagonisms with aplomb, indeed, forging an inseparable friendship, as he approaches his twelfth and fatal year. Beautifully told story, with excellent photography and good music keeping just the right atmosphere, this is a film which might have some downgrading it to a simple `tear-jerker' and reaching for inexhaustible supplies of paper-handkerchiefs. But the story-line is more subtle and more carefully played out, such that in effect the film does not even try to pull out any angst from those softer-at-heart: the acting itself - especially that of Ian Michael Smith - and the focussing of the story rises above this. However, this is of course a `feel-good' story, though the end might leave you thinking otherwise. Once again, how nice to see an attractive film without violence or sex being the main protagonists. I would not mind trying to find the book................",
         "When i watched this movie it was the most moving,movie ever. the ending of the movie was the so sad but happy at the same time. i loved how Simon asked Joe if he could go before passing away, it was so beautiful, to me it showed the loyalty that the boys had for each other. the way that the boys were they for each other no matter what and were best friends forever was really inspiring to me.this really opened my eyes to see people for what they r on the inside not on the outside i love it!! its the best movie ever!! I'm even buying it so i can watch it over and over again!!",
         "There are a lot of people who will see this and probably not understand its message,but then again there are a lot of people who will see it and realize movies such as this come along very rarely.Simon Birch is a man within a boys body with a specific purpose and a simple message for mankind.You see,Simon is a little different from other boys his age,but then again,so was all of God's chosen.He's a little of all of us to be sure,yet he has one thing that few have.Simon is blessed with unmoving,solid as the rock its founded on FAITH.Nothing anyone says or does will change this.He will be picked on,poked,prodded,and teased but this fact will ever remain.The brotherly love that bonds Simon and his best friend will remind you of times long thought forgotten and memories you will treasure always.Its rare indeed that a movie will make you laugh,cry,and otherwise feel that true love for life and mankind exists in this world as it is today.This movie is that special.Just like Simon."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Hollywood Pictures",
         "Caravan Pictures"
      ],
      "summaries": [
         "Simon Birch tells the story of Joe and Simon's heart-warming journey of friendship. Simon Birch was born with a condition that makes him much smaller than all the other kids in town. Now, due to his condition, Simon thinks God made him this way for a reason and highly believes in God. Together, Joe and Simon go on a journey of trust and friendship to find the answers to many things. Their friendship is put to the test when some unfortunate events happen.",
         "Simon Birch believes that God made him for a special, heroic purpose. Simon and his best friend Joe Wenteworth are both outcasts in their tiny New England town: Joe is the illegitimate son of the town beauty, and Simon, at age 12, is so small that he still plays the infant Jesus in the church Christmas pageant. In the summer of 1964, friendship is put to the test when Little Leaguer Simon hits a foul ball that strikes and kills Joe's mother. Together, they try to find out who Joe's father is. Just as they succeed, the time comes for Simon to fulfill the destiny he believes in. A situation arises that demands a hero - a very small hero.",
         "A young boy with stunted growth is convinced that God has a great purpose for him."
      ],
      "budget": 30000000
   },
   "movielensId": 2236,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-11",
      "dvdReleaseDate": "2003-03-20",
      "directors": ["Mark Steven Johnson"],
      "runtime": 114,
      "movieId": 2236,
      "title": "Simon Birch",
      "mpaa": "PG",
      "actors": [
         "Ashley Judd",
         "Ian Michael Smith",
         "Joseph Mazzello",
         "Oliver Platt",
         "David Strathairn",
         "Dana Ivey",
         "Beatrice Winde",
         "Jan Hooks",
         "Cecilley Carroll",
         "Jim Carrey",
         "Sean Flynn"
      ],
      "imdbMovieId": "0124879",
      "originalTitle": "Simon Birch",
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["8qEgAxV1wpQ"],
      "plotSummary": "Simon Birch tells the story of Joe and Simon's heart-warming journey of friendship. Simon Birch was born with a condition that makes him much smaller than all the other kids in town. Now, due to his condition, Simon thinks God made him this way for a reason and highly believes in God. Together, Joe and Simon go on a journey of trust and friendship to find the answers to many things. Their friendship is put to the test when some unfortunate events happen.",
      "tmdbMovieId": 22796,
      "avgRating": 3.45435,
      "releaseYear": "1998",
      "numRatings": 2059,
      "posterPath": "/wB6JV6KflRFoNpVnJxR99fhgTJ3.jpg"
   }
}