{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "running",
            "id": 795
         },
         {
            "name": "olympic games",
            "id": 2070
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "athlete",
            "id": 10456
         }
      ],
      "imdb_id": "tt0119934",
      "video": false,
      "title": "Without Limits",
      "recommendations": [
         30709,
         22976,
         59820,
         41971,
         98130,
         38560,
         69007,
         43345,
         57248,
         19317,
         63339,
         26306,
         36196
      ],
      "backdrop_path": "/afhvTGkI9C4o13ACVAVPirQbhKg.jpg",
      "revenue": 777423,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Steve Prefontaine",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e33",
               "name": "Billy Crudup",
               "profile_path": "/pYblSarjmmIUggmOafanD2yk0Zj.jpg",
               "id": 8289,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bill Bowerman",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e37",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mary Marckx",
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016e3b",
               "name": "Monica Potter",
               "profile_path": "/eHLvw07VvLiqDkacrsMhMj2lNzp.jpg",
               "id": 2140,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frank Shorter",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e3f",
               "name": "Jeremy Sisto",
               "profile_path": "/o2FDlQQWOxF18Bq6hDvhiQZE8i9.jpg",
               "id": 23958,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Roscoe Devine",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e43",
               "name": "Matthew Lillard",
               "profile_path": "/gJsQkX20g0ABquHqVpBJzMXR2JF.jpg",
               "id": 26457,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bill Dellinger",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e47",
               "name": "Dean Norris",
               "profile_path": "/owIr4b4VIlJu0m6Drofd3P0qDl5.jpg",
               "id": 14329,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Kenny Moore",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e4b",
               "name": "Billy Burke",
               "profile_path": "/yA94PNmskOX0toimPss6aTHPgKO.jpg",
               "id": 21029,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Don Kardong",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e4f",
               "name": "Gabriel Olds",
               "profile_path": "/rsPF64LgMNaWQ3eoDUjZoyoMI9r.jpg",
               "id": 106435,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Barbara Bowerman",
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016e53",
               "name": "Judith Ivey",
               "profile_path": "/AbliRxEkGlefUossjUxvzHF2s3b.jpg",
               "id": 19239,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Bob Peters",
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e57",
               "name": "William Mapother",
               "profile_path": "/dEfuqLZOo5YfPcOJUftPq1q3hFL.jpg",
               "id": 15338,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Iowa's finest",
               "gender": 1,
               "credit_id": "52fe443ac3a368484e016e6d",
               "name": "Amy Jo Johnson",
               "profile_path": "/2LFQRA8ffefyDeOrK7QYzO5pCxF.jpg",
               "id": 56895,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Coed #1",
               "gender": 0,
               "credit_id": "58bc7620c3a368664d04083f",
               "name": "Katharine Towne",
               "profile_path": "/33AK0lDtxIhh7125JC7daDWMSkC.jpg",
               "id": 15012,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e5d",
               "name": "Robert Towne",
               "profile_path": "/hF5R8kmpreIZsv47mIYzDN5XX2Q.jpg",
               "id": 11057,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe443ac3a368484e016e63",
               "name": "Kenny Moore",
               "profile_path": null,
               "id": 588114,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe443ac3a368484e016e69",
               "name": "Robert Towne",
               "profile_path": "/hF5R8kmpreIZsv47mIYzDN5XX2Q.jpg",
               "id": 11057,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "59476a2c9251413ff4038c11",
               "name": "Conrad L. Hall",
               "profile_path": "/fGWnmu9EAYqX974sP0ddkOjgVEy.jpg",
               "id": 8217,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "59f3ae14925141223b01c164",
               "name": "Tom Cruise",
               "profile_path": "/3oWEuo0e8Nx8JvkqYCDec2iMY6K.jpg",
               "id": 500,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.349928,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22256,
      "vote_count": 24,
      "budget": 25000000,
      "overview": "The film follows the life of famous 1970s runner Steve Prefontaine from his youth days in Oregon to the University of Oregon where he worked with the legendary coach Bill Bowerman, later to Olympics in Munich and his early death at 24 in a car crash.",
      "similar": [
         13416,
         9655,
         9291,
         22881,
         8923,
         2300,
         10637,
         42888,
         227306,
         323677,
         4942,
         9763,
         10474,
         9563,
         2323,
         86130,
         5925,
         1374,
         612,
         9390
      ],
      "original_title": "Without Limits",
      "runtime": 117,
      "poster_path": "/3l6XZ9N9hOzVgXTsI2uYVFK0UPX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cruise/Wagner Productions",
            "id": 44,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-09-11",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "PRE. The way he competed. The way he lived his life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Towne"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "Robert Towne",
         "Kenny Moore"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119934/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4MTk3NTEwOV5BMl5BanBnXkFtZTcwNTQ0NTcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Billy Crudup, Donald Sutherland, Monica Potter | See full cast and crew »"],
      "reviews": [
         "Jaded by Hollywood's usually pathetic efforts to portray the real world of sports, I was prepared to be disappointed by this movie. I grew up in Oregon, attended U of O (the setting for much of the movie), and witnessed some of the events portrayed. So it was with a surge of satisfaction that I watched this movie that got it right at each point along the way. The attention to detail was astounding, and the recreation of races was uncanny - I compared it to actual news photos later, and the actors playing competing runners were chosen so well that their bodies and running styles actually match the original men. When a movie cares this much about being faithful to details, you can be sure it will take a quality approach overall. Billy Crudup's portrayal of Pre is full of inner fire and consistent with the real man; Donald Sutherland is marvelously powerful and yet understated as Bill Bowerman; the examination of the real reasons athletes compete is thorough and moving. Innovative use of music and camera work brings the race scenes to life, and if this movie doesn't make you want to immediately go out for \"a quick ten,\" you're a completely hopeless sedentarian-- in heart and body. This is among the five finest movies about athletics ever made.",
         "Though I liked PREFONTAINE, Steve James' version of the same story, this is much better. That was straightforward biography, where this captures the poetry of running (James' film was prose, this is poetic). As he proved with PERSONAL BEST, Robert Towne understands the nuances of track and of athletes. Crudup is excellent as Steve Prefontaine, and even looks like a runner. And Sutherland gives the performance of his career as Bill Bowerman. I truly hope it lands him an Oscar nomination. I also hope Towne gets to direct more often, as all three films of his are winners.",
         "I grew up in Eugene and saw almost every race Pre ever ran. He was a crowd hero. There were always two races...the one Pre ran and the one, way back, that the rest of the runners ran. There was nobody like him. He was talented, cocky and had so much charisma. He really was outspoken in the press and took no guff from the AAU. He was the best thing that ever happened to track. Seeing the movie was like deja vu. It was a really well done recreation of what it was like to be at Hayward Field during his races. I went to the memorial service at Hayward Field and saw Frank Shorter and Bill Bowerman speak. This movie certainly made me reflect back!",
         "This is definitely one of the best sports movies ever made as well as one of the most unnoticed movies of 1998. Strange really, because \"Without Limits\" is an amazing story about Steve Prefontaine. I didn't know it was a biographical movie up until it showed the Olympics. So when I realized that the main character really ran like the wind and had no physical obstacles he couldn't overcome I instantly became an admirer of Steve Prefontaine. Billy Crudup, who truly stole every scene \"even\" in \"Almost Famous\" is brilliant as Steve Prefontaine. His amazing transformation into the role of America's fastest runner was absolutely amazing, and I had no idea who the actor was, I only vaguely remembered his name. Donald Sutherland delivers his performance of the decade and the very beautiful Monica Potter does a great job as well. The subtle manner in which the director chose to display Pre's life is admirable and very touching. He truly was a role model. He's a role model to me now, more than 30 years later. When he was explaining his running logic to his coach I really understood his look on life. He wasn't planning on being disappointed, he went the distance. There's one more thing this movie deserves immense credit for. It made me want to run. AND ACTUALLY ENJOY IT!!!!!!! A brilliant movie that made me think about my life. 8/10",
         "Having run track competitively, I had a special interest in this film and I was not disappointed. This film dramatized the life of Steve Prefontaine, a pre-eminent U.S. distance runner in the 1970's. Though some of the details of his life were fudged for dramatic purposes, the essence of Prefontaine was preserved, namely his brash egotistical style of running and living. In addition to its realism regarding the sequences filmed on the track, this film gives a good account of the psychology of running. Robert Towne did a fabulous job overall with this film, but especially with the realism of the scenes on the track. The dramatic element, focusing on character development of Prefontaine as a person as well as a runner was also well done, elevating it above your typical sports documentary and improving its entertainment value. Billy Crudup gives a fine performance as Pre. He captures the arrogance and the crushing disappointment of his life. He was also terrific in the running scenes. Donald Sutherland was also great as Coach Bill Bowerman. Sutherland played the part with the perfect balance of patient guidance and frustration as Pre continued to ignore his prudent advice. It was as if he were trying to guide a lightning bolt. This was an excellent sports story. I rated it an 8/10. Even for those who are not fans of track and field and never heard of Steve Prefontaine, this is an entertaining and absorbing film.",
         "I've never been quite sure, whether it was Personal Best that strongly attracted Robert Towne to running, or that he was already a big fan when he began that project. Suffice it to say that when one of our greatest living screenwriters brings his personal passion to his work, the results will be exemplary. \"Without Limits' only became a movie, because Tom Cruise said so, and thankfully he did. Where as the other Prefontaine bio-pic \u0091Prefontaine' provided an honest, technical look at Pre's life and the sport of running, `Without Limits' is more of a lyrical homage to the sport, the man, the zen of it all. The performances seamlessly intermesh with the story-Donald Sutherland is good, as Coach Bill Bowerman, but Sutherland is always good..and I believe his performance here has gotten more recognition as a result of the way Towne has organized his version-the Bowerman role is centerpiece, in contrast to the more downplayed, subtler roles of the other principals. Let Robert Towne do whatever he wants, I will come and watch.",
         "I have always been a huge fan of Robert Towne ever since I first saw Chinatown. I haven't seen a disappointing film of his other than Mission: Impossible 2, Without Limits was far from a letdown. I'm not sure how much poetic license Towne used to make the film, for I never have been a fan of running or any other athletics and so have never really known anything about the characters, but like in the cases of The Insider or Quiz Show I truly don't care as long as he didn't get too muddled up in fiction. The story is well told with great performances and a superb soundtrack, the greatest treat of all being Donald Sutherland's fantastic performance as Bill Bowerman. This bit of acting makes me wonder how once again Sutherland could be forgotten by the Oscars. With a career including such great roles as in M*A*S*H, Klute and Ordinary People, the fact that he is still cheated of even a nomination bewilders me, especially when this film came in a year where the only true competition for such a performance was Geoffrey Rush's scene stealing work in Elizabeth. (To all of you who agree with James Coburn's win, I haven't seen Affliction.)",
         "This movie truly handled the true life story of Steve Prefontaine with care. The photography was stunning. It was filmed on location in Eugene Oregon. Tom Cruise Produced the picture and his choice for director was key. Robert Towne Directed and co- wrote the screenplay. Most people think of Mr. Towne as a writer. His movies include the screen play for Mission Impossible and the Classic, China Town. China Town brought him both the Oscar and the Golden Globe for best Original Screenplay. He has directed very few films over the years but the fit for this project was on the mark. Steve Prefontaine was a larger then life figure. To tell his story right Robert really had to do his home work. He chose to film the actual locations surrounding Prefontaines life. This really gave it a realistic feel. To see the actual track where Steve broke almost every long distance record on the books. The track where he was never defeated. That had a lot of meaning. Just a side note: This track today, is the site of the Pre- Classic. It's one of the worlds biggest track events of the year. The worlds top track and field star's take part in this event. I had the good fortune to play an extra in this film. I owned a 1965 Pontiac. Warner Brothers was scouting out some car shows and asked if they could use my car in the movie. ( you can see it in the outside scene in front of the bar called, The Pad). Later I was asked If i would like to appear as an extra. Of course i said yes. After a long shoot the director, Robert Town came over and asked me to go to makeup. He had a scene for me. I was to appear with Billy Crubup, who played Steve Prefontaine and Monica Potter who played Mary Marchx his girl friend. Although the scene was cut from the movie, i got to meet some wonderful people. I had breakfast with Billy who turned out to be a warm person and later met Monica who seemed to be lonely during the long down times between takes. As i was moving my Pontiac on the set, Donald Sutherland who was going over his script for an upcoming scene, came over to me and told me how much he like my car. I showed him around and he seemed interested. He was really a great guy. I bring all this up to point out that a lot of wonderful people who took pride in their craft came together and put out a wonderful picture. If you haven't seen it, watch it I know you will enjoy it.",
         "A fascinating and unique story of the legendary American distance Steve Prefontaine, who is portrayed here by Billy Crudup. To be honest here, I haven't seen the other film that was based on Pre's life (\"Prefontaine\"). This film places the majority of its' attention solely on the relationship between Pre (Crudup) and his coach in college and the Olympics, Bill Bowerman (Donald Sutherland). Like Crudup, Sutherland is near perfect here and should rank as one of his best performances. The monologue that Sutherland gives after showing television news footage of the infamous massacre that tarnished the Summer games in Munich is just...flawless. Monica Potter is fine here as the girl who Prefontaine had the most interest in. Look for director William Friedkin appears early in the movie in a small role. The film's director/co-writer, Robert Towne is wise in how to handle the drama and tension here and shows what a genius he is. Now that I look back at the film, I wonder if there'll be another great distance runner to come from the U.S.. The answer might come in Alan Webb? I don't know.",
         "While I did not know Steve Prefontaine personally, I am the age he would be now and I remember him and the incredible records he set, as though it happened yesterday. I routinely devoured the sports pages to read anything about him. And, from all that I do remember, this film was made based on truth. It was also extraordinarily well-cast and well-acted. Donald Sutherland is the consummate character actor, literally BECOMING Bill Bowerman. Billy Crudup, as well, WAS \"Pre\"! And he has a stunning future (he was great in \"Almost Famous\"). I would like to see more of Monica Potter, who is quietly making a name for herself. I enjoyed the reality of the script by Robert Towne and Kenny Moore. And Towne's direction assured that no one overacted, as I believe occurred in another docu/film on the same subject recently. The cinematography made me yearn for Oregon once more, and the editing, as it is supposed to do, completed the work with its continuity: I never felt as though I wasn't brought naturally from one scene to the next. I have seen this film a half-dozen times and could watch it again and again - if only for the \"race\" footage! Steve Prefontaine, after all, was this country's best middle and long distance runner, and moreover, its quintessential athlete - American to the core."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["Cruise/Wagner Productions"],
      "summaries": ["The film follows the life of famous 1970s runner Steve Prefontaine from his youth days in Oregon to the University of Oregon where he worked with the legendary coach Bill Bowerman, later to Olympics in Munich and his early death at 24 in a car crash."],
      "budget": 25000000
   },
   "movielensId": 2237,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-11",
      "dvdReleaseDate": "1999-02-16",
      "directors": ["Robert Towne"],
      "runtime": 117,
      "movieId": 2237,
      "title": "Without Limits",
      "mpaa": "",
      "actors": [
         "Billy Crudup",
         "Donald Sutherland",
         "Monica Potter",
         "Jeremy Sisto",
         "Matthew Lillard",
         "Dean Norris",
         "Billy Burke",
         "Gabriel Olds",
         "Judith Ivey",
         "William Mapother",
         "Amy Jo Johnson",
         "Katharine Towne"
      ],
      "imdbMovieId": "0119934",
      "originalTitle": "Without Limits",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["e8s5DJBDjnA"],
      "plotSummary": "The film follows the life of famous 1970s runner Steve Prefontaine from his youth days in Oregon to the University of Oregon where he worked with the legendary coach Bill Bowerman, later to Olympics in Munich and his early death at 24 in a car crash.",
      "tmdbMovieId": 22256,
      "avgRating": 3.64269,
      "releaseYear": "1998",
      "numRatings": 431,
      "posterPath": "/3l6XZ9N9hOzVgXTsI2uYVFK0UPX.jpg"
   }
}