{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "concentration camp",
            "id": 1631
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "naples",
            "id": 4648
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "army",
            "id": 6092
         },
         {
            "name": "thief",
            "id": 9727
         },
         {
            "name": "honor",
            "id": 9812
         },
         {
            "name": "german officer",
            "id": 11122
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "1940s",
            "id": 207883
         }
      ],
      "imdb_id": "tt0075040",
      "video": false,
      "title": "Seven Beauties",
      "recommendations": [
         32700,
         16939,
         29451,
         34783,
         132263
      ],
      "backdrop_path": "/1U7dtvbg4JxGj9w3Udea5X6Yk4m.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Pasqualino Frafuso aka Settebellezze",
               "gender": 2,
               "credit_id": "52fe46549251416c91050f8d",
               "name": "Giancarlo Giannini",
               "profile_path": "/tIUO3sO3wIuxGNAlZ1c7zMySln3.jpg",
               "id": 3753,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Pedro the Anarchist Prisoner",
               "gender": 2,
               "credit_id": "52fe46549251416c91050f91",
               "name": "Fernando Rey",
               "profile_path": "/2NlOtYEeJjzLUJWQmsB12w3nTM8.jpg",
               "id": 14821,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Commandant",
               "gender": 1,
               "credit_id": "52fe46549251416c91050f95",
               "name": "Shirley Stoler",
               "profile_path": "/cRMsHh1giZv4ha5tSeXmHBu0LDQ.jpg",
               "id": 67513,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Concettina, a Sister",
               "gender": 0,
               "credit_id": "52fe46549251416c91050f99",
               "name": "Elena Fiore",
               "profile_path": "/cWZ2s7QKXLm9s7TOC6Vjck0VIzN.jpg",
               "id": 33929,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Francesco - Pasqualino's comrade",
               "gender": 0,
               "credit_id": "57f16c4f9251415c17003e3d",
               "name": "Piero Di Iorio",
               "profile_path": null,
               "id": 1688231,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Don Raffaele",
               "gender": 0,
               "credit_id": "57f16c579251414abf001f47",
               "name": "Enzo Vitale",
               "profile_path": null,
               "id": 1688232,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46549251416c91050f65",
               "name": "Franco Fraticelli",
               "profile_path": null,
               "id": 52258,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46549251416c91050f77",
               "name": "Giancarlo Giannini",
               "profile_path": "/tIUO3sO3wIuxGNAlZ1c7zMySln3.jpg",
               "id": 3753,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c91050f7d",
               "name": "Lina Wertmüller",
               "profile_path": "/baT0AuD8ZfRlR3R6zNJloBa1n2x.jpg",
               "id": 26265,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c91050f83",
               "name": "Lina Wertmüller",
               "profile_path": "/baT0AuD8ZfRlR3R6zNJloBa1n2x.jpg",
               "id": 26265,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c91050f89",
               "name": "Lina Wertmüller",
               "profile_path": "/baT0AuD8ZfRlR3R6zNJloBa1n2x.jpg",
               "id": 26265,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46549251416c91050f9f",
               "name": "Arrigo Colombo",
               "profile_path": null,
               "id": 16321,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57f16c249251414abf001f2f",
               "name": "Enrico Job",
               "profile_path": null,
               "id": 29913,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "57f16c2ec3a3683f2000c840",
               "name": "Veljko Despotović",
               "profile_path": null,
               "id": 1537245,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "57f16c349251414ab3001f8f",
               "name": "Roberto Granieri",
               "profile_path": null,
               "id": 1613418,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "57f16c0a92514141ee0129c9",
               "name": "Tonino Delli Colli",
               "profile_path": "/eZiIxNxmEJPLWsGokFX98IcgdF2.jpg",
               "id": 2361,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57f16c1b9251414ab3001f85",
               "name": "Enzo Jannacci",
               "profile_path": "/ovZhBoKXEH8suQzieCtsejttCp5.jpg",
               "id": 117950,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57f16c3ac3a368684b001b10",
               "name": "Enrico Job",
               "profile_path": null,
               "id": 29913,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.928838,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 37550,
      "vote_count": 13,
      "budget": 0,
      "overview": "Nominated for four Academy Awards including Best Director, Seven Beauties stars Giancarlo Giannini (Swept Away) as Pasqualino Frafuso, known in Naples as \"Pasqualino Seven Beauties.\" A petty thief who lives off of the profits of his seven sisters while claiming to protect their honor at any cost, Pasqualino is arrested for murder and later sent to fight in the army after committing sexual assault. The Germans capture him and he gets sent to a concentration camp where he plots to make his escape by seducing a German officer.",
      "similar": [
         369885,
         289,
         637,
         14574,
         857,
         227306,
         424,
         228150,
         11287,
         746,
         821,
         676,
         205584,
         19913,
         16869,
         4421,
         5925,
         2253,
         613,
         423
      ],
      "original_title": "Pasqualino Settebellezze",
      "runtime": 116,
      "poster_path": "/sjzvTaFHalbCKDJrHcvjb3WpeI5.jpg",
      "spoken_languages": [
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Medusa Distribuzione",
         "id": 15868,
         "origin_country": ""
      }],
      "release_date": "1975-12-20",
      "vote_average": 8.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lina Wertmüller"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Lina Wertmüller"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0075040/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk3MzcwMjE0MF5BMl5BanBnXkFtZTcwMzc1NjUzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Giancarlo Giannini, Fernando Rey, Shirley Stoler | See full cast and crew »"],
      "reviews": [
         "I would challenge any serious film lover to view this movie and not have a very strong opinion of it. My own opinion is that it's one of the best films ever made, period. The story is harrowing, the score is so haunting you'll never forget it, and you'll think about scenes from it years later. Once you viewed it, most other domestic stuff won't even make it into the ballpark with it, much less compare with it. It's a masterpiece, plain and simple. This is real film making.",
         "Seven Beauties is a masterpiece that holds up as well now as it did 20 years ago. Pasqualino is a character whose life is shaped by a shallow, macho, code of honor. He continually swears to live his life by this code and to force the family to live up to this standard. He is broken hearted when he must abandon his \"man of honor\" image in order to escape hanging. Without his standards, miserable as they were, Pasqualino survives by instinct alone. His character contrasts with the people that he meets when he is interred in a concentration camp. Most of the time he is so consumed by a his desire to live that he can't focus on or misunderstands the important things they try to tell him. Although this sounds like a very dour movie, it is saved by the way Lina Wertmuller constructs the story. It is a non-linear narrative, with a word or phrase triggering a flash back for Pasqualino. The music is extraordinary. The concentration camp scenes are horrifying (with Wagner opera as the musical theme) and the scenes set in Naples are sunny and beautiful but not overblown. You see the frayed edges of a poor town, although they're bathed in the mediteranean sunshine. Pasqualino sums it up best when he says, \"A rotten comedy, a lousy farce . .. called living.\" Lina Wertmueller made a wonderful comedy, a masterful farce . . . called Pasqualino Settebellezze.",
         "I wish you could put this movie under the English title of Seven Beauties so it would be more accessible to people. This is one of the best movies ever made and more people should see it. I was in a state of awe from beginning to end. How could someone make a movie like this? It is hard for Americans to understand this kind of existence because we never have had to experience anything like it. Lina Wertmuller has made a movie about the human condition that our ancestors fought to protect us from having to face. If you want light-hearted entertainment, stay away, but if you want to see just what it took to live through the horror of war, you must see this movie.",
         "Lina Wertmuller had a brief moment in the spotlight back in the mid-seventies, mostly due to the impact of three of her films: \"Love and Anarchy,\" \"Swept Away,\" and \"Seven Beauties.\" Although her career took a nose-dive shortly thereafter, \"Seven Beauties\" still stands as her best film, and also one of the best films of its era. Giancarlo Giannini gives a compelling and hilarious performance as Pasqualino Settebellezze, an Italian hood who is sent to prison after killing his sister's lover. He fakes insanity, gets sent to an institution, escapes by joining the military, deserts, gets caught, and is put in a concentration camp. There, he seduces his grotesque female camp commander in order to survive. Giannini makes his character wholly believable, and his presence on-screen (in nearly every scene) keeps the story going from one plot twist to the next. His character has a bumbling, comic presence to him, but also a certain amount of craft and sophistication. Wertmuller creates a story that works both as slapstick and anti-war drama. Her direction is tight and controlled, and she doesn't flinch away from depicting the brutalities of Nazism. Parts of the film may seem like forerunners of the \"gross-out\" gags that have populated cinema in recent years, but these moments are actually used to show how the Nazis degraded ordinary innocents and demoralized the world around them. The most interesting aspect of the story is the way Wertmuller compares Hitler's tactics to those of the underground mafia; the Nazis, in the end, come off as hypocritical for persecuting Pasqualino for his crimes. Pasqualino may be a slovenly thug, but placed next to even the lowest-ranking of Hitler's cronies, he's a knight in shining armor.",
         "I saw this film in the late 70's and ran the entire gambit of emotions while viewing it. I never thought I could laugh at such violence and at the hideous Nazi acts of the concentration camps and at the same time feel like heaving my guts on the theatre floor. I am going to have to track down a DVD of this movie to watch it again. As good as Shindlers list was, I found it pale by comparison to \"The seven Beauties\". It is a wild ride and I can not recommend this film highly enough. What disturbs me is that I have yet to talk to another person who has seen this movie. And a side note: Madona should be crucified for remaking Swept Away. Charlie",
         "I saw \"Seven Beauties\" when I was in college back in 1976. It immediately became my favorite film and stayed that way for 20 years. Now that I am older, I have moved it down the list a bit, but I still love it. I especially love the music and the music scenes. For 20 years I searched for a soundtrack album but never found it. Finally, my brother recommended the obvious: rent the movie and copy the music to an audio tape. The music I am thinking of is in three scenes: the opening montage with the \"Oh, yeah\" song (which works much better in Italian--don't bother with the dubbed version); the strolling/strutting around the town scene (music only, no lyrics, no dialogue); and the court scene (music only, no lyrics, no dialogue). Those three scenes will stay with me the rest of my life.",
         "I've watched this movie dozens of times in the last thirty years and it's still a treat. I just bought the new DVD version and I'm in love with Lina again. It's a roller-coaster ride with scenes of the grotesque against visions of sublime beauty. And, Thank You, Lina, for the courtroom scene of poignant conversation without words. The theme of the movie is simply that we too often accept survival as an excuse to abandon honor, integrity and fundamental humanity. There is a leftist tone that may put some off but that shouldn't detract from the basic message. The simple message is told with flawless visuals, hypnotic music and acutely fine acting. Please enjoy this important part of cinematic history.",
         "I watched this film just recently all the way through, having watched just a part of it years before. I kept thinking of \"Life is beautiful\" and how upset I was with that film. By upset I mean disgusted with the premise. I could not imagine what that film wanted me to. Seven Beauties goes back to the exact same landscape and arrives at a completely different portrayal. I must confess that I consider Giancarlo Giannini to be one of the greatest actors ever to appear on film in any language. His style is different than say Al Pacino, Robert DeNiro or Jack Nicholson. With Giannini what always blows me away is what he can do with his eyes and simple facial gestures. Take for example the scene where in this film he is in court awaiting the sentence for murder. His eyes catches those of a young woman he had met in the street and with whom he does a light hearted bit of flirting. Their eyes meet and entire paragraphs of dialog go back and forth between them and not a word is spoken. I was just dumbfounded. Who acts this way anymore? Just about no one. His style often reminds me of the silent greats like Chaplin (in particular) who had to emote through their faces because the audience could not hear them speak. What is this film about? Is it just an anti-Nazi rant? Not really. Wertmuller at her best, had a full palette of dramatic colors splashing about and this is perhaps her best movie. Pasqualino Frafuso as a character is both hilarious, a complete puff-ball of inflated over confidence, a sole defender of his down and out family's honor and much more. As a bumbling tough-guy-wannabe, he manages to get himself into an insane asylum; perhaps the central motif of the entire movie. He moves from one insane chapter into another. (Major spoiler)...as a survivor, we are not sure what state of mind or soul he is in when he comes back to his family. There is a key element of the dialog mirroring the directors social ethos. When Pasqualino and another Italian soldier witness German soldiers killing (what they presume) are Jews and dumping their bodies into mass graves) and in fleeing the scene the other soldier is gripped with a terrible sense of guilt...we must take note of a key message. Should we turn away when gross injustice is done to our common man or should we protect ourselves with the certainty of silence? The concentration camp scenes are very harrowing but what is incredible in this film is that despite the utterly bleak reality, we can laugh a just a little bit. It is a macabre humor, very black and teetering on a dream like quality. I am reminded of some scenes in Fellini's \"Satyricon\". The German commandant is a woman (most unlikely in real life) and is depicted in an over the top portrayal of life hating, totally unattractive female, who is all too aware that her war is going to wind down and she is on the loosing side. She absolutely hates the Italians she has to incarcerate and she barbarically enjoys killing them at random. That Pasqualino decides that he can seduce her is both comical and very sad at the same time. That he succeeds is beyond his or our own vivid imagination. The one thing he knew for sure was that as a very unattractive woman she most certainly was starved for sexual gratification, even if it must come from someone she hated and loathed. That is the deal with the devil he plays in order to eat and survive. Did he sell his soul to the dark side at this point? We do not get a clear answer and that is another strength in the drama. Wertmuller is telling us that there is always much more gray than colored outlines when we look to define moral limitations, and the choices made under enormous duress. What would we do to survive such hell? Are we so sure we would not lower ourselves to ANY level in order to survive? Many did and that is her point. We are not encouraged to take sides and judge. We are reminded that life sometimes takes over and we are washed away in currents much stronger than our simple moral and ethical compass we felt so sure of as a younger person. Ultimately this film satisfies as a monumental drama on so many levels. Pasqualino's sisters and mother (as actors) are outstanding, especially the eldest sister, who is made to look more ugly than ugly. The struggle to find a place in life with the burden of such horrid looks is held up in a severe way; however, we are also aware that it is over done and very exaggerated. Like some fulsome opera drama, her struggle to find safety, financial freedom and social esteem mirror the struggles of millions of others in the lower, working classes. A very familiar theme in Italian cinema. That her brother, another who felt himself to be an ugly duckling, manages to reach his own level of self-sufficiency, at the cost of hell on earth, ties a very nice parallel to her own travails. A family touched by tragedy on many levels, they miraculously survive the war intact. Seven Beauties is worth many viewings. A richly textured, very well written drama of very intense contrasts, a perfect vehicle for outstanding acting at both comedic and dramatic heights. One of the best films I've ever seen. My personal favorite of Giannini's, equal to or even surpassing his performance in Swept Away. Perhaps Wertmullers most coherent social commentary/drama masterpiece.",
         "A wild, bleak extravaganza in which our Everyman learns to shed everything--even the honor that was the one thing he had--for survival. There's a near-perfect use of images--for example, the use of bright flowered dresses to signify that yet another sister has become a whore--and an equally perfect use of sound, silence, and music. A very, very dark comedy that is largely summed up in the opening sequence, a long litany of those who are to blame. I quote only a few lines: \"the ones who don't enjoy themselves even when they laugh. . . the ones who should have been shot in the cradle (pow!). . . the ones who have never had a fatal accident.. . the ones who have had one. . .\" Avoid the dubbed version; it's terrible.",
         "\"Seven Beauties\" opens with a strange sequence. Over horrific WW2 documentary footage, a character called Pasqualino Settebellezze recites a monologue, pausing every now and then to say \"oh yeah\" in a rather kinky voice, whilst overly romantic jazz music more suited to a low budget porn movie plays bombastically in the background. Sex, violence and self-preservation, these are the themes this introductory sequence lays down, all of which director Lina Wertmuller will approach from various angles over the next hour and a half. The film then unfolds in non-linear fashion. We see Pasqualino and his companion bumbling through a forest. Having long deserted the Italian army, they are tired and dirty, desperate for a meal. It is then that the pair witness a massacre, the German army rounding up a crowd of Jews, ordering them to get naked and then mercilessly gunning them down. The two men then have a short debate. Was it their moral imperative to intervene? Would their intervention have been useless? Is running away morally reprehensible? As the film progresses, director Lina Wertmuller increasingly argues that running away is merely a form of prostitution, the survivor selling his/her humanity for survival. Self-interest, she says, is both human nature and a form of exploitation. Paradoxically, it is this self-interest \u0096 the need to survive \u0096 which causes atrocities and enables bloodshed to continue. Those who run, in other words, support the war machine. Are complicit in its smooth efficiency. The film then jumps back in time. Pasqualino is re-introduced to us a dashing and debonair playboy who has a gift for seducing ladies. He wears a flashy suit, is always well groomed and struts about like a womanising Don Juan. But of course Pasqualino is a fraud, always showing off in an attempt to hide his own poverty. To him, appearances are everything. As such, Pasqualino is obsessed with protecting his seven ugly sisters (the seven beauties of the title), who are so desperate for money that they whore themselves out as strippers and prostitutes. Pasqualino deplores their behaviour. How dare they dishonour the family name! How dare they take part in such filth! This section of the film is thus a sort of darkly comic, domestic fairytale, the younger brother defending his older, quite unattractive sisters, against the onslaught of disrespect posed by everybody in the village. But once Pasqualino pulls a gun on a local pimp (for insulting his sister), the film shifts gears and becomes a dark tale of survival. Pasqualino goes on the run from the law, chops a body into little pieces and engages in all manners of theft, rape and pillage, all in the name of survival. The very man who condemned others for prostituting their bodies, becomes a whore to the world, doing every despicable act required to ensure his continued existence. The last half of the film literalizes these themes further. Pasqualino is captured and placed in a German concentration camp run by an evil female camp commandant (Shirly Stoler in the role that made her famous). Trapped in the camp and fearing for his life, Pasqualino must use his skills as a womaniser to seduce this embodiment of evil. And so, in one long sequence that is as funny as it is gross, Pasqualino flirts, seduces and makes love to the camp commander. The last shreds of his dignity are instantly evaporated. The film ends with Pasqualino in Italy, offering his hand in marriage to a young woman. She agrees, at which point he promptly discusses the prospect of having babies. Pasqualino wants countless children. Why? Because only through them can he ensure his survival. And so, quite despicably, life has once again found a way. Of course on another level, one can also look at Pasqualino as Italy personified, the country selling her soul to fascism in the name of personal survival. Incidentally, with \"Seven Beauties\" Wertmuller also continues her trend for inserting veiled (anti?) feminist statements in her films. The piggish camp commander is a jab at the kind of man-hating \"strong women\" who set the agenda for female equality by demeaning and undermining others. She's no better than the patriarchal power players she despises. 8.5/10 - The Italians made the best Holocaust films. Unlike the \"Allied Nations\", they experienced the Holocaust's horrors first hand, participated in its evils, and possessed the right mixture of blame, introspection, anger and disgust to represent the event truthfully. The Germans, swathed with guilt, couldn't even approach the topic until a good half a century later (until recently, Holocaust movies have come out of every country BUT Nazism's country of origin). Scapegoated and demonized, international pressure coupled with their own insecurities, Germany was prevented from seeing itself as anything other than one dimensional \"bad guys\". Note: This film was a huge influence on Italian filmmakers. Roberto Benigni's \"Life is Beautiful\" rips this picture off shamelessly whilst Coppola would base his \"Ride of the Valkyries\" sequence in \"Apocalypse Now\" on the \"Ride of the Valkyries\" sequence in this film. More interesting Holocaust films: \"Korczak\", \"The Garden of Finzi Continis\", \"Border Street\", \"Diamonds of the Night\", \"Europa Europa\", \"Fateless\", \"The Last Stop\", \"The New Land\", \"Passenger\", \"The Pianist\", \"The Pawnbroker\", \"The Wannsee Conference\", \"The Shop On Main Street\", \"The Boat is Full\"."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "productionCompanies": ["Medusa Distribuzione"],
      "summaries": ["Pasqualino, an Italian everyman, deserts the army during World War II. Germans capture him and send him to a prison camp, where he does just about anything to survive. In lengthy flashbacks, we see him and his family of seven unattractive sisters (the seven beauties), his accidental murder of one sister's lover, his confession and imprisonment, his calculated switch to an asylum, his rape of a patient, and his volunteering to be a soldier to escape confinement. To the chagrin of his obese German captor, his weak and cowardly character enables him to survive the war and return to Naples where he has a plan to survive the next world catastrophe."],
      "budget": 0
   },
   "movielensId": 2238,
   "movielens": {
      "languages": [
         "Deutsch",
         "Italiano"
      ],
      "releaseDate": "1975-12-20",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Lina Wertmüller"],
      "runtime": 116,
      "movieId": 2238,
      "title": "Seven Beauties",
      "mpaa": "",
      "actors": [
         "Giancarlo Giannini",
         "Fernando Rey",
         "Shirley Stoler",
         "Elena Fiore",
         "Piero Di Iorio",
         "Enzo Vitale"
      ],
      "imdbMovieId": "0075040",
      "originalTitle": "Pasqualino Settebellezze",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Nominated for four Academy Awards including Best Director, Seven Beauties stars Giancarlo Giannini (Swept Away) as Pasqualino Frafuso, known in Naples as \"Pasqualino Seven Beauties.\" A petty thief who lives off of the profits of his seven sisters while claiming to protect their honor at any cost, Pasqualino is arrested for murder and later sent to fight in the army after committing sexual assault. The Germans capture him and he gets sent to a concentration camp where he plots to make his escape by seducing a German officer.",
      "tmdbMovieId": 37550,
      "avgRating": 3.85795,
      "releaseYear": "1975",
      "numRatings": 616,
      "posterPath": "/sjzvTaFHalbCKDJrHcvjb3WpeI5.jpg"
   }
}