{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0073817",
      "video": false,
      "title": "Swept Away",
      "recommendations": [
         64959,
         61942,
         3982,
         64043,
         24160,
         60810,
         98120,
         216788,
         293476,
         42458,
         65332,
         105552,
         46001,
         24164,
         24382,
         48256,
         2287,
         60188,
         82805,
         33610
      ],
      "backdrop_path": "/dFXGxxVSwb9tYNfKMeFnxORmBlt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Raffaella Pavone Lanzetti",
               "gender": 1,
               "credit_id": "52fe467d9251416c910561ef",
               "name": "Mariangela Melato",
               "profile_path": "/skpCWeBKIU1vwOxLGuIxl5VniQK.jpg",
               "id": 25810,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gennarino Carunchio",
               "gender": 2,
               "credit_id": "52fe467d9251416c910561f3",
               "name": "Giancarlo Giannini",
               "profile_path": "/tIUO3sO3wIuxGNAlZ1c7zMySln3.jpg",
               "id": 3753,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Signor Pavone Lanzetti",
               "gender": 0,
               "credit_id": "52fe467d9251416c910561fd",
               "name": "Riccardo Salvino",
               "profile_path": "/wO4PvtrkdNwLSVQntbJ5TSmQSFd.jpg",
               "id": 40887,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Anna",
               "gender": 0,
               "credit_id": "52fe467d9251416c91056201",
               "name": "Isa Danieli",
               "profile_path": "/yM3HYSBkR1jUumd8v3TRlnAAJBP.jpg",
               "id": 1014911,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "un collega di Gennarino",
               "gender": 0,
               "credit_id": "59d9ed0592514124c503ca8c",
               "name": "Aldo Puglisi",
               "profile_path": "/lfyyQ5BEV8RUQTEFLzE3u0ANY6z.jpg",
               "id": 55135,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "un giornalista di sinistra conoscente dei Pavone Lanzetti",
               "gender": 2,
               "credit_id": "59d9ed84c3a368620d035c27",
               "name": "Eros Pagni",
               "profile_path": "/iEnmDm3VIZgZujGTeOc4Ospnbb.jpg",
               "id": 85648,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "una conoscente di Raffaella",
               "gender": 0,
               "credit_id": "59d9ed93925141252c03b1a0",
               "name": "Anna Melita",
               "profile_path": null,
               "id": 1114472,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe467d9251416c910561eb",
               "name": "Lina Wertmüller",
               "profile_path": "/baT0AuD8ZfRlR3R6zNJloBa1n2x.jpg",
               "id": 26265,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe467d9251416c910561f9",
               "name": "Lina Wertmüller",
               "profile_path": "/baT0AuD8ZfRlR3R6zNJloBa1n2x.jpg",
               "id": 26265,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5ac3e309c3a3682d6604533e",
               "name": "Ennio Guarnieri",
               "profile_path": null,
               "id": 26267,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e33c0e0a260c0103a7d1",
               "name": "Franco Fraticelli",
               "profile_path": null,
               "id": 52258,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e38d92514126c303a47c",
               "name": "Piero Piccioni",
               "profile_path": null,
               "id": 25321,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e3b1c3a3682d3303b905",
               "name": "Enrico Job",
               "profile_path": null,
               "id": 29913,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e413c3a3682d9a03c609",
               "name": "Romano Cardarelli",
               "profile_path": null,
               "id": 1286509,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e5460e0a260c39040682",
               "name": "Gino Zamprioli",
               "profile_path": null,
               "id": 32773,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e5e40e0a260c1403dc91",
               "name": "Luciana Maria Costanzi",
               "profile_path": null,
               "id": 1581002,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e62592514126c303a652",
               "name": "Amalia Paoletti",
               "profile_path": null,
               "id": 1585999,
               "department": "Costume & Make-Up",
               "job": "Hair Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e6530e0a260c3904074c",
               "name": "Michele Trimarchi",
               "profile_path": null,
               "id": 1586001,
               "department": "Costume & Make-Up",
               "job": "Makeup Department Head"
            },
            {
               "gender": 0,
               "credit_id": "5ac3e6bc925141272003e8fa",
               "name": "Mario Bramonti",
               "profile_path": null,
               "id": 1586005,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 4.333545,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 37916,
      "vote_count": 52,
      "budget": 0,
      "overview": "Stranded and alone on a desert island during a cruise, a spoiled rich woman and a deckhand fall in love and make a date to reunite after their rescue. He is stood up.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         10735,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         242224,
         376867,
         394117,
         17130,
         10818,
         11421,
         43923
      ],
      "original_title": "Travolti da un insolito destino nell'azzurro mare d'agosto",
      "runtime": 116,
      "poster_path": "/hnpQNKlUqpq1uCgHOtfLMJUjCvU.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Medusa Produzione",
         "id": 1702,
         "origin_country": ""
      }],
      "release_date": "1974-12-18",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lina Wertmüller"],
      "runtime": 116,
      "synopsis": "A rich, spoiled wife and a poor underclass deckhand drift away from their yacht while on a Mediterranean vacation cruise. They become stranded on a deserted island where their roles become reversed. She becomes dependent upon him for survival. By the time they are rescued, they have fallen in love. The deckhand vows to leave his family for his new love, and they set up a time to reunite. She stands him up. The film asks the question whether sexual politics are consistent between the raw natural environment vs. civilization, and which arrangement is best. These points are made more cogently than by the 2002 Madonna remake of the same title. Dialog mentions Burt Lancaster of \"From Here to Eternity\" (1953) fame, and a similar promotional image.",
      "writers": ["Lina Wertmüller"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0073817/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3MjE2MTM0NV5BMl5BanBnXkFtZTcwMDM0NjUzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Giancarlo Giannini, Mariangela Melato, Riccardo Salvino | See full cast and crew »"],
      "reviews": [
         "Back in the 1970's Lina Wertmuller was an art-house superstar. But more importantly, she was a first class original, bursting with a fresh, exciting vision. Now, here's a lively storyline: a rich, racist, reactionary female- a right wing, fascist mind in a knuckle-biting, voluptuous body -is stranded on a mid-sea desert isle with a poverty-stricken, chauvinistic, Communist male- a left-leaning propagandist in a scrawny masculine body. \"Make nice\" they don't. Well, not right off the bat. Not before much nasty invective and grievous bodily assault take place. But then afterward....ahh, afterward. SWEPT AWAY, though a foreign film, is in the manic, irreverent, well-timed tradition of Hollywood screwball comedies like THE AWFUL TRUTH(1937), MIDNIGHT(1939), THE LADY EVE(1941), and most emphatically, HIS GIRL FRIDAY(1940)- only with a shipload more profane repartee, orgiastic lust, and bone-crunching physicality than was ever permissible or desirable in those older classics. Throwing all vestiges of caution to the four winds, Wertmuller really surprises the viewer with her take on the battle of the genders strained through a volcanic political dialectic. Upon its initial release many in the audience demurred strongly (and still do) as the male's dominance slipped into outright brutality. Certainly, Wertmuller can be accused of going too far, but never of boring us. Giancarlo Giannini and Mariangelo Melato are absolutely letter perfect: sulking, teasing, attacking, retreating, seducing, rampaging, abandoning. Their director spurs them through an emotional and physical gauntlet and they meet each dramatic challenge with winning artistry. You may feel wrung out by film's end. Or enraged. Or both. But you'll have quite a time.",
         "A film that's exceedingly difficult to pin down. It would be easy to dismiss it, but it's just as easy to be startled and amazed by it. The story's simple enough: a shaggy, dark-skinned man (played by Giancarlo Gianni) works under the thumb of the bourgoisie on a hired yacht. He despises them, and they despise him. One of these rich people is particularly annoying, a blonde woman (Mariangelo Melato), who spends her days incessantly bitching, spouting capitalist slogans, and putting down the servant class. These two characters, not surprisingly, end up together on a dinghy whose motor has broken. She never shuts up, he stares at her murderously. They eventually land on a deserted island, where he refuses to help her whatsoever. She eventually has to submit to whatever abuses he chooses to dish out. Yes, that does include physical and eventually a near-rape, which will certainly disgust and upset a lot of the film's audience. The film can actually be sort of perverse. I'm sure many have marvelled that, with some of the film's crueller scenes, the film was directed by a woman. It is actually, in its way, nearly as perverse at some times as The Night Porter, directed in the very same year in Italy, also by a woman. That film's merits are more dubious than Swept Away's, however. The film is unexpectedly hilarious, at least for the first forty-five minutes or so. When the abuse starts, the film begins to shift to a social issues picture. Class issues are important, as well as racial issues (which kind of amount to the same thing). I didn't mind seeing the woman verbally abused - she spent the first forty-five minutes doing the same to the guy. The smackings she receives were hard for even me to take, however. The politics are nevertheless exceedingly interesting. The film has some very good material on the social constructions of class. After this section of the film, the story shifts to erotica, and it is very erotic at times. In this section, the film is a direct descendent of Bertolucci's Last Tango in Paris (as was The Night Porter, incidentally). After that, the film shifts once again to romantic melodrama, as the two are rescued. The man makes the decision to signal a yacht that he sees in the distance simply because he wants to test the deep love that the woman swears by. These shifts in narrative can be clearly felt, like upshifting in a manual transmission vehicle, but it works rather well. I was always right with the film with its emotions (although it took me a good twenty minutes to get into the film). I ended up rather loving it, despite its flaws. Now I actually want to see the Madonna version to see how bad that hack Guy Ritchie screwed it up. At one point in the film the man tells the woman that she looks like the Madonna. Pretty funny, no? 9/10.",
         "The entire premise of the accidentally positioned relationship of the sailor with the rich and spoiled woman is entirely contrived and like a very well oiled opera, it spins in surprising circles, taking us to places we did not anticipate when we first meet the characters. Where it could have fallen into a parody or in its simplest form, a Marxist diatribe, the director raises the form into metaphor and both shocks and surprises us along the way. I can imagine that when this film first came out in 1974, the public must have gasped at several things: there are several moments in the film when the sailor just explodes in a rageful outpouring of physical abuse to the lovely lady. In short, he beats her about the face and wrestles with her until she is quite roughed up. The repeated slapping is still hard to watch, even if you think in your mind that these are well trained actors. The overt machismo that the sailor humiliates the lady with is both laughable and grotesque by our standards. Sure the film is making fun of Italian men and especially at the expense of the so-called coarser Southern Italian men and even more the Sicilian men....but it is so overdone that it too rises to metaphor. He struts about like a liberated tyrant, cave-man, looking for every opportunity to enjoy sweet revenge over his hapless companion. What does he achieve? He certainly does break her down and destroys every vestige of her snobby, boorish, disrespectful, artificial outer self and when pealed away what emerges is her long suppressed tender and humbled self. Listen: some people, usually men, go and seek some lunatic guru up in the mountains to help them attain this type of simplicity and humility, so the idea in itself is not far fetched. The difference is that this lady did not choose her fate on the island, did not go seeking humility; it was the only way to survive and in a way here lies an important aspect of Wertmuller's film. Is she asking us: what control do we have when forces much greater than us (poverty in particular as exemplified by the sailor and his laments) push us to limits of endurance? What type of people do we become? Wertmuller is also asking us: the rich have so many more choices, including cultivating their own sense of place and humility in the world and that they do not cannot be attributed to the same stresses that tear apart the poor. I'm simplifying but this seems to be one of the underlying themes. Other themes: the sailor takes advantage of a situation that presents itself in his life for the first time. Sure he's been working hard all his life and he's still the lackey cleaning up the crap of the rich. And, he's totally unappreciated by his family. Now, he can work just as hard but call ALL of the shots including sexual domination and physical appreciation. He certainly did not set out to win over the lovely lady but after seeing how dependent she was and how unaware of her own self sufficiency, he saw an opportunity to dominate and over a woman! The temptation was too great to let alone. She is everything he has fantasized about (without admitting it) and he taunts her with the very same thoughts. And then let's look at passion and love. Where the chemical attraction ends (and by the last third of the film there is plenty of that) there appears to be true and passionate love. At this point I started to feel completely caught up in their torrid affair and the tenderness the sailor finally gives to her just melts your heart. Underneath all that caveman behavior is a very soft hearted and loving man, who never had an outlet for his feelings. Sure he acts like a child, demanding love only on his terms, but that's not the point. They are both childish in their own ways. What the film leaves in your mind...how is it that such diametrically opposed and different people can scratch and crawl their way into passionate and REAL love? And while the film leaves you believing in the truth of their passions, it evaporates at the end, leaving me, at least, very upset at the outcome. Of course Wurtmuller could have opted for the happy ending and then what? In a sense it would have become just too ridiculous, becoming a lampoon of what was uncovered between them. In life, these types of illicit affairs are very often ephemeral and while short lived, very hot. And then they disappear into thin air. Do we seek the romantic ending we wished the film to have taken or do we accept the bitterness of the sailor, cursing much more than the rich lady: his fate yet again returning as bitter as ever; he returning to be a smelly lout of a husband, dragging behind his wife as she barely endures his presence. Giannini gives a towering performance which although teeters on comic self parody, he inhabits his role and lets his inner self evolve as the moment changes. Never over acting even when in a full rage, showing gentleness and hot passion in perfect balance, he is awesome as the rough edged sailor, going nowhere in life. Mariangela Melato is simply gorgeous and sexy and has the time of her life with this role. The two of them took risks as actors but the sparks all seemed so real. You just don't see movies made like this today because we live in politically correct times. Films like this and Linsday Anderson's \"IF\" would either shock us or else would have been ignored as too artsy. I loved this film and the way it moved my heart.",
         "This was one of those few movies that can stay in your mind for decades. I still remember the scene where the rabbit is caught in the trap and slain. This, along with \"Seven Beauties\", is Wurtmuller's at her best. I have no intention of seeing the Madonna remake.",
         "Despite the shrewish bitching of Rafaella and the grumbling of the sailor help- this is a very thought-provoking movie. What especially helps is the cinematography- by Wertmuller's husband- the white sailor uniform, the black diaphanous garb of R. and the blue sea as backdrop. As the affair progressed from hate to a passionate love the changes in body language is well done. Though I saw this movie many years ago- its power to address class wars, the battle between men and women and in inevitable conclusion has never left me.",
         "I really loved this movie. I have to admit I only saw this because I heard of Madonna's remake and my love for the Goldie Hawn movie \"Overboard\", but...wow! Interesting, romantic, powerful, hard-to-watch, political, funny, sad, etc. This movie has it all. You can analyze this movie to death, but it will do it a disservice. Quite simply, it's about a bizarre romance that happens when two people who are total opposites, thus hating each other, are stranded on a remote island and must learn how to live together. By today's standards, this is a very un-P.C. movie: Male domination over a woman. However, it IS just a movie, not real life--don't let that put you off; and there are some scenes that are hard to take, but given the context of the characters, you might think to yourself--\"is this deserved?\" I think some parts are, and others--not at all. You might like this film if you liked Pedro Almodovar's \"Atame! (Tie Me Up, Tie Me Down!)\". This is a film you'll end up discussing with others after you've seen it. Also, I don't recommend viewing this around children or very impressionable teenagers.",
         "Sometimes, there is nothing better than just a simple tale, easy to follow, with breathtaking scenery. Wonderfully acted story that draws you in. Giancarlo Giannini is THE best Italian actor of his time. And as a bonus, with the explicit subtitles, you can learn how to curse in Italian! While the abusive male behaviour is not terribly pc these days, it reflects the culture of some European countries. All in all shows why foreign films are so different from American films. Viva la difference!",
         "A totally compelling story of two totally disparate people (rich vs. poor, capitalist vs. communist, helpless vs. capable, male vs. female) put into a life and death situation, and the love that develops when the barriers that society had put between them evaporate. 25 years after it was made, this movie still has lots to say and says it with a great script, solid acting, and lush location shooting. The message of the movie is as valid today as it was then. There is a sort of \"rape\" scene, which may offend the politically correct... but then again, what doesn't offend these people? My favorite line is from the rape scene, as a matter of fact. The sexual tension has mounted between the two principal characters who are stranded together on an island and the final barrier between them is about to come tumbling down. As the beautiful but hapless woman (whose makeup enhanced looks are now starting to fade in the harsh environment) puts up some token resistance, the dirty little Sicilian sailor slaps her and says, \"Shut up and let me f**k you while you still look good!\" It's a classic. One last thing... the idiot factory that is modern Hollywood is releasing a re-make of sorts of this movie... starring Madonna. Please see the original before this suck-fest of a remake comes out and tarnishes this beautiful movie's legacy.",
         "I feel that many of the comments for 'Swept Away...' slightly miss the point. Certainly, it is about politics. But Wertmuller is not taking sides between her communist & capitalist heros. She is examining what happens when they are removed from the society that defines their roles and their relationship. Once the balance of power is reversed, they essentially change places. He becomes dominant (and often abusive). She becomes weak and submissive. The rough sex, etc. is all symbolic of how the poor are treated by the rich. And Wertmuller shows us that the 'working class hero' has no inherent nobility. Put in the position of power, he is every bit as cruel as his former oppressors. Once they return to society, the balance of power is once again reversed. The message here is that there are no political heros and villains. Power is relative and arbitrary. And sadly, it is our nature to abuse it. The lesson is, perhaps, that we must rise above that base instinct and treat our fellow men with empathy and generosity. \"We have met the enemy, and he is us.\"",
         "Swept Away is criticized by Tania Modleski for poking fun at feminists. That is part of the film's accomplishment, though: Swept Away is culturally valuable for its ability to poke fun at everyone whose flaws warrant it. Wertmuller presents us with extreme characters in absurd situations\u0097characters we love to hate but who are still capable of moving us when they express sincere emotional tenderness and vulnerability. This story explores the ways in which political and economic divisions allow pig-headed people to treat each other. And it certainly doesn't support the oppression of women, as a short-sighted viewing of the film may suggest, because Wertmuller emphasizes the notion that relationships based on one's ability to dominate the other perpetually fail. Whether that dominance comes from political, economic, or gender roles, domination and subjugation create such mistrust in both parties that love cannot sustain itself. Wertmuller masterfully creates type characters\u0097the rich bitch and the vengeful Sicilian\u0097who turn into human beings outside of society and touch the audience with their attempt and failure at love. The elements of composition, music and lighting are used in such a beautiful way that the audience is convinced throughout the couple's stay on the island that love is possible, despite the divisive odds against them, and so their fall is that much more saddening at the end of the film. And the often harsh dialog and action are Wertmuller's bright way of presenting a farcical tale to her audience, daring us to judge the characters lest we be judged."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Medusa Distribuzione"],
      "summaries": ["A rich woman, Raffaella, and some friends rent a yacht to sail the Mediterranean Sea during summer. The sailor, Gennarino, who is a communist, does not like this woman but has to bear with her bad mood. One day she wakes up late in the afternoon and asks to be taken to land where everyone had gone earlier. Gennarino sets up a boat but during the trip, the boat breaks down. They spend the night in the middle of the sea."],
      "budget": 0
   },
   "movielensId": 2239,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1974-12-18",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Lina Wertmüller"],
      "runtime": 116,
      "movieId": 2239,
      "title": "Swept Away",
      "mpaa": null,
      "actors": [
         "Mariangela Melato",
         "Giancarlo Giannini",
         "Riccardo Salvino",
         "Isa Danieli",
         "Aldo Puglisi",
         "Eros Pagni",
         "Anna Melita"
      ],
      "imdbMovieId": "0073817",
      "originalTitle": "Travolti da un insolito destino nell'azzurro mare d'agosto",
      "genres": [
         "Romance",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Stranded and alone on a desert island during a cruise, a spoiled rich woman and a deckhand fall in love and make a date to reunite after their rescue. He is stood up.",
      "tmdbMovieId": 37916,
      "avgRating": 3.67793,
      "releaseYear": "1974",
      "numRatings": 725,
      "posterPath": "/hnpQNKlUqpq1uCgHOtfLMJUjCvU.jpg"
   }
}