{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "bully",
         "id": 10624
      }],
      "imdb_id": "tt0081207",
      "video": false,
      "title": "My Bodyguard",
      "recommendations": [
         23096,
         34593,
         91155,
         35976,
         38772,
         31361,
         19494,
         14742,
         65066,
         61702,
         47701,
         65889,
         63333,
         40506,
         15698,
         13343,
         43093,
         18203,
         16814,
         42780
      ],
      "backdrop_path": "/eH7OqA7uQAFAY66lsX55XWHBSOM.jpg",
      "revenue": 22482952,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Clifford Peache",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e013895",
               "name": "Chris Makepeace",
               "profile_path": "/rioxJkVwTB9keMmv6VgY7sCy3xw.jpg",
               "id": 112158,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Ricky Linderman",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e013889",
               "name": "Adam Baldwin",
               "profile_path": "/vhZ8AD36h09mBLuyIXboglRLgIu.jpg",
               "id": 2059,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Melvin Moody",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e01388d",
               "name": "Matt Dillon",
               "profile_path": "/svj4JJmblkNUt9pSrchJEzx4VR3.jpg",
               "id": 2876,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Mr. Peache",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138b7",
               "name": "Martin Mull",
               "profile_path": "/oMYciNILkZMhVyrMP9FtMepntiS.jpg",
               "id": 80742,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Gramma Peache",
               "gender": 1,
               "credit_id": "52fe442bc3a368484e0138bb",
               "name": "Ruth Gordon",
               "profile_path": "/155Pa9jPlWEaPK7qZQFWH6kol5A.jpg",
               "id": 4970,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Shelley",
               "gender": 1,
               "credit_id": "52fe442bc3a368484e013891",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Dobbs",
               "gender": 0,
               "credit_id": "52fe442bc3a368484e0138bf",
               "name": "John Houseman",
               "profile_path": "/yN0o6KfCD7Lbb50oYuYn1oxHONB.jpg",
               "id": 11783,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Griffith",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138c3",
               "name": "Craig Richard Nelson",
               "profile_path": "/h3c6WsyzkYStWqMje1ePgWCzQrK.jpg",
               "id": 132371,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Workman",
               "gender": 0,
               "credit_id": "52fe442bc3a368484e0138c7",
               "name": "Tim Kazurinsky",
               "profile_path": "/4MeLlddWvGZGFpHvwwTtrgHepP2.jpg",
               "id": 95216,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Engineer",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138cb",
               "name": "George Wendt",
               "profile_path": "/wbDxe198w5Yu8zYdxkV9vmexN1E.jpg",
               "id": 66606,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Mike",
               "gender": 0,
               "credit_id": "52fe442bc3a368484e0138cf",
               "name": "Hank Salas",
               "profile_path": null,
               "id": 141243,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Boy",
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138d3",
               "name": "Dean Devlin",
               "profile_path": "/zPeGiLiogQe3udUk7g6tlpERtW9.jpg",
               "id": 8676,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe442bc3a368484e0138a1",
               "name": "Melvin Simon",
               "profile_path": null,
               "id": 66711,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138a7",
               "name": "Alan Ormsby",
               "profile_path": null,
               "id": 48805,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138ad",
               "name": "Don Devlin",
               "profile_path": null,
               "id": 117605,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe442bc3a368484e0138b3",
               "name": "Tony Bill",
               "profile_path": "/u2bReGWYZYurA6OXIdF2VOdCX1z.jpg",
               "id": 57138,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58fa7e1392514163df002107",
               "name": "Stu Linder",
               "profile_path": null,
               "id": 5166,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58fa7df592514163f5001f93",
               "name": "Dave Grusin",
               "profile_path": "/h6EgxJIsRpObohHdvlUGEAu6EqK.jpg",
               "id": 10771,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58fa7e0992514163df0020fc",
               "name": "Michael D. Margulies",
               "profile_path": null,
               "id": 57360,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58fa7e1bc3a3687a2a001e39",
               "name": "Vic Ramos",
               "profile_path": null,
               "id": 3176,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58fa7e2392514163df00210f",
               "name": "Jackson De Govia",
               "profile_path": null,
               "id": 7716,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58fa7e2a92514163ec001f71",
               "name": "Dave L. Love",
               "profile_path": null,
               "id": 1324619,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.53144,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21873,
      "vote_count": 39,
      "budget": 0,
      "overview": "Clifford Peach (Chris Makepeace), an easygoing teenager, is finding less than easy to fit in at his new high school, where a tough-talking bully (Matt Dillon) terrorizes his classmates and extorts their lunch money. Refusing to pay up, Clifford enlist the aid of an overgrown misfit whose mere presence intimidates students and teachers alike. But their \"business relationship\" soon turns personal as Clifford and the troubled loner forge a winning alliance against their intimidators - and a very special friendship with each other. Ruth Gordon, Martin Mull, Joan Cusack and John Houseman round out \"a truly remarkable cast\" (Variety) in this delightful coming-of-age comedy and triumphant tribute to the underdog.",
      "similar": [
         13310,
         258230,
         15907,
         70821,
         292044,
         72508,
         246115,
         453064,
         332349,
         295022,
         862,
         34584,
         400710,
         62211,
         82690,
         269149,
         406997,
         449176,
         41402,
         13339
      ],
      "original_title": "My Bodyguard",
      "runtime": 96,
      "poster_path": "/v0AgK10BeuLloxTiXLWYFZ6DmWN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Melvin Simon Productions",
            "id": 2124,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Market Street Productions",
            "id": 8829,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1980-07-11",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Terrorized in the Toilets? Chased after school? Shaken down for lunch money? GET A BODYGUARD",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tony Bill"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Alan Ormsby"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081207/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1MzEyMzY3MF5BMl5BanBnXkFtZTcwNDY4OTQ1MQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Makepeace, Adam Baldwin, Matt Dillon | See full cast and crew »"],
      "reviews": [
         "Tony Bill's \"My Bodyguard\" seems to be a film that has been forgotten. Thanks to the Fox cable channel, it turned up the other night. It doesn't seem possible this movie is twenty five years old already. Not having seen it when it was released, we took a chance and it paid off handsomely. The film addresses the bullying in schools, a nightmare for those students that appear weak, or easy marks for these predators to make a name for themselves among their peers, at the others expense. Unfortunately, no one pays attention to the ones being abused and Hollywood, in general, takes the bully's side in many occasions, at the expense of the nerd, or the ones suffering the harassment. \"My Bodyguard\" shows some of today's familiar faces as they looked in those years. Some have gone to careers of their own, such as Matt Dillon, Adam Baldwin, Joan Cusack, George Wendt, and the uncredited Jennifer Beals, who has no speaking role. When Clifford Peache, the son of a hotel manager in Chicago, changes schools, he meets his worst nightmare: Melvin Moody. Melvin terrorizes kids, especially those young and vulnerable. Clifford is the new target for Melvin to bring down and humiliate if he doesn't agree to do whatever he is told. Rick Linderman, the tall and strange guy in Cliff's class is the perfect candidate to be engaged as a body guard for all the kids being abused. In fact, Rick teaches Clifford a lesson when at the end he has to face the mean Melvin, who proves to be a coward, as all bullies are. \"My Bodyguard\" is an entertaining film to watch thanks to the great performance by Chris Makepeace, who makes a great Clifford. Ruth Gordon, who plays Clifford's grandmother, has some comic moments. Martin Mull is seen as Cliff's father and John Houseman appears briefly as the man who is charmed by Grandma Peache. Tony Bill shows he could deliver a movie that seems to be timeless.",
         "In his debut performance, Adam Baldwin does a wonderful job portraying the alienated Ricky Linderman, who is seen as a hulking, violent \"psychopath\" by most of his peers. Baldwin's acting abilities are impressive and he touches the heart of the viewer by showing us Ricky's emotions. Ruth Gordon is a joy to watch as Clifford's Gramma Peache. Her character adds the touch of humor that is needed to balance the heavy subjects addressed in this piece of work. I am slightly disappointed with the editing; they appear to be going for dramatic pauses that don't work well and slow the pace of the scenes at times. However, I'm willing to live with that for the opportunity to see this wonderful story, which after 24 years still rings true to the reality of the cutthroat world of high school.",
         "\"My Bodyguard\" is a wonderful film that has a charming story which doesnt have to have people getting blown up or killed. The movie also has a nice moral too it. I remember watching this as a kid and this was one of my favorite films growing up. It teaches kids about friendship, devotion and loyalty and standing up for what you believe in ... its a classic compared to some of the trash like 8 mile thats out there today. Chris Makepeace is excellent but Matt Dillon is truly fantastic as the school bully. I highly reccommend this type of movie for your kids.",
         "I recently saw this movie again and I was surprised at how well it holds up. The story isn't dated, the situations are universal and current and the acting is fine. The plots are believable, interesting and satisfying. For a sleeper of a film in 1980, it stands out as 1 of the better teen genre pieces that flooded the theaters in the 80's. The ending is a bit sappy, but it still doesn't detract from a very sweet story with characters you can actually cheer for (except, of course for Moody and Mike, but it was fun booing them as well).",
         "This movie rings true on so many different levels. I find this a real gem because no matter how many times I watch it I find it compelling and refreshingly straightforward. Chris Makepeace is cast perfectly as a reluctant victim of extortion by Matt Dillon's high school band of thugs. Adam Baldwin relays a sense of pain, anguish, and grief that you can nearly touch. What can you say about Matt Dillon (Moody)? Anyone who has ever been bullied will squirm in their seat after watching him for just ten minutes. This is one of those special movies that will appeal to so many different people. Haven't we all been to high school? been bullied at some point? got caught up in ridiculous rumor and innuendo? if so, then definitely take time to watch this timeless classic.",
         "This is the movie I first spotted the actor Adam Baldwin and I have been a fan of his ever since. This is an extremely well acted movie. It is a family movie that kids and adults alike will enjoy. It is full of great characters and great character actors. I noticed that Dean Devlin had a small part as \"Boy\". Later on Adam Baldwin had a part in Independence Day which Dean Devlin wrote and produced. I wonder if this is where they first met. If you get the chance please watch this movie.",
         "Well,when I saw,\"My Bodyguard\",i wasn't a High School sophomore but had actually just entered Jr. High..which isn't much different except for age. It's almost needless to say that,having put up with bullies and tormentors in nearly every grade of school to that point (and into high school) you'd win the bet that I absolutely loved this movie! At the time of release I was 12 and the idea of hiring a great big person like that for protection at school appealed to me. Adam Baldwin does an accurate portrayal of a teen that grows up in less than ideal surroundings. Chris Makepeace brings us easily into feeling sympathetic to his cause. Matt Dillon,in only his 3rd movie,is the perfect chip on his shoulder bully,who gets some sick pleasure out of making others feel terrible by insulting them or beating them up if they dare to talk back at him. As well as he & his friends,basically,extorting other kids' lunch money. The other teens act just the way teens in that generation did. (They actually represent my oldest brother's time in High School '78-'82.) The adults Martin Mull as Clifford's Dad,who manages the hotel where they also live. Ruth Gordon (who always was hilarious) is a treasure and does what she does best,playing the feisty Grandma who never grew up. Look for a less than 90 sec. cameo by a then unknown George Wendt,playing a hotel Engineer/Repairman. My favorite scene besides the climactic \"fight in the park\",is when Clifford goes into the local hangout and squirts mustard/pours drinks over his tormentors! Hilarious! They chase him across the street,followed by the other teens and Cliff introduces them to \"his Bodyguard. The deeper undertones of the film,that are about Linderman are a way of saying,\"you think Clifford has problems,look at Linderman.\" Meaning,there's a lot worse that can happen in the world and things in your own life aren't as bad as they might seem. Especially when you're younger. Overall,the whole movie works,I don't care how it's edited,as long as it makes sense and has a point. Point being,you have to do for yourself in this world because,not everyone will help you all the time. It almost makes you wish today's school problems were \"this\" easy to handle. Along with \"Fast Times At Ridgemont High\" And \"The Breakfast Club\",I wish all movies about teens in the 1980's had been this good,instead of the more mindless \"teen-sex\" films that I found very insulting to my intelligence! (END)",
         "Whatever happened to Chris Makepeace. This kid could could act. He was my hero growing up. There was nobody I could relate to more. I mean there was the Terminator, Rocky, Rambo, Conan, and other big muscle heroes. They did not speak to me. I felt no connection to them. Don't get me wrong I loved those films...Yes even Rocky 5 (\"You knocked him down...why don't you try knocking' me down?\"), but it was the loser weakling portrayed in My Bodyguard, the kid who could not find a friend at camp in Meatballs, and the horny teenager in Vamp I felt instantly akin to. My Bodyguard had me searching the hallways of my High School for someone to protect me. I never found my Adam Baldwin, but this movie taught me to stick up for myself. There were plenty of Matt Dillon's in my high school just waiting to steal my lunch money, and mess up the way I looked. This film had some high drama in it as well. I am not one of those that likes to write spoilers so I will just say that I had an unexpected welling of emotion in one scene. If I ever wrote a script, I would seek out the talents of Chris Makepeace.",
         "Of all the teen flicks that came out of the 1980s, MY BODYGUARD is one of three that stands out as an intelligent and moving study of American adolescence that doesn't now look like a dated genre piece(THE BREAKFAST CLUB and SAY ANYTHING are the others). Sure, there's shaggy hair and all the other things that date the movie fashion-wise, but the characters shine with humanity and poignancy, and that makes the movie memorable. In fact, some could convincingly argue that the movie is all about the characters, people that movie audiences will care about. Add to that the situation of being the new kid and trying to survive the jungle of high school(something most every American teen can relate to), and you have a great little film. Chris Makepeace is the new kid who tranfers to a urban Chicago highschool from a private school and immediately runs afoul of school bully Matt Dillon. Searching for a solution to his predicament, Makepeace enlists Adam Baldwin, a silent, hulking classmate with a mysterious past, to protect him. What unfolds is a rare friendship between Makepeace and Baldwin, as we learn more about Baldwin's character and some terrible secrets he holds. Whether intentional or not, the film sends a message that the people we encounter everyday are just that, people with feelings and problems and not just the labels or stereotypes we assign them. Makepeace needs Baldwin for protection from Dillon, and Baldwin needs Makepeace's friendship to rescue him from the isolation he has endured as a result of past experiences. One unusual aspect of the movie is that several of the adult characters are sympathetic or even quirky, a rarity in teen films. Ruth Gordon shines as Makepeace's feisty grandmother, and Martin Mull puts in a turn as the bumbling but well-meaning father. And, unlike the nihilistic teens of today's current crop of movies, the teens(with the exception of Dillon and his cronies)are likable, friendly, and positive. They readily accept Makepeace and then Baldwin, after they see that the rumors about him are just that. This gives the movie a positive feel to it. Definitely a winner. If you've ever been a teenager, wondered if you would belong, attended a high school or had to do battle with a bully, you'll find something to like about MY BODYGUARD.",
         "I liked it when it first came out and still like it now. Matt Dillon plays the perfect jerk in this movie. You are so glad when he gets his in the end. The friendship seemed real between Chris Makepeace and Adam Baldwin. This film also included a very young, braces wearing, Joan Cusack. I highly recommend this one."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Market Street Productions",
         "Melvin Simon Productions"
      ],
      "summaries": [
         "Clifford Peache is the new kid in Lake View High School. Faced with all the stress that role entails he makes his situation worse by insulting Moody, the leader of a group of toughs who extort lunch money from kids. These punks pretend to be bodyguards for the kids to protect them from Linderman who, it is rumored, killed his brother in cold blood. Clifford befriends the sullen Linderman and hires him as his bodyguard. When Moody ups the ante, Linderman must decide whether fighting for what he believes in, with his haunted past and image, is justified.",
         "When a boy comes to a new school and gets harassed by a bully, he acquires the services of the school's most feared kid as a bodyguard."
      ],
      "budget": 0
   },
   "movielensId": 2240,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-07-11",
      "dvdReleaseDate": "2002-01-29",
      "directors": ["Tony Bill"],
      "runtime": 96,
      "movieId": 2240,
      "title": "My Bodyguard",
      "mpaa": "PG",
      "actors": [
         "Chris Makepeace",
         "Adam Baldwin",
         "Matt Dillon",
         "Martin Mull",
         "Ruth Gordon",
         "Joan Cusack",
         "John Houseman",
         "Craig Richard Nelson",
         "Tim Kazurinsky",
         "George Wendt",
         "Hank Salas",
         "Dean Devlin"
      ],
      "imdbMovieId": "0081207",
      "originalTitle": "My Bodyguard",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [
         "22_0SIwqWWY",
         "ZtGtaevaesk",
         "R27gVbPvw7M"
      ],
      "plotSummary": "Clifford Peach (Chris Makepeace), an easygoing teenager, is finding less than easy to fit in at his new high school, where a tough-talking bully (Matt Dillon) terrorizes his classmates and extorts their lunch money. Refusing to pay up, Clifford enlist the aid of an overgrown misfit whose mere presence intimidates students and teachers alike. But their \"business relationship\" soon turns personal as Clifford and the troubled loner forge a winning alliance against their intimidators - and a very special friendship with each other. Ruth Gordon, Martin Mull, Joan Cusack and John Houseman round out \"a truly remarkable cast\" (Variety) in this delightful coming-of-age comedy and triumphant tribute to the underdog.",
      "tmdbMovieId": 21873,
      "avgRating": 3.4099,
      "releaseYear": "1980",
      "numRatings": 1676,
      "posterPath": "/v0AgK10BeuLloxTiXLWYFZ6DmWN.jpg"
   }
}