{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "older woman seduces younger guy",
            "id": 7476
         },
         {
            "name": "college student",
            "id": 207844
         }
      ],
      "imdb_id": "tt0085346",
      "video": false,
      "title": "Class",
      "recommendations": [
         25010,
         24249,
         2193,
         14441,
         18169,
         31618,
         9930,
         19259,
         77469,
         26686,
         4988,
         20096,
         30231,
         76297,
         69007,
         29968,
         18282,
         34101,
         13697,
         21873
      ],
      "backdrop_path": "/21t7zIUj2pm9qaGYcJ4f4Eb0zX3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Ellen Burroughs",
               "gender": 1,
               "credit_id": "52fe441cc3a368484e01001b",
               "name": "Jacqueline Bisset",
               "profile_path": "/ys2YfG4d26jUiGvok0jplWgUhzP.jpg",
               "id": 14061,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Franklin 'Skip' Burroughs IV",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010017",
               "name": "Rob Lowe",
               "profile_path": "/yt6vMZVBXGCJL0xRE4jFa4SjzcQ.jpg",
               "id": 2879,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jonathan Ogner",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e01001f",
               "name": "Andrew McCarthy",
               "profile_path": "/bn6djJHhLF6dTIz5H3UvuCFoeLm.jpg",
               "id": 37041,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Mr. Burroughs",
               "gender": 0,
               "credit_id": "52fe441cc3a368484e010035",
               "name": "Cliff Robertson",
               "profile_path": "/q8DvYrkVZ6GajgU2V771Y0dOGWy.jpg",
               "id": 19153,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Balaban",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010039",
               "name": "Stuart Margolin",
               "profile_path": "/aPY5PDrURHBlZv45XXCvrijmjsx.jpg",
               "id": 41406,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Roscoe Maibaum",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e01003d",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Roger Jackson",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010041",
               "name": "Alan Ruck",
               "profile_path": "/vIR73PIttX21BfZv1LgfsadDMaT.jpg",
               "id": 2394,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Allen",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010045",
               "name": "Rodney Pearson",
               "profile_path": null,
               "id": 125475,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Kennedy",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010049",
               "name": "Remak Ramsay",
               "profile_path": null,
               "id": 21153,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Lisa",
               "gender": 1,
               "credit_id": "52fe441cc3a368484e01004d",
               "name": "Virginia Madsen",
               "profile_path": "/opdvsRunQgmw5AuGGpyAnQCz0q8.jpg",
               "id": 12519,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Susan",
               "gender": 1,
               "credit_id": "52fe441cc3a368484e010051",
               "name": "Deborah Thalberg",
               "profile_path": null,
               "id": 125476,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Headmistress DeBroul",
               "gender": 1,
               "credit_id": "52fe441cc3a368484e010055",
               "name": "Fern Persons",
               "profile_path": "/3VqZswsT1zitiLg9jaxdAFc0dek.jpg",
               "id": 44850,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Doug",
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010059",
               "name": "Casey Siemaszko",
               "profile_path": "/kW2A2OrOMnlU7FoVDFbFmZJIUa8.jpg",
               "id": 1953,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe441cc3a368484e010061",
               "name": "Anna Maria Horsford",
               "profile_path": "/aHGNsdQyfYiMsclGTlEPvvmZw3a.jpg",
               "id": 54800,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010025",
               "name": "Lewis John Carlino",
               "profile_path": null,
               "id": 84657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe441cc3a368484e01002b",
               "name": "Jim Kouf",
               "profile_path": null,
               "id": 21155,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe441cc3a368484e010031",
               "name": "David Greenwalt",
               "profile_path": null,
               "id": 87590,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "573cae58c3a3687dad000524",
               "name": "David Greenwalt",
               "profile_path": null,
               "id": 87590,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.840895,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21500,
      "vote_count": 49,
      "budget": 0,
      "overview": "Naive Midwestern prep student Jonathan bonds with his more worldly roommate, Skip, who takes the small-town boy under his wing. At Skip's urging, the inexperienced Jonathan is emboldened to seek out older women in the cocktail lounges of nearby Chicago, where he meets and beds the alluring Ellen, who unfortunately turns out to be Skip's mother. The division between the friends is further deepened when a cheating scandal engulfs the school.",
      "similar": [
         292280,
         440021,
         23169,
         10642,
         22970,
         122081,
         114150,
         244786,
         228205,
         290764,
         23483,
         62211,
         262500,
         262504,
         270303,
         9285,
         16614,
         8849,
         65496,
         368031
      ],
      "original_title": "Class",
      "runtime": 98,
      "poster_path": "/vh6tuoD9GIT8WpV3Nhob95OLGai.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
         "name": "Orion Pictures",
         "id": 41,
         "origin_country": ""
      }],
      "release_date": "1983-07-22",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The good news is, Jonathan's having his first affair. The bad news is, she's his roommate's mother!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lewis John Carlino"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Jim Kouf",
         "David Greenwalt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0085346/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwOTAxNTgyOV5BMl5BanBnXkFtZTcwMTY2NjEzNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jacqueline Bisset, Rob Lowe, Andrew McCarthy | See full cast and crew »"],
      "reviews": [
         "Class is the story of a shy, clumsy, but very intelligent young man played by Andrew MaCarthy who transfers to an exclusive prep school for his senior year of high school. He comes from a working-class background and has more than a little trouble getting comfortable in his new surroundings. It doesn't help matters that he has to share a room with an obnoxious rich kid played by Rob Lowe. Throughout the film we see McCarthy learn lessons about love, academics, and friendship. This is a very uneven film; often switching from comedy to heavy-handed mature themes almost on a dime. The comedy for the most part hits the mark. The dramatic elements are just not believable. I have never seen a film go to so much trouble to humiliate its main character. Some of the things that happen to McCarthy are pretty funny, but others almost make you feel sorry for the poor kid. McCarthy is barely on campus for five minutes before Lowe convinces him to put on women's underwear and parade around in the commons area. McCarthy thinks it is some type of senior ritual that is done every year, but he soon finds out that only he is participating in it. Lowe then locks him out of their dorm and he is forced to climb in through a second story window with hundreds of other students taunting him. Now that is the type of thing that can scar for life! There are a few other scenes where McCarthy's humiliation continues. He journeys to a trendy bar in Chicago and is made a fool of twice in front of the whole place. In a show of sympathy, a rich older woman feels sorry for him and takes him to a motel and nails him. In what has to be one of the biggest contrivances in movie history, that woman turns out to be Lowe's unbalanced alcoholic mother! They screw around for a few weekends before she finds out he goes to her son's school and then promptly runs out on him. (That would be a hell of a thing to learn!) The film's biggest laugh comes from the scene directly after that one. In it, McCarthy is sitting in the rain at a bus stop waiting for Lowe to show up and give him a lift back to school. He couldn't be any more depressed until Lowe comes screeching up to the stop; sending a tidal wave of rain water cascading over the dejected McCarthy! McCarthy is depressed for quite a while after being dumped, but he is still unaware that the woman of his dreams was his best friend's mother. In a truly uncomfortable scene at their home during the Xmas holiday, they meet again. The film gets way too serious from that point on. The only laughs in the last half hour stem from the investigation of stolen SAT tests on the campus by a nerdy bureaucrat from the state attorney general's office. In one hilarious scene, the students think the officer is there to bust them for drugs. We see about a hundred young men scurrying to the bathroom to flush all of their joints, pills, and whatnot. One guy even tries to flush an entire pot plant that's about six feet high! Towards the end, things get really serious. Lowe finally finds out his mother and McCarthy are screwing around. He knows McCarthy illegally bought an SAT test. Will he turn him in? Will the boys get into Harvard? What will become of Lowe's parents? What will become of McCarthy's dog? If you care enough to find out, give this film a chance. If nothing else, it has some very early performances by some people who went on to greater things. It was McCarthy's debut. Alan Ruck, John Cusak, Virginia Madsen (nice boob shot, by the way!), and several other recognizable faces are present. 6 of 10 stars. So sayeth the Hound.",
         "Though this movie was clearly designed to have mass-market teen appeal, it has a serious side that makes it stand out from other movies of the same type. The premise, a teenage boy's first sexual encounter turns out to be with his roommate's mother, is contrived to arouse curiosity among adolescents. Combine this with unsophisticated humor and flaunting of authority and you have the formula for a popular teen romp. But it seems that there is a movie with some sensitivity and drama trapped within this rather restrictive framework. The boy is torn between his friendship with his roommate and his relationship with his friend's mother. The woman is repressed and intimidated by her husband and finds a sense of freedom in this forbidden relationship which she can't seem to let go. The result is a movie that tries to be both a high school date movie of the week and an adult drama, landing somewhat awkwardly somewhere in the middle. It does have some laughs though and some before-they-were-famous appearances that might make it worth while.",
         "Class might be one of the most uneven films ever made. It begins like a broad teen-comedy; enters a mid-section about the sexual awkwardness (and awakening) of adolescence; and for its final twenty minutes or so is a deadly serious drama about broken trust and rebuilding friendships. Nerdy prep-school newcomer Jonathan (Andrew McCarthy) arrives at the Vernon Academy and is immediately the victim of a wild prank by his confident, fun-loving new room-mate Skip (Rob Lowe). Soon, Jonathan's gullibility and virginity are the joke of the campus. In a bid to get his room-mate comfortable and experienced around women, Skip sends him to Chicago on the strict understanding that Jonathan will not be allowed back into their room unless he returns with a woman's panties. After a few embarrassing set-backs, Jonathan finally reels in a stunning older woman named Ellen (Jacqueline Bisset), who gives him his first taste of sex in a glass elevator. However, Jonathan lies about his age and occupation in order to \"impress\" Ellen. It is only later - when their passionate fling has blossomed into love - that Ellen discovers the truth about her young lover. And it is a truth which leaves her reeling... for by the foulest of luck she is, in fact, Skip's mother! The contrived and coincidence-heavy plot is rather unpersuasive, but that hardly matters. For its opening twenty minutes, this is a thoroughly enjoyable comedy, with laugh-out-loud scenes showing Jonathan's awkward and humiliating introduction to prep-school life. The mid-section, in which Jonathan and Ellen hook up, is quite poignant though some of the sex scenes are squirm-inducing.... Bisset, in particular, gives a very brave performance considering what the script asks of her, and McCarthy does well to give his role the right amount of sweet goofiness. The film's later stages are a bit too serious and full of phony soul-searching. What really hurts Class is the lack of fluency between each section. It goes through massive changes in tone, theme and style.... one moment we're in Porky's territory, before we know it it's more like The Graduate, and by the end the film almost seems to be approaching something akin to a sub-Shakespearean love-dilemma. Class is an OK movie, but it needed more focus and a better sense of its own intended audience if it were to be anything more.",
         "Okay, I must admit, it is difficult for me to remain entirely rational about this film, because it evokes sentimental memories. But I love this film, I love it, what can I say. For me it has everything, the ivy league ambience, the lovable-I-own-the-place-swagger of Rob Lowe, the appropriate witticisms, at the appropriate times read by a cast to kill for. The film begins and ends with the \"kids\" in complete control, theres no PC screwing around either, all of the students do drugs, with most of the action taking place at a prep boarding school there's poker games and smoking after lights out. I tried to re-enact the John Cussack 'tip truck' smoking trick for almost a decade, in fact it was the prime reason I took up smoking in the first place. The New Renaissance has been indicated by many social historians as the years 1982 to 1987 with the peak beginning with the opening night of the movie ET, and the end coinciding with the closing ceremony of the 1984 LA olympics. This film, having been made in 1983, stands as a virtual document to the affirmations and values of Western Culture at its peak. The scene of the triumphal holiday return of Rob Lowes character to his ancestral home is resplendant with a punk version of 'the little drummer boy', as he tears through New England countryside in his Porshe charger......breathtaking. Nothing since the death of communism comes close to replicating the self confidence that shimmers off this film with the possible exception of \"The Chocolate War\". This film is not to be taken as a trite story but should be viewed in the light that reflects what it is, an artistic vision of the height of teen existence at the height of human existence, not too big a call I'm sure you'd agree.",
         "This movie - one of many early 1980's movies used as vehicles for the likes of Rob Lowe, Andrew McCarthy, Judd Nelson and Matt Dillon - conveys many distinct qualities, which countless teen films of late seemingly lack. What is immediately evident, is the way in which the director skillfully juxtapses the moody atmosphere with the hilarious antics of the Ivy League school boys. Regarding this movie from the point of view of intertextuality, a number of other texts immediately spring to mind: 'The Graduate', 'Animal House' and J.D. Salinger's 'Catcher in the Rye'. Lowe (The Outsiders, Youngblood, Oxford Blues), and McCarthy (St. Elmo's Fire, Mannequin, Catholic Boys) turn out meritable performances: one being the typically egotistical teenager(Lowe), and the other(McCarthy)conveyed as the naive, withdrawn 'new boy'. Jacqueline Bisset is, as always, aptly cast as the sultry seductress who, with an overbearing husband (Cliff Robertson) and a subsequent case of neurosis, seeks contentment in the shape of a teenage boy. Other striking performances come from - at the time, unknown actors - John Cusack and Alan Ruck. 'Class' is dark and moody at times, and the direction and setting conveys this aspect of the film aptly: the fight between Skip(Lowe) and Jonathan(McCarthy) takes place in the woods outside the school on a cold, grey afternoon during the fall. In contrast to this, there is the bright lights and bustle of New York City, where Jonathan embarks on a mission to apparently gain his manhood and 'save face' with the other students(here, there is that connection with the students in 'Catcher in the Rye' taking weekend trips to New York and the character 'Ackley' who is always boastful of his conquests with women). The film further depicts the antics of the school boys; for example, the incident at the neighboring girls' school and Jonathan's initiation on his first day. 'Class', like 'Oxford Blues', 'Youngblood', 'The Breakfast Club', 'Catholic Boys' and 'St. Elmo's Fire', to name but a few, is the quintessential movie for teenagers; it has depth and feeling, as well as displaying good comical dialogue. This film is simply 'Class'.",
         "Believe it or not, CLASS is the first feature film for the likes of Rob Lowe, Andrew McCarthy, John Cusack, and Alan Ruck, all of whom have gone on to do a lot of good (and in my opinion, largely underrated) acting in numerous films. The beautiful and similarly prolific Virginia Madsen even has a bit part here in her second film. I can't think of any picture that was such a breeding ground for so many stars. As a bonus, Jaqueline Bisset has a leading role at the peak of her sultriness (although the sex scenes are relatively chaste and unrevealing). While the plot is nothing to write home about, the dialog is well done, and the direction is pretty good. View this film if you are a fan of any or all of these brat-packers.",
         "As many others have noted with the film, 'Class', is that it is quite uneven! It doesn't know if it's a comedy, romance, or even tense drama. It's a weird 80s teen film, but I don't even think I could call it that! And, even when it's all said and done and the credits start to roll, one is left wondering what this film was actually all about. I'm guessing crossing the lines of friendship, given the situation with Jonathan and Skip's Mom. And I'm guessing the film was about loyalty and friendship overall given the ending! Chuck in a few themes about \"class\" itself, and the film seems to make sense! However, the film is still uneven overall, but the performances from a young Andrew McCarthy (Jonathan) and Rob Lowe (Skip) are worth watching- and there is some excellent scenes within the film! Like Skip's \"F*** you!\" moment after the inquisitor belittles his background and insinuates him of cheating! Some funny moments when Jonathan in the girl's campus causing chaos, and when he's trying to talk to a girl at the bar! I know I'll never roll a quarter for my aura on my face in a club or pub! Also, he transition of Skip being loud prank-loving fun to Jonathan's \"morose\" depressing personality being swapped over after Skip discovers Jonathan with his Mom was pretty interesting! Skip becomes colder and hard to approach by Jonathan, whereas Skip would overwhelm Jonathan and put him unwillingly in awkward situations! I didn't really like the closure between Jonathan and Ellen (Jacqueline Bisset), and I would have liked a scene with Skip addressing his mother in regard to Jonathan! Would a friendship between them really survive that? The film seems to suggest that it will survive due to Skip's alienation and contempt for his background and parents, and his affinity with Jonathan as they endeavor towards Harvard! This is by no means a brilliant in the likes of other teen films of the same era. It's worth watching alone because it the feature debut of very young actors in Andrew McCarthy, John Cusack, Alan Ruck ('Ferris Bueller's Day Off'), Virginia Madsen ('Sideways'), Lolita Davidovich ('Intersection') and Casey Siemaszco ('Young Guns')! When you look at a 17 year old John Cusack in that film, you wouldn't think that he would become the most successful star out of the entire cast- though McCarthy did do very well in the 1980s too! Rob Lowe and Jacqueline Bisset and this debut cast all do very well in their performances. While 'Class' may leave you wondering a little, it is worth watching for an unusual representation of awkwardness, youth, romance and friendship! ***½ out of *****!",
         "Failed cross-pollination of \"The Graduate\" with any number of frat-house romps does have one thing going for it: Rob Lowe (pre-\"St. Elmo's Fire\") gives a loose, frenetic performance as a prep-school student whose unstable mother has a secret affair with Lowe's roommate. As he got older, Lowe tended to lean heavily on his male-model good looks, resulting in some posturing performances. This vehicle for him and newcomer Andrew McCarthy is doomed, however. It wants to be a T&A comedy, a sensitive tale of friendship, and a slightly naughty love story between an older woman and a younger man. The romance is unpleasant from the outset, with Jacqueline Bisset TOO convincing as 40-ish trollop with mental problems. Bisset is definitely in the spirit of the thing, but it's a distressing role for the classy actress, who every once in a while stepped into the gutter. The kids are convincingly callow, but their slapstick antics go over-the-top. Director Lewis Carlino seems to think he's giving us something original. \"Class\" was lambasted at the time for an 11th-hour decision to edit out most of the seriousness in favor of the jokes, but heavy drama has no place in this story. What we're left with is the buddy-buddy stuff and the R-rated gags, but those don't work either. *1/2 out of ****",
         "Uneven film at best, but does offer a nostalgic look at some of the pre-famous actors of the 1980's. Not a great plot, but one that will hold your interest due to the likeable characters involved. The ending is rather abrupt and makes one wonder if the director ran out of time, money, or both. Anyway, Ms Bisset is stunning in this role and very appealing. Enjoy!",
         "This is a good comedy for nostalgia purposes that somewhat borrows on similar previous comedies, with the most notable being The Graduate. Andrew McCarthy is Jonathan, the new student at a prep school, who is the new roommate of confident stud, Skip (Rob Lowe). As it is against the rule in the 1980s to be a teenage boy and still be a virgin (there was, after all a whole 80s genre of comedy based on it), Skip decides they must travel to Chicago so Jonathan can finally \"become a man.\" Ironically, and unknown to Skip, Jonathan lives to the ultimate boyhood fantasy--he scores with Skip's mom (although, neither know who the two are at first). One attempt after another for Jonathan and Skip's mom (Jacqueline Bisset) to sort things out briskly and as quietly as possible without Skip finding out lead to a total disaster, of course. And yada...yada...yada...the friendship is tested, there's a few misunderstandings and so forth. The movie offers nothing new by way of the story, which had been done plenty (and is still exhaustively being done) in the two decades prior to its release (even though in the early 60s, it may've still been taboo to be so explicit). But, while it may be predictable, it still makes a good nostalgia trip, though, seeing an extremely young Andrew McCarthy, Rob Lowe, John Cusak (in brief appearances here and there), Casey Seizmasko, and others."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Orion Pictures"],
      "summaries": [
         "Jonathan, a naive country boy, gets a scholarship to a classy prep school, where he rooms with suave, rich and handsome Skip. Skip decides it is his duty to see that Jonathan loses his virginity, so he sends Jonathan to Chicago, where Jonathan meets Ellen, a beautiful older woman, and they be- gin an affair which ends abruptly when Ellen discovers Jonathan is 17. During Christmas break, Jonathan visits Skip's house and discovers that Ellen is Skip's mother. Ellen tells Jonathan to leave when he rejects her advances, but then begins calling him and begging to see him. Finally, Jonathan agrees to meet her and plans to end the affair, but Ellen seduces him--and that's when Skip, who followed Jonathan, discovers them.",
         "A young boy spends one crazy night out, but soon realizes the woman he hooked up with is his roommate's mother."
      ],
      "budget": 0
   },
   "movielensId": 2241,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-07-22",
      "dvdReleaseDate": "2000-11-21",
      "directors": ["Lewis John Carlino"],
      "runtime": 98,
      "movieId": 2241,
      "title": "Class",
      "mpaa": "R",
      "actors": [
         "Jacqueline Bisset",
         "Rob Lowe",
         "Andrew McCarthy",
         "Cliff Robertson",
         "Stuart Margolin",
         "John Cusack",
         "Alan Ruck",
         "Rodney Pearson",
         "Remak Ramsay",
         "Virginia Madsen",
         "Deborah Thalberg",
         "Fern Persons",
         "Casey Siemaszko",
         "Anna Maria Horsford"
      ],
      "imdbMovieId": "0085346",
      "originalTitle": "Class",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "kPN-h6LBD24",
         "46Uk2iuO2FM"
      ],
      "plotSummary": "Naive Midwestern prep student Jonathan bonds with his more worldly roommate, Skip, who takes the small-town boy under his wing. At Skip's urging, the inexperienced Jonathan is emboldened to seek out older women in the cocktail lounges of nearby Chicago, where he meets and beds the alluring Ellen, who unfortunately turns out to be Skip's mother. The division between the friends is further deepened when a cheating scandal engulfs the school.",
      "tmdbMovieId": 21500,
      "avgRating": 2.73796,
      "releaseYear": "1983",
      "numRatings": 727,
      "posterPath": "/vh6tuoD9GIT8WpV3Nhob95OLGai.jpg"
   }
}