{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bondage",
            "id": 910
         },
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "growing up",
            "id": 9825
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "demolition derby",
            "id": 221393
         }
      ],
      "imdb_id": "tt0087359",
      "video": false,
      "title": "Grandview, U.S.A.",
      "recommendations": [
         19373,
         46460,
         16435,
         39924,
         59902,
         42551,
         41587,
         30996,
         32387,
         37598,
         79823,
         27201,
         4984,
         13762,
         84658,
         46359,
         42630,
         26204,
         22121,
         45007
      ],
      "backdrop_path": "/yaMBWp0M46Ah7qovtzDez8ruy9A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michelle 'Mike' Cody",
               "gender": 1,
               "credit_id": "52fe48da9251416c9109a69d",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tim Pearson",
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6a1",
               "name": "C. Thomas Howell",
               "profile_path": "/8PFMkxOnn1JEKwd0nlbBuZfS7Sf.jpg",
               "id": 2878,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ernie 'Slam' Webster",
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6a5",
               "name": "Patrick Swayze",
               "profile_path": "/b5G8AGP609DsUeokQ1asnqYJBSl.jpg",
               "id": 723,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Candy Webster",
               "gender": 1,
               "credit_id": "52fe48da9251416c9109a6a9",
               "name": "Jennifer Jason Leigh",
               "profile_path": "/3OlL9li7qmfXQYEtmpOm34V1huY.jpg",
               "id": 10431,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Bob Cody",
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6d5",
               "name": "William Windom",
               "profile_path": "/nTqbMx3o9rk6Q5PfS3fwh5LEbGw.jpg",
               "id": 8499,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Donny Vinton",
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6d9",
               "name": "Troy Donahue",
               "profile_path": "/53FpBBfRDva2XYjxbQijNxsC8Vd.jpg",
               "id": 45363,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Betty Welles",
               "gender": 1,
               "credit_id": "52fe48da9251416c9109a6dd",
               "name": "Carole Cook",
               "profile_path": "/zGnefjBSgedMsiLEknn51dYBVU8.jpg",
               "id": 41730,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Mr. Clark",
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6e1",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Mr. Pearson",
               "gender": 2,
               "credit_id": "56723d8d92514163c400133c",
               "name": "Ramon Bieri",
               "profile_path": "/yitrN2d6HTHAbXxCimeSCacOEaC.jpg",
               "id": 33060,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Bonnie Clark",
               "gender": 0,
               "credit_id": "56723d9d92514163b90012b6",
               "name": "Elizabeth Gorcey",
               "profile_path": "/c2JJyqPxtZ6N1jXP70ciRKlOobh.jpg",
               "id": 119894,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Cowboy",
               "gender": 2,
               "credit_id": "56723dabc3a368070e00113d",
               "name": "John Philbin",
               "profile_path": "/hVRZLok1DmiiUQ5lBXOYx04Ibk4.jpg",
               "id": 103011,
               "order": 10
            },
            {
               "cast_id": 5,
               "character": "Johnny Maine",
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6ad",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Mary Maine",
               "gender": 1,
               "credit_id": "56723dcc92514163c200124a",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Mrs. Pearson",
               "gender": 0,
               "credit_id": "56723ddf92514163cb0012ee",
               "name": "Camilla Hawk",
               "profile_path": null,
               "id": 1549903,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Susan Pearson",
               "gender": 0,
               "credit_id": "56723dee92514163bf00126f",
               "name": "Melissa Domke",
               "profile_path": null,
               "id": 1549904,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Benny",
               "gender": 0,
               "credit_id": "56723dfa92514163c2001256",
               "name": "Jason Court",
               "profile_path": null,
               "id": 42928,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6b3",
               "name": "Randal Kleiser",
               "profile_path": "/dtSwBcwtYZL9ir9zfKZaTdwdiSm.jpg",
               "id": 8876,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6b9",
               "name": "Ken Hixon",
               "profile_path": null,
               "id": 73424,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48da9251416c9109a6bf",
               "name": "William Blaylock",
               "profile_path": null,
               "id": 1128873,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48da9251416c9109a6c5",
               "name": "Peter W. Rea",
               "profile_path": null,
               "id": 1128874,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6cb",
               "name": "Thomas Newman",
               "profile_path": "/nZSsNIrjbkqqxFYwsD3zcHskxdP.jpg",
               "id": 153,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe48da9251416c9109a6d1",
               "name": "Reynaldo Villalobos",
               "profile_path": null,
               "id": 17948,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59833160c3a3682f7800f55e",
               "name": "Robert Gordon",
               "profile_path": null,
               "id": 1168870,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.730473,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84116,
      "vote_count": 8,
      "budget": 0,
      "overview": "Life in the small town of Grandview, Illinois is one that is just like any other city or town. Tim Pearson, soon to be graduating high school wants to go to Florida to study oceanography. He meets Michelle \"Mike\" Cody and is attracted to her. She runs the local Demolition Derby place. Ernie \"Slam\" Webster is on of the drivers in the derby who's wife is cheating on him and wants to later on be with Mike. Tim falls for Mike and a big love triangle is about to happen.",
      "similar": [
         281957,
         3134,
         400,
         112160,
         281,
         185,
         979,
         359940,
         395834,
         445954,
         226,
         393732,
         133805,
         2142,
         527,
         994,
         2275,
         9654,
         298312,
         260346
      ],
      "original_title": "Grandview, U.S.A.",
      "runtime": 97,
      "poster_path": "/uv050doScga5vL2dkq0fhvVEcB1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "CBS Entertainment Productions",
         "id": 3902,
         "origin_country": ""
      }],
      "release_date": "1984-08-03",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Where dreams have a funny way of coming true.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Randal Kleiser"],
      "runtime": 97,
      "synopsis": "Trama in italiano - Il film è ambientato nella cittadina di Grandview, in Illinois, nella provincia del Midwest. Tim è uno studente che, terminata la scuola superiore, ha deciso di proseguire gli studi presso un istituto universitario della Florida. Innamoratosi però di Michelle, che per lavoro organizza demolition derby, decide di rimanere a Grandview per contendersi la ragazza con Ernie, un pilota da poco tradito dalla moglie. I piccoli e grandi drammi quotidiani di molti personaggi tra cui spicca quello di Tim, ragazzo nel difficile passaggio alla vita adulta, e Michelle una ragazza indipendente che gestisce l'azienda paterna. Mosaico drammatico-sentimentale, focalizzato specialmente sui patemi dell'adolescenza.",
      "writers": ["Ken Hixon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087359/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2OTA1ODQwOF5BMl5BanBnXkFtZTYwNDQxNjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jamie Lee Curtis, C. Thomas Howell, Patrick Swayze | See full cast and crew »"],
      "reviews": [
         "There have been more bad critical reviews and comments about THIS movie than good. I don't see how it's THAT bad to most viewers. It is one of my top favorites. It contains an excellent blend of comedy and drama about life in a rural American location (no mention of state or town but Texas is a good possibility). Great character acting. They just don't make them like this anymore.",
         "In first watching Grandview, USA, you might be puzzled by the scattered storytelling. Simply put, the movie concerns a few small town Illinois residents, but each with their own assorted, and somewhat separate, small town struggles. C Thomas Howell, at least in the trailers, is made to look like the main character of the story, the teenager just aching to break free of the provincial setting. But in fact, his story is neither anything important, nor anything dominant. Jamie Lee Curtis is Mike Cody, a speedway owner who is fighting to hold on to her property. Since her father, the man who built the speedway died, the city commissioner had been dying to get their hands on it. And, Patrick Swayze plays \"Slam the Ram,\" a rather cumbersome character who plays a speedway driver on Cody's lot who is dealing with his sleazy wife (Jennifer Jason Leigh) cheating on him. No story is really fully developed. No situation really seeks to grab the audiences' attention. Everything just seems to be a subplot. The entire story is, as said before, simply scattered and without focus. Jamie Lee Curis and Patrick Swayze, however, are no less entertaining despite this. If only they had developed their characters and story enough, you might have had quite an enjoyable little film. For me, it was still an entertaining film, so long as you don't mind obscure movies and you're in the mood for something different. C Thomas Howell's teenage angst can be kind of annoying at points, especially the music video daydream sequence with the 'Steele Man of Action' bit. But, 80s fans might be lured by the cast. Look for John Philbin (as one of the speedway employees), John Cusack and Joan Cusack (as C Thomas Howell's friends) in minor parts. It wasn't great, but still worth a viewing if you can find it.",
         "This movie is really great about life in a mid western town, a great cast in this movie. A young soon to be high school grad,Tim Pearson,played by C. Thomas Howell(The Outsiders, Red Dawn, and Soul Man)has his dreams. He has his moments in life,especially after the prom. Tim makes out with his girlfriend, Bonnie, played by Elizabeth Gorcey(Footloose), in his dad's brand new Cadillac. Tim goes to Cody's Speed Way where they have demolition derbies there, he meets Michelle\"Mike\"Cody, played by Jamie Lee Curtis(Halloween, True Lies, and Freaky Friday). Patrick Swayze(The Outsiders, Red Dawn, and Point Break) as Ernie\"Slam\"Webster, is awesome. Ernie is a former boyfriend of Mike Cody, Ernie is married to Candy, played by Jennifer Jason-Leigh(Fast Times At Ridgemont High, Single White Female, and Rush), who is cheating on Ernie with a guy named Donny Vinton, played by 1950's heart throb Troy Donahue. A love triangle goes on between Tim,Mike,and Slam. Mike has her troubles too cause the county want to shut down the Speed Way, they feel her pace is unsafe, but the real estate man, Roger Pearson, played by Ramon Bieri, Tim's dad has plans for the site the Speed Way. Tim has a romantic night with Mike Cody,they start to be more close. Slam has problems with his marriage and wants to get close to Mike. Things get crazier when Slam gets even with his wife and her lover by using a bulldozer to tear down the house. Tim and his dad have some differences, but Roger realizes that he should have done things different. Tim tells his father that he wants to follow his dream. The Speed Way gets burned down cause of Mike's little brother, nicknamed Cowboy, who like gum very much. Cowboy was upset cause Mike sold the cars that he thought were his. Things do get better for all. Mike and Slam start over together, Tim Pearson goes to Florida cause of Mike and Slam giving him his car. I think this movie is underrated and should have been giving a lot more credit. Grandview U.S.A. has a good supporting cast like Michael Winslow(The Police Academy movies, Spaceballs)as the announcer at the Speed Way. M. Emmet Walsh(Blade Runner, Back To School, and Missing In Action)as Bonnie's father. John Cusack(Better Off Dead, One Crazy Summer, and The Grifters)as Tim Pearson's friend,Johnny. Joan Cusack as Johnny's sister. Carole Cook as Mike Cody's mother, Betty Welles. John Philbin(Children Of The Corn and Point Break)as Cowboy. I give this movie a 2 thumbs up and 10/10, I had the honor to see it filmed, I was staying with my aunt in Pontiac, Illinois, where the movie was filmed.",
         "Set in a small town in the mid-west,\"Grandview USA\" is neither the best nor the worst of the films to come along in the wake of \"American Graffiti\".Nothing much really happens,but C. Thomas Howell's recurrent music video fantasies are entertaining,and the snippets of small-town America during the opening credits are fun.The little kid who's sharing her ice-cream cone with her dog was my favorite.A pleasant,unoffensive,little film.",
         "OK I must say that this movie isn't the greatest, but hey it was the 80s. This movie is special to me because it was filmed in my home town of Pontiac,IL. I was a little kid when they were filming it and I got to meet Jamie Lee. it was awesome. In Pontiac,IL not much goes on, so you can only imagine how fun it was to have a movie with real stars being made there! The place where they had the race track, was where I played Pony League. They used my high school, and many other parts of the town that I have been to. It's fun to watch this and look out for stuff that's there, not there and see some of my friends in little pieces of the film. So if you are from or have ever been to Pontiac,IL I suggest you watch this film!!",
         "Even with a nice midwestern setting and a truly honest effort to make a film that most people could relate to on some level, this movie just comes up way short. I just stopped caring about these characters about halfway in, and I spent the remainder of the film waiting for the predictable ending to take place. It's not that this is a bad film, but I would call it generic, and it has a basic storyline that would be familiar to most movie-goers. I'm quite certain that you can easily find a better film than this next time you're looking to kill some time with a movie.",
         "This is the first 1 I've ever given a movie at the IMDb. There are some true dogs in the wide world of cinema, and this one is king of the scrap heap. Unmoving setting, snore-worthy climax, angry married people sleeping around, choreographer Patrick Swayze sporting his usual Labrador retriever look; a sad-eyed Jamie Lee Curtis (believably, must say) reprises another unconventional woman with father issues; a couple of a-romantic love affairs with a heavy scene of pseudo BDSM, and people doing it in moving (!?) cars; and a ceaseless string of unfunny clichés about post-adolescence in the mid-80s, complete with silly spoofs on MTV (back when MTV actually played music videos.) Avoid. But if you do indulge, look for the bad cameos of Michael Winslow as Spencer, Grandview's most visible Black man. Let's just say, Winslow made his mark as the um, \"vocal talent\", in the Police Academy series, wildly popular in the mid-late 80s. 1 deep regret out of 10, but don't take my word for it; Jamie Lee reportedly said so, herself. A screening will leave you with no doubts as to why.",
         "I lived near Pontiac IL for 12 years and after seeing the movie and recognizing places I went when I was growing up it was special.One question though if anyone knows Was the main house in the movie the funeral home in town? My brothers and I have wondered that for a long time. If anyone has an answer to that email me at frog4good@hotmail.com, also does anyone know if any scenes were done in Saunemin IL. thats where I lived and went to school thru 7th grade, my parents worked in Pontiac at the chair factory, then my mom worked at the hospital and my dad worked at the prison.We always thought that the track was near Fairbury but I guess not is there any place where this movie can be rented I have check Block Buster and they don't have it i think its one of those hard to find movies. thanks a bunch Dolores Ogden",
         "... this might just be The Bad 80s Movie. The cast is all the Usual Suspects: Patrick Swayze, Jamie Lee Curtis, Jennifer Jason Leigh, etc. The plot is the basic \"Don't destroy my dream!\" stuff (see Fame, Flashdance, Footloose, to name just a few of the Fs). The fashions -- well, I won't go there, except to say that looks that might occasionally have been found in trendy NY or LA clubs were generally absent, or at least muted, in the hinterlands of rural America. OK, so some movies don't age as well as others, but I mean, come on! MTV choreographed dream sequences? This was on cable one night and my wife and I just couldn't tear ourselves away. Upon JLC's appearance, my first thought was that this must have been a 'rent' movie, early in her career. On the contrary! She'd already had success with Halloween, Halloween II, and Trading Places! Viewing this film today, 20 years on, is more an exercise in humility than nostalgia.",
         "This movie was a real waste of some good talent. Big name stars that could not do much to help this stinker. As I recall, it was a dud in the theaters, so I'd imagine after paying the talent, they lost money. The story is stupid & 1/2 way into it, you find yourself saying \"who cares?\" This movie has the same dumb storyline as the movie Roadhouse David vs Goliath. Why should anyone care about trying to save a broken down demolition derby racetrack?...Mike (Jamie Lee) would be smart to sell it, take the money & run, thus saving us from the pain of watching her & the other losers from trying to save it. The only highlight is seeing Jamie Lee naked. It was filmed in a little one-horse town in central Illinois, I have been through there several times. I'll bet people there still talk about it. Not much else to do there but watch the stoplights change."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["CBS Entertainment Production"],
      "summaries": ["Life in the small town of Grandview, Illinois is one that is just like any other city or town. Tim Pearson, soon to be graduating high school wants to go to Florida to study oceanography. He meets Michelle \"Mike\" Cody and is attracted to her. She runs the local Demolition Derby place. Ernie \"Slam\" Webster is on of the drivers in the derby who's wife is cheating on him and wants to later on be with Mike. Tim falls for Mike and a big love triangle is about to happen."],
      "budget": 0
   },
   "movielensId": 2242,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-08-03",
      "dvdReleaseDate": "2011-10-04",
      "directors": ["Randal Kleiser"],
      "runtime": 97,
      "movieId": 2242,
      "title": "Grandview, U.S.A.",
      "mpaa": "R",
      "actors": [
         "Jamie Lee Curtis",
         "C. Thomas Howell",
         "Patrick Swayze",
         "Jennifer Jason Leigh",
         "William Windom",
         "Troy Donahue",
         "Carole Cook",
         "M. Emmet Walsh",
         "Ramon Bieri",
         "Elizabeth Gorcey",
         "John Philbin",
         "John Cusack",
         "Joan Cusack",
         "Camilla Hawk",
         "Melissa Domke",
         "Jason Court"
      ],
      "imdbMovieId": "0087359",
      "originalTitle": "Grandview, U.S.A.",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["LrzTpelAFVA"],
      "plotSummary": "Life in the small town of Grandview, Illinois is one that is just like any other city or town. Tim Pearson, soon to be graduating high school wants to go to Florida to study oceanography. He meets Michelle \"Mike\" Cody and is attracted to her. She runs the local Demolition Derby place. Ernie \"Slam\" Webster is on of the drivers in the derby who's wife is cheating on him and wants to later on be with Mike. Tim falls for Mike and a big love triangle is about to happen.",
      "tmdbMovieId": 84116,
      "avgRating": 2.5,
      "releaseYear": "1984",
      "numRatings": 72,
      "posterPath": "/uv050doScga5vL2dkq0fhvVEcB1.jpg"
   }
}