{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0092537",
      "video": false,
      "title": "The Allnighter",
      "recommendations": [],
      "backdrop_path": "/7yzfTwwg5MKz5RGri2XckUh7cfb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Molly Morrison",
               "gender": 1,
               "credit_id": "52fe46709251416c91054947",
               "name": "Susanna Hoffs",
               "profile_path": "/aRkjQLG25OfERPi0SaHznFcoQTA.jpg",
               "id": 118589,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gina",
               "gender": 1,
               "credit_id": "52fe46709251416c9105494b",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Val",
               "gender": 1,
               "credit_id": "52fe46709251416c9105494f",
               "name": "Dedee Pfeiffer",
               "profile_path": "/9kgehqEvh92wzKzFpunMIckZTHf.jpg",
               "id": 91332,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sgt. McLeesh",
               "gender": 1,
               "credit_id": "52fe46709251416c91054953",
               "name": "Pam Grier",
               "profile_path": "/k4oITsTAfhmYICLkFBvgotnEcpU.jpg",
               "id": 2230,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "C.J.",
               "gender": 2,
               "credit_id": "5303f7efc3a3683a7300634f",
               "name": "John Terlesky",
               "profile_path": "/g30YnB2ioSEuJDKzseYdI8vb0sM.jpg",
               "id": 102439,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "5303f7fec3a3683a7a008e8b",
               "name": "Michael Ontkean",
               "profile_path": "/6IEe5QuVb1FKjPZahGtSDD3TcLQ.jpg",
               "id": 6678,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46709251416c91054959",
               "name": "Tamar Simon Hoffs",
               "profile_path": null,
               "id": 253869,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46709251416c9105495f",
               "name": "Tamar Simon Hoffs",
               "profile_path": null,
               "id": 253869,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46709251416c91054965",
               "name": "M.L. Kessler",
               "profile_path": null,
               "id": 584996,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.364064,
      "production_countries": [],
      "id": 37818,
      "vote_count": 4,
      "budget": 0,
      "overview": "Molly (Hoffs), Val (Pfeiffer) and Gina (Cusack) are graduating college, but on their final night, frustrations are aired. Molly is still looking for real love and Val is beginning to doubt if that is what she has found. Gina is too busy videotaping everything to really notice. When the final party at Pacifica College kicks off, things do not go exactly as planned.",
      "similar": [
         258480,
         370663,
         401898,
         12793,
         10735,
         27586,
         244772,
         3981,
         112160,
         858,
         634,
         437557,
         17130,
         10818,
         43923,
         250124,
         513,
         11634,
         141,
         297762
      ],
      "original_title": "The Allnighter",
      "runtime": 108,
      "poster_path": "/d4PHcESLlzPiGsa3yPsVEyXz5c.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1987-05-01",
      "vote_average": 4.3,
      "belongs_to_collection": null,
      "tagline": "Who says you can't do it all in one night?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tamar Simon Hoffs"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Tamar Simon Hoffs",
         "M.L. Kessler"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092537/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzNjQ2OTM5M15BMl5BanBnXkFtZTcwNzQ2MDAzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Susanna Hoffs, Dedee Pfeiffer, Joan Cusack | See full cast and crew »"],
      "reviews": [
         "The Allnighter is mostly a vehicle for Bangle Susanna Hoffs and she does a good job with it. Hoffs in fact saves this movie, as you get the feeling if she wasn't in it the movie would be pretty hopeless and completely forgotten by now. Somewhat derivative of many mid-to-late 1980s teen and college comedies, the plot really isn't much new, though it is fun to see the 80s fashion and hear music from that era again. Despite the weak plot, it will remind you of a time before you had to go out into the \"real\" world, and you can recall many of the desires and hopes put forth. Hoffs rarely talks about this film in interviews, and critics have not been very kind to it over the years. While not up to the level of films of the same era made by people like John Hughes, The Allnighter is worth a look once, more if you like and/or remember the Bangles.",
         "As a big fan of the Bangles, I couldn't wait to see this movie, in which that supersweet all-female band's lead singer takes a starring role. I was horribly disappointed. There isn't one likeable, or even sympathetic character in the whole thing, the humour is moronic, the production values below-par and the plot nonsensical. Right away, all credibility is blown when Susanna's character says she hasn't had one significant romance during her whole time at college. WHAT? Is the place full of blind guys or something?! The best scene is when she dances in her underwear, but that only accounts for something like 1.30m of an overlong movie...is it worth the trouble when you could just dig out the Bangles' Greatest Videos again? Susanna can clearly act, but she deserved a better vehicle than this mess.",
         "In the Allnighter, Molly, Gina, and Val are in for one last night together before they graduate from Pacifica College and go their own directions. Each one is faced with issues that makes them re-evaluate their lives before they head off into the real world. Along the way with a great supporting cast of CJ and Killer, the girls find out just what is in store for them. A great soundtrack, too bad it is not available. I promise you that when you watch this you will be taken back to a time in your life before you really knew what life was actually like.",
         "Okay, this might not be an award winning movie but it's sure worth watching! Love the scenery, the eighties style and the obligated happy ending of course! Sometimes it even made me wish I was there! A prep school in a tropical location, lots of pretty people, fun beach parties and lots of cocktails. And hey, mustn't it be wonderful to have a student house at the beach? Susanna did not act that bad and Joan Cusack is her own funny self of course! I saw this movie when I was a teenager, about 15 years ago and loved every second of it, even watched it more than once! Maybe you don't need any brains to understand this movie but must life always be so serious? It most certainly is NOT boring, just watch it with a big bag of popcorn and have fun!",
         "It is the night before college graduation and Molly, Gina, and Val want to make it one that they will never forget. Whether it is going to the Fiesta with surfer buds C.J. and Killer or partying with an old rock guitarist that went to their school, they plan on doing it all. Unfortunately, Susanna Hoffs feature film debut will make you wish that they did something even more memorable, because you will forget it an hour after watching it. It is a comedy, but unfortunately it suffers the flaw of not being funny. You might smile once or twice, but I doubt you will even chuckle at any of these misadventures. The film is basically just a dull, overlong, snoozefest. The acting is alright, not really good, but nothing terrible. The soundtrack is decent as well. Unless you are a fan of Susanna Hoffs, leave this one alone. * out of ****",
         "This film stars Susanna Hoffs (of Bangles fame) and focuses mainly on her desire to have a great romance(well in actuality, it's more her desire to get laid). This also gives us a glimpse into the lives of a group of college kids leading up to their graduation. Of course they get involved in the usual predicted teenage crisis, the importance of which seems greatly magnified to those involved. Sometimes the dialog proves hilariously awful in this silly mess of a film. Pam Grier, who is much too talented to be appearing in this forgettable teenage comedy romp, makes a short appearance as a lady officer. For a real Beach party film, one must look instead to the 1950s and the 1960s. Watch Frankie Avalon and Annette Funicello instead.",
         "Very funny comedy involving the last days of college for 3 girls and a videocamera.They go through romantic mis-adventures and two of them even get arrested.The script is funny and contains some great one-liners.\"This is a mistake,who do we speak to about mistakes?\" [Thats a quote from Joan Cusack who the funniest person in it.",
         "I was interested to see Susannah Hoffs in an acting role, however, it was made abundantly clear early in the film that she could not act, but then neither could most of the \"performers\" in this film. This is the worst of it's kind, the characters are dull & one dimensional, the sub-plots are ridiculous & worst of all it's just not entertaining. It's so bad that it is bad (and could never be good/bad), the filmmakers made it hard to care for the characters early in the film & you will be begging for them to disappear into oblivion by the end of this poor excuse at \"grad humour\". Stay Away!",
         "I thought this movie was great. It is your typical 80s flick, and being a child from the 80s I loved it. Susanna Hoffs shows us she cannot only sing but act. And where do they get the cute guys. I just wish it was longer or had a sequel.",
         "Molly (Susanna Hoffs of the Bangles) is on the verge of graduating from Pacifica college. Very smart, she will be delivering the valedictorian's speech on the morrow. But, her confidence is a bit shaken. She secretly loves a male classmate, who seems to prefer surfing to her and has never given her an indication of his undeclared affection. Thus, while her roommate Gina (Joan Cusack) is busy videotaping their last days and minutes, Mol hatches another plan. Dressing up to the hilt, she decides to make a play for a famous musician residing at a nearby hotel. A second roommate, Val (Dedee Pfeiffer), is already there, romancing her obnoxious, rich boyfriend. Yet, the night is young and the police and a bunch of hookers are about to cause trouble for our gals! Will they make it to graduation? This is a fun eighties movie, with attractive performers and a light, zany plot line. No, its not garnered any Oscars yet but will attract fans of romantic comedy, good looking young adults and California scenery. Why night book The Allnighter for tonight?"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Aurora Productions LLC",
         "Universal Pictures"
      ],
      "summaries": ["Molly, Val and Gina are graduating college, but on their final night, frustrations are aired. Molly is still looking for real love and Val is beginning to doubt if that is what she's found. Gina is too busy videotaping everything to really notice. When the final party at Pacifica College kicks off, things don't go exactly as planned."],
      "budget": 0
   },
   "movielensId": 2244,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-05-01",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Tamar Simon Hoffs"],
      "runtime": 108,
      "movieId": 2244,
      "title": "The Allnighter",
      "mpaa": "PG-13",
      "actors": [
         "Susanna Hoffs",
         "Joan Cusack",
         "Dedee Pfeiffer",
         "Pam Grier",
         "John Terlesky",
         "Michael Ontkean"
      ],
      "imdbMovieId": "0092537",
      "originalTitle": "The Allnighter",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Molly (Hoffs), Val (Pfeiffer) and Gina (Cusack) are graduating college, but on their final night, frustrations are aired. Molly is still looking for real love and Val is beginning to doubt if that is what she has found. Gina is too busy videotaping everything to really notice. When the final party at Pacifica College kicks off, things do not go exactly as planned.",
      "tmdbMovieId": 37818,
      "avgRating": 2.09091,
      "releaseYear": "1987",
      "numRatings": 99,
      "posterPath": "/d4PHcESLlzPiGsa3yPsVEyXz5c.jpg"
   }
}