{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "fbi agent",
            "id": 18525
         }
      ],
      "imdb_id": "tt0100212",
      "video": false,
      "title": "My Blue Heaven",
      "recommendations": [
         10631,
         2107,
         10168,
         26261,
         19382,
         14628,
         11591,
         20242,
         17795,
         11718,
         5709,
         9401,
         24249,
         10608,
         10141,
         14170,
         16148,
         24070,
         4918,
         11896
      ],
      "backdrop_path": "/n9T87j9AJ2zuzmfxrfyv8S0vfV4.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Vincent 'Vinnie' Antonelli",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084269",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Barney Coopersmith",
               "gender": 2,
               "credit_id": "52fe46ce9251416c7508426d",
               "name": "Rick Moranis",
               "profile_path": "/rVZbTJjM4g0Um6trlLHRiBzBO7t.jpg",
               "id": 8872,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Hannah Stubbs",
               "gender": 1,
               "credit_id": "52fe46ce9251416c75084271",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Crystal Rybak",
               "gender": 1,
               "credit_id": "52fe46ce9251416c75084275",
               "name": "Melanie Mayron",
               "profile_path": "/vFDm9CyXqbUBnbunSBVNlwuMrkY.jpg",
               "id": 83313,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kirby",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084279",
               "name": "Bill Irwin",
               "profile_path": "/zjvhlCC1LA5JUwfScQTwS1xLciP.jpg",
               "id": 58549,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Shaldeen",
               "gender": 1,
               "credit_id": "52fe46ce9251416c7508427d",
               "name": "Carol Kane",
               "profile_path": "/tftY60jQYQBcpGjqAzKIiFNZV2J.jpg",
               "id": 10556,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jamie",
               "gender": 2,
               "credit_id": "52fe46ce9251416c75084281",
               "name": "Jesse Bradford",
               "profile_path": "/irD0iVNTmR0kEkVTZmKTuZejbGH.jpg",
               "id": 17772,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dr. Margaret Snow Coopersmith",
               "gender": 1,
               "credit_id": "52fe46ce9251416c75084285",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Underwood",
               "gender": 2,
               "credit_id": "55b9612ac3a3684af1002afe",
               "name": "Ed Lauter",
               "profile_path": "/3mlQucZnEpYA1R8LxxKepsd7JpO.jpg",
               "id": 21523,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Will Stubbs",
               "gender": 2,
               "credit_id": "55b96140c3a3684af5002804",
               "name": "Daniel Stern",
               "profile_path": "/4dQb2rg4gajVuMOUTkmQx31GOyH.jpg",
               "id": 11511,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Billy Sparrow",
               "gender": 2,
               "credit_id": "55b96156c3a3684af5002808",
               "name": "William Hickey",
               "profile_path": "/zr7UJxP5MdEksn6ZaxeHbwr6o5Z.jpg",
               "id": 21282,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe46ce9251416c75084265",
               "name": "Herbert Ross",
               "profile_path": "/5bKYVnMfWhjAOmMHv7Y6boqnOja.jpg",
               "id": 18378,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe46ce9251416c7508428b",
               "name": "Nora Ephron",
               "profile_path": "/2DO8ef3VVkcmMX2m0Qfz01IkMl4.jpg",
               "id": 9248,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.176884,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16384,
      "vote_count": 85,
      "budget": 0,
      "overview": "FBI agent Barney Coopersmith is assigned to protect former Mafia figure turned informant Vincent Antonelli. In the witness protection program one is supposed to keep a low profile, but that is something that Antonelli has trouble doing. Coopersmith certainly has his hands full keeping Antonelli away from the Mafia hitmen who want to stop him testifying, not to mention the nightclubs...",
      "similar": [
         7516,
         10651,
         8012,
         754,
         8961,
         562,
         156022,
         273481,
         245891,
         241554,
         186,
         2252,
         261023,
         13184,
         2069,
         11647,
         769,
         9366,
         1422,
         395834
      ],
      "original_title": "My Blue Heaven",
      "runtime": 97,
      "poster_path": "/4rTJLIBocmu1WjadfcZL2nsivZd.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1990-08-17",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The stars of Parenthood in comedy about an urban hood finding suburbanhood.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Herbert Ross"],
      "runtime": 97,
      "synopsis": "Vinny, a low-level New York mobster enters the witness protection program in a SoCal suburb. His wife abandons him and as he adjusts to his new life he not only finds old habits are hard to break, but he isn't the only one. His exploits get a lot of negative attention from the divorced local DA - Hannah. His FBI custodian, Barney - also recently divorced - works hard to keep him out of trouble. Barney and Vinny teach each other a lot about their different approaches to living. As Vinny's court date approaches, hitmen, and business ventures with some 'new' old friends bring everyone together.",
      "writers": ["Nora Ephron"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100212/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MDc2NTgwOF5BMl5BanBnXkFtZTcwMDMwMzkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Martin, Rick Moranis, Joan Cusack | See full cast and crew »"],
      "reviews": [
         "At the time of its release, I thought this might be Steve Martin's best work. He's done so many good things that I wouldn't say what's his best anymore but he is very good in here. His Italian hoodlum accent is funny and the unique character he plays, \"Vinnie Antonelli\" is very entertaining to see and hear. This isn't a laugh-out-loud-type of comedy but a pleasant one all the way through with good subtle humor. The first half of the story was much better than the second half. It gets cornier as it goes on. Martin's supporting cast - Rick Moranis and Joan Cusack - don't quite cut it as an FBI man and district attorney, respectively, being ridiculous clown-type characters but, hey, this isn't supposed to be taken seriously. Moranis' \"Barney Coppersmith\" is stupid but likable and Cusack's \"Hannah Stubbs\" is overly silly. The language is very tame, especially for a PG-13 film. It's just a nice lighthearted comedy, worth a look or two. I saw it three times and by then, that was enough. The DVD version I saw wasn't a whole lot better than the tape with poor surround sound and a so-so transfer.",
         "After a car is stolen by a gangster: \"And where did you learn to jump start a car?\" \"I had to learn to jump start ambulances to get invalids to the dialysis machines.\" - Joan Cusack and Steve Martin, \"My Blue Heaven.\" There's a lot of fun to be found in \"My Blue Heaven,\" a simple little comedy with only good intentions. I find it almost impossible to dislike - it has little offensive material, it isn't a stupid, recycled movie packaged with marketable trimmings. Instead, it is a joyful little flick that knows it is no Oscar winner but still tries to entertain its audience. And it does. \"My Blue Heaven\" is pure heaven for anyone who appreciates fine comedy - it's a little bit wacky, a little bit goofy, and very, very funny. Steve Martin is perfectly cast as the wild and crazy Vincent Antonelli, a Mafia informer who has been entered into the Witness Protection Program. His wife wants no part of their new, cheery life in a suburban America so she leaves him early on. Rick Moranis is equally well-cast as Barney Coopersmith, the FBI agent assigned to protect Vinnie and make sure his new life is suitable to his comfort. Barney's wife has just left him, too. She complains that he is too anal-retentive. She even mentions that he has a technique for getting equal amounts of butter on his waffles. Meanwhile, Vinnie soon tires of his new life and resorts to crime - first little things, such as marking down prices on meat in the local grocery store - which results in the best single line in the entire film, when a perky employee greets Vinnie. His response is a four-letter-word that isn't nearly as (c)rude as it seems it would be at first. Soon he meets up with old partners and crime and they form a new crime syndicate - much to the chagrin of a female police officer named Hannah Stubbs (Joan Cusack), who seems to be the perfect match for Barney Coopersmith. Hannah is unable to prosecute Vinnie because he is a Federal Witness. At first she and Barney hate each other. Then they grow closer. Vinnie watches on with joyful interest. And what makes this movie so enjoyable, in part, is the chemistry between Martin and Moranis. It's their first film together since \"Parenthood.\" They're a good duo, and Martin is so out of character here you start to forget it's even him playing an Italian mobster. Compare Vincent Antonelli to Neal Page (Martin's character in \"Planes, Trains and Automobiles\"), and the difference in not only attitude but mannerisms and levels of intensity is clearly evident. Martin can play the middle-class American white male especially well, but this film clearly shows that he has not left his wacky background in such films as \"The Jerk\" far behind. \"My Blue Heaven\" came out the same year as \"Goodfellas\" (1990). It was impeccable timing - at the end of \"Goodfellas\" we are left with the penetrating image of Ray Liotta's character Henry Hill outside a suburban home in a cheery neighborhood which, remarkably, looks exactly like the neighborhood in \"My Blue Heaven.\" It could be argued that \"My Blue Heaven\" is an immediate sequel in some senses. Where \"Goodfellas\" left off \"My Blue Heaven\" starts - it just throws in some comedy. Which is why I don't understand its small impact when it first arrived in theaters. (Suffice to say, it sorta flopped.) I own this film on a VHS tape I purchased for $4.99 at Wal-Mart. I found it lying in the bottom of a discount video barrel with no-name titles. There are comedic gems that have gained respect over the years, and then there are comedic gems that have slipped by unnoticed. \"My Blue Heaven\" wasn't very noticed upon its release in 1990, the few critics who saw it seemed not to pay any attention to it. Funny how some of the most joyful comedies slip by. My Blue Heaven\" is a few laughs short of a comic masterpiece. 4.5/5.",
         "Steve Martin is a mobster turned informant in the U.S. Witness Protection Program, but his dishonest habits are hard to break in this clever little comedy. Director Herbert Ross uses a smart screenplay, talented performers, and a great premise to make \"My Blue Heaven\" work a lot better than most films of its genre. Rick Moranis is the FBI agent who tries to protect Martin from mafia hitmen and more dangerously himself. Joan Cusack is priceless as a local district attorney who wants to get Martin for every little offense he commits while awaiting his court date to testify. William Hickey is also good as one of Martin's shady friends. A good little film overall. 3.5 out of 5 stars.",
         "In my opinion Steve Martin's most under-rated film, in which he plays an Italian gangster put on a witness protection programme as he awaits to go to court. Martin was born to play this part, and his character's cocky swagger had me laughing every time he appeared! Rick Moranis also stars, and is his usual nerdy self, which is funny enough!",
         "I just watched Blue Heaven and I thought that it was a nice sweet comedy with two of my favorite comedians: Steve Martin and Rick Moranis. They make such a great duo and you can tell that they really enjoy each other's presence. This is the only Steve Martin movie my mom didn't have, so I had to rent it. But I was excited to see Steve Martin as a tough Italin mobster, so I couldn't resist the rental. My Blue Heaven is about a man, Vinny, aka, Todd, and he's about to go on trial to rat out some Mafia members, but he must be protected from hit men, so that's where Rick's character comes in. He must take care of Vinny and make sure that he isn't arrested or injured, but that's going to be hard since Vinny keeps getting into trouble with the D.A. played by Joan Cussack. Vinny also thinks it's a good idea that she and Rick get together and they do. But Joan is going to try her best to get Vinny busted. It's predictable, but it is a very adorable movie that I think any Steve Martin fan could appreciate. The cast was great and the story was very funny, I thought it was so cool that it was slightly based on Henry Hill's(who you probably remember from Goodfellas) life. Rick and Steve are just great and I think you'll enjoy this movie. 6/10",
         "My Blue Heaven is exactly the kind of movie you want to see after a long day of work, when you're just looking for something relaxing to spend your evening with. The movie is pretty simple and predictable, some of the gags are not too funny, but it has its good points. Steve Martin is great as an italian mobster, he plays really great. Some gags are very cool and funny, and the dialogue is many times interesting. In conclusion, a good watch. Vote: 6 out of 10.",
         "I saw this movie not long after its release in August,1990. It was a rather important and memorable part of my young life:I was getting ready to move off to college(among other things)and was needing a little distraction. Since I fancied myself as a Steve MArtin fanatic(still kinda do),I felt like I HAD to see this. While I would've never--not then,probably not now,either--thought this to be anything of great work,it's still a blissfully wonderful comedy. You might be able to take Vincent \"Vinnie\" Antonelli(Steve Martin,full-tilt commitment to the role)out of organized crime and the big city,but you cannot take the organized crime or big city out of Vinnie,as he frequently goes astray of the law in his witness relocation in a quiet desert community outside of San Diego. The fed assigned him Barney Coopersmith(Rick Moranis,mensch)seems to be woefully unable to keep a leash on his charge,but it's alright because while Vinnie may not sit still in protective custody,he's got a big heart for those around him keeping him out of prison. Naturally,while Vinnie may not be always above board about his actions,he's still pretty good on his word and intentions. Easy,breezy comedy directed by the late Herbert Ross and penned by Nora Ephron(who seems to be a much better screenwriter than director),it's a film that is as light as air on a subject not normally broached in this manner(even Analyze This! and its sequel,Analyze That! still had a somewhat heavy air in them,albeit still largely tongue-in-cheek). Credit the deft and intentional script and the intensely likable interplay between Martin and Moranis(not to mention the potential love relationship/tension brought on by Joan Cusack as a divorced mom and zealous local DA)for this fact. I saw this again recently having bought this on a \"Two-fer\" disc that was paired with The Man With Two Brains. While I bought the disc primarily to watch THAT film,this add-on was not only a good re-watch(or even,come to think about it,re-re-watch)but brought back a long,pleasant memory or two of film-going.",
         "When I reviewed the movie \"LA Story,\" I mentioned that the film had little quirks that made it unique. This movie definitely has its own quirks. Steve Martin is known for playing dopey roles, something he has played well and demonstrated in \"The Jerk,\" which was a classic in its own right. \"My Blue Heaven\" is deinfinitely a classic at best. Steve Martin plays Vinnie Antonelli, a mob family member who is referred into the Witness Relocation Program, and must live under a new name in San Diego until his trial. When we first meet Vinnie, we see a man in a shiny suit, sunglasses, and flat top and just have to laugh at the appearance. Then, he lays on his very funny (and fake) New York accent, and we have to laugh at it. He plays a \"stereotypical\" New York/Italian, and we're impressed. I found this movie to be particularly humorous. Many people (Italian and Non-Italian) know what Fongol is, and probably any Italian owning a dog (not me though) will have said it at least once to a dog. As an Italian, I think the concept of a non-Italian playing the role is golden, and we can laugh at ourselves and see how humorous we are. The scene which made me hysterical was when his family welcomed him in the airport and he spoke Italian to his mother. If you like Mafia movies, or Steve Martin, definitely check out this much overlooked comedy. With a Martin, as well as Rick Moranis, Joan Cusack, and a great supporting cast, you will truly love this film!!! Gratcie!!!",
         "The mobster Vincent 'Vinnie' Antonelli (Steve Martin) is under the witness protection program and the FBI agent Barney Coopersmith (Rick Moranis) is assigned to take Vinnie and his wife Linda to a house in the suburbs. However their wives leave Vinnie and Barney and the agent gets closer to the gangster and befriends him. Vinnie is a bon vivant and a crook and does not keep the necessary low profile. The District Attorney Hannah Stubbs (Joan Cusack) arrests him but Barney releases him from jail since he needs to testify against the Mafia. Soon Barney falls in love with Stubbs, but Vinnie gets into many troubles calling the attention of two hit men from the Mafia. The police officer Crystal Rybak (Melanie Mayron) protects him and they also falls in love with each other. In the end, the good-hearted Vinnie becomes a prominent personality in the suburbs. \"My Blue Heaven\" is a heartwarming comedy with funny moments. The good story is wasted with the uneven screenplay. Vinnie in the supermarket is hilarious and maybe the best moment of this movie. The conclusion is corny but entertaining. Steve Martin was originally cast as Barney and Arnold Schwarzenegger was cast as Vinnie but he left the production to work in \"Kindengarten Cop\". My vote is six. Title (Brazil): \"Meu Pequeno Paraíso\" (\"My Little Heaven\")",
         "I see where some people did not much care for this movie. That's the way it is with comedies. Not everyone has the same sense of humor. I liked it. I found Martin's character to be very entertaining. His constant stream of BS is very entertaining. I know it's comedy, so I am not like those people who felt a more traditional gangster actor would have been better. It's his very silly over the top style which I found endearing. Moranis is OK. He's too typecast for me, always playing a similar role. I thought he was maybe funnier in ghost busters. I don't know. He's a decent actor. It's that whole square role he plays that gets to me a bit. He's supposed to be boring, obviously. But he's maybe too boring. I found the female cop love interest for Martin to be great. She's cute and she's funny. Joan Cusack...I have liked her better in other roles. She's hilarious in Grosse Pointe Blank. She's OK in this role. I liked the silent film style \"captions, or whatever you would call them a lot. They added humor to the movie. In summary, I found the movie very light, very entertaining, and cute. I like that type of movie. If you want something that requires no thought, where your goal as a viewer is just to relax and be amused, this is perfect."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Hawn / Sylbert Movie Company",
         "Warner Bros."
      ],
      "summaries": [
         "The mobster Vincent 'Vinnie' Antonelli is under the witness protection program and the FBI agent Barney Coopersmith is assigned to take Vinnie and his wife Linda to a house in the suburbs. However their wives leave Vinnie and Barney and the agent gets closer to the gangster and befriends him. Vinnie is a bon vivant and a crook and does not keep the necessary low profile. The District Attorney Hannah Stubbs arrests him but Barney releases him from jail since he needs to testify against the Mafia. Soon Barney falls in love with Stubbs, but Vinnie gets into many troubles calling the attention of two hitmen from the Mafia. The police officer Crystal Rybak protects him and they also falls in love with each other. In the end, the good-hearted Vinnie becomes a prominent personality in the suburbs.",
         "FBI agent Barney Coopersmith is assigned to protect former Mafia figure turned informant Vincent Antonelli. In the witness protection program one is supposed to keep a low profile, but that is something that Antonelli has trouble doing. Coopersmith certainly has his hands full keeping Antonelli away from the Mafia hitmen who want to stop him testifying, not to mention the nightclubs...",
         "Vinnie is a smooth-talking mobster who is relocated from New York City to a suburb of San Diego by the Federal Witness Protection Program in exchange for testifying against the mob. He must start life over in a quiet town with nothing to keep himself entertained - until he runs across some old friends from the Big Apple and they start up a little business of their own. Vinnie's bad behavior wreaks havoc on the life of Barney Coopersmith, the straitlaced FBI agent assigned to protect him. Barney must struggle with Hannah, the local assistant D.A., to keep Vinnie out of prison and safe from the mob before his testimony. Before long, Vinnie is sweet-talking Hannah into dates with Barney and teaching Barney how to dance, dress, and become a lady killer as they run from Mafia hit men and nearly escape murder in Manhattan.",
         "An all too uptight FBI agent must protect a larger than life mobster with a heart of gold, currently under witness protection in the suburbs."
      ],
      "budget": 0
   },
   "movielensId": 2249,
   "movielens": {
      "languages": [
         "English",
         "Magyar"
      ],
      "releaseDate": "1990-08-17",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Herbert Ross"],
      "runtime": 97,
      "movieId": 2249,
      "title": "My Blue Heaven",
      "mpaa": "PG-13",
      "actors": [
         "Steve Martin",
         "Rick Moranis",
         "Joan Cusack",
         "Melanie Mayron",
         "Bill Irwin",
         "Carol Kane",
         "Jesse Bradford",
         "Colleen Camp",
         "Ed Lauter",
         "Daniel Stern",
         "William Hickey"
      ],
      "imdbMovieId": "0100212",
      "originalTitle": "My Blue Heaven",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "mPKLrdt7Ym8",
         "jDzIBacY6bQ"
      ],
      "plotSummary": "FBI agent Barney Coopersmith is assigned to protect former Mafia figure turned informant Vincent Antonelli. In the witness protection program one is supposed to keep a low profile, but that is something that Antonelli has trouble doing. Coopersmith certainly has his hands full keeping Antonelli away from the Mafia hitmen who want to stop him testifying, not to mention the nightclubs...",
      "tmdbMovieId": 16384,
      "avgRating": 3.11848,
      "releaseYear": "1990",
      "numRatings": 1878,
      "posterPath": "/4rTJLIBocmu1WjadfcZL2nsivZd.jpg"
   }
}