{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "employee",
            "id": 6021
         },
         {
            "name": "workplace",
            "id": 6282
         },
         {
            "name": "sexual harassment",
            "id": 10850
         },
         {
            "name": "intrigue",
            "id": 34038
         }
      ],
      "imdb_id": "tt0109635",
      "video": false,
      "title": "Disclosure",
      "recommendations": [
         4478,
         10998,
         9879,
         867,
         9944,
         249,
         37233,
         1965,
         2636,
         10493,
         9869,
         10083,
         12150,
         9623,
         11074,
         9605,
         7007,
         3595,
         11092,
         11060
      ],
      "backdrop_path": "/fgFBzaD5BQ1uO6eK2G4tMMKpzqX.jpg",
      "revenue": 214015089,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tom Sanders",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab193",
               "name": "Michael Douglas",
               "profile_path": "/nmlitv4g2jXO3sJrnA9g980j2uc.jpg",
               "id": 3392,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Meredith Johnson",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab197",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bob Garvin",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab19b",
               "name": "Donald Sutherland",
               "profile_path": "/luKIiU3wAAZ5C6j2053g35cRhzE.jpg",
               "id": 55636,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Philip Blackburn",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab19f",
               "name": "Dylan Baker",
               "profile_path": "/6r8DkPjWQDVe3Ak1peMeOHhtXqL.jpg",
               "id": 19152,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Cindy Chang",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab1a3",
               "name": "Jacqueline Kim",
               "profile_path": "/3xvzDHNIKnkdK5YU6raXdkjqWBJ.jpg",
               "id": 56485,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Catherine Alvarez",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab1cb",
               "name": "Roma Maffia",
               "profile_path": "/tfscWeBOGA9aysLbYoOduimpTOk.jpg",
               "id": 21366,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Susan Hendler",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab1cf",
               "name": "Caroline Goodall",
               "profile_path": "/f3L5WmEtGjjONTe8qvBZOy2dWTJ.jpg",
               "id": 6692,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Stephanie Kaplan",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab1d3",
               "name": "Rosemary Forsyth",
               "profile_path": "/tZx3Vs1ZTfwQuAnP6Ljs1AwnaU0.jpg",
               "id": 49958,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Mark Lewyn",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1d7",
               "name": "Dennis Miller",
               "profile_path": "/yYp2F8liCBOUCl7vzQ2xaa20Be2.jpg",
               "id": 18326,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Mary Anne Hunter",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab1db",
               "name": "Suzie Plakson",
               "profile_path": "/ngAW6Wue6z5LtGN00C6dwGfNm4V.jpg",
               "id": 8266,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Don Cherry",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1df",
               "name": "Nicholas Sadler",
               "profile_path": "/97hL5ECPZONeQtVBYEgj4osqfgx.jpg",
               "id": 50402,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Chance Geer",
               "gender": 2,
               "credit_id": "54e12a15925141469f004047",
               "name": "Donal Logue",
               "profile_path": "/h0JZ8Hyc9p6sY2jQeJkDcax6UY3.jpg",
               "id": 10825,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1a9",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1af",
               "name": "Paul Attanasio",
               "profile_path": "/b1kDQeND9wLhIOhowtqrZG6Alkr.jpg",
               "id": 45543,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1b5",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1bb",
               "name": "Ennio Morricone",
               "profile_path": "/tlntfyflyEHgJTFjqIgg8P8UIx9.jpg",
               "id": 1259,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1c1",
               "name": "Tony Pierce-Roberts",
               "profile_path": null,
               "id": 3960,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab1c7",
               "name": "Stu Linder",
               "profile_path": null,
               "id": 5166,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 14.156556,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8984,
      "vote_count": 286,
      "budget": 55000000,
      "overview": "A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life.",
      "similar": [
         340837,
         7972,
         4421,
         10404,
         51540,
         11878,
         11971,
         4912,
         10867,
         11368,
         339527,
         3037,
         28455,
         11208,
         10742,
         9065,
         11090,
         4613,
         8094,
         45156
      ],
      "original_title": "Disclosure",
      "runtime": 123,
      "poster_path": "/qbwcjmHnXkeE8l7wNBsdnlrp3J4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Baltimore Pictures",
            "id": 11407,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-12-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Sex Is Power.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barry Levinson"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "Michael Crichton",
         "Paul Attanasio"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109635/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MTU3NTY1OF5BMl5BanBnXkFtZTcwMjQ3OTYxMQ@@._V1_SY317_CR11,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Douglas, Demi Moore, Donald Sutherland | See full cast and crew »"],
      "reviews": [
         "This was satisfying to watch, just to see justice done to an evil character (played well by Demi Moore). It's also refreshing - and astonishing - to see the flip side of the coin: a man accusing a woman of sexual harassment and proving it! What a unique twist, almost unheard of in the Liberal world of mainstream films. Michael Douglas co-stars with Moore and is good, too, but I found Douglas' lawyer \"Catherine Alvarez\" played by Roma Maffia, to be the most interesting of them all and making the most profound statements in this tale of \"power\" (not sex). Donald Sutherland gives another convincing performance as a \"bad guy\" as well. That's a role he seems best suited to play. All the actors are good on this adaption from a Michael Crichton book. The radical feminists didn't like this movie, so you know the the film has something going for it besides good acting and dialog. They want everything slanted to them, but as it's pointed out in the film, things can go both ways.....and what's wrong with an even playing field?",
         "Tense thriller mixes legal suspense, gender-role debate and technology-based action, with mixed results. In fact, its all good except for the computer stuff. The firm which the film revolves around is Digicom (a bit too made-up sounding for my liking), a computer technology firm. We're told at the beginning that the firm is developing a new technology, which will be used as collateral in the upcoming merger. They develop a sort of virtual reality file-scanning system, which doesn't make file-searching any easier whatsoever, but is more like an unnecessary toy for show - but it plays a part late in the film that, for me, was my only complaint about the film. All of a sudden, we go into the machine, and it just sticks out like a sore thumb as being totally wrong for this movie - we're in a sci-fi movie all of a sudden. Plus, it was totally unnecessary. In the scene straight after, the character reports what they discovered in the machine, so it was more for show than relevance - but it ends up hurting the consistency of the film for those five minutes. This film suffers a little from the same thing the Sandra Bullock vehicle The Net suffers from - in hindsight, now that we've all just accepted the internet and computers as a helpful part of our daily existence, all these old fears we had seem slightly silly. Its a bit like looking back at those Y2K scares and thinking how ridiculous we were to be so afraid. Unlike The Net, though, technology-phobia is only in the subplot of this film. Its more about what happens between Michael Douglas and Demi Moore late one night at the office, and what happens afterwards. Its very wordy - so be prepared for that. A couple of early dialogue scenes should have been rewritten with the dialogue absent, and told with a couple of thoughtful extended shots. But maybe i only think that because i've just gotten into Antonioni. He really makes this movie look reliant on words. The sex scene is so well choreographed as to feed an entire movie's worth of plot. Its sexy - true, Demi Moore radiates sex appeal like you wouldn't believe - its an incredible scene to watch. But its stict mechanics are also very necessary for the rest of the plot. Its one of the most necessary and justified sex scenes i've ever seen. Overall, it works. Its a tense thriller with two really incredible performances from the leads. I don't think its an essential movie, and its not particularly pleasant, if that's what you're after, but if you want a good tense thriller (which many of us do), this is worth a rental. Plus, we feel for Michael Douglas and want things to turn out good for him. So in that way, i think it deserves a workmanlike 7/10.",
         "I'm really surprised that there are next-to-no comments on this excellent thriller. It has been on ITV many times now, but I have only just caught it now after reading a second-hand copy of the novel. This thriller deals with the inequality between men and women in the corporate workplace brilliantly, displaying the clichéd attitudes of so-called friends and colleagues. this film has a real moral to it that rises it up from the blockbuster it is intended to be. The plight of the man against the megalomaniac female corporate boss seems quite desperate against the political correctness of the 90's, but is also sadly realistic showing what an unphilanthropic, complicated world this sometimes is. Especially in the ever-dominant world of corporations, simple human empathy is lost against a backlash of other most often selfish concerns. Michael Douglas as Tom was superb, although the acting of Meredith was sometimes a bit too clichéd, although this of course is what it was meant to be. All-in-all a very enjoyable, gripping thriller with all the plot that only usually a novel adaptation can give, exploring a real contemporary issue which other thrillers typically leave blank.",
         "Sexual harrassment soars to new concepts in this compelling film based on the novel of the same title by Michael Chricton. Tom Sanders (Michael Douglas) is psyched up about his promotion at DigiCom. But, as he arrives at work that morning, he finds out that the promotion never happened, but the position of Vice President was given to a woman. Of course, its not just any woman, its Meredith Johnson (Demi Moore), a woman from his past. Sanders discloses that he once was in a whirlwind romance with Meredith, but they parted ways and he came to Seattle, married, and started a family. Now, she wants nothing more to rekindle their romance, which Sanders doesn't want. An after-hours encounter leads to Meredith crying sexual harrassment, Sanders claiming he was the one who was really harrassed. Now, Sanders must be able to push past her power and status to show people what Meredith is really all about. This was a great movie, based on an amazing novel. Douglas as Tom Sanders is what I expected, middle aged with a family, successful. However, the novel describes Meredith Johnson as blonde, while Demi Moore was not what I really pictured. However, her performance as \"Super-Bitch\" Meredith is convincing. She makes you hate her, no matter how much you like the characters she played in other films. The part where Sanders struggled with Johnson in her office was extremely graphic. My mom predicted that I would cover my eyes, but I was very fascinated with it. In the book, this particular scene was EXTREMELY long, about 15 pages. In conclusion, I thought \"Disclosure\" was a very well-done film with a great cast. Performances by Moore and Douglas were great, with a good supporting cast to back them up. It gives a good understanding of the American Legal System and sexual harrassment, and proves that sexual harrassment works on two levels. Sex is truly power, and if you have it, you have it, and if you don't...well, you'll have to work hard to prove yourself. I highly recommend seeing this film, but read the novel in addition to the movie. You won't regret it.",
         "Michael Doulgas and Demi Moore head this fine piece of work based on Michael Crichtons' novel. Douglas is Tom Sanders, a typical business man working with a fairly normal company. He is dark horse in the running for promotion, until Meredith Johnson(Moore) arrives. Meredith is an old fling, and she hasn't forgotten the past. When a desperate attempt to open old wounds, or relive steamy times goes awry, Meredith is sickened by Toms' monogamy, and wants revenge! Director Barry Levinson creates a brilliant conflict, which seems to grow heavy with each scene. The entire cast is phenomenal. Moore and Douglas are perfect in their roles, but the main attraction for my eyes, was the quick, smart, catchy performance of Catherine Alvarez by Roma Maffia. Film keeps a strong interest for the whole time, only lacking in some possible slow moments. Part of why the film works so well is the fact that Levinson keeps it intellectual, dealing with adults, and the way they handle these situations. Sex is not a crutch to use for the main stars, who, at the time, were rather big. Instead, sex is portrayed as the key power in the situation. Catherine Alvarez states in the film \"Sexual harassment is not about sex, it's about power. She has it, you don't\". Pretty catchy way to portray sexual harassment. Technology is later brought in as a power to...but why should I say anything more? See the film for yourself.",
         "This is a pretty good drama with an excellent cast of characters. The story centers around Michael Douglas, who plays a division head in a high tech company in Seattle that is undergoing a merger. Demi Moore plays his old girlfriend, an aggressive corporate executive, who comes in and snatches away the job promotion he was counting on, then failing to seduce him after hours, files a false sexual harassment with the company in order to get rid of him. It's interesting that although the story revolves around Michael Douglas's plight, it's the women who set the events in motion and who help the protagonist resolve the problem he's presented with. Female empowerment is the main theme of this movie. Demi Moore gets perhaps her best movie role ever by playing the sexual predator to Michael Douglas's easygoing mid-level manager. She knows how to play the corporate game much better than him, and quickly boxes him into a dicey situation. How does a guy explain that it was his female boss who hit on him and not the other way around as she claims? Demi Moore controls the situation well for most of the movie, and plays the villain so well that the viewer really enjoys when she finally gets her comeuppance. Roma Maffia does an excellent job of playing Michael Douglas's lawyer. He's lost on how to respond to the sexual harassment charges and what to do to preserve his job, and she forcefully takes over his defense and steers him towards a successful resolution. She also understands how the game is played and keeps her nerve when the company comes after her client. Caroline Goodall plays Michael Douglas's wife and displays a perfect combination of anger and support while he resolves the charges against him. A lawyer herself, she understands the situation her husband has gotten into much better than he does, and is there for him as both an advisor and partner. Rosemary Forsyth plays another female executive at the company who, without giving away the plot, mentors Michael Douglas through his dilemma. She's smart, but calm and principled, and in fact it is she, not Douglas, who eventually gets the promotion to head the company. Even though Michael Douglas is the protagonist and eventually overcomes the crisis he's facing, his character is basically weak in the movie. He's carefree and unfocused at the outset, assuming the job promotion is his because he's done a good job for the company, and is completely blindsided when a woman takes it away from him and then threatens his career and his marriage. Douglas eventually takes charge and with alot of outside help and some improbable plot twists gets the upper hand, but in the cutthroat world of corporate intrigue, he's the little fish who gets lucky and swims out of the net. Donald Sutherland hands in his usual fine performance as the president of the company. Dennis Miller plays a computer geek working for Michael Douglas and has a few humorous moments, but suddenly turns nasty in the middle of the movie and then just disappears. Dylan Baker plays a sort of Mr. Smithers kind of character to Donald Sutherland's Monty Burns, and is just egregious enough make you hate him, which is a good sign of a performance well done. There are a few plot twists that offend the viewer's senses and things are wrapped up just a bit too neatly, but all in all, this is pretty good entertainment from start to finish. The movie touches an important issues, sexual harassment in the workplace, and makes it more interesting by making the woman the aggressor and the man the victim. Not surprisingly, I noticed that women gave this movie a higher average rating than did the men.",
         "Even though I haven't read the book, if you ask me, DISCLOSURE is an excellent film that is sure to keep you on the edge of your seat and blow you away. Meredith (Demi Moore) kind of gave me the creeps. You'll understand why once you've read the book and seen this movie. However, I loved the way that Catherine (Roma Maffia) worked with Tom (Michael Douglas). In my opinion, the performances were top grade, the direction was superior, the costumes were perfectly designed, and the cast was perfectly chosen. Also, the soundtrack is really good, too. Before I wrap this up, I must warn you that this movie has some heavy sexual content if you're going to see it, so viewer discretion is strongly advised. Now, in conclusion, if you enjoyed Michael Crichton's title novel or like Barry Levinson films, I highly recommend this movie. It's sure to keep you guessing from start to finish.",
         "'Disclosure' is not to be missed. The plot is well-known enough not to be summarized here, but suffice it to say that this movie is loaded with crackling drama, edge-of-your-seat suspense, witty and snappy dialogue (best line - Garvin, on transferring Sanders to Austin: \"Making a lateral move to Austin is like a duck making a lateral move to 'a l'orange'\".) and a celluloid-melting seduction scene. Excellent acting all around (I like Michael Douglas, I don't care what they say), and the movie captures in a visceral way the high-powered, high-stakes, cutthroat world of business politics in the world of leading edge computer hardware and software development. My wife and I both give this one a straight 'A'.",
         "I was very surprised that nobody else has commented on this movie. It is one of the better Crichton book adaptations (although it still varies from the book a lot) and deals with an interesting (if not important) topic. The acting is good. The film has serious, comedic, and other aspects (including some computer and technical stuff). It is not a great movie, but it was well received and is at least above average. Plus, it has the feel and look of a good movie (it is not a waste of money).",
         "This film may not be exactly a thriller, but it comes close. Michael Douglas gives one of his best performances here as a man who is seduced by his boss (Demi Moore who is hotter than hell) and she sues him for sexual harassment. Good dialogue (by author Michael Chricton) and good performances make this watchable, and the plot is also kinda intelligent. Dennis Miller has a small role as a co-worker. A-"
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Baltimore Pictures",
         "Constant c Productions"
      ],
      "summaries": [
         "With his company about to merge, a happily married and successful computer expert is expecting a promotion. Instead the job goes to a woman from another plant with whom he had an affair in his bachelor days. His new boss, not only dangerously sexy but equally dangerously ambitious, has climbed the corporate ladder by exerting undue influence on the CEO. She apparently tries to pick up where they left off but he just about manages to resist. This liaison is soon revealed to be part of her master plan to consolidate power and use Tom as a scapegoat to cover her technical misdeeds. As his position at work comes under increasing pressure he decides to file charges of sexual harassment. This is the last thing the company needs.",
         "Sexual harassment is the theme, but here it is the man who is harassed by his new female boss. A high-flying executive, Meredith, is out to ruin her former lover, who she's just beaten to the top job in an electronics company, using every trick in the book.",
         "Tom Sanders is a brilliant manager for the Digicom Corporation, a computer company in Seattle, Washington. Happily married with two young children, Tom had big hopes for a promotion to the top brass by his boss, Bob Garvin.IUnstead, it goes to Meredith Johnson, Tom's seductive ex-girlfriend. Somehow Tom takes it with a grain of salt, until a personal meeting turns unto a night seduction when Meredith decides to relive her sexual fantasy and pick up from where they left off. Tom refuses and shoves her away, making Meredith completely frustrated. Tom only choice is to sue Meredith for sexual harassment. But then everyone in the company believes it was the other way around and his boss wants to transfer him to an another division, forcing him to lose everything Tom has ever gained. As the story unfolds, Tom discovers that not only is the system rigged against him, but Meredith is going to destroy his career, and bolster her own by blaming him for a serious error of judgment on her part. It becomes evident that the sexual harassment has been a delaying tactic used by Meredith to prevent Tom's discovery of the true problem. Tom's discovery would result in considerable embarrassment to Meredith, and would serve to cast him as 'hero'. Thus Meredith will stop at nothing to deflect and recast the blame. He has only four days to prove his innocence, save his marriage, and his job. Can he do it? Does he stand a chance?",
         "A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life."
      ],
      "budget": 32000000
   },
   "movielensId": 225,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-12-09",
      "dvdReleaseDate": "1997-08-22",
      "directors": ["Barry Levinson"],
      "runtime": 123,
      "movieId": 225,
      "title": "Disclosure",
      "mpaa": "R",
      "actors": [
         "Michael Douglas",
         "Demi Moore",
         "Donald Sutherland",
         "Dylan Baker",
         "Jacqueline Kim",
         "Roma Maffia",
         "Caroline Goodall",
         "Rosemary Forsyth",
         "Dennis Miller",
         "Suzie Plakson",
         "Nicholas Sadler",
         "Donal Logue"
      ],
      "imdbMovieId": "0109635",
      "originalTitle": "Disclosure",
      "genres": [
         "Drama",
         "Thriller",
         "Crime",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "ih2-TLzLjgk",
         "_UtApAxpjJ0"
      ],
      "plotSummary": "A computer specialist is sued for sexual harassment by a former lover turned boss who initiated the act forcefully, which threatens both his career and his personal life.",
      "tmdbMovieId": 8984,
      "avgRating": 3.28651,
      "releaseYear": "1994",
      "numRatings": 13408,
      "posterPath": "/qbwcjmHnXkeE8l7wNBsdnlrp3J4.jpg"
   }
}