{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0100134",
      "video": false,
      "title": "Men Don't Leave",
      "recommendations": [
         54715,
         59585,
         41166,
         49803,
         86408,
         57950,
         147747,
         54752
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Beth Macauley",
               "gender": 1,
               "credit_id": "52fe48c89251416c750b320d",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Charles Simon",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3211",
               "name": "Arliss Howard",
               "profile_path": "/zDBEVA7Skrje3A8bmR2VOJRwkZc.jpg",
               "id": 3229,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Jody",
               "gender": 1,
               "credit_id": "52fe48c89251416c750b3215",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Chris Macauley",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3219",
               "name": "Chris O'Donnell",
               "profile_path": "/pjIwKa4AkgTzDO2Onz9dPn5KZTr.jpg",
               "id": 5577,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Lisa Coleman",
               "gender": 1,
               "credit_id": "52fe48c89251416c750b321d",
               "name": "Kathy Bates",
               "profile_path": "/pwHCkfIBeDdz93RlcmDWqXefozi.jpg",
               "id": 8534,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Matt Macauley",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3221",
               "name": "Charlie Korsmo",
               "profile_path": "/5TiMQj3AXDVL1wDVtQss2xUPzTC.jpg",
               "id": 13389,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Mrs. Buckley",
               "gender": 1,
               "credit_id": "52fe48c89251416c750b3225",
               "name": "Belita Moreno",
               "profile_path": "/iDqySqSJSLSAI0eaE4R7o136zft.jpg",
               "id": 152863,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Mr. Buckley",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3229",
               "name": "Jim Haynie",
               "profile_path": "/xOOfHlwhjY9OKeLeUCJ2oiSz8gn.jpg",
               "id": 10380,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Winston Buckley",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b322d",
               "name": "Corey Carrier",
               "profile_path": "/vG4WOj5M5IYFf0Mnl8bUs7zhoCr.jpg",
               "id": 94968,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3231",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Fred",
               "gender": 0,
               "credit_id": "52fe48c89251416c750b3235",
               "name": "David Cale",
               "profile_path": null,
               "id": 1006136,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "John Macauley",
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3239",
               "name": "Tom Mason",
               "profile_path": "/lWPITFNNJOoJprOoatAgfVRV9pH.jpg",
               "id": 80874,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3203",
               "name": "Paul Brickman",
               "profile_path": null,
               "id": 57383,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe48c89251416c750b3209",
               "name": "Thomas Newman",
               "profile_path": "/nZSsNIrjbkqqxFYwsD3zcHskxdP.jpg",
               "id": 153,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe48c89251416c750b323f",
               "name": "Jon Avnet",
               "profile_path": "/ckcE5lD7KNCh6iYHwCbfbs4r2y2.jpg",
               "id": 18250,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.418658,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 91217,
      "vote_count": 13,
      "budget": 0,
      "overview": "After her husband John dies unexpectedly, Beth Macauley is unprepared for life without him. She is unemployed with no job skills and $60,000 in debt from on-going renovations to their house located in suburban Bingham. She doesn't know what to do but sell what material possessions she has, such as the family pick-up truck and the house, and move into an apartment in the city, namely Baltimore. Beth just wants to survive by finding a job she doesn't dislike, and keep her family together while trying to maintain her sanity and sense of self-worth",
      "similar": [],
      "original_title": "Men Don't Leave",
      "runtime": 115,
      "poster_path": "/nG4QJg4ukabGAgbmANMCNBxUtp1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Geffen Pictures",
            "id": 360,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1990-02-02",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.imdb.com/title/tt0100134/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Brickman"],
      "runtime": 115,
      "synopsis": null,
      "writers": [
         "Barbara Benedek",
         "Barbara Benedek"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100134/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NjkxMzcwMF5BMl5BanBnXkFtZTcwODU3NDMxMw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Jessica Lange, Kathy Bates, Arliss Howard | See full cast and crew »"],
      "reviews": [
         "This is my absolute favorite movie. The quiet story of a young widow coping with the loss of her husband and a move to the big city is tender, humorous and hopeful. Fine performances by Jessica Lange, Chris O'Donnell (in his first screen role), Kathy Bates, Arliss Howard and Joan Cusack round out this film. Casting is perfect in every sense and the emotion of the movie is carried well by a haunting score. One of my favorite scenes has Lange arriving unannounced at Howard's home. Her sadness is palpable and his gift - a trip to the Polka hall, where she loses herself in a wild dance with a waitress, while he sits in with the band - is moving. There is such a sense of hope, generosity and goodness in this movie. It is not at all maudlin, or contrived. Just a wonderful exploration of the darkness of grief and unwelcome change, and the love and support sometimes found in unexpected places. There are also great comedic moments, chiefly involving O'Donnell and Cusack. See this movie!",
         "Widow with two growing sons must become her family's breadwinner, keeping everyone's spirits up while dating again for the first time in many years. It doesn't surprise me that people have to see this picture twice or more to get into the movie's grooves. The handling is very focused, the writing gets us from A to Z smoothly enough, but the tone of \"Men Don't Leave\" is quirky, to say the least. Sometimes I wasn't sure whether to laugh or not. At times it seems to go overboard, other times it hits a perfect note yet doesn't follow through. Still, the overall effect of this movie is genuinely pleasurable. It's not a big, chancy movie with issues, it's quiet and small and heartfelt. There are little scenes of emotion that well up into big hurts (and disappointments like the lottery family that just KILL us), and all the acting is so wonderful, particularly Jessica Lange (a shaky tower of strength). I loved it when the German woman gets Jessica to dance, or when she gets a nosebleed while kissing Arliss Howard for the first time, or throwing all her muffins out the window while feigning basketball moves. And what about Kathy Bates as the boss from Hell? It's an erratic film (with a puzzling title), yet I admired it greatly, and it has stuck with me over all these years. ***1/2 from ****",
         "I had originally seen this film at the theater with my 1st wife, and didn't think much of it. Being the only other film directed by the guy who did \"Risky Business\" - I had higher hopes for the movie than what I came away with. Over the years, however, especially after my 1st wife passed away - I was haunted with memories of this film, as I saw my life mimic many of the actions of the principle characters. For someone who hasn't had to deal directly with grief, this film probably will seem like just an odd little film. But the actions taken by Jessica Lange, Chris O'Donnell and Charlie Korsmo are all perfect prototypes of how people deal with grief and denial. Director Paul Brickman does so in an understated way, so that the film seems more light-hearted than the message it conveys.",
         "I am a longtime fan of Jessica Lange's, and a newfound fan of Arliss Howard's after viewing Men Don't Leave. A really good performance also by Chris O'Donnell and Joan Cusak. This is a true-to-life type of movie. It's Wow Factor isn't measured by action shots or stunts or explosions, but rather by the satisfaction and peace each character reaches by story's end. It's your favorite shirt: not flashy, but comfortable and proven to make you feel good. Watch Men Don't Leave - it's a good little movie.",
         "A true sleeper; a heartfelt drama with an odd title that isn't really 'about' any one thing, but ends up more truthful about life than most higher-profile Hollywood product. It's a movie that's rather slow and low-key, but stick with it. There are many wonderful moments along the way, both funny and poignant, conveyed with remarkable verisimilitude by a skilled cast. We've grown accustomed to the excellence of Jessica Lange, convincing here as a recent widow trying to make a new life for herself and her boys, but she's ably supported by Arliss Howard, Joan Cusack, and especially Chris O'Donnell and Charlie Korsmo, who play her sons. Director Paul Brickman hasn't made many films but this is surely his best; he also collaborated on its quietly-observed, slice-of life script with Barbara Benedek (THE BIG CHILL). Thomas Newman's spare, haunting score reveals why he's one of the finest film composers working today. Also, despite other user comments, this is not a 'tearjerker.' MEN DON'T LEAVE comes by its emotional impact honestly, with restraint and subtlety. Other filmmakers could learn a thing or two from Lange, Brickman et al. Highly recommended.",
         "It usually takes me two viewings of a film to decide whether I think it is a great film. The second that \"Men Don't Leave\" ended I knew it was a great film. It tells the story of a middle aged woman (Jessica Lange) who moves her two sons to Baltimore following the death of her husband. There she meets a quirky musician (Arliss Howard) and her older son starts dating an equally quirky x-ray technician (Joan Cusack). This film is by turns joyful and heartbreakingly sad and features sure-handed direction by Paul Brickman and a beautiful score by Thomas Newman who also scored \"American Beauty\". The performances are wonderful, most notably Jessica Lange's and Joan Cusack's. If you're looking for a wonderful family drama with comedic moments then \"Men Don't Leave\" is for you. One of the best films of the 1990's.",
         "Breadwinning husband and father dies and leaves wife and two sons nearly broke and homeless. Jessica Lange has never been better than here as Beth Macauly, a woman who is almost driven to insanity in the chaotic aftermath of her husbands death. Its not completely dark, though...there is quite a bit of humor as the family tries to adjust to the new environment and people that touch their lives. This film is one of the few model examples of all main characters performing the tasks they were assigned perfectly. Excellent acting through and through.",
         "This film is certainly an exception. A remake from the French version \"Hot Air Balloon\", this film has many noteworthy aspects to it, including the excellent cast of Arliss Howard, Jessica Lange, Kathy Bates and Lange's troubled son Chris O'Donnell. Primarily Lange is a widower who has to sell her house and start over. She moves to a small apartment in Baltimore with her two children, who are not happy about it. She eventually finds work (there are some amusing scenes) for a catering company, owned by Kathy Bates (always a memorable character, in this case the tyrannical boss). Joan Cusack also adds humor to the latter half, having met O'Donnell, she starts dating him, Lange at first over-protective, then gradually becomes friends with Cusack. Cusack, as a therapeutic gesture, takes her on a hot air balloon. A seemingly silly gesture, but a metaphor for starting over. Well-done and never depressing, an excellent film worth viewing. 9/10.",
         "I like this film. Jessica Lange is very good as a wife/mom of two sons. She abruptly finds herself a widow after her husband dies in a work related accident. This is a woman who is used to having a partner to help deal with family life & issues & suddenly everything is on her shoulders. She's deep in debt & overwhelmed. (The adorable) Chris O'Donnell is great as the older boy, playing a typical bratty teenager arguing with Lange over choices & decisions she must now make. He's very convincing in a scene with Arliss Howard, later in the film, that shows just how much his mom means to him. Charlie Korsmo is the younger, more agreeable boy. Yet he's filled with many issues, underneath the surface, dealing with his dad's death & their relocation to Baltimore. He takes to a new buddy's home life because he misses the conventional family he was used to, much to Lange's dismay as she tries desperately to keep her family together. Joan Cusack plays a quirky, domineering neighbor & \"older woman\" interested in O'Donnell. A leaner than usual Kathy Bates (almost unrecognizable because she's all farpitzed with makeup, trendy clothes & hairstyle) plays Lange's bitchy, bitter boss when she must now enter the workplace. Arliss Howard is also on hand as a love interest for Lange. Not that much emphasis is placed on their relationship because the main focus of the film is on Lange & her son's. Now for that title. IMO it can be taken two ways, as a plea or a statement. \"Men Don't Leave\" because you're family needs you, or \"Men Don't Leave\" a family's mind's & hearts after they've gone.",
         "Lange is her usual extraordinary self, especially in that part of the film depicting--quite aptly--the onset of acute depression. Cusack deserves her oscar nomination--manages expertly one of the most appealing characters you will ever see on screen. Comedy, romance, and everyday tragedy put together in an affecting script that has few weak moments. If you are drawn to small films centered on human relationships that draw sniffles and chuckles of recognition and a welcome sigh of relief when it all turns out at the end, you will love this film."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Geffen Company, The"],
      "summaries": [
         "A mother of two sons finds life considerably difficult on her own after the death of her beloved husband. Due to debt she must move them to Baltimore, and deal with the hardships and all that comes with the city life.",
         "After her husband John dies unexpectedly, Beth Macauley is unprepared for life without him. She is unemployed with no job skills and $60,000 in debt from on-going renovations to their house located in suburban Bingham. She doesn't know what to do but sell what material possessions she has, such as the family pick-up truck and the house, and move into an apartment in the city, namely Baltimore. None of these actions sit well with her two sons, seventeen year old Chris and nine year old Matty, but they don't seem to have a choice. Once in the city, Matty, with his new slightly delinquent friend Winston Buckley, aims to help his mother buy back their house. Chris' main goals are to stop anyone from replacing his father, especially divorced Charles Simon, a musician in an experimental music orchestra who is interested in Beth, and to get to know Jody better, she the slightly older and straightforward nurse who lives in their apartment building. And Beth just wants to survive by finding a job she doesn't dislike, and keep her family together while trying to maintain her sanity and sense of self-worth."
      ],
      "budget": 0
   },
   "movielensId": 2250,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1990-02-02",
      "dvdReleaseDate": null,
      "directors": ["Paul Brickman"],
      "runtime": 115,
      "movieId": 2250,
      "title": "Men Don't Leave",
      "mpaa": "PG-13",
      "actors": [
         "Jessica Lange",
         "Arliss Howard",
         "Joan Cusack",
         "Chris O'Donnell",
         "Kathy Bates",
         "Charlie Korsmo",
         "Belita Moreno",
         "Jim Haynie",
         "Corey Carrier",
         "Kevin Corrigan",
         "David Cale",
         "Tom Mason"
      ],
      "imdbMovieId": "0100134",
      "originalTitle": "Men Don't Leave",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["TjYlfJMMM2s"],
      "plotSummary": "After her husband John dies unexpectedly, Beth Macauley is unprepared for life without him. She is unemployed with no job skills and $60,000 in debt from on-going renovations to their house located in suburban Bingham. She doesn't know what to do but sell what material possessions she has, such as the family pick-up truck and the house, and move into an apartment in the city, namely Baltimore. Beth just wants to survive by finding a job she doesn't dislike, and keep her family together while trying to maintain her sanity and sense of self-worth",
      "tmdbMovieId": 91217,
      "avgRating": 3.21481,
      "releaseYear": "1990",
      "numRatings": 412,
      "posterPath": "/nG4QJg4ukabGAgbmANMCNBxUtp1.jpg"
   }
}