{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0101530",
      "video": false,
      "title": "The Cabinet of Dr. Ramirez",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4966c3a368484e1296d7",
               "name": "Mikhail Baryshnikov",
               "profile_path": "/phF0evzvCvJhCrj4wUXd6Pnke9g.jpg",
               "id": 79952,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4966c3a368484e1296db",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4966c3a368484e1296df",
               "name": "Peter Gallagher",
               "profile_path": "/76p7x64BpkgNJCLb5d7xklQ1Fzd.jpg",
               "id": 8212,
               "order": 2
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4966c3a368484e1296d3",
            "name": "Peter Sellars",
            "profile_path": null,
            "id": 143279,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.009287,
      "production_countries": [],
      "id": 77314,
      "vote_count": 0,
      "budget": 0,
      "overview": "",
      "similar": [],
      "original_title": "The Cabinet of Dr. Ramirez",
      "runtime": null,
      "poster_path": "/8prmlT6iOYl3zFsDDJl9oDMUGeD.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1991-12-04",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Sellars"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Peter Sellars",
         "Joan Cusack"
      ],
      "originalLanguage": null,
      "imdbLink": "http://www.imdb.com/title/tt0101530/",
      "coverLink": null,
      "actors": ["Stars: Mikhail Baryshnikov, Joan Cusack, Peter Gallagher | See full cast and crew »"],
      "reviews": [
         "This is an unusual movie. I'd recently watched Thief, The (1952), another movie without any spoken dialogue or intertitles. That movie had a clear story that could be followed easily. This one is not so clear. To some extent Cabinet of Dr. Ramirez, The (1991) borrows from Kabinett des Doktor Caligari, Das (1920), but it's hardly a remake; no more so than Dr. Caligari (1989) I think. There's no spoken dialogue or diegetic sound. The only audio is the musical score, one that reminded me very much of Philip Glass and in particular his three -qatsi scores. Perhaps in consequence, occasionally the picture reminded me of Godfrey Reggio's -qatsi films too; for example, sometimes there were montages of shots of buildings (this movie has more of a story, though). Occasionally the film is completely silent. Sometimes there are words on the screen; some newspapers are glimpsed, a whole page of a book is seen (the page deals with the \"disappeared\" and the \"Mad Mothers of the Plaza de Mayo\" in Argentina), and three business-sized cards with fortunes printed on them are seen. One character in the movie is seen mouthing words directly into the camera, but unfortunately I can't even guess what he might have been saying (if anything). At the moment, this movie is labeled as a \"Comedy\" on IMDb. Perhaps it was meant as one, but no comedy was particularly evident to me. \"Drama\" seems more accurate. \"Horror\" wouldn't particularly fit; despite the roots in Kabinett des Doktor Caligari, Das (1920) and several deaths, it's not really a horror movie. Peter Gallagher's character works in an office, seated next to his roommate. He has a relationship with Joan Cusack's character. Their apartments are curiously bare, and they sleep on mattresses on the floor. Their boss is taken away by two people with badges. The city they work in has several peculiar homeless people, who are treated poorly by the police. For the rest, I guess you'll just have to try to see it.",
         "I saw this on PBS when it first aired. I was 25. I was prompted to watch it due to the tile, as I figured it must be a remake of The Cabinet of Doctor Caligari (another scary film). Lo and behold, it pretty much was. 13 years later, I have NEVER forgotten how scary this movie was. Every so often in passing have I seen in my mind the special effects that fill this film. Halllucinatory, phantasmagoric images encompassed every single corner of the screen during much of the film. That chant scared the wits out of me as well - yet the totally silent scenes were that much worse. Kudos to everyone involved in the movie -- it has a long-lasting effect on the viewer, which cannot be said for too many movies. I think that the images were provocative and came off the way schizophrenics may see the world -- non-stop slants, twists and unsure footings. For these, the camera angels were put to excellent use. Mikhail, Joan and Peter were all great. I could go on and on about this film, so I'll just keep it short, lest I get exhausted. I do hope that, if this ever plays again, that I will have heard about it because I'd love to get a copy of this. A truly disturbing experience. Highly recommended!",
         "This is the most recent favorite example of a genre I love: coordinated film and score. Others that have moved me a great deal in the past are Fantasia (1940) out of Walt Disney and Alexander Nevsky (1938).I saw The Cabinet of Doctor Ramirez (1991) on PBS TV and loved it instantly. Fortunately, I recorded it onto VHS tape (for my own private viewing), because the film was (as I understand) never released in the USA and I have since failed to find any copy for sale. The film was conceived principally by Peter Sellars (his first film project, I believe). The sound track is entirely made from the three parts of John Coolidge Adams orchestral work Harmonielehre, with two interpolations of Tibetan Buddhist monk chants and instruments. Obviously the film layout is timed to match the sections of the music. In a certain sense, it is the film that accompanies the music. I think it is all brilliant. Recently I have acquired a CD that includes the Harmonielehre work, and that reminded me to search again for a DVD or VHS copy of the complete film and its sound track. I will keep looking. ---------- music sequence: Harmonielehre (Harmony Study) parts 1 2 3 chants and instrumental C 1 2 C 1 2 C 3 ----------",
         "I saw the film in 1992 at one of its few screening. It left a powerful impression. It is brilliantly acted and beautifully shot. Joan Cusack proves that she is one of America's most underrated actresses. And I keep wondering why Peter Gallagher isn't doing something better... ah well.",
         "Any time this movie can be found it must be seen...drop everything you're doing and watch this well-acted/directed silent movie. Cusack is perfect for the part. The film has no hickups in direction, and flows to a perfect ending. I highly recommend it, though it's very very hard to find.",
         "I've seen this film over 2 years ago, during Cameriimage festival in Lodz. As I know it was the only screening of this movie in Poland. It was the last film showed that day, at about 24, and I was bit exhausted after seeing 4 or 5 other films. Just after the beginning I've fallen asleep, I began to dream, and as I was opening my eyes from time to time, those very bizarre scenes - its strange, heavy tension and surrealistic content - of \"Dr.Ramirez\" started to mix up with my own fantasies. It was incredible, how powerful it was (it is!!)! The images from \"The Cabinet\" has got straight into me, into my own intimacy; and became a true element of my perceptual and - at the same time - imaginative, or better - purely visual, conscience. I must sincerely admit, that probably it is still the most influential screening I lived through my whole life! I recommend it to all of you!! See it and gave me a sign if you have a copy ( I'd like to experience it once again)."
      ],
      "genres": [
         "Drama",
         "Music",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Mediascope",
         "Mod Films",
         "Paladin Films"
      ],
      "summaries": ["Featuring music instead of any dialogue and set in a near Kafkaesque future, this loose remake of The Cabinet of Dr. Caligari follows a bureaucrat whom mysterious Dr. Ramirez and his hideous sidekick want as their latest victim."],
      "budget": 0
   },
   "movielensId": 2251,
   "movielens": {
      "languages": [""],
      "releaseDate": "1991-12-04",
      "dvdReleaseDate": null,
      "directors": ["Peter Sellars"],
      "runtime": null,
      "movieId": 2251,
      "title": "The Cabinet of Dr. Ramirez",
      "mpaa": null,
      "actors": [
         "Mikhail Baryshnikov",
         "Joan Cusack",
         "Peter Gallagher"
      ],
      "imdbMovieId": "0101530",
      "originalTitle": "The Cabinet of Dr. Ramirez",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 77314,
      "avgRating": 2.73077,
      "releaseYear": "1991",
      "numRatings": 13,
      "posterPath": "/8prmlT6iOYl3zFsDDJl9oDMUGeD.jpg"
   }
}