{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "identity",
            "id": 1284
         },
         {
            "name": "custody battle",
            "id": 4056
         },
         {
            "name": "jinx",
            "id": 4367
         },
         {
            "name": "reporter",
            "id": 12193
         },
         {
            "name": "ex-wife",
            "id": 155816
         },
         {
            "name": "lost shoe",
            "id": 158438
         }
      ],
      "imdb_id": "tt0104412",
      "video": false,
      "title": "Hero",
      "recommendations": [
         10859,
         12157,
         9409,
         11896,
         10551,
         12518,
         918,
         11352,
         9941,
         9605,
         10013,
         6472,
         1049,
         10765,
         16297,
         10410,
         10407,
         5971,
         31052,
         10142
      ],
      "backdrop_path": "/icHXjVqx5qjv7axTU0NRtxvQYUz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bernard 'Bernie' Laplante",
               "gender": 2,
               "credit_id": "52fe43a59251416c7501878d",
               "name": "Dustin Hoffman",
               "profile_path": "/3pZx8NB30KIw31rBAT62TUDQFEb.jpg",
               "id": 4483,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gale Gayley",
               "gender": 1,
               "credit_id": "52fe43a59251416c75018791",
               "name": "Geena Davis",
               "profile_path": "/6b8cRJOItz7yNpYuLCPkl5kv4m2.jpg",
               "id": 16935,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John Bubber",
               "gender": 2,
               "credit_id": "52fe43a59251416c75018795",
               "name": "Andy García",
               "profile_path": "/zE3KYH6f6cxCehJJYKDTQa8sCaK.jpg",
               "id": 1271,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Evelyn Laplante",
               "gender": 1,
               "credit_id": "52fe43a59251416c75018799",
               "name": "Joan Cusack",
               "profile_path": "/3jcrXcFYoSKEUvokzqrQ2UJGtw.jpg",
               "id": 3234,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Chucky",
               "gender": 2,
               "credit_id": "58a22c70925141179a000401",
               "name": "Kevin J. O'Connor",
               "profile_path": "/1yeYRXpTbDYLMKUNT4hNQJTJsUX.jpg",
               "id": 18916,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Winston",
               "gender": 2,
               "credit_id": "58a22c80c3a368600b00045e",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Wallace",
               "gender": 2,
               "credit_id": "58a22c8992514117ba000419",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Chick",
               "gender": 2,
               "credit_id": "58a22c91925141179a00040f",
               "name": "Tom Arnold",
               "profile_path": "/udJkmZPrQs4D8NPV8u4BEv3rNLX.jpg",
               "id": 74036,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Robinson",
               "gender": 2,
               "credit_id": "58a22c9cc3a3685f9a000407",
               "name": "Richard Riehle",
               "profile_path": "/fFFjfOX7BUsfBQQP54K8QEkkEC2.jpg",
               "id": 18262,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Allen in Coma",
               "gender": 2,
               "credit_id": "58a22caa925141179e00040b",
               "name": "Martin Starr",
               "profile_path": "/sYKZBDsmDIhVY0juiwSDfv2RnPR.jpg",
               "id": 41089,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Deke - Channel 4 News Director",
               "gender": 2,
               "credit_id": "58a22cbdc3a3686001000442",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Mr. Broadman - Man Committing Suicide",
               "gender": 2,
               "credit_id": "5a5cd3580e0a26154a000d6c",
               "name": "Edward Herrmann",
               "profile_path": "/3AGRAverIuT6kgSfGQPiY55QZzG.jpg",
               "id": 52995,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "News Vendor",
               "gender": 2,
               "credit_id": "5a5cd3740e0a26154a000d8a",
               "name": "Jeff Garlin",
               "profile_path": "/cBs7u7rBTvDFp5MFCnvrPeF7SI2.jpg",
               "id": 60074,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Fireman Denton",
               "gender": 2,
               "credit_id": "5a5cd3a90e0a26154d000e4a",
               "name": "Daniel Baldwin",
               "profile_path": "/vDLkhz6EliUtYumpJdFTquUvdfp.jpg",
               "id": 24516,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "James Conklin",
               "gender": 2,
               "credit_id": "5a5cd3c00e0a26154d000e5d",
               "name": "Christian Clemenson",
               "profile_path": "/v1WvZ0EM0pMB0NCaTZ1Yq0nYpsb.jpg",
               "id": 41517,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Judge Goines",
               "gender": 2,
               "credit_id": "5a5cd3d50e0a261553000e91",
               "name": "Warren Berlinger",
               "profile_path": "/sPjUl670iugfgCH5TMLXqqNLrMP.jpg",
               "id": 19440,
               "order": 15
            },
            {
               "cast_id": 24,
               "character": "Director of Channel 4 Crash Feature",
               "gender": 2,
               "credit_id": "5a5cd3ee9251413447000cb1",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 16
            },
            {
               "cast_id": 25,
               "character": "Joey Laplante",
               "gender": 2,
               "credit_id": "5a5cd60e9251413443001078",
               "name": "James Madio",
               "profile_path": "/3s32FSsr95w6nGtoH5f9sPk1mPw.jpg",
               "id": 65395,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "Sylvia",
               "gender": 1,
               "credit_id": "5a5f40c70e0a2650a500115c",
               "name": "Clea Lewis",
               "profile_path": "/xg0epjCQSeEv6DviXfnYSryPCWn.jpg",
               "id": 1215072,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe43a59251416c7501879f",
               "name": "Laura Ziskin",
               "profile_path": null,
               "id": 7627,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a59251416c750187a5",
               "name": "Laura Ziskin",
               "profile_path": null,
               "id": 7627,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a59251416c750187ab",
               "name": "Stephen Frears",
               "profile_path": "/8IewTBLTPujw1t1MwpXba8cCXOU.jpg",
               "id": 3224,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a59251416c750187b1",
               "name": "George Fenton",
               "profile_path": "/23V03rGdkvNgeiBwLodJzNKdhJC.jpg",
               "id": 1528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a59251416c750187b7",
               "name": "David Webb Peoples",
               "profile_path": "/6B8mGTnE5K7JJTmYuwzWaogkRSK.jpg",
               "id": 7191,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a59251416c750187bd",
               "name": "Mick Audsley",
               "profile_path": null,
               "id": 294,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a59251416c750187c3",
               "name": "Oliver Stapleton",
               "profile_path": "/wfzgRB2LbfKvKJ50NZYebi9nv1c.jpg",
               "id": 16425,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.422377,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10699,
      "vote_count": 131,
      "budget": 42000000,
      "overview": "Bernie Laplante is having a rough time. He's divorced, his ex-wife hates him and has custody of their son, the cops are setting a trap for him, then to top it all, he loses a shoe whilst rescuing passengers of a crashed jet. Being a thief who is down on his luck, Bernie takes advantage of the crash, but then someone else claims credit for the rescue.",
      "similar": [
         11355,
         1949,
         11615,
         891,
         15,
         496,
         9652,
         16995,
         9008,
         3078,
         269,
         987,
         512,
         6557,
         9466,
         24807,
         86467,
         25670,
         394830,
         10879
      ],
      "original_title": "Hero",
      "runtime": 117,
      "poster_path": "/gT4qFlAcRcMvOanRPjke3MOSZGo.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1992-10-02",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "We're all heroes if you catch us at the right moment. Even Bernie Laplante.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Frears"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Laura Ziskin",
         "Alvin Sargent"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104412/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5ODg4MDMxOV5BMl5BanBnXkFtZTcwMjQ4NzEyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Dustin Hoffman, Geena Davis, Andy Garcia | See full cast and crew »"],
      "reviews": [
         "This film is terribly misrepresented by critics. True, it is not an insightful social critique. It is not a moving analysis of human nature. It is not a philosophical masterpiece. But it makes no pretensions to be any of these things. Hero is pure Hollywood, and is the very best of what Hollywood means, or meant at the time. The plot is clever, the writing is witty, the characters are interesting, and the acting is decent (Dustin Hoffman is great). The development is not meant to expose new subtleties of human emotion, but rather strongly to evoke obvious ones -- in this case, pride. In other words, it is meant to make you happy. That is not to say that the audience is barraged with heavy-handed judgments, merely that it does not require a degree in theater to like the film. It is interesting enough to be enjoyable after several viewings, but not subtle enough to require serious study. Hero is perfect for the intelligent moviegoer who wants to watch a film for fun, and that is the context in which it should be understood. It is Hollywood at its best.",
         "HERO is a funny, smart, vastly underrated screwball comedy about mistaken identity, and what exactly it is that constitutes \"heroism\". Dustin Hoffman plays Bernie Laplante, a small-time crook and generally unpleasant individual, who one rainy night is reluctantly drawn into helping rescue 54 passengers from a burning plane, after it has crashed into a Chicago bridge right in front of him! One of the survivors is Gale Gayley (Geena Davis), a glamorous news reporter, whose TV station decides to offer $1 million for an exclusive interview with the mysterious \"Angel of Flight 104\", who simply disappeared into the dark of the night before his act of bravery could be recognized, leaving one of his shoes behind amid the chaos. However, the \"Mr Cinderella\" who subsequently steps forward to claim the reward, and thereafter becomes lionized by both the media and the public, is not Laplante (rather inconveniently locked up in jail at the time), but John Bubber (Andy Garcia), a handsome, charismatic, though destitute Vietnam veteran, who intends to share his new-found wealth with the city's homeless and other charitable causes. Bubber is able to convince as the real hero, because he gave Laplante a lift immediately after the accident (and is handed Laplante's second shoe as a thank-you, to \"pay for the gas\"), and thus heard the full story of Laplante's adventure firsthand. British director Stephen Frears' third American outing (following 1988's DANGEROUS LIAISONS and 1990's THE GRIFTERS) was not a particular success at the box-office, and neither was it especially well-received critically. But I find that difficult to understand, as I think that HERO is probably the most downright enjoyable of all Frears' movies. The three leads are terrific - Davis looks sensational, Hoffman is suitably sleazy (and unexpectedly moving in scenes with his ex-wife, played by Joan Cusack, and his young son, James Madio), and Garcia injects his impostor role with warmth and credibility. The script (by the screenwriter of BLADE RUNNER and UNFORGIVEN) is bright and snappy, and there are fun, uncredited cameos from Chevy Chase (as Davis's pushy boss), Edward Herrmann (as a suicide victim - in a comedy? but yes it IS funny) and Fisher Stevens (as a film director, making a TV movie of the plane crash and using the real survivors as the actors). HERO was known as ACCIDENTAL HERO (a more appropriate title, in my opinion) in various territories (including the UK), echoing, of course, one of Davis's earlier film triumphs, namely Lawrence Kasdan's splendid THE ACCIDENTAL TOURIST (1988). This was also where Davis reunited with Hoffman, 10 years after the former made her brief film debut in the latter's cross-dressing smash TOOTSIE. Finally, the excellent song played over the end credits is \"Heart Of A Hero\", written and performed by Luther Vandross.",
         "Hero is the story of a not so nice man that performs an extra-ordinary act of courage. He rescues a crashed plane full of trapped passengers. And after he does, he disappears into the night, never to be seen again---that is until a T.V. station offers 1 million dollars for the man to come forward and identify himself. Someone else takes the credit through a funny series of events that should remain unsaid. This film is a true treasure. It not only examines fragile human issues like family responsibility, love, our stigmas that we set upon heroes and morality, but it is a damn entertaining movie. It is also a tearjerker. Not many people gave this film a chance but now that it is out on video, check this one out. You will be glad you did.",
         "Dustin H is at his brilliant best. Listen carefully to his closing speech to his son(delivered with passion in the zoo). Words of wisdom about the state of the human zoo we live in. The movie has humour, pathos and some great lines. One of my favourites.",
         "I disagree with the suggestion that this movie is fluff; just the opposite. It is truly unexpected. There's no phony character development, no sitcom silliness. What you have here is what I would call TRUE GRIT.  Dustin Hoffman gives one of his all-time best performances. Andy Garcia is equally true to character, and both actors get a chance to portray genuinely interesting characters. Yet, the ending could not be more perfect. Likewise, I'd argue that this movie does have social commentary. You'll see Chevy Chase at his best (although he doesn't appear in the credits). He illustrates the unholy alliance between news and show business in today's America. There's a great father-and-son story and an implied love story with Joan Cusack, someone who is underrated for her emotional expression. There's also a nice examination of truth and reality. Watch they boy from the plane. He can't remember what the hero said, so he is proud and excited to come up with what he thinks will sound good. Likewise, the hero's son finds the perfect answer to an awkward question for the news camera. We're all searching for that perfect answer if a news mike is stuck in our face. The hero sees this, and he is the only one in the movie who seems immune to it. He is my hero for remaining true to himself--as flawed as that is. No, this ain't Disney--it's Dustin, at his finest.",
         "With a cast of the best actors of our time and one of the great ironic scripts, second to none in adventure story line, this film is relentlessly powerful. Hoffman, Garcia and Davis misunderstand and misrepresent each other to a fine tease in a magnificent display of the highs and lows of being human in America in the late twentieth century.",
         "I saw \"Hero\" when it first opened in theaters, and tonight was the first time I saw it in 10 years. It's one of those amiable films that is virtually impossible to dislike. It's not the funniest comedy, nor are there any \"big\" laughs, yet I can't find anything lousy about this movie. And as a big plus, Dustin Hoffman is the star! He's one of my favorite actors, and I'm eager to see him in anything. He gives a fine, underrated performance that's both funny and touching, in an unpretentious way. His character of Bernie Laplante is no angel. He's rude, cranky and selfish. But he loves his son very much, and simply has trouble expressing his true emotions. It's always fun to see a serious actor in a comic role. And the advantage of it is serious actors approach comic roles in the same way they do any other roles. Like Gene Wilder said, \"I approach the role of Leo Bloom in 'The Producers' the same way Olivier would approach 'Hamlet.'\" Hoffman doesn't act goofy or ham it up, but simply plays it straight and lets the laughs come to him with his natural delivery. Andy Garcia delivers an endearing performance, and Joan Cusack is amusing as Hoffman's ex-wife. The plot is predictable and some of the characters are cliched, but overall the film is entertaining and at times moving. Though it is basically a comedy, it has its human elements that add an earthy quality to the film. My score: 7 (out of 10)",
         "I've seen this movie six times, or so, and look forward to seeing it again. I think Dustin Hoffman is one of the great actors and this was a great role for him. He and Geena Davis have real chemistry. I always regretted that the movie didn't get the recognition it deserves.",
         "It has already been a while since I've seen a movie with Dustin Hoffman in it, which is really a shame. I've always admired his work and once again he proves to be a very talented actor with this movie. This time he's playing Bernie Laplante, a little criminal who hasn't really had much luck in recent times. He's constantly having a fight with his ex over his son, he lives in a miserable apartment, he drives an incredibly old car... But than a plane crashes just right in front of his nose. And even though he has always been described as antisocial, he saves the lives of 54 people by opening the airplane's door and helping everybody out. One of the people he has saved is a TV reporter. She immediately sees a good story in it and wants to interview him. But because she, nor her news station know who he is, they will give him one million dollar in return for an interview. All they know is that he has lost a size 10 shoe in the mud. Of course hundreds of people claim to be him, but one homeless guy, who got the other shoe from him, really can make them believe he's the true hero. He gets the million and makes up a beautiful story on how he all did it. Of course Bernie sees this (when he is in jail) and decides to confront the man with the truth. This movie may not appeal to everybody, because not everybody may appreciate this kind of humor. Personally I find this a very good satire, that has actually a good point. In their search for sensational, touching news, TV stations will do really everything and seem to forget that the most important thing is still reality. If you are looking for a good comedy, with some fine acting and a good story, than this movie is really something you should try. I give it a 7.5/10.",
         "This was one of my favorite movies. Its basic message is that no one is either 100% good or 100% sleazy, as Hoffman and Garcia's characters show. Hoffman plays a two-bit thief who rescues a bunch of people from a downed airplane (including news reporter Geena Davis), and Garcia, a seemingly noble Vietnam vet, winds up taking credit for it. Basically, the movie shows the dangers of our need for a hero and the media's glorifying of such a need. I liked this movie a lot. *** out of ****"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Bernie LaPlante is having a rough time. He's divorced, his ex-wife hates him, and has custody of their son. The cops are setting a trap for him, then to top it all, he loses a shoe while rescuing passengers of a plane crash. Being a thief who is down on his luck, he takes advantage of the rescue, but then someone else claims credit for it.",
         "Bernie LaPlante is an amoral man and a hustler. He is facing criminal charges. His wife decides to limit his access to their son because he doesn't keep his promises. While on his way to his son's birthday, a plane crashes, and he is nearby. He goes on board to steal what he can but in the process saves some people, one of them being television reporter Gale Gayley. She doesn't get a good look at him but someone gets a photo of him which isn't clear. She then mounts a campaign to find him which includes a reward of a million dollars. Before hearing of this, Bernie tells his experience to John Bubber. He also says that he doesn't want any recognition. Bernie's trial is taking place and he, upon hearing of the million dollars, thinks that he hit the mother lode but before he can claim it, John does, and Bernie is sent to jail. John then grows close to Gale. Bernie, who stole her purse, sells what's in it, and when word of this reaches her, she thinks he is holding this over John, and all sorts of chaos ensues.",
         "A not-so-nice man rescues passengers from a crashed airliner, only to see someone else take credit."
      ],
      "budget": 42000000
   },
   "movielensId": 2252,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-10-02",
      "dvdReleaseDate": "1999-05-25",
      "directors": ["Stephen Frears"],
      "runtime": 117,
      "movieId": 2252,
      "title": "Hero",
      "mpaa": "",
      "actors": [
         "Dustin Hoffman",
         "Geena Davis",
         "Andy García",
         "Joan Cusack",
         "Kevin J. O'Connor",
         "Maury Chaykin",
         "Stephen Tobolowsky",
         "Tom Arnold",
         "Richard Riehle",
         "Martin Starr",
         "Chevy Chase",
         "Edward Herrmann",
         "Jeff Garlin",
         "Daniel Baldwin",
         "Christian Clemenson",
         "Warren Berlinger",
         "Fisher Stevens",
         "James Madio",
         "Clea Lewis"
      ],
      "imdbMovieId": "0104412",
      "originalTitle": "Hero",
      "genres": [
         "Drama",
         "Comedy",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": ["ySm6nqlbkzM"],
      "plotSummary": "Bernie Laplante is having a rough time. He's divorced, his ex-wife hates him and has custody of their son, the cops are setting a trap for him, then to top it all, he loses a shoe whilst rescuing passengers of a crashed jet. Being a thief who is down on his luck, Bernie takes advantage of the crash, but then someone else claims credit for the rescue.",
      "tmdbMovieId": 10699,
      "avgRating": 3.0577,
      "releaseYear": "1992",
      "numRatings": 1733,
      "posterPath": "/gT4qFlAcRcMvOanRPjke3MOSZGo.jpg"
   }
}