{
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [],
      "runtime": 60,
      "synopsis": null,
      "writers": ["Michael Sloan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086756/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzQ5NzgzOTA2M15BMl5BanBnXkFtZTcwOTQzMzU1MQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Lee Van Cleef, Timothy Van Patten, Shô Kosugi | See full cast and crew »"],
      "reviews": [
         "I remember the series well... An, the memories.. only back then I didn't realize how preposterous the whole thing was - Van Cleef looked more like a 90 pound weakling than a NINJA . He looked old and tired... But I LOVED him... VanPatten was the one miscast... NO Chemistry!! Be sure to see the last episode (If you can find any of them, I did on VHS)... The Master is back on an old West movie location, and feels right at home.. in fact he says so.. nice touch to end the series... Now that i'm old too, I wish I could move like the Master but then... that was a stunt double... Van Cleef you hombre.. rest in peace... you didn't seen at all out of place as a Ninja master but then... I never saw you as a old west Cowboy first! I loved this series!! Look on VHS",
         "I am groaning as I write this but during the early '80s with all the ninja craze as as a kid who practiced and loved karate, I loved this show. I never knew who Lee Van Cleef was prior to this TV show but my father did. He remember Lee in all the spaghetti westerns and would laugh that the villain of the cowboys was a good guy ninja now. You have to wince at some of the shows you liked as a kid but, you know, thats what makes the memories of your childhood so amusing if your lucky. Now, I am older and a father, and I appreciate actors like Lee more than the pinheads in Hollywood making $20 million + a picture. Actors like Lee kept us entertained and made guys like Clint Eastwood (\"For a Few Dollars More\") and Kurt Russell (\"Escape From New York\") look so good. When he died in '89 it gave me pause. He deserves to be remembered and I won't forget this weird funny show he did that kept me glued to the screen with all it's oddball fantasy. The 13-year old boy in me gives this a 9 star rating and a 10 star rating for the beady-eyed, hawk-nosed actor who played the lead. Rest-in-Peace, Lee, you are remembered.",
         "I thought that the first couple of episodes of \"The Master\" (later released as \"Master Ninja I') had some nice moments. Lee Van Clief may have been far too old, flabby, and frail to physically convince the audience that he could be a ninja master (amazing how \"he\" lost his gut whenever the stunt double stood in for him in the black ninja costume) but he did project a certain old school machismo and he could always deliver a good line. Yes, Demi Moore stuck out like a sore thumb in episode 1, and the wheelchair chick and the dancer from episode two delivered some of the worst lines in the history of television, but still...There were some decent stunts (for a TV series) and some energetic sword fights and a few decent attempts at wry East-meets-West humor. It was never 'great' the way \"The Fugitive\" was great, but it didn't actively suck...at first. And episode 2 had one great line (even though Van Patten flubbed it): \"I knew the Master would find a way to get me up on a tightrope sooner or later.\" Given the situation, it was pretty funny. The problem lay in the fact that a) the producers rapidly ran out of ideas after the first few episodes, reducing the show to a buddy version of \"Then Came Bronson\", and b) Timothy Van Patten's mush-mouthed delivery and frozen faced acting got old quick and c) there was very little chemistry between the two lead actors. Anyone who wasn't a male adolescent with an obsession with martial arts would find very little to interest them, especially since the series producers watered down the 'ninja' content extensively - they seemed to be trying to increase the series' appeal to American audiences, but they only alienated that core element who was only watching the show for the ninja action in the first place. Especially annoying was the fact that Van Patten was supposed to be some kind of \"Tiger Beat\" teen-idol and had a different love interest in every episode, but the lack of chemistry between him and his female of the week was apparent even to a blind man. To be fair to Van Patten, the writers put him in some incredibly contrived situations and gave him some very dopey dialog to convey his hipness...I'm not sure Cary Grant could have pulled off some of those scenes. Although I spend a lot of time thinking about and practicing martial arts, I gave up on this series by episode 4, and every time I checked in on it for a minute or two (as the season wore on) I found even less to keep me going back. It looks like everyone else agreed, and the show sank without a trace. Too bad...but the series was a day late (to cash in on Bruce Lee) and a dollar short (wasn't willing to live up to the potential of its concept).",
         "This series will always live on in my memory despite my not having seen it for a number of years. Sho Kosugi was well cast as the ninja bad guy. It is such a shame that he never became a greater star, but such is life. However, the casting of Lee Van Cleef as the good ninja was just pitifully unrealistic. Whilst a fine actor, it required too much of a suspension of disbelief to believe he could do any of the martial arts maneauvers he was supposed to. He was just plain too old. That said, I have many a fond memory of this series. No doubt, were I to watch them again now I would find many of the episodes cringe-inducing (just like some of the original Star Trek series). But still worth a look at on a rainy day.",
         "I remember my excitement, as an 11 year old at the time, when I learned that \"The Master\" TV series was going to come out on TV. At the time I was really into Bruce Lee movies and just about any Kung Fu/Ninja related movie or show I could find. Of course the same year saw the release of \"The Karate Kid\" so this was just a great year if you were a fan of martial arts. Unfortunately this series didn't live up to the hype. But for me, it still holds a place in my heart because it happens to be the very first show that I ever taped with a VCR - a beta-max no less! I remember watching parts of that first episode over and over again as I marveled over my newfound ability to rewind and replay video. All these years later I can see that the show has no real legacy and was cancelled after just 13 episodes. If you watch this movie, it is really just the first 2 episodes of the series.",
         "Lee van Cleef and Timothy van Patten make lovably lame main characters in this silly \"movie\" spliced together from two episodes of a 1980's TV series. David MacCallum shows up as an extremely unthreatening international terrorist/kidnapper, and George Lazenby is a cut-price secret agent whose tuxedo seems to be surgically attached to his skin. We're expected to believe that elderly Lee is capable of executing acrobatic somersaults and climbing sheer walls. Tim registers mild annoyance when his mentor and best friend Lee appears to have been buried in a shallow grave.",
         "Ah the early 1980's......how I miss them! The era embodied a sort of innocence which dissipated towards the end of the decade and has sadly yet to return. Who can forget the fads of the time; In music we 'bopped' along to the sounds of New Romantics, pioneering synth pop acts and additionally were blessed with a wonderful array of 'big hair' heavy metal bands. On TV we enjoyed such classics as Knight Rider, Airwolf and the incomparable, The A-Team and in cinemas we were treated to probably the best decade for horror and action movies......yes, the eighties....ah, they were the days. There was actually another craze that swept the western world during the early part of the decade also; What was it you may ask? Why it was Ninja Mania! We just couldn't get enough of these enigmatic stealth assassins in fact. The public obsession first began proper when the Cannon Film Group released the Sho Kosugi outing, Enter the Ninja in 1984. Kosugi himself went on to a semblance of super stardom literally overnight - this despite the fact that he was actually playing the films main villain! Such was the mystique and allure that these historical figures exuded on screen. Needless to say, more ninja flicks were swiftly put into production by a plethora of film companies, each trying to out do the last and cash in on the publics apparent insatiable fixation on all things connected to the ninja. It was inevitable of course that these seemingly semi-mystical beings would break out into other entertainment mediums also. This they did in the form of numerous comic books, novels, toys, games and in the instance reviewed here, a television series starring veteran actor, Lee Van Cleef and as it happens, the by this time living legend, Sho Kosugi. The plot concerned Cleef's character returning from Japan where he had spent years studying the ninja arts, in order to find his estranged daughter. Also along for the ride was the token wise cracking side kick (as was a somewhat unfortunate trend of the eighties....) who becomes Cleef's new student. Unfortunately, our veteran ninja is also being hotly pursued by a fellow ninja from his clan (Kosugi) who is incessantly intent on sending him to the great beyond. Despite ninja mania in full swing at the time, the show curiously lasted for only one season before disappearing as quickly as......um.......well, a ninja in fact. Whilst mildly enjoyable in its own right, it has to be said that the series was unfortunately hampered by its incredibly formulaic treatment. As with the vast majority of eighties TV shows, the plot was never more ambitious than to set our heroes (who just like in every other eighties show), travelling around from place to place helping out those in trouble (invariably a sexy, feisty female) from evil property developers and the like. Every now and then to spice things up, Kosugi puts in an appearance and it's no coincidence that these episodes are the best of the series which sans his presence is somewhat pedestrian at best. For a bit of nostalgia or else those still desperate for a fix of anything ninja related the series is probably worth a look as long as you don't set your expectations too high.",
         "I remembered that show from when I was a small kid. After each episodes, some friends and I played ninja outside in the woods near their house. I remembered key scenes like when The Master plays dead on the hotel room floor and I remembered Max's van. I recently got the series on DVD from Ebay. What a ride! It was as I remembered. A great show full of adventures. Typical of many shows from the 80's it involved the heroes dropping on some trouble or someone in danger in a random town... If you have the 80's nostalgia or are a ninja movie fan, I recommend seeing this show.",
         "This Master aired on NBC in 1984 during the ninja craze of the 80's. It only lasted thirteen episodes. It starred Lee Van Cleef and Timothy Van Patten. Van Cleef plays John Peter McAlister, a ninja who comes to America from Japan searching for his long-lost daughter. Once in America, he meets Max Keller, played by Timothy Van Patten, who teams up with McAlister to help find his daughter. Along the way, the duo travel in an A-Team-like van and engage in various adventures while helping those in need. McAlister also teaches Keller the finer points of ninjitsu in his spare time. The Master takes place in various cities across America, however, it was shot entirely in Los Angeles, CA. Sho Kosugi also appears in a handful of episodes as Okasa, an evil ninja hunting McAlister. While I enjoyed this series, the casting was questionable. Lee Van Cleef was a fine actor, but he was totally miscast in this series. He was in no shape to do any of the fighting required for this series. He is quite obviously stunt doubled by Sho Kosugi(wearing a skull cap!) in almost all of the fight scenes. Van Patten is also stunt doubled in some of the fight scenes. This series was released as a series of seven videos with the name Master Ninja. If you enjoy ninja flicks or martial arts in general, give this a try. P.S. Look for a pre-Striptease Demi Moore in the first episode.",
         "I remember this series quite well. Back in the 80s when the US underwent a \"ninja\" phase, this came out. Lee Van Cleef is an American trained as a ninja who decides to leave \"the family\". Sho Kosugi (a real life kick butt martial artist) goes after him. Cleef comes to America and meets up with Tim Van Patten who joins up as his apprentice, hence, the title. It's kind of cheesy, but not as bad as it could have been. A lot of the \"wandering do-gooders\" a la \"The Incredible Hulk\" and \"Scooby Doo\". I remember watching this on Friday nights and enjoying the heck out of it."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Action"
      ],
      "productionCompanies": [
         "Michael Sloan Productions",
         "Viacom Productions"
      ],
      "summaries": [
         "John Peter Macallister, was a Korean veteran who after serving, decided to live in Japan, and while there, he studied Ninjitsu and became a Ninja. Thirty years later he learned that he has a daughter, so left to find her. Apparently, though, he can't leave the sect that he is with, because it means that he is now marked for death. He manages to escape, and upon arriving in the States, he meets Max Keller, a drifter who has a penchant for getting involved with other people's problems and helping them out if he can. Max and Macallister hook up, with Max helping Macallister find his daughter, and Macallister teaching him the ways of the ninja. At the same evading Okasa, one of Macallister's students who is now sworn to kill him.",
         "Two episodes of \"The Master\" pasted together. In the first half, Max Keller meets John Peter McAlister, an American who remained in Japan after the war and became a Ninja. He has returned to America to locate his newly-discovered daughter, and agrees to tutor Max in becoming a Ninja as well. During this, they help a father and daughter fend off an unscrupulous land developer who is trying to get hold of their airport. In the second half, Keller and McAlister aid a nightclub owner and his daughter in fending off members of the Asian Mafia, who are trying to take over their club. During all this, McAlister is pursued by an enemy Ninja, who wishes to kill him for breaking oath and leaving Japan.",
         "An aging American ninja master and his headstrong young apprentice search for the elder man's daughter."
      ],
      "budget": 0
   },
   "movielensId": 2258,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-01-20",
      "dvdReleaseDate": null,
      "directors": ["Ray Austin"],
      "runtime": 0,
      "movieId": 2258,
      "title": "Master, The (1984)",
      "mpaa": null,
      "actors": [
         "Lee Van Cleef",
         " Timothy Van Patten",
         " Shô Kosugi",
         " Cynthia Lea Clark"
      ],
      "imdbMovieId": "0087690",
      "originalTitle": "",
      "genres": [],
      "youtubeTrailerIds": [],
      "plotSummary": null,
      "tmdbMovieId": 0,
      "avgRating": 2.05769,
      "releaseYear": "1984",
      "numRatings": 52,
      "posterPath": null
   }
}