{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "rio de janeiro",
            "id": 1809
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "older man younger woman relationship",
            "id": 14669
         },
         {
            "name": "summer vacation",
            "id": 14714
         },
         {
            "name": "sexual awakening",
            "id": 162804
         },
         {
            "name": "sex comedy",
            "id": 170827
         },
         {
            "name": "underage sex",
            "id": 171341
         }
      ],
      "imdb_id": "tt0086973",
      "video": false,
      "title": "Blame It on Rio",
      "recommendations": [
         449065,
         117897,
         116314,
         115360,
         107673,
         116696,
         195656,
         225691,
         103130,
         259146,
         132994,
         79068,
         143529,
         264735,
         80133,
         168502,
         161389,
         163422,
         103886,
         201003
      ],
      "backdrop_path": "/5jB15moMO5jZ8gf4m43dElTtJXg.jpg",
      "revenue": 18644570,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Matthew Hollins",
               "gender": 2,
               "credit_id": "52fe45e89251416c75066995",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Jennifer Lyons",
               "gender": 1,
               "credit_id": "52fe45e89251416c750669a1",
               "name": "Michelle Johnson",
               "profile_path": "/b87fTFmIzdy4CYPvlUbzhtA6Oua.jpg",
               "id": 17225,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Victor Lyons",
               "gender": 2,
               "credit_id": "52fe45e89251416c75066999",
               "name": "Joseph Bologna",
               "profile_path": "/yhknyDtNpyDo2kbvkR1gP0Ud5B3.jpg",
               "id": 46946,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Nicole 'Nikki' Hollis",
               "gender": 1,
               "credit_id": "52fe45e89251416c750669a5",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Karen Hollis",
               "gender": 1,
               "credit_id": "52fe45e89251416c7506699d",
               "name": "Valerie Harper",
               "profile_path": "/flUsirGRVK4cFxtn0V5FGl882PB.jpg",
               "id": 83170,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Eduardo Marques",
               "gender": 2,
               "credit_id": "57be04abc3a36818c5002450",
               "name": "José Lewgoy",
               "profile_path": "/lYFqWEKINFU2TelnTItyIxUhZTw.jpg",
               "id": 57379,
               "order": 6
            },
            {
               "cast_id": 22,
               "character": "Signora Botega",
               "gender": 0,
               "credit_id": "595c01f59251412251040f5a",
               "name": "Lupe Gigliotti",
               "profile_path": "/tMwMhYlQ7kSkqR9jEsHwS7oCWrR.jpg",
               "id": 1269239,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Peter",
               "gender": 0,
               "credit_id": "595c02009251410a5905d0b0",
               "name": "Michael Menaugh",
               "profile_path": null,
               "id": 1537307,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Helaine",
               "gender": 0,
               "credit_id": "595c020bc3a3680d5902f824",
               "name": "Tessy Callado",
               "profile_path": null,
               "id": 1168521,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Mother of the Bride",
               "gender": 1,
               "credit_id": "595c0224c3a368293b06244a",
               "name": "Zeni Pereira",
               "profile_path": null,
               "id": 1749438,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Singer in the Dance Club",
               "gender": 0,
               "credit_id": "595c02349251412251040fb0",
               "name": "Eduardo Conde",
               "profile_path": null,
               "id": 1163989,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Isabella",
               "gender": 0,
               "credit_id": "595c024292514121f0041ce0",
               "name": "Betty von Wien",
               "profile_path": null,
               "id": 1844836,
               "order": 12
            },
            {
               "cast_id": 28,
               "character": "Dancer",
               "gender": 0,
               "credit_id": "595c0265c3a3680d5902f885",
               "name": "Angelo DeMatos",
               "profile_path": null,
               "id": 1844837,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45e89251416c750669ab",
               "name": "Stanley Donen",
               "profile_path": "/8r91mtKkWdYri739IilAvTVzr1E.jpg",
               "id": 13284,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e89251416c750669b1",
               "name": "Charlie Peters",
               "profile_path": null,
               "id": 65401,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45e89251416c750669b7",
               "name": "Larry Gelbart",
               "profile_path": null,
               "id": 18267,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "595c0107c3a368293b062309",
               "name": "Stanley Donen",
               "profile_path": "/8r91mtKkWdYri739IilAvTVzr1E.jpg",
               "id": 13284,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595c0115c3a36825e8057cc1",
               "name": "Bruce McNall",
               "profile_path": null,
               "id": 56003,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595c0120c3a36825e8057cd1",
               "name": "Kenneth Wannberg",
               "profile_path": null,
               "id": 66142,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "595c012bc3a368265d05b406",
               "name": "Reynaldo Villalobos",
               "profile_path": null,
               "id": 17948,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "595c013e92514121f0041ba9",
               "name": "George Hively",
               "profile_path": null,
               "id": 1182098,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "595c01499251410b8605ea4a",
               "name": "Richard Marden",
               "profile_path": null,
               "id": 14931,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "595c0154c3a368293b062357",
               "name": "Wallis Nicita",
               "profile_path": null,
               "id": 12847,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "595c015e9251410c56059913",
               "name": "Marcos Flaksman",
               "profile_path": null,
               "id": 112071,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "595c0184c3a36828a1068d6a",
               "name": "Sally Jones",
               "profile_path": null,
               "id": 1385884,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "595c019fc3a36828a1068d8b",
               "name": "Larry Gelbart",
               "profile_path": null,
               "id": 18267,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "595c01adc3a36828a1068d9d",
               "name": "Robert E. Relyea",
               "profile_path": null,
               "id": 14055,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.312603,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14347,
      "vote_count": 58,
      "budget": 0,
      "overview": "Matthew Hollis is man on holiday in Rio with his best friend. Both men have teenage daughters with them. When Matthew falls for his best friend's amorous daughter named Jennifer, they embark on a secret, if slightly one-sided relationship. Jennifer's father is furious when he finds out about the 'older man' in his daughter's life, and sets out to hunt him down with the aid of Matthew!",
      "similar": [
         27066,
         22705,
         1259,
         28468,
         37265,
         10995,
         263472,
         2149,
         2770,
         9285,
         244772,
         283227,
         36630,
         796,
         19918,
         4507,
         14239,
         4823,
         14174,
         55580
      ],
      "original_title": "Blame It on Rio",
      "runtime": 100,
      "poster_path": "/34Rg7Eh9TxdKweL0Ugba0HElgAF.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Sherwood",
         "id": 556,
         "origin_country": ""
      }],
      "release_date": "1984-02-17",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "She's the hottest thing on the beach. She's also his best friend's daughter!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stanley Donen"],
      "runtime": 100,
      "synopsis": "American businessman Victor (Joseph Bologna) and British-born entreprenour Matthew (Michael Caine) are best friends who work for a major corporation in São Paulo, Brazil. Both are having problems in their marriages: Victor's wife wants to divorce him, while Matthew has no idea what is wrong and is baffled and irritated by the decision of his wife Karen (Valerie Harper) to take her vacation separately from her husband and daughter. The men decide to holiday in Rio de Janeiro. With them are their teenage offspring: Matthew's 15-year-old daughter Nikki (Demi Moore) and Victor's 16-year-old daughter Jennifer (Michelle Johnson). They rent a beautiful vacation home overlooking the city with a somewhat taciturn and disapproving housekeeper who treats all of them badly and avoids talking to any of them. At the beach, Jennifer is told by her father to cover her bare breasts but refuses, instead dragging her father and Nikki into the water to play. Matthew does not join them and seems uncomfortable with the partial nudity displayed by Jennifer and other topless women on the beach. A few nights later, Matthew gets drunk with the amorous Jennifer during a Brazilian wedding, where she discloses to him that she has had a \"crush\" on him since she was a child. After having sex on the beach, they embark on a secret sexual relationship. Victor becomes furious when he finds out that there is an \"older man\" in his daughter's life when he sneaks a peak at her diary, and he sets out to hunt down the mystery man. He expects Matthew to help. Matthew is reluctant to lead Victor on a wild goose chase but goes through with it out of fear to what Victor might do to him. In private, Matthew tries to talk to Jennifer to end their secret affair before her father finds out, but she is determined to never give him up. Meanwhile, Nikki learns that Jennifer is involved with her father, but despite her protests, Jennifer (who by this point has fallen in love with Matthew) refuses to end it. Victor and Matthew's persuit of Jennifer's \"older man\" leads them to a local nightclub, where Victor (who has a poor knowledge of the local Portuguese language) thinks that a cabaret singer who is singing a ballard about Jennifer who is in attendence, is flirting with her. Victor attacks the singer on stage, and causes a large barroom brawl. Matthew breaks up the fight and outside the nightclub, discloses the truth to his friend that he is Jennifer's secret lover. Oddly though, Victor is not quite as angry as Matthew expects. When Karen shows up the next day, Victor reveals a secret that he has been keeping from Matthew all these years. It is soon discovered that Victor has been having an affair with Karen which is why the reason that she didn't join them on their vacation to put some distance between her and Victor. Karen is also furious to learn about Matthew's involvement with Jennifer, but seems to accept it as some type of Karma for her and Victor. After the truth comes out, Jennifer tries to commit suicide with an overdose of birth control pills. She is rushed to a local hosptial and survives. At first, Karen and Nikki blame Matthew, and then Victor's poor parenting skills, for allowing Jennifer to slide down this path. That evening, Matthew and Victor are forced to share a bed for the night since Karen and Nikki do not want to associate with either man anymore. Victor and Matthew's close proximity leads to a major argument with both men blaming each other for this turn of events. Victor and Matthew's bedroom argument leads to a brutal fistfight between them which leads to the two men wrestling each other on the bed. The fight suddenly ends when their spiteful housekeeper walks in on them after hearing the noise... and draws the wrong conclusion to what is happening. Afterwords, the incident brings all closer together. Karen and Matthew return to their home in New York and decide to work on their marital problems. Jennifer begins dating a boy her own age, and Victor re-marries his estranged wife. Matthew's final line of summation is: \"You only live once, but it does help if you get to be young twice.\"",
      "writers": [
         "Charlie Peters",
         "Larry Gelbart"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086973/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzg1NTYzODMzNF5BMl5BanBnXkFtZTcwNDYwMTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Caine, Michelle Johnson, Demi Moore | See full cast and crew »"],
      "reviews": [
         "I saw this movie when it first came out. The theater was in a small town and there was nothing else to do that night so we went to the movie thinking it would be crap. Instead, I laughed so hard I almost fell out of my seat. I've loved the movie ever since. Everyone knows the premise---Michael Caine and Joseph Bologna take their teenage daughters, Michelle Johnson and Demi Moore to Rio for a vacation. Caine's marriage is in trouble and his wife is vacationing somewhere else. They're barely settled into the home they're renting when Johnson aggressively pursues Caine and he quickly succumbs (like any man would!). Caine is guilt-ridden but cannot resist Michelle's considerable charms. Her father finds out about the affair and goes nuts trying to find out who her lover is. He enlists Caine in his search and many hilarious scenes ensue. The setting for this movie is just gorgeous and the women are even more beautiful. This was Michelle Johnson's first movie and it shows but she does project a sweet sincerity and her va-va-voom body more than makes up for any performance shortcomings. Zowie! Catch the scene where the fathers find their daughters topless at the beach---this was well before Demi Moore had some \"enhancements\" later in her life and it is painfully obvious that she's extremely embarrassed by doing the topless scene. Michelle is a trouper though, lucky for us! The ultimate reason to see this movie though is Michael Caine. He is extremely funny in this movie and I can only imagine how much fun he had making it----a guy in his 40s getting to spend a few weeks in one of the most beautiful and exciting cities in the world and having all these love scenes with a girl half his age and getting paid to do it!!! Caine has made a lot of schlocky movies, for sure, but in an interview once he said that no matter how dumb the movie was or how cheaply it was done, he would try to give the best performance he could so even if the rest of the movie was crap, the viewer could at least appreciate that Caine did a good job. That dedication to his craft is what lifts what should've been a \"C-\" movie like \"Rio\" into a \"B\" \"B-\" movie instead and when he's in really good material, makes it unforgettable.",
         "This is a fun light-hearted comedy, with magnificent views of Brazil and subtle comic performances. It captures that early eighties feel well. And broaches the subject of a teenage temptress more honestly than the recent version of Lolita. I can only think that this movie was out of time. probably from a gentler age, but it still hits the mark with me, even watching it now.",
         "At the risk of ruining my credibility, I proudly declare this as one of my favorite movies. Nobody in their right mind would ever even contemplate a movie like this now, I know. In truth, I'm always shocked it was made at all. It's subject matter beyond the pale of even the low-life studio execs who make the big decisions. The most important and amazing consideration is it was intended as mainstream release. Its not a Troma shclock job. Its a very well made, extremely well written film about a very naughty topic. Consider it a blooper, an accident, if you will, but its great. Quick synopsis, a middle aged dude messes around and falls in love with his best friends 18 year old daughter. And its not exactly tastefully told. There's a ton of gratuitous nudity which is what really dooms it, and makes it just the sort of oddity and pariah people so love to hate. I'm old now, but when i fell in love with it I was like 19 so wipe the perverted sanctimonious smirk off of your face! I like good comedy and well made on location vacation pics, that inspire me to travel. So it's the Peters-Gelbart script and the wonderful scenery that have won it a place in my cold heart. Ok, ok, topless 18 year old girls are a decided bonus.",
         "Now let me start by saying I love a good movie! I love a great script, engaging characters and brilliant cinematography. ***This movie has none of these things! But it does have the type of storyline and pointless nudity that Hollywood seems unwilling to include in a mainstream film. This is one of those movies that was on HBO late at night when I was a kid and I loved it. There's something to great nudity! We just don't celebrate it enough anymore! Plus Demi Moore pre-implants!",
         "There was one major reason to watch this movie: Michelle Johnson, and that's about it. The film doesn't offer too much else. Basically, it's a silly story. Michael Caine (\"Matthew\") and Joseph Bologna (\"Victor\") plays some middle- aged guys who are going through marriage problems (bad marriage and a divorce, respectively) so they go down to Brazil to spend money since they're rich. They bring their late teen/young-adult daughters? Huh? Well, Victor's daughter is a knockout and they have a fling. Johnson plays the girl, \"Jennifer,\" who shows off her breasts as much as she can in this film. This is why I and a lot of other guys saw this movie. In reality, there isn't much merit to this story, regardless. This must have been a wonderful role for Caine to play! Caine, an outstanding and likable actor, keeps this film - along with Johnson's obvious assets - from being a total bomb. As \"Matthew,\" his mind knows this a bad relationship and vows to end it, but you know what else \"doing the talking\" for him, so it ain't easy. Demi Moore, by the way, plays Caine's daughter in this movie. It's really not a horrible film but it's pretty inane and crude in areas. The real shocker might not be all the nudity or sex jokes and lying but who directed the film: good 'ole Stanley Donen, who also gave us \"Singin' In The Rain\" and \"Charade.\" How in the world did he get involved with this movie? Maybe Johnson was too much of an allure for him, too!",
         "It's a travelogue/sex-comedy with great photography of Rio, funny jokes and a pleasing early eighties feel. All the typical aspects of life in Brazil are shown like Carnival, native gods/religion, topless sunbathers, street dancers, the monolith dome with Jesus on top etc. There are a lot of funny lines that will keep you entertained and Michael Caine delivers them well. The soundtrack has a lot of bossa nova strains (composed by Ken Wannberg) and adds to the sexy, lighthearted mood.",
         "This movie is one of Caine's great comedies and should be watched immediately. Blame it on rio also stars Michelle Johnson, Joseph Bologna, Valerie Harper, Demi Moore. The film has many funny twists and turns to keep you laughing and guessing until the end. Nudity is all over this movie especially Michelle Johnson and a little bit of Demi Moore. Michael, Joseph, and Valerie are pros at this comedy and the two amateurs do a pretty good stab at making you laugh your head off. Blame it on Rio starts off a little slow but soon it is moving at fast speed and you better hang on to your seatcushions. A serious topic is discussed in both a serious and funny manner allowing you to see different sides of a story. This movie is like a favorite candy or soda that you cannot get enough of and that you want to have more of immediately. So kick back and relax and enjoy all the wild antics abound for you in this crazy comedy and at the end Blame it on Rio.",
         "Blame It On Rio is a comedy of manners, of embarrassment, and a mildly raunchy adult amusement. At least that's what the publicity says it is - I'm not so sure. Michael Caine and Joseph Bologna are business partners who take their daughters - Demi Moore and Michelle Johnson - on holiday to Rio de Janeiro for reasons which don't really matter. While they are there, the precocious Johnson pursues and ultimately seduces Caine, and shenanigans ensue (the main one of which is Caine having to help Bologna pursue the un-named older man - ie. himself - who is having an inappropriate relationship with Bologna's daughter). This is bright, breezy, comical stuff, with lots of nice scenery. Caine's performance (with lots of direct-to-camera speeches) is pleasingly desperate, and Johnson's body is pleasingly and frequently naked (and, it must be said, startlingly ripe). I'm not 100% convinced about the subject matter, though.",
         "You read a plot synopsis for Blame It on Rio and immediately you think that this just has to be a terrible movie. And besides being terrible it's also going to be downright uncomfortable to watch as the story centers around some wildly inappropriate behavior. They'd never make a movie like this today you think and thank goodness for that. Yes, those would probably be your thoughts before you watch this movie. But then you watch it and it's actually not that bad. Yes there is that uneasy feeling throughout due to the fact that the subject matter is more than a little icky. But the movie is entertaining. It's light-hearted fun. In fact you could even call it charming if not for the fact that there's nothing particularly charming about a middle-aged man having sex with his best friend's teenage daughter. So our story is about this exceedingly inappropriate relationship. And the movie plays it for laughs. And it works? Ah, the 1980s. A very different world from today that's for sure. Blame It on Rio is never uproariously funny but there are enough good comic moments sprinkled throughout to keep things moving along nicely. In playing Matthew, the man who can't resist the charms of the teenage temptress, it is Michael Caine who really holds the movie together. An awkward character to play no doubt and Caine makes it work. From the moment we meet him, even before his wild fling, Matthew never seems entirely comfortable in his own skin. Preying on that awkwardness is his own personal Lolita. She goes by the name of Jennifer and is played by Michelle Johnson for whom comfort in her own skin was apparently not an issue. Yowzers! Easy to see how it would be difficult for any man to resist her feminine charms. But Matthew, you're forty-something, she's a teenager, and she's your best friend's daughter! This can't happen! But it does and...hilarity ensues? Yeah you wouldn't think this is a particularly comedic situation but that's the direction in which this movie goes and somehow it kind of works. It's hard to fully embrace the movie as none of the main characters come off particularly well. The Matthew-Jennifer relationship is not the only inappropriate thing going on here, not by a long shot. You'd think Jennifer's father, what with his best friend sleeping with his nubile daughter, would be the sympathetic character. But, as portrayed by Joseph Bologna, he's a sleaze too. Who in this movie isn't? Well, there's Matthew's daughter Nicole. Demi Moore plays the role and it's a smaller part compared to Caine, Johnson and Bologna. But if you sympathize with anyone it's her. She has an innocence about her. All the adults in this movie have lost their innocence long ago. And her friend Jennifer can't wait to lose hers...with Nicole's father no less. Poor Nicole. She even has to suffer in comparison standing next to the voluptuous Jennifer on one of Rio's famous topless beaches. At this point in her life Demi Moore had not yet embraced the wonders of surgical enhancement and that leaves Nicole bashful, trying to cover up her modest assets with her long hair. Jennifer? She's not bashful. But somehow she's still sweet and charming. And there's still a vulnerability and touch of innocence to her even as she's taking off her clothes and seducing a middle-aged man. It's hard to figure. The story shouldn't work, the movie shouldn't work, we really shouldn't be finding any of this funny. But somehow the end result isn't that bad at all. Go into this movie with low expectations and you may well be pleasantly surprised.",
         "A comedy where a middle-aged man has sex with his best friend's teenage daughter would seem morally wrong on so many levels as to violate municipal zoning ordinances. So why my lack of shame in copping to really enjoying this movie? Watching \"Blame It On Rio\" back in 1984 when I was 18, the following items appealed to me. 1. Michelle Johnson naked. 2. Michelle Johnson in white pants. 3. Michael Caine's monologues. 4. Caine's chemistry with Joseph Bologna. 5. Michelle in her two-toned bikini. Watching it now doesn't change what I like so much as in what order. Michelle Johnson is an extraordinarily beautiful woman and an engaging presence when she doesn't have a crying scene, and I think I have grown to appreciate her in other stages of dress, but the person that makes this film work for me now is Caine, whose level of commitment to this film is a thing of wonder. \"Blame It On Rio\" is a sex farce which skates around real human feelings with moments of slapstick and sitcom repartee. There are about 150 ways the film can go wrong, but Caine sells it by keeping it light and silly. Caine's character, Matthew Hollis, is a sympathetic, awkward type whose life gets upended when his wife Karen (Valerie Harper) decides she isn't going with him on vacation to Rio de Janiero. So it's just him, his friend Victor (Bologna), Victor's daughter Jennifer (Johnson), and Matthew's daughter Nicole (Demi Moore.) Victor rides Matthew about making the most of his new opportunity: \"Is tasting life, creating a little magic, is that cheating? You're a long time dead.\" Jennifer has her own ideas on what Matthew should be doing, which she unleashes on him at an evening wedding festival at a beach: \"Poor Uncle Matthew, he never had a chance.\" Her nude scenes still pack a punch, but its the stuff in-between the nude scenes that excite me more now. Caine with anything in his hands, whether it be grating a carrot or brushing his teeth, is joyfully amusing, and his one-liners as revealed \"Alfie\"-style to the camera are just a lot of fun: \"He needed my help...it's like asking an arsonist become the fire chief.\" Bologna also makes me laugh, but something else, too. In his own askew, over-emoting way, he's the heart that makes the film work. When he discovers his daughter has been seeing another man, he immediately settles on Matthew - for help finding the culprit. This accounts for the funniest scenes in the film, but it also gives us something to care about. You laugh at Victor's blindness, but you also feel a little between the giggles when he tells Matthew: \"You're a rock.\" The main problem I have with \"Blame It On Rio\" is it is not all that sharp in the one-liner department. Co-screenwriter Larry Gelbart was the guy behind \"Tootsie\" and the best years of the sitcom \"M*A*S*H,\" but he and Charlie Peters don't produce an especially witty script. There are funny lines, but more duds than you'd expect. \"I've always had a problem with nudity. Sometimes, when I'm getting undressed, I almost wish I could leave the room, know what I mean?\" Matthew asks us at one point. Fortunately, the writing gets much better in the second half, especially in the last twenty minutes when Matthew discovers he's not the only guy keeping a secret. Celebrated director Stanley Donen makes the most of the natural beauty and native music of his location while keeping everything as light and fizzy as a tropical drink. \"Blame It On Rio\" may be morally dubious, but it's solid Hollywood fun of the kind Donen delivered for decades and as good a film as any for him to go out on. And thanks to Caine, \"Blame It On Rio\" still holds up."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Sherwood Productions"],
      "summaries": [
         "Caine plays a man on holiday in Rio with his best friend. Both men have teenage daughters with them. When Caine falls for the amorous daughter (played by Michelle Johnson) of his best friend, they embark on a secret, if slightly one-sided relationship. Johnson's father is furious when he finds out about the 'older man' in his daughter's life, and sets out to hunt him down with the aid of Caine!",
         "Best friends and their daughters holiday in Rio only for one to fall for the other's daughter."
      ],
      "budget": 0
   },
   "movielensId": 2259,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Español"
      ],
      "releaseDate": "1984-02-17",
      "dvdReleaseDate": "2001-05-22",
      "directors": ["Stanley Donen"],
      "runtime": 100,
      "movieId": 2259,
      "title": "Blame It on Rio",
      "mpaa": "R",
      "actors": [
         "Michael Caine",
         "Michelle Johnson",
         "Joseph Bologna",
         "Demi Moore",
         "Valerie Harper",
         "José Lewgoy",
         "Lupe Gigliotti",
         "Michael Menaugh",
         "Tessy Callado",
         "Zeni Pereira",
         "Eduardo Conde",
         "Betty von Wien",
         "Angelo DeMatos"
      ],
      "imdbMovieId": "0086973",
      "originalTitle": "Blame It on Rio",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "eZOTSkgIP80",
         "q2yyRa6mbeI"
      ],
      "plotSummary": "Matthew Hollis is man on holiday in Rio with his best friend. Both men have teenage daughters with them. When Matthew falls for his best friend's amorous daughter named Jennifer, they embark on a secret, if slightly one-sided relationship. Jennifer's father is furious when he finds out about the 'older man' in his daughter's life, and sets out to hunt him down with the aid of Matthew!",
      "tmdbMovieId": 14347,
      "avgRating": 2.64728,
      "releaseYear": "1984",
      "numRatings": 1487,
      "posterPath": "/34Rg7Eh9TxdKweL0Ugba0HElgAF.jpg"
   }
}