{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "aftercreditsstinger",
         "id": 179430
      }],
      "imdb_id": "tt0091680",
      "video": false,
      "title": "One Crazy Summer",
      "recommendations": [
         13667,
         14464,
         14671,
         10019,
         8992,
         1793,
         14170,
         9080,
         9749,
         13105,
         45225,
         29355,
         13704,
         11591,
         18129,
         14425,
         76171,
         13346,
         14370,
         24548
      ],
      "backdrop_path": "/d8cuvGwfAMJ3bzZgigcairppEqV.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Hoops McCann",
               "gender": 2,
               "credit_id": "52fe47709251416c75099633",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Cassandra",
               "gender": 1,
               "credit_id": "52fe47709251416c75099637",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Egg Stork",
               "gender": 2,
               "credit_id": "52fe47709251416c7509963b",
               "name": "Bobcat Goldthwait",
               "profile_path": "/wYwGbSqEGAqpT4or8YHQ79ycoz4.jpg",
               "id": 95024,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Clay Stork",
               "gender": 2,
               "credit_id": "52fe47709251416c7509963f",
               "name": "Tom Villard",
               "profile_path": "/ayRERPv9CxEK0uVAX9P68uH8i94.jpg",
               "id": 106247,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Ty",
               "gender": 2,
               "credit_id": "52fe47709251416c75099643",
               "name": "Jeremy Piven",
               "profile_path": "/qtho4ZUcValnVvscTGgyWfUr4VP.jpg",
               "id": 12799,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Grandma",
               "gender": 1,
               "credit_id": "52fe47709251416c75099647",
               "name": "Billie Bird",
               "profile_path": "/6RFp87vKu8CPWnNFEdMNk4pDC2f.jpg",
               "id": 140778,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ack Ack Raymond",
               "gender": 2,
               "credit_id": "52fe47709251416c7509964b",
               "name": "Curtis Armstrong",
               "profile_path": "/6rsU7P4jwTC41lifKcXHHKU3uXO.jpg",
               "id": 87003,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "General Raymond",
               "gender": 2,
               "credit_id": "52fe47709251416c7509964f",
               "name": "Joe Flaherty",
               "profile_path": "/eQWzl4MazEkiaIsSuLIBBWB9zV9.jpg",
               "id": 59196,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Aguilla Beckersted",
               "gender": 2,
               "credit_id": "52fe47709251416c75099653",
               "name": "Mark Metcalf",
               "profile_path": "/qjxCggGQH99OkXjDxm33QPIJZcl.jpg",
               "id": 55194,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Old Man Beckersted",
               "gender": 2,
               "credit_id": "52fe47709251416c75099657",
               "name": "William Hickey",
               "profile_path": "/zr7UJxP5MdEksn6ZaxeHbwr6o5Z.jpg",
               "id": 21282,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Taylor",
               "gender": 2,
               "credit_id": "52fe47709251416c7509965b",
               "name": "Taylor Negron",
               "profile_path": "/l641HJtE8WSjWAJGHAer5Hx89SG.jpg",
               "id": 37043,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Disc Jockey",
               "gender": 0,
               "credit_id": "52fe47709251416c7509965f",
               "name": "Rich Little",
               "profile_path": "/uMBWmUL8AHnwkh8NmVd1iorImdH.jpg",
               "id": 146138,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Stain",
               "gender": 2,
               "credit_id": "52fe47709251416c75099663",
               "name": "John Matuszak",
               "profile_path": "/AvOqytADHckPxMEFVddrD4FHTU3.jpg",
               "id": 64120,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "George Calamari",
               "gender": 2,
               "credit_id": "52fe47709251416c75099667",
               "name": "Joel Murray",
               "profile_path": "/t5syYfCgxbTC7XPrNeXhhhQULUf.jpg",
               "id": 155649,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Cookie Cambell",
               "gender": 1,
               "credit_id": "5a13e6ff92514136610031cb",
               "name": "Kimberly Foster",
               "profile_path": null,
               "id": 1006838,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47709251416c7509962f",
               "name": "Savage Steve Holland",
               "profile_path": "/3GADF4j8wNAxPJIsipQnrd2ieTt.jpg",
               "id": 87565,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47709251416c7509966d",
               "name": "Savage Steve Holland",
               "profile_path": "/3GADF4j8wNAxPJIsipQnrd2ieTt.jpg",
               "id": 87565,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "576cbbcc9251411540003dbd",
               "name": "Cory Lerios",
               "profile_path": null,
               "id": 68499,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "576cbbd3c3a3685bc50019cc",
               "name": "Isidore Mankofsky",
               "profile_path": "/gLrjaey4s0ZsQoVkVwNBxi5v8Ly.jpg",
               "id": 68459,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "576cbbda925141695100171c",
               "name": "Alan Balsam",
               "profile_path": null,
               "id": 56944,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "576cbbe19251411540003dcf",
               "name": "Judith Holstra",
               "profile_path": null,
               "id": 1730,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "576cbbe7c3a3685b150017be",
               "name": "Marcia Ross",
               "profile_path": null,
               "id": 51557,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "576cbbf0925141699c0017fc",
               "name": "Herman F. Zimmerman",
               "profile_path": null,
               "id": 2083,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "576cbbf7c3a3685b150017c8",
               "name": "Gary Moreno",
               "profile_path": null,
               "id": 1561103,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "576cbbfe92514169e200169b",
               "name": "Brad R. Loman",
               "profile_path": null,
               "id": 1357219,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "576cbc07925141483d002fb6",
               "name": "Robert Latham Brown",
               "profile_path": null,
               "id": 14654,
               "department": "Production",
               "job": "Unit Production Manager"
            },
            {
               "gender": 1,
               "credit_id": "5a205f3bc3a3680b8a092848",
               "name": "Marguerite James",
               "profile_path": null,
               "id": 1705506,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.931801,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18282,
      "vote_count": 66,
      "budget": 0,
      "overview": "An aspiring teenage cartoonist and his friends come to the aid of a singer trying to save her family property from developers.",
      "similar": [],
      "original_title": "One Crazy Summer",
      "runtime": 89,
      "poster_path": "/fFqMnlM6C2wLLbtno6LO5PtuRO6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "A&M Films",
         "id": 11043,
         "origin_country": ""
      }],
      "release_date": "1986-08-08",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "They're out of school, out on Nantucket, and out of their minds. With this crowd, anything can happen!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Savage Steve Holland"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Savage Steve Holland"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091680/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2MTU1NjQwOF5BMl5BanBnXkFtZTcwNzM3NTkxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: John Cusack, Demi Moore, Linda Warren | See full cast and crew »"],
      "reviews": [
         "I have to admit that these days, I can't stand Demi Moore. It seemed almost as soon as I 'discovered' her (and developed a squirmy adolescent crush on her) via this film, her career went stellar, the films got worse and she turned into just another boring megastar. Life sometimes really sucks. But ONE CRAZY SUMMER doesn't suck. It's a very amusing and eminently likeable teen comedy that doesn't stoop to bad taste gags or gross-out schtick for its laughs (Farrelly brothers, take note) and relies on its very eighties feelgood charm to win you over. I watched this one over and over again on VHS when I was a kid, and I must've driven my parents and friends insane with my constant cries of \"Chilli dog!\", \"This is a love story, not a Rambo bloodbath!\", \"Hi Cookie! I'm Egg...gemini!\" and all those other little bits of treasurable dialogue. The cartoon sequences are brilliant, nicely subversive in a Ralph Bakshi - Robert Crumb way, and the cast are perfect. Bobcat Goldthwait really turns the spastic nerd persona up HIGH here, and one of the most killingly funny moments in his career occurs when someone playfully throws a beachball at his head, only for him to yelp \"That really smarts, that went in my eye!\" Trust me, it's so funny. I want to go to Nantucket Island some day and find a cute rock chick who prefers shy cartoonists to buff studs with hot cars and have a bunch of zany adventures with some wacky friends, but until I do, I'll just watch ONE CRAZY SUMMER again. Enjoy!",
         "In the eighties, Savage Steve Holland put out three movies, two of which are classics of what seems to be a very small genre, absurdist teen comedies. The third \"How I Got Into College\" does not measure up to \"Better Off Dead\" and this one, mainly because of it's lack of John Cusack and Curtis Armstrong (Except for a tiny cameo). One Crazy Summer is an underrated movie, with lots of great characterizations and gags. As I recall, Savage Steve's movies were vilified as being brain dead at the time and after three movies he drifted into children's TV. We could use more movies from the likes of him.",
         "The always likable Cusack collaborates with \"Better Off Dead\" director Holland again in this comedy about a struggling cartoonist who helps a singer (Moore...And boy does she sing badly.) save her family home from a land developer on the island of Nantucket. Goldthwait is his usual maniacal self and adds some laughs to the picture. A film that has loads of fun with itself. Completely harmless.",
         "Thus starts \"One Crazy Summer\", the evil twin of \"Better off dead..\". How can any movie be bad when the opening lines are sung by David Lee Roth? This movie is a total blast. Pairing again John Cusack with Curtis Armstrong, but this time adding Bobcat Goldwaith to the mix has great, funny results. Hyperactive Bobcat grates the nerve of everyone around, Curtis \"Ak Ak\" is the son of a deranged military with pacifist tendencies, and Demi Moore (with natural breasts... wow!) as the love interest of, once again, chronically depressed Cusack. The story is, well, simple enough. The laughs are there, but both Savage Steve Holland films have a certain quality to them... they are funny, but they are also sweet. The scene where Curtis finds a blown up doll in the target practice beach, and begins musing about how a little girl won't be able to sleep was dumb, funny and touching. The animation used throughout is quite surreal. \"The Boat\" is hysterical (complete with Watsamatta U. sail and Odie plush doll). Overall, a fun film, though not as good as \"Better off dead...\"",
         "Upon seeing ONE CRAZY SUMMER for the first time many years ago, I wasn't very impressed with it. I thought it had some decent laughs, but I was overall disappointed. Then I saw this again movie last summer when it was on VH1 and my opinion instantly changed. I loved it. If there is one movie genre that really stuck out in the 1986, it was goofy comedies. From ARMED AND DANGEROUS to POLICE ACADEMY 3: BACK IN TRAINING, 1986 was full of wacky comedies. Perhaps the wackiest of them all, ONE CRAZY SUMMER, like all of Savage Steve Holland's movies, is a classic. Hilariously insane and inventive and loaded with great lines, 'summer' is John Cusack's best movie to date. According to a recent interview I read with Savage Steve Holland, Cusack really hates this movie as well as BETTER OFF DEAD, his previous collaboration with Holland. What Cusack could possibly hate about both movies is beyond me. Both are comedic masterpieces. However, ONE CRAZY SUMMER is the better of the two, mainly because it has a better cast. The cast does a terrific job (Bob Goldthwait has never been funnier). Simply a classic! ****",
         "^ 4.5/10 I found this film to be very similar to \"Better off Dead\" in terms of premise and cartoons. However, \"Better...\" was so so much better because it was really interesting and the gags worked better. This film just seemed to drag on and on even though it was only 1.5 hours...it literally wouldn't end. Most of the characters were under-developed except for John Cusack who was great as usual. Those two Calamari characters were so damn annoying and really got on my nerves. All in all the only things that stood out in the movie were John Cusack, the soundtrack and the animated cartoons were really fantastic. Otherwise boring film and I would rather watch \"Better off Dead\"",
         "An outstanding Cusack movie with an incredible supporting cast of Demi Moore, Bobcat Goldthwait & Curtis Armstrong (Booger from Nerds). I'm not even a Bobcat fan & he is hilarious in this movie. Also a good performance by the late Tom Villard as Bobcat's \"twin\". The DVD also has a commentary with Bobcat, Curtis & the films director Savage Steve Holland (Better Off Dead). You will not be disappointed.",
         "This is beyond stupid. Two high school graduates travel to Nantucket for the summer and find situations there that are absolutely revolting. Demi Moore co-stars in this one. As the film was in 1986, was Ashton Kutcher just a babe in the woods at that time? Moore's grandfather has died and his home is on the verge of being sold to ruthless people with a father and son who bring a new meaning to the term mean. Bobcat Goldthwait, with that obnoxious voice is in the film, as well as two brothers, who make dumb and dumber look more and more intelligent. The writing is absolutely ridiculous. Highlights of the stupidity are where one person says to the other: \"Did you ever notice that when people die, they go alphabetically in the papers?\" I rest my case.",
         "This movie is exactly the same thing as \"Better Off Dead...\" Think about it. It's a romance-comedy starring John Cusack as a near-mute (Cusack didn't start talking in his movies until \"High Fidelity\") cartoonist, whose cartoons come to life, made just one year after \"Better Off Dead...\" POSSIBLE SPOILER: Both involve a competition at the end of the movie so that Cusack's character can get what he wants; naturally, Cusack wins. NO MORE SPOILERS So why does \"Better Off Dead...\" work so much better? I have no idea. But I would recommend skipping \"One Crazy Summer\" unless you really, REALLY loved \"Better Off Dead...\"",
         "I love this movie. Why you ask, it's because this movie has a very basic storyline: guy finds girl, guy disses girl, guy wins boat race so she can buy back her home, girl and guy find romance. Bobcat Goldwaith steals this show. Rare that I can say that, but his Godzilla impression really magnifies the wild humor to fantastic movie. Rent it now."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["A&M Films"],
      "summaries": [
         "With a name like Hoops McCann, he's bound to get that basketball scholarship after high school, right? Wrong! What Hoops really wants to do is write and illustrate a love story. To help him find his way, his friend George invites Hoops to come with him and his sister to spend the summer on Nantucket. The friends Crazy Summer begins when they pickup Cassandra on the way--she's being chased by a motorcycle gang. From here on in, it only gets crazier. Once on the island, Hoops and George, along with George's island friends the Stork twins and Ack-Ack (son of a marine), must help Cassandra save her grandfather's house from the greedy Beckersted Family. Along the way, Hoops must find a way to write his cartoon love story - and maybe a real one of his own.",
         "An aspiring teenage cartoonist and his friends come to the aid of a singer trying to save her family property from developers."
      ],
      "budget": 0
   },
   "movielensId": 2261,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-08",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Savage Steve Holland"],
      "runtime": 89,
      "movieId": 2261,
      "title": "One Crazy Summer",
      "mpaa": "PG",
      "actors": [
         "John Cusack",
         "Demi Moore",
         "Bobcat Goldthwait",
         "Tom Villard",
         "Jeremy Piven",
         "Billie Bird",
         "Curtis Armstrong",
         "Joe Flaherty",
         "Mark Metcalf",
         "William Hickey",
         "Taylor Negron",
         "Rich Little",
         "John Matuszak",
         "Joel Murray",
         "Kimberly Foster"
      ],
      "imdbMovieId": "0091680",
      "originalTitle": "One Crazy Summer",
      "genres": [
         "Drama",
         "Comedy",
         "Romance",
         "Family"
      ],
      "youtubeTrailerIds": ["8p_iuHXppzs"],
      "plotSummary": "An aspiring teenage cartoonist and his friends come to the aid of a singer trying to save her family property from developers.",
      "tmdbMovieId": 18282,
      "avgRating": 3.30874,
      "releaseYear": "1986",
      "numRatings": 1179,
      "posterPath": "/fFqMnlM6C2wLLbtno6LO5PtuRO6.jpg"
   }
}