{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "chicago",
            "id": 520
         },
         {
            "name": "new year's eve",
            "id": 613
         },
         {
            "name": "relationship problems",
            "id": 5625
         },
         {
            "name": "softball",
            "id": 17926
         }
      ],
      "imdb_id": "tt0090583",
      "video": false,
      "title": "About Last Night...",
      "recommendations": [
         17956,
         11557,
         11521,
         117553,
         30231,
         77469,
         12518,
         11028,
         8992,
         11591,
         21500,
         31633,
         15592,
         66469,
         4205,
         47817,
         24249,
         222960,
         223020,
         100377
      ],
      "backdrop_path": "/rSljtiH7VlSVwiVKO8aTaNbqL0t.jpg",
      "revenue": 38702310,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Debbie",
               "gender": 1,
               "credit_id": "52fe47659251416c75097cbd",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Danny Martin",
               "gender": 2,
               "credit_id": "52fe47659251416c75097cc1",
               "name": "Rob Lowe",
               "profile_path": "/yt6vMZVBXGCJL0xRE4jFa4SjzcQ.jpg",
               "id": 2879,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Bernie Litgo",
               "gender": 2,
               "credit_id": "52fe47659251416c75097cc5",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joan",
               "gender": 1,
               "credit_id": "52fe47659251416c75097cc9",
               "name": "Elizabeth Perkins",
               "profile_path": "/bkdWnnrMADJcFpKAOitMjQH3uEQ.jpg",
               "id": 20,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Mr. Favio",
               "gender": 0,
               "credit_id": "52fe47659251416c75097cfd",
               "name": "George DiCenzo",
               "profile_path": "/u5pQL3gkcGcnpkc9NPuyiBB3e8f.jpg",
               "id": 1069,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Steve Carlson",
               "gender": 2,
               "credit_id": "52fe47659251416c75097d05",
               "name": "Robin Thomas",
               "profile_path": "/seivBO3KRFAKqNgL3wnvpwxHwKz.jpg",
               "id": 41465,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe47659251416c75097d09",
               "name": "Donna Gibbons",
               "profile_path": null,
               "id": 1080059,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Pat",
               "gender": 1,
               "credit_id": "52fe47659251416c75097d0d",
               "name": "Megan Mullally",
               "profile_path": "/2KEpCVRVafx9tLho5iMyR9WWt3k.jpg",
               "id": 52119,
               "order": 7
            },
            {
               "cast_id": 29,
               "character": "Mother Malone",
               "gender": 2,
               "credit_id": "55f54482c3a3680a0d005fa9",
               "name": "Michael Alldredge",
               "profile_path": "/cmWkrUrcApkshaSgsUHt7A71BaX.jpg",
               "id": 1216866,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Leslie",
               "gender": 0,
               "credit_id": "52fe47659251416c75097d11",
               "name": "Patricia Duff",
               "profile_path": null,
               "id": 184757,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Mrs. Lyons",
               "gender": 1,
               "credit_id": "52fe47659251416c75097d15",
               "name": "Rosanna DeSoto",
               "profile_path": "/ppAz1PLGnuxTgXYDVWblLgXKkqp.jpg",
               "id": 2111,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Carrie",
               "gender": 1,
               "credit_id": "52fe47659251416c75097d19",
               "name": "Sachi Parker",
               "profile_path": "/hjJZ6459PmWZKsOKZ1V8dbIjDTG.jpg",
               "id": 77874,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe47659251416c75097d1d",
               "name": "Robert Neches",
               "profile_path": null,
               "id": 162092,
               "order": 12
            },
            {
               "cast_id": 31,
               "character": "Gus",
               "gender": 2,
               "credit_id": "59b79987c3a368156c00b9f0",
               "name": "Joe Greco",
               "profile_path": "/oskWFXipn0TTBaIc9esASw3EJW2.jpg",
               "id": 1228768,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Carmen",
               "gender": 1,
               "credit_id": "52fe47659251416c75097d25",
               "name": "Ada Maris",
               "profile_path": null,
               "id": 177412,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Crystal",
               "gender": 0,
               "credit_id": "52fe47659251416c75097d29",
               "name": "Rebeca Arthur",
               "profile_path": "/cjkIIdn9RmbQOxvhM2w0SG9gPph.jpg",
               "id": 165938,
               "order": 15
            },
            {
               "cast_id": 27,
               "character": "Colin",
               "gender": 0,
               "credit_id": "52fe47659251416c75097d2d",
               "name": "Tim Kazurinsky",
               "profile_path": "/4MeLlddWvGZGFpHvwwTtrgHepP2.jpg",
               "id": 95216,
               "order": 16
            },
            {
               "cast_id": 28,
               "character": "Ira",
               "gender": 2,
               "credit_id": "52fe47659251416c75097d31",
               "name": "Kevin Bourland",
               "profile_path": null,
               "id": 155967,
               "order": 17
            },
            {
               "cast_id": 30,
               "character": "Madge",
               "gender": 1,
               "credit_id": "56af2435c3a3681c3b00c527",
               "name": "Charlotte Maier",
               "profile_path": "/tffih3Dq7qIhLatPFO4uQSuwvbq.jpg",
               "id": 26722,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47659251416c75097ccf",
               "name": "Jason Brett",
               "profile_path": null,
               "id": 115841,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47659251416c75097cd5",
               "name": "Miles Goodman",
               "profile_path": null,
               "id": 63964,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe47659251416c75097cdb",
               "name": "Gail Eisenstadt",
               "profile_path": null,
               "id": 115844,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe47659251416c75097ce1",
               "name": "Stuart Oken",
               "profile_path": null,
               "id": 57114,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47659251416c75097ce7",
               "name": "Arnold Stiefel",
               "profile_path": null,
               "id": 54045,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47659251416c75097ced",
               "name": "Edward Zwick",
               "profile_path": "/ucBi071XeIGMEHaEGKtU6PN1FwN.jpg",
               "id": 9181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47659251416c75097cf3",
               "name": "Tim Kazurinsky",
               "profile_path": "/4MeLlddWvGZGFpHvwwTtrgHepP2.jpg",
               "id": 95216,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47659251416c75097cf9",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.084296,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18169,
      "vote_count": 62,
      "budget": 0,
      "overview": "A man and woman meet and try to have a romantic affair, despite their personal problems and the interference of their disapproving friends.",
      "similar": [
         117,
         258480,
         1574,
         4147,
         9377,
         284,
         9277,
         5,
         38,
         599,
         239,
         813,
         2064,
         8999,
         525,
         2539,
         1844,
         416477,
         2048,
         5503
      ],
      "original_title": "About Last Night...",
      "runtime": 113,
      "poster_path": "/mBHRjyhRG01MGyv5re7xvGLgVWB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Delphi V Productions",
            "id": 1174,
            "origin_country": ""
         }
      ],
      "release_date": "1986-07-02",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Making love was easy...being in love difficult.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Edward Zwick"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "David Mamet",
         "Tim Kazurinsky"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090583/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODkzMTIyNDA3OF5BMl5BanBnXkFtZTcwMTU0NTk5Mw@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rob Lowe, Demi Moore, James Belushi | See full cast and crew »"],
      "reviews": [
         "I know I know you look at the cast and say \"Geez, another a brat pack movie from the 80's\". However, this movie is really good. The scariest part is how accurate the movie is in portraying the challenge to find true love among young twenty something's in the eighties. All of which still applies today. Did David Mamet know something thirty years ago that we didn't? Even the four main characters and the different personalities they have are easy to relate too and understand because they are all people that we know or once used to know!!!!! Danny (Rob Lowe), a restaurant supply salesman, and Debbie (Demi Moore), an art director at an advertising agency, meet at a baseball game and later link up at a singles bar in Chicago. He's a handsome guy used to one-night stands; she's having an affair with her boss but is looking for something more romantic and less sleazy. After a one-night stand at Danny's apartment, Debbie tells him, \"It's been a slice of heaven.\" She returns to her place where she lives with Joan (Elizabeth Perkins), a kindergarten teacher whose smart ass tongue discourages most men. Meanwhile at work, Danny's buddy Bernie, a Neanderthal barbaric like fellow (played beautifully by Jim Belushi) who sees himself as a lady killer, queries his friend about his date with Debbie. The affair continues, and Debbie decides to move in with Danny. Living together proves to be a difficult experience for them. They try out plenty of new positions for sex, but find that coping with each other's habits, quirks, and expectations is far more challenging. Danny's passivity and inability to open up bother Debbie. At one point, he discovers her looking through his private possessions for clues to his past life. Debbie, of course, wants them to be a couple, while Danny, hiding behind the myth of the independent male, doesn't want to tie himself down and so ends up treating Debbie as nothing more than a live-in sexual object. And if there isn't enough tension between them, Bernie and Joan are constantly trying to sabotage their relationship. Thus the beginning of the end starts when Danny and Debbie use the \"L\" word after a steamy night of passion. Danny's frustrations with his career spill over into his relationship with Debbie. More frustrations come about with his best friend Bernie giving him a hard time about being with Debbie, losing touch with his own free spirit partier identity and a lack of communication with Debbie. This ultimately leads to a gut wrenching break up scene followed by Danny's painful attempts to get Debbie back after he finally realizes that what he had was special and now wants back what he has lost. As I was watching this movie I found myself squirming in my seat while these characters struggle to relate to each other. It wasn't very difficult for me to remember that I had gone through the same heartbreaking downfall of a good relationship in my early twenties due to my lack of communication and inexperience regarding matters of the heart like Danny in the movie. And how difficult it can be to move on. My only peace of mind comes at the end when Danny and Debbie decide to start courting again. This time with the realization that they were both unrealistic and naive and that they will be better to each other because of the painful lessons learned. The voices inside Danny, Debbie, Bernie, and Joan speak volumes about the loneliness, anger, self-hate, and fear of men and women who remain perplexed about themselves and the opposite sex. About Last Night is a provocative portrait of young adults. A very underrated movie and a must see.",
         "This movie is extremely entertaining and moving. Neither Demi Moore nor Rob Lowe has ever looked better (and you get to see plenty of them). The last scene never fails to get me, and the whole movie rings incredibly true on being in love. Hell, Demi Moore even looks and acts like a girlfriend I had when I was a little bit younger. This is a funny, smart movie that stays with you forever, and I will pay it the ultimate compliment: We are lucky it was made. Vastly underrated on this site, About Last Night is a ten.",
         "Film gets ripped by most, but I like it. Rob Lowe & Demi Moore find each other and enter on-again, off-again relationship. Demi has never looked better, and Jim Belushi is outstanding as Lowe's well-meaning but crude best friend. More realistic about relationships than most Hollywood productions.",
         "In 1980's Chicago two attractive young people develop a very 1980's relationship. After falling into bed together on their first meeting they progress through a tentative relationship to moving in together, moving out again, and then possibly to some sort of reconciliation. The film was made contemporaneously with the period it is set in and is one of those films that evoke their particular time with well-observed accuracy. Demi Moore and Rob Lowe deliver strong performances as the articulate, successful \u0096 and confused - central characters, with Moore in particular able to reflect on the developing crises with astute asides. The film possibly has two structural problems. First, it is too long. Boy endlessly prostrating himself in front of Girl he has sent packing gets tedious, and the tension regarding what may happen starts to dissipate. Secondly, the more-or-less mandatory Best Friend characters are almost too strong. Lowe's buddy James Belushi is a chauvinist slob, but also a bit of a charmer - and with some of the best lines. Moore's confidante Elizabeth Perkins may be something of a shrew, but a damned attractive one. These two take an intense dislike to each other from the start, and as the main romance stalls their relationship becomes by far the more interesting one with its vague possibility that such a sparky loathing just might lead to something more positive - if pretty combustible!",
         "In Chicago, the salesmen of restaurant supplies Danny Martin (Rob Lowe) and Bernie Litgo (James Belushi) are best friends and womanizers. One night, the handsome Danny meets Deborah 'Debbie' Sullivan (Demi Moore) in a bar and they have one night stand. Debbie works in an advertisement agency and lives with her roommate and best friend, the kindergarten teacher Joan Gunther (Elizabeth Perkins), and falls in love with Danny. The infatuated Debbie moves to Danny's apartment and they have great sex but very few conversation. Their closest friends Joan and Bernie frequently try to sabotage their relationship. Five months later, Danny breaks with her and the brokenhearted Debbie returns to Joan's apartment. Meanwhile Danny grows up and misses Debbie, but maybe it might be too late for reconciliation. \"About Last Night\u0085\" is one of the best movies about love, sex and immature relationship from the 80's and one of my favorite films ever. The charming lead characters are wonderfully performed by Demi Moore and Rob Lowe that show a magnificent chemistry. The story is realistic and shows the difficulties of a young couple to live together, with four young central characters of twenty and something years old: Debbie is a young woman that has an affair with her boss and has a crush on Danny and wants a steady relationship. Danny is an insecure man frustrated with his work that does not want to have a commitment with Debbie. Bernie is chauvinist pig that sees women as sexual objects. And Joan is a frustrated woman that is constantly dumped by her boyfriends. \"About Last Night\u0085\" is a cult for people from my generation that certainly will find identification with the lead characters and their relationships. Last but not the least, Demi Moore is delightful to be seen in the 80's (\"No Small Affair\"; \"St. Elmo's Fire\" and \"About Last Night\"). My vote is nine. Title (Brazil): \"Sobre Ontem a Noite\u0085\" (\"About Last Night...\")",
         "Debbie (Demi Moore) is a successful, young professional in the Chicago area. She and her friends like to hit the neighborhood bar and ogle the men. These women consider themselves \"modern\", that is, they are not looking for a lasting relationship, just a hot night with Mr. Good Looking. One evening, after a softball game, Debbie meets Dan (Rob Lowe). They are instantly smitten with each other, both being very attractive and very hormonal, and they spend the night together. Debbie tells him thanks for the \"slice of heaven\" and goes on her way. Yet, a day later, they end up calling one another on the phone, at the same moment. They set up a second date, which ends in another lusty evening. Fairly soon, they move in together but set up guidelines. None of this acting like a married duo, although they take turns cooking and shopping. Yet, is it possible for them to treat each other like roommates only and never let their hearts be touched? And, how long will their relationship last? This is truly a very romantic movie with many assets. Lowe and Moore are absolutely gorgeous, gorgeous human beings and lovely to look upon. The movie also has an intelligent, humorous, truthful and very touching script. Then, too, the costumes, Chicago setting, and cinematography are very worthy, indeed. However, if you like your movies without a lot of sexual encounters, this is not the film for you. This story is an exploration of the nature of modern existence, where sex and birth control are both readily available. As such, it has many eyebrow raising scenes of romantic tete-a-tetes. Therefore, if you prefer good, clean romance movies, try Return to Me or Only You instead. But, if you are willing to look past some fast and loose scenes in exchange for a truly touching and romantic film, get this one tonight.",
         "Demi Moore plays Debbie, the ad exec in loveless relationship with her boss. Rob Lowe plays Danny, a restaurant supplier in a loveless relationship with....well anyone really. The two meet in a bar after a baseball game and one thing leads to another and they jump into the sack with each other that very night. A casual sex relationship develops between the two for a few weeks until they decide to move in together, but that's when their problems really start. James Belushi & Elizabeth Perkins plays Bernie & Joan, Danny & Debbie's best friends respectively. Belushi is a sexist, misogynist pig and Elizabeth Perkins is an uptight, feminist, man hater. Both think that Danny & Debbie are making a huge mistake and with such conflicting viewpoints, they despise each other but Bernie is Danny's confidant and likewise Joan is Debbie's. They both have separate agenda's to split them up but set about it from very different angles. However, their input is not really needed as it soon becomes apparent to both Danny & Debbie that basing a relationship purely on great sex is no basis at all and that the resulting peer pressure is just the straw being placed atop of the proverbial camel's back. About Last Night is generally pigeonholed as a comedy, but is more correctly a romantic drama with some comic moments attached. Moore & Lowe play their parts really well as the two confused twenty somethings playing house, but it's the scenes that Belushi & Perkins appear in, especially together, that really make the movie a must watch. About Last Night will please the guys because Demi gets her kit off regularly and it will please the girls because not only is it the one of the best '80's chick flicks but Rob gets his kit off too. It also has a great soundtrack to boot. It's about men, women, choices, sex, ambition, moving in, no sex, risk, underwear, friendship, career moves, strategy, commitment, love, fun, breaking up, making up, bedtime, last night... Enjoy!!!",
         "At 5.8 stars this is underrated, probably dismissed due to two brat packer leads (Demi Moore, Rob Lowe) at the peak of their annoying bratpackerdom. It turns out, however, ABOUT LAST NIGHT is surprisingly witty and literate. It takes an unusually soulful look at the differences between how 20-something men and women see love and relationships, and is one of the smarter romantic comedies of the past 15 years. There are a number of crisp and quotable dialogue exchanges (particularly between irascibly sexist Belushi and irrepressibly man-castrating Perkins), some funny but some heartfelt. The entire cast performs well, too, probably thanks to the steady hand of director Ed Zwick. In particular, Demi Moore is pretty darn good in both the light stuff (her memorable \"female secrets\" list to Lowe) and then later as the devastated and heartbroken weeper after the split. The usually cardboard Lowe is also surprisingly good, actually emoting and garnering our sympathy after foolishly breaking up with Demi but quickly realizing he has made a terrible mistake. As \"Boy Meets Girl, Boy Loses Girl\" scenarios go, ABOUT LAST NIGHT's premise israther routine. However, the execution is cleverer and we care about Lowe's and Moore's characters, who are appealing and well drawn. SNL veteran Tim Kazurinsky scribed the story, which has just the right touch of angst, tears and laughter. More than comedy, however, ABOUT LAST NIGHT takes a revealing and realistic look at differences between the way men and women think. Perhaps a bit shmaltzy in the end, but still a productive use of your time, and a generally worthy relationship movie. 8.5 / 10.",
         "About Last Night casts Rob Lowe and Demi Moore as a pair of 20 somethings living and working on the north side of Chicago. Rob is a salesperson for restaurant supplies and a pretty good one. But he lacks a college education and is reluctant to go back to school. He's also deathly afraid of commitment which means marriage and all that brings. But after he and Demi after a night's kanoodling which they agree is the best they each ever had, she moves in with him. The sex is fabulous, but can they learn to both like and tolerate each other? Each has a best friend that is working for mixed motives to sabotage the relationship. Lowe's best friend is Jim Belushi who's a cheerful hedonist and just doesn't want to lose his best friend and co-worker as a partner in debauchery. Demi's best friend is Elizabeth Perkins who just thinks Lowe is too good and too good looking to be true. She's been through the mill and does break up with a man during the film. She's concerned about Moore, but I think Perkins is a little jealous as well. About Last Night is taken from an off Broadway play by David Mamet who had more of a serious examination of human relations in mind than this brat pack film. Still as a brat pack film, it's pretty good and the location shooting in Chicago certainly helps. We even get to see some of the rooftop locations where one can see a ballgame in that most famous of north side landmarks, Wrigley Field. It might not be David Mamet's vision, but About Last Night is an all right film comedy from the Eighties. And no film that has Wrigley Field can ever be bad.",
         "One of my favorite Mamet scripts, About Last Night is true to life and a fine piece of film. I think most adults have known someone like the Jim Belushi character, or the Elizabeth Perkins character. This is one of the films that really captures real situations and makes them interesting, something that Mamet is the king of. I'm not a Rob Lowe fan, but here he was perfectly cast, as was Moore. If you've ever been single for any period of time, this is a movie for you."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Delphi V Productions"
      ],
      "summaries": [
         "Danny and Bernie are two single men living their lives on the wild side. But when Danny meets Debbie at a bar and the two start a relationship with a one night stand, Danny's life takes a different turn. How does this passionate night become a full affair and what effect will this relationship have on both people and their friendship with their best mates ?",
         "In Chicago, the salesmen of restaurant supplies Danny Martin and Bernie Litgo are best friends and womanizers. One night, the handsome Danny meets Deborah 'Debbie' in a bar and they have one night stand. Debbie works in an advertisement agency and lives with her roommate and best friend, the kindergarten teacher Joan, and they fall in love with each other. The infatuated Debbie moves to Danny's apartment and they have great sex but very few conversation. Their closest friends Joan and Bernie frequently try to sabotage their relationship. Five months later, Danny breaks with her and the brokenhearted Debbie returns to Joan's apartment. Meanwhile Danny grows up and misses Debbie, but maybe it might be too late for reconciliation.",
         "A man and woman meet and try to have a romantic affair, despite their personal problems and the interference of their disapproving friends."
      ],
      "budget": 0
   },
   "movielensId": 2262,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-07-02",
      "dvdReleaseDate": "1998-12-22",
      "directors": ["Edward Zwick"],
      "runtime": 113,
      "movieId": 2262,
      "title": "About Last Night...",
      "mpaa": "R",
      "actors": [
         "Demi Moore",
         "Rob Lowe",
         "Jim Belushi",
         "Elizabeth Perkins",
         "George DiCenzo",
         "Robin Thomas",
         "Donna Gibbons",
         "Megan Mullally",
         "Michael Alldredge",
         "Patricia Duff",
         "Rosanna DeSoto",
         "Sachi Parker",
         "Robert Neches",
         "Joe Greco",
         "Ada Maris",
         "Rebeca Arthur",
         "Tim Kazurinsky",
         "Kevin Bourland",
         "Charlotte Maier"
      ],
      "imdbMovieId": "0090583",
      "originalTitle": "About Last Night...",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["xJqUj5RPZkc"],
      "plotSummary": "A man and woman meet and try to have a romantic affair, despite their personal problems and the interference of their disapproving friends.",
      "tmdbMovieId": 18169,
      "avgRating": 3.09352,
      "releaseYear": "1986",
      "numRatings": 2406,
      "posterPath": "/mBHRjyhRG01MGyv5re7xvGLgVWB.jpg"
   }
}