{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "prisoner",
            "id": 1563
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0098625",
      "video": false,
      "title": "We're No Angels",
      "recommendations": [
         10859,
         12280,
         10168,
         12395,
         10551,
         11896,
         13536,
         9566,
         10699,
         31608,
         11062,
         10631,
         10905,
         3784,
         12647,
         11465,
         14550,
         9013,
         11066,
         10169
      ],
      "backdrop_path": "/3yDXJnBqHdjztrd7YVneRe30LOY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Ned",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088315",
               "name": "Robert De Niro",
               "profile_path": "/lvTSwUcvJRLAJ2FB5qFaukel516.jpg",
               "id": 380,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Jim",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088319",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe4433c3a36847f808831d",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Father Levesque",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088321",
               "name": "Hoyt Axton",
               "profile_path": "/sIJjj88LfVpvnxW56Ffr6qlj7wI.jpg",
               "id": 16166,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Deputy",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088325",
               "name": "Bruno Kirby",
               "profile_path": "/jGRVym5zAQZix5N4ZRabuE3XKHm.jpg",
               "id": 9257,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Warden",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088329",
               "name": "Ray McAnally",
               "profile_path": "/h7ZRXky7CHIePHPCwSVTK9vEi9E.jpg",
               "id": 40008,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Bobby",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f808832d",
               "name": "James Russo",
               "profile_path": "/tV4X0uEuqu6XYml3yEs9rsG9EzW.jpg",
               "id": 785,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Translator",
               "gender": 2,
               "credit_id": "54ece1ae9251417968002308",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Young Monk",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088335",
               "name": "John C. Reilly",
               "profile_path": "/3LpfXon9xQZc1M2AFvfXyLeICbg.jpg",
               "id": 4764,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Deputy",
               "gender": 0,
               "credit_id": "52fe4433c3a36847f8088339",
               "name": "Bill Murdoch",
               "profile_path": null,
               "id": 46996,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Passersby",
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088331",
               "name": "Richard Newman",
               "profile_path": "/dCXop3FsQj0cLHaMkBWwaCQzTmW.jpg",
               "id": 46995,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80882cf",
               "name": "Neil Jordan",
               "profile_path": "/4OWdIhT5gcfcHoBUzGL7E8tu9T1.jpg",
               "id": 17016,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80882d5",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80882db",
               "name": "Albert Husson",
               "profile_path": null,
               "id": 32108,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80882e1",
               "name": "Ranald MacDougall",
               "profile_path": null,
               "id": 31843,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80882e7",
               "name": "Sam Spewack",
               "profile_path": null,
               "id": 46993,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f80882ed",
               "name": "Bella Spewack",
               "profile_path": null,
               "id": 46994,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80882f3",
               "name": "Art Linson",
               "profile_path": "/dEtVivCXxQBtIzmJcUNupT1AB4H.jpg",
               "id": 1254,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80882f9",
               "name": "George Fenton",
               "profile_path": "/23V03rGdkvNgeiBwLodJzNKdhJC.jpg",
               "id": 1528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f80882ff",
               "name": "Philippe Rousselot",
               "profile_path": null,
               "id": 1301,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4433c3a36847f8088305",
               "name": "Mick Audsley",
               "profile_path": null,
               "id": 294,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f808830b",
               "name": "Joke van Wijk",
               "profile_path": null,
               "id": 9023,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4433c3a36847f8088311",
               "name": "Wallis Nicita",
               "profile_path": null,
               "id": 12847,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 11.539824,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 5971,
      "vote_count": 139,
      "budget": 20000000,
      "overview": "Two escaped cons only prayer to escape is to pass themselves off as priests and pass by the police blockade at the border into the safety of Canada.",
      "similar": [
         483,
         1701,
         769,
         278,
         339692,
         575,
         398175,
         2142,
         3134,
         638,
         21950,
         10651,
         10471,
         294963,
         431,
         107846,
         298312,
         9093,
         2749,
         6075
      ],
      "original_title": "We're No Angels",
      "runtime": 106,
      "poster_path": "/9he4Lp6Wkc9X7O46wMn92Ei6lB1.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1989-12-15",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Escaped convicts disguised as priests. It'll take a miracle to get away with this one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Neil Jordan"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "David Mamet",
         "Ranald MacDougall"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098625/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwMjk3NjIxMl5BMl5BanBnXkFtZTcwOTU0MjAwMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert De Niro, Sean Penn, Demi Moore | See full cast and crew »"],
      "reviews": [
         "Well, ask me why this movie has such a poor rating. Or maybe don't ask me, because I have no answer. The movie is just great. The acting is perfect for this script, DeNiro and Penn are so funny and also serious when is needed. Why such a poor rating ? Maybe because people are not so funny as they were once. For the people of our days a comedy is something like Scary Movie or a movie that makes you laugh every minute because of something stupid. But \"We're No Angels\" is funny, is romantic, is serious, is educative, is simply GREAT MOVIE. You have to watch it with an innocent eye, you must enjoy the movie. Don't look at it with a critical eye. That's not good for the entertainment. Just watch it to relax and to feel good. It deserves it. And you also deserve it.",
         "With practically no resemblance to the 1955 Humphrey Bogart movie (nor to the play it was adapted from), film-buffs might find themselves perplexed as how to take this remake: two convicts escape prison and find themselves in a border town disguised as priests. What could be formulaic actually has some grit and ambiance to go along with its slapstick. Demi Moore, as a single mother of ill repute, gives one of her best performances here and works very well with Robert De Niro, while Sean Penn takes a while to get warmed up (and his thick accent is mildly irritating). John C. Reilly has a fantastic supporting bit as a novice priest who worships Penn, and there's a cute little girl in the movie who never acts like a movie kid (she's a natural). Lots of surprises in this critically-lambasted comedy, not the least of which is an extremely moving finale involving a waterfall and a holy statue. It had me transfixed. *** from ****",
         "I just saw this film again after not seeing it for over a decade. For all you who are wondering... is it good? is it bad? I have this to say. Excellent cast. Excellent castING. One of Demi Moore's best (yet small) roles (I'm not a big fan of hers.) Great script (Mamet). Great score. High quality filmmaking. They don't make them like this anymore, really. If you don't agree that its a very clever, dry-witted film, then, oh well. That's what makes the world go round. 9/10.",
         "Some movies become forgotten over the years, and \"We're No Angels\" is one of them. It's not a great comedy, but it's not a bad one, either. It's far more serious and moralistic than I had ever imagined, and Robert De Niro and Sean Penn essentially run around posing funny faces for the camera throughout, whilst the Catholic religion is used as a structural backdrop. It's a very different sort of role for De Niro, whose comedy is usually a bit more sophisticated. Here he barely talks at all, and when he does, it's usually harsh barking or screaming or frustrated whispers. It's not De Niro's most memorable role but it's certainly an unusual one. A lot of the movie focuses on mishaps and misconceptions, as all of the movies from this genre do. It bears resemblance to last year's \"School of Rock,\" about a loser who was mistaken for a teacher. This time the loser is equal to a pair of two escaped convicts and the teacher position is likewise that of priests. The story all begins with Ned (De Niro) and Jimmy (Penn) escaping from a northern jail circa 1930. After heading for the Canadian border, they find themselves pursued by a ruthless jail warden and a town of do-gooders. Luckily for the duo, right before they come to the Canadian border, they are mistaken for two long-lost Catholic priests, Fathers Brown (Penn) and O'Reilly (De Niro). After given an introduction to the area by a fellow priest (Hoyt Axton), they decide to hide out for a while using their new personas. No one would ever suspect a priest, right? The problem is that Fathers Brown and O'Reilly are supposed to be two of the smartest priests alive, having written a controversial book about the true meaning of the chapter Revelations in the Bible. So you can imagine the fear that Jimmy experiences when he is asked to lead the church in a pray prior to a meal. Meanwhile, the mandatory romance is inserted into the movie, using Demi Moore's single, rough, over-protective mother as the love angle for De Niro's character. Demi spits out an unconvincing northern accent, as De Niro stares at her a lot with critical eyes and tries to get her into bed. The romance is not necessary but it seems a lot more worthwhile than most of the romances in some of these films. The movie is one of the most forgotten I have ever seen; I'd never really heard of it prior to purchasing the newly-issued DVD. But I figured De Niro and Penn couldn't be that bad, and I was right. I think part of the reason so many people like to ignore it is that it doesn't poke fun at religion. It doesn't make the clergymen out to be strange idiots. Rather, it makes the two escaped convicts seem out-of-place in a heartwarming place. The spirituality affects Penn's character, Jimmy, and his final decision on the bridge that separates Canada from America is one that we have sensed was long coming since his fascination in the church grew. De Niro and Penn have two of the best faces in Hollywood, and a movie like \"We're No Angels\" uses this to its advantage. Making up for the long gaps of laughter, the director, Neil Jordan, focuses more on his two lead actors and their reactions to situations. Most of the time throughout the film, De Niro shrugs his shoulders a lot and emits low, agreeable groans from his throat in response to questions, while Penn looks confused and bewildered. There's a great scene where an eager-to-please clergyman (John C. Reilly) asks \"Father Brown\" something about his book, and Penn sort of stares at him for a few moments with searching eyes, trying to find a way out of the situation. For some reason, the mistaken identities setup has been a long-time fascination for Hollywood. Just look at \"Some Like it Hot,\" \"Tootsie,\" \"Nuns on the Run,\" \"Sister Act,\" \"School of Rock,\" etc. I think it's because we can all relate to a lot of the situations that the characters go through, and a lot of the embarrassment they suffer. We like to watch them ease their way out of dangerous areas and lie through their teeth. \"We're No Angels\" is one of the better examples of this formula executed quite well. It's not a terrific movie, but the actors are, and the script by David Mamet comes up with its own occasionally hilarious segments that make the movie uneven, but a lot more fun than you might expect. No, it's not great, but it's just funny -- and sweet -- enough to recommend. 3.5/5 stars. - John Ulmer",
         "We're No Angels,First-Viewing, owned VHS,(Neil Jordan)- Robert DeNiro, Sean Penn, Demi Moore, John C. Reily, Bruno Kirby, James Russo An interesting comedy starring two very talented actors. This is the first comedy role I've seen DeNiro in prior to his 90s comedies (analyze this, meet the parents, etc\u0085). DeNiro and Penn play escaped convicts who disguise themselves in a small town. Although DeNiro is great, and in certain scenes definitely shows his superiority as an actor, Penn overall gives the better performance. With a more complex character, yet simple (he is very simple-minded, but a complex character), his performance is very good. Although Demi Moore really didn't have a big role, she was convincing as a local woman in the small town. John C. Reily, once again gives a good performance, in a similar role to that of his in 'Casualties of War'. Overall a good film for laughs and well done by the director and screenwriter. Thought the acting was the highlight, and had some very funny scenes. 8/10",
         "Everyone knows what a black comedy is. But is there is such a thing as a white comedy? I think so, and I think this is one of them. In the same way that '21 Grams' works a fairly serious portrayal of a crisis of faith into a tense melodramatic thriller, 'We're No Angels' actually masks some serious thoughtfulness about the importance of faith and hope into a decently funny comedy of mistaken identity. It also illustrates concretely the truth of C.S. Lewis's famous dictum (from the Screwtape Letters)that all men become what they are pretending to be. The movie is very plotty and all the loose points neatly wrapped up. What a lot of the critics have missed is that all of the jokes are thematic, and tied to the central topics of the movie. I am not at all conventionally religious, but I do appreciate faith, and I liked this movie quite a bit.",
         "Got this DVD as a birthday gift and watched it.It is like \"Heaven Help Us\" in the sense that the nuances of the religion really are key to the comedic effect best portrayed by a look or a line that is subtle. Sure it could be better but depending on Budget and schedules not every movie can be Titanic, Longest Day, Gone with the wind,etc. If you like Deniro, or Penn...you'll like it.If you are from a Catholic or parochial upbringing you will like it.I'm not Siskel or Ebert; but I liked it.Close to the Canadien border and being set as other than the height of summer I'm surprised there we're ANY daylight scenes. There is a little girl in the Movie who sort of steals the show,A Demi Moore that supports this plot as it builds and Sean Penn makes you believe the ending.If on TV or available for rental; watch this movie for a relaxed comedy.",
         "I felt that this movie was a good movie. It had great actors, a great plot, and a great environment, which is the church in which the escape convicts fled and hid to. This movie really got me thinking about how short life is and how we should spend it the best way possible, which Sean Penn did at the end of the movie, which is to love and serve God.",
         "Saw this movie many years ago and really enjoyed it. My best friend has recently gotten on a Sean Penn kick, and I suggested he rent this. We watched it last night, and I again realized it's a very good story. Two important comments. First, it's not a comedy, as in a fall-on-the-floor, laugh-your-head-off, side-splitter. If you're looking for that, check out the Stooges, thank you. Second, the story is about miracles. Both the lower case miracles that happen all the time to people, as well as the upper case MIRACLES that may change our lives. The Writer and Director focus much of the action on how we make miracles happen for one another without some divine intervention; pay close attention to the drawing of the name in the lottery. And, if you don't spend time in liturgical circles as I do, you need to understand that the types and stereotypes in the ecclesial environment are real, in particular John C Reilly as the eager young Novice, and Wallace Shawn as the Translator/Master of Ceremonies. Last, kudos to Hoyt Axton, for his sincere, underplayed portrayal of the Abbot (Father Levesque); great men like that really do exist in some communities.",
         "I have seen the original and this is a rare remake that surpasses the original. What it really is about is how the Power Of God can improve the lives of four people who really needed him. Ned (Robert DeNiro), Jim (Sean Penn), Molly (Demi Moore), and her daughter. Obviously, the daughter being able to speak and the affect on Molly (Regaining her faith) was most important, but also how Jim was chosen to give a Sermon, and as he said it was the first time he \"Ever won anything.\" This led him down a path that God had planned for him, which is learning how to become a Priest, and influence others in his new identity as \"Father Brown.\" Ned, gains the least of the four (Although getting Demi Moore is not bad), but his role is the most important because he is the one who jumps in and tries to save the little girl and the presence of the statute of the Virgin Mary saves both of them. My favorite part of the film is where the girl speaks to The Translator\" (Wallace Shawn), and says they are conv... before going to sleep, and he thought they were converts not convicts. He said is this true? Ned says don't good works count for anything? When he said converts instead of convicts, Ned said we were born Lutherans, and The Translator said \"God Forgives You.\" That part followed by the ending where Ned and Molly go to Canada, and he hints to her about plans, and she says what plans? And he says all in good time, while Ned remains behind to become a monk. It shows the different paths that Ned and Jim will take while still being free. 10/10 Stars."
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Paramount Pictures Corporation (Canada)"
      ],
      "summaries": [
         "A couple of escaped convicts on the run find refuge with the Church when they are mistaken for two priests. The two are keen to flee but are unable to do so without the help of Molly.",
         "Two escaped cons only prayer to escape is to pass themselves off as priests and pass by the police blockade at the border into the safety of Canada."
      ],
      "budget": 20000000
   },
   "movielensId": 2264,
   "movielens": {
      "languages": [
         "English",
         "Magyar",
         "Italiano"
      ],
      "releaseDate": "1989-12-15",
      "dvdReleaseDate": "2004-02-17",
      "directors": ["Neil Jordan"],
      "runtime": 106,
      "movieId": 2264,
      "title": "We're No Angels",
      "mpaa": "PG-13",
      "actors": [
         "Robert De Niro",
         "Sean Penn",
         "Demi Moore",
         "Hoyt Axton",
         "Bruno Kirby",
         "Ray McAnally",
         "James Russo",
         "Wallace Shawn",
         "John C. Reilly",
         "Bill Murdoch",
         "Richard Newman"
      ],
      "imdbMovieId": "0098625",
      "originalTitle": "We're No Angels",
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["k7_zj-CgdaY"],
      "plotSummary": "Two escaped cons only prayer to escape is to pass themselves off as priests and pass by the police blockade at the border into the safety of Canada.",
      "tmdbMovieId": 5971,
      "avgRating": 2.70953,
      "releaseYear": "1989",
      "numRatings": 661,
      "posterPath": "/9he4Lp6Wkc9X7O46wMn92Ei6lB1.jpg"
   }
}