{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sheriff",
            "id": 798
         },
         {
            "name": "drag queen",
            "id": 824
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "broker",
            "id": 5628
         },
         {
            "name": "wealthy",
            "id": 10910
         }
      ],
      "imdb_id": "tt0102558",
      "video": false,
      "title": "Nothing but Trouble",
      "recommendations": [
         14170,
         11718,
         28117,
         14628,
         26261,
         18509,
         11418,
         2617,
         9080,
         10442,
         13203,
         14742,
         9409,
         11310,
         2620,
         9749,
         2687,
         10023,
         10631,
         8970
      ],
      "backdrop_path": "/xNbtTOfUkrNG8WlVSPMo0oz5Y4Q.jpg",
      "revenue": 8479793,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chris Thorne",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd65",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Judge Alvin 'J.P' Valkenheiser / Bobo",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd69",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dennis / Eldona",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd6d",
               "name": "John Candy",
               "profile_path": "/a53ilUnwQ4q7sM0F0h14dbunKA7.jpg",
               "id": 7180,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Diane Lightson",
               "gender": 1,
               "credit_id": "52fe44a39251416c7503bd71",
               "name": "Demi Moore",
               "profile_path": "/eLNoOYnxvhpV0BMSkNNnyyo5In7.jpg",
               "id": 3416,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Artie",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bdb9",
               "name": "Daniel Baldwin",
               "profile_path": "/vDLkhz6EliUtYumpJdFTquUvdfp.jpg",
               "id": 24516,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Fausto Squiriniszu",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bda9",
               "name": "Taylor Negron",
               "profile_path": "/l641HJtE8WSjWAJGHAer5Hx89SG.jpg",
               "id": 37043,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bdb1",
               "name": "Raymond J. Barry",
               "profile_path": "/k4WDNgYHOUgRaPQIsZUPUxl1lO6.jpg",
               "id": 10361,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Digital Underground Member",
               "gender": 2,
               "credit_id": "55a711b39251411e09000cc8",
               "name": "Tupac Amaru Shakur",
               "profile_path": "/qPpFzmTKEcxEea6J4UTI5ic1tsf.jpg",
               "id": 54422,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Renalda Squiriniszu",
               "gender": 1,
               "credit_id": "52fe44a39251416c7503bdad",
               "name": "Bertila Damas",
               "profile_path": "/pvrwuYZOQqRLIUKGh7662fuCKzN.jpg",
               "id": 143171,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Brian",
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bdb5",
               "name": "Brian Doyle-Murray",
               "profile_path": "/fRLFXdb8UQvJs4euZ2sE6CpjbXn.jpg",
               "id": 1535,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Miss Purdah",
               "gender": 1,
               "credit_id": "52fe44a39251416c7503bda5",
               "name": "Valri Bromfield",
               "profile_path": "/aZXdGwca8YAbXXZkLVKB74KpiDg.jpg",
               "id": 113906,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd77",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd7d",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a39251416c7503bd83",
               "name": "Lester Berman",
               "profile_path": null,
               "id": 42116,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd89",
               "name": "Robert K. Weiss",
               "profile_path": null,
               "id": 7181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd8f",
               "name": "Michael Kamen",
               "profile_path": "/y83bqw1VP1PkuvOhG2XROwc9eXG.jpg",
               "id": 7714,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd95",
               "name": "Dean Cundey",
               "profile_path": "/xunb0FZLZLhca2F5OJcKzV1mjR0.jpg",
               "id": 1060,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bd9b",
               "name": "Malcolm Campbell",
               "profile_path": null,
               "id": 14457,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a39251416c7503bda1",
               "name": "James R. Symons",
               "profile_path": null,
               "id": 13432,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 6.697941,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11933,
      "vote_count": 105,
      "budget": 40000000,
      "overview": "While attempting to seduce gorgeous lawyer Diane Lightson, wealthy gadabout Chris Thorne agrees to drive her to Atlantic City, N.J. But, when some reckless driving draws the attention of a deeply critical cop, they and the flamboyant \"Brazillionaires\" who tagged along end up in the court of a grotesque and vengeful judge, who has a special vendetta against the wealthy and erudite.",
      "similar": [
         11069,
         1427,
         11615,
         76640,
         273481,
         359940,
         346364,
         300665,
         301,
         4638,
         253,
         10528,
         1547,
         1368,
         14869,
         44896,
         681,
         927,
         956,
         281957
      ],
      "original_title": "Nothing but Trouble",
      "runtime": 94,
      "poster_path": "/6gWVNDugHkBlSQSsoe6OmbaFasE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Applied Action",
            "id": 9265,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-02-14",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "All they wanted was a little getaway. All they got was nothing but trouble.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dan Aykroyd"],
      "runtime": 94,
      "synopsis": "While hosting a party in his Manhattan penthouse, financial publisher Chris Thorne (Chevy Chase) meets Diane Lightson (Demi Moore), a distraught young woman whose fiancee recently broke up with her. Wanting to get to know her better (in order to hook up with her) Chris agrees to escort her to Atlantic City on the following day to a sales conference. Brash \"Brazillionaire\" brother and sister Fausto and Renalda meet up with them and invite themselves along. Along the way, Chris takes a supposed scenic detour off of the New Jersey Turnpike, ultimately ending up in the run-down mining village of Valkenvania. Failing to comply with a stop sign and subsequently attempting to escape pursuing officer Sheriff Dennis Valkenheiser (John Candy), the group is captured and taken before 106-year-old Reeve Alvin Valkenheiser (Dan Aykroyd), who confiscates their identification cards and drivers licences. Judge Reeve holds the offenders in his courthouse/funhouse to be judged. They attempt an escape, but due to a series of mishaps, the group splits up. Fausto and Renalda escape by swimming across a sewage-infested moat around Valkenheiser's \"funhouse\" only to be captured by Officer Dennis, where they cut a deal with him to let them escape. Dennis decides to quit his job as an officer. At ties, Chris and Diane, still trapped within the house, are at high risk of being shot by Dennis's trigger-happy cousin, Officer Miss Purdah. Judge Reeve is angered by their actions and imprisons Chris and Diane in a room from which the pair eventually escapes (again with a little help from Dennis) and, in time, become separated. Diane makes it out of the house and into the property's salvage backyard; here, she meets two ugly troll-like creatures by the names of Bobo (also Dan Aykroyd) and Lil' Debbull, the judge's severely deformed grandchildren whom are not allowed in the house. Earning the creatures' trust, Diane catches glimpses of Alvin's granddaughter/personal mechanic Eldona (John Candy, in drag) destroying Chris's BMW. Meanwhile, Chris sneaks into Reeve's personal quarters but is quickly caught. Judge Reeve Valkenheiser punishes him according to house policy, which decrees that Chris must marry Eldona. Chris pleads for help from another set of Reeve's victims, the alternative rap group Digital Underground. Although the group's members are being held on charges of speeding, Reeve releases them after being charmed by an impromptu performance of one of the group's hits. It is revealed here that the judge and his household have a long-standing grudge against \"bankers\" (in which category they seem to be able to place everybody with more money than themselves) because of the loss of most of the family's wealth due to a poor investment deal. The judge's invariable punishment for being a \"banker,\" and for just about everything else, is to be fed via roller coaster into a death machine called \"Mr. Bonestripper,\" and have one's remains shot out onto a large charnel heap. The machine breaks down the instant before Chris is fed into it, and he escapes. After retrieving Diane from the scrapyard, the two jump on a passing train back to New York. After the two report their plight to the authorities, Judge Reeve's courthouse is raided by local and state police. Chris and Diane are asked to accompany the officers to the site, only to find out that ALL of the officers involved are fully aware of and in league with the devilish Reeve. The couple only escapes when the area's underground coal fires cause a collapse, destroying the town and killing practically the whole village including Miss Purdah, the two trolls, and Eldona. Meanwhile, the Brazillionaires, Fausto and Renalda, are shown to have made their way back to South America in their home city of Sao Paolo, Brazil. Dennis is now their personal head of security and Renalda's lover. In the final scene, Chris and Diane are shown relaxing back in New York at Chris's apartment, happy that their nightmare is over, and of the two of them finding love with each other. When Diane goes to the bathroom to take a shower, Chris's relief does not last. When he turns on his TV set for the evening news, he stumbles on a televised news segment covering the ruined town of Valkenvania destroyed by the mine collapse, and he sees one of the surviving residents is Judge Reeve Valkenheiser, brandishing Chris's ID that he left behind, where he announces to the reporter that he and his family plan to move in with his new grandson-in-law in New York City! In a panic, Chris gets up and smashes through a wall in his apartment making a cartoon-line outline while screaming: \"No, you're not!!!\" THE END",
      "writers": [
         "Peter Aykroyd",
         "Dan Aykroyd"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102558/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzNDg5NTc2NV5BMl5BanBnXkFtZTcwODA2MjkxMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Chevy Chase, Dan Aykroyd, John Candy | See full cast and crew »"],
      "reviews": [
         "I, unlike a lot of others, found this movie to be extremely funny- both in a smart way and a sort of gross out way. Chevy Chase is really funny with his sort of smart-ass, dry wit, probably his best performance after Christmas Vacation. From the movies I've seen Demi Moore in, this ranks as her best and shows that she can do comedy. Dan Akroyd and John Candy each pull double duty in this one and do it well- I couldn't even tell the second character Dan was playing until the credits rolled. The sets are unreal- from the junkyard (complete with piles and PILES of random junk and the Baby Huey-esquire Lil' Debil and Bobo) to the house of the honorable judge, it's hard to believe they actually put this together. Don't take everybody's word, check it out and you won't be sorry...",
         "If your idea of a dark comedy is something like \"Beetlejuice\" or \"Deathtrap\" or \"Heathers\", then watch out. This one makes them look like Peewee's Playhouse. You know how certain horror movies cross over into comedy? Like when Freddy Krueger says \"Welcome to prime time b!tch!!\" and slams a girl's head into the TV? Well, this is the opposite: comedy crossing over into horror. It gets pretty weird, and if you're not expecting it, it can be downright upsetting. I think that's what makes so many people hate this movie. With an all-star comedic cast like it has, it promises to be a laugh riot like the DVD cover says. I was expecting something like \"Ghostbusters\" meets \"Fletch\" meets \"Summer Rental\". Instead it's more like \"Planes, Trains & Automobiles\" meets \"Deliverance\". In other words the comedy is very low-key, not quite enough to offset the disturbing story. Dan Akroyd, who plays a sadistic murdering judge, is just plain frightening. John Candy, who plays the sympathetic policeman, gives the story an air of tragedy. Chevy Chase is his usual wisecracking self, but it can't compete with the horror & violence of the plot (being trapped in a hicktown house while people are getting brutally murdered all around you). You really have to be ready for it, otherwise you might end up traumatized. But now that you've been warned, perhaps you'll be able to take it in stride. I'm not sure if writer Dan Akroyd intended this to be so nightmarish, but it sure is. Definitely a one-of-a-kind. NOT for young kids!!",
         "This isn't a four star classic. This isn't a motion picture epic to be adored for ages to come. This is not the measuring stick by which all comedies should be measured. However, this movie has gotten a bad reputation, undeservedly so. So, what is this movie? It's a harmless, mindless romp through an amusing storyline played out by the witty rapport of the core characters. The sight gags and slapstick, while cliche' and childish, are sure to bring a slight giggle. What's more fun than a judge who's idea for a great execution is dumping the accused in a rollercoaster called the \"Bonestripper?\" (Complete with Damn Yankees theme music, no less.) The performance of the Digital Underground brings a shimmer of surrealism to the whole ordeal. No, this isn't the best movie in the world, but it's far from the worst.",
         "I look up all of the movies I watch on IMDb, and I'm surprised that this one is so disliked. I think the main reason is that with a cast of such comedy legends as Chevy Chase, Dan Aykroyd and John Candy, people were expecting a more conventional comedy. Most of their audience was probably expecting something along of the lines of \"The Couch Trip\", \"Delirious\" or \"Fletch\". I think people like me, who appreciate campy horror films like \"2001 Maniacs\", \"The Butcher\" and any of the \"Texas Chainsaw Massacre\" series, are more likely to find some humor in this film. Thanks to the remarkably bland title, I had no idea that this was a comedy with a horror twist when I found it on a cable channel. The completely pointless start of the film, which involves a party and some sort of talk of some sort of business deal, also doesn't hint at what the film is really about. It isn't until the protagonists get arrested that all of the fun starts. What follows is something in between comedy and horror. It skews more towards horror, with tons of gross-out scenes thanks to Dan Aykroyd's various grotesque characters. There are tons of bones, but not a lot of blood. Unlike conventional horror movies, where body-counts are generally in the double digits, only one group of ne'er-do-wells end up slaughtered over the course of the film. Even the two annoying ancillary characters who are along for the ride, who would be dead meat in any real horror film, end up getting a reprieve and a happy ending. By far the strangest part, and my personal favorite, is the musical performance in the middle of the film. When I saw a limo pulling up in a scene halfway through the film, I thought, okay here come some more victims. I was surprised to say the least that the occupants of the vehicle turned out to be the entire Digital Underground crew, including the instantly recognizable Shock G (aka Humpty Hump)! Instead of being murdered, they all perform a song (unfortunately not their one major hit, the far superior \"Humpty Hump\"). You can even see the late-great Tupac Shakur as one of the members of Digital Underground, before he started his solo career. I would recommend this film to anyone just for this surreal moment, but if you have no idea who Tupac or Digital Underground are then you probably won't enjoy it as much. After a few fake endings and the actual goofy cartoon ending, the movie is over. All in all, it doesn't have that many laughs, and it's definitely not scary, but it is rarely boring. The Digital Underground cameo is excellent and the cast plays their roles well. This is certainly not the best movie I've seen, but I would rank it better than any bad comedy and most bad horror movies. In fact, I'd say this film is just a few buckets of blood and a few crazy gross-out scenes away from a cult classic.",
         "A movie you can watch when you want lots of interesting characters, scenery, and complete nonsense everywhere you look. This movie was never intended to be an intellectual masterpiece...it was made to make people laugh, and to entertain. On many levels its very similar to movies like Scary movie, and the burbs...which have decent ratings. I just don't understand the average person these days, and what they seem to like about anything. Movies like traffic get 10's, and movies like this get 3.5's...traffic was a total bore fest, and this movie kept me entertained. Before everyone starts thinking \"this guy is out to lunch\" Keep in mind that one of my favorite movies of all time is Brazil..a movie which got amazing reviews, and in my opinion is equally as unsettling.",
         "This film is bound to become a cult legend, and shows Dan Aykroyd at his finest. I highly recommend it to anyone who finds humor in the absurd. The film, though bizarre, reflects society in an uncanny way. Somehow, the characters portrayed in the movie seem strangely familiar, and this can even be unsettling (where have I seen them before?). A lot of work went into this film, and it should, IMHO, be taken very seriously as comic art of the highest form. I gave it this film a 9 out of 10!",
         "Hi there, Monstermaster13 here with a review. This review is for Nothing But Trouble - and underrated gem of a movie that came out into the early 90's. Apparently loosely based on a true story, the movie stars Dan Akyroyd (it's also directed by him as well), Chevy Chase, Demi Moore and the always great and (it pains me to say this) late John Candy. Chevy Chase and Demi Moore play a couple who end up in the town of Valkanvania after having a run in with the police, and the end up at the judge's house where they meet the crazy J.P Valkanheiser and Bobo and Lil Debul as well as the police cop's sister Eldona (also played by John Candy). The judges house is filled with all sorts of kooky mechanical devices, and all sorts of hijinks insue in this. A lot of critics tend to bash this one on the grounds of it's plot, but it's supposed to be weird because it's a black comedy and it doesn't have to make sense for you to enjoy it. I heavily recommend watching this movie.",
         "Simply the worst, most awful movie I've ever seen. Didn't laugh once, don't know why it was made. I almost threw it back at my friend when I returned it to him. He thought it was the best movie ever. Don't know why he's still a friend.... The last scene with Chevy Chase on the couch gave me chills, I actually felt embarrassed for him. How could so many talented people make something so talentless? The make-up is horrible. There are NO jokes in the movie. How can a comedy have no jokes? If there was a refund counter to get that 90 minutes of my life back, I would demand it and ask for interest. I'd rather hang by my feet over hot lava before I'd spend another second minutes watching this.",
         "This film is a comedy, what do you expect?? It supposed to be stupid and silly, that's the point. I can't believe anyone take this picture so seriously. This is a funny movie, maybe not the funniest film ever. It still a pretty funny movie. Relax and turn off your brain, you'll enjoy this movie. I give this film 6.5 out of 10",
         "This is one of the worst pieces of film I have EVER in my life watched, and I have sat through lots of hours of film. I will even give Eraserhead credit as an art film, because of the definition that true art will trigger some visceral reaction in the viewer, be it disgust, admiration, love, laughter . . . in the case of Eraserhead it was total disgust. In the case of Nothing But Trouble . . . I vote for the Nothing. It is truly hard to believe that such a great talented cast could still not rescue such an abominable piece of film. So much wasted talent and money, and all those cumulative life-hours of all those viewers. If you feel you must see this, this belongs at the very bottom of your Netflex queue, when there is absolutely nothing else left to watch--your time is worth way more than this."
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Horror"
      ],
      "productionCompanies": [
         "Applied Action",
         "Warner Bros."
      ],
      "summaries": [
         "A financier [Chevy Chase] meets a spurned lover [Demi Moore] and agrees to take her to a business meeting. On the way there, they run a stop sign in a tiny town in the middle of nowhere. They are arrested and taken to the local court. But all is not as it seems: the courthouse and the \"prison\" are a maze of zany booby- traps and deadly contraptions. The antics of the captured couple as they try to escape from the mad judge and his bizarre family make up the rest of this unusual film.",
         "A businessman finds he and his friends the prisoners of a sadistic judge and his equally odd family in the backwoods of a bizarre mansion."
      ],
      "budget": 40000000
   },
   "movielensId": 2265,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-02-14",
      "dvdReleaseDate": "1998-11-10",
      "directors": ["Dan Aykroyd"],
      "runtime": 94,
      "movieId": 2265,
      "title": "Nothing but Trouble",
      "mpaa": "PG-13",
      "actors": [
         "Chevy Chase",
         "Dan Aykroyd",
         "John Candy",
         "Demi Moore",
         "Daniel Baldwin",
         "Taylor Negron",
         "Raymond J. Barry",
         "Tupac Amaru Shakur",
         "Bertila Damas",
         "Brian Doyle-Murray",
         "Valri Bromfield"
      ],
      "imdbMovieId": "0102558",
      "originalTitle": "Nothing but Trouble",
      "genres": [
         "Comedy",
         "Adventure"
      ],
      "youtubeTrailerIds": ["5uOBF6r040U"],
      "plotSummary": "While attempting to seduce gorgeous lawyer Diane Lightson, wealthy gadabout Chris Thorne agrees to drive her to Atlantic City, N.J. But, when some reckless driving draws the attention of a deeply critical cop, they and the flamboyant \"Brazillionaires\" who tagged along end up in the court of a grotesque and vengeful judge, who has a special vendetta against the wealthy and erudite.",
      "tmdbMovieId": 11933,
      "avgRating": 2.0777,
      "releaseYear": "1991",
      "numRatings": 740,
      "posterPath": "/6gWVNDugHkBlSQSsoe6OmbaFasE.jpg"
   }
}