{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dysfunctional family",
            "id": 10041
         },
         {
            "name": "cancer",
            "id": 10163
         },
         {
            "name": "death of parent",
            "id": 163599
         }
      ],
      "imdb_id": "tt0120776",
      "video": false,
      "title": "One True Thing",
      "recommendations": [
         18408,
         177851,
         61280,
         168128,
         34935,
         50035,
         33430,
         46992,
         121890,
         82520,
         266425,
         181756,
         84884,
         199291,
         14585,
         77469,
         46278,
         50071,
         31416,
         30964
      ],
      "backdrop_path": "/hadGo8RD1cDzrjtWXIdUfukU3hW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kate Gulden",
               "gender": 1,
               "credit_id": "52fe4853c3a36847f8161c07",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ellen Gulden",
               "gender": 1,
               "credit_id": "52fe4853c3a36847f8161c0b",
               "name": "Renée Zellweger",
               "profile_path": "/aeUnfem148WrhpQcmiUuSRGhCYU.jpg",
               "id": 9137,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "George Gulden",
               "gender": 2,
               "credit_id": "52fe4853c3a36847f8161c0f",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Brian Gulden",
               "gender": 2,
               "credit_id": "52fe4853c3a36847f8161c13",
               "name": "Tom Everett Scott",
               "profile_path": "/5f85Hirx8TYIvb9irRtBSrqsq11.jpg",
               "id": 16857,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Jules",
               "gender": 1,
               "credit_id": "52fe4853c3a36847f8161c17",
               "name": "Lauren Graham",
               "profile_path": "/fnNv7OCvO7ySSh1Bf5xNAn5mXGC.jpg",
               "id": 16858,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "College Student",
               "gender": 1,
               "credit_id": "58882636c3a368413b001be9",
               "name": "Julianne Nicholson",
               "profile_path": "/iXjSXsYpb8GAehnLPKX74eXZE6H.jpg",
               "id": 86034,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Brian",
               "gender": 0,
               "credit_id": "58e790f89251412810051cc2",
               "name": "Jeffrey Scaperrotta",
               "profile_path": "/dPWeEZSDJ7CdZvVcozOFCZrb7wm.jpg",
               "id": 1041923,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Marcia",
               "gender": 1,
               "credit_id": "5a02f461c3a36863a2015735",
               "name": "Marcia Jean Kurtz",
               "profile_path": "/lzmW0hnVyyRUkU0tjtFvlfViG9K.jpg",
               "id": 14548,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Jordan Belzer",
               "gender": 2,
               "credit_id": "5a20b1b7c3a3680b8a0984da",
               "name": "Nicky Katt",
               "profile_path": "/dbAeUQXzyf2HDFYtifWkHfE3SNW.jpg",
               "id": 18070,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4853c3a36847f8161c1d",
            "name": "Carl Franklin",
            "profile_path": "/6jQitXVCxmsBYtBURZhTw2NaUg9.jpg",
            "id": 21712,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.796294,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53113,
      "vote_count": 31,
      "budget": 0,
      "overview": "A career woman reassesses her parents' lives after she is forced to care for her cancer-stricken mother.",
      "similar": [
         40807,
         9428,
         258230,
         308369,
         238615,
         824,
         1587,
         1246,
         46705,
         222935,
         10229,
         587,
         4538,
         340666,
         242224,
         300668,
         334541,
         399057,
         277216,
         35
      ],
      "original_title": "One True Thing",
      "runtime": 127,
      "poster_path": "/6pW6exNLIhh8Y8iGStDGFpE3L7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1998-09-18",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Love What You Have.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Carl Franklin"],
      "runtime": 127,
      "synopsis": "A very true movie. So true I could not watch it until now. From someone who has been there, seen it, lived through it, I can say it was written by someone who was there as well. The story is of a young woman, Ellen (Renee Zellweger) who comes home for the weekend from her busy life in the city and with a possible writing career in front of her to find out from her father (William Hurt) that her mother, Kate (Meryl Streep) is ill. She is about to have cancer surgery and he expects that she will drop her life and come home to take care of her mother. She will need help after the surgery and the following chemotherapy. Ellen does not know what to think. She is a writer, as her father, an english professor, does he not understand what her life and future career mean to her? She has never seen self sacrifice before, or so she thinks. As her mother grows ever weaker Ellen gets a glimpse into her mother's life. She is involved with the community on special ocassions, she refinishes furniture, makes curtains, cooks everything wonderful, and even comforts friends in times of challenge, but most important of all, she makes her husband's life possible. At first Ellen tries to step into her mother's shoes and has a tough time for she is more like her father, she writes, she doesn't cook, clean, and comfort. Soon she finds her mother's shoes are a lot harder to fill than she ever realized. As she gets better at caring for her mother and the home front she realizes just how little her father does at home. Many of us see what many probably don't see, he is not completely self-scentered he simply can't imagine his life without her and can not be around to watch her fade. Ellen does not know this, at one point she believes he is having an affair and becomes very angry with him. She believes all he can do is think about himself. At Thanksgiving her father surprises everyone by bringing home two writers he admires, seemingly oblivious to the fact that this might well be his family's last Thanksgiving together. He asks that his wife whip up some great appetizers, as though she were in any shape to do so, which leaves Ellen to make them. Ellen is enraged with the unexpected visitors, famous or not, she wanted a quiet family Thanksgiving. Ellen becomes confrontational at every turn with her father. He wants everything to remain the same, he's not willing to help out with anything, and to top it all off, she believes when he calls to say he is working late that he is with \"the other woman\" who drops him off in front of the house later that evening. Ellen finally has a bitter confrontation with her father in a diner that ends up with him walking away stating that she will no longer be needed she can return to the city. Before this can even be discussed her mother is hospitalized. They are told the cancer has spread and there no need to continue therapy, all they can do now is make her comfortable. Her mother has noticed what is happening with Ellen and her father and calls her into a room to talk. She looks Ellen in the face and tells her that she does not know anything about her husband that she doesn't know. Life and marriage changes as it moves along and you find yourself accepting things you told yourself you'd never do. That it can be unbearable at one point and joyous the next. That you reach a point where if you remove someone from your life all it does is leave is a great big hole in your life, you live for your family, the ones you love. She then tries to tell Ellen things she might need for later in life and Ellen does not want to hear them. Her mother begins to cry and tells her that she's tired of people not letting her talk when she wants to talk, when Ellen agrees, she thinks a minute then says, I said it already. Ellen is charged with caring for her mother and giving her pains pills, morphine, now that the pain is much worse. Even though Ellen knows she's dying, and that she is in a wheel chair, and that a nurse comes in to help her, all these facts are really made quite clear when her mother calls out for the nurse who is not there and Ellen enters the bathroom to find her mother in the tub unable to get out. For the first time she is not seeing her bulky sweaters and cap; she sees her mother with her half bald head and barely covered bones. She is so skinny that Ellen can easily lift her from the tub. At that moment Ellen realizes exactly what is happening; to know something is one thing, to see it is almost too real. After she gets her mother settled into her chair she asks Ellen for a pain pill, as she takes it she whimpers, \"This is no way to live\" in her weakened voice that tells volumes. She asks Ellen to help her make it stop, Ellen's mother is now staying down stairs in a hospital bed. When she sleeps you hear her struggling to breathe, eating is no more, drinking is barely so, and talking is barely so. Then we see Ellen take out the small dish we all have for our cancer victims to put a little bit of applesauce to try in vein to get them to eat anything, and to help get medications down. Then she takes out the morphine and begins to smash the pills, first one, then another, then another. Then stands there knowing she can't do this. As much as she knows it would be a kindness, as much as she knows it would make it easier for her mother she can not do it. Her father comes home early, Ellen takes a bath and when she comes down we see her father wash out a small dish, wipe it and put it back in the cupboard. He tells Ellen, \"your mother says this is not living, and she was right.\" Ellen goes into to be with her mother and finds awake and she tells her, \"I love you.\" In the morning Ellen's father comes downstairs to find Ellen holding her mother's hand and staring, he realizes she is gone. Throughout the movie we have seen Ellen telling a man the story of her mother's illness but we don't know who he is, a greif counselor? A priest? It is a man wanting to know how Ellen's mother died of an overdose. Ellen has been providing stories that make it impossible for her father to be responsible, while not implicating herself either. In the last scene Ellen is at her mother's grave planting bulbs in the freshingly dug up soil. Her father approaches her and watches what she is doing and asks her how it went. She tells him it went fine that the man will also want to speak to him as well. Her father then says he admires Ellen's strength, he wanted to do it but could not. Ellen hears him but it doesn't sink in right away. She finally lifts her head and says, \"I didn't do it, I thought you did it.\" They both take a moment and then shake their heads while stating, \"oh, she couldn't have, she was too weak!\" Ellen's father then shares how much he loved her, that she made his world warm and comfortable, she was his One True Thing. As the movie concludes her father attempts to help plant the bulbs and they work the soil together.",
      "writers": [
         "Anna Quindlen",
         "Karen Croner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120776/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI0MzY2MjQ1MF5BMl5BanBnXkFtZTcwNjg5MjMyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Meryl Streep, Renée Zellweger, William Hurt | See full cast and crew »"],
      "reviews": [
         "The reason I think this movie is fabulous is that it has so many layers of emotion. From the script and the fabulous acting you can tell that there is a history behind all of the feelings that there are. You understand why the characters take certain actions and why the do not make others. You can feel sympathy and joy and love and sorrow for them all at once. You see humanity at its best AND at it's worst. You can relate to the characters because although you may have never been in their exact situations before you see qualities and downfalls in them that you see in yourself. To a certain extent this movie kind of keeps you wondering but then at the end it explains itself and you feel a certain peace and understanding not only in you but for the characters. I will say that I have have never EVER cried so much in my life nor have gotten so much out of something. I implore you to watch this movie and take it's meaning to heart. That there is only one true thing and that is... love.",
         "What impressed me the most about \"One True Thing\" was how up-front it was when the daughter mentions her mother's cancer at the beginning of the movie. As depressing the subject matter was, it was a refreshing change of pace instead of being blindsided with the revelation about a character's fatal illness 2/3 into the movie (\"Love Story\" \"Terms of Endearment\", etc.). Meryl Streep, Renee Zellweger and William Hurt give very strong performances that don't go over the edge. The characters they play seem human; they're not perfect people. (Arguably, one might not say that about the \"Martha Stewart\"-type character Streep plays but throughout the film, I found her character to be noble in a non-sappy way. She's dealing with her plight the best way she knows how.) \"One True Thing\" is an observant, unsentimental family drama in which the tears at the end were well-earned.",
         "This is one of my favourite films of all time, no doubt about it. Everything about it is superb. While it may appear to be a film which mainly appeals to women, I think that the men should give it a chance too - a substantial part of the storyline is from George Gulden's (William Hurt) point of view, as the father of the family. Through 'One True Thing', we see how a family copes with disease - from everybody's point of view. Although we follow the story from Ellen Gulden's (Renee Zellweger) eyes, it never feels like we're missing out on anything. The strongest point of the film is the superb acting. Hurt and Zellweger give very strong, convincing performances, and the supporting cast are also very good; however, it's Meryl Streep who stands out here. I truly believe this to be not only one of her best performances to date, but one of the best ever. Her work in this film is absolutely astounding. She's everything and anything the film could require from her - and then so much more. What she brings to this role is truly magical; the woman is a genius. How she could have missed out on the Oscar that year, I have absolutely no idea. There isn't much more to say, except for SEE THIS FILM. It is all at once extremely insightful, moving, humorous and beautiful. You won't regret watching this one.",
         "One True Thing rises above its potentially schlocky material to give us a view of a family of complex relationships and flawed, real people. It opens with Rene Zeleweger discussing her mother's death with the District Attorney; sparing us the cheap cinematic shots of a \"shocking\" illness and death. From there it proceeds into a look at a family system, in which everyone plays by a set of unexamined rules, and uses the mother's cancer to show what happens when all the rules change. William Hurt as the self-important father, and Meryl Streep as the Suzy Homemaker mother are both superb; nuanced and not what they appear to be. Zeleweger is seething, angry and surprised with herself. Tom Everett Scott doesn't have much to do, but he does it well. The story is predictable, and takes at least one badly soppy turn it needn't have taken, but the performances, and the view of family as a place where anger and love are equally mixed, make it worthwhile.",
         "I enjoyed this movie as much as you can, given the subject matter. Streep is completely amazing, Renee has some great moments, and Hurt does his usual preppy jerk routine. Several scenes will make you cry, but this is not the usual fatal-disease-in-the-family fare that you might expect it to be, thanks to Carl Franklin, who keeps the story fresh when stereotypes and cliches prevail.",
         "As William Hurt also said in The Accidental Tourist, \"Less..is invariably more\". I guess many of us do live in denial, trying to slip through life as if certain things weren't happening. It is true that rude awakenings sometimes are the only ways for some of us to open our eyes and smell the coffee. William Hurt executed the egotistic father's role like no one ever has before. He is gifted at portraying the role of the \"blind\" husband. I guess if Kathleen Turner had played the wife's part in this movie he would have had a much harder time. I believe the three of them (Hurt, Streep and Zellweger) portrayed a real family story, something far from the typical Hollywood drama. They were able to show the strong and weak sides of being human and bearing family responsibilities. Very beautiful movie, very descriptive with several not-so-long scenes. Indeed, sometimes less..is invariably more.",
         "One True Thing is an beautifully made film with an established cast. Renee Zellweger plays the journalist daughter of Meryl Streep and William Hurt, who also put in excellent performances. Zellweger shines in the emotional movie as she discovers her childhood memories of her parents are not what she thinks they are. Lauren Graham from Gilmore Girls also has a part in this movie as Ellen's (Zellweger) friend Jules, although this is a bit part, she truly adds to the storyline. A moving and beautiful story, I recommend it. 8/10 Stars",
         "The DVD jacket in which this movie came describes it as \"uplifting and humorous.\" Those are not the words I would have chosen - not by a long shot. I would choose a word like \"sombre,\" sometimes even \"depressing.\" Which isn't to say that it's a bad movie. It's actually a pretty good movie, featuring good performances from the leads, with enough uncertainty throughout about what's going to happen at the end that you keep watching. The uncertainty comes from the structure of the movie - it seems to revolve around Ellen's reminiscences of her mother's slow death from cancer, as she is interviewed by the DA. So, we know from the start that something suspicious happened at the end - the questions are \"what?\" and \"who?\" Renee Zellweger was very good as Ellen - the somewhat resentful daughter who has to give up her life and job in New York to return home to care for her sick mother. Ellen evolves through the movie - moreso than any other character - as she learns to deal with both the strengths and weaknesses of her parents. Her relationship with her father (William Hurt) is quite interesting. My initial impression was that they were quite close, but the warts in the relationship start to show after a while. Hurt was effective as the detached husband - detached not in an uncaring way, but in the sense of being unable to cope with what's happening to his wife, and seeking escape from it in various ways. Finally, Meryl Streep as the cancer-stricken Kate was very convincing in the role, seeking to live out what remains of her life in the most fulfilling way possible, then dealing with the anger she feels at her increasing debilitation. In a way, watching a family deal with this kind of crisis reminded me a little bit of \"Ordinary People,\" although this movie was far less emotionally intense. So, not \"uplifting and humorous\" (with all due respect to whoever wrote the synopsis on the DVD jacket) but very good in its own way. 7/10",
         "It's not surprising that the majority of higher-rated votes were submitted by females aged 45+. This is the timeframe in women's lives when they become the caretakers of aged and ill parents. I lost my mother, from complications of cancer, in June, and went through most of the same emotions portrayed by Zellweger in this film. Yes, it made me cry, but the tears were real, the characters were real, and the plot development extremely accurate. Kudos to the entire cast and crew for a wonderful portrayal of life and death, and the promises of tomorrow.",
         "Kate Gulden, played by one of the most nominated actresses of the last decade of this century, and also one of the most talented actresses Meryl Streep(Out of Africa). She is wonderful is every part that she plays. The Yale graduate is the pride and joy of the American Cinema. Kate's health is deteriorating and her husband, George, role well developed by brilliant actor and also Oscar winner, William Hurt (Smoke, Kiss of the Spider Woman) has a hard time with the deteriorating health of his one true thing, and seeks his daughter's help. The poor daughter, Ellen Gulden, Renée Zellweger (Jerry Maguire) has way too much expected of her. No breaks! The story takes a very realistic view on the illness of a parent. In this movie the only daughter has to put her life on hold to care for the needs of others. There is always one in every family who faces that kind of responsibility. Ellen is angry the beginning of the movie, but as time passes she ends up understanding her mothers' life time dedication to her family. She even asks her mom: How do you do his, every day, in and out and nobody notices it? That is what women do, a lot of what I call invisible work. Moreover we clean, we fix, we mend, we stretch, we celebrate, we are the best friends, we are confidants, the mistress, outreachers, disciplinarians, sensitive. Some of us, like both women in this movie, have the perfect education, are the psychological pillar for the entire family and also do all that invisible work! That is Kate Ellen, and many women in our society. Many of us have already gone through that stage of life when our parents age and died. I have been there. They just went too young. I have given my parents my thanks, but I never understood them as well as when I had to play their roles, and had to walk in their shoes. This movie mirrors the reality of life. Perhaps it is sad, but that is how life is, at times. George a Professor at Harvard is complicated person, who appears to think that his work is more important than everybody else, and has a very \"master/servant\" mentality toward the women in his life. He is not strong enough to cope. If you want to see good acting and the reality of life do not miss this movie. Favorite Scenes: The restaurant coming to Kate, violins and all. The making of a table out of broken china. That I so symbolic! We are all broken vessels! Favorite Quotes: George: \"It is only by going uphill, that you realize that you are really going downhill.\" George \"You have a Harvard education but where is your heart?\""
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Monarch Pictures",
         "Ufland",
         "Universal Pictures"
      ],
      "summaries": [
         "When a tough New Yorker's mother is stricken with a serious illness, she is forced to quit her job and her relationship with her boyfriend to take care of her, finding out a lot of things she didn't know about her mother and father and her life along the way.",
         "One True Thing is a family drama revolving around a dying mother's final months in the care of her daughter. Ellen Gulden's father rebukes her for not caring enough about her mother to quit her job, move back home to Upstate New York, and leave her soulmate behind to fend for himself in their tidy New York apartment. But, when she succumbs under the strain of guilt and does as he asks, it appears that he is too busy to carry his part of the load. In fact, it begins to look like Ellen's father is more concerned with who is going to keep his life running smoothly than who will tend to his poor wife as she struggles with cancer. George Gulden is a gifted professor and English department head, but he is an unrealized novelist. His novel, \"Come Back Inn,\" is still unfinished after many years of torturous self-editing and rewrites long after the advance he received from his publisher is spent. Still, he basks in the reflected glow of more famous and successful writers with whom he maintains tenuous ties. This realization humanizes him for Ellen who has always revered her father as something of a literary giant in spite of his occassional daliances with graduate students. Kate Gulden, dying of cancer at only 48, loves life, and loves her children and her husband. When her suffering finally ends from an overdose of morphine, the District Attorney suspects Ellen of having helped her mother to end her life. In the end, though, it seems to be Kate who still nurtures them, somehow even from the grave.",
         "A career woman reassesses her parents' lives after she is forced to care for her cancer-stricken mother."
      ],
      "budget": 30000000
   },
   "movielensId": 2272,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-18",
      "dvdReleaseDate": "1999-09-23",
      "directors": ["Carl Franklin"],
      "runtime": 127,
      "movieId": 2272,
      "title": "One True Thing",
      "mpaa": "R",
      "actors": [
         "Meryl Streep",
         "Renée Zellweger",
         "William Hurt",
         "Tom Everett Scott",
         "Lauren Graham",
         "Julianne Nicholson",
         "Jeffrey Scaperrotta",
         "Marcia Jean Kurtz",
         "Nicky Katt"
      ],
      "imdbMovieId": "0120776",
      "originalTitle": "One True Thing",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["lXJv1BQr1iI"],
      "plotSummary": "A career woman reassesses her parents' lives after she is forced to care for her cancer-stricken mother.",
      "tmdbMovieId": 53113,
      "avgRating": 3.47609,
      "releaseYear": "1998",
      "numRatings": 983,
      "posterPath": "/6pW6exNLIhh8Y8iGStDGFpE3L7.jpg"
   }
}