{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "asylum",
            "id": 2884
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "father",
            "id": 5905
         },
         {
            "name": "eccentric",
            "id": 10483
         },
         {
            "name": "tragedy",
            "id": 10614
         },
         {
            "name": "choice",
            "id": 11296
         },
         {
            "name": "insane",
            "id": 199551
         }
      ],
      "imdb_id": "tt0113658",
      "video": false,
      "title": "Lilian's Story",
      "recommendations": [],
      "backdrop_path": "/qsrm4ffo8NxyoPamzQhcuqHT7C2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lilian Singer",
               "gender": 1,
               "credit_id": "52fe4a7bc3a368484e155aff",
               "name": "Ruth Cracknell",
               "profile_path": null,
               "id": 221730,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "John Singer",
               "gender": 2,
               "credit_id": "52fe4a7bc3a368484e155b03",
               "name": "Barry Otto",
               "profile_path": "/v1bnBHE9RYdTNtFw3N2fHfh9du3.jpg",
               "id": 150536,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Young Lilian Singer",
               "gender": 1,
               "credit_id": "52fe4a7bc3a368484e155b07",
               "name": "Toni Collette",
               "profile_path": "/oMps1ZPH3dHmqZmrpZcRiyUBgA.jpg",
               "id": 3051,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe4a7bc3a368484e155b0b",
               "name": "John Flaus",
               "profile_path": null,
               "id": 77562,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Head Orderly",
               "gender": 0,
               "credit_id": "53309b17c3a3686a9d00000d",
               "name": "Jeff Truman",
               "profile_path": null,
               "id": 164588,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Esther",
               "gender": 0,
               "credit_id": "53309b2bc3a3686a9500000f",
               "name": "Lyle O'Hara",
               "profile_path": null,
               "id": 1304376,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "May",
               "gender": 0,
               "credit_id": "53309b3ac3a3686aaf000021",
               "name": "Kate Agnew",
               "profile_path": null,
               "id": 1304377,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ruby",
               "gender": 1,
               "credit_id": "53309b4ac3a3686aaf000026",
               "name": "Fiona Press",
               "profile_path": null,
               "id": 1003410,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Mother",
               "gender": 1,
               "credit_id": "5738c83b92514166d2000b51",
               "name": "Anne-Louise Lambert",
               "profile_path": "/u2Tqc3CGkmSWjMuF6vQX2pLQzm.jpg",
               "id": 67027,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a7bc3a368484e155afb",
               "name": "Jerzy Domaradzki",
               "profile_path": null,
               "id": 1075843,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53309b84c3a3686a8e000019",
               "name": "Lee Smith",
               "profile_path": null,
               "id": 205999,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "53309b93c3a3686aaf00002b",
               "name": "Christine King",
               "profile_path": null,
               "id": 12203,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "53309ba1c3a3686a86000021",
               "name": "Roger Ford",
               "profile_path": null,
               "id": 5547,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "53309bb0c3a3686a9500001e",
               "name": "Diann Wajon",
               "profile_path": null,
               "id": 1304381,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "53309bc4c3a3686aa500001b",
               "name": "Edie Kurzer",
               "profile_path": null,
               "id": 958160,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "53309bdbc3a3686a9d00001c",
               "name": "Steve Wright",
               "profile_path": null,
               "id": 1144400,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "53309becc3a3686a9d00001f",
               "name": "Kate Grenville",
               "profile_path": null,
               "id": 1304382,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "582670cdc3a368360b012694",
               "name": "Slawomir Idziak",
               "profile_path": "/vA9WrEK35MyUx6Sb4NtZiouotsg.jpg",
               "id": 1129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "582670d79251417b1d0115f0",
               "name": "Cezary Skubiszewski",
               "profile_path": null,
               "id": 75940,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.760488,
      "production_countries": [{
         "iso_3166_1": "AU",
         "name": "Australia"
      }],
      "id": 122289,
      "vote_count": 2,
      "budget": 0,
      "overview": "For forty years Lilian Singer has been locked up in a 'loony bin' by her father. Her release is eventually secured by her eccentric Aunt Kitty and her brother, John. Lilian starts to carve out a place for herself. As she explores Sydney and the people who live and work around her she sees others looking for love. Lilian shows us it is never too late to change your life and that even unusual choices can bring contentment.",
      "similar": [
         7972,
         49519,
         329103,
         10999,
         116711,
         8545,
         12429,
         205220,
         19724,
         11816,
         6963,
         10822,
         9427,
         10559,
         11076,
         25968,
         375012,
         408381,
         10779,
         8272
      ],
      "original_title": "Lilian's Story",
      "runtime": 94,
      "poster_path": "/7sl2VNfEPR2JnGhF0yZ1P4uT9de.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Movieco Australia",
         "id": 21144,
         "origin_country": ""
      }],
      "release_date": "1996-05-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Everything matters.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jerzy Domaradzki"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Steve Wright",
         "Kate Grenville"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113658/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMDYzNTY5OF5BMl5BanBnXkFtZTcwODYyNTgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ruth Cracknell, Barry Otto, Toni Collette | See full cast and crew »"],
      "reviews": [
         "This is a fictional account of the life of a famous Sydney street character, Bea Miles, in the middle of the last century who recited Shakespeare for the edification of passers by. This film may have disappointed those who enjoyed Kate Grenville's novel and feel the casting inappropriate, and for that reason I have reservations about watching The Beach or Captain Corelli's Mandolin where the main lead seems so unlikely. However, a film can still be enjoyed and have value for being an interpretation of an original idea, especially when such fine actors are involved. Ruth Cracknell is outstanding as the older Lilian and the rest of the cast is superb, with Toni Collette (Muriel's Wedding) increasing her dramatic range. Lilian's mother is perfectly portrayed by Anne Louise Lambert (Picnic at Hanging Rock) as a subdued beauty, reduced to timing ferries, with all the spirit of a bird of paradise crushed out of her by a monstrous husband. The mother is, unsurprisingly, unable to help her daughter, and offers the grossly inadequate reply of `its simple really, there are changes' in response to her daughter's concern about entering womanhood. Lilian and her brother are eventually deserted by their mother who entrusts their well being and sanity to the tender hands of the brute of a father. Barry Otto (Strictly Ballroom) portrays an educated father and husband of the cruelest kind who seems hell bent on repressing all spirit in those around him, offering the encouraging words to his daughter of `you're unstable Lilian' in response to her dreams of going to university and becoming a doctor or scientist. With this kind of care children either learn to respond in kind, or destroy themselves, perpetuating the misery for every one who comes into contact with them. Inevitably some unfavourable comparisons have been made with Shine as Lilian's Story was developed at the same time, however it tackles the difficult issues of physical and mental abuse from the feminine perspective and has important messages to impart. This film is certainly more harrowing than the 1970 English classic \u0091Spring and Port Wine' which also deals with a domineering father and husband. The story is told in flashbacks after Lilian is released from a mental institution after 40 years of incarceration by her father for being too wild. The power of human endeavour in overcoming adversity is demonstrated as Lilian finds a new life entertaining and helping people on the streets of Sydney, through the love for `her William'. The strengths of this film lie in its talented cast, its refreshing Australianism and decidedly un-Hollywood influenced approach. There are good characterisations and some nice symbolic touches such as the fridge weeping onto the kitchen floor as Lilian recalls her mother and the cruelty of her father. VHS copies can be obtained from ScreenSound Australia as I found difficulty in tracking this film down in the UK although it was distributed by Video Networks UK.",
         "The great Ruth Cracknell deserves better than this sorry, dispiriting mess. Based on a real \"street celebrity\" who recited Shakespeare on corners for a living, \"Lillian's Story\" has the structure of \"Hush, Hush, Sweet Charlotte\" or an old Hammer horror exploitation epic. Only it's given solemn art-film treatment and it pretends to be a serious examination of age, abuse, and mental illness. Lillian (Cracknell) was committed to an asylum for 40 years by her brute of a father (Barry Otto); she's sprung at the beginning of the film (why now?) by her squishy weakling of a brother (Otto again) and her aunt, and she moves into a seedy room in a red-light district, where she wanders the streets, disoriented and lonely, trying to make connections with the prostitutes and cab drivers, and flashing back to her horrific past (the younger Lillian is played by Toni Collette). The film is one of the worst-shot imaginable, with poor sound recording and ugly color (which shifts to a hideous decayed-lemon tone for the flashbacks). Even worse, each shot is so lingering and so weighted that the film end up as brutal to Cracknell and Collette as their hideous father was. We start to feel like voyeurs intruding on heavily-aestheticized horrors that don't make much sense. None of the guilty secrets revealed are terribly startling; they just feel lurid for luridness's sake, piled on in hopes of a Shocking, Overpowering Statement. The only respites are Cracknell's Shakespearean recitations; they point up the gap between Lillian's dreams and her sordid joke of a real life in a way the rest of the movie can't live up to.",
         "I don't agree with the other persons post, he/she is entitled to their opinion but i fell in love with this film. I adore Australian cinema and have always sort out the golden gems through the years since i was a teenager. This film came out at a time when i needed it! Lilian as the older woman portrayed struggles to cope with being out of hospital after a long period. Suffering from mental illness myself i identified with the feelings of isolation and depression portrayed. The flashbacks worked for me as i could connect with her as to why she may have ended up so scared and alone. I recommend this film if u want to see Toni Collettes earlier work and it is one of Ruth Cracknells final films and the haunting lines she utters still ring now! Not a masterpiece but a fine Australian production.",
         "Kate Grenville's novel Lilian's Story is an Australian masterpiece. The film had the potential to be brilliant, with the talents of Ruth Cracknell and Barry Otto, but instead of portraying the story of Lilian's life, an overly pretentious director turned a potential masterpiece into a vague montage-like kaleidoscope of confusing images that rendered the whole story incoherent. I was deeply disappointed, and refused to waste any more of my life watching this rubbish after it failed to deliver anything resembling the book (except one image, that of Lilian's mother timing the ferries)half an hour into the film. Incidentally, the character of Lillian is meant to be really plump as a child and later as a woman.......if the main character doesn't even resemble a novel's description, what chance does the film have? You might just as well cast Tori Spelling to play the Queen Mother...or even worse, Mick Jagger as Ned Kelly :)",
         "While I haven't read the novel (which by all accounts is quite good), there is little good to be said of this film. I'm not sure if it was the incoherent flash backs, or the real \"Aussie\" acting, that most had me reaching for the remote control. So, unless you are a big Ruth Cracknell fan and can stand the tedium this film has to offer, it is, unfortunately, best forgotten."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Movieco Australia"],
      "summaries": ["For forty years Lilian Singer has been locked up in a 'loony bin' by her father. Her release is eventually secured by her eccentric Aunt Kitty and her brother, John. Lilian starts to carve out a place for herself. As she explores Sydney and the people who live and work around her she sees others looking for love. Lilian shows us it is never too late to change your life and that even unusual choices can bring contentment."],
      "budget": 0
   },
   "movielensId": 2274,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-05-09",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Jerzy Domaradzki"],
      "runtime": 94,
      "movieId": 2274,
      "title": "Lilian's Story",
      "mpaa": "",
      "actors": [
         "Ruth Cracknell",
         "Barry Otto",
         "Toni Collette",
         "John Flaus",
         "Jeff Truman",
         "Lyle O'Hara",
         "Kate Agnew",
         "Fiona Press",
         "Anne-Louise Lambert"
      ],
      "imdbMovieId": "0113658",
      "originalTitle": "Lilian's Story",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "For forty years Lilian Singer has been locked up in a 'loony bin' by her father. Her release is eventually secured by her eccentric Aunt Kitty and her brother, John. Lilian starts to carve out a place for herself. As she explores Sydney and the people who live and work around her she sees others looking for love. Lilian shows us it is never too late to change your life and that even unusual choices can bring contentment.",
      "tmdbMovieId": 122289,
      "avgRating": 3.13889,
      "releaseYear": "1996",
      "numRatings": 18,
      "posterPath": "/7sl2VNfEPR2JnGhF0yZ1P4uT9de.jpg"
   }
}