{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "rock and roll",
            "id": 578
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "cult figure",
            "id": 11491
         },
         {
            "name": "las vegas",
            "id": 14570
         },
         {
            "name": "desert",
            "id": 18034
         },
         {
            "name": "samurai sword",
            "id": 18098
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "child",
            "id": 208349
         }
      ],
      "imdb_id": "tt0118736",
      "video": false,
      "title": "Six-String Samurai",
      "recommendations": [
         49455,
         85535,
         29860,
         249010,
         44440,
         73994,
         26841,
         28526,
         148905,
         62778,
         28156,
         77759,
         15313,
         78552,
         42279,
         64714,
         169644,
         15372,
         35453,
         52021
      ],
      "backdrop_path": "/e0pycnWXHO1lxeT5JMSa8TjhLMf.jpg",
      "revenue": 124494,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Buddy",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f269",
               "name": "Jeffrey Falcon",
               "profile_path": "/5fOTUQuo6Ur0H5ou5thKh8rdN71.jpg",
               "id": 103999,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Kid",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f26d",
               "name": "Justin McGuire",
               "profile_path": null,
               "id": 104000,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mother",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f271",
               "name": "Kim De Angelo",
               "profile_path": null,
               "id": 104001,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Death",
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02f275",
               "name": "Stephane Gauger",
               "profile_path": "/jYvfmJacitBIwFZj4uSJKz5uE5e.jpg",
               "id": 81192,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Psycho",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f279",
               "name": "Clifford Hugo",
               "profile_path": null,
               "id": 104002,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Red Elvis",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f27d",
               "name": "Oleg Bernov",
               "profile_path": null,
               "id": 104004,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Red Elvis",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f281",
               "name": "Igor Yuzov",
               "profile_path": null,
               "id": 104005,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Red Elvis",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f285",
               "name": "Zhenya Kolykhanov",
               "profile_path": null,
               "id": 104006,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mariachi",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f289",
               "name": "George L. Casillas",
               "profile_path": null,
               "id": 104007,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Red Elvis",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f28d",
               "name": "Avi Sills",
               "profile_path": null,
               "id": 104008,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Head Pin Pal",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f291",
               "name": "Monti Ellison",
               "profile_path": null,
               "id": 104009,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Pin Pal II",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f295",
               "name": "Kareem",
               "profile_path": null,
               "id": 104010,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Pin Pal III",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f299",
               "name": "Paul Szopa",
               "profile_path": null,
               "id": 104011,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Cantina owner",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f29d",
               "name": "Richard McGuire",
               "profile_path": null,
               "id": 104012,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Car Guy",
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2a1",
               "name": "Zuma Jay",
               "profile_path": null,
               "id": 104013,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2a7",
               "name": "Lance Mungia",
               "profile_path": null,
               "id": 116653,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2ad",
               "name": "Lance Mungia",
               "profile_path": null,
               "id": 116653,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2b3",
               "name": "Jeffrey Falcon",
               "profile_path": "/5fOTUQuo6Ur0H5ou5thKh8rdN71.jpg",
               "id": 103999,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2b9",
               "name": "Jeffrey Falcon",
               "profile_path": "/5fOTUQuo6Ur0H5ou5thKh8rdN71.jpg",
               "id": 103999,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2bf",
               "name": "Lance Mungia",
               "profile_path": null,
               "id": 116653,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a368484e02f2c5",
               "name": "Michael Burns",
               "profile_path": null,
               "id": 62511,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2cb",
               "name": "Kristian Bernier",
               "profile_path": null,
               "id": 21409,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2d1",
               "name": "James Frisa",
               "profile_path": null,
               "id": 116655,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a368484e02f2d7",
               "name": "Leanna Creel",
               "profile_path": null,
               "id": 62513,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.62308,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24746,
      "vote_count": 43,
      "budget": 2000000,
      "overview": "In a post-apocalyptic world where the Russians have taken over a nuked USA and Elvis is king of Lost Vegas, Buddy is a '50s rocker and wandering warrior rolled into one, too-cool package. Armed with his six-string in one hand and his sword in the other, Buddy is on his way to Vegas to succeed Elvis as King. Along the way, he saves an orphan who decides to tag along.",
      "similar": [
         8810,
         681,
         1701,
         10017,
         2142,
         298312,
         948,
         11564,
         21356,
         431,
         23483,
         562,
         59967,
         281957,
         9355,
         281,
         170,
         949,
         185,
         4638
      ],
      "original_title": "Six-String Samurai",
      "runtime": 91,
      "poster_path": "/8uTLYIaRBx1xZ1WXO5ksuAmqTW7.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "HSX Films",
         "id": 4714,
         "origin_country": ""
      }],
      "release_date": "1998-09-18",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Vegas Needs a New King.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Lance Mungia"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Jeffrey Falcon",
         "Lance Mungia"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118736/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTg4NjUyMjE5NV5BMl5BanBnXkFtZTgwMjc4MjMxMDE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jeffrey Falcon, Justin McGuire, Kim De Angelo | See full cast and crew »"],
      "reviews": [
         "...if you like rock-a-billie and love a campy adventure in a post-apocalyptic world were Elvis, the KING, has just died and there's a guitar-strumming race across the desert to Las Vegas to see who will be the next King crowned - you'll love this bizarre piece of comic book fiction brought to life. Our hero & his sidekick are chased across the desert by Death(a cross between Tom Petty & Slash) and his archer henchmen. Our Hero slashes his way through one unbelievable fight scene after another. Falcon is truly amazing. The fight choreography alone is reason enough to watch this peculiar piece of cinema. The climax is a duel between our Hero(Rock-n-Roll) and Death(Heavy Metal). Who becomes the King? Watch it & love it.",
         "This film can best be described as a post-apocalyptic spaghetti western samurai fantasy. Our hero is a taciturn Buddy Holly look-alike traveling with samurai sword and six string guitar as he treks across scenic Death Valley on his way to America's last outpost of civilization, Lost Vegas, where he expects to be coronated as the new King, Elvis having died without naming a successor. Accompanying him is a stereotypical post-apocalyptic bleating child snatched right out of \"Fistful of Dollars\". Buddy slices and dices his way through an evil bowling team, the Russian army, would-be usurpers to the throne, and anyone else who gets in his way. The music is good and it's wonderfully filmed, so have some fun and enjoy the ride.",
         "This movie is the best post-apocalyptic rock 'n roll samurai movie ever made! There are so many subtle references and spoofs to so-called 'new classics' - 'E.T.', 'Road Warrior', 'Baron Munchausen' - and manages to flow smoothly as well. The story is too clever. America is over-run and then largely abandoned by Russia 40 years ago. The last outpost of the American dream is Lost Vegas, where Elvis rules as king. Upon his death, a lone modern-day samurai warrior with a guitar (Falcon) heads for Vegas to beat out other wannabes to the vacant throne. He hacks, slices, punches, and kicks his way through every insane nuclear holocaust survivor who stands in his way, all the while with a feral orphan boy in tow. There is not a dull moment in 'Six-String Samurai', thanks to the off-the-wall script and Jeffrey Falcon's acting and fighting. I was very surprised to find out that he hasn't done anything else since. This movie was incredible for an otherwise unknown martial arts bit actor who also wrote the script and coordinated all the fighting. It would be cool if there was a sequel, or better yet, a prequel to 'Six-String'. I for one would love to see a movie about King Elvis in Lost Vegas. 9/10. Very highly recommended.",
         "Yes, this film does have it's faults. Most low budget films do. But the overall theme of this work is a multi-layered spoof of many genres. The Hong Kong fantasy samurai film, end-of-the-world pictures, rock and roll musicals, and the obsession with Las Vegas. I had the fortune to see this film at a multiplex in Las Vegas, and was not disappointed. Buddy is a bad-ass rock'n'roller with a katana hidden in his guitar with his sights set on being the next king of Las Vegas. \"The Kid\" is annoying and has a ear-splitting shriek (Why wouldn't he? No playmates, no cartoons, just empty land and not a Gymboree or video arcade in sight!), and the various bad guys (loved the evil bald bowlers) come in just about every shape and size. Elements of \"Wizard of Oz\", \"El Topo\", \"Mad Max\", Sam Peckenpah, and God knows how many Kung Fu/Samurai films are in this, seasoned with a handful of self-conscious humor. Living in the Las Vegas area, I'm familiar with most of the scenes featured (The bombed out gas station is the ghost town of Rhyolite, Nevada), so it was a kick seeing some of those places in a film. It isn't for everyone, and some will dislike it, mostly for it's campiness, but this is a film that doesn't take itself too seriously...and neither should you.",
         "This movie is a wonderful experience - the cinematography is stunning, the fights exquisite and the music perfect. One of the most enjoyable theatrical experiences of all time; I'd recommend it to anyone with an open mind about movies.",
         "When I saw this movie at in the rental section, I assumed it would be a rip-off of EL MARIACHI or DESPERADO. I rented it out of curiosity and found that I was mistaken. This film is quite original and a little bizarre, but it is definitely the kind of independent movie that is worth seeing. The budget is low, the costumes and special effects are sparse, and some of the sound is non-synchronous. But this is all made up for with a story and directorial style that lends itself to \"camp.\" The stylization of this movie is definitely what makes it worth seeing. It is kind of an over-the-top martial-arts, rock and roll, post-apocolyptic odessy-adventure. I enjoyed the flow of the story, which breaks down like this: The hero is traveling across the desert to the post-apocolyptic city of Lost Vegas, to vai for his right as king. Along the way he is tested by other would-be-kings with the same goal in mind. This allows for constant samurai style action/fight scenes. But the story is compounded by the jugernaught he must inevitably face, which is manifested by his ultimate competition, a \"Death Metal Band\" lead by Death himself. The story is smart, allowing each fight scene to develop the characters. We see Buddy, the hero, to be a supreme, loan-wolf type fighter. And Death, stalking close behind, is ruthless and hard to beat. This sets the stage for their eventual conflict. The first conflict they have is ended permaturely by outside influence, which furthers the story by creating a score to settle in the final fight scene. I prefer when movies take the time to set up this kind of conflict. Rather than just throwing a good guy up against a bad guy and having one big fight scene, we get learn about the characters and the story. Business is left un-finished, which allows the audience to anticipate the climax. This adds suspense to the story and draws the audience in to the movie. The movie has a very good Second Act, which throws the main characters in to great peril, with the bad guy's having all the advantages. This is then resolved with a great third act, finding clever resolution. Very good story telling. The movie is totally over the top and wierd, but the story is fairly concise and exciting. The circumstances are totally bizarre, but the director creates a world that is enigmatic and yet consistent. I would say this movie is kind of a \"Mad Max in Wonderland.\" It is not your standard Hollywood tale, which, of course, made me like it even more. Not to mention, the entire movie is action packed. I highly recommend this movie to anyone seeking an original action movie, but on a critical level, just to be fair, I will list the few problems that I found: I think the fight scenes could have used a little more choreographing. It looked like budget constraints were limiting the number of takes they could do, and they were making up for actual precision work with simple slow motion and tricky camera angles. Falcon appears to be fairly well trained in Wu Shu, the standardized style of Chinese Kung Fu, but he is no Jet Li...nor Zhuang Hui, for that matter. It looked like he could use just a little more practice (I don't think he nailed that Butterfly Flat Spin in the sand dunes fight scene with the Death Archers). However, he is good enough to be quite convincing, and he was genuinely a lot of fun to watch. The fight scenes still managed to be quite exciting, and again, I highly recomend this movie. Especially, to anyone looking for a good independent movie. In my opinion, there really are not that many independent action movies that are worth seeing. The TROMA team tries to make action movies, and they pretty much all stink. Don't think that SIX-STRING SAMURAI is another MR. KABUKI MAN NYPD. Buddy would kick the crap out of Mr. Kabukki Man! I rated this film a 7 out of 10 on the IMDB. Go rent it and let your mind get a little bent. Its really pretty clever.",
         "First, the bad stuff. The film will not appeal to people who can't deal with camp, with pure Lynch-like strangeness, or people who demand a big budget production. However, those who are willing to give an oddball film a chance will find this to be a real gem of an indie flick. Imagine if you will Buddy Holly, Mad Max, and Jet Li bundled into one character, fighting across a desolate warped postapocalyptic Nevada. The dynamics in the movie are all about conflict... Rock & Roll against Metal, Communism against Capitalism, bravery versus despair. Mix that in with \"Weird West\" touches, demented nuclear families, and warriors who duel with both blade and guitar. There is even a hint of the manga, \"Lone Wolf and Cub\" thrown in. That and some excellent Russian-influenced rockabilly. Some of the scenes fall flat, sure... but few movies try to reach for such imaginative and demented heights... and few succeed to this extend on a shoestring budget. Despite its shortcomings, the action sequences are exciting and well-done, and one really sees an American Apocalypse which never was -- but in some ways happened, in our heads, at least.",
         "A personal favorite, Six String Samurai is an independent film melding and twisting so many genres that I'm convinced this film is truly one of a kind. We'll never see its like again and that, quite frankly, is a shame. Jeffrey Falcon comes across as the epitome of cool as the katana wielding wannabe king of rock n' roll. His quest to Vegas brings him in contrast with a variety of oddballs left confused in the atomic dust of the apocalyptic United States. From the Pin Pals and the cannibalistic Leave It To Beaver family to the remnants of the Soviet Army; Buddy meets all types. Six String Samurai should appease anyone with an interest in Road Warrior styled apocalypse films. At most times the film tongue in cheek and filled with humor. Still the action scenes show Jeffrey Falcon knows his way around martial arts and how to swing a katana. Take the tour across the rock n' roll wasteland and give SSS a view.",
         "This is a good movie. With the title and description, I expected an all out camp movie that would be fun and humorous, but this film has a lot of spirit. It's unique it's assimilation of several genres, for one. It also manages to create what has been destroyed in recent history of the martial arts film genre, where the protagonist is tragically heroic, and flawed. This is not typical hollywood fare, nor does it cross that line into a pure comic camp romp. The action scenes are excellent. The main characters are multidimensional, despite what little dialogue (and what great dialouge it has) they have. The film is well photographed, going far beyond what currently is offered in theatres. The film also has a lot of heart. It never compromises its integrity for trying to make a popcorn movie. It's so fun fillled and free spirited, which is rare in movies today. Plus, any movie with buddy holly moving with the grace of bruce lee is nothing short of unique. This one's a winner.",
         "** HERE BE SPOILERS ** Recap: There has been a nuclear war. America is reduced to a wasteland with mutants, freaks and cavemen roaming free. There is just one place were civilization thrives, Lost Vegas. And the king of Lost Vegas, Elvis, has just died. Now, every guitar playing weapon wielding musician with any self respect is making a journey to Vegas to claim the throne. Buddy is one, Death is another. Buddy is a legendary musician that has somewhat of a drinking problem, and his journey becomes so much harder when he rescues a little boy from gum throwing cavemen. The kid tags along and a odd bond develops between the two. Death and his arrow shooting band members is out to kill every opponent, and soon Buddy is the only one left... Comment: This is a very odd and peculiar movie, that at a first glance has a really poor story and acting. Costumes and scenery are not that great either, except for Death's and Buddy's. But as the movie goes along I discovered that the quality of camera movement and editing was high and that the story actually was full of references not present in a poor written story. So there is one conclusion to draw, this is a low budget b-movie that tries to be just that and nothing else. And it succeeds brilliantly. The story and acting, still peculiar, is actually entertaining and Buddy is a great character. The kid is annoying sometimes, unfortunately, but I thought that it got better as the movie went along. In the end I was very happy I had rented and seen this movie... 7/10"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Music",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "HSX Films",
         "Overseas FilmGroup",
         "Palm Pictures"
      ],
      "summaries": [
         "A mysterious and powerful hero of the classic kind, Buddy is as skilled with his guitar as he is with his samurai sword. Thrown together with a kid whom he saves in a spectacular battle, the two of them must now escape their enemies and reach \"Lost Vegas,\" the rock 'n' roll capital of this future world.",
         "In a post-apocalyptic world where the Russians have taken over a nuked USA and Elvis is king of Lost Vegas, \"Six-String Samurai\" chronicles the tale of Buddy, a hero who's a '50s rocker and wandering warrior rolled into one, too-cool package. Armed with his six-string in one hand and his sword in the other, Buddy is on his way to Vegas to succeed Elvis as King. Along the way, he saves an orphan who decides to play tag-along to his rescuer. What follows is the road trip from hell.",
         "In the post-apocalyptic world of 1960s Nevada, a rock 'n' roll samurai takes a young boy under his protection."
      ],
      "budget": 2000000
   },
   "movielensId": 2275,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-18",
      "dvdReleaseDate": "2003-08-26",
      "directors": ["Lance Mungia"],
      "runtime": 91,
      "movieId": 2275,
      "title": "Six-String Samurai",
      "mpaa": "PG-13",
      "actors": [
         "Jeffrey Falcon",
         "Justin McGuire",
         "Kim De Angelo",
         "Stephane Gauger",
         "Clifford Hugo",
         "Oleg Bernov",
         "Igor Yuzov",
         "Zhenya Kolykhanov",
         "George L. Casillas",
         "Avi Sills",
         "Monti Ellison",
         "Kareem",
         "Paul Szopa",
         "Richard McGuire",
         "Zuma Jay"
      ],
      "imdbMovieId": "0118736",
      "originalTitle": "Six-String Samurai",
      "genres": [
         "Action",
         "Adventure",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["pfTWYP4bE28"],
      "plotSummary": "In a post-apocalyptic world where the Russians have taken over a nuked USA and Elvis is king of Lost Vegas, Buddy is a '50s rocker and wandering warrior rolled into one, too-cool package. Armed with his six-string in one hand and his sword in the other, Buddy is on his way to Vegas to succeed Elvis as King. Along the way, he saves an orphan who decides to tag along.",
      "tmdbMovieId": 24746,
      "avgRating": 3.4055,
      "releaseYear": "1998",
      "numRatings": 746,
      "posterPath": "/8uTLYIaRBx1xZ1WXO5ksuAmqTW7.jpg"
   }
}