{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "author",
            "id": 10818
         },
         {
            "name": "adopted son",
            "id": 209051
         }
      ],
      "imdb_id": "tt0120835",
      "video": false,
      "title": "A Soldier's Daughter Never Cries",
      "recommendations": [
         139571,
         50700
      ],
      "backdrop_path": null,
      "revenue": 1782005,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Bill Willis",
               "gender": 2,
               "credit_id": "52fe4887c3a368484e0fd801",
               "name": "Kris Kristofferson",
               "profile_path": "/hiGkNoiAwnUgY9XZ3YhiWMvKngi.jpg",
               "id": 10823,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Charlotte Anne 'Channe' Willis, Age 14",
               "gender": 1,
               "credit_id": "52fe4887c3a368484e0fd805",
               "name": "Leelee Sobieski",
               "profile_path": "/fAJ4H6Hi0SZPt6I82TfnfCl9i43.jpg",
               "id": 22290,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Mrs. Fortescue",
               "gender": 1,
               "credit_id": "52fe4887c3a368484e0fd809",
               "name": "Jane Birkin",
               "profile_path": "/e62bIWn1XolFTD5uZ47e3XH8xXK.jpg",
               "id": 15200,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Marcella Willis",
               "gender": 1,
               "credit_id": "52fe4887c3a368484e0fd80d",
               "name": "Barbara Hershey",
               "profile_path": "/gaimK3QeNS32Wjryw03QC0PXWKO.jpg",
               "id": 10767,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Candida",
               "gender": 1,
               "credit_id": "52fe4887c3a368484e0fd811",
               "name": "Dominique Blanc",
               "profile_path": "/l52O3muXMMlUQMgY27o8vgUmTcq.jpg",
               "id": 19068,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Billy's Mother",
               "gender": 1,
               "credit_id": "52fe4887c3a368484e0fd815",
               "name": "Virginie Ledoyen",
               "profile_path": "/t9TdJUerLsUD766Q2dN9tJ4dRCG.jpg",
               "id": 19163,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Billy Willis, Age 14",
               "gender": 2,
               "credit_id": "52fe4887c3a368484e0fd819",
               "name": "Jesse Bradford",
               "profile_path": "/irD0iVNTmR0kEkVTZmKTuZejbGH.jpg",
               "id": 17772,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Mamadou (as Isaac De Bankole)",
               "gender": 2,
               "credit_id": "53565fd2c3a36841fe0023e2",
               "name": "Isaach De Bankolé",
               "profile_path": "/pr2AoaFlgQfdbIIv88UhCyp8wuF.jpg",
               "id": 4812,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Keith Carter",
               "gender": 2,
               "credit_id": "5993b5ef925141542b00aea7",
               "name": "Harley Cross",
               "profile_path": "/ho11xBDWXeJP6ub4b4e7XmYx9dL.jpg",
               "id": 35547,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Madame Beauvier",
               "gender": 1,
               "credit_id": "5993b60d925141542300a3d3",
               "name": "Macha Méril",
               "profile_path": "/iwjgrJtcwwJaIKzIrRB7GUMPHZ5.jpg",
               "id": 9766,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Madame Fournier",
               "gender": 1,
               "credit_id": "5993b61bc3a3687eff00a25c",
               "name": "Nathalie Richard",
               "profile_path": "/xIPFn1tutGeW3Q4900o5IWRfCip.jpg",
               "id": 6019,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Francis Fortescue",
               "gender": 0,
               "credit_id": "5993b629925141543300ab3c",
               "name": "Anthony Roth Costanzo",
               "profile_path": null,
               "id": 1019876,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Bob Smith",
               "gender": 2,
               "credit_id": "5993b63ac3a3687eef00a412",
               "name": "Bob Swaim",
               "profile_path": "/cdzvdWCqcWRqGfa9PI4RtmB1TRF.jpg",
               "id": 129692,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Young Charlotte Anne 'Channe' Willis, Age 7",
               "gender": 0,
               "credit_id": "5993b64fc3a3687ec400b7af",
               "name": "Luisa Conlon",
               "profile_path": null,
               "id": 1308011,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Benoit / Young Billy Willis, Age 7",
               "gender": 0,
               "credit_id": "5993b65d925141543a00aa5c",
               "name": "Samuel Gruen",
               "profile_path": null,
               "id": 1870592,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Miss O'Shaunessy",
               "gender": 1,
               "credit_id": "5993b670925141543a00aa71",
               "name": "Michelle Fairley",
               "profile_path": "/j8lQfEPHCKWV2QCiJJuH97CnoBX.jpg",
               "id": 20057,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Stephane",
               "gender": 0,
               "credit_id": "5993b68fc3a3687eff00a2e4",
               "name": "Frédéric Da",
               "profile_path": null,
               "id": 1870593,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4887c3a368484e0fd7e5",
               "name": "James Ivory",
               "profile_path": "/vj4PY2KciRCZWzT4eCdOoQfzoJs.jpg",
               "id": 54441,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4887c3a368484e0fd7eb",
               "name": "Kaylie Jones",
               "profile_path": null,
               "id": 567771,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4887c3a368484e0fd7f1",
               "name": "James Ivory",
               "profile_path": "/vj4PY2KciRCZWzT4eCdOoQfzoJs.jpg",
               "id": 54441,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4887c3a368484e0fd7f7",
               "name": "Ruth Prawer Jhabvala",
               "profile_path": null,
               "id": 54443,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4887c3a368484e0fd7fd",
               "name": "Richard Robbins",
               "profile_path": null,
               "id": 54449,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5aa6f3e90e0a263dc40124a9",
               "name": "Ismail Merchant",
               "profile_path": null,
               "id": 54448,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.559174,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 72987,
      "vote_count": 8,
      "budget": 0,
      "overview": "This fictionalized story, based on the family life of writer James Jones, is an emotional slice-of-life story. Jones is portrayed here portrayed as Bill Willis, a former war hero turned author who combats alcoholism and is starting to experience health problems. Living in France with his wife, daughter, and an adopted son, the family travels an unconventional road which casts them as outsiders to others. Preaching a sexual freedom, his daughter's sexual discovery begins at an early age and betrays her when the family moves to Hanover in America. Her overt sexuality clashes with the values of her teenage American peers and gives her a problematic reputation. Meanwhile, her brooding brother copes with his own interior pain regarding his past, only comfortable communicating within the domestic space.",
      "similar": [
         4347,
         5951,
         1944,
         41446,
         10349,
         2891,
         866,
         80,
         34584,
         27022,
         7345,
         1700,
         51828,
         203833,
         267192,
         120467,
         242224,
         5038,
         843,
         1826
      ],
      "original_title": "A Soldier's Daughter Never Cries",
      "runtime": 127,
      "poster_path": "/gdHuZl5pbHN8xOyapiozZ1CWuzg.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Capitol Films",
            "id": 826,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Merchant Ivory Productions",
            "id": 20740,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Screen Productions",
            "id": 12745,
            "origin_country": "GB"
         }
      ],
      "release_date": "1998-09-18",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "The city of lights. A famous American author and the decade that changed a generation...forever.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Ivory"],
      "runtime": 127,
      "synopsis": null,
      "writers": [
         "Kaylie Jones",
         "James Ivory"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120835/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwMjU3MjIxNl5BMl5BanBnXkFtZTcwOTYwMTgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Leelee Sobieski, Kris Kristofferson, Barbara Hershey | See full cast and crew »"],
      "reviews": [
         "This is an sensitive exploration of the family and place. I noticed that Bill Willis was the only father in the picture, Billy and Francis did not have fathers. As a coming of age movie it really worked- for not only does Channe lose some of her innocence- it starts in the tree house- she also is able to accept her coming into adult status- as is evidenced by dumping the jock and losing some of her self-centeredness. I loved the character of Francis- boy/not sexually threatening- yet freeing for Channe by the fact of his flamboyance. Most of the parts of this movie fit together well- there is enough dichotomy- the mother can throw sand in the sadistic teacher's face, but she also crumbles at the death of an unborn child. Like us the characters are both strong and weak. At first I was bothered by the lack of reference to Vietnam- then I realized neither Billy nor Channe would be that affected like those of us who lived through that period. Most of all, Soldier's Daughter moved me to thinking how parents really influence their children. Any movie that foregoes bombs for thought is tops in my book.",
         "\"A Soldier's Daughter Never Cries\" is a film which revolves around the proverbial institution known as family, but particularly, the relationship between a daughter and her father. The film is divided into three separate sections: \"Billy,\" which discusses the arrival of an adopted son into the family, \"Francis,\" which revolves around the female protagonist, Channe's, best friend, and \"Daddy.\" In each of these categories, we are primarily subjected to the experiences of Channe, who is portrayed by the nubile, charismatic Leelee Sobieski. In them, we learn a little about her character, though strangely enough, not as much as we do about her father, whose unconditional positive regard for his daughter does much more than delineate the characteristics of the relationships among the members of the family. The acting from the entire cast is superb, and from the actors' and actresses' demeanor emanates a very credible atmosphere. Yet the one element that truly grasped my attention was the editing, which with the exception of a couple of segments, added an extremely high element of poignancy to the story. James Ivory was obviously extremely assiduous with the film in this respect, and the final result consists of a strong narrative which appears somewhat terse, but knows exactly what quantity of what the viewer should be fed. Cynical commentary has argued that this film is nothing short of tripe because it lacks a resolute motive--it consists of no conflict at all. All it is is disjointed scenes which serve no relevance to one another, and fail to tell a coherent story. The former statement in regards to the lack of conflict holds true, but the latter is what might be deemed questionable. Afterall, this is a story about the life of a family--and in a real family, few events from the past bear relevance to those of the present. \"A Soldier's Daughter Never Cries\" simply seeks to discuss the development of relationships in a family; events of high caliber are discussed thoroughly, while those of less importance portray to be all that they could ever be: memories.",
         "***May Contain Spoilers*** I'm still not sure if I liked this movie or not, but I definitely found its form interesting. I kept wondering throughout just where the heck this movie was going. It seemed to go off on various tangents, building mini-dramas, only to drop them at the last minute, leaving the viewer just hanging. At first it seemed to be building a story around little Billie's adoption then it backed away. Then it insinuated a drama based around Channe's encounter with the neighbor boy and then dropped it. It continued this pattern through Candida's relationship, Channe's early promiscuity, and Marcella's growing drinking problem. All leading up to Bill's death...which is treated in the same anti-dramatic style. It seems to me that the whole point of the movie was to experiment using an anti-dramatic form and style where very dramatic episodes are abandoned just before the viewer enters the realm of real feeling.",
         "\"A Soldier´s Daughter Never Cries\" is the kind of movie that, in spite of American production, feels very European. American movies tend to be sentimental with plenty of scenes specifically calculated to make viewers get teary eyed. European movies, though, usually opt for a more naturalistic approach that refuses to wallow in emotions. In the case of \"Soldier´s Daughter\", this characteristic can be both good and bad. It is good in the sense that the movie seems more realistic because one must admit that in real life, melodramatic conduct is not too common. Emotions seem to be hidden rather than absent and they actually do appear in small explosions like in the somewhat odd outbursts of the mother towards the end. Emotions also seem to be behind the strange behavior of the characters (e.g. the maid scrubbing the floor at midnight after breaking up with her lover or Billy acting antisocial to make up for his feelings of resentment). Howwever, there are quite a few scenes which should have been emotionally powerful but aren´t. A good dose of American sentiment could have made a difference. For example, in the one scene where Channe finally starts crying (the title of the movie is a saying her father keeps quoting at her), I understood the place of it in the plot but was not touched by it. When Francis, heartbroken, says goodbye to Channe after telling her his secret, the situation should have been heartrending but it also left me feeling hollow - and this in spite of the fact that Francis, an effeminate heterosexual, was probably the film´s most fascinating character. Furthermore, the parents´ understated reactions often make it seem that they do not really love or care about their children the way everyone keeps insisting they do (is that a possible hidden meaning ?). Otherwise, the movie is fine in the sense that it is intelligently written. Not only is it based on a novel but it feels as if it WAS a novel rather than a movie. The family is portrayed quite realistically. Even though the film does not seem to try to be artistic, it is lyrical enough to be seen as art.",
         "\"A soldier's daughter never cries\" by James Ivory presents us with an interesting story about fine aspects of human relationships with really impressive acting. The film is divided into three segments - \"Billy\", \"Francis\" and \"Daddy\". Each containing the protagonist Channe's experiences with three men in her life - her adopted brother, her school friend and her father respectively. The film shows how these experiences let her become gradually mature... emotionally, sexually and also in terms of personality. Acting is exceptional in this film. The first segment shows the time right after the brother, Billy, being adopted when he was 7 years old. Channe was also 7 at that time and the child actress who played her (Luisa Conlon) really deserves our praise. In the next two segments Channe (14 and 17 yrs respectively) was brilliantly portrayed by Leelee Sobeiski who is much responsible for the rather reserved nature of the character. Kris Kristofferson does a solid job as the father. His character is an unique one, as evident not only by the words he spoke, but also by Kristofferson's accent and expressions. Among the other actors Jesse Bradford is worth mentioning as Billy is last two segments. The actor who played Francis in \"Francis\" brings too much dramatic persona in my opinion. Though arguably that's one of the best things about the character. And there's also a nice extended cameo by Virginie Lledoyen as Billy's biological mother. Now about the characters and screenplay. Though stated from Channe's point of view, her father is the major influential character in this film. It was always his decisions, his outlook towards life that affected his family. The character of Channe is somehow very interesting. Her experiences with womanhood and men are written in an unique manner. And how she develops into a warm, soft-spoken yet determined personality is clearly something that Ivory spent time on. On the other hand Billy is a rather shy and quite unimpressive character with no apparent personal feature that should be rendered as a quality. Now Channe's school friend Francis has all the unusual features - he's an opera singer, loves to dance puppets, has a really corky sense of humor and his mother is an existentialist. His relationship with Channe is one of the film's major assets. All the characters are quite multi-layered, even Billy. The script is also masterfully written. A nice example is the conversation between Channe's father and her High School boyfriend Keith. I don't understand French that well so can't comment about the French dialogues though. Actually, it is a film that is bound to be enjoyed if seen in a special mood. I'm lucky that I had that mood when it was showing on TV. Also it is a film that grows wonderfully with time, segment after segment. It's a really good coming-of-age story that should be considered as Ivory's one of the best works.",
         "This movie was one of the best that I have ever seen! It is one of the few foreign/drama films that has not bored me. It seemed like the movie would never end, but it was so brilliant I didn't want it to end. I have not watched a drama so good since Terms of Endearment. I highly recommend it.",
         "So true to life it made me cry. Exactly how I grew up, \"expatriate\" and all. The acting and direction and locations were perfect in every way, and this film takes a number of viewings to \"see it all.\" Excellent recommendations all around.",
         "We got this video from library without knowing anything about it, except for the good reputations of the actors & director. The story rambles along following the lives of a young American girl & family living in Paris -- their adoption of a French boy, and how their lives change as the two grow up, eventually moving to North Carolina. The acting is good, and the story details are fascinating and off-beat (her teenage boy friend who sings great soprano opera, for example). Perhaps the father is too good to believe (from a kid's point of view) but it's a warm story that just kind of ends after the father dies. I can see why it might not be hugely popular, but it provides much food for thought and discussion within families as to choices, values, etc. Another plus - great location photography.",
         "If you're into a nice, structured movie, with no plot holes, and plenty of character development, this movie should not be on your list! A lot of times, characters do things, and you just don't know why, and don't really care because of this. I'm not that big into watching movies that have the above criteria, if it makes up for it in other ways. Kris Kristofferson is nothing but his usual self(ugh), Leelee is good, the boy who plays her effeminate friend is VERY good, Barbara Hershey is kind of funny(only sometimes), but the one redeeming character in this \"mess\" of a movie (with a very anti-climactic ending) is Channe as a little girl, played by ---- Luisa Conlon ----. One question: WHY HASN'T THIS GIRL BEEN IN ANY OTHER MOVIES?!! If you rent this movie for no other reason, (except maybe for the effeminate American boy living in France w/a British mother) watch this actress. I truly call her an actress because this girl KNOWS how she looks on camera, and TRIES to make herself look a certain way when she's acting. She TRULY seduces the camera with her skills. Too bad she's only in the first half of the film. -Sep",
         "Let the cyber reader beware! Reading the summary as well as the first User Comment about this movie, \"A Soldier's Daughter Never Cries, which I viewed recently [2004], stunned a 4-letter word out of my mouth. These two viewers seem blissfully unaware of any knowledge of James Jones or his times. Nor do they show even a basic appreciation for film or narrative methods. If they cannot support their assertions about the film--that it is \"emotionless\" for instance--with some reference to accepted standards of drama or acting, we must assume that they know no better. My question is this: why does such an important site for movie-lovers accept such limited summations of films to remain on the site?"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Capitol Films",
         "Merchant Ivory Productions",
         "British Screen Productions"
      ],
      "summaries": ["This fictionalized story, based on the family life of writer James Jones, is an emotionless slice-of-life story. Jones here is portrayed as Bill Willis, a former war hero and now successful author who obviously drinks too much and is starting to experience health problems. Living in France with his wife, daughter, and an adopted son, the family travels an unconventional road that leaves all of them as outsiders to others. Preaching a sexual freedom, his daughter's sexual acceptance begins at an early age and betrays her when the family moves to Hanover in America. Her sexuality is definitely not the normal for American teens and gives her a bad reputation and outcasts her. Meanwhile her brooding brother struggles with his own inner turmoils about his early desertion in life. Only within the tight knit confines of his family is he comfortable to even speak."],
      "budget": 0
   },
   "movielensId": 2276,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1998-09-18",
      "dvdReleaseDate": "2002-05-14",
      "directors": ["James Ivory"],
      "runtime": 127,
      "movieId": 2276,
      "title": "A Soldier's Daughter Never Cries",
      "mpaa": "R",
      "actors": [
         "Kris Kristofferson",
         "Leelee Sobieski",
         "Jane Birkin",
         "Barbara Hershey",
         "Dominique Blanc",
         "Virginie Ledoyen",
         "Jesse Bradford",
         "Isaach De Bankolé",
         "Harley Cross",
         "Macha Méril",
         "Nathalie Richard",
         "Anthony Roth Costanzo",
         "Bob Swaim",
         "Luisa Conlon",
         "Samuel Gruen",
         "Michelle Fairley",
         "Frédéric Da"
      ],
      "imdbMovieId": "0120835",
      "originalTitle": "A Soldier's Daughter Never Cries",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["nVLPPHZZuEI"],
      "plotSummary": "This fictionalized story, based on the family life of writer James Jones, is an emotional slice-of-life story. Jones is portrayed here portrayed as Bill Willis, a former war hero turned author who combats alcoholism and is starting to experience health problems. Living in France with his wife, daughter, and an adopted son, the family travels an unconventional road which casts them as outsiders to others. Preaching a sexual freedom, his daughter's sexual discovery begins at an early age and betrays her when the family moves to Hanover in America. Her overt sexuality clashes with the values of her teenage American peers and gives her a problematic reputation. Meanwhile, her brooding brother copes with his own interior pain regarding his past, only comfortable communicating within the domestic space.",
      "tmdbMovieId": 72987,
      "avgRating": 3.48728,
      "releaseYear": "1998",
      "numRatings": 393,
      "posterPath": "/gdHuZl5pbHN8xOyapiozZ1CWuzg.jpg"
   }
}