{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "heist",
            "id": 10051
         },
         {
            "name": "expectant father",
            "id": 160945
         }
      ],
      "imdb_id": "tt0112854",
      "video": false,
      "title": "Destiny Turns on the Radio",
      "recommendations": [],
      "backdrop_path": "/sC60syDjr6LfdwNDWWoRpmT7w8d.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Julian",
               "gender": 2,
               "credit_id": "52fe4680c3a368484e09416d",
               "name": "Dylan McDermott",
               "profile_path": "/4VVyvrxVVrrX9GsKlkSnUz32Ft6.jpg",
               "id": 32597,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lucille",
               "gender": 1,
               "credit_id": "52fe4680c3a368484e094171",
               "name": "Nancy Travis",
               "profile_path": "/5galk3XJxxlIEmrnAQBuJsY1AaD.jpg",
               "id": 18331,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Thoreau",
               "gender": 2,
               "credit_id": "52fe4680c3a368484e094175",
               "name": "James Le Gros",
               "profile_path": "/rqBjmSkcRGwtwpb2tTjGcqLtKyG.jpg",
               "id": 6474,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Destiny",
               "gender": 2,
               "credit_id": "52fe4680c3a368484e094179",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Tuerto",
               "gender": 2,
               "credit_id": "52fe4680c3a368484e09417d",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4680c3a368484e094169",
               "name": "Jack Baran",
               "profile_path": null,
               "id": 58154,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4680c3a368484e094183",
               "name": "Robert Ramsey",
               "profile_path": null,
               "id": 52053,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4680c3a368484e094189",
               "name": "Matthew Stone",
               "profile_path": null,
               "id": 52054,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.857633,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62488,
      "vote_count": 12,
      "budget": 0,
      "overview": "Johnny Destiny burns into Las Vegas in his hot Plymouth RoadRunner, stopping only to pick up a stranger stranded in the desert. But then, things aren't always as they seem. Anything can happen in that town of many possibilities...especially since there's been some weird electrical disturbances. As the stranger, fresh out of prison, tries to put his life back together--to recover his money from an old bank heist and the girl he lost in doing the job--something keeps interfering with his plans. Is it fate...or just Destiny?",
      "similar": [
         949,
         9654,
         97434,
         4597,
         14194,
         294652,
         623,
         22907,
         4771,
         9679,
         68727,
         76494,
         9277,
         59,
         75656,
         59108,
         291805,
         154400,
         259316,
         500
      ],
      "original_title": "Destiny Turns on the Radio",
      "runtime": null,
      "poster_path": "/jpYXSxHtVosa3dT590JcSlcOeqC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rysher Entertainment",
            "id": 11661,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Savoy Pictures",
            "id": 11308,
            "origin_country": ""
         }
      ],
      "release_date": "1995-04-28",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Fate visits in ways you never expect",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Baran"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Robert Ramsey",
         "Matthew Stone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0112854/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMDUwMDA0OF5BMl5BanBnXkFtZTYwNjY4NDg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dylan McDermott, Nancy Travis, Quentin Tarantino | See full cast and crew »"],
      "reviews": [
         "I picked up Destiny on the Radio on VHS years ago on the grounds that it had Quentin Tarantino slapped on the boxed cover. Sure enough the film was no match for either Revoir Dogs or Pulp Fiction, but it was a very like-able film. Destiny on the Radio is one of those films you can just sit back and enjoy scene by scene, it has a lot of reply value. It does not feature a gripping storyline, it does not really have an outcome, it's just one of those movies that drifts from scene to scene with a whole cast of characters. I'm not even sure i got the movie, i'm sure even sure the viewer is supposed to get the movie. To some it up, the best thing is go out and form your own opinion. I have seen far worse movies and one thing is for sure, Destiny on the Radio is more enjoyable than Star Wars Episode 1, 2, 3 and the Jurassic Park movies.",
         "Aside from an earlier comment written about this movie, I happen to believe that DESTINY TURNS ON THE RADIO is a fine indie film. The dialogue is actually quite pungent with one-liners and gritty 'over-the-top' tough-guy-ness which makes it rather enjoyable. The story takes place in Las Vegas where an animistic spirit in the form of a man, Johnny Destiny (played by Tarantino), brings luck and good fortune to whoever he comes into contact with. The cast is idealistic and sparked with character, especially in the cases of wacky Thoreau and angry Julian (played respectively by James Le Gros and Dylan McDermott), and in a surprise casting move with comic veteran James Belushi as Tuerto, casino manager of The Stardust and new lover of the befallen Lucille (Nancy Travis of 'SO I MARRIED AN AXE MURDERER'). Johnny Destiny is the somewhat loose glue binding all of these characters together, which is a far stretch I'll admit, but the fun is in how it plays out, the excessive Las Vegasy overacting (which shouldn't be mistaken for real acting) and the quips of the dialogue. The only problem with this film, however, is that Tarantino's acting is horrid and somehow his association with this movie lumped it into a generic Tarantino-esque category, making its viewers somewhat upset due to the overwhelming lack of F-words, point-blank gunpoint stand-offs, and bloody faces. What DESTINY TURNS ON THE RADIO does offer, however, is a magical, mystical feel in a city where lady luck is prayed upon every second, and characters who obviously take themselves too seriously only to learn that success and fortune can fade in the flash of a lightning bolt. Other interesting and great casting mentions go to Bobcat Goldthwait and David Cross.",
         "There are only certain movies that can overcome their technical failures. Movies like \"Destiny Turns on the Radio\" have an authentically magical spark that draws you in despite some bad production values. What's more, its whimsical but truly bizarre story never alienates its audience. It is solidly entertaining and memorable throughout. Featuring some dazzling performances (minus Quentin Tarantino's lackluster turn as the suave Johnny Destiny) and a truly unique story, \"Destiny\" is a low-key gem. Dylan McDermott is downright charismatic as Julian Goddard-a fugitive who was able to escape a Nevada penitentiary through a once in a lifetime brush with luck and fate. He is rescued by Destiny and delivered back to his old life of crime after 3 years. He hooks up with hotel manager Thoreau, his longtime partner and friend-played by James LeGros who is one of the film's most shining assests. With a fresh new hand at life, he sets out to get back with his ex Lucille, who is looking for her big break as a singer (by any means necessary). She is now with a piggish casino owner played by a surprisingly funny James Belushi. Of course, Goddard needs to thwart him, his goons, not to mention a handful of cops on his tail in order to get to his long lost love. All the while, Johnny Destiny is planning his return to his netherworldly realm through means of a hotel pool portal (don't ask- watch the movie). There are a lot of things that just don't work in this movie. Fortunately they are not hard to look past. These include the terrible sound, which require some leniency from the viewer. They also include some jokes that go flat-notably a completely needless subplot starring none other that Bobcat Goldthwait. As you know, Quentin doesn't do much for his great role and to top it all off, there are some things that don't make a whole lot of sense in the script. The beautiful thing about this movie is that it doesn't stop being so effortlessly likable. It gets very far fetched, but it never turned me off the whole time. In fact, it only proceeded to draw me in and captivate my imagination. Not to mention it's sprinkled with great bit parts like Tracey Walter as Goddard's desert-rat father, a hilarious David Cross as Lucille's sleazy agent and Allen Garfield as Vinny Vedivici, the slob producer who can make her dreams come true. It may not hit all its marks, but \"Destiny Turns on the Radio\" convinces you it doesn't have to. It is one of those irresistible movies that you don't know why you enjoy it, but can't help doing so nonetheless. Don't be shy, accept \"Destiny\".",
         "i was talking with a friend who doesn't get QT movies at all .. while this, i've learned, is only a QT acting role, i really enjoyed it .. i'm surprised by the negativity of the comments by others .. seems this is either a love/hate movie or a sore point with QT aficionados .. whatever, i recommended it to my friend and do so to others who enjoy quirky little movies with a touch of magical realism together with a nice soundtrack .. i smile recalling the many scenes that entertained .. no deep meaning or message here, just a fun way to spend a little time while passing through an evening .. i'm no fan of Las Vegas, where the movie is set, but the little motel with its homage to film stars of the 1950's hearkens ones memory back to a time when the Strip was much less commercialized and overdone, a time when life seemed simpler, more magical, and just plain fun .. check out this little gem for yourself",
         "I don't know why this movie is always so poorly rated. From my point of view this is a fast paced movie with a little bit of everything: romance, car chases, music, crime, comedy, and a healthy serving of the surreal. I own a copy of this movie and I have watched it many times without getting tired of it - so why does the rest of the viewing community have it in for this little diamond in the rough? The chemistry between Dylan McDermott and Nancy Travis sizzles and James LeGros makes a charming quirky sidekick. I could have lived without the Bobcat Goldthwait cameo, but when isn't that the case? Here's a good acid test: if you liked Toys, L.A. Story or the Linguini Incident then you'll like Destiny Turns on the Radio.",
         "I don't know what convinced Quentin Tarantino to take a role in 'Destiny Turns on the Radio,' nor do I really want to. Essentially it is a rip-off of his ultra-popular \"Pulp Fiction,\" released in 1994, only that movie had a point and this one does not. Dylan McDermott heads an all-star cast as a crook that is let out of jail, only to find his old pal (James LeGros) has lost their cash to a mysterious wanderer named Johnny Destiny (Quentin Tarantino), hence the title. However, things aren't as clear as they seem to be. Sure, the movie's title is easily explanatory \u0096 but what on earth Johnny Destiny stands for (other than, of course, destiny), why he's there, who he really is, what he's doing, why he wants to do what he's doing \u0096 none of it is explained. Furthermore none of it is ambiguous like 'Donnie Darko,' where we enjoy guessing and forming our own conclusions. Nope, it's just stupid and guessing what any of it means wastes too many precious brain cells that doesn't deserve to be burnt on such lousy, paper-thin material. It's like someone, somewhere, said, 'Let's make a movie with Quentin Tarantino. It'll have no plot, we'll just have some weird characters interact and tell jokes and entertain the audience.' Entertaining, perhaps, but not in a good way. The ending stinks of studio interference and more often than not the movie is just downright confusing. It could very easily be one of the worst films of all time, if not for the fact that it is rather sporadically amusing at times (its strongest traits of very little) and there are some OK performances from James Belushi and LeGros. The rest of the cast is a dud -- Tarantino tries, but fails, in a cameo-sized role. He's flamboyant and obviously savoring the opportunity to pay homage to all the cool-cat characters of classic cinema, but it's soon revealed that his character, Johnny, is just plain strange and unlikable. I expected to feel something \u0096 anything \u0096 when he appeared on-screen, but I didn't. Co-star McDermott in particular is just plain awful, lacking the charisma required for the role. Often appearing in made-for-television movies, McDermott once again establishes the fact that he's not the sort of actor you'd wan Dialogue is stiff (stuff like \"kiss me, baby\" manages to sneak in). Overall it's just a goofy movie that thinks it's a lot cleverer than it is -- not awful because it doesn't take itself too seriously and is fun sometimes, but overall just a big mess of various ideas that clash together. A pure marketing scheme, cashing in on Tarantino's image no less. I did enjoy one performance, in particular -- James LeGros (\"Phantasm II\"), who reminded me of Barney from \"The Flintstones.\" A likable actor playing a likable character with depth -- too bad he had to waste his talent on a movie that is otherwise so very thin.",
         "One of the more obvious truths in show business is that, since people have different tastes in art, there are many different kinds of movies, and many different ways of talking about them. As my Uncle Al used to say, \"Kid, that's why Mister Ford makes 'em in a lot of different colors now.\" My late father was a lyricist back in the days of Tin Pan Alley; he sold his first song lyric before he was twenty, and he spent his entire life delighting in, and making his living with, his imagination. He treasured imaginative ways of telling stories, and I guess that's why I married a poet. I will forgive an otherwise uninspired movie if it offers an imaginative and unusual way of thinking about an idea. Art, like religion, is a cultural universal; every society on earth makes art. In homogeneous cultures, and in all totalitarian societies, artistic orthodoxy is highly valued. The more diverse a culture becomes, the more tolerant it becomes of subversive art. The American film industry today is the most diverse in the world. Instead of an unchanging stream of movies glorifying the fatherland or the revolution, we Americans, or at least some of us, have been entertained by the animated fantasy of Walt Disney, the profound vision of Orson Welles, and even the as-yet-immature imagination of Jack Baran. Who's Jack Baran? I'm coming to that. One of my father's favorite songs was Johnny Mercer and Harold Arlen's \"That Old Black Magic,\" which contains the line, \"You're the mate that fate had me created for.\" And that's what DESTINY TURNS ON THE RADIO, directed by Jack Baran, is all about, a comedic fable about luck or fate or destiny, and the mythology that our culture has constructed around it. It's not a new idea, but it's an interesting idea, and it's more interesting to me than whether the good guy will get the bad guy before he blows up another building. The fact that young Jack Baran didn't quite pull it off is forgivable. DESTINY TURNS ON THE RADIO was written by two young graduates of Robert Redford's Sundance Institute, which supports independent filmmaking, that is, movies not driven by the major studios and their commercial formulas for box-office success. Well, they certainly avoided formulas. They've also avoided box-office success. I saw this movie twice the week it opened, and I can say for a fact that at least four other people in my town also saw it because they were in the theater with me. I found DESTINY TURNS ON THE RADIO to be provocative, witty and entertaining, but I surely can see why it's not everyone's cup of tea. Its theatrical colloquy and supernatural premise combine to create a script that probably reads a lot better than it plays. The incongruity between the theme and the characters demands an extreme suspension of disbelief, something most film-goers are simply not willing to do. So what's to like? Well, I liked this movie because it appealed to me like a quirky short story by P. G. Wodehouse, lightweight but clever. I liked it because James LeGros does a terrific job in a supporting role. I also liked it because Nancy Travis sings \"That Old Black Magic\" in a scene that had me tripping over my tongue. I guess what I'm saying is that I liked DESTINY TURNS ON THE RADIO because I think my father would have liked it. It is an imaginative first effort from a bunch of young filmmakers, and investing in it was an act of courage. And evidently, for many people, so was sitting through it.",
         "Tarantino Is the One Who Is the Whole Movie Himself. Actually I saw this movie just because of Tarantino. Even though James Belushi was tops too, the movie is a mediocre piece of work: trivial plot line, standard dialogues and so-so acting. If you ever thought of getting into the Emperor's (Tarantino) soul, you can find the portal right here in this movie. There was the shot that covered all costs of getting this film, the shot where Tarantino goes still for a moment, and that very moment the whole different Universe opens in his eyes. That moment lasts less than a second, but you can catch it. It's right in the end, when at the restaurant Johnny, the cops, and everyone is watching the girl's show, after the cop says: \"Hey look, it's that guy\u0085\", then there is a shot of Johnny (Tarantino), and first milliseconds of that shot is actually the portal. I would say that he is a male Giaconda there, but not as twisted and troubled as she is. She is an oppressed strong woman, with unbelievable personal magnetism, Leonardo succeeded in transmitting her energy of a fighter in the portrait, since then she is fighting with everyone who looks at her. It's possible to defeat her, but it is easy to be defeated. Tarantino possesses the same, if not more powerful, personal magnetism and it is clearly seen in that shot. His eyes are open, undisguised there (this kind of unmasking can take place only when one is too tired to be able to hold his mask, - after Pulp Fiction he really was tired and \"Destiny\u0085\" was just in time to \"catch up\" his real unmasked self), and you can really see how deep, deeper than the blue, they are. So much depth, power and knowledge reflected in them, that you almost think you are looking into the Infinity itself. Well, just for the sake of that shot I take the DVD again and again, every time I want to dive into the Soul Ocean of the most devout movie worshipper ever existent on the planet Earth.",
         "\"Destiny Turns on the Radio\" is an extremely fun trip into a weird mythological netherworld of Las Vegas. It is a film that implements a purposefully corny magical realism to tell a story of an escaped convict rediscovering his destiny. And magical it is. This film is in a class of a few other 90's films (all of which never really found an audience outside the late-night-Cinemax crowd) that capture a magically bright, giddy, and surreal atmosphere -- this one in a gleeful Las Vegas setting. Its classmates include \"Box of Moonlight\" and \"Mojave Moon\". Despite a few technical flaws (the sound's iffy and so is some blocking -- and I'd lose Tarrantino if this was my film), the movie just works in an odd sort of way. The cast seems to be having a great time (note especially Tracey Walter and James Legros' father-son's-best-friend bonding scenes), the locations and cinematography are dazzling, and it provides an intangible escape into a weird cinematic netherworld. It's as if some portal opened up to these filmmakers in this specific class of the mid-90s and enlightened them all with late-night-Cinemax charm. More, please!",
         "The film tells a story about marginal people--people living in the interstices and on the edges of our system. Stories of this type allow writers and directors to concentrate on interactions among a fairly small group, and (usually) they create interesting, likable people for us. This film, with its bow to magic realism, is both amusing and surprising. Tarantino is not effective as an actor, I feel. Apparently he is too self-conscious or, perhaps, does not rehearse. Aside from his performance (and it is not actually bad), the performances are fine. Just about every actor in the film does a good job."
      ],
      "genres": [
         "Crime",
         "Comedy",
         "Fantasy"
      ],
      "productionCompanies": [
         "Rysher Entertainment",
         "Savoy Pictures"
      ],
      "summaries": ["Johnny Destiny burns into Las Vegas in his hot Plymouth RoadRunner, stopping only to pick up a stranger stranded in the desert. But then, things aren't always as they seem. Anything can happen in that town of many possibilities...especially since there's been some weird electrical disturbances. As the stranger, fresh out of prison, tries to put his life back together--to recover his money from an old bank heist and the girl he lost in doing the job--something keeps interfering with his plans. Is it fate...or just Destiny?"],
      "budget": 0
   },
   "movielensId": 228,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-28",
      "dvdReleaseDate": null,
      "directors": ["Jack Baran"],
      "runtime": 0,
      "movieId": 228,
      "title": "Destiny Turns on the Radio",
      "mpaa": "R",
      "actors": [
         "Dylan McDermott",
         "Nancy Travis",
         "James Le Gros",
         "Quentin Tarantino",
         "Jim Belushi"
      ],
      "imdbMovieId": "0112854",
      "originalTitle": "Destiny Turns on the Radio",
      "genres": [
         "Crime",
         "Comedy",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["4wNfb1lh7oE"],
      "plotSummary": "Johnny Destiny burns into Las Vegas in his hot Plymouth RoadRunner, stopping only to pick up a stranger stranded in the desert. But then, things aren't always as they seem. Anything can happen in that town of many possibilities...especially since there's been some weird electrical disturbances. As the stranger, fresh out of prison, tries to put his life back together--to recover his money from an old bank heist and the girl he lost in doing the job--something keeps interfering with his plans. Is it fate...or just Destiny?",
      "tmdbMovieId": 62488,
      "avgRating": 2.6821,
      "releaseYear": "1995",
      "numRatings": 486,
      "posterPath": "/9iczUcmMLnOZ4Ltx3X3AEpbxTt4.jpg"
   }
}