{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "adultery",
            "id": 596
         },
         {
            "name": "sahara",
            "id": 7041
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0100594",
      "video": false,
      "title": "The Sheltering Sky",
      "recommendations": [
         108241,
         63225,
         163230,
         64983,
         364002,
         44297,
         24553,
         56801,
         81573,
         71068,
         291964,
         116857,
         70233,
         64441,
         249011,
         110928,
         52713,
         29471,
         56742,
         41971
      ],
      "backdrop_path": "/l757xM1aKZNaeVQp18mxwoPGhtu.jpg",
      "revenue": 2075084,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kit Moresby",
               "gender": 1,
               "credit_id": "52fe447cc3a368484e025da9",
               "name": "Debra Winger",
               "profile_path": "/l1ISZ6yfV8ilaNmOHBVTheq6Mbq.jpg",
               "id": 26513,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Port Moresby",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025dad",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "George Tunner",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025db1",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mrs Lyle",
               "gender": 1,
               "credit_id": "52fe447cc3a368484e025db5",
               "name": "Jill Bennett",
               "profile_path": "/fEUBRw8o11hyAg1sF4fFDwTq5VA.jpg",
               "id": 10504,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Eric Lyle",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025db9",
               "name": "Timothy Spall",
               "profile_path": "/yMClxMrLdOXk37RGvrqJEWjg9ko.jpg",
               "id": 9191,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Belqassim",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025dc3",
               "name": "Eric Vu-An",
               "profile_path": null,
               "id": 539510,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Mahrnia",
               "gender": 0,
               "credit_id": "52fe447cc3a368484e025dd3",
               "name": "Amina Annabi",
               "profile_path": "/9jc703d5CeB0mBUqpXd1SHh1RIP.jpg",
               "id": 133732,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Capitaine Broussard",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025dc7",
               "name": "Philippe Morier-Genoud",
               "profile_path": null,
               "id": 19075,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Abdelkader",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025dcb",
               "name": "Sotigui Kouyaté",
               "profile_path": "/3zAMyJjYJrxsQpgToANBApKuBK0.jpg",
               "id": 125970,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "un officier français",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025dcf",
               "name": "Tom Novembre",
               "profile_path": "/h4StLyhcAYXt3v9Bo3fJpMgISK9.jpg",
               "id": 24454,
               "order": 9
            },
            {
               "cast_id": 27,
               "character": "French Woman",
               "gender": 1,
               "credit_id": "5a26971492514103390ec6d4",
               "name": "Nicoletta Braschi",
               "profile_path": "/KVd8Wj5PXrZ4XhtnWzbdqvQLIu.jpg",
               "id": 9235,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025dbf",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe447cc3a368484e025dd9",
               "name": "Paul Bowles",
               "profile_path": null,
               "id": 266350,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025ddf",
               "name": "Mark Peploe",
               "profile_path": null,
               "id": 11379,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025de5",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025deb",
               "name": "Ryuichi Sakamoto",
               "profile_path": "/sznCz9OIUYxBgNhn7hsd9LK5jsN.jpg",
               "id": 11382,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025df1",
               "name": "Vittorio Storaro",
               "profile_path": "/4QuZy1Y5TEqSeo3GM3FJYrRM0Xa.jpg",
               "id": 7202,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe447cc3a368484e025df7",
               "name": "Gabriella Cristiani",
               "profile_path": null,
               "id": 11383,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe447cc3a368484e025dfd",
               "name": "Celestia Fox",
               "profile_path": null,
               "id": 970,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe447cc3a368484e025e03",
               "name": "Juliet Taylor",
               "profile_path": null,
               "id": 1046,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e09",
               "name": "Ferdinando Scarfiotti",
               "profile_path": null,
               "id": 1155,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe447cc3a368484e025e0f",
               "name": "Gianni Silvestri",
               "profile_path": null,
               "id": 1165239,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e15",
               "name": "Andrew Sanders",
               "profile_path": null,
               "id": 957624,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e1b",
               "name": "James Acheson",
               "profile_path": null,
               "id": 11386,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e21",
               "name": "William Aldrich",
               "profile_path": null,
               "id": 41157,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e27",
               "name": "Jeremy Thomas",
               "profile_path": "/pcXYU5j3MjBgLATJIeUFV199ryt.jpg",
               "id": 3056,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 12.025653,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 24016,
      "vote_count": 66,
      "budget": 25000000,
      "overview": "An American couple (John Malkovich, Debra Winger) drift toward emptiness in postwar North Africa.",
      "similar": [
         606,
         28468,
         37265,
         36630,
         843,
         14211,
         27066,
         283227,
         4507,
         7350,
         9732,
         244772,
         1259,
         10527,
         11430,
         21484,
         247,
         6114,
         873,
         2454
      ],
      "original_title": "The Sheltering Sky",
      "runtime": 138,
      "poster_path": "/tT0YkWpOYM8YpG8GTJQ2qXjhqRa.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1990-10-24",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "A woman's dangerous and erotic journey...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bernardo Bertolucci"],
      "runtime": 138,
      "synopsis": null,
      "writers": [
         "Paul Bowles",
         "Mark Peploe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0100594/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4NjUyMTgxNF5BMl5BanBnXkFtZTcwMDk5NTYxMQ@@._V1._CR13,2,303,446_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Debra Winger, John Malkovich, Campbell Scott | See full cast and crew »"],
      "reviews": [
         "Port and Kit Moresby are travellers who come to North Africa to spend a year or so. With them travels a friend, George Tunner. Their journey hides the gradual breakdown of their relationship - a fact that is only highlighted when Port visits an Arab prostitute and Kit sleeps with Tunner after a drunken train journey together. Before you sit down to see this film, you really need to have asked yourself what sort of mood you are in. Are you looking for a fast film, something entertaining and slick to distract you from life, or provide background noise in the room while you iron? If you are looking for such a movie then there must be thousands of action movies and comedies that you can watch. If you are in a contemplative mood or are able to accept the story that comes at you no matter how slow or difficult to get into then you may as well give this a stab. The film focuses on the relationship between Kit and Port, a relationship that has been crumbling for many years before we are brought into the story. The film then uses the journey as a journey of them both and, ultimately, Kit to find more about themselves, each other and their lives. If this sounds straightforward then forgive me, for it is not. The film doesn't help; it is difficult to get into the story because at times it doesn't seem to really be about anything. It is not so bad for the majority of the film, but Kit's wander in the last 30 minutes is difficult because it seems to be going nowhere and not be connected to the emotions that we only assume she might be feeling. This is the main problem with the film - not so much the slow pace but the fact that it could be running but it wouldn't matter because it would still feel like it isn't actually going anywhere. It is possible to take something from this film but the actual intension was lost on me - when the final lines of dialogue came I hoped they would be as a torch in a dark room - but they only served to lose me that much more. I hate arty films when they seem to revel in their sheer impenetrateability, sadly that seemed to be the case here. Malkovich and Winger are both very good; they acted wounded and hurt very well within their veneer of respectability and normalcy. It's a shame that, although their performances help us get into Kit & Port's relationship, they are unable to help us understand (or care) when the film begins to become `deeper' than that. Scott is quite interesting but underused, although Spall and Bennett are reasonably good. The star here is the desert, and it looks great. For all his faults as a storyteller here, Bertolucci can frame a shot, producing a great sense of place as well as some really gorgeous travelogue moments. If that's your thing (a `deep' and beautiful film) then you'll be OK, but I needed some emotional buy in or at least something approaching a narrative that could be easily followed with a bit of thought. Overall this is an interesting but ultimately frustrating film. It looks great and it all seems very worthy, but where it goes was beyond me. I enjoyed watching it as it forced me to think instead of just vegging out (like so many other films do) but at the end of the day I was left wondering if this was artistic posturing on a big scale or if it really did have an emotional core that I just couldn't reach.",
         "It's hard to understand why this film doesn't get better reviews. Yes of course it's a reflective arty film where evoking feelings is more important than narrative drive. The amount of nudity, though in keeping with the story, does perhaps hinder its being taken seriously by some. Surely though it succeeds as well as any film has in painting a cinematic picture of the experience of being a stranger in a strange land? The cultural barriers, dissonances, language, the maze of similar streets - everything comes together to create the feeling of utter helplessness Kit experiences when she tries to get help for the ill Port. The confusing weird relationships, often only partially depicted in the film heighten the sense of being adrift in life. Together with some of the best ever desert cinematography rivaling even Lawrence of Arabia, North African music, noises, characters and colors this film is a rich feast for the senses indeed. And what a wonderful final voice-over, one of the most deep and thought-provoking lines in all the movies.",
         "This is one of my all time favorite movies. But... and this is a major but... at least part of my appreciation stems from the fact that I watched it several times and that I've also read the book (by Paul Bowles) two or three times. So both works of art (since the book is most definitely a work of great art) tend to blend together in my mind. I started by watching the movie though, without any previous knowledge on the novel, nor on Paul Bowles. I was impressed by the powerful imagery (theater! not dvd) and chilled by psychological the harshness of the plot. I was charmed the first time I saw the film but I fell in love when I saw it a second time, which was after I'd read the novel. Maybe this means that the film doesn't 'make it on its own', but to me that's not a problem. And if you are, like me, gripped by the movie I can really recommend the novel for more 'in depth' . Some people here seem to think that there's no plot or just a very thin one. I disagree. It's not directly on the surface though. You'll have to concentrate and pay attention to dig it up. If you don't like that or feel that a movie should just willingly present itself to you, than this is not your movie.",
         "Please do not read this review if you have not yet seen the film, because I find it necessary to discuss elements of the film which reveal the plot. The whole film was for me a long introduction into the silence of myself. I like the desert a lot, am not afraid of the void, when the mind can finally be still. Port also actually came home to Africa. He was ready to die, ready to leave behind his intellectuality, to get rid of the inner mess that was himself. Although he seemed unconscious of it, his inner soul brought him by force to his own roots. When in delirium his hands dance happily, demanding the music to continue, to push him through and out of this existence, Kit is left aside and alone, madness kissing her forehead for the first time, unable to stop the approaching avalanche which will sweep over both of their lives, leaving one dead. Kit, ...how one must feel going to a foreign country to mate again with the mate with whom you, through so many silly, careless incidents, have lost essential contact - and to suddenly find him dead and silent lying in front of you in the vastness of an indifferent desert. The desert we all live in unawares. \"Oh, God, what have I done, how could I have allowed this to go so far?\" Suddenly she wakes up to notice the immense impact of nothingness. Her mind broken, she goes off with a Bedouin, and this is actually what I like most about the film. It allows me to let my mind break too, traveling with her through the desert, mostly listening to the silent sound of camels and bells and voices crying out in a strange unknown language. Some of the professional critics didn't to go down that path. They need their thoughts to run incessantly, .. for them it must have certainly been a threatening movie, or so their comments would suggest.",
         "\"The Sheltering Sky\" is a road movie and a love story\u0085 Its real subject is very simple: Is it possible for two people to share the same dream and to exist as a couple? It's a simple story of two complicated people who love each other deeply, but can't be happy in love\u0085 So in the first part of the movie we see how the joy of life vanishes, and in the second part how the joy of death begins\u0085 Debra Winger identifies with lead \"Kit\" passionate and seductive character\u0085 She, at least, feels the need to communicate\u0085 At times she feels undesirable, even unwanted and unloved\u0085 But this isn't easy to do with Port\u0085 Malkovich has a completely different approach to Port\u0085 He simply falls into the character\u0085 In his dark eyes we can see clearly the suffering of the memory and the pain of remembrance\u0085 Port's illness is an unspeakable solitude\u0085 He doesn't need anybody or anything to face the challenge of life\u0085 He feels he's sufficient to the task but we clearly feel his strong attraction to nothingness\u0085 Kit and Port know that they dearly love each other, but they just feel condemned, condemned to be together forever\u0085 Bernardo Bertolucci planned the film in two sections: The solar part belongs to Port and the lunar connected to Kit\u0085",
         "At some point in the last 100 years.....there is one film that is likely to stand out as truly exceptional. Not surprisingly, such a film might not be well received by the critics or even be a great success at the box office. True brilliance finds its own place in people's hearts and this film has every ingredient to make it the kind of film people will talk about in a hundred years time. Unlike so many films \"created\" today with lacklustre characters and inept and one dimensional acting - the sheltering sky is moving and funny and ingenious because it offers true artistic and moving portrayals of the ending of a long term relationship amidst the kind of locations the most adventurous backpacker might not know about. Every film is about human meaning and should guide us to know what the author felt and experienced. Somehow the sheltering sky reaches into your heart by honestly portraying the emotions of the complexity of loving another human being. It isn't pretentious or dull as dishwasher art house cinema. It belongs in a category of its own and to anyone who loves beautiful art and poignant and moving story's that go beyond the solar plexus: you will truly love and treasure the experience of this work of art that so many failed to \"get\". Yes....good films happen. Great films occur from time to time....but the Sheltering sky is neither of these two things....it is the most honest and beautiful and emotionally mature work of cinema that I have ever seen. This film makes us feel good about being human...because it shows us how flawed and wonderful we are despite our lack of honesty even with ourselves. The sheltering sky will break your heart and and bring you to life. It will lift you and make you feel like repainting the cistine chapel. It is a brave and noble friend of a film...that wants us to see beauty and pain in all its glory. If you've never seen it......I wish I were you watching it for the first time again. Go get it.! Robert. ps. if you've read the book....don't watch it! no film is going to match your own interpretation of a favourite book...but this movie stands on its own two feet and with some grace at that.",
         "I always wonder what it might be like to have a film set in a location that is explicitly specific, with this film, as example, the Sahara desert and outlining areas of North Africa, and to not have some kind of Lawrence of Arabia kind of epic story attached to it. It's a challenge for a filmmaker to attempt, and Bernardo Bertolucci did attempt it in 1990 with the Sheltering Sky, based on the book that seems to be massively popular (though un-read by me). Whether he succeeded completely or not will depend on how much the viewer can take seeing characters sort of engulfed by the director and cinematographer's own adoration of the strange and bizarrely exotic locales. The story is boiled down, probably more-so than was in the Bowles novel, about a husband and wife (Malkovich and Winger), and their friend (Scott), who go to \"travel\" in North Africa. For what precisely is uncertain, but it is clear that the focal point is that of their marriage failing after years together (both sides sleeping with others, distanced, not altogether honest in conversation). But this changes, of course, once Paul gets typhoid and has a fever for the middle chunk of the film. After this, when a change of events occur, The Sheltering Sky gets even more surreal and sensual then before, if still slightly obtuse in how to really relay a good story. And it's not that Bertolucci is whacked out, like with La Luna, as a storyteller per-say. He actually progresses what there is involving the characters pretty well, and Malkovich and Winger are up to the task of playing people who are sort of bourgeois malcontents who get their respective states of mind altered through their travels of the fly-ridden villages and poor towns in the Sahara region. But it seems like material, even for someone who hasn't read the book, to be more evocative as prose then as filmed, and the many customs and many little details of the villagers are left as more-so poetic aspirations than things relevant to the narrative. This all being said, The Sheltering Sky may possibly be Bertolucci's most astoundingly shot feature, with it coming right behind Goodfellas as the best cinematography of 1990 (via the great Vittorio Storaro). Shot after shot looks like it could come out of a truly exquisite book, and the dedication to compositions and long shots and how a close-up can be just as meaningful cinematically as a view of the desert, is the best that Bertolucci has to offer. But then again, like with Antonioni when he's at his most scatter-shot, without characters who even subtly convey a lot, or with strong enough themes aside from the despair amid an alien environment (to the characters), it becomes the textbook case of style over substance. I'd recommend it, especially to fans of the director and DP, but I can understand the dismay that fans of the book had at the adaptation, despite the convincing performances and (as a given) the wonder of seeing places not seen before, like the not-filmed-before-this-film location of Niger.",
         "Bernardo Bertolucci co-wrote and directed the film of the classic post WW2 novel by author, Paul Bowles, who also narrates. The opening shot (after the credits roll over 1947 New York City and a ship disembarks from its port) is of Port's (John Malkovich) face as he awakens in a North African hotel room, the same scene that opens in the novel. Debra Winger is her most attractive as his young wife,'Kit.' They are accompanied by a randy travel companion, 'Tunner.' The \"casbah\" atmosphere of the Moslem city's narrow stone streets, flooded with Arab denizens, camels, livestock invites the viewer in. As soon as the odious \"Mrs. Lyle\" and her sweaty, overweight son came into the fly-ridden hotel lobby in the hot sultry desert nowhere, I knew I'd love to hate them. John Malkovich is seduced by a street-smart, young Arab who beckons him to follow through dark streets into a girl prostitute's desert tent. (live chickens inside are a wonderful touch.) The Sheltering Sky is a good representation of the novel. The book's narrative of setting, characters, and plot is dramatically envisioned and colored by the reader's point of view and imagination. We literally make the story ours; so when we watch the film version, we tend to judge the director's interpretation seriously. Bertolucci's vision was entertaining and realized well, especially the lead character: the vast Sahara Desert, and exotic ambiance; the cinematography was beautiful. i look forward to watching it on DVD.",
         "Bernardo Bertolucci does not really make fast-paced movies, let's face it. But very often (The Last Emperor, Last Tango in Paris, La Luna,) they're beautifully crafted character studies set in amazing landscapes. Bertolucci also handles his cast with great talent and the performances delivered by actors in his movies are always intense. Here Debra Winger is captivating, and aptly supported by John Malkovich and a strong supporting cast. The story slowly unfolds itself, and the nuances in the script, dialogue, cinematography and acting are splendid. The throughout subtle presence of Paul Bowles adds great melancholy. When I first saw it on the big screen, I left the theater in a state of total despair, because the characters are so miserable.",
         "The Sheltering sky was considered a heavy book, heavy as importance, for the so called beat generation...so in my opinion, taking the story of Paul Bowles and adapting it to a movie was a real challenge...despite the simple storyline that everyone notices, the book/movie has deeper meanings...i watched the movie a lot of times and having read the book made me see better the B.Bertolucci hand...trying to create the place for actually an internal bleeding, a deep hurtful feeling, both Bowles and Bertolucci have to use the symbolism of the desert's vanity...and the inner searches go very well with the message of the traveler who refuses to be just a tourist, setting a line to separate the meaningful from the meaningless...READ the book and then be impressed by the adds that Bertolucci makes, just to give you a very personal approach... \"You are so alone...\"- a beautiful way to end the journey of Port, Kit and Tunner..."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Recorded Picture Company (RPC)",
         "Warner Bros.",
         "Aldrich Group"
      ],
      "summaries": [
         "The American artist couple Port and Kit Moresby travels aimless through Africa, searching for new experiences that could give new sense to their relationship. But the flight to distant regions leads both only deeper into despair.",
         "The American artist couple Port and Kit Moresby travel aimlessly through Africa, searching for new experiences that could give sense to their relationship. But the flight to distant regions only leads both deeper into despair."
      ],
      "budget": 25000000
   },
   "movielensId": 2283,
   "movielens": {
      "languages": [
         "العربية",
         "English",
         "Français"
      ],
      "releaseDate": "1990-10-24",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Bernardo Bertolucci"],
      "runtime": 138,
      "movieId": 2283,
      "title": "The Sheltering Sky",
      "mpaa": "R",
      "actors": [
         "Debra Winger",
         "John Malkovich",
         "Campbell Scott",
         "Jill Bennett",
         "Timothy Spall",
         "Eric Vu-An",
         "Amina Annabi",
         "Philippe Morier-Genoud",
         "Sotigui Kouyaté",
         "Tom Novembre",
         "Nicoletta Braschi"
      ],
      "imdbMovieId": "0100594",
      "originalTitle": "The Sheltering Sky",
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["LDZy2Xl2kho"],
      "plotSummary": "An American couple (John Malkovich, Debra Winger) drift toward emptiness in postwar North Africa.",
      "tmdbMovieId": 24016,
      "avgRating": 3.23601,
      "releaseYear": "1990",
      "numRatings": 536,
      "posterPath": "/tT0YkWpOYM8YpG8GTJQ2qXjhqRa.jpg"
   }
}