{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "guerrilla warfare",
            "id": 11031
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "bandit",
            "id": 33344
         },
         {
            "name": "militant",
            "id": 189399
         },
         {
            "name": "social issues",
            "id": 194451
         }
      ],
      "imdb_id": "tt0109206",
      "video": false,
      "title": "Bandit Queen",
      "recommendations": [
         21265,
         61203,
         14705,
         56901,
         155308,
         21555
      ],
      "backdrop_path": "/tL5tK1zyCHUX2lESMw0DMZevw77.jpg",
      "revenue": 399,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Phoolan Devi",
               "gender": 1,
               "credit_id": "53bff7680e0a261582006ea5",
               "name": "Seema Biswas",
               "profile_path": "/dDGxZvKkDMVV12r0E8wQiqUJGjl.jpg",
               "id": 230632,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Vikram Mallah (as Nirmal Panday)",
               "gender": 2,
               "credit_id": "5463c8920e0a2677fd002cff",
               "name": "Nirmal Pandey",
               "profile_path": "/zctv4V20rsTpyvCbCM8mUbRfYZd.jpg",
               "id": 995721,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mustaquim",
               "gender": 0,
               "credit_id": "5463c89d0e0a26780d002dd5",
               "name": "Rajesh Vivek",
               "profile_path": "/xxXNAp0swAnVBD010LDVOczWYHt.jpg",
               "id": 129726,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Madho",
               "gender": 2,
               "credit_id": "57de3477925141702500462e",
               "name": "Raghuvir Yadav",
               "profile_path": "/w3J2s8gkJnl0XqGuneS23TXtcZ9.jpg",
               "id": 52974,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46199251416c7506d099",
               "name": "Shekhar Kapur",
               "profile_path": "/tscFnAwxOok4DgFE7uaJhUMk7vc.jpg",
               "id": 37630,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5463c882c3a3681259002be2",
               "name": "Mala Sen",
               "profile_path": null,
               "id": 1384979,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.750209,
      "production_countries": [
         {
            "iso_3166_1": "IN",
            "name": "India"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 14785,
      "vote_count": 12,
      "budget": 0,
      "overview": "Born a lower-caste girl in rural India's patriarchal society, \"married\" at 11, repeatedly raped and brutalized, Phooland Devi finds freedom only as an avenging warrior, the eponymous Bandit Queen. Devi becomes a kind a bloody Robin Hood; this extraordinary biographical film offers both a vivid portrait of a driven woman and a savage critique of the society that made her.",
      "similar": [
         192,
         423,
         37094,
         109424,
         205775,
         10527,
         106,
         205601,
         22954,
         12093,
         14168,
         3090,
         14537,
         966,
         10360,
         60747,
         7303,
         504,
         9454,
         16642
      ],
      "original_title": "Bandit Queen",
      "runtime": 119,
      "poster_path": "/zoYg9IliZbCWYxDg4LTCnlEn7JO.jpg",
      "spoken_languages": [
         {
            "name": "",
            "iso_639_1": "as"
         },
         {
            "name": "हिन्दी",
            "iso_639_1": "hi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Kaleidoscope Productions",
            "id": 38210,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Kaleidoscope Entertainment",
            "id": 2141,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-09",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Revenge was her reply.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "India",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shekhar Kapur"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Ranjit Kapoor",
         "Mala Sen"
      ],
      "originalLanguage": "Hindi",
      "imdbLink": "http://www.imdb.com/title/tt0109206/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NzM3MzE1OV5BMl5BanBnXkFtZTcwOTI0MjcyMQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Seema Biswas, Nirmal Pandey, Rajesh Vivek | See full cast and crew »"],
      "reviews": [
         "Phoolan Devi (played by Seema Biswas) is sold into marriage at 11 and is repeatedly abused from then onwards because she is a woman. She is partially liberated by Vikram Mallah (Nirmal Pandey), one of the bandits she is taken in by and eventually rises to lead the group, extracting vicious revenge on upper-cast men in repayment for what they had done to her. The film is a fascinating account of the life of Phoolan Devi who was assassinated in September 2001. The film follows from rise (if you can call it that) from abused child to Bandit Queen. Scenes of abuse are tactfully portrayed with the focus on Phoolan's face rather than the act itself. This focus allows the viewer to see the pain that is inflicted by the abuse. This is still very hard to sit and watch be it the abuse by her husband at 11 or the gang rape of adulthood. It's sad that worldwide women are treated as second-class citizens, often subject to this type of terrible abuse as a matter of daily life - even sadder that many religions are interpreted to allow it. Where the film is weak is the depiction of the two sets of violence - violence against Phoolan is shown as horrible and unforgivable as it should be, however her acts of retaliation are filmed with a more artistic camera and you get the feeling that we are meant to take it that these acts of violence are less horrible because they are revenge attacks. Many of those killed by Phoolan's gang had not done anything to her and were \"innocent\". The film should have a more even tone across all these actions. The performances are roundly excellent. All characters no matter how repugnant or noble are played as totally believable - for many you see both sides of their characters. Seema Biswas is excellent as Phoolan Devi, she convinces throughout the film. The subject matter must have been very difficult to act through but she is without a flaw in the lead - the only problem being the slightly sympathetic edge towards her acts of revenge that the film gives. The film is horrible viewing and yet inspiring that one woman could survive through such events in such a society. Phoolan lived with things that the vast majority of us will ever imagine, she rose up against amazing odds to marry above her caste and be elected to the Indian Parliament. Worth watching to help you be aware of the rest of the world and to ensure that you keep yourself kind towards others in all situations. Long live Phoolan Devi. May she find more peace in death than she did in life.",
         "It may interest people to know that this film was made without any recourse to Phoolan Devi herself and, when she did finally see parts of it, was so enraged that she announced that the film was not to be shown in India or she would cover herself in petrol and set fire to herself. I do not know whether it was shown at all or not, but given her standing at the time as a rising politician, I doubt it. Since then, I saw a report that she has been ousted from office and charged with further crimes from her Dacoit days, and has gone into hiding as a result. Her own concerns aside, this is an excellent film, made all the more so by its refreshingly brutal approach; none of the rose-tinted melodrama one might expect from a typical indian film. It should be stressed that concerns about how feminist the film's messages really are and the like are essentially irrelevant: it's a true story. Her misgivings are, it seems, not with what is depicted but with the way in which the film depicts her.",
         "The true story of Phoolan Devi who became a national hero in India because she fought for her rights as a woman but in a violent manner. I was surprised to see a powerful film with strong images come out of India instead of the Bollywood art trash classics they churn out.",
         "I saw Bandit Queen in 2005, over a decade after it was made amidst widespread controversy in India. The language, the stark treatment and the natural acting (by a relatively unknown cast for that time) might have been even more shocking at that time for an Indian populace more familiar with fantasy cinema. The film, the cast, and Shekhar Kapoor, deserve accolades for the breakthrough effort. The plot is not very different from a typical revenge drama made in various forms in India. In fact, there have been several fictional accounts of this particular story itself. The reason why this stands out is that it's supposed to be a first person account of someone who actually went through all this, and a lot else that doesn't find place on the screen, and survived to tell the tale. Survived long enough to see her story made into a movie at least. Phoolan Devi didn't live very long after being released from prison in 1994. The film scores on several counts. The cinematography is brilliant. The music is apt. The cast, many of whom became more familiar names later, is very good. But the screenplay is patchy. Things move too fast and in jerks at times. It's understandable though, because there are just too many strands that need to be tied together to make it all cohesive. Or maybe I felt that because I have read Mala Sen's book, which is a more detailed and better, though obviously not as shocking as the visual, account of Phoolan Devi's travails, and which is purported to be one of the main sources for the film. There are some factual ambiguities too. According to Phoolan Devi, she wasn't present when the Behmai massacre took place, and despite claiming to be the dictated account of Phoolan herself, she is shown to participate, and in fact initiate, the massacre. Then the final scene where Phoolan surrenders shows her touching the feet of the Chief Minister, while in reality she had surrendered to a portrait of Mahatma Gandhi. Symbolic value only, but shows that Phoolan didn't want to show servitude to a living, ordinary person. It would have been nice to show the Chief Minister to have some resemblance to Arjun Singh, who many remember was the CM of Madhya Pradesh then. But these are small chinks in this eminently well-made movie, a rare gem to come out from the mainstream Indian film industry, made by a man who before this was known best for the ultimate masala movie of the late 80s - Mr India.",
         "I saw this movie over 5 years ago and the subject still infuriates me, as it should. Her anger and initiative were inspiring. Not that I would takeover an army and kill people, but the scene at the well and at the rebel strong hold will never leave my mind. This is a great film but be prepared for the strong subject matter.",
         "This is a remarkable movie. \"The Bandit Queen\" is a powerful and repugnant portrayal of a modern real-life Indian outlaw, Phoolan Devi (\"Goddess of Flowers\"). The movie opens at the point at which the 11 year-old Phoolan is sold as a bride to a middle-aged man. The marital rape and abuse that follows drives her away and eventually, as an outcast, into a life of brigandage. What I found most striking in this movie is that it does not portray the heroine merely as a \"wronged woman\" but as a woman with deep psychological problems -- to me she frequently appeared to be downright psychotic. There are several scenes of unbridled, I might say X-rated, violence in which Phoolan is seen to gradually wind up from anger to viciousness. In one of these scenes she beats her former husband with a rifle butt. It was -- and I think it was meant to be -- sickening. \"The Bandit Queen\" was very controversial in India. It was widely thought to be Oscar material, though apparently did not make the list due to political infighting within the Indian movie-making community. It's well worth the viewing. But I only recommend it for people with strong stomachs. It's a true story (the real-life Phoolan Devi went on to marry above her caste and became the first Untouchable to serve in the Indian Parliament) but it's a story without a happy ending.",
         "I think that the movie was really good. Subject, acting and Nusrat Fateh ALi Khan's music were marvellous. Although the director has succeeded in showing the status of women in rural areas and how they suffer at the hands of male-dominated culture, he has neglected Phoolan's character a bit and has focussed more on the violence faced by her.",
         "This is an excellent movie. Phoolan had no role model's to base her actions on, yet was able to bring about very necessary change to a land that was living in darkness when it comes to female treatment. I like the fact that it was a real story rather than made up, it added to the horror of the story, & the triumph.",
         "\"Bandit Queen\" is a controversial and groundbreaking Indian film (co-produced by Great Britain's \"Channel Four\") telling the real-life story of Phoolan Devi (Seema Biswas, excellent), a low-caste woman given to a husband at age 11 who runs away from him, is constantly violated by upper-caste males, until pairing with a handsome outlaw, Vikram Mallah (Nirmal Pandey), who shows her some respect and invites her to join his gang. Devi became a mythical national figure in her own lifetime (she had just been released from an 11-year prison term when the movie came out, and was murdered in 2001), hailed as \"The Bandit Queen\" or \"Queen of the Ravines\". Although at first Devi took legal action to ban the movie's exhibition in India (and it was actually banned for some time - after all, this is no Bollywood fantasy), she eventually changed her mind (plus, Channel Four paid her $60,000...). A lot has been said about the accuracy of everything portrayed on screen (\"My life was much harder\", Devi would have said after the first time she saw the movie). Just like he would do in 1998's successful \"Elizabeth\", Shekhar Kapur knows how to turn a larger than life, actual trajectory in a huge spectacle - but still keeping the essence of its core. Truth be told, this is one of those extraordinary sagas that if even half of what's portrayed on screen is real, it's already quite a journey. Kapur might have been a high-caste, city-bred man trying to portray the life of a brave and rebellious low-caste woman fighting for her survival - in a way that no other woman in her time had done, but that doesn't mean he doesn't know or doesn't have the right to try to depict this reality he doesn't directly belong to. How honest Kapur's original intentions were we can't know for sure, but that doesn't undermine his accomplishment here; this is a story that had to be told to a larger international audience. If a movie manages to work both as an adventurous spectacle and a tale of resurgence after national injustice and misfortunes, then it deserves to be seen. 8.5/10.",
         "Having seen a number of Bandit movies, this one offered the true story of 'Phoolan Devi' but there was not a lot of new content. The movie does not work too well actually. Phoolan kills 24 innocent thakurs out of hatred for two thakurs and finally has to surrender due to heavy police attention. When Phoolan surrenders, the crowd cheers but why? The movie does not show Phoolan doing a lot for the people. Phoolan belongs to Mallah community and that is perhaps the reason for the support as I presume the Mallah community is quite big. The movie also shows Phoolan' s hatred for her husband but does not convince us why there should be such deep hatred. There are minimal scenes of Phoolan's bandit action too. The movie might have restricted itself to the notes from Phoolan's jail diary which in itself might have been incomplete. Well, that is something that the movie maker needs to handle and complete.I think I liked 'Paan Singh Tomaar' better which was a more complete portrayal."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Kaleidoscope Entertainment",
         "Kaleidoscope Productions"
      ],
      "summaries": ["The movie tells the story of the bandit queen Phoolan Devi who was sent to prison in 1983 and got free in 1994. During five years she was prosecuted by the Indian police and turned into a legend (like a modern Robin Hood) by the Indian press. Although the press tended to make her the optimal hero with blue eyes, dark hair, being tall and beautiful she was in reality an average Indian which makes it hard for the movie to fulfill the expectations of the audience and tell the truth at the same time. Later in her life,She entered into the politics and was assassinated in 2001."],
      "budget": 0
   },
   "movielensId": 2284,
   "movielens": {
      "languages": [
         "",
         "हिन्दी"
      ],
      "releaseDate": "1994-09-09",
      "dvdReleaseDate": "2004-12-07",
      "directors": ["Shekhar Kapur"],
      "runtime": 119,
      "movieId": 2284,
      "title": "Bandit Queen",
      "mpaa": "",
      "actors": [
         "Seema Biswas",
         "Nirmal Pandey",
         "Rajesh Vivek",
         "Raghuvir Yadav"
      ],
      "imdbMovieId": "0109206",
      "originalTitle": "Bandit Queen",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["Vb8cRenDMOg"],
      "plotSummary": "Born a lower-caste girl in rural India's patriarchal society, \"married\" at 11, repeatedly raped and brutalized, Phooland Devi finds freedom only as an avenging warrior, the eponymous Bandit Queen. Devi becomes a kind a bloody Robin Hood; this extraordinary biographical film offers both a vivid portrait of a driven woman and a savage critique of the society that made her.",
      "tmdbMovieId": 14785,
      "avgRating": 3.70496,
      "releaseYear": "1994",
      "numRatings": 383,
      "posterPath": "/zoYg9IliZbCWYxDg4LTCnlEn7JO.jpg"
   }
}