{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "movie business",
            "id": 886
         },
         {
            "name": "weekend",
            "id": 2677
         },
         {
            "name": "violinist",
            "id": 8608
         },
         {
            "name": "filmmaking",
            "id": 33490
         }
      ],
      "imdb_id": "tt0081554",
      "video": false,
      "title": "Stardust Memories",
      "recommendations": [
         12762,
         28384,
         15867,
         22478,
         11030,
         8288,
         11561,
         30890,
         22477,
         19200,
         8217,
         11302,
         11448,
         11686,
         9684,
         10849,
         11382,
         11485,
         9689,
         5143
      ],
      "backdrop_path": "/pGQsK5kJslM8F2ZxeH9jO9qXf4V.jpg",
      "revenue": 10389003,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sandy Bates",
               "gender": 2,
               "credit_id": "52fe44299251416c7502aec7",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dorrie",
               "gender": 1,
               "credit_id": "52fe44299251416c7502aecb",
               "name": "Charlotte Rampling",
               "profile_path": "/iuggCphmBfNoUFaUWfpJCTxX4e6.jpg",
               "id": 44079,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Daisy",
               "gender": 1,
               "credit_id": "52fe44299251416c7502aecf",
               "name": "Jessica Harper",
               "profile_path": "/4W74yGyRKJJfMolXwCOlR4kUBBs.jpg",
               "id": 69055,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Isobel",
               "gender": 1,
               "credit_id": "52fe44299251416c7502aed3",
               "name": "Marie-Christine Barrault",
               "profile_path": "/bLGoQlCpi3wNEY4arTOxDcfEvo6.jpg",
               "id": 24393,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Tony",
               "gender": 2,
               "credit_id": "5461b5b00e0a2672b30018d5",
               "name": "Tony Roberts",
               "profile_path": "/iyJWLl7vKNaEnhKu0CsAu4iRgsA.jpg",
               "id": 10555,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Actor",
               "gender": 2,
               "credit_id": "5461b5b90e0a2672b60017a7",
               "name": "Daniel Stern",
               "profile_path": "/4dQb2rg4gajVuMOUTkmQx31GOyH.jpg",
               "id": 11511,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Shelley",
               "gender": 1,
               "credit_id": "5461b5cb0e0a2672b60017ab",
               "name": "Amy Wright",
               "profile_path": "/mEV42JRtrTTZg92GjyjRkQSXpsn.jpg",
               "id": 87007,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Vivian Orkin",
               "gender": 1,
               "credit_id": "5461b5dbc3a3686f2e001735",
               "name": "Helen Hanft",
               "profile_path": null,
               "id": 82487,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Jack Abel",
               "gender": 2,
               "credit_id": "5461b5e50e0a2609b6000e15",
               "name": "John Rothman",
               "profile_path": "/bRSoDm75c5fKBbCrbrXwaPiAeST.jpg",
               "id": 60205,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Pretty Girl on train",
               "gender": 1,
               "credit_id": "52fe44299251416c7502af01",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44299251416c7502aed9",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44299251416c7502aedf",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44299251416c7502aee5",
               "name": "Robert Greenhut",
               "profile_path": null,
               "id": 3658,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44299251416c7502aeeb",
               "name": "Charles H. Joffe",
               "profile_path": null,
               "id": 6993,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44299251416c7502aef1",
               "name": "Jack Rollins",
               "profile_path": "/4zEeD2lPss6tFhgGzMIdoc68VDa.jpg",
               "id": 6994,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44299251416c7502aef7",
               "name": "Gordon Willis",
               "profile_path": "/6gOmfatlF7UdhaHi2tPsZMb5vmz.jpg",
               "id": 3097,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44299251416c7502aefd",
               "name": "Susan E. Morse",
               "profile_path": null,
               "id": 10440,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.872682,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11337,
      "vote_count": 121,
      "budget": 10000000,
      "overview": "While attending a retrospect of his work, a filmmaker recalls his life and his loves: the inspirations for his films.",
      "similar": [
         44826,
         254,
         244,
         7446,
         856,
         522,
         319,
         1581,
         2294,
         14,
         509,
         4995,
         11216,
         371638,
         74643,
         11353,
         140,
         1826,
         10715,
         4234
      ],
      "original_title": "Stardust Memories",
      "runtime": 89,
      "poster_path": "/pDF2XvywB8TtPpqiTXqjddFLxQy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jack Rollins & Charles H. Joffe Productions",
            "id": 13309,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         }
      ],
      "release_date": "1980-09-26",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Woody Allen"],
      "runtime": 89,
      "synopsis": null,
      "writers": ["Woody Allen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0081554/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4NzcxMjMyMV5BMl5BanBnXkFtZTYwNzIxMDA5._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Woody Allen, Charlotte Rampling, Jessica Harper | See full cast and crew »"],
      "reviews": [
         "The problem with Woody has always been that everyone takes his movies more seriously than he does. Here, using the tactics of Felini, he makes fools of his detractors including the greatest detractor of all, Woody himself. For many reasons, I rank this among his best. He removes the restraint of plot, and just goes balls out nuts with his usual philosophical angst, and endless worship of beautiful dames. Oddly enough, without the fetters of convention, to me it was actually less pretentious or indulgent I think people like to call it, and a lot easier to understand and empathize with. One thing that I've always found absurd, and ironically what this film dwells on, is the complaints by fans and critics that he should go back to making comedies. Woody cannot not make a funny movie. If he's in it, and he's talking, I'm laughing. Especially back in this era, when his jokes were so fresh. So make no mistake, this film is loaded with comedy. Finally, I liked his choice of women in this. Charlotte Rampling is what I suppose the word breathtaking was originally meant to describe. If you arent touched by the final scenes with her, you got issues.",
         "I was very surprised to find out that Stardust Memories is dismissed by both critics (at least some of them) and viewers as absolutely unwatchable Allen's film, his most chaotic attempt to claim that he can not stand his fans. I found it insightful and witty satire that cleverly (as always; if anything, Woody is a very clever man) fuses the comic and the serious. Sandy Bates (Allen, of course) - a comic director who does not want to make funny films anymore \"because there is so much suffering in the world\" (the scene reminds so much of Sturgis's \"Sullivan's Travels\"). Sandy is depressed because his new \"serious\" film is not well received by both critics and public and he is spending a weekend at Stardust Hotel during showing of his films. While there, he reflects upon his life, art, and relationships with three different women. Sounds familiar? Like 8 1/2, anyone? You are absolutely right. Woody meets Federico in the Stardust Hotel. The film is delight in gorgeous black and white. It is funny, touching, angry - all in the same time. The film was made twenty four years ago and I am very happy that Sandy - Woody had realized that to help the world IS to do what you do the best - funny movies. \"The people survived because they laughed\". One more thing - Charlotte Rampling is breathtaking. 9.5/10",
         "Reading some of the comments listed here, I'm dismayed by some of the narrowness of the criticisms (\"It's shot in black & white for no reason!\" \"The flashbacks are indistinguishable from the present day!\")... as if these were somehow to be construed as mistakes. Jeez. I love this film. It rambles a little here and there, and sometimes it's so personal I feel voyeuristic watching it. The montage of Charlotte Rampling towards the end is stunning in how it summarizes Allen's feelings about memory, nostalgia, and the ever-present reality that never seems to allow the past to make sense. One cannot deny that Allen has a very keen understanding of who he is, as a person, comedian, and lover. This is not to say that he is infallible or somehow more evolved than anyone else, but rather - through the retrospective of his \"earlier funny films\" - it's clear that he understands his strengths, and - outside the theatre - the weaknesses of his emotional life. A perfect film for a quiet Sunday.",
         "It seems that Stardust Memories does not get the credit that it truly deserves. Everyone has such distaste for this film because they thought that this was an autobiography and it was Woody's attack on his fans/critics. Woody himself has said many times that this is not the case, but even if it were, I believe that the fans/critics deserve to be lowered down a peg. After all, Woody's interpretation of his fans (via Fellini's style of awkward and hilarious faces) is valid. Fans and critics alike should never have verbally abused him so much after the release of Interiors (1978). Why should directors be type-casted? Let him have his freedom! After all, Interiors wasn't such a bad movie. It was different, but not bad. Stardust Memories has also been accused of Woody's most self-indulgent film, but this is an outrage. All of Woody's films have something to do with his personal life, but if he had casted someone like John Cusack as Sandy Bates, then everyone would have stopped complaining about it's self-indulgence and start understanding how much of a creative genius Woody Allen is. Overall, Stardust Memories will be one of his films that lasts; but only time will tell.",
         "While this film doesn't get the praise and respect of, say, \"Annie Hall\" or \"Manhattan,\" I think it is a brilliant look into the mind of a film director. How much of Woody Allen is Sandy Bates? Some, I'm sure, but I think it's more interesting to compare Sandy to Woody Allen's \"persona\"--that is, who the public thinks he is. The structure of the film is also quite interesting to me. Allen had done a very non-linear story structure, mixed with occasional flights of fantasy, in \"Annie Hall,\" but \"Stardust Memories\" does that and piles on a movie within a movie within a movie, and manages to both comment on all that, at the same time as he's telling the story of the brilliant, but self-absorbed Sandy Bates. A great movie, that you probably should see more than once to appreciate.",
         "Only a filmmaking genius like Woody Allen could bring such viable characters to the screen with such life and perception. Allen (who also scripted) is Sandy Bates, an acclaimed, world-reknowned director who attends a weekend festival honoring his works. When he's not being bombarded by mobs of autograph hounds and PR people, he takes time to reflect on himself and the three diverse women in his life: drug-abusing actress Dorrie (Charlotte Rampling), wistful violinist Daisy (Jessica Harper, who also appeared in Allen's \"Love and Death\" (1975)) and French housewife Isobel (Academy Award-nominee Marie-Christine Barrault). Loaded with the crisp dialogue that we've come to expect from Allen (Best line: \"I would trade that Oscar for one more second of life\"), \"Stardust Memories\" is noticably one of Allen's most personal films. Also, what makes \"SM\" unlike his other works, where his characters do a lot of interacting, the film's focus is mainly on Allen (most beautifully) interacting with himself mentally. Sharon Stone has a bit part in the beginning as a train passenger. Gordon Willis' cinematography is gorgeous. ***1/2 of ****.",
         "...and, in Sandy Bates, the lead of his satire on celebrity, loves, and his usual themes of turmoil over life and death, is a sense that Woody Allen is doing one of two things (or both perhaps)- taking from his own life and thinly disguising characters and situations, or using his own public image in film's culture to look through the looking glass slightly at some of his popular themes. This is not to say that the film is one of his very best. I could see what Allen was doing, for example, with the scenes and instances of tipping the hat to Fellini and his masterwork 8 1/2- the two films share that common thread of an artist in an overall funk of bittersweet memories and creative confusion. But while Fellini made his film out of a burning need to reveal all of his love for cinema out of his angst(s) after La Dolce Vita, Allen's track record shows that he's near incapable of waiting around too long to make a film (he's averaged nearly a film a year in 37 years up till 2003) so much of what comes forth in Stardust Memories isn't as much autobiographical as it is told through a character filtered with and not with himself. In short, a lot of the 8 1/2 dues were my least favorite parts in the movie (though I did like the quick Superman-type mementos). But does that make Stardust Memories a failure, pretentious? Not to my point of view- once Allen starts the story rolling, and he gets his characters/actors into the gist of the film, it goes along like most other Allen films involving phobias, fears, loves (women), and sophisticated sense of varied parody. There are moments that Allen's stand-up act is injected into the mix, or a scene that could've been a chapter from one of his books, but mostly the audience gets the sense of his OWN love of cinema via Sandy Bates. Bates is another one of those Woody characters that seems all the more impressively formed and executed since it feels like the Woody we know, but Bates is just a little more on the edge of satire, viewing into his own self-doubts and trying to see if there can be any hope or meaning to it all- or if he can tell funny jokes. The script contains some of the most memorable moments of Allen's career in one-liners (there are a few from the fans and autograph-hounds that stick out) and in having a natural flow, close to a type of poetry, in the conversations and dialog in the film. Even if one doesn't laugh, it definitely shows the work of a wonderful writer at the peak of his game. His direction is also intrinsically interesting, especially how he uses the unique, dark, and evoking cinematography by the great Gordon Willis, and the unusual editing stylizing by Susan Morse (though, once again, some of these editing tricks are to Fellini's credit). And the performances work well enough for the material, more often than not, with Charlotte Rampling as Dorrie, Bates' wonderfully stressed ex-girlfriend, Marie-Christine Barrault as Isobel, an old friend who left her husband for him, Jessica Harper as Daisy, whom he falls head over heels for while she and her professor-boyfriend are at the Stardust attending Bates' appearance(s), and Tony Roberts, who had a worthy supporting role in Annie Hall, pops up here as well. I can recommend Stardust Memories for Woody Allen's main fan base, as it gives those who love his early films and his films that have more mature subject matter a bit of a (delightful) challenge. I don't know if I could recommend it however, as the very first film someone could see if the person wants to start of his films. There is an amusing quality to it that could give non-Woody fans a second thought about the filmmaker's work, but it's hard to say. It's not an altogether easy film to watch, or is it a masterwork like Manhattan. By the end of it, never-the-less, my time was not the least wasted, I knew I saw some ingenious scenes and jokes here and there, and there was a subtlety to it that has me liking it and responding more to it on repeat viewings. Is it homage? Sure, but it's a blend of homage (or as Roberts says \"ripping it off\") and a personal, nearly original style, and it ends up, on a repeat viewing, a major work. 9.5/10",
         "In my opinion, Stardust Memories is Allen's greatest achievement. The film perceptively explores the relationships between art and reality, between the artist and his work, between the work and its consumers. Beyond its philosophic concerns though, this is also an incredibly funny film. There are more genuinely funny moments within this serious film than in many of Allen's earlier pure comedies. It skewers the movie industry, the movie-going public, Allen's own earlier work, Allen's present insecurities (surprise!), and a number of other targets. Intelligent, thought provoking, and at times hilarious, this film is an overlooked gem in the Allen canon.",
         "Contrary to popular and critical opinion, this is Woody Allen's Best film. Yes, better than Manhattan or Annie Hall and all the others (about 30 i think). It is his best film because it is his most truthful, and it's angry. Critics dont like it because it attacks critics. But it is inventive, brillantly imaginative and purely cinematic, the narrative is almost non-existent and the film is really feelings put onto celluloid, in this sense it is a very PURE film, and probably autobiographical. Although no doubt Allen would deny this! I love the off-beat characters , and its also a very atmospheric film. I have seen about 25 Woody Allen films and think this is the most honest of them all.",
         "This is, i would say, not only woody allen's greatest movie, it is also my favourite film ever, by anyone. i've gotten more from this film every time I've watched it, over the years - which is many times - & i've found something different & new on each occasion. This glowing recommendation doesn't, by the way, mean i am a rabidly undiscerning woody allen fanatic. i don't think he's made even a decent film since deconstructing harry - another great film inexplicably reviled upon its release - & the 'early, funny' films i have always found dull & juvenile. What is great about woody allen - & this is still what the majority of the critics seem invariably to miss - is that only Chaplin before him mixed tragedy, comedy & pathos so perfectly (leading to the maxim in the movie industry that 'only woody can do woody'). It is this that is Allen's great gift, all his most perfect films are aglow with this sublime anomaly, & it is these films that people will still be watching fifty or a hundred years from now. For the record, the films you really & truly need to see by woody allen are these: Annie Hall. Stardust Memories. Manhattan. Hannah & Her Sisters. Crimes & Misdemeanours. Deconstructing Harry. Zelig is good too, if a little slight, as is Broadway Danny Rose. of the earlier, \"funny\" films, Sleeper & Love And Death are by far the best. And of the films he directed but not appear, Sweet & Lowdown is probably the best, though Purple Rose of Cairo also deserves an honourable mention. This film, Stardust Memories, will haunt you, enrich & nourish your life for years to come. Check it out! And tell your friends!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Rollins-Joffe Productions"],
      "summaries": [
         "Sandy Bates, a successful filmmaker, attends a festival conducted to honor his work. During the course of the weekend he reconsiders his cinematic accomplishments as well as his past relationships.",
         "A director named Sandy Bates is a man who simply doesn't want to make goofball comedies anymore, and it seems that the comedies are all that society wants from him. He's unhappy at the moment because his first \"serious\" film isn't well received by the public. He decides to stay a weekend at a hotel to reflect upon his life, body of work, and relationships of the past while a festival showcasing his films is occurring. Meanwhile, he encounters groups of his fans who ask for autographs, compliment him on his \"early funnies\", his style of filmmaking, and he encounters a beautiful woman named Dorrie, with whom he falls in love.",
         "While attending a retrospect of his work, a filmmaker recalls his life and his loves: the inspirations for his films."
      ],
      "budget": 10000000
   },
   "movielensId": 2290,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-09-26",
      "dvdReleaseDate": "2000-07-05",
      "directors": ["Woody Allen"],
      "runtime": 89,
      "movieId": 2290,
      "title": "Stardust Memories",
      "mpaa": "",
      "actors": [
         "Woody Allen",
         "Charlotte Rampling",
         "Jessica Harper",
         "Marie-Christine Barrault",
         "Tony Roberts",
         "Daniel Stern",
         "Amy Wright",
         "Helen Hanft",
         "John Rothman",
         "Sharon Stone"
      ],
      "imdbMovieId": "0081554",
      "originalTitle": "Stardust Memories",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "wGpTIi2OxNY",
         "sKLs8p9AOjc"
      ],
      "plotSummary": "While attending a retrospect of his work, a filmmaker recalls his life and his loves: the inspirations for his films.",
      "tmdbMovieId": 11337,
      "avgRating": 3.50448,
      "releaseYear": "1980",
      "numRatings": 1115,
      "posterPath": "/pDF2XvywB8TtPpqiTXqjddFLxQy.jpg"
   }
}