{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "unfaithful girlfriend",
            "id": 11497
         }
      ],
      "imdb_id": "tt0117276",
      "video": false,
      "title": "Overnight Delivery",
      "recommendations": [
         47475,
         18621,
         33374,
         41127,
         157036,
         59232,
         38554,
         26486,
         21536,
         20053,
         143547,
         42371,
         33506,
         26626,
         31220,
         17362,
         14484,
         25269,
         151506,
         82432
      ],
      "backdrop_path": "/jJg1RRDEE2KwfoZD8kXwYCvPAIj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Wyatt Trips",
               "gender": 2,
               "credit_id": "52fe44d9c3a368484e03a531",
               "name": "Paul Rudd",
               "profile_path": "/8eTtJ7XVXY0BnEeUaSiTAraTIXd.jpg",
               "id": 22226,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kimberly Jasney",
               "gender": 1,
               "credit_id": "52fe44d9c3a368484e03a535",
               "name": "Christine Taylor",
               "profile_path": "/99OssnGmgGjduXFA7syxjNqt9tQ.jpg",
               "id": 15286,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ivy Miller",
               "gender": 1,
               "credit_id": "52fe44d9c3a368484e03a539",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Turran",
               "gender": 1,
               "credit_id": "52fe44d9c3a368484e03a541",
               "name": "Sarah Silverman",
               "profile_path": "/arNzJUPRCMx3n2NSpa5vuCio3yB.jpg",
               "id": 7404,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Overnight Delivery Boss (scenes deleted)",
               "gender": 2,
               "credit_id": "59713c07c3a36816080097d7",
               "name": "Jim Belushi",
               "profile_path": "/AplV1ikSo3Zn93hhy5ht7Y7sQio.jpg",
               "id": 26485,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Marita",
               "gender": 1,
               "credit_id": "58160820c3a3686db400d27d",
               "name": "Tamara Mello",
               "profile_path": "/xYEvziWM0OpyktDS0FzbRzviSQa.jpg",
               "id": 102313,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Hal Ipswich",
               "gender": 2,
               "credit_id": "52fe44d9c3a368484e03a53d",
               "name": "Larry Drake",
               "profile_path": "/m7NbC0TyREs2kD63ByL0bSPjHHj.jpg",
               "id": 16476,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a368484e03a547",
               "name": "Jason Bloom",
               "profile_path": "/fvQhQqGnf4cBq60FiLjeKWvvAqD.jpg",
               "id": 57870,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a368484e03a54d",
               "name": "Marc Sedaka",
               "profile_path": null,
               "id": 179519,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d9c3a368484e03a553",
               "name": "Steve Bloom",
               "profile_path": null,
               "id": 56514,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.038706,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 25723,
      "vote_count": 31,
      "budget": 12000000,
      "overview": "A man suspects his girlfriend of being unfaithful. So he sends her a letter, but than finds out that he was wrong. He has 24 hours to stop the package, prevent a disaster, and fall in love. The only problem is the delivery man will not stop until the package has been delivered.",
      "similar": [
         19913,
         13523,
         24420,
         1259,
         276,
         1024,
         1903,
         50544,
         862,
         38,
         1628,
         1643,
         316021,
         16980,
         44564,
         17612,
         38050,
         50546,
         46705,
         13
      ],
      "original_title": "Overnight Delivery",
      "runtime": 87,
      "poster_path": "/eaQDlBPTdvgWkr7jxzlKd5pBd4u.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Motion Picture Corporation of America (MPCA)",
            "id": 11061,
            "origin_country": ""
         }
      ],
      "release_date": "1998-04-07",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "They've got 24 hours to stop a package, prevent a disaster, and fall in love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jason Bloom"],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Marc Sedaka",
         "Steve Bloom"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117276/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxNzkyMTk5N15BMl5BanBnXkFtZTcwMjkxMzQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Rudd, Christine Taylor, Reese Witherspoon | See full cast and crew »"],
      "reviews": [
         "After Freeway and Fear movies the leading role actress Reese Witherspoon shines with a joyful, extrovert and really charming character performed as Ivy Miller. Acting with Paul Rudd performed as Wyatt Trips, she is the girl striving for making her Prince charming aware of her. Christine Taylor performed as Kimberly is a famous cheerleader in their campus, dating with Wyatt. One day, Wyatt turns very jealous by a message from her and then starts to worry about his life as if it is coming to an end. Wyatt's friends help him forget her if she's cheating on him. That night in a dance club, a stripteaser girl named Ivy Von \"Trap\", alters Wyatt's philosophy of life through destroying his friends' ego. There comes a fight between Ivy and Wyatt's campus gang. This bonds Ivy and Wyatt as friends, after Wyatt forsakes his friends at the fight. Ivy tells the secrets of relations and the nonexistence of love to Wyatt by use of a cult speech. Then it becomes hard for Wyatt to realize the love of Ivy, if he can't rescue his heart from loving Kimberly hopelessly. Then by time a wonderful adventurous love is getting started by Kimberly's letter from Memphis. How a puzzle is this, you can't believe. While Wyatt wants to stop a package from delivery full of Ivy's ideas of good-bye speech that has been sent to Kimberly, there starts the road trip from Minneapolis to Memphis. At the end on the Valentines' Day in Memphis which one will be chosen by Wyatt, Ivy or Kim ? At the ending Wyatt becomes Tarzan to stop the delivery guy, and also becomes a prayer: \"Dear God, I swear that I will never send any more package via Overnight Delivery again!\"",
         "This film was one of those that you will watch because there is nothing better on the television and it just draws your attention. I saw this movie during a free Showtime weekend. I enjoyed this film very much. It was amusing, funny, and had a good storyline on how a boyfriend goes from Minnesota to St. Louis to get a hold of a revenge package that he sent her, with the help of a new friend. I suggest that if you have the chance watch this movie. It will end making you happy.",
         "This is a warm, fun little movie that deserves a lot more exposure than it has received. If you don't mind a little spicy dialogue (and what thinking person does?) it's a great film for movie night with your teens. What I especially enjoyed about \"Overnight Delivery\" was the superb casting of three terrific stars (Reese Witherspoon from \"Cruel Intentions\", Paul Rudd, whom I really enjoyed in \"Clueless\" and Christine Taylor, whom most people will remember as Marcia in \"The Brady Bunch Movie.\") Also memorable are the ongoing appearances of a bumbling but hilariously lovable delivery man. Not a flick to be missed.",
         "This movie was surprisingly good. It's not the best-written or most original idea, but the comedy is surprisingly good. Also, Paul Rudd and Reese Witherspoon have great chemistry on-screen, and their comedic delivery is superb. The mail-truck driver is funny, as well. Not to mention that it's got Christine Taylor (you might know her from \"The Wedding Singer\", \"Zoolander\", or \"Dodgeball\"). In the end, it's one of those movies that you'll probably only watch when you have nothing else to do. So the next time you're really bored and have nothing to do, watch this movie- I think you'll be pleasantly surprised.",
         "I like watching a movie without expectations, but this love-comedy was well worth the time. I watched this movie only because it had Reese Witherspoon in in, who I am becoming more and more impressed with, particularly in comedies. She steals the scenes in this movie, and is the catalyst for all that happens. It is a surprisingly funny and good movie. Reminds me of Blood Simple (for all the weird things that keep happening) and Planes, Trains, and Automobiles (for all the weird things that keep happening). Not a well orchestrated movie, because things are somewhat disjointed (she takes him to the airport, but drops him off at the downtown convention center (reality mistake) and no reason for the cops to be there as they attempt to leave the restaurant after not paying (movie mistake)), but the acting is good and when the writing is right, it is very good.",
         "This is a funny romantic comedy with some laughs. The movie is held together by the cute and sexy Reese Witherspoon. Her performance makes the movie worth seeing. Paul Rudd gives a good showing also. I would recommend seeing this movie if you are bored one night.",
         "I really liked this film. Its really fun and amusing and definatly better than alot of similar teen comedies like 'Loser' and 'She's all That' which are better known and got released at cinemas. Rudd and Witherspoon are both very likeable, while the film has a good sountrack and is short so as not to become tiresome. Jokes mostly hit the mark and there are a few which are very 'Kevin Smith-esq', obviously remaining from his much edited original script. If you want to watch a largely harmless, light hearted, and above all a cute and funny teen romance then you could do alot worse than give this one a rent if you can find it. Rating: 6.5/10",
         "Two shrill, obnoxious, and utterly unappealing characters bicker while travelling cross-country, which means (of course) that they must get together in the end. The writers managed to write a script that's degrading to both sexes. This movie makes a well-executed bit of fluff like _The Sure Thing_ look like Oscar material in comparison.",
         "This excuse for a movie makes A Life Less Ordinary seem like Gone With the Wind! Paul Rudd, likeable in Clueless, is a complete disaster as a toal nutcase obsessed with stopping an overnight delivery man. His overacting was not only sordid and unfunny but, in my opinion, an embarrassment to American filmmaking. Reese Witherspoon is a great help in contributing to the worst movie of the year, giving the least appealing performance i've seen her give. This movie should be banned from our society! You listening out there??",
         "How do you mess up a sure fire romantic comedy formula acted out by talented young actors? By making the characters completely idiotic and more importantly unlikable. Only thing that kept me from giving it a one was Reese Witherspoon. She's got charisma. Paul Rudd has it too, but the script wouldn't allow it to shine through. Don't bother with this one unless you're into mind numbing crap and wasting an hour and a half of your time thinking about how much better this movie could've been. You're better off checking out 40-year Old Virgin where Rudd plays a similar whining character but comes off as much more sincere, tongue in cheek, and actually funny. The physical comedy was a nice idea but seems a little misplaced and does nothing to distract from the incredibly crappy overly obvious dialogue. In fact, I recommend watching this movie with the sound off. The setups are completely obvious so you won't have any trouble following it and you'll get more laughs from Rudd's spastic facial expressions. If you want a good romantic road comedy with some smart, funny dialogue and God forbid, likable characters, try The Sure Thing."
      ],
      "genres": [
         "Romance",
         "Comedy"
      ],
      "productionCompanies": ["Motion Picture Corporation of America (MPCA)"],
      "summaries": [
         "A man suspects his girlfriend of being unfaithful. So he sends her a letter, but than finds out that he was wrong. He has 24 hours to stop the package, prevent a disaster, and fall in love. The only problem is the delivery man will not stop until the package has been delivered.",
         "After learning his girlfriend, Kim, is cheating on him, an under-grad college student, Trips, sends a breakup letter to her with a fake \"used\" condom and a topless picture of him and his stripper friend, Ivy. After learning he was wrong, he tries to stop the letter. He has to face a hostage situation, a psychotic delivery man, and many miles to drive to his girlfriend with Ivy. But, will he fall for Ivy instead of Kim?"
      ],
      "budget": 12000000
   },
   "movielensId": 2292,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1998-04-07",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Jason Bloom"],
      "runtime": 87,
      "movieId": 2292,
      "title": "Overnight Delivery",
      "mpaa": "PG-13",
      "actors": [
         "Paul Rudd",
         "Christine Taylor",
         "Reese Witherspoon",
         "Sarah Silverman",
         "Jim Belushi",
         "Tamara Mello",
         "Larry Drake"
      ],
      "imdbMovieId": "0117276",
      "originalTitle": "Overnight Delivery",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["i-MBOAE7Nls"],
      "plotSummary": "A man suspects his girlfriend of being unfaithful. So he sends her a letter, but than finds out that he was wrong. He has 24 hours to stop the package, prevent a disaster, and fall in love. The only problem is the delivery man will not stop until the package has been delivered.",
      "tmdbMovieId": 25723,
      "avgRating": 2.92857,
      "releaseYear": "1998",
      "numRatings": 203,
      "posterPath": "/eaQDlBPTdvgWkr7jxzlKd5pBd4u.jpg"
   }
}