{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "slavery",
            "id": 2831
         },
         {
            "name": "law",
            "id": 3703
         },
         {
            "name": "racial segregation",
            "id": 6984
         },
         {
            "name": "slave",
            "id": 14906
         },
         {
            "name": "virginia",
            "id": 160977
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0144604",
      "video": false,
      "title": "Shadrach",
      "recommendations": [],
      "backdrop_path": "/6nJOZNTV98KDzynnMfSSQGItVMQ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Vernon",
               "gender": 2,
               "credit_id": "52fe4897c3a368484e100f25",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Trixie",
               "gender": 1,
               "credit_id": "52fe4897c3a368484e100f21",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Narrator (voice)",
               "gender": 2,
               "credit_id": "52fe4897c3a368484e100f2d",
               "name": "Martin Sheen",
               "profile_path": "/ve77Q75moQhoB6cxdMfigfrHeTA.jpg",
               "id": 8349,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Shadrach",
               "gender": 0,
               "credit_id": "52fe4897c3a368484e100f29",
               "name": "John Franklin Sawyer",
               "profile_path": null,
               "id": 1142280,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe4897c3a368484e100f43",
               "name": "Scott Terra",
               "profile_path": "/4mXaoogOk48PNVqcCjkXAL7zea8.jpg",
               "id": 56153,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Virginia",
               "gender": 0,
               "credit_id": "547f5e32c3a3683d940000e3",
               "name": "Ginnie Randall",
               "profile_path": null,
               "id": 80780,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4897c3a368484e100f33",
               "name": "Susanna Styron",
               "profile_path": null,
               "id": 201278,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4897c3a368484e100f39",
               "name": "Hiro Narita",
               "profile_path": null,
               "id": 2116,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4897c3a368484e100f3f",
               "name": "Van Dyke Parks",
               "profile_path": null,
               "id": 58099,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4897c3a368484e100f49",
               "name": "William Styron",
               "profile_path": null,
               "id": 1061481,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4897c3a368484e100f4f",
               "name": "Susanna Styron",
               "profile_path": null,
               "id": 201278,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4897c3a368484e100f55",
               "name": "Bridget Terry",
               "profile_path": null,
               "id": 1051825,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.273456,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 73351,
      "vote_count": 4,
      "budget": 0,
      "overview": "In 1935, 99-year-old former slave Shadrach asks to be buried on the soil where he was born to slavery, and that land is owned by the large Dabney family, consisting of Vernon, Trixie and their seven children, and to bury a black man on that land is a violation of strict Virginia law.",
      "similar": [
         967,
         858,
         112160,
         141,
         98,
         634,
         242224,
         258480,
         43923,
         205601,
         12437,
         297762,
         437557,
         27586,
         2771,
         9587,
         3134,
         11236,
         13075,
         9813
      ],
      "original_title": "Shadrach",
      "runtime": 89,
      "poster_path": "/ll0OF0HyXuPrSBf5R0UfdMfQ9Au.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Millennium Films",
            "id": 10254,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nu Image Films",
            "id": 925,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tidewater Pictures Inc.",
            "id": 40244,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-22",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Susanna Styron"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "William Styron",
         "Susanna Styron"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144604/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4OTYyNzc4M15BMl5BanBnXkFtZTcwMTM1NDMzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Martin Sheen, John Franklin Sawyer, Scott Terra | See full cast and crew »"],
      "reviews": [
         "This beautiful story got overlooked somewhere; what you call a 'sleeper'. Most certainly undeservedly, as this is indeed a wonderful film. One could say that 'Shadrach' is an 'amateur' production, as most of the cast and the director Susanna Styron had not made any other films previously. Albeit the inclusion of very well-known names in the cast such as Martin Sheen (invisible narrator), Andy MacDowell and Harvey Keitel, who must be considered the 'professionals' in the whole enterprise. Hiro Narita's photography is excellent, capturing the essence of rural Virginia and the sweat on the actors' faces in all kinds of light. The music is correct lending great atmosphere to the development of the film. I cannot remember Harvey Keitel in a better role: here he is a convincing poor Virginian trying to eke out a living selling a few bottles of illegal whiskey, father of seven children. No overacting: nicely controlled interpretation of a simple rough type with a bit of good heart. Commendable performance. Andy MacDowell is not bad, though how she could possibly have such a good-looking sexy figure after seven children escapes all reason! And the old man of the film: John Franklin Sawyer, aged 91 when this film was shot, the only film he has ever been in, is magnificent: you really feel for this old man as the film progresses and you empathise with his desire to return to the soil that saw him born. Wonderful, but without being a soppy tear-jerker. A sober feat, brilliantly handled. Scott Terra and Ginnie Randall give authentic performances. All this points a finger at Susanna Styron: masterful directing, comparable with other masters of greater experience. She knew how she wanted to develop the characterization of her actors, and the result is extremely satisfying. She knew how she wanted those old cars to appear, and how the little old houses should appear. A great accomplishment. This is because from this 'amateur' production, it is clearly evident the amount of effort and loving care with which everyone concerned were bent on so as to make this beautifully told story be so warm and human. If you have the luck to find this film on any channel or on video, do not miss it: this film is richly rewarding. It deserves to be far better known than it is. My vote is a high seven out of ten.",
         "I've read quite a few reviews here and at other sites, and this movie sure seems to be taking its lumps (although I did read some favorable reviews). I don't know, though -- I rather liked it. It is a simple and straightforward story. It is certainly sentimentalized to some extent, but I am not one of those people for whom that is anathema. Despite its hard times, depression-era setting and poor white trash characters, there is a certain amount of idealization in the film. My gut feelings are that in real life Mr. Dabney, being a product of his time, would be more hard-hearted towards old Shadrach. Andie MacDowell is likeable as Mrs. Dabney, but she looked far too healthy and aerobically svelte to be the beer-guzzling alcoholic mother of a large, unwashed, lice-infested family living below the poverty level. Just having her clutch a beer bottle in almost every scene didn't quite pull off the illusion. Despite its simplification of complex social issues, its idealization of human nature fondly remembered in old age left me with kind of a warm fuzzy feeling. Some reviewers have rated \"Shadrach\" as being of \"TV movie\" quality, but I think a vice common to many TV movies is avoided here. Namely, trying to deal with tough, complex issues comprehensively in 90 to 120 minutes. The story is scaled down to its essence, and as such is nicely handled in an hour and a half. While Shadrach himself is sort of an enigma, trying to tell the story of his 99-year-long life in any sort of satisfying way could have expanded the film to epic, miniseries length. A film which touches on the issue of slavery in America, even obliquely, is bound to leave a certain amount of people unsatisfied if it does not proceed to rail at length about Man's inhumanity to Man. I just don't think that was the point of the film, though, and no film can satisfy everyone's expectations. I just see this as a sweet, sentimental, (and sure, rather unrealistic) view of events in a certain time and place, as seen through the eyes of a child. The fact that in a dream sequence young Paul sees Shadrach being presented with a Micky Mouse watch in the middle of the 19th century illustrates that we are seeing a child's-eye view of this story. I liked \"Shadrach\" enough to buy the video, and I think it's gotten sort of a bum rap.",
         "How refreshing it is to see a movie about northeastern North Carolina-southeastern Virginia that could actually have been filmed in the area and that features people who could actually have lived here! Well, it was a bit hard to believe that after living a hard life and birthing that many children, Andie McDowell's character would still look young, thin, and pretty. If I thought it would make me look like that, I'd take up drinking beer. Amazingly, Harvey Keitel is believable as the irascible father, and his accent is even tolerable. Perhaps what is amazing is his versatility as an actor, since he was also believable as Baines in \"The Piano,\" Auggie in \"Smoke\" and \"Blue in the Face,\" the police detective in \"Thelma and Louise,\" and all those heavies in all those gangster films. What should you expect if you view this film? A glimpse at what this part of the world looked like before WWII and farm-to-market roads and typhoid shots and birth control; a child's-eye view of growing up in a rural family in the Depression; a story about doing what's right. I liked it.",
         "I feel sorry for anyone who didn't like this movie. It's probably one of the best I've seen. Harvey Keitle played his part perfectly, right down to the accent. His character tried to give the impression that he was a hard man, but I really believe he was as soft hearted as his little girl. He just was ashamed to admit it. His rough tenderness made its self apparent in the last part of the movie, when he announces that Shadrachs wish would be granted. This is a movie I'd recommend for almost anyone. I think parents should be discreet when letting children watch it, because it does contain some rather unacceptable language. The language has it's place in the movie, but you still might not want your kids hearing it. Actually, death ain't much",
         "In the South I grew up in, many if not most Whites viewed Blacks paternally, they weren't at all rabid lynchers. They felt a responsibility for their employees and families. The Dabneys are an old tidewater plantation family that fell on hard times after the Civil War and moved to North Carolina but have managed to hold on to the old Virginia property. Shadrach, a former slave who was sold south by Dabney's grandfather around 1860, just before the war, shows up at the Dabney's Wilmington NC house, having walked there from Alabama. He wants to be buried on Dabney land. The story takes place about 1935, making Shadrach close to 90 years old. The Dabneys honor Shadrach's wishes because they have to. This adaptation hews pretty closely to Styron's short story until the second half, when a plot element is added to create a conflict and to stretch the story. Unfortunately, the reason given is invalid. Virginia is full of old family plots on private land, and as long as the owner of the land consents, anyone can be buried there. This is still a good, small film, and the portrayals are dead on, especially Andie MacDowell. I think every one of us who comes from the South knew the Dabneys.",
         "A great movie based on the short story by William Styron, himself a native of the Virginia Tidewater, where the movie and story take place. I found the film very moving and accurate in its depiction of eastern Virginia during the Depression era-Styron based the short story on an actual childhood experience of his. Also I found the scenery and way in which it was composed especially noteworthy. The setting was just perfect and outstanding in every regard (ancient Live Oak and Cypress trees). All in all, a very good film, good effort was put into it and it shows.",
         "Expanded from the short story of the same name from the little book \"A Tidewater Morning\" by William Styron, Shadrach is a wonderful film. If you haven't read the short-short story, you are in for a treat. When we are young, we feel a pull to leave; when we are old we are pulled back to where we came from. To walk from Alabama to Virginia to be buried where you grew up. A 100 year old former slave. That's a story.",
         "Scott Terra is one of my favorites. This movie here is a very good one, and he plays a substantial role. The story is fairly simple, but it is the fine cast and the cultural burden of how to deal with an old slave that adds a sincere message to the plot. Harvey Keitel plays - apart from Scott - a significant character. The messages of doing the right thing, of confronting the legacy of our cultural past and of dealing with death and the brittleness of life, mingled with the many calm and quiet sequences of the movie, make it a valuable example of emotional and sophisticated film-making. Scott is in the center, and he comes to experience both the tragedies and the magical moments of life, symbolized by the events of one summer's experiences.",
         "The acting in this film is first rate. Keitel and McDowell are both superb, as are most of the supporting performers. Unfortunately, the rest of the film doesn't quite live up to their talent. The plot is too small, too contrived, and the actions by Keitel are in contradiction to his characterization. Although it has its moments and is a gentle little film that can help you pass a couple of hours, it won't stick with you and it's not nearly as heart-warming or touching as the blurb on the box would lead you to believe! More likely, as it ends you'll shrug and say, \"Oh well, that was okay.\" Of course, I kept thinking about how typically American the film was. Only in this country would a coarse, poverty stricken, beer-guzzlin' mountain woman be played by the gorgeous Andie McDowell!",
         "I was a bit surprised with the quality of this movie. I was only going to watch it due to Andie MacDowell being on it, but even the kid actors did a fine job. Certainly a drama movie worth watching. If you like drama movies, go rent this one, if only to see Andie in a different kind of role than usually. Nothing romantic about her character ;)"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Millennium Films",
         "Nu Image Films",
         "Tidewater Pictures Inc."
      ],
      "summaries": ["In 1935, 99-year-old former slave Shadrach asks to be buried on the soil where he was born to slavery, and that land is owned by the large Dabney family, consisting of Vernon, Trixie and their seven children, and to bury a black man on that land is a violation of strict Virginia law."],
      "budget": 0
   },
   "movielensId": 2293,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-22",
      "dvdReleaseDate": null,
      "directors": ["Susanna Styron"],
      "runtime": 89,
      "movieId": 2293,
      "title": "Shadrach",
      "mpaa": "PG-13",
      "actors": [
         "Harvey Keitel",
         "Andie MacDowell",
         "Martin Sheen",
         "John Franklin Sawyer",
         "Scott Terra",
         "Ginnie Randall"
      ],
      "imdbMovieId": "0144604",
      "originalTitle": "Shadrach",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "NuG4c-6EsAA",
         "iJ5-vxa1-7o"
      ],
      "plotSummary": "In 1935, 99-year-old former slave Shadrach asks to be buried on the soil where he was born to slavery, and that land is owned by the large Dabney family, consisting of Vernon, Trixie and their seven children, and to bury a black man on that land is a violation of strict Virginia law.",
      "tmdbMovieId": 73351,
      "avgRating": 3.35057,
      "releaseYear": "1998",
      "numRatings": 87,
      "posterPath": "/ll0OF0HyXuPrSBf5R0UfdMfQ9Au.jpg"
   }
}