{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "stowaway",
            "id": 3622
         },
         {
            "name": "theatre play",
            "id": 4326
         },
         {
            "name": "ocean liner",
            "id": 4953
         }
      ],
      "imdb_id": "tt0120823",
      "video": false,
      "title": "The Impostors",
      "recommendations": [
         22588,
         79008,
         27465,
         27047,
         116014,
         20983,
         41313,
         47107,
         16814,
         40562,
         25796,
         63622,
         76080,
         139383,
         20468,
         9977,
         106121,
         26797,
         34600,
         21381
      ],
      "backdrop_path": "/eO6lGomxfiHIYjSK0EWvNTnOyyb.jpg",
      "revenue": 2197921,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Maurice",
               "gender": 2,
               "credit_id": "52fe457bc3a368484e05df1f",
               "name": "Oliver Platt",
               "profile_path": "/an9n3aUKFAN50GDsbqwIkvWlcus.jpg",
               "id": 17485,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Arthur",
               "gender": 2,
               "credit_id": "52fe457bc3a368484e05df23",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Voltri, First Mate",
               "gender": 2,
               "credit_id": "52fe457bc3a368484e05df27",
               "name": "Tony Shalhoub",
               "profile_path": "/jXzlVxS8u64XEZUoNPiuhGcQXDW.jpg",
               "id": 4252,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Happy Franks",
               "gender": 2,
               "credit_id": "52fe457bc3a368484e05df2b",
               "name": "Steve Buscemi",
               "profile_path": "/ieDyVKnQHo7eMGu1GOE7YYr2Fk4.jpg",
               "id": 884,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "The Veiled Queen",
               "gender": 1,
               "credit_id": "52fe457bc3a368484e05df2f",
               "name": "Isabella Rossellini",
               "profile_path": "/yKnom6aUaP17Z49mypVZmq1jdjH.jpg",
               "id": 6588,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Mr. Sparks, the Tennis Pro",
               "gender": 0,
               "credit_id": "52fe457bc3a368484e05df33",
               "name": "Billy Connolly",
               "profile_path": "/7e1rVdJah2r0DaMpovrhbR2dHPS.jpg",
               "id": 9188,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lily 'Lil'",
               "gender": 1,
               "credit_id": "52fe457bc3a368484e05df37",
               "name": "Lili Taylor",
               "profile_path": "/pIJ4Enx6kIC9srLkDfGpEzfNlDZ.jpg",
               "id": 3127,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "5676b155c3a368168b00574e",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 1,
               "credit_id": "5676b17792514179d4005b57",
               "name": "Elizabeth Bracco",
               "profile_path": "/wjubjA4eLOA7iwVF9LyyRZlY57p.jpg",
               "id": 54887,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 2,
               "credit_id": "5676b188c3a368168e0060c7",
               "name": "Steve Buscemi",
               "profile_path": "/ieDyVKnQHo7eMGu1GOE7YYr2Fk4.jpg",
               "id": 884,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 1,
               "credit_id": "5676b19392514179d2005c9b",
               "name": "Allison Janney",
               "profile_path": "/cDcB8mKP1GiIeoM3Qe7GIucs0iv.jpg",
               "id": 19,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "",
               "gender": 2,
               "credit_id": "5676b1a2c3a36816830059a9",
               "name": "Richard Jenkins",
               "profile_path": "/iz61iPIgNUp0yk48bRNjEJ5GHO4.jpg",
               "id": 28633,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 2,
               "credit_id": "5676b1ad92514179d4005b61",
               "name": "Campbell Scott",
               "profile_path": "/LpYIN2jh58sHaUFM2r3G4G0iE6.jpg",
               "id": 55152,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "",
               "gender": 1,
               "credit_id": "5676b1ccc3a36816830059b6",
               "name": "Dana Ivey",
               "profile_path": "/12mxrB5iT1TAwCzIZvmcFGLBQ52.jpg",
               "id": 13314,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "",
               "gender": 1,
               "credit_id": "5676b1d5c3a368167c005d0d",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "",
               "gender": 2,
               "credit_id": "5676b1f6c3a3681685005c04",
               "name": "Woody Allen",
               "profile_path": "/wpcOUlaszvJoVRf1yLbDtu7u4FI.jpg",
               "id": 1243,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe457bc3a368484e05df15",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe457bc3a368484e05df1b",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a7647cc0e0a26643c03ebd7",
               "name": "Gary DeMichele",
               "profile_path": null,
               "id": 133811,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a7647d3c3a36859cf038b14",
               "name": "Ken Kelsch",
               "profile_path": "/uOYnWQFm5bdXQPafDsh8YVUZQew.jpg",
               "id": 45535,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a7647e49251410597039b66",
               "name": "Elizabeth W. Alexander",
               "profile_path": null,
               "id": 1972387,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a7647fdc3a36859ec03f150",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5a7648149251410597039b97",
               "name": "Jonathan Filley",
               "profile_path": "/1XMriHxPQ73Mzkct0dpu7jPO9FV.jpg",
               "id": 5286,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "5a76481c0e0a26642d0402f4",
               "name": "Suzy Elmiger",
               "profile_path": null,
               "id": 10419,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5a764827c3a3685a1b03b06c",
               "name": "Ellen Lewis",
               "profile_path": null,
               "id": 2242,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5a7648340e0a26643503f171",
               "name": "Andrew Jackness",
               "profile_path": null,
               "id": 1124531,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5a7648430e0a26643503f17c",
               "name": "Chris Shriver",
               "profile_path": null,
               "id": 17950,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "5a76484a0e0a26643c03ec43",
               "name": "Catherine Davis",
               "profile_path": null,
               "id": 20570,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5a76486092514105a303a1c5",
               "name": "Juliet Polcsa",
               "profile_path": null,
               "id": 957570,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.189618,
      "production_countries": [],
      "id": 28134,
      "vote_count": 22,
      "budget": 0,
      "overview": "In an attempt to resurrect the slapstick comedy of Laurel and Hardy or The Marx Brothers, Stanley Tucci and Oliver Platt team-up as two out-of-work actors who accidentally stow away on a ship to hide from a drunken, belligerent lead actor who has sworn to kill them for belittling his talents.",
      "similar": [
         11545,
         866,
         810,
         10050,
         1213,
         1934,
         18,
         10229,
         597,
         375315,
         197082,
         11937,
         10671,
         9457,
         1716,
         24805,
         5961,
         9674,
         26670,
         253299
      ],
      "original_title": "The Impostors",
      "runtime": 101,
      "poster_path": "/5HWt9UOZAqVzxOrv1ZH5g3RfxKX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
         "name": "Fox Searchlight Pictures",
         "id": 43,
         "origin_country": "US"
      }],
      "release_date": "1998-05-18",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Why be yourself when you can be somebody else?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stanley Tucci"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Stanley Tucci"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120823/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5MTAxNzQwOF5BMl5BanBnXkFtZTcwNzY4MDQyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Oliver Platt, Stanley Tucci, Walker Jones | See full cast and crew »"],
      "reviews": [
         "I loved this movie, yet I can see why others hated it. This is not the comic food we have grown up on. It is a different cuisine that tastes strange at first, but if given a chance, rewards with fresh, delicious sensations at every bite. Early in this movie our actor heros take turns mugging an emotion on command. I think this moment is the key to understanding the entire film. Almost every scene is painted by facial expressions and body language. The editing lingers to give us time to enjoy each portrait, then cuts a bit further along in the story than we are used to. This unfamiliar timing gives the strong cast a chance to act rather than react. The story is about actors, but the movie is a tribute to comedic acting. If you want a formula comedy, rent something else. If you want movie that is funny, warm, original, and brilliant and are willing to give its different pace a chance, put this film at the top of your list and plan to view it twice.",
         "This is a top-notch comedy at the most audacious level. I once heard someone say that door-slamming farcical comedy never works on film; and I think this is one of the movies that proves them wrong. It reminded me of the brilliant stage farce \"Noises Off\" (which was also turned into a movie with fairly successful results). I thought the opening title gags were brilliant, especially Oliver Platt. I loved Billy Connolly as a camp tennis player and Allison Janney as a gangster's moll. I also thought Alfred Molina, Tony Shalhoub, Campbell Scott, Steve Buscemi and Matt McGrath were brilliant as well. The pastry shop scene and Tucci crying poor were also outstanding highlights. My only slight criticism with this film is that the pacing seemed a tiny bit slow at times, but otherwise this is an exceptional storyline. This is definitely the sort of movie I'd like to see a lot more of. It also proves that they CAN make 'em like they used to.",
         "I'm afraid to say too much about director/writer/co-star Stanley Tucci's follow-up to BIG NIGHT because I don't want to spoil any of its sublimely insane surprises! This rollicking screwball comedy follows two dedicated but starving actor pals (Tucci and Oliver Platt) on their increasingly nutty adventures in 1930s NYC and aboard an ocean liner. The all-star indie film cast includes many of Tucci's co-stars from BIG NIGHT (including BN co-director Campbell Scott as the cruise's officious German director), many of them in change-of-pace roles. For example, it was a delight to see Lili Taylor get to exercise her flair for comedy as the pretty, plucky activities director being romantically pursued by both Scott and Matt McGrath. Although many have compared THE IMPOSTORS to Laurel and Hardy, I think its sophisticated air and sly playfulness make it more like Woody Allen meets The Marx Brothers. If you want to be swept away into a sea of laughter, THE IMPOSTORS is well worth seeking out at the local video shoppe!",
         "Rented THE IMPOSTORS for the first time on Friday and by the end of the weekend had watched it 4 times - and yes, I do have a life. Blithe is the only word I can use to describe the experience of watching this video. In a world of multi-screen theaters that show a variation of 3 basic movies - mindless action, gross-out comedy, or big-screen version of the issue of the week - THE IMPOSTERS was a homage to an earlier genre - the silly, almost plotless comedies of Laura & Hardy. Homage - not remake - an important difference. This was definitely a 1990's movie - more quirky than slapstick, with slick production values. A series of vingettes, tied together to make a whole, yet each scene easily stands on its own as a comic gem - the initial credits being my personal favorite. One final word - all this and a great cast! and score. This movie was a rare 10.",
         "I rented this knowing nothing about it (not much of this kind of thing makes it to Kentucky). I just really like Oliver Platt. So I rented it one night in college, having nothing better to do... And I loved it. It's really not like any movie I've ever seen. I'm not really a connoisseur of Laurel and Hardy or anyone like that--I'm just your average college kid, I guess. I don't like most American comedy, though, because it's a little too dependent on violence and switching one's brain off. But this movie was so different and so funny! It was silly, sure, but it was smart and really amusing. I love Steve Buscemi in everything he's in, and he was just TOO funny here. I was rolling in the floor. And Campbell Scott was just great, I loved how he kept popping up at the most inopportune times. But my favorite part, I think, was that little bit with the Hamlet play. I've seen productions like this and known actors like that and it was just PERFECT! The archetypical actor who can't fit his inflated head through the backstage door. It was truly hilarious all the way through, and I don't know anything about what it could be based on. I just liked it a lot. But it's not your average American comedy, and it might inspire a love/hate response in many viewers. I think it's probably an acquired taste.",
         "My God! That line alone was enough to make me soil my pants. One of the best farces I have ever seen with characters to make one's imagination drool. I want to keep Stanley Tucci's brain in a jar and show it off as a prized possession to all my friends. Better yet....invite them to watch the film.",
         "THE IMPOSTORS (1998) *** Starring: Oliver Platt, Stanley Tucci, Lili Taylor, Steve Buscemi, Campbell Scott, Isabella Rossellini, Billy Connolly, and Hope Davis Written and directed by: Stanley Tucci Running Time: 102 minutes Rated R (for some language and sex-related material) By Blake French: Certain movies are just not for all audiences. Stanley Tucci directs the new comedy, who is one of the creators of the 1995 drama-comedy \"Big Night.\" The film is certainly not for everyone. It will satisfy fans of screwball comedies, and perhaps fans of someone in the cast-they may enjoy it. However, I only liked \"The Impostors\" because of the laughs it brought along with its well-written script. It is not your typical comedy. Now, I'm not saying that this movie is great. I am saying, however, that this movie satisfied me to the point of a recommendation. \"The Impostors\" opens with a hilarious sequence in which the two main stars, Tucci and Platt, play two out of work actors, Maurice & Arthur, who play on a silent stage who have serious and comical problems with women, coffee, and each other. Maurice & Arthur get in to trouble and escape from the police in a boarding box. However, while they were sleeping, the box was loaded onto a ship carrying an assortment of bizarre passengers that provoke even more laughs. They include a Nazi steward with tight lips, Lily, the social director who helps Maurice & Arthur, a First Mate who is a mad bomber, a tennis pro who is aggressively gay, an ex-queen in despair entertainer who wants to commit suicide, and many more. The films casting was more to my liking than any other movie I have seen this year. The characters fit the actors so perfectly and realistically that I could have been fooled that these people were actually victims of a secret tapping of \"Candid Camera.\" Each of them bring a story to themselves outside the plot. No one character is at the mercy of the script. As for the script itself, it kept its cool even as it organized its own extremely complicated chaos. There are many laughs that evolve from hyperactive activity from the assortment of characters because there is such a variety, everything feels so fresh in this movie. \"The Impostors\" is an opinion based movie. Certain film's don't carry massive plot holes, obvious flaws, or any other structural or character problem, but they don't necessarily bring anything overwhelmingly powerful to the big screen either. \"The Impostors\" is this kind of comedy. Whether you find it to your liking or not will totally depend on your taste in comic material in film. I was amused by the picture. Many filmgoers will differ on my opinion though. The individual I screened the film longed for its conclusion and declared this was the worst movie she had seen in her life. I recommend the film, but take into account your personal feelings on my review before you make a judgment call. \"The Impostors\" might make you laugh uncontrollably, but it also may cause you to turn your head in pitiful despise. Brought to you by Fox Searchlight Pictures.",
         "Pure, tongue-in-cheek, humor from start to finish. A near perfect film. Stanley Tucci and Oliver Platt make a great duo in this comedy about two starving actors. Desperate for food, they decide to con a pastry chef out of some of his pastry. As previously planned, Platt comes to the pastry chef's \"rescue\", but instead of getting pastry, he gets two tickets to see hack stage actor, Jeremy Burtom excellently played by Alfred Molina. Through a series of incidents, Burtom threatens the boys with imprisonment if he catches them, The two end up accidentally stowing away on a cruise ship and that's when everything gets complicated. An excellent cast was assembled for this superbly funny script. Watch for Campbell Scott, son of George C. Scott. His portrayal of a Nazi-like ship steward is hilarious. My hat goes off to Stanley Tucci for doing an excellent job writing and directing this film! I only hope more people can see this jewel.",
         "Stanley Tucci really knows what he's doing. This film, which for some odd reason wasn't really very well received. This movie is funny and smart and very easy to like. But the acting isn't just the reason that this film is one of my personal favorites, it's also because of the superb script. It's brilliantly paced and full of laughter and intrigue. Tucci's film deserves a look, but really, watch the film as a comedy, don't take it too seriously. 3.5/4",
         "A very amusing film. It has elements of the Marx bros, Laurel and Hardy, Grand Hotel and Some Like It Hot. Really an homage to the screwball comedy films of the 30's that were chock full of great character actors. The plot is skimpy at best but half the fun is guessing the previous credits for the great cast. Look for an un-credited performance by Woody Allen as a distracted Broadway director."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "First Cold Piece",
         "Fox Searchlight Pictures"
      ],
      "summaries": ["In an attempt to resurrect the slapstick comedy of Laurel and Hardy or The Marx Brothers, Stanley Tucci and Oliver Platt team-up as two out-of-work actors who accidentally stowaway on a ship to hide from a drunken, belligerent lead actor who has sworn to kill them for belittling his talents. Of course, the lead actor end up on the ship as well. Also, a madman (Tony Shalhoub) plots the destruction of the ship and Steve Buscemi is a depressed, suicidal lounge singer named Happy Frank."],
      "budget": 0
   },
   "movielensId": 2295,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-18",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Stanley Tucci"],
      "runtime": 101,
      "movieId": 2295,
      "title": "The Impostors",
      "mpaa": "R",
      "actors": [
         "Oliver Platt",
         "Stanley Tucci",
         "Tony Shalhoub",
         "Steve Buscemi",
         "Isabella Rossellini",
         "Billy Connolly",
         "Lili Taylor",
         "Alfred Molina",
         "Elizabeth Bracco",
         "Steve Buscemi",
         "Allison Janney",
         "Richard Jenkins",
         "Campbell Scott",
         "Dana Ivey",
         "Hope Davis",
         "Woody Allen"
      ],
      "imdbMovieId": "0120823",
      "originalTitle": "The Impostors",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["yCzM-6o9fXw"],
      "plotSummary": "In an attempt to resurrect the slapstick comedy of Laurel and Hardy or The Marx Brothers, Stanley Tucci and Oliver Platt team-up as two out-of-work actors who accidentally stow away on a ship to hide from a drunken, belligerent lead actor who has sworn to kill them for belittling his talents.",
      "tmdbMovieId": 28134,
      "avgRating": 3.42974,
      "releaseYear": "1998",
      "numRatings": 548,
      "posterPath": "/5HWt9UOZAqVzxOrv1ZH5g3RfxKX.jpg"
   }
}