{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "night life",
            "id": 1759
         },
         {
            "name": "nightclub",
            "id": 2334
         },
         {
            "name": "flower",
            "id": 2382
         },
         {
            "name": "flower shop",
            "id": 2779
         },
         {
            "name": "make a match",
            "id": 6664
         },
         {
            "name": "clubbing",
            "id": 10254
         }
      ],
      "imdb_id": "tt0120770",
      "video": false,
      "title": "A Night at the Roxbury",
      "recommendations": [
         10956,
         10402,
         9536,
         13260,
         13997,
         13824,
         9718,
         14013,
         11017,
         11635,
         10985,
         10878,
         13203,
         9622,
         11353,
         11857,
         13778,
         11090,
         11381,
         10406
      ],
      "backdrop_path": "/hYBQWQAFHjllb7XKmJy2vJWQuZM.jpg",
      "revenue": 30331165,
      "reviews": [{
         "author": "TopKek",
         "id": "57ee4daf925141175b004fac",
         "content": "1998's attempted Saturday Night Live skit-to-movie adaptation is not so much a movie, but more like just a short, 81 minute series of skits that are almost completely right out of the show, so it's more like just watching a greatest hit's collection of the skits from the Saturday Night Live television show from the 90's. But, while this movie is definitely far from even being very good, it is still a fairly decent movie, and while it is so short, it actually manages to have some very funny scenes with Will Ferrell and Chris Kattan that are also definitely reminiscent of some of the SNL skits funniest moments. But, despite the PG-13 Rating, this movie is not appropriate for young kids or even most teen's: There is frequent crude and sexual humor with three very graphic but somewhat comical sex scenes that actually fairly much push the limit for the PG-13 rating. Also, there is some infrequent profanity with at least one useof the F-word. Finally, there is a extremely brief and subtle drug reference near the beginning of the movie that only older audiences watching the movie will get. So, it may not be a great comedy, or even a terribly memorable one, but it still makes you laugh while it's going.",
         "url": "https://www.themoviedb.org/review/57ee4daf925141175b004fac"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Steve Butabi",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46f5",
               "name": "Will Ferrell",
               "profile_path": "/dGxt3uGPlUJKIfHYiLasnEgR90e.jpg",
               "id": 23659,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Doug Butabi",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46f9",
               "name": "Chris Kattan",
               "profile_path": "/kTmr5DuGMoXPFH0FcXxUqQKhpgA.jpg",
               "id": 58317,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Hottie Cop",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b46fd",
               "name": "Jennifer Coolidge",
               "profile_path": "/jOVVWdfxLQ9MOumqM3VxiwAlT9a.jpg",
               "id": 38334,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Roxbury Bouncer",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4701",
               "name": "Michael Clarke Duncan",
               "profile_path": "/A0fXStrmFubDRFS8UeRW7xvcf6S.jpg",
               "id": 61981,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Bridesmaid",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b4705",
               "name": "Eva Mendes",
               "profile_path": "/6JoVMpn0CcZwb6JK7XW2E6ntU52.jpg",
               "id": 8170,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Richard Grieco",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4709",
               "name": "Richard Grieco",
               "profile_path": "/lku5ybzKvQvon1GXhu0eXSx8Czc.jpg",
               "id": 87295,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Barbara Butabi",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b470d",
               "name": "Loni Anderson",
               "profile_path": "/pVCCxFOOr6zgzvKry2rrrFWN9Ue.jpg",
               "id": 34735,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Kamehl Butabi",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4711",
               "name": "Dan Hedaya",
               "profile_path": "/5E4SUVfLMUKNCiP0dMhyOv3XHVZ.jpg",
               "id": 6486,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Emily Sanderson",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b4715",
               "name": "Molly Shannon",
               "profile_path": "/11Ade9QKtTSwUeRNH9cVCWoaeQj.jpg",
               "id": 28640,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Fred Sanderson",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4719",
               "name": "Dwayne Hickman",
               "profile_path": "/nXSwymWdiF5NoUUyGgzWCsYrXsl.jpg",
               "id": 70260,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Craig",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b471d",
               "name": "Lochlyn Munro",
               "profile_path": "/caBPICexFi48JIvsEdwJGjQrTmY.jpg",
               "id": 58058,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Benny Zadir",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4721",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Hat Girl",
               "gender": 1,
               "credit_id": "56010d04c3a368562300120b",
               "name": "Raquel Gardner",
               "profile_path": "/1xtugh8C2xmIRFY86wJSacURVQ5.jpg",
               "id": 214142,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Dooley",
               "gender": 2,
               "credit_id": "591696cb92514156f502b791",
               "name": "Colin Quinn",
               "profile_path": "/i1bEo7q7XJX6mYHA52Z7hhLyDg6.jpg",
               "id": 1219901,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Dooey",
               "gender": 2,
               "credit_id": "591696d392514159c102995d",
               "name": "Colin Quinn",
               "profile_path": "/i1bEo7q7XJX6mYHA52Z7hhLyDg6.jpg",
               "id": 1219901,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46c7",
               "name": "John Fortenberry",
               "profile_path": "/bYGojVLiv38qcBmWTOHOlser6Dr.jpg",
               "id": 58316,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46cd",
               "name": "Steve Koren",
               "profile_path": null,
               "id": 4485,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46d3",
               "name": "Chris Kattan",
               "profile_path": "/kTmr5DuGMoXPFH0FcXxUqQKhpgA.jpg",
               "id": 58317,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46d9",
               "name": "Will Ferrell",
               "profile_path": "/dGxt3uGPlUJKIfHYiLasnEgR90e.jpg",
               "id": 23659,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b46df",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46e5",
               "name": "David Kitay",
               "profile_path": null,
               "id": 25143,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46eb",
               "name": "Jay Kamen",
               "profile_path": null,
               "id": 58318,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b46f1",
               "name": "Francis Kenny",
               "profile_path": null,
               "id": 16464,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 8.705154,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9429,
      "vote_count": 244,
      "budget": 17000000,
      "overview": "Despite being well into adulthood, brothers Doug and Steve Butabi still live at home and work in the flower shop owned by their dad. They exist only to hit on women at discos, though they're routinely unsuccessful until a chance run-in with Richard Grieco gets them inside the swank Roxbury club. Mistaken for high rollers, they meet their dream women, Vivica and Cambi, and resolve to open a club of their own.",
      "similar": [
         5559,
         32856,
         10776,
         23168,
         2750,
         552,
         21746,
         356471,
         5717,
         39137,
         35076,
         198703,
         56323,
         218296,
         133214,
         5354,
         188268
      ],
      "original_title": "A Night at the Roxbury",
      "runtime": 81,
      "poster_path": "/s4GoobEeEKQcWpbBnJ0TSXFt67B.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "SNL Studios",
            "id": 2822,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Score!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "John Fortenberry",
         "Amy Heckerling"
      ],
      "runtime": 82,
      "synopsis": null,
      "writers": [
         "Steve Koren",
         "Will Ferrell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120770/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMDAzMDU0NV5BMl5BanBnXkFtZTcwMjI0OTM1MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Chris Kattan, Will Ferrell, Raquel Gardner | See full cast and crew »"],
      "reviews": [
         "I'm going out on a limb here. I've just bombed \"Joe Dirt,\" and now I'm going to do an about-face on modern comedies and argue that \"A Night at the Roxbury\" is brilliant. Most critics didn't see a distinction between these two bombs, but I do. Comedy oftentimes depends on suffering. Comic protagonists always take a beating, and we either laugh with them, or at them, or maybe we laugh not at all because we couldn't care less. The essential question is, are the protagonists of \"A Night at the Roxbury\" lovable losers or just totally annoying dweebs who deserve all the grief they get? You know my answer already. I love the Butabi brothers. They have a strong fraternal bond, they're obsessed with Emilio Estevez, and they can't get any play. What's not to love? Dan Hedaya is great as the brothers' disgruntled dad, and Chazz Palminteri does a hilarious cameo as an entrepreneur obsessed with ass-grabbing. Richard Grieco demonstrates a remarkable sense of humor about himself by allowing the Butabis to build him up as a big celebrity, when the joke is obviously that he's a total has-been. What a sport, eh? Nice song, too. I like this stupid movie. Really, I do.",
         "THIS MOVIE IS GREAAAAAAAAAT! i guarantee you'll be laughing throughout the movie. I'v read some reviews about this movie and i can't help but wonder why people say its horrible? Maybe your not the type who enjoy a good comedy once in a while. The two brothers are absolutely hysterical. They just keep the laughs coming. AND, what about the music? The music just happens to fit the movie so good that i think its a 'must see movie'. I'm a proud owner of this movie. When i'm in need of a good laugh this is the movie i watch. The story is wonderful, and the actors and actresses have done the greatest job on this movie. If i could i'd give it 100 OUT OF 100 :)",
         "Yesterday, I watched \"A Night at the Roxbury\" for the first time and I absolutely loved it! I think Chris Kattan and Will Ferrell did a great job and were an awesome team. They were VERY funny and kept me laughing and cheering for them through the whole movie. The music in this movie was also great, it made me want to get up and dance (maybe even the head bop! lol)This movie also had the *perfect* ending. I enjoyed all the characters and liked the twists the movie took. I would definitely recommend this movie for a good laugh for anyone, even critical friends. Nomatter who you are, there is something for you to enjoy in this awesome comedy. \"A Night at the Roxbury\" is a must!",
         "\"What's up?\" - Either you love it or you hate it. Actually to me Roxbury is one of my favourites. Of course the two guys are hilarious - but that's what they're supposed to be. This movie is full of great innuendos to disco chicks (\"Is this your first time?\"), to stupid and bored upper class people (\"Do you like my new chin? Is it better than last years?\") and to some movies (\"You had me at hello!\"). Even after watching it the 3rd or 4th time you still can discover some new hints and gags. It's a funny movie but certainly not dumb! Emilioooooh!",
         "If you think this movie sucks, well, it's really your opinion. But my opinion is that it's one of the funniest movies ever made. For those who disagree with me, it all depends on your taste. This movie is more of a weird/cheap humor kind of thing, and that's what a lot of people like. But a lot of people also like smart humor, in which this movie doesn't offer (that much). So this movie (and all other Saturday Night Live movies) are meant to be weird. It's funny to see how some people could act in real life. So people who's of weird and cheap humor, this movie is great! But for those of you smart alecs out there who like smart movies, this one (or any other Saturday Night Live) movie really should'nt be your pick 10/10",
         "When this movie hit the screens in the summer of 1998 (or was it 99 in Turkey - anyways), no one knew what it was in Turkey and a very few people went and saw it, I was one of the more fortunate ones to have done so, and i did this twice!! Yes, i laughed my head off.. Once with my best pal, and the next day with my brother. It is one of those movies which keeps that stupid smile on your face all through the movie. The Butabi brothers and their relationships with the whole world and their fascination for clubs, women and EMILIOOOO! is a must see for everyone who likes a good laugh. I can't get the scene where the brothers are loading the flowers into the van. Some really funny stuff. I bought this on video and have watched it dozens of times and it never gets old. Definitely recommend it...",
         "A Night at the Roxbury... I loved this movie incredibly the first time I saw it because it seemed to be the story of my relationship with my own sister embodied in a film. With such amazingly hilarious actors as Will Farrell and Chris Kattan, and also Molly Shannon, how could anyone pass up the opportunity to at least watch it once? The whole idea of two regular, lazy, semi-lame guys trying to fulfill a small but radical dream while following the right paths in life is very appealing to me. But that's not to say it's not a film for adults... Indeed, there was some \"profanity,\" but I'd say it was relatively minor and only added to the hilarity of it all. I think what really got me was the soundtrack for this film, in particular the recurring dance song \"What Is Love?\" by Haddaway. By the end of the movie, it becomes sort of an anthem. It's almost strange to find yourself watching these two younger men and their rich but meandering lifestyle and think \"Man, I wish I could do that!\" Overall, I'd say this movie is guaranteed to make you laugh IF your comedy preferences are not too strict. And it's even better if you watch it with your friends, because it makes a lot of inside jokes! I'd suggest this movie to anyone looking for a good Will Farrell/Chris Kattan movie, especially if you have your own brother or sister to relate it to.",
         "I saw it this weekend and just could not stop Laughing! My Moment is at the end Of the Wedding were the Beautiful Eva Mendes, is stunned when Doug Stops the Wedding of his Brother. I just still see it before my eyes. Everyone just stood there stunned, and the song : \"What is Love\" just kept on playing. The Plot actually is that That Doug and Steve Butabi two very, ambitious boys are working for there Father (Kamehl) ho owns a Flower Shop. But The Two Brothers plan two run a Night Club. Their Father isn't Impressed with the idea, but allows them to look around. Richard Grieco (An Owner Of Many Night Club's in the Movie) Help's them. The ending isn't predictable and thats what is good. It was Hilarious and Good! The overall Movie was excellent and very funny, it's sure to give you a good night Of laugh's! My Score : 8.4 Groeten Gerrit",
         "This movie was better than I expected! These two are such dorks, but that is what's funny! The outfits, the attitude, the car are all part of the comedy too. Best part: \"Is that a mirror in your pocket, because I can see myself in your pants.\" Also the spoof of Jerry Maguire is great too. Watch if you are in the mood for a good comedy with funny humor.",
         "This movie is fun. It is a relaxed movie about two brothers. Their hobby is visiting clubs. But they have a problem....they are not the two coolest people. Dressing with nice clothes and driving in a BMW does not really help because they act stupid. But they have a dream - to own a club - and maybe this comes true. The movie is set in LA and has nice disco-music in it. the comment on DVD says it is the dumb and dumber of disco...and they are right..it's something like that. I think it is entertaining enough to watch more than one time because a few scenes are really hilarious. See it for your self."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Paramount Pictures",
         "SNL Studios"
      ],
      "summaries": [
         "The Roxbury Guys, Steve and Doug Butabi, want to get into the best club in town, and also hope to open their own club. Vivica, a gold-digging supermodel, and her friend Cambi try to work the Roxbury Guys for their money, only to find out the pair is broke.",
         "Steve and Doug Butabi dream of opening their own club as cool as the Roxbury. The problem is, they are so uncool, they've never even been inside the Roxbury. They still live at home and work at a plant store owned by their dad who is pressuring Steve to marry Emily, the daughter of the owner of the neighboring lamp store.",
         "Steve and Doug Butabi are club-hopping brothers whose father only wants them to work in his fake plant store. Steve and Doug share one dream - to open their own nightclub. This is complicated, however, by the fact that they can't even get into the one club that they'd give anything to be in. Things start to look up for them when one night they get into a car accident with Richard Grieco who gets them into the club where they meet two \"hotties\", Cambi and Vivica. There's also Emily, the goody-two shoes college girl who Steve's father wants him to marry.",
         "Two dim-witted brothers dream of owning their own dance club or at least getting into the coolest and most exclusive club in town, The Roxbury."
      ],
      "budget": 17000000
   },
   "movielensId": 2296,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-01",
      "dvdReleaseDate": "2007-08-28",
      "directors": ["John Fortenberry"],
      "runtime": 81,
      "movieId": 2296,
      "title": "A Night at the Roxbury",
      "mpaa": "PG-13",
      "actors": [
         "Will Ferrell",
         "Chris Kattan",
         "Jennifer Coolidge",
         "Michael Clarke Duncan",
         "Eva Mendes",
         "Richard Grieco",
         "Loni Anderson",
         "Dan Hedaya",
         "Molly Shannon",
         "Dwayne Hickman",
         "Lochlyn Munro",
         "Chazz Palminteri",
         "Raquel Gardner",
         "Colin Quinn",
         "Colin Quinn"
      ],
      "imdbMovieId": "0120770",
      "originalTitle": "A Night at the Roxbury",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Xvl3qJe9L9g"],
      "plotSummary": "Despite being well into adulthood, brothers Doug and Steve Butabi still live at home and work in the flower shop owned by their dad. They exist only to hit on women at discos, though they're routinely unsuccessful until a chance run-in with Richard Grieco gets them inside the swank Roxbury club. Mistaken for high rollers, they meet their dream women, Vivica and Cambi, and resolve to open a club of their own.",
      "tmdbMovieId": 9429,
      "avgRating": 2.68617,
      "releaseYear": "1998",
      "numRatings": 2581,
      "posterPath": "/s4GoobEeEKQcWpbBnJ0TSXFt67B.jpg"
   }
}