{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0124102",
      "video": false,
      "title": "Strangeland",
      "recommendations": [
         35945,
         8691,
         38499,
         82360,
         32595,
         27495,
         70448,
         29559,
         39973,
         15527,
         33721,
         8973,
         24913,
         28762,
         13557,
         25750,
         79975,
         59317,
         13555,
         10124
      ],
      "backdrop_path": "/v9EWoP65WJlEWolNDhIAGMCKCIY.jpg",
      "revenue": 631221,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mike Gage",
               "gender": 2,
               "credit_id": "52fe4566c3a368484e058413",
               "name": "Kevin Gage",
               "profile_path": "/egIApa0PPsHkAwrGnOAUtdqO6CQ.jpg",
               "id": 34839,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Toni Gage",
               "gender": 1,
               "credit_id": "52fe4566c3a368484e058423",
               "name": "Elizabeth Peña",
               "profile_path": "/ePeN3h3UDH9S4THwxwWjQQyK3cH.jpg",
               "id": 7430,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Steve Christian",
               "gender": 2,
               "credit_id": "52fe4566c3a368484e058427",
               "name": "Brett Harrelson",
               "profile_path": "/tkdwLih7WaOHjyUcSNPToQxqvAb.jpg",
               "id": 18235,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jackson Roth",
               "gender": 2,
               "credit_id": "52fe4566c3a368484e05842b",
               "name": "Robert Englund",
               "profile_path": "/h4LEgXsvbfmIbwktkiGWNwwtr8q.jpg",
               "id": 5139,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Genevieve Gage",
               "gender": 1,
               "credit_id": "52fe4566c3a368484e05842f",
               "name": "Linda Cardellini",
               "profile_path": "/iwmPwZARlFIKOqwEVuYIgPOc4WX.jpg",
               "id": 1817,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Captain Churchill Robbins",
               "gender": 2,
               "credit_id": "52fe4566c3a368484e058433",
               "name": "Tucker Smallwood",
               "profile_path": "/4ltM9TUPWDXmZRjqKjNNsDjPC0S.jpg",
               "id": 92777,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Rose Stravelli",
               "gender": 1,
               "credit_id": "52fe4566c3a368484e058437",
               "name": "Ivonne Coll",
               "profile_path": "/9o1PzlyQKOPZMSXIwvNZN719svC.jpg",
               "id": 46929,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Angela Stravelli",
               "gender": 1,
               "credit_id": "52fe4566c3a368484e05843b",
               "name": "Amy Smart",
               "profile_path": "/yTWkJVYq1wtn2NrnPIwXshTWqby.jpg",
               "id": 20189,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Captain Howdy / Carleton Hendricks",
               "gender": 2,
               "credit_id": "52fe4566c3a368484e05843f",
               "name": "Dee Snider",
               "profile_path": "/ocrhugGeyajEqQUKyh1NUjBuqUY.jpg",
               "id": 60434,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Tiana Moore",
               "gender": 0,
               "credit_id": "52fe4566c3a368484e058443",
               "name": "Amal Rhoe",
               "profile_path": null,
               "id": 554475,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Matt Myers",
               "gender": 2,
               "credit_id": "52fe4566c3a368484e058447",
               "name": "Robert LaSardo",
               "profile_path": "/wyV4nxnRJFtVTkaZ4Cq8eoMV63Y.jpg",
               "id": 65831,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Victim Bob",
               "gender": 0,
               "credit_id": "52fe4566c3a368484e05844b",
               "name": "Andrew Cooper",
               "profile_path": null,
               "id": 554476,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Elderly Man",
               "gender": 0,
               "credit_id": "52fe4566c3a368484e05844f",
               "name": "Archie Smith",
               "profile_path": null,
               "id": 554477,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Carol Anne Chalmers-Perez",
               "gender": 1,
               "credit_id": "58cca42a9251415a7d002c8a",
               "name": "Jillian McWhirter",
               "profile_path": "/k7GuUTxgA3np96cavUoZfZpzkOh.jpg",
               "id": 184459,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Madeline Roth",
               "gender": 1,
               "credit_id": "58cca436c3a36850d7002b43",
               "name": "Leslie Wing",
               "profile_path": "/uycrhIavIvYuIiAnf9ec3Ttwcbw.jpg",
               "id": 101778,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4566c3a368484e058419",
               "name": "John Pieplow",
               "profile_path": null,
               "id": 554474,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4566c3a368484e05841f",
               "name": "Dee Snider",
               "profile_path": "/ocrhugGeyajEqQUKyh1NUjBuqUY.jpg",
               "id": 60434,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 6.180575,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27791,
      "vote_count": 45,
      "budget": 1100000,
      "overview": "A pierced and tattooed sadist, Captain Howdy, trolls the Internet for naive teens, luring them to his home to torture and defile them. When Howdy kidnaps and tortures the daughter of police Detective Mike Gage, he is caught. Deemed insane, he is sent to an asylum but is released soon after, seemingly better. However, Gage knows it is only a matter of time before Howdy strikes again, and he's ready to unleash his own form of retribution when the time comes.",
      "similar": [],
      "original_title": "Strangeland",
      "runtime": 86,
      "poster_path": "/4N5c0y9ab4rbz9un65waaBKWIhq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shooting Gallery",
            "id": 1596,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Snider Than Thou Productions Inc.",
            "id": 56396,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-02",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "Wanna come to a party?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Pieplow"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Dee Snider"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0124102/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5Nzg5ODM2M15BMl5BanBnXkFtZTcwODk3NTkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Gage, Elizabeth Peña, Dee Snider | See full cast and crew »"],
      "reviews": [
         "As a simple but interesting story, Strangeland is in the middle of good and bad. It borrows too much from other flicks, like Buffalo Bill from Silence of the Lambs. Some lines (\"What a rush?\") are kind of terrible. And the Twisted Sister references that no one picks up on are laughable: the \"we're not gonna take it\" sign that the angry mob is holding and Dee's character \"Capt. Howdy\". Yes, it's in the Exorcist, but it is also a Sister song. On a good note, Dee Snider is a creepy looking character. The first time you really get a good look at him he's intense. And there are a few gross sadist scenes, one involving piercing an unwilling man in the most dreaded of all places. That part made me wince. And that's fairly hard to do. Also, I loved the fact that Robert Englund plays a character that is the exact opposite of his role in A Nightmare on Elm Street. Instead of playing the killer, he is the leader of the mob going to find the killer. Krueger fans will know what I'm talking about. It's a brilliant and appropriate piece of casting that genre fans should appreciate. Overall, the good outweighs the bad, and I would recommend watching it (at least once). You have to give Dee some credit, there are a lot worse movies out there.",
         "It seems that Dee Snyder ran out of ideas halfway through the script. The second half of the movie is basically just a rehash of the first, which makes the film very boring. To sum up: Cop's daughter is suckered into party via chatroom where she is sexually molested/tortured by psychopath (played by Snider). Cop rescues her, psychopath is put in therapy/jail. Psychopath is released four years later and the whole thing is played out AGAIN. Within all this are many unexplained plot elements: Why was \"Captain Howdy\" psycho in the first place? What's with the one-time personality detour to bible-thumper? How does he kidnap all the adults and manage to sew their mouths shut without a struggle? And perhaps the biggest unsolved mystery of all... how does a 6'2\" man with pink hair hide himself completely behind a 5'6\" average build woman? These are just some of the questions I had watching this film. It seems that Snyder was trying to make some kind of commentary on a) the \"dangers\" of online chatrooms, b) the hypocrisy of Christian sexual mores, and c) the effect our twisted puritanical society has on us as individuals. If that is so, he failed. The movie is just too poorly done to entertain, never mind convey social messages. The torture scenes are stupid and boring, bordering on silly (especially when Snyder goes into one of his \"pain and death\" monologues), and everything else is just plain dumb. The \"call tracing\" scene is really lame... when are the cops gonna get caller ID and *69? The young partner of the main cop character is particularly awful... he shouldn't be working as an actor, basically. And the audio in the final showdown scene is really poor. I guess they couldn't afford two boom mikes? The rest of the acting is not awful but it's not good either. The cop is pretty one note, and his detached quality is not quite believable. Dee Snyder is actually not too bad, but he snarls and sneers way too much. Robert Englund (who deserves way better) puts in a somewhat amusing performance of a hypocritical redneck. If you're a big Robert Englund fan the movie is probably worth seeing just for him. Everyone else is forgettable. In conclusion, we've seen all these plot elements done before and done better, in films like SILENCE OF THE LAMBS, HELLRAISER, and TEXAS CHAINSAW MASSACRE. I suggest you rent one of those instead of watching this turkey. 3/10.",
         "\"Strangeland\" isn't that bad if it features fears of yours. **SPOILERS** Genevieve Gage, (Linda Cardellini) is just the latest in a series of disappearances plaguing a small town. Her father Mike (Kevin Gage) just happens to be the detective on the case, and his partner Steve Christian, (Brett Harrelson) convinces him to check out a club that specializes in piercing and scarification, which is also the secret hideout for Captain Howdy, (Dee Snider) also known as Carleton Hendricks, who is the suspected cause of the disappearances. With the help of his cousin Angela Stravelli, (Amy Smart) Captain Howdy is caught and brought to justice. After a couple years in an insane asylum, he gets released back into the community, and a local militia group led by Jackson Roth, (Robert Englund) kidnap him and leave him for dead. When new evidence confirms that he may not be dead, Detective Gage tries harder than before to stop him. The Good News: As it gets more and more commonplace for people to chat online and in instant messaging, the fact that this one was the first out of the gate to show the potential evils and dangers of the situation is a nice and original approach. Even though it deviates from it towards the end, the original set-up is pretty great. The ending is also pretty great and pretty exciting, with a great bit of action in there as well. Most of the focus on this film is the discomfort one gets when exposed to extreme forms of scaring and skin piercing, and it is a subject most get uncomfortable viewing. This is mostly played out in the psychical form of Captain Howdy, who does look pretty creepy. His look, though, drives the film, so I won't spoil it, but it is a really disturbing and shocking look that will definitely get you a little crept out the first time his full appearance is shown. The Bad News: This film basically relies on the belief that extreme piercing, full-body tattoos and scaring are scary images for the average person. If none of them are scary or frightening, then most of the film's power will be lost. Besides that, there really isn't a whole else in the film. It's not a traditional horror film in the slasher sense, so for some it can be quite boring, as there's no real jumps, suspense or anything similar. The Final Verdict: If any of the acts or ideas featured in this one are fears of yours, this could be a pretty scary film. If not, this can be a pretty dull experience. Otherwise, it's pretty middle of he road and pretty forgettable. Use your own judgment to determine if you will like this one or not. Rated R: Graphic Violence, Nudity, some Language, a brief sex scene, scenes of torture and extreme images of body modification",
         "I first rented this movie on the infamous day of September 11, 2001. Since then I've seen it a number of times. My only complaint is that it's too short. \"Strangeland\" would've be a complete piece of horror art at two hours. As it stands, the running time is only an hour and a half. Ex-Twisted Sister member Dee Snider wrote, produced and stars in this 1998 shockfest set in a small Colorado town. He plays Carleton Hendricks, a crazed sadist who has psychotic ideologies on human evolution and a love for near-death experiences. Hendricks is no pushover, he's a pumped up six-foot \"modern primitive\". Someone who has tattooed and pierced their body to the very extreme. When he makes his first full appearance in the film, it is a truly terrifying sight. Hendricks' main hobby in life is to share his \"spiritual awakenings\" with his kidnapped victims. He visits Internet chatrooms under the name \"Capt. Howdy\" and then invites people over to his house. They believe they're going to a party. Instead, they find themselves in a house of pain and suffering. Hendricks sows their eyes and mouths shut and tortures them by sticking blades and hooks in numerous parts of their body. If it sounds sick, it's because it is. One of Hendrick's victims is Genevieve, the teenaged daughter of detective Michael Gage. Gage not only manages to save her, but arrests Hendricks as well. Four years later, Hendricks is released from a mental institution completely rehabilitated to the disapproval of the community. A group of rednecks led by Freddy Krueger himself, actor Robert Englund, decide to kill him. They fail and Hendricks reverts back to his old self. The rest of the film I'll leave to you, only to say the conclusion is satisfying and will leave you in shivers. With the exception of Snider, the acting isn't too good, but it's serviceable. The direction is okay, too. There are some humorous parts in \"Strangeland\" and they are very funny. I also loved the soundtrack, it's awesome and worth buying if you love rock. Overall, this is a movie worth watching. If you love low-budget horror films with a sense of humor, check it out. You'll probably like it.",
         "That Twisted Sister's Dee Snyder wrote and produced this may have turned some people off from even giving it a try. It's also in no small part inspired by The Silence of the Lambs (from which it steals at least one scene) and Se7en, and as with other movies that have taken inspiration from those movies, such as 8mm, Feardotcom and Saw, took some flak for that too. The title is a stumper, I don't know what it means and it doesn't seem to suit the movie well. The shocking cover image is well chosen, though it might surprise some that a person's mouth sewn shut could be found in the opening scene of a movie from the early 1930s, Murders in the Zoo. In truth, it's not all that bad. A young woman is lured to a party through an online chatroom and an IM from \"Captain Howdy,\" and her friend turns up dead with signs of body modification-inspired torture. A large septum piercing found in the trunk of her car provides a clue (I didn't understand how it could have been accidentally left, or why it would have been planted). The cop learns a bit about \"modern primitives\" (I think there's a shot from the RE/ Search book of that name) and online chatrooms, still a danger to the unwary today. Somewhat surprisingly, partway into the movie we get a \"four years later\" intertitle, and the discovery of a second set of victims seems awfully convenient. The ending confrontation is disappointing. There are nods to other movies as well, as when a group of neighbors tries to lynch the bad guy, led by Jack (Robert Englund). This is quite reminiscent of the lynching of Freddie Krueger (Robert Englund again) by his neighbors in the Nightmare on Elm Street backstory. I saw the version on video, and am not sure how the unrated DVD might differ.",
         "Wholly wow, never thought I would see a horror movie that would have a story that would stagger around as badly as it happened in 1987's Grotesque. But here it is. A torture-loving maniac who seeks victims in chat-rooms and calls himself Captain Howdy (yep, The Exorcist) torments a detective when he takes his daughter. Then, the maniac is arrested, rehabilitated, let loose after four years (huh?) in a nuthouse, picked on by Robert England, hung by Freddy and his hick buddies, but then- he's not really dead. So maniac goes back to terrorizing said detective who arrested him in the first place, and promptly re-kidnaps his daughter. Yow. I enjoyed this movie. The pace is all over the place, but it never leaves you bored. Dee Snider (Twisted Sister, remember I Wanna Rock, or We're Not Gonna Take It? Hell, he was in Pee-Wee's Big Adventure) is the loon, who is obsessed with torture and flesh ripping, and you don't get to see him for the first 45 minutes, but when he does finally show his face, you say to yourself \"oh yeah, Dee Snider\". The first 45 minutes plays like a freaky detective horror thriller with main characters, then Robert England comes out of nowhere for about 20 minutes in a starring role-of-sorts. The movie is fun for the average fan. It's an assault on the senses, blended with cheese. Two good things at once. Features breasts punctured with torture devices, flesh hanging by hooks, and of course the Twistedest Sister of them all. Three stars.",
         "Strangeland seems to have a love/hate relationship with many of its viewers. I personally loved the movie, and everything about it. The acting in some places could be improved upon, but the filming adds to the atmosphere where the acting can't. In some areas, the dialogue is a bit cheesy and over dramatic, but really, what do you expect from the late 90s? Over all, Dee did an amazing job in writing what I believe to be one of the most terrifying thrillers I've ever seen. It plays on the fears of many age groups--adult, parents, and children. Every parent fears that their children will get too involved with chat rooms and will meet strangers from the internet. And it *does* happen in the real world. And every child and adult fears being kidnapped and tortured against their will; that happens too in the real world. Which is what makes this movie such a sensitive subject for many. My only warning is if you *know* you are sensitive to things such as strong violence, visible torture, and gore, then you do *not* want to see this movie. If you are unsure about if this movie will entertain you, then read as many reviews as you can, ask people you know who have seen this movie, and be prepared to turn the movie off at any time should you become disturbed.",
         "I'd give it a ten if the acting wasn't offensively bad. Quite a few parts that are irrelevant, but overall, it's a great movie. And watch closely when Snider is back as Carleton Hendrix, you can see a banner with \"We're not gonna take it\" written on it. Shameless plug? You bet. It's. . .different, don't expect too much. But overall, it's a fun movie, cult classic among quite a few people. Everyone is guaranteed to either love it or hate it. Now I'm just rambling on because I can't really post a review with x amount of lines. :-) Acting, like I said, is awful for the most part, and there are more than a few blatant rip-offs from \"The Crow.\" All things considered, if for nothing more than the Xibalba scene and Captain Howdy's appearance, I think it pulls in at a 7. Argue, hate me, do whatever. Enjoy!",
         "Tried to contact Scott to state that this movie is dull. IMDB won't let me though. I am way over the age of twelve. Over twice that even and I LOVE movies. I was nervous to see this movie for a long time because I thought the acts towards women might be too brutal and frightening. I finally forced myself to watch it with a friend. I had to apologize for how lame it was. No suspense. Nothing scary. Boring. The trailer and movie cover will kick your ass. Go no further though. it is a waste of your time. maybe someday it will be a famous cult film of some the the worst, famous cult films ever made. Either that or just watch it cause that 'Twisted Sister' guy is in it and you're curious.",
         "Put this movie out of it's misery and burn the negatives. What am I saying? The whole movie was negative. Fortunately, only a very few would find this movie the least bit appealing. This is what the vast American majority would call too much sex and violence. It will probably show up on some non-premium cable channel someday just for the shock value, but after editing out the nudity (most of the violence will stay) all that will be left is 45 minutes of really bad acting interspersed with 45 minutes of commercials. There are just too many starving actors in Hollywood."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "Shooting Gallery",
         "Snider Than Thou Productions Inc."
      ],
      "summaries": [
         "The place is Helverton, Colorado, a town of about 350,000 people. 15-year-old Genevieve Gage and her best friend Tiana Moore are typical teenagers who spend a lot of time surfing the internet and sending messages to strangers in chat rooms. Upon \"meeting\" another apparent student who goes by the screen name of Captain Howdy, Genevieve and Tiana decide to attend a party at Captain Howdy's house. As it turns out, Captain Howdy has lured them into a darkness from which there may be no permanent escape. But what Captain Howdy doesn't know is that Genevieve's father is local cop Mike Gage. When neither Genevieve nor Tiana has returned home by the next morning, Genevieve's mother Toni alerts Mike. With the help of a younger cop named Steve Christian, Mike tries to find Genevieve and Tiana. Things take an unexpected turn when Tiana's car is pulled out of a lake, and Tiana's tortured body is found in the car's trunk, with her mouth stitched shut. There's no sign of Genevieve. Mike discovers that Captain Howdy is into body art that includes tattooing, piercing, branding, and scarification. Mike's niece Angela Stravelli gives him his first lead by informing him of Genevieve's penchant for meeting strangers through the internet. When Mike meets Captain Howdy online, he gets Captain Howdy to invite him to a party, but Mike's plan to get Captain Howdy goes awry. Mike figures out Captain Howdy's location, and he finds Captain Howdy's torture chamber. Mike not only finds Genevieve naked and bound with her mouth stitched shut, but he also finds five other teenagers who are in similar predicaments. After a brief struggle where Mike shoots Captain Howdy, Mike arrests Captain Howdy, whose real name is Carleton Hendricks. Mike thinks he's closed the case. But a year later, Hendricks is found not guilty by reason of insanity, and he's put in the Meistrich Psychiatric Institute. Three years after being put in the Meistrich Psychiatric Institute, Hendricks is released. Doctors at the Meistrich Institute say that Hendricks, who has been diagnosed as a schizophrenic with a severe chemical imbalance, is okay as long as he is on his medication. Hendricks moves back to his old neighborhood. While Hendricks is under the influence of his medicine, he seems timid and apologetic about what he did. But four years after what Hendricks did, the memories are still fresh in the minds of Helverton's residents. And Genevieve still has highly intense nightmares about what Hendricks did to her. There are people who are not happy about Hendricks being released, especially an activist group led by Jackson Roth and Catherine \"Sunny\" Macintosh. Catherine heads a group called \"Christians Against Moral Decay.\" Roth and Catherine are angry that Hendricks didn't get death for what he did four years ago. One night, while Roth's teenage daughter Kelly is out with her boyfriend, a fearful Roth jumps to the conclusion that Hendricks could have taken Kelly. That's why Roth calls Catherine and a bunch of others. Roth and this group kidnap Hendricks, and on the way off of Hendricks's property, Hendricks's medicine bottle is accidentally destroyed. Roth and the group beat Hendricks up, and then make a failed attempt to lynch him. Without his medication, Hendricks goes back to being Captain Howdy -- this time with revenge on his mind. And Mike may be the only one who can stop Hendricks once and for all.",
         "A schizophrenic sadist by the name of Captain Howdy lures teens through the internet into his painful traps. A detective starts pursuing him after he captures his daughter. Eventually they catch up with him and send him to a mental hospital. But upon his release, the townspeople don't accept the new, peaceful former Captain Howdy, and attack him. Howdy goes nuts again and in revenge starts everything all over, only worse. Can the detective stop him?...",
         "In a teen chat room, Genevieve Gage, the teenager daughter of detective Mike Gage is invited to a blind date by the cool Capt Howdy. The guy is indeed a pierced a schizophrenic sick and sadistic maniac, and he kidnaps Genevieve and her friend Tiana Moore. He submits the girls and other adolescents to tortures. When the body of Tiana is found, Mike hunts Capt Howdy and puts him in jail first and then he is sent to a mental institution. Four years later, Capt Howdy is considered rehabilitated and released from the asylum, against the will of the local population. After an incident, Capt Howdy abducts Genevieve again, and Mike promises to kill him."
      ],
      "budget": 1100000
   },
   "movielensId": 2298,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-02",
      "dvdReleaseDate": "1999-03-23",
      "directors": ["John Pieplow"],
      "runtime": 86,
      "movieId": 2298,
      "title": "Strangeland",
      "mpaa": "R",
      "actors": [
         "Kevin Gage",
         "Elizabeth Peña",
         "Brett Harrelson",
         "Robert Englund",
         "Linda Cardellini",
         "Tucker Smallwood",
         "Ivonne Coll",
         "Amy Smart",
         "Dee Snider",
         "Amal Rhoe",
         "Robert LaSardo",
         "Andrew Cooper",
         "Archie Smith",
         "Jillian McWhirter",
         "Leslie Wing"
      ],
      "imdbMovieId": "0124102",
      "originalTitle": "Strangeland",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["8KYGdpYnHAY"],
      "plotSummary": "A pierced and tattooed sadist, Captain Howdy, trolls the Internet for naive teens, luring them to his home to torture and defile them. When Howdy kidnaps and tortures the daughter of police Detective Mike Gage, he is caught. Deemed insane, he is sent to an asylum but is released soon after, seemingly better. However, Gage knows it is only a matter of time before Howdy strikes again, and he's ready to unleash his own form of retribution when the time comes.",
      "tmdbMovieId": 27791,
      "avgRating": 2.29301,
      "releaseYear": "1998",
      "numRatings": 186,
      "posterPath": "/4N5c0y9ab4rbz9un65waaBKWIhq.jpg"
   }
}