{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0052607",
      "video": false,
      "title": "The Battle of the Sexes",
      "recommendations": [
         194817,
         197788,
         119168,
         79468,
         42800,
         26427,
         81724,
         31042,
         29057,
         50800,
         141822,
         29065,
         146660,
         33841,
         249348,
         82807,
         36501,
         95083,
         82667,
         76418
      ],
      "backdrop_path": "/zforQxc2KuYFXrYqpTL2chuUzhw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mr. Martin",
               "gender": 2,
               "credit_id": "52fe462cc3a36847f80f0def",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Robert Macpherson",
               "gender": 2,
               "credit_id": "52fe462cc3a36847f80f0df3",
               "name": "Robert Morley",
               "profile_path": "/7R4jQRl8CTFYCYpiQ1O2AjYtiK6.jpg",
               "id": 6599,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Angela Barrows",
               "gender": 1,
               "credit_id": "52fe462cc3a36847f80f0df7",
               "name": "Constance Cummings",
               "profile_path": "/uzsum5NHhYiNtspVRy9BkHAHq1i.jpg",
               "id": 19022,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Andrew Darling",
               "gender": 0,
               "credit_id": "52fe462cc3a36847f80f0dfb",
               "name": "Jameson Clark",
               "profile_path": null,
               "id": 229362,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Irwin Hoffman",
               "gender": 2,
               "credit_id": "52fe462cc3a36847f80f0dff",
               "name": "Donald Pleasence",
               "profile_path": "/fr9lf679ZsHbDZsbcpKZfbFO1Pu.jpg",
               "id": 9221,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe462cc3a36847f80f0e03",
               "name": "Michael Goodliffe",
               "profile_path": "/mVLnHVX3VvDAk3UNBrBtxxPsVje.jpg",
               "id": 78940,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Robertson",
               "gender": 0,
               "credit_id": "52fe462cc3a36847f80f0e07",
               "name": "Alex Mackenzie",
               "profile_path": null,
               "id": 141578,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Old Macpherson",
               "gender": 2,
               "credit_id": "52fe462cc3a36847f80f0e0b",
               "name": "Ernest Thesiger",
               "profile_path": "/bmgsa81yJ2sYIrFLqiCKLaRDg4t.jpg",
               "id": 2925,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Graham",
               "gender": 2,
               "credit_id": "52fe462cc3a36847f80f0e0f",
               "name": "Moultrie Kelsall",
               "profile_path": null,
               "id": 132720,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Macleod",
               "gender": 0,
               "credit_id": "55436619c3a3680ce30019d5",
               "name": "Roddy McMillan",
               "profile_path": null,
               "id": 113639,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Nightwatchman",
               "gender": 0,
               "credit_id": "55436638c3a3680cdf001b38",
               "name": "James Gibson",
               "profile_path": null,
               "id": 186718,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Mr. White",
               "gender": 0,
               "credit_id": "554366579251415876001a3c",
               "name": "Noel Howlett",
               "profile_path": "/rMwMT71awpHUBSyXJO4yvhIuKCd.jpg",
               "id": 47383,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Mr. Meekie",
               "gender": 0,
               "credit_id": "554366709251415865001c1e",
               "name": "Abe Barker",
               "profile_path": null,
               "id": 317943,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Mr. Munson",
               "gender": 0,
               "credit_id": "55436687c3a3680ce8001b3d",
               "name": "Gordon Phillott",
               "profile_path": null,
               "id": 1461523,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Commentary spoken",
               "gender": 2,
               "credit_id": "554366bc925141586f001a07",
               "name": "Sam Wanamaker",
               "profile_path": "/aE8H0qNiON4ZN1r7KDBgPuDSA73.jpg",
               "id": 21520,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe462cc3a36847f80f0deb",
            "name": "Charles Crichton",
            "profile_path": "/9ahf7Ghdy9x9pXue1PeC1bFMu2y.jpg",
            "id": 8929,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.028945,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 43106,
      "vote_count": 8,
      "budget": 0,
      "overview": "Angela Barrows is a man-eating business woman sent by her American employer to investigate their export opportunities in Edinburgh. En route she meets Robert MacPherson a businessman who asks for her help to bring his company into the 20th Century. The staff, led by Mr Martin has other ideas though, and a battle between the old and new business methods soon breaks out.",
      "similar": [],
      "original_title": "The Battle of the Sexes",
      "runtime": 84,
      "poster_path": "/ezlxZUaH6DiiRRsOlMl8xoMwy5R.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Prometheus Film Productions Ltd",
         "id": 18149,
         "origin_country": ""
      }],
      "release_date": "1960-02-25",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Crichton"],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "James Thurber",
         "Monja Danischewsky"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052607/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4ODM1MjAzNV5BMl5BanBnXkFtZTcwNjMwOTI0MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Sellers, Robert Morley, Constance Cummings | See full cast and crew »"],
      "reviews": [
         "Peter Sellers could do just about anything and this film helped to prove that fact. With some white hair, a moustache, and spectacles, you thoroughly believe his transformation into Mr. Martin, a character at least twenty-five years older than the actor was at the time. Although the title sounds like a sex romp, that's not the right description of this clever comedy with a somewhat dark theme. But BATTLE OF THE SEXES is about a power struggle between a man and woman. Martin is the faithful manager at the House of MacPherson, a Scottish firm that's been turning out tweed the same way for decades. When the new heir (Robert Morley) takes over, he brings in a domineering efficiency expert (Constance Cummings), an American no less, whose ideas threaten to ruin the company. Martin is forced to act. While he seems like a quiet and unassuming sort, he actually has a lot of guile and cunning beneath his mild-mannered exterior. First he tries to get her fired, but when that doesn't work he decides that more drastic measures are called for - like murder. Martin comes up with what he believes is the perfect plan, and all he has to do is carry it out. Do yourself a favor and watch it all unfold. Entertaining from start to finish, hilarious in several places, with a good supporting cast, and a plot that has a couple of surprises in store. Sellers proves yet again that he's a true comic genius. Three cheers for that, and four stars out of five for the film.",
         "A delicious mix of dry comments, cultural clashes and devious expressions. Sellers is excellent as the mouse-like Mr Martin shocked to the core by the brash Miss Barrows and driven by his devotion to the family to protect tradition at all costs ! The bumbling uncertainty of the head of the Tweed empire could only be achieved by Morley whose portly figure towers over his frail employees as they await his next disastrous decision. Great examples of new not always being better (or not allowed to be !) form the key of the battle until the final hilarious showdown between the American and Scottish way of thinking. Every second is a film treat - should be on everyone's shelves !",
         "The Battle of the Sexes is directed by Charles Crichton (The Lavender Hill Mob/ The Titfield Thunderbolt) and it stars Peter Sellers, Robert Morley & Constance Cummings. It's based on the short story The Catbird Seat written by James Thurber, with the script written by Monja Danischewsky. The grand House of MacPherson in Scotland has been supplying genuine Scottish tweeds for many years. Tho Woven out in the sticks by the professionals, the tweeds are sold out of the Macpherson HQ in Edinburgh. When Old MacPherson (Ernest Thesiger) dies, his son, Young MacPherson (Morley), takes over but is hardly blessed with business acumen. Things start to get dicey when he brings in Angela Barrows (Cummings) as an efficiency expert, an American lady he met on the train. The ageing staff, led by Mr. Martin (Sellers), is horrified as she starts updating the methods of running a business. To their minds a woman is for making the tea and cleaning up, not for doing away with hundreds of years of tradition with new fangled contraptions and ideas. However, Mr. Martin hatches a plan to rid the company of this meddlesome modern tyrant. Something of an unknown British comedy featuring the great Peter Sellers, The Battle of The Sexes sees him teamed with Crichton to deliver a smart and very funny piece. The film is dealing in cultural clashes and the battle is not just of the sexes, but also a poignant conflict between the advent of time and its impact on business'. Arcane traditionalists versus the forward thinking modern capitalist: or if you like? British custom versus American progress. Both played superbly by Sellers; as the calm and unhurried Mr. Martin; and Cummings as the get up and at em quickly Angela Barrows. Danischewsky's script is very impressive given that the source was very slight, and Crichton has done wonders to not let the film descend into slapstick or out of place screwball. Much like Mr. Martin, the comedy is very sedate, unhurried or forced. There's some farce in there, with one chase sequence in Angela's apartment wonderfully constructed, but the film never gets out of control and it's all the better for it. As the two rivals try to outwit each other, this brings Morley's (great as usual) oblivious Young Mac into play. The result is a three pronged character piece deserving of a bigger audience. 8/10",
         "Just like the criticism from feminists that Laurel & Hardy rarely paint a realistic picture of a wife, girlfriend, or woman in their films (Mae Busch is certainly one tough customer against them), the writer - cartoonist James Thurber was also accused of misogyny. His female characters are eccentric, blasé about the worst tragedies that befall male characters (a woman confronts a hippopotamus in the jungle, and we see the remains of a man's clothing and property on the ground - \"Just what did you do with Dr. Millmoss?\" she asks waving her finger in the hippo's face, like she is a kindergarten teacher), and frequently fully ready to do battle to the death for domination of their male counterparts. So women do have a point, but Thurber is equally critical about the men who inhabit his planet too. All too frequently they are cowardly - witness his greatest fictional character, \"Walter Mitty\", who retreats into fantasy to survive a dreadful life. Thurber did a series of cartoons entitled \"The War Between Men and Women\" that traces a genuine war between the sexes. It does end with a male victory (femenists please note). But he also wrote this short story, \"THE CAT BIRD'S SEAT\" which is like an expanded version of an earlier tale called \"THE UNICORN IN THE GARDEN\". In both, a Walter Mitty type man is confronted by a dominating wife or woman, and manages to turn the table on her by \"proving\" to the people who matter that the woman is crazy. \"THE UNICORN IN THE GARDEN\" was actually a Thurber fable, and it has been made into several films or television episodes (one was on MY WORLD AND WELCOME TO IT). THE CAT BIRD'S SEAT is a little different. It turned out to be made into a film only once - in 1959, and in Great Britain - not the United States. It's stars are Peter Sellers, as a meek Scotsman working in a century old textile firm in Edinburgh. It's current owner is Robert Morley, who has more money than sense. Morley has spent most of his time in London, so he has forgotten that the great capital of the North is a slower, more traditional place than the hated southern capital. Morley has met Constance Cummings, an energetic American businesswoman, who has depressed the morale of the American firm she has been working for. In fact, when the film begins, Cummings is told (rather cruelly by a drunken Donald Pleasance) that he was told to accompany her to London not for business conferences, but to unceremoniously dump her as she was boarding a train. Her male counterparts (including Pleasance) are entirely upset at her showing them up by her superior abilities and energy. Hence the way they drop her. Morley is too fatuous to understand what a danger this woman will be to his staff. He is just impressed at her stroking his ego, and her big ideas about expanding business by modernizing equipment and processes that have stood the test of time. Sellers, the business manager when Morley is usually away, watches with horror as a complicated inter office intercom system is put in for the staff to use to contact each other (rather than just walking over to each other's desk). The wisdom of this development is shown to Morley when one of his employees (while trying to get a cup of tea) pushes the wrong button and says something insulting about Morley in his hearing. Other innovations are coming, and Morley is certainly under Cummings' thumb. Sellers comes up with the idea of killing the American, and goes to her apartment. But at the last moment he just can't bring himself to do it. Instead, Cummings unwittingly gives him a better idea. Who'd believe he would ever visit her at night at her apartment? Taking advantage of this, he starts telling her his wild \"plan\" to get rid of Morley and take over the firm with Cummings as his partner lover. He convinces her that he means business, and she tries to warn Morley, who has shown up for dinner. But Sellers, Morley, and Cummings (in a well choreographed sequence) keep missing each other in the apartment, so that the next day Sellers can deny he ever was there. Which may lead to Cummings leaving the firm. Or will it? As a follow - up to THE SECRET LIFE OF WALTER MITTY and THE MALE ANIMAL, THE BATTLE OF THE SEXES is worthy to be watched with them. Despite the expansion of the story to give it the Scottish atmosphere, and Morley's fatuous boss, everything works. And as with WALTER MITTY, after you've seen this read THE CAT BIRD'S SEAT to see what was the original tale like.",
         "This one is a lot of fun, wryly funny, not over-produced and, of course, impeccably cast. Sellers was often sabotaged once Hollywood purloined him but here he's in fine form and gives one of his cleverest performances. Robert Morley lends just the right level of support and Constance Cummings makes a formidable opponent to Sellers's mild-mannered Scot. She's extremely funny without being allowed to go too \"over the top.\" Looks like this one is not available on video so catching it on TV will reward those who keep a sharp eye on the broadcast listings.",
         "A gentle, funny tale by a master storyteller, turned into a delightfully droll film with the supremely gifted Peter Sellers in yet another magnificent performance. Based on \"The Catbird's Seat\" by one of my favorite authors, James Thurber, the film is typical English understated comedy, which makes me laugh heartily. There is no meanness in this film, no put-downs of either gender. It's just a story of an encounter between Old World England and New World America circa 1950s. Dated? Yes, but terrifically funny nonetheless. My only complaint: It's not available for purchase anywhere that I've been able to discover. If it were, I'd buy it in a New York minute.",
         "In order to get her out of their hair, her US employers send powerful businesswoman out to Scotland on some vague mission to investigate export potential. On the way she meets businessman Robert MacPherson who asks for her help to improve the efficiency of his late father's company. The mere suggestion that a woman would be brought into the male dominated company causes panic within the stuffy departments of the company \u0096 especially since the sole woman employee only makes tea for the men. Things only get worse when she starts updating the company, suggesting centralised tweed production in a factory, changing filing systems and carrying out time & motion studies. Happily employee Mr Martin is on hand to try and outwit her modernising ways. In this comedy the plot could easily just involve a man coming into a company because the battle is less one of male versus female and more a matter of old school versus new school where, much I'm Alright Jack, Sellers leads the defence against such action. Looking at it this way the film is much more interesting because it keeps it relevant (nobody likes change) whereas the idea of working for a female boss is no longer the crazy modern idea that it may have once been. The film uses this story reasonably well and produced a few chuckles from me while managing to maintain a consistent amusing tone. The lack of really sharp jokes or big laughs is a bit of a problem though, and it would have been better if the commentary had been sharper and some of the comic sequences had had more laughs but the overall tone is quite nice. The main reason it is quite funny is the subtle playing of Sellers who is gently amusing and sets the tone well for the material; perhaps not one of his most famous creations but he is enjoyable nonetheless. He is well supported by Morley, who plays the blundering boss with enthusiasm and adds to the comedy. Cummings is quite good and brings out well the manipulative nature of some women \u0096 turning on femininity and tears when it suits them; she does this well without being cruel to her sex I thought. The support is mainly good and includes a brief appearance from Donald Pleasence but really the film belongs to Sellers in his quiet role along with Morley and Cummings. Overall this is not a great film mainly because it lacks a sharp intelligent edge that it could have had and not replacing that with enough broad laughs to do the job. The cast really help and the material is good enough to be roundly amusing and it is worth a look because it is a pleasing little film even if it isn't anything that special or memorable.",
         "This well-cast adaptation of a classic James Thurber story relocates the action to Edinburgh and offers Peter Sellers one of his best roles as a timid bureaucrat who turns into a man of action when the crusty family firm he works for is threatened by an \"efficiency expert\" (and a female one at that!). His bumbling attempts to resolve the situation at the climax are a delight whilst co-star Robert Morley is perfect in the sort of role that he was born to play. There's some fine location work, beautifully shot in black-and-white by Oscar-winning cinematographer Freddie Francis and a late screen appearance by \"Doctor Praetorius\" himself, the sepulchral Ernest Thesiger.",
         "Contrary to what IMDb shows at the upper-right corner of its page for this movie, there IS a DVD of this film available, in the UK. I recently purchased it from Amazon, there, for 6 pounds. With high hopes, I inserted it into my DVD player and found that the quality of the film-to- digital transfer is nothing short of abysmal. Most of the film's scenes appear almost entirely black on the TV screen, with only a few details, like well-lit faces, shining through. This is a sorry re-release of this movie, which I had read such good things about here and there. From all I can tell, it is a delightful movie, full of wit and good acting and clever dialog. The story centers on a female business consultant from the US trying to whip an old-line tweed making company in Scotland into shape - another post-war British film concerned with the onslaught of American values and speedy lifestyle. (Another example that comes to mind is Ealing Studio's The Maggie, which is happily out on DVD in an optically splendid rendition.) The star, here, is a somewhat mousy Peter Sellers who is, of course, worth watching in almost any movie - especially when you can actually see him! Robert Morley, too, is worth the price of admission - one of my favorite British actors.",
         "I read Thurber's short story, \"The Catbird Seat\" as a part of my English course in school, and thoroughly enjoyed it then. Seeing the film version (years later) was a real treat. Peter Sellers was very good as the shy and sneaky Mr. Martin, but Constance Cummings reduced Miss Barrows to a caricature. Her breakdown at the end of the film comes across as contrived - she makes it look as if Miss Barrows is pretending to cry to get sympathy. Other than that, it is a thoroughly enjoyable film to watch."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Prometheus Film Productions Ltd."],
      "summaries": ["Man-eating businesswoman, Angela Barrows is sent by her US company to Edinburgh to investigate export opportunities. She meets businessman Robert MacPherson en route and he persuades her to help bring his company into the 20th century. The staff, lead by Mr. Martin, have other ideas and a battle between the old and new business methods breaks out."],
      "budget": 0
   },
   "movielensId": 2299,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1960-02-25",
      "dvdReleaseDate": null,
      "directors": ["Charles Crichton"],
      "runtime": 84,
      "movieId": 2299,
      "title": "The Battle of the Sexes",
      "mpaa": "",
      "actors": [
         "Peter Sellers",
         "Robert Morley",
         "Constance Cummings",
         "Jameson Clark",
         "Donald Pleasence",
         "Michael Goodliffe",
         "Alex Mackenzie",
         "Ernest Thesiger",
         "Moultrie Kelsall",
         "Roddy McMillan",
         "James Gibson",
         "Noel Howlett",
         "Abe Barker",
         "Gordon Phillott",
         "Sam Wanamaker"
      ],
      "imdbMovieId": "0052607",
      "originalTitle": "The Battle of the Sexes",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Angela Barrows is a man-eating business woman sent by her American employer to investigate their export opportunities in Edinburgh. En route she meets Robert MacPherson a businessman who asks for her help to bring his company into the 20th Century. The staff, led by Mr Martin has other ideas though, and a battle between the old and new business methods soon breaks out.",
      "tmdbMovieId": 43106,
      "avgRating": 3.14,
      "releaseYear": "1960",
      "numRatings": 50,
      "posterPath": "/ezlxZUaH6DiiRRsOlMl8xoMwy5R.jpg"
   }
}