{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "southern usa",
            "id": 531
         },
         {
            "name": "suspicion",
            "id": 3301
         },
         {
            "name": "cousin",
            "id": 4438
         },
         {
            "name": "court",
            "id": 6148
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "wrongful arrest",
            "id": 160497
         }
      ],
      "imdb_id": "tt0104952",
      "video": false,
      "title": "My Cousin Vinny",
      "recommendations": [
         10141,
         9346,
         9434,
         11977,
         10890,
         1406,
         9013,
         11896,
         11584,
         8012,
         10859,
         10158,
         8592,
         9080,
         11064,
         10218,
         11153,
         13342,
         11520,
         9749
      ],
      "backdrop_path": "/AsQfq68MrMt5Itb8wTIzkLLGGoI.jpg",
      "revenue": 64088552,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Vincent 'Vinny' Gambini",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e52b",
               "name": "Joe Pesci",
               "profile_path": "/2CaYAhUZgkAeqtpIzuqGcqArsOy.jpg",
               "id": 4517,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "William 'Billy' Gambini",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e52f",
               "name": "Ralph Macchio",
               "profile_path": "/nTiV5ux56X4dmX5Qvriw8r7SgLz.jpg",
               "id": 2877,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mona Lisa Vito",
               "gender": 1,
               "credit_id": "52fe43639251416c7500e533",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Stan Rothenstein",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e537",
               "name": "Mitchell Whitfield",
               "profile_path": "/xvLWnBsTbUmW9KcDkH7pvi5W6v0.jpg",
               "id": 19505,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Judge Chamberlain Haller",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e53b",
               "name": "Fred Gwynne",
               "profile_path": "/xwDhOItVPzmBDfPqNMPHSSdXOMj.jpg",
               "id": 56266,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Sheriff Farley",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e56f",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Jim Trotter III",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e573",
               "name": "Lane Smith",
               "profile_path": "/js7GonfBVNHLYhaB0Xjtnm93DpH.jpg",
               "id": 65019,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "John Gibbons",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e577",
               "name": "Austin Pendleton",
               "profile_path": "/pxcdhd4oAsnhvUg0BalmiiKJyXg.jpg",
               "id": 6168,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Ernie Crane",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e57b",
               "name": "Raynor Scheine",
               "profile_path": "/o5jW5NDeFPIyETEVJQItQEqmJcx.jpg",
               "id": 21082,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "George Wilbur",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e57f",
               "name": "James Rebhorn",
               "profile_path": "/cRbeDNPpcWKP0nLkXo5Bi1tq61w.jpg",
               "id": 8986,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "J.T.",
               "gender": 2,
               "credit_id": "52fe43639251416c7500e583",
               "name": "Chris Ellis",
               "profile_path": "/vbltM7DQXON9xvpiyNuUCglNRmz.jpg",
               "id": 8191,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43639251416c7500e541",
               "name": "Jonathan Lynn",
               "profile_path": "/nvMGnGbGdXrRvGAjulNqhJWUB9c.jpg",
               "id": 21217,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43639251416c7500e547",
               "name": "Dale Launer",
               "profile_path": null,
               "id": 14089,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43639251416c7500e54d",
               "name": "Dale Launer",
               "profile_path": null,
               "id": 14089,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43639251416c7500e553",
               "name": "Paul Schiff",
               "profile_path": null,
               "id": 18344,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43639251416c7500e559",
               "name": "Randy Edelman",
               "profile_path": "/fGS6OjvQpivFVajkmjTRgRiC9BN.jpg",
               "id": 14712,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43639251416c7500e55f",
               "name": "Peter Deming",
               "profile_path": "/3NgM7E5kRYFMXY5znBPktbeI6qB.jpg",
               "id": 9573,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43639251416c7500e565",
               "name": "Tony Lombardo",
               "profile_path": null,
               "id": 56972,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43639251416c7500e56b",
               "name": "Stephen E. Rivkin",
               "profile_path": null,
               "id": 1721,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58fb911192514163df010a64",
               "name": "Victoria Paul",
               "profile_path": null,
               "id": 22008,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "58fb911892514163ec010305",
               "name": "Michael Seirton",
               "profile_path": null,
               "id": 6801,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "58fb911e9251416428010374",
               "name": "Rando Schmook",
               "profile_path": null,
               "id": 1448828,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58fb9125c3a3687a2a00f812",
               "name": "Michael Rizzo",
               "profile_path": null,
               "id": 22009,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58fb912fc3a36879f400ee16",
               "name": "Carol Wood",
               "profile_path": null,
               "id": 1322504,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 7.108403,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10377,
      "vote_count": 472,
      "budget": 11000000,
      "overview": "Two carefree pals traveling through Alabama are mistakenly arrested, and charged with murder. Fortunately, one of them has a cousin who's a lawyer - Vincent Gambini, a former auto mechanic from Brooklyn who just passed his bar exam after his sixth try. When he arrives with his leather-clad girlfriend , to try his first case, it's a real shock - for him and the Deep South!",
      "similar": [
         107846,
         873,
         5925,
         9291,
         1429,
         9800,
         314365,
         396371,
         392982,
         8438,
         1701,
         1368,
         708,
         76640,
         57201,
         10447,
         5971,
         1645,
         11327,
         13291
      ],
      "original_title": "My Cousin Vinny",
      "runtime": 120,
      "poster_path": "/zcd2U5BAP0rYOucfcj8nE4VVVKC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Palo Vista Productions",
            "id": 89303,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Peter V. Miller Investment Corp.",
            "id": 89304,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1992-03-13",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "Truth, Justice and the Gambini Way",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jonathan Lynn"],
      "runtime": 120,
      "synopsis": "While driving through the fictional Beechum County, Alabama, New Yorkers Billy Gambini (Ralph Macchio) and his friend Stan Rothenstein (Mitchell Whitfield) accidentally neglect to pay for a can of tuna after stopping at a convenience store. After they leave the store, the clerk is shot and killed off-camera, and Billy and Stan, who match the descriptions of the murderers given by witnesses, are then pulled over and detained in connection with the murder. Due to circumstantial evidence and a series of miscommunications based on the boys assumption that they have merely been detained for shoplifting, Billy ends up being charged with murder, and Stan is charged as an accessory. The pair call Billy's mother, who tells her son that there is an attorney in the family, Billy's cousin, Vincent LaGuardia \"Vinny\" Gambini (Joe Pesci), who travels to Beechum County accompanied by his fiancée, Mona Lisa Vito (Marisa Tomei). Unfortunately, although he is willing to take the case, Vinny reveals himself to be a neophyte personal injury lawyer from Brooklyn, New York, newly admitted to the bar (after six attempts and six years) with no trial experience whatsoever. Although Vinny manages to fool the uptight and conservative trial judge, Chamberlain Haller (Fred Gwynne), about being experienced enough to take the case, his ignorance of basic court procedures and abrasive, disrespectful attitude towards the judge gets him into trouble immediately. During the arraignment, Vinny has no idea what he's supposed to do and angers Judge Haller with his ignorance of whether or not to plead \"guilty\" or \"not guilty\" for Stan and Billy. The next day, Vinny's ignorance and inexperience causes more harm, much to Billy and Stan's consternation. Vinny does not even bother to cross-examine any of the witnesses in the probable cause hearing. As their claims go unquestioned, it appears that the stuffy prosecutor, District Attorney Jim Trotter III (Lane Smith), has an airtight case that will inevitably lead to a conviction at the trial. After Vinny's poor showing at the hearing, Billy and Stan decide to fire him and use the public defender, but Vinny asks for one more chance to prove himself. After several weeks of preparation, the trial then opens with Vinny representing his cousin and the public defender representing Stan. Despite some further missteps, including wearing a gaudy secondhand suit to court (as his new suit fell in the mud) and sleeping through Trotter's opening statement, Vinny shows that he can make up for his ignorance and inexperience with an aggressive, perceptive questioning style. While the public defender stutters through a line of ill-prepared questions that appears to bolster the case against the boys, Vinny quickly and comprehensively puts into question the testimony of the first witness Sam Tipton (Maury Chaykin) who testifies seeing Bill and Stan arrive at the Sac-O-Suds parking lot before he started cooking his breakfast grits and saw them flee from the scene after hearing a gunshot. Vinny is able to show that 20 minutes had actually passed between those two events, not the five minutes that Tipton claims, thus opening the door to the idea that there may have been two cars involved. Billy's faith is rewarded, and Stan develops newfound respect and confidence for Vinny, firing the public defender. The next day, Vinny's cross-examinations of the remaining eyewitnesses are similarly effective. The elderly Mrs Riley (Paulene Myers)'s testimony becomes suspect because she could not identify how many fingers Vinny was holding up at half the distance she had been from the getaway car. Redneck Ernie Crane's (Raynor Scheine) testimony is made to question his own identification of the \"two men in a green convertible\" when he was forced to realize that he had made it looking through a dirty window, crud covered screen, a bunch of leaf-covered trees, and seven bushes. But on the third day of the trial, Trotter produces a surprise witness, George Wilbur, an FBI analyst who testifies that his chemical analysis of the tire marks left at the crime scene shows that they are identical to the tires on Billy's Buick Skylark. With only a brief recess to prepare his cross-examination and unable to come up with a particularly strong line of questions, Vinny becomes frustrated and lashes out at Lisa by taunting her about the usefulness of her wide-angle photographs of the tire tracks. She storms out, leaving Vinny alone. However, Vinny later realizes that that photo actually holds the key to the case: the flat and even tire marks going over the kerb reveal that Billy's car could not have been used for the getaway (The Buick had an axle that connected the two wheels, and would make a tilted, not flat, impression of the lower tire when going over the kerb. The tire marks are both flat, revealing the car that made the marks had an independent wheel suspension system.) Vinny needs Lisa, an expert in automobiles, to testify to this. He drags her into court, and during Vinny's questioning, they patch up their differences. Vinny then recalls the FBI analyst, who concurs with Lisa that Billy's car did not produce the tracks. Next, Vinny calls the local sheriff, who has run a records check at Vinny's request. The sheriff testifies that two men resembling Billy and Stan were arrested a few days earlier in Georgia for driving a stolen Pontiac Tempest, a car very similar in appearance and color to Billy's Buick Skylark, and in possession of a gun of the same caliber used to kill the clerk. Trotter then respectfully moves to dismiss all the charges. Throughout the film, Vinny and Judge Haller play a game of cat-and-mouse over Vinny's qualifications. Haller first discovers that, despite Vinny's claims that he tried \"quite a few\" murder cases, there exist no records of anybody named Vincent Gambini trying any case in New York State. Aware that Judge Haller will not let him be Stan and Billy's legal council if he finds Vinny to be inexperienced, Vinny then begins a series of lies by claiming that he had his name changed during a previous career as a stage actor and continued to use the name when he opened a law practice. Vinny, believing that he should give the judge the name of someone with the kind of resume he claimed to have, supplies the name of a prominent New York attorney, Jerry Gallo. Unfortunately, Lisa later tells Vinny that Gallo passed away the previous week, and when Haller learns this, Vinny claims that Haller misheard \"Gallo\" when Vinny actually said \"Callo\". Finally, Lisa gets Vinny off the hook by calling his mentor, Judge Malloy from New York, who responds to Haller's request by claiming that 'Jerry Callo' has a long and impressive trial history. The film concludes with Haller apologizing for doubting Vinny and praising his skills as a litigator. Vinny and Lisa then drive off together, discussing how they were able to fool the judge about Vinny's qualifications and arguing about plans for their wedding.",
      "writers": ["Dale Launer"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0104952/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNDYzMTg1M15BMl5BanBnXkFtZTgwNzk4MDgxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Joe Pesci, Marisa Tomei, Ralph Macchio | See full cast and crew »"],
      "reviews": [
         "My Cousin Vinny is one of the most brilliant comedies ever produced. There is simply so much to love about this movie. First, this is not simply a slapstick comedy. Sure, there is some of that, including a few hilarious moments in the Alabama mud. But the dialogue in this film is terrifically funny. The writers were able to turn a courtroom script into an incredibly funny exchange of dialogue between lawyers, judges and witnesses. And the whole idea of an out-of-work hairdresser knowing about Positraction is simply brilliant. This dialogue is brilliant because of excellent performances by both Marisa Tomei and Joe Pesci. These two sell this whole load of nonsense so beautifully it should be mandatory viewing for first-year drama students. These two actors show how talented people can read practically anything and make it not only funny but wholly believable. Even all the side characters, from the judge to the D.A. to the defendants to the jury and witnesses are brilliantly played. Some of the exchanges between a local Alabama judge and a NYC poser lawyer would be completely ridiculous in anyone else's hands, but these people make it so real and so funny it's truly a thing of beauty. This is one of those rare films that I can watch over and over again for hours and not tire of it. 10 out of 10 Barky",
         "\"My Cousin Vinny,\" along with the megahit \"Goodfellas,\" put Pesci on the map. Of course, he's been in the Scorcese's previous hit \"Raging Bull,\" but didn't get a hell of a lot of recognition at the time. Joe Pesci's character of Vincent LaGuardia Gambini is a landmark character in comedy history. When his New Yauker street smarts collide with Southern hospitality--brilliant fish-out-of-water humor ensues! Of course, Pesci should've be given all the credit. Marisa Tomei, who RIGHTFULLY won the Supporting Oscar for her excellent performance (please don't believe that urban myth about Jack Palance calling out the wrong name!!), is hilarious as Pesci's fiance with a foul mouth, a smart a**, the heaviest Brooklyn accent and an incredible expertise in automobiles. This was also the movie that made Marisa a star, and a performance I commend to this day. What can I say? This movie has some of the most priceless bits of comedy. One, of course, involves Pesci's pronunciation of the word \"youth\" which sounds like \"yute.\" One underrated bit is the one where Pesci first meets his cousin's friend (Mitchell Whitfield) in the jail cell. His cousin (Ralph Macchio) is asleep and Pesci suddenly pays the friend a visit. He doesn't know Pesci is the lawyer, and assumes he's some guy who...wants to make him his b**ch. The comic dialogue in that scene is so perfectly executed and I feel it's one of the funniest in the movie. I'm not going to give away any more of the film's slick, intelligent humor--You have to see it for yourself!!! If you're in the mood for a smart, well-written, well-acted comedy that will have you on the floor--look no further! \"My Cousin Vinny\" doesn't disappoint in any of those aspects. This is a truly memorable piece of comedy, and though it was released in 1992, I'm sure comedy lovers will pay homage to this movie in the present day. My score: 8 (out of 10)",
         "Underrated. I won't belabor relating and describing the plot, because that's been recited nicely by numerous others. I'll simply return to my one word point. Underrated. Even though Marisa Tomei broke through and won Best Supporting Actress at the Academy Awards for her performance, an award she earned and much deserved, I still say underrated. This film really never got on the public's radar the way it should have, probably because there are no big-name actors featured as box office draw. Joe Pesci was as good as it gets that way. In 1991 he was the hottest name in the cast. But has Joes Pesci ever established himself as a leading man who could carry a movie by himself? I ask that in open-ended wonderment, and certainly not disparagingly. Just asking, is it fair, has it ever been fair, to expect Joe Pesci to carry a film? Regardless of Joe Pesci's latent starpower, this cast of players as assembled possessed remarkable chemistry in the performances they gave, not only in their interactions with one another, but also in the creation of a final product that excels way beyond the sum of its parts, beyond any of their individual levels of genius, certainly beyond anything that could ever have been reasonably expected of them. Competent though they may have been, these were not thespian heavyweights or comedic savants. You ever wonder why this singular performance 15+ years ago and counting remains Marisa Tomei's magnum opus? That might be one big reason why. The Germans have a word for this. It's called gestalt. My inclination is to give most of the credit for this winning final product to director Jonathan Lynn. It seems obviously to be his creation. Who else singularly deserves it? Along the way it would have been such a cheap trick and easy thing to surrender to the obvious, but Lynn didn't do it. This is a story built around stereotypes. New Yorkers. Ethnic Italian New Yorkers. Southerners. Small town southerners. Southern justice. Southern small town justice with New York Italians in the dock. It would have been so easy to traffic in those stereotypes, to over-the-top cash in on them, to submerge the movie in them and to exploit them for all they were worth. These people could have been made into cardboard cartoons of themselves. Surely the Englishman Lynn was thusly tempted, but it was a temptation he mainly resisted. Oh, almost obligatorily, he dances us over to that edge and gives us a big whiff of all that, but instead of jumping in and wallowing in the stereotypes, he deftly pulls it back and carries it all off and away in a new and different direction, indeed in an uplifting direction. Just as there are no cheap tricks in this movie, there are no cheap shots either. People are not ridiculed for who they are or where they are from. It rises above that. Lynn raises it above that. Yes, the regional differences that exist are juxtaposed. And yes, we get the fact that cultural differences divide these characters. But the beauty of it is that no one is treated unfairly. In fact, the viewer comes away with the feeling that these are all good people. Joe Pesci and Marisa Tomei are given a broad canvas to create great humorous art, bouncing one, two, three liners or more off of each other, at the other's expense. It's the game they play with each other, the nature of their characters' relationship, and it's fun to watch. And this must be said: not only does Marisa give an exquisite performance, she is an utterly delightful feminine creature to watch here. As for the southerners, in not taking the bait to exploit the southerners as dumb hicks, Lynne actually captures part of the true but rarely portrayed essence of the south: polite gentility. Lane Smith embodies that essence. And Fred Gwynne? He practically steals the show, and would have were it not for Marisa Tomei. What has been going through Joe Pesci's and Marisa Tomei's heads for the last 15 years? What is wrong with their agents? These two needed a sequel. If not a sequel, then more film(s) together. The dynamic between them was too good to just be abandoned. We should have been treated to much more of them together. As a trial lawyer let me say that the portrayal of courtroom events, while certainly not perfect, is more than adequate and passable. One thing that is accurately captured is the fish-out-of-water experience of a city lawyer when subjected to trying a case in a far-flung rural county. This depicton conveys the essence of what that's like. This movie deserves more recognition. It is clever, funny, and fun. I recommend it. If you haven't seen it, do yourself a favor and indulge yourself.",
         "This was the best way for Joe Pesci to follow up GOODFELLAS and JFK. Those two were ultra-serious roles for him and to forray into comedy was perfect. It was a perfect role, perfect timing and a perfect opportunity to show people that he could play something other than the heavy or the bad guy. MY COUSIN VINNY is really just a distant cousin of his character in Goodfellas anyway. Just imagine one of the guys in Goodfellas that didn't want to follow in the footsteps of the rest of the gangsters and this is him. Vinny is a foul mouthed, sometime violent, insecure but smart man. He went to law school but took six attempts before he passed the bar. They are definitely similar characters. The difference is that Goodfellas was a serious film with a funny side and My Cousin Vinny is an absolutely hilarious film with a somewhat serious side. What makes the film work as well as it does, is many things. First of all you have the fish out of water scenario with Vinny and his fiancee Lisa, wearing leather jackets and cowboy boots down in the south where it seems everyone is wearing overalls and they hang out in establishments where their best selling feature is chicken and pool. You also have a great supporting cast that features Lane Smith as a very animated D.A. that has to hammer home every point to his jury like they were morons. He says the word \"truth\" is a word that comes down from England where all of our ancestors come, and looking at him incredulously is some of the black jury members. Fred Gwynne supplies some of the best comedy for the film with his constant badgering of Vinny. Everything from his suit, to his enunciation of words like \"youts\", to his court room impropriety to his just plain dislike of him. Gwynne and Pesci are so opposite as people. Gwynne being a giant of a man with a southern drawl and a long, virile face while Pesci is a short man with a distinct New Yawk slur and a pudgy, baby looking face. They are complete opposites and much of the hilarity comes from their inability to see eye to eye on many things. It also has to said that Marisa Tomei is brilliant in this film. There are people out there that try to demean her Oscar triumph that year because the favourite did not win like anticipated. But her performance here is nothing short of Oscar worthy. She is a gifted actress and her comedic timing in this film is bang on, or as she would say, \" dead on balls accurate. \" This is one of the funnier films to come out in the 90's and it is well worth seeing again. 9 out of 10",
         "I can watch this film over and over again. Joe Pesci plays Vincent LaGuardia Gambini, a Brooklyn lawyer who is asked to defend his cousin and friend from a murder charge in Alabama. Marisa Tomei as Mona Lisa Vito, Vinny's girlfriend, deserved the Academy Award for Best Supporting Actress, rare for a comedy to even be nominated for anything by AMPAS. I really liked Fred Gwynne as the no-nonsense Judge Chamberlain Haller, a great foil for Joe Pesci's laid back, easy going Brooklyn wise guy. Even his name, Chamberlain Haller, evokes seriousness. A lot of fun, especially the courtroom antics of Pesci. Highly recommended.",
         "Definitely one of my all-time favorite comedies. Well directed, well acted -- priceless comic performances by Pesci, Tomei, Gwynne & Austin Pendleton. And more than comedy -- there's also a lot of genuine pathos and real tension and drama, especially in the final courtroom scene. And I really don't understand the \"controversy\" or brouhaha over Marisa Tomei receiving the Best Supporting Actress Oscar for her role in this movie. It's a crackerjack gem of a performance and a stellar comic portrayal. The only thing I can figure is that a lot of snobbery about serious dramatic portrayals somehow being more worthy of honor than great comic performances still very much lives on in much of the film community.",
         "MY COUSIN VINNY is just one of those \"feel good\" movies delivering some grins that won't wash away. An excellent cast includes Joe Pesci in one of his best roles as a hotshot lawyer. Expect a few unbelievable surprises from the irresistible guy who's smart enough to make one hilarious movie after another. He is downright likeable, and so is Marisa Tomei, a sassy and stylish figurine who was amazingly superb to take home the Best Actress Oscar. Both Pesci and Tomei have the colorful wits and personalities to make a wild pair for themselves (almost like living in the 50s for sure!). Also, the movie's best moment arises when a freight train disturbs Pesci's sleep at five in the morning. The deep downside is the latter portion: a climatic courtroom scene that, while up to the point of interest, runs terribly long and weak....until one of the film's cast members gets into the act! Still, it's worth plenty of good gags and good laughs that aren't so bugging. Pesci would look terrific in a torn-up leather jacket in front of the judge, to his ultimate disgrace! Smart comedy is smart thinking after all.",
         "My Cousin Vinny was a great movie. I borrowed this film from a friend but had no idea what it really was but just knowing Joe Pesci, Ralph Macchio, and Marisa Tomei were starring in it. After seeing it, I really liked it. It was a funny movie. There were tons of laughs and I never knew it was going to be this funny but mainly Joe Pesci as Vinny was hilarious. He had the best role in this movie out of anyone but Marisa Tomei as Vinny's fiancée and Fred Gwynne as the judge did wonderful. I was surprised how good the movie was and overall it really entertained me. I highly recommend the film. Hedeen's Outlook: 8.5/10 ***+ B+",
         "Two dim-wits from New York (Ralph Macchio and Mitchell Whitfield) become the victims of circumstance in the deep south in this hilarious courtroom farce. Macchio knows that his one hope is the titled character (the priceless Joe Pesci) and his red hot girlfriend (Marisa Tomei in a well-deserved Oscar-winning turn). The two use street smarts to show the small-town folks that the case is not as cut-and-dried as it seems. 4 stars out of 5.",
         "This is the first film I have seen where Pesci is the lead role and he proved to sore beyond what his talents are, he's definitely one of the most under rated actors of all time, I feel like he's Hollywood's hidden secret weapon. :) I had heard a lot about My Cousin Vinny, I know this was the movie that won Marissa's Oscar and not to mention I heard how funny it was. My Cousin Vinny turned into a very intelligent and great comedic story. It's about two boys who have been accused of murder, with a lot of pressing evidence against them that can get them executed, but one of the boy's cousins, Vinny, is a lawyer, well, just graduated and starting his first six weeks. Not to mention, he's never fought a trial or murder case. Vinny has also brought along his Brooklyn talking fiancée, Mona Lisa Vito. With little experience and getting into a web of lies, Vinny must learn that good arguing is not just what will help, but he also has to learn how to be a lawyer. Joe and Marissa absolutely steal the show. I think my favorite part was when Mona Lisa was on the stand talking about which cars were involved in the murder case, she just got into a fight with Vinny and she refuses to help him, but she does and he kisses her hand and you can tell they made up, but it's just their looks that are just plain priceless! Everything about this film could make anyone laugh and make them fall in love with Joe Pecsi, he's just so awesome! 9/10"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Palo Vista Productions",
         "Peter V. Miller Investment Corp.",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Bill Gambini and Stanley Rothenstein are two friends from New York University who just received scholarships to UCLA. They decide to drive through the South. Once they arrive in Alabama, they stop at a local convenience store to pick up a few snacks. But, no sooner than they leave the store, they are arrested. They had thought that they were arrested for shoplifting, but they were arrested for murder and robbery. Worse, they are facing execution for this crime. Bill and Stan do not have enough money for a lawyer, so the good news is that Bill has a lawyer in his family, his cousin, Vincent Laguardia Gambini. The bad news is that Vinny is an inexperienced lawyer who has not been at a trial. So, Vinny has to defend his clients and battle an uncompromising judge, some tough locals, and even his fiancée, Mona Lisa Vito, who just does not know when to shut up, to prove his clients' innocence. But he will soon realize that he is going to need help.",
         "Two teenage boys from New York are travelling down south when a series of coincidences lands them in jail charged with first degree murder. They can't afford the $50K for an attorney so they call the lawyer cousin of one of the boys. Vinny is a stereotypical New Yorker who is initially a complete disaster, but can he get them off the hook ?",
         "While heading for college, Bill and Stan are arrested in Alabama when circumstances point to them as having murdered a convenience store clerk. Unable to afford an attorney, they turn to Bill's cousin Vinny, a brash New Yorker who took six tries to pass his bar exam. Worse, until now he's only taken personal injury cases, none of which have gone to trial. Dragging along his even more abrasive fiancee Mona Lisa Vito, Vinny will have to straighten up fast, and keep out of jail himself, if he's going to win the case.",
         "Two New Yorkers are accused of murder in rural Alabama while on their way back to college, and one of their cousins--an inexperienced, loudmouth lawyer not accustomed to Southern rules and manners--comes in to defend them."
      ],
      "budget": 11000000
   },
   "movielensId": 2302,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-03-13",
      "dvdReleaseDate": "2000-07-25",
      "directors": ["Jonathan Lynn"],
      "runtime": 120,
      "movieId": 2302,
      "title": "My Cousin Vinny",
      "mpaa": "R",
      "actors": [
         "Joe Pesci",
         "Ralph Macchio",
         "Marisa Tomei",
         "Mitchell Whitfield",
         "Fred Gwynne",
         "Bruce McGill",
         "Lane Smith",
         "Austin Pendleton",
         "Raynor Scheine",
         "James Rebhorn",
         "Chris Ellis"
      ],
      "imdbMovieId": "0104952",
      "originalTitle": "My Cousin Vinny",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["SL4HdaZXuOw"],
      "plotSummary": "Two carefree pals traveling through Alabama are mistakenly arrested, and charged with murder. Fortunately, one of them has a cousin who's a lawyer - Vincent Gambini, a former auto mechanic from Brooklyn who just passed his bar exam after his sixth try. When he arrives with his leather-clad girlfriend , to try his first case, it's a real shock - for him and the Deep South!",
      "tmdbMovieId": 10377,
      "avgRating": 3.57505,
      "releaseYear": "1992",
      "numRatings": 16882,
      "posterPath": "/zcd2U5BAP0rYOucfcj8nE4VVVKC.jpg"
   }
}