{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0139615",
      "video": false,
      "title": "Slam",
      "recommendations": [
         60225,
         122019
      ],
      "backdrop_path": "/xeN6uxr1ao3wBjvjn86mThQJ5ku.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ray Joshua",
               "gender": 2,
               "credit_id": "52fe46539251416c91050ca5",
               "name": "Saul Williams",
               "profile_path": "/cV8sC60M089WHKvu7hQVxHhUfBl.jpg",
               "id": 1985,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lauren Bell",
               "gender": 1,
               "credit_id": "561897d0925141375a00161f",
               "name": "Sonja Sohn",
               "profile_path": "/9Mzop30IpotrrzCKErKCdLEcsGR.jpg",
               "id": 203683,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "561897e1925141374b00153c",
               "name": "Bonz Malone",
               "profile_path": null,
               "id": 104789,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "56189809925141375a00162c",
               "name": "Beau Sia",
               "profile_path": "/tJPFInhJZph41JQQybbyYo22mRW.jpg",
               "id": 1520857,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46539251416c91050cab",
            "name": "Marc Levin",
            "profile_path": null,
            "id": 82286,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.228848,
      "production_countries": [],
      "id": 37532,
      "vote_count": 10,
      "budget": 1,
      "overview": "Slam tells the story of Ray Joshua, an original, gifted young MC trapped in a war-zone housing project known as Dodge City. Unable to find a job, Ray copes with the despair and poverty of his neighborhood by using his wits and verbal talent. Written by Offline Publicist Young Ray Joshua lives in the Washington, DC, district known as Dodge City, which is dominated by gang wars. One day he is arrested when his drug dealer is gunned down while talking to him. He is put to prison where two rival gangs, Thug Life and the Union, want to recruit him as a member.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         948,
         8810,
         298312,
         14433,
         1359,
         141,
         185,
         101,
         205,
         949,
         12162,
         8923,
         769,
         793
      ],
      "original_title": "Slam",
      "runtime": 100,
      "poster_path": "/ia9OuD1ijbO7amEaNzUvbeLWbi0.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-10-07",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Words make sense of a world that won't.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Marc Levin"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Marc Levin",
         "Richard Stratton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0139615/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA3MDE4Njk4MDheQTJeQWpwZ15BbWU3MDY3NDcwMjE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Saul Williams, Sonja Sohn, Bonz Malone | See full cast and crew »"],
      "reviews": [
         "In Marc Levin's Slam, perhaps the greatest asset he and cinematographer Mark Benjamin bring is the documentary-style to this urban-based drama. For the first few minutes of the film, I thought this would be a documentary. In a sense, when I realized when it wasn't it was a letdown, because even though this is a close-to-life depiction story of a kid in the ghettos of Washington DC, somehow if it really was a documentary it might've been even more compelling. As it is, Slam is a very naturalistic first-person drama, and the film deals with a protagonist that isn't hard to identify with, even when things seem a little over-done or even when it's a little naïve. Basic story in two sentences \u0096 Raymond Joshua (Saul Williams, also one of the film's co-writers) is set up to go to prison for pot, and while in prison he meets a few people that recognize his skills as a writer and poet. When he gets out he wants to hold on to the freedom he knows he can attain, but he doesn't know how. With this conflict, Raymond is a character that is recognizable and identifiable with the audience. And with this, Williams creates a constantly believable performance even when his character may not sound entirely believable or realistic. Although the performances are a plus for the film's success, such as Bonz Malone as Hopha, and Sonja Sohn as the writing teacher/poet Lauren, for me the style over-passed the substance. Though the poetry was inspired and the poets in the film who spoke them were very good, some of the story elements were not as effective as they could've been. For example, there's a blind-men analogy when Raymond gets out of jail and sees that his pot-dealer friend, who got shot, is now blind. Raymond is morally in the right in their final scene together, but it's a little too thick of a message for my taste when Raymond says, 'I once was blind too, now I can see.' Williams' poetry (which I assume he wrote himself) is interesting, although it's his delivery that catches my ear over the content. In a pivotal scene his poetry saves him from a beating in the prison yard, yet somehow it doesn't feel as real as some of the other scenes, like with him and Malone's character. As I said, the style was what held the film, especially for such a low budget. I loved the use of the hand-held, shaky mis-en-scene, as though someone was allowed to peek into the atmosphere of DC. And from a psychological standpoint, Levin seems to extract what the essence is of Raymond and his neighborhood. Through his usage grainy color and then to a 8mm camcorder for flashbacks from Raymond, I felt the emotional impact that Levin was going for, the mix of disorientation and of being in a free-fallin' kind of society where you don't know what can happen next. I just wished that I saw more of that with the characters and the story. Cool ending though. B",
         "Fantastic performances, a good story and interesting photography make Slam a very good movie; realism makes it a great one. I was in awe of the utter authenticity of the people, the situations, the energies in this film. I was suitably impressed by the emotions expressed and how effective it all was, for essentially a minimalist message (the odds are stacked against young black males in the inner cities) but even more impressed once I listened to the commentary on the DVD. I highly recommend you get your hands on the disc, and listen to the commentary after watching the film. Sure, it's a bit too self-congratulatory (\"what a beautiful shot!\" [it was only \"nice\"]) but the insight on the people involved--the writers, actors, poets... adds an incredible amount of depth to the experience. To quickly generalize: if you appreciate Spike Lee's work, you'll probably like Slam. Although Spike might be a little upset that a white Jewish director brought this to film :-)",
         "I happened upon Slam quite by coincidence one evening. I just got an updated cable system with all of these channels and movies and music. So I was surfing and I came upon Slam. I had no idea what it was. I had never heard of the movie before, but I was familiar with Saul Williams and his work. I had seen him on a documentary a few years ago. I thought the film was brilliant in the sense that it took a familiar topic and refreshed it. Slam was intense and real. It was preachy without being trite, redundant, cliche, or just plain corny. The actors were totally believable. I bought it. I bought it all, hook, line, and sinker. And in the end, that's all I can ask of a film, to take me somewhere I want to go, but haven't been before. This film was not afraid to tell the truth. And again, more importantly it was not afraid to also tell us that there are no easy solutions or easy roads out.",
         "This movie is responsible for a lot of things and after finally seeing it I now know why. What it lacks in polished film making it more than makes up for in honesty, passion and ambition. From the performances through to the writing and cinematography everything is raw and beautiful and vibrant with life in a way that we never see in Hollywood films. And I'll be damned if the subject isn't poetry and how it exists in and what it makes of real life. How it is real life. In many aboriginal cultures there is no separate category for art that differentiates it from the rest of life and this movie hearkens back to that cultural tradition. A young Saul Williams defines his life, takes action, heals himself and saves others through his poetry. All of the acting is fresh and real but Saul Williams and Sonia Sohn especially shine, as they should. There is something real going on that is being captured here and the rest of America better know what it is.",
         "Really good and believable script, atmosphere and flow, very well acted. It doesn't even matter if the camera crew is totally visible in many pictures in one guys mirror-sun glasses. This is definitely one of the best \"hood\" movies of the nineties. It's also shows you a different kind of hood that you're used to: OK there's some drug selling and rapping, but that's the reality, and reality is what these movies are about. But that's only the beginning: This film grows to be really deep and interesting story about generations, art making (=self-expression), life goals, and the Tragedy of the contemporary world. In this film, for example the rapping thing is portrayed quite funnily; It's more real, in other words also more sad and also more serious, than in the other movies. This film shows what rap, and any kind of art and self-expression is: It's about salvation, it's about ideals, it's about dreaming, it's about rising above. It's about creating your OWN world inside or outside, or above, the world which you don't like and don't wanna support. It's about prisons of the mind that you or some other people have created in your mind which you gotta grow out of to be free. It's a story of courage. It's about miracle of life. This film really shows what it's all about, if someone already don't know. It's a PEOPLE's culture. The MTV and money sh** don't have and will never have anything to do with it. It's a people's way of expressing themselves in their communities. And this film shows it all real beautifully. One of the best movies about artist's life too. It also grows to be a beautiful love story. In all ways it's better than all it's parts combined and all hopes imagined. It's not the best acted film in the world, like some reviewer said, but it might at the top level among the other best. The film is also very nicely shot. It doesn't actually feel like a documentary, but more like what it really is: Quite cheaply and simply (=that means freely) made self-expression. You can feel the joy of the making. I don't have to even mention that the soundtrack is great: One of the best. The world needs this kind of movies. (Or does it?...) At least somebody's world does. Somebody else's world might need movies that glorify violence. This is not that kind of movie. This is not 50 cent. This is not death. This is life.",
         "I really liked this movie. I didn't know anything about this movie except it had poetry and was about urban african-americans. I enjoyed this movie alot. I loved the poetry in the movie too. It shows that people can change and have many different sides to them. Plot: A poet, Ray, is put into jail for possession of 1/4 pound of weed. He can compromise, plea for 2-3 years, or fight and get 9-10. However, the movie is really about his struggle with himself and what he knows. He changes and wants to change. He does not want to end up like everybody else, and will change the world. Acting: I really liked the acting. I especially lied the poetry that went into this movie. I think that the movie is great for its poetry alone, although the rest of the movie rocks as well. Ray is especially good, but that is in my opinion. Presentation: A documentary-like film. This is a good style for its content. I think that the topic and its style are both ultra-realist, so the melt together perfectly. All in all, this is a great, thought-provoking movie that contains a lot of good poetry. There isn't much to talk about without giving the film away. I like the inner struggles. All of the characters are shown to have histories and presents. The film tries to show how they got from start to present. It doesn't imply how everything will end, and I don't want to know. I like to keep guessing..............10",
         "A movie that will move you in every possible way. A 'black gangsta' movie that doesn't rely on mindless violence to give you the 'message'. The 'message' from this movie is beautiful and the poetry is mindblowing (especially the last poem). The acting is excellent throughout and the funny thing is that all the acting is natural and it seems like you are a watching a gritty documentary. (Look out for the jail riot and you will understand what I mean). A highly recommended movie, do not miss it.",
         "Ray Joshua is a rhymer who survives on the streets of Washington by dealing drugs. When the leader of his crew is killed right in front of him he is arrested for possession and sent to jail until the trial. In jail he finds that the world is as violent inside as out and that his prison is in his mind and not the real world. Inside he uses his skills to stop violence and meets Lauren Bell who sees potential in Ray and encourages him to better his situation and get out of his cycle. I am a major fan of HBO's Oz and one of the more interesting actors on there is a guy called muMs who does beat poetry. When I saw Slam coming on it reminded me of him and I thought I'd watch it. I like hip-hop which has strong lyrics so it's a little like that, although I do dislike the more pretentious side of street poetry \u0096 so I could have gone either way on this. Happily I really liked it on the whole. The film is energetic and doesn't just focus on `using the gifts to get you outta da hood' type message that I expected it to. Far from it. Instead it looks at the prison Ray is in both inside and out on the street and how he needs to get out of that. I was surprised but impressed by the writer/actor's message of accepting punishment for what you've done wrong but then make yourself free after your time is done. The film isn't perfect and the director does like to have tonnes of sunsets and stuff in his films which take away from the real feel to it. Likewise Ray is written far too soft. Rather than focus on a youth is really is trapped in a bad situation and engrained in it, the film makes Ray very soft. He is `only carrying a few grammes' of stuff, he is kind to kids and doesn't see the need to take sides in prison. The film would have been better if the character had been less `good' at the start. However knowing a little about how it was made, made me like the film more and respect it. It was made in 9 days. The rough scene structure was laid out for each scene, but it was all improvised rather than run off a word for word script. Knowing this I was impressed by how well it all worked and how good it looked. Williams is really good as Ray and carries the beat and the emotion really well. His skills are good and when he feels trapped and wronged \u0096 you believe him. He has a good chemistry with Sohn, even if her character is a little too clean looking for the past she rages against. The support cast are all pretty good save a few gangsta roles. Those in prison are believable and the poets/rappers are all pretty tight except a few pretentious ones in the show at the end of the film. As a ghetto movie this is well above the norm and delivers a brutally honest message for black youth to accept what they are doing, bare the consequences but then to move on with their lives. This is refreshing and does more than a lot of the black comedies that we see a lot of rappers doing now \u0096 this film may help. Even if you're not into rap or beat poetry this film has enough power in it to keep you watching.",
         "The best films, in my opinion, are those which challenge your conventions and beliefs and really make you think. Slam did that in Spades. I was completely lost in it. The cinema-verite style (the film was shot remarkably like a documentary) completely drew me in. Slam will stick with me for a long time to come. Also, anyone who knows Washington, D.C. will recognize that this was a great use of D.C. as the setting for a movie. Usually D.C. is used as just a pretty backdrop, but in this movie you saw real sites like the Projects of Southeast and Capitol Hill's Eastern Market, and recognized that D.C. is a city of real people and not just a place aliens blow up.",
         "Now, here are two films I remember watching many moons ago, and for some strange reason was compelled to watch again. Of both, I remember slightly unusual techniques and styles, feeling more like home movies than big-budget films. But, neither is particularly big-budget; both controversial in their own way and quite experimental, designed to create emotion more than they are to entertain. Both, therefore, are not great films, but interesting ones nonetheless, perhaps not fully getting their ideas across, but based on good ideas. Starting with 'Slam', we see young Raymond Joshua living in D.C., working as a small-time drug dealer, occasionally writing the odd verse of poetry. Caught in a gang-land shooting, he sees himself arrested and trapped with the choice of going to prison or going to prison on a drug possession charge. Angered and frustrated, he again finds himself trapped in the middle of a gang dispute in prison resulting in him letting out his grievances in the form of poetry in the prison yard. If you like, 'Slam' is a musical; not so much a film, but a vehicle to showcase the talents of the cast as poets and emcees. Much of the cast are poets and/or rappers appearing in a debut acting role, or one of their few and had a big hand in the writing. Saul Williams plays the lead role, with Sonja Sohn, Bonz Malone and Beau Sia taking up supporting roles, among others. The acting and story, therefore, are never fully polished, with writer/director Mark Levin known more for his documentaries than feature films. The story moves on a little too quickly in parts and character motivation is not always fully explored, beyond William's character. But with the low-budget feel, this has that trapped-in-time quality, feeling isolated from the rest of the world. There is nothing Earth-shattering here, but some interesting social comment and, at times, powerful performances. Spike Lee's 'Bamboozled' is a satire of modern television and what those watching the 'idiot box' have come to expect on the small screen. Damon Wayans plays Pierre Delacroix, a sit-com writer criticised by a 'more black than black people' network executive for writing shows that are 'too white,' featuring 'white people with black faces.' Pushed to deny the existence of a middle-class African-American, Delacroix works to create a show so 'black' as to shock America into realising the stereotypes that are portrayed on every day television. Ticking-off every racial stereotype imaginable, he creates 'Mantan: The New Millennium Minstrel Show'. Amazingly, the show is a success, working only to further stereotypes rather than destroy them; leaving Delacroix viewed as a sell-out. Success and fame are predictably the downfall of those involved resulting in tragedy. 'Bamboozled' is an interesting film for Lee to have made at the time; rising in his career and choosing to make a film that is quite low on a number of things. To start, the cast is low on out-and-out actors \u0096 and you can include Damon Wayans and Jada Pinkett-Smith within that \u0096 using rappers and comedians in many roles. It is also a film low on any nice Hollywood gloss and sheen \u0096 an effect probably desired considering the subject matter. The one thing it is high on is camera numbers, using numerous handhelds to take shots from various angles, such as audience reactions to a new breed of minstrel show. This creates a claustrophobic and documentary-like feel to the film. But being a satire, the film is more about the point it is trying to make; the use of footage from old television and film portrayals of African-Americans throughout and montaged at the end highlighting this. References are made to various moments where art and politics have collided, as well as using real-life figures vocal in such areas. But ultimately, 'Bamboozled' ends up a little messy in final execution. The lack of any real acting talent leaves performances a little wooden, as well as the characters they portray a little too extreme, notably the Mau Mau, led by Mos Def, who feel a little unrealistic despite Mos Def's usually charismatic on screen performances. A little too much can be rammed down your throat at times, with all imagery and dialogue geared towards one thing. Neither 'Slam' nor 'Bamboozled' will ever be regarded as great films, nor will they probably be remembered by many. But both are interesting examples of more creative film-making. Big budget effects, state-of-the- art camera-work and even actors are not required, as long as the film is based on a strong idea and purpose. They are portrayals of writers, trapped in different situations as they struggle to overcome stereotypes, relying on the talents of their non-acting casts. Well- executed at times or not, both still offer more than the endless big budget sequels and re-makes that make-up the majority of box office takings. politic1983.blogspot.com"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Off Line Entertainment Group"],
      "summaries": [
         "Slam tells the story of Ray Joshua, an original, gifted young MC trapped in a war-zone housing project known as Dodge City. Unable to find a job, Ray copes with the despair and poverty of his neighborhood by using his wits and verbal talent.",
         "Young Ray Joshua lives in the Washington, DC, district known as Dodge City, which is dominated by gang wars. One day he is arrested when his drug dealer is gunned down while talking to him. He is put to prison where two rival gangs, Thug Life and the Union, want to recruit him as a member."
      ],
      "budget": 1000000
   },
   "movielensId": 2305,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-10-07",
      "dvdReleaseDate": "1999-03-09",
      "directors": ["Marc Levin"],
      "runtime": 100,
      "movieId": 2305,
      "title": "Slam",
      "mpaa": "R",
      "actors": [
         "Saul Williams",
         "Sonja Sohn",
         "Bonz Malone",
         "Beau Sia"
      ],
      "imdbMovieId": "0139615",
      "originalTitle": "Slam",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Slam tells the story of Ray Joshua, an original, gifted young MC trapped in a war-zone housing project known as Dodge City. Unable to find a job, Ray copes with the despair and poverty of his neighborhood by using his wits and verbal talent. Written by Offline Publicist Young Ray Joshua lives in the Washington, DC, district known as Dodge City, which is dominated by gang wars. One day he is arrested when his drug dealer is gunned down while talking to him. He is put to prison where two rival gangs, Thug Life and the Union, want to recruit him as a member.",
      "tmdbMovieId": 37532,
      "avgRating": 3.62838,
      "releaseYear": "1998",
      "numRatings": 222,
      "posterPath": "/ia9OuD1ijbO7amEaNzUvbeLWbi0.jpg"
   }
}