{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "salesclerk",
            "id": 1361
         },
         {
            "name": "television",
            "id": 2136
         },
         {
            "name": "tv ratings",
            "id": 7271
         },
         {
            "name": "guru",
            "id": 8616
         },
         {
            "name": "television producer",
            "id": 10582
         }
      ],
      "imdb_id": "tt0120701",
      "video": false,
      "title": "Holy Man",
      "recommendations": [
         8860,
         11353,
         10411,
         12158,
         6522,
         5851,
         11595,
         10535,
         10723,
         16300,
         2020,
         10136,
         11676,
         11066,
         11374,
         10154,
         11517,
         11692,
         9085,
         11384
      ],
      "backdrop_path": "/ruJnCxmriVGFEz2fZScGDk2jVjr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "G",
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdfa9",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Ricky Hayman",
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdfad",
               "name": "Jeff Goldblum",
               "profile_path": "/t812WlNdP6F2ksRj21JF68DUiwz.jpg",
               "id": 4785,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Kate Newell",
               "gender": 1,
               "credit_id": "52fe4520c3a36847f80bdfb1",
               "name": "Kelly Preston",
               "profile_path": "/kxTQVsfZkI3DdzBqutw4zZapRB.jpg",
               "id": 11164,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "McBainbridge",
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdfb5",
               "name": "Robert Loggia",
               "profile_path": "/7xtU12KT12xjy4UY1O6VKpw7FLx.jpg",
               "id": 1162,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Barry",
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdfb9",
               "name": "Jon Cryer",
               "profile_path": "/lUbtFIFdzGXktaFPgrznBDteI5y.jpg",
               "id": 69718,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdf81",
               "name": "Stephen Herek",
               "profile_path": "/wFMntUA59jIeLITlk5pYp2boZzB.jpg",
               "id": 18356,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4520c3a36847f80bdf87",
               "name": "Ray Murphy Jr.",
               "profile_path": null,
               "id": 58718,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdf8d",
               "name": "Tom Schulman",
               "profile_path": null,
               "id": 2691,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4520c3a36847f80bdf93",
               "name": "Rebekah Rudd",
               "profile_path": null,
               "id": 58719,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdf99",
               "name": "Adrian Biddle",
               "profile_path": null,
               "id": 7783,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4520c3a36847f80bdf9f",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4520c3a36847f80bdfa5",
               "name": "Trudy Ship",
               "profile_path": null,
               "id": 58720,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 5.977404,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9713,
      "vote_count": 135,
      "budget": 60000000,
      "overview": "Eddie Murphy stars as an over-the-top television evangelist who finds a way to turn television home shopping into a religious experience, and takes America by storm.",
      "similar": [
         11598,
         11374,
         11450,
         714,
         10774,
         3176,
         7461,
         1246,
         242582,
         508,
         275,
         928,
         2292,
         565,
         101299,
         8872,
         12626,
         8920,
         2976,
         262
      ],
      "original_title": "Holy Man",
      "runtime": 114,
      "poster_path": "/11mINUUPFtqEBdsbayBenOaTWbP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-08",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "The Comedy Where Nothing's Sacred!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Herek"],
      "runtime": 114,
      "synopsis": null,
      "writers": ["Tom Schulman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120701/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3Njc4ODg4Ml5BMl5BanBnXkFtZTcwNDgwNDgxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Murphy, Jeff Goldblum, Kelly Preston | See full cast and crew »"],
      "reviews": [
         "I can understand why this movie received such a low rating from the overall IMDB audience. There is probably a large segment of voters who expect certain things from an Eddie Murphy movie who were disappointed. Murphy is best known for action comedies in the vein of 48 Hrs. and Beverly Hills Cop. He also did some fine work in Trading Places, a straight up, but darkly cynical comedy. Holy Man is a gentle, feel-good comedy. It provides some laugh-out-loud moments, but for the most part, weaves a compassionate story in an appropriately low-key style. Its message is clear and timely: Stop and smell the roses, people. You are losing sight of what's important. Eddie Murphy is letter perfect as \"G,\" the \"holy man\" who encounters Jeff Goldblum while Jeff is changing the tire on his Jaguar. With Goldblum is Kelly Preston, his colleague at the Good Buy Home Shopping Network. `G' appears mysteriously in flowing white robes, and talks of being on a spiritual pilgrimage. Goldblum, ever cynical, dismisses `G' as a wacko, and tries his best to get rid of him. Preston, on the other hand, sees something different in `G.' She is more open to his charisma, his humor, and his apparent lack of guile. The three end up working together. `G' is given his own TV show where his blend of honesty, spirituality, and humor helps the station move a lot of products, and turns `G' into an overnight media sensation. I won't give away much more than that. Not to be overlooked, Robert Loggia turns in a chilling performance as the venomous TV station owner--it's as if he was channeling Barry Diller all the way. His crass, mercenary tactics trigger a crisis of conscience that brings the movie to its resolution. Holy Man tells a simple tale that echoes an ancient proverb: When the pupil is ready, the teacher arises. I have watched Holy Man about three or four times. There are nuances here that I have discovered only after repeated viewings. The film's acting, music, location, and subtle direction all hang together well, providing a much-needed palliative to Hollywood's desperate output of increasingly frenetic and assaulting films",
         "I think that most people are misinterpreting the main purpose of the movie. The whole purpose of the movie is to make people think, especially about their current lives and materialism. However, rather than taking a rather somber approach throughout the movie, the movie tries to take an Al Franken approach, and inform through humor. Perhaps this may be because I personally identified with the message, but still, the nonmaterialistic message definitely strikes home, with comedy sprinkled in. If a light hearted comedy is what you are looking for, then this is probably not the best movie to watch simply because the movie isn't that funny. It isn't entirely deep either, but it does manage to get the point across, and makes you think.",
         "Just saw this movie again for the first time since 1998, and I gotta admit, it's a lot better than I remembered it. I think back then people just had way too high expectations for it; that and the fact that it wasn't an \"all Eddie Murphy\" film--as the reviewer before me put it-- led to its limited success. Jeff Goldblum can get on my nerves sometimes, but the stark contrast between the personality of his and Murphy's characters in this movie makes for some pretty funny scenes. As for Eddie, his performance as G is one of the best I've ever seen him do: you really do Believe he is a \"Holy Man.\"",
         "Love the idea of a mysterious, intelligent, well-intentioned man captivating millions of people. Wouldn't it be funny if some obscure shop-at-home channel managed to pull something like this off? Well this seems like a pretty original scenario, and I give it some credit for that. Murphy plays the part of G quite well. One of the few great comedies he's done in the recent past. I love the beginning and ending scenes in which G is walking along the side of the road. It's just some beautiful scenery. When I see it, I wish I'm there. The music in this movie is really enjoyable too. Good to see Ducky in the studio. Really couldn't have cared less about the little relationship that developed. Funny movie. Worth a view or two. I would love to see a sequel.",
         "I first caught Holy Man a few years ago and was highly impressed. I didn't go into it knowing much about it, so I wasn't disappointed to find out it wasn't a comedy -- and it's not, despite some funny moments. It's just a very light hearted charming movie that will make you think about life's more important aspects. Give it a chance, you'll probably enjoy it more than you expect! The movie can be a little sappy at times and casting Eric McCormack was probably a mistake. All I could think of when he was on screen was his character from 'Will & Grace'. I guess that's what they call typecasting, eh? Either way, this movie is worth the two hours.",
         "On the face of it, this romantic comedy is nothing special. But for some reason, I'm just really pleased by this film. There is a thematic cleverness tying together all the humor, and the inevitable and obvious conclusion ends up being sweet and engaging anyhow. I hate films that get melodramatic and sappy -- Holy Man skirted the edges but didn't fall into that trap. There aren't snappy comebacks and put downs like in Beverly Hills Cop, but there is some deep thinking. I wouldn't be surprised if for the right people this movie really meant something to their lives. Sort of like, but not as good as Groundhog Day. Who should see this film: -- romantic comedy lovers (and drag your spouse along) -- generic comedy likers who can live without high action if there's a little philosophy -- if you're not \"in with the young crowd\" and think Eddy Murphy flicks are too silly and \"hip\", this one is different I'll give this one a 7 out of 10.",
         "This is one of those \"why don't they make 'em like that any more\" movies. If it starred, say, Jimmie Stewart and Jean Arthur, everyone would look upon it fondly, as a treasured masterpiece. But no, it's the often-abrasive Eddie Murphy, and the frequently hard-to-take Jeff Goldblum. If you can handle the casting, though, this is a marvelous movie, transcending its formula to deliver moments of hilarity as well as a thoughtful message. Jeff Goldblum is, to me, impeccably cast as an ambitious but unsuccessful salesman. The explanation, later in the movie, of how he traveled with his father on sales trips, sets the character up beautifully. We come to understand that his lack of success really stems from a lack of commitment to the no-holds-barred ethos of the salesman. And, of course, that's a good thing. Murphy plays \"G\", who may or may not be divine, but certainly is other-worldly. He's the opposite of Goldblum's character: totally centered, with no attachment to anything, least of all the crass commercialism of the shopping network where Goldblum works. Naturally, he disrupts Goldblum's life, but the kicker comes when Goldblum desperately puts G on the air, and finds that sincerity sells better than salesmanship. A number of reviewers have complained that there's not enough of Murphy. Maybe so, if you're expecting a full-on Eddie Murphy vehicle. But Holy Man is more than just an \"Eddie Murphy\" movie, and G the sort of showcase role that no actor could resist. It really lets Murphy shine, displaying more subtlety than usual... yet spinning nicely off his usual sarcastic persona. The plot, to be sure, is formulaic. You can see the twists coming a mile away. So what? This type of cinema is as ritualistic as Greek tragedy, or Kabuki theater. The point isn't in where it's going, but in how it gets there. And get there it does, making its little Zen point about materialism versus spirituality in a unique and compelling way. And, at times, a hilariously funny way. The 'magic trick' G performs with a Rolex watch is side-splitting. But it's easily topped by the gut-wrenchingly funny antics of G as he roams from one set to another in the TV studio. What he does to Morgan Fairchild is one of the great moments of sadistic slapstick. (I admire her for appearing in this unflattering scene; she must have an amazing sense of humor.) I'll admit that the two stars will limit this film's appeal. But even if you're not a fan of Murphy or Goldblum, it's worth taking a chance. Personally, I tend to find Goldblum overpowering; I was definitely rooting for the Tyranosaurus to catch up with his asinine \"chaotician\" in Jurassic Park (1 and 2). But in some roles he just works, and this is one of them. (Another is \"Beyond Suspicion,\" a.k.a. \"Auggie Rose.\") This is not only a good movie, it's one that I actually pull down off the shelf and watch, far more frequently than many of the better-known 'classics.' I've seen it at least four times, and intend to see it many more.",
         "I just recently saw this movie on television. quite frankly i think everyone who gave it a low rating had the wrong impression. this was NOT meant to be a Hollywood movie. hence the theme behind it and the title being Holy man. why would you think that something with a message of love and not exploiting people and products would be made out as exactly that? And thats why its so beautiful, because they didn't make it \"popular\". the message however is that of true love and peace to all the earth. i think Eddie Murphy did a great job filling the role, and i think his humor and love by all races and religions makes the casting brilliant. The rest of the actors/ actresses are not of my appeal, however i believe i have a new appreciation for them. I think the whole world could benefit from a simplistic but meaningful movie like this. thats all i have to say about that.",
         "I saw this great movie yesterday evening. My mom + I hired it out, along with other DVDs and I'm so glad I chose this one! I believe this movie has a few messages: they are meaningful + things to consider and really think about. First off, Kate is a very kind and compassionate character. As the viewer of the movie, we are positioned to like her. This I totally agree with because I think everyone should be like Kate - she has lovely qualities. When she stands up for her rights as a human and says: \"I'm not going to sell my soul\" I really like that. That's how everybody should think. Why should individuals give in to money (and business) and simultaneously sell their soul, their integrity, their self as a whole? Well, they should not. But it happens so it's ultimately up to the individual to make their own choices, right or wrong. Kate is empathetic towards G and she feels that G should not be made to do the shows purely to save someone else's ass. She also feels that the business is just using him as a way for their success to be fruitful again. Although, G doesn't mind doing the shows because he says he wants to do them for Ricky. So Kate walks away from the whole business and I think it's great that she does this cos she shows us what it's like to have integrity. But this movie teaches one that when you're in trouble and you pray for help, God is always there to help you - G is in trouble at work so he prays sincerely and G turns up! There are other beautiful messages too. You can work them out. In the end, Ricky listens to Kate's benevolent example and lets G go. Kate falls in love with Ricky once again and here we have a wonderful happy ending. I just love movies with happy endings. I recommend this movie to anyone that believes in integrity.",
         "Now here's a movie where the problem is in the wrong way people look at it and receive it. It's about the condition of truthfulness in our contemporary materialistic world, showing that the truthful man isn't the one who doesn't lie at all (because that's impossible to happen!), but he's the one who lies less than the others. I liked selecting the field of advertisement to make the whole movie in. This world of unceasing commercials was an epitome of the world we live of shiny seductive fibs, where everything is a commodity that had to be sold anyway anyhow, with or without credibility; which can be sold also accompanied by any bad commodity. This environment created the perfect irony with the main issue. But I liked more and more the confidential talk between the lead/the manager of the advertising channel and god in the bathroom. It became the only place where he can be alone with his conscience away from all the people's dirt; or the bigger bathroom; which can't have a way to empty all of its uncountable lies. It's one sharp, so sarcastic, paradox that introduces the toilet as less filthy than that huge liar world around. So when toilets become the only holy place in our world then what kind of \"shitty\" world we live indeed?! This summarizes the serious character of this movie which was wrongly understood as yet another comedy for (Eddie Murphy) while it's wholly not. It's a movie that asks what's holy nowadays. And according to its nice story; there is surely no 100 % holy men at all. Only holy thoughts. The greatest of them all is being truthful. That's holy enough...just if you can do it."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Eddie Murphy Productions",
         "Roger Birnbaum Productions"
      ],
      "summaries": [
         "Ricky Hayman, right hand of Good Buy Shopping Network's owner John McBainbridge, is responsible for over two years of very bad sales numbers. He gets a last chance. Accidentally, he and Kate Newell nearly run over G with his car and decide to take him with them. What they never could guess was that G really is the one good man around. Being on the search for enlightenment, G offers his help generously to save Ricky's job. His natural, uncontrollable behaviour soon gets Ricky into really big trouble, but the sales numbers now go up for the first time in months...",
         "Eddie Murphy stars as an over-the-top television evangelist who finds a way to turn television home shopping into a religious experience, and takes America by storm."
      ],
      "budget": 60000000
   },
   "movielensId": 2306,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-08",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Stephen Herek"],
      "runtime": 114,
      "movieId": 2306,
      "title": "Holy Man",
      "mpaa": "PG",
      "actors": [
         "Eddie Murphy",
         "Jeff Goldblum",
         "Kelly Preston",
         "Robert Loggia",
         "Jon Cryer"
      ],
      "imdbMovieId": "0120701",
      "originalTitle": "Holy Man",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["7e3YGlFWtDs"],
      "plotSummary": "Eddie Murphy stars as an over-the-top television evangelist who finds a way to turn television home shopping into a religious experience, and takes America by storm.",
      "tmdbMovieId": 9713,
      "avgRating": 2.50765,
      "releaseYear": "1998",
      "numRatings": 1046,
      "posterPath": "/11mINUUPFtqEBdsbayBenOaTWbP.jpg"
   }
}