{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "police brutality",
            "id": 796
         },
         {
            "name": "internal affairs",
            "id": 11730
         },
         {
            "name": "interrogation",
            "id": 15271
         },
         {
            "name": "crime family",
            "id": 33421
         },
         {
            "name": "hostess",
            "id": 167915
         }
      ],
      "imdb_id": "tt0122642",
      "video": false,
      "title": "One Tough Cop",
      "recommendations": [],
      "backdrop_path": "/3puZ70Pw1Uq9pvfOk3Tv2hyWjM7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Bo Dietl",
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199ae7",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Duke Finnerly",
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199aeb",
               "name": "Chris Penn",
               "profile_path": "/57imnLRyaOowXElsxNESvhG1UZk.jpg",
               "id": 2969,
               "order": 1
            },
            {
               "cast_id": 22,
               "character": "Richie La Cassa",
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199b07",
               "name": "Michael McGlone",
               "profile_path": "/rB2uLTM2xh2O2aKri8OgPDKM0tK.jpg",
               "id": 69298,
               "order": 2
            },
            {
               "cast_id": 21,
               "character": "Joey O'Hara",
               "gender": 1,
               "credit_id": "52fe4bccc3a368484e199b03",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Gang Banger #1",
               "gender": 0,
               "credit_id": "52fe4bccc3a368484e199aef",
               "name": "Christopher Bregman",
               "profile_path": null,
               "id": 1098669,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Gang Banger #2",
               "gender": 0,
               "credit_id": "52fe4bccc3a368484e199af3",
               "name": "Mike Santana",
               "profile_path": null,
               "id": 162582,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Gunman Popi",
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199af7",
               "name": "Luis Guzmán",
               "profile_path": "/e6mIeGBDkNFZwFDoskcetgkU5oH.jpg",
               "id": 40481,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Little Girl",
               "gender": 0,
               "credit_id": "52fe4bccc3a368484e199afb",
               "name": "Dana Dietl",
               "profile_path": null,
               "id": 1098670,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Rudy",
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199aff",
               "name": "Harvey Atkin",
               "profile_path": "/nH8qRU3GHTsTzOZnokPDpY5ko2B.jpg",
               "id": 108890,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Frankie 'Hot' Salvino",
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199b0b",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199aad",
               "name": "Bruno Barreto",
               "profile_path": "/sFrrQ77hqzBWW40js1VevZyr3fE.jpg",
               "id": 69719,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199ab3",
               "name": "Bo Dietl",
               "profile_path": "/p4g45Hu2GX8YgzMsAv4DnPvVZjt.jpg",
               "id": 131119,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199ab9",
               "name": "Ken Gross",
               "profile_path": null,
               "id": 946461,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199abf",
               "name": "Jeremy Iacone",
               "profile_path": null,
               "id": 57650,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199ac5",
               "name": "Jeremy Iacone",
               "profile_path": null,
               "id": 57650,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199acb",
               "name": "Martin Bregman",
               "profile_path": null,
               "id": 1151,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bccc3a368484e199ad1",
               "name": "Michael Bregman",
               "profile_path": null,
               "id": 56109,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199ad7",
               "name": "Bo Dietl",
               "profile_path": "/p4g45Hu2GX8YgzMsAv4DnPvVZjt.jpg",
               "id": 131119,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bccc3a368484e199add",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 146180,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4bccc3a368484e199ae3",
               "name": "Ron Fortunato",
               "profile_path": null,
               "id": 7492,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [],
      "popularity": 0.742173,
      "production_countries": [],
      "id": 134368,
      "vote_count": 3,
      "budget": 0,
      "overview": "",
      "similar": [
         2034,
         9737,
         277216,
         2142,
         7347,
         925,
         5125,
         26390,
         12622,
         11699,
         4911,
         31598,
         10598,
         450875,
         404579,
         449253,
         31701,
         36715,
         36023,
         58648
      ],
      "original_title": "One Tough Cop",
      "runtime": 90,
      "poster_path": "/ihg8EBrYWdFYTRdLCnqqtN8dRLC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Patriot Pictures",
         "id": 2373,
         "origin_country": ""
      }],
      "release_date": "1998-10-09",
      "vote_average": 3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bruno Barreto"],
      "runtime": 90,
      "synopsis": "In a prematurely bitter autumn, 1981, New York City is ignited as EMS workers gurney out from a modest Harlem convent a young nun who's been violated, mutilated and beaten into a coma. The infamy of the crime attracts the media and forces the hand of the Police Department's downtown brass. A hastily-assembled task force takes over, eliminating Dietl and his partner Duke Finnerty from the most important manhunt to invade their beat. Principled yet rebellious, Bo and Duke continue their own unauthorized investigation, using contacts that include Dietl's childhood friend, Richie LaCassa, an underboss in the Florio crime family. As the duo's search bears fruit, Dietl's personal life is tested by Duke's mounting gambling debts to a Florio clan loan-shark, and Deitl's own affair with LaCassa's mistress, Josephine \"Joey\" O'Hara. The partners' successful apprehension of the assailants (who later confessed) is tainted by a retaliatory FBI probe into Dietl's Mob \"ties.\"",
      "writers": [
         "Bo Dietl",
         "Ken Gross"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0122642/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMTg1NTE1NV5BMl5BanBnXkFtZTcwNzQzMjMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Stephen Baldwin, Chris Penn, Gina Gershon | See full cast and crew »"],
      "reviews": [
         "One Tough Cop has a terrible title, but is a fun movie. More like a made for TV movie than a theatrical release, it nonetheless is entertaining. Chris Penn and Baldwin turn in good performances and the story, although cliche, is good enough to keep your attention. I gave it a 7/10.",
         "One Tough Cop was a film that had one of the best trailers I've ever seen. It made the film look like a fascinating and powerful police drama. The film however did not get even close to the expectations of the trailer. It wasn't bad however. Just not great. Stephen Baldwin (The Usual Suspects, Fled) stars as a police officer whose best friends are all involved in the Mob. Despite a great record, he gets framed by Internal Affairs and has to decide between his friends or his job. Chris Penn (Deceiver, The Funeral) is very good in support as Baldwin's very much in debt partner. Gina Gershon (Face/Off, Palmetto) is ok as the love interest. But the film's biggest strength lies in Stephen Baldwin. Baldwin is one of the most underrated actors in my mind (mainly because of poor career choices), but here he delivers a strong performance that brings the film through all of its predictability. Recommended for Baldwin's performance mainly.",
         "...this would have been better off as an HBO or Showtime Original, but I liked the biographical look at rogue New York Cop Bo Deitl. I confess, I heard him on the Howard Stern Show, and thought he was notes, but the movie is tightly and carefully plotted and the characters were believable. If the film has a fault, the plot is almost too tight. Good performances by Stephen Baldwin, Gina Gershon, and Mike McGlone. I liked the opening sequence okay as well. Come on, it's a cop movie, and a decent one at that.",
         "top rate young turk actors, stephen baldwin and chris penn turn in painfully wooden portrayals of stereotypic undercover cops, baldwin: haunted good cop w/mafia boyhood friend and Penn: liqour/gambling addicted cop w/fatalist attitude...the FBI squeeze play is totally contrived, hackneyed and never advances the plot, the love interest sub-plot is under-developed and equally stilted...possibly the foreign (art film) director couldn't handle the material and/or properly motivate the cast...the subject matter and identical rape of a nun was masterfully done in \"Bad Lieutenant\" starring Harvey Keitel",
         "This a great movie about the true story of New York's greatest undercover officer. If you want to see a good undercover cop movie this is it. Bo Dietl fought against all the junkies on the street and when he went in the PD he had to fight off the brass to keep his job.",
         "It dawned on me after watching this again today and reading some of the comments here what is really wrong with this supposedly true crime flick. It plays like a TV movie, not a theatrical release. Therefore it cannot begin to compare to flicks like SERPICO and even COPLAND, which for whatever faults these films may have, they are real movies. This plays \"flat,\" with ineptly staged scenes and bad acting, just like a TV movie or most TV shows. I can think of no earthly reason to recommend this, unless you want to see Stevie B. playing a tough-as-a-tissue cop.",
         "Good performances can't quite save this Movie from a shallow and clichéd script in being much more than a standard good Cop with bureaucratic problems. Everything about this exercise in \"based on a true story\" story is thin and that keeps it from viewer investment and creative consummation. There is a checklist of standard, gritty, crime solving with slim motivational backing. Laid out in front are the misunderstood macho, but sensitive, officer with a self-destructive partner in a corrupt system. He is unable to separate lifelong childhood friendships with Mobsters from professional duty. This is the crux of this Crime Drama that is betrayed by speechifying and stiff setups. It is not a bad Movie, just one that demands more depth of insight and frankly, more involvement by the Writer and Director if they are to approach such a complicated scenario. Solving heinous crimes and the dismantling of a seasoned, successful law enforcement street Cop requires much more than this quickly moving and uneven attempt.",
         "Another story about a cop (Bo Dietl) that tries to do his job while still hanging on to his friends from the neighborhood. The fact that they are all mobsters gives the FBI an opportunity to blackmail him into working for them. He refuses and almost loses his badge. Stephen Baldwin (The Usual Suspects) play Dietl, trying to stay clear of the slime played by Amy Irving and Victor Slezak. Why she would take that role is beyond me. It stunk! Of course, we have to have a hot babe, and who better to play that role that Gina Gershon (Bound, Love Matters, Sweet Revenge). It was interesting seeing Captain Jim Brass (Paul Guilfoyle) playing a gangster role. Based on a true character, it was OK, but you can probably find something better to watch.",
         "The New York policeman Stephen Baldwin partied with his childhood friend, the mafioso Mike McGlone. Their complicity draws the attention of FBI... Inspired by the life of the policeman Bo Dietl, this muscular whodunit interpreted by Stephen Baldwin (\"The Usual Suspects\") brushes a bitter and violent picture of the daily life in the New York police. The first quarter of an hour let augur a robust detective, bitter and restless film. But the continuation does not hold the initial promises. The intrigue, badly tied up, suffers from the Stephen Baldwin's transparent interpretation.",
         "This film is okay. The big drawback is that this is NOT a true story. The acting is fine, though Mike McGlone is a little hard to swallow (but there have certainly been worse performances that have gotten a lot more attention). It comes off as a film that reaches to be a Sidney Lumet production, but falls way short."
      ],
      "genres": [
         "Action",
         "Crime"
      ],
      "productionCompanies": ["Patriot Pictures"],
      "summaries": ["A detective tries to remain loyal to his partner, and his best friend - a mobster."],
      "budget": 0
   },
   "movielensId": 2307,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-09",
      "dvdReleaseDate": "1999-04-13",
      "directors": ["Bruno Barreto"],
      "runtime": 90,
      "movieId": 2307,
      "title": "One Tough Cop",
      "mpaa": "R",
      "actors": [
         "Stephen Baldwin",
         "Chris Penn",
         "Michael McGlone",
         "Gina Gershon",
         "Christopher Bregman",
         "Mike Santana",
         "Luis Guzmán",
         "Dana Dietl",
         "Harvey Atkin",
         "Paul Guilfoyle"
      ],
      "imdbMovieId": "0122642",
      "originalTitle": "One Tough Cop",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 134368,
      "avgRating": 2.59767,
      "releaseYear": "1998",
      "numRatings": 215,
      "posterPath": "/ihg8EBrYWdFYTRdLCnqqtN8dRLC.jpg"
   }
}