{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hitman",
            "id": 2708
         },
         {
            "name": "police",
            "id": 6149
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "money",
            "id": 10594
         },
         {
            "name": "blaxploitation",
            "id": 10601
         },
         {
            "name": "prostitution",
            "id": 13059
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "flashback",
            "id": 187844
         }
      ],
      "imdb_id": "tt0069966",
      "video": false,
      "title": "Detroit 9000",
      "recommendations": [68146],
      "backdrop_path": "/gIdauD1qml9g1WKwuE7qSb0dkW6.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lt. Danny Bassett",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab419",
               "name": "Alex Rocco",
               "profile_path": "/u2JStL4Pk9Huq1xmrjqezfysivt.jpg",
               "id": 20752,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Ruby Harris",
               "gender": 1,
               "credit_id": "52fe49609251416c910ab41d",
               "name": "Vonetta McGee",
               "profile_path": "/uz9JHawFEhIRiyNVFmABQ5l1C8S.jpg",
               "id": 6780,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Sergeant Jesse Williams",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab44b",
               "name": "Hari Rhodes",
               "profile_path": "/j3oQPReGHOU4kS1oc0cwGGoK4pK.jpg",
               "id": 98797,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Helen Durbin",
               "gender": 1,
               "credit_id": "52fe49609251416c910ab44f",
               "name": "Ella Edwards",
               "profile_path": null,
               "id": 119424,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Reverend Markham",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab453",
               "name": "Scatman Crothers",
               "profile_path": "/nzSlIgwX4vMSJhDPdUSkV9MAAai.jpg",
               "id": 7077,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Ferdy",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab457",
               "name": "Herb Jefferson, Jr.",
               "profile_path": "/sKuUm6NVwpQTsSIpd1hTQFC6xoR.jpg",
               "id": 58265,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Captain Chalmers",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab45b",
               "name": "Robert Phillips",
               "profile_path": "/cUUyTh3Gx3IpHBkQE7BJy5TWl51.jpg",
               "id": 121481,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Aubrey Hale Clayton",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab45f",
               "name": "Rudy Challenger",
               "profile_path": null,
               "id": 160411,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Ethel",
               "gender": 0,
               "credit_id": "52fe49609251416c910ab463",
               "name": "Sally Baker",
               "profile_path": null,
               "id": 1023353,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Oscar",
               "gender": 2,
               "credit_id": "52fe49609251416c910ab46d",
               "name": "George Skaff",
               "profile_path": null,
               "id": 114509,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "",
               "gender": 0,
               "credit_id": "582b7b2292514166af003754",
               "name": "Stacy Keach, Sr.",
               "profile_path": null,
               "id": 1211994,
               "order": 10
            },
            {
               "cast_id": 24,
               "character": "Barbara (uncredited)",
               "gender": 1,
               "credit_id": "582b7b39c3a368360604aa43",
               "name": "June Fairchild",
               "profile_path": null,
               "id": 123529,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "Dancing Hooker (uncredited)",
               "gender": 1,
               "credit_id": "582b7b4c9251417b18047e3a",
               "name": "Marilyn Joi",
               "profile_path": "/gNSt5ORLeL6431q7n65EmhjN20T.jpg",
               "id": 52615,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49609251416c910ab423",
               "name": "Orville H. Hampton",
               "profile_path": null,
               "id": 103355,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49609251416c910ab429",
               "name": "Don Gottlieb",
               "profile_path": null,
               "id": 1023344,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49609251416c910ab42f",
               "name": "Junius Griffin",
               "profile_path": null,
               "id": 1023346,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49609251416c910ab435",
               "name": "William B. Silberkleit",
               "profile_path": null,
               "id": 1017350,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49609251416c910ab43b",
               "name": "Charles Stroud",
               "profile_path": null,
               "id": 107066,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49609251416c910ab469",
               "name": "Thomas Gark",
               "profile_path": null,
               "id": 1031867,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 2,
               "credit_id": "52fe49609251416c910ab473",
               "name": "Arthur Marks",
               "profile_path": null,
               "id": 107065,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49609251416c910ab479",
               "name": "Arthur Marks",
               "profile_path": null,
               "id": 107065,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "594dad48c3a368327902bbc1",
               "name": "Harry J. May",
               "profile_path": null,
               "id": 1023351,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "594dad52925141311102c457",
               "name": "Luchi De Jesus",
               "profile_path": null,
               "id": 1023350,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "594dafb3925141311502cf18",
               "name": "Richard Greer",
               "profile_path": null,
               "id": 1015854,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "594dafbac3a36832bd02b890",
               "name": "Geno Havens",
               "profile_path": null,
               "id": 1544205,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "594dafc0925141315502d8c4",
               "name": "Trudy Seiter",
               "profile_path": null,
               "id": 1838150,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 1.446696,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85837,
      "vote_count": 12,
      "budget": 0,
      "overview": "After a fundraiser for a black politician is robbed, Detroit police put two detectives, one white and one black, on the case, who try to work together under boiling political pressure.",
      "similar": [
         26196,
         10651,
         26390,
         979,
         8456,
         101,
         275,
         1572,
         4771,
         245891,
         156022,
         281,
         241554,
         281957,
         193893,
         445954,
         133805,
         2142,
         400,
         1266
      ],
      "original_title": "Detroit 9000",
      "runtime": 106,
      "poster_path": "/kDrblsZBZCbDgmcYRPNMMDwNZ8e.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Holly Hill Productions",
         "id": 38609,
         "origin_country": ""
      }],
      "release_date": "1973-08-01",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "It's the murder capital of the world. And the biggest black rip-off of the decade.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Arthur Marks"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Orville H. Hampton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069966/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgzNzgyNjA2OF5BMl5BanBnXkFtZTcwODA0MDEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Hari Rhodes, Alex Rocco, Vonetta McGee | See full cast and crew »"],
      "reviews": [
         "As a huge fan of 70's action movies, I was looking forward to seeing this, especially since it has Quentin Tarantino's endorsement. I was expecting another campy blaxploitation movie, but was very surprised that this was not the case. The film explores the politics and race relations in Detroit in the early 70's, using the repercussions of an armed robbery of a political fundraiser as a backdrop. Aside from the funky music and 70's fashion, and to a certain extent the dialogue, this could easily be any urban area in the 90's. The media is portrayed as eager to turn this high-profile crime into a racially-motivated crime. The cops are shown as being under pressure from all sides to solve the case quickly. As the investigation unravels, the viewer finds out that not everyone is who they seem to be. And although the end of the film is somewhat predictable, it is still entertaining. Some of the dialogue is typical camp, and some of the acting is wooden, but the one major complaint I have with this movie is the chase scenes that are shown in immediate succession. Its almost as if the writers thought to pad the drama with some action as an afterthought. Overall, though I was very suprised by this film and the issues it attempts to address.",
         "I saw this movie because of Quentin Tarantino's initiative to bring back classics like this to the video stores. This movie is just terrific. First of all the story is very well done and it is still original today. This is remarkable considering that this movie is 26 years old! The actors might be a little weak at times but the cool dialogs and the raw action scenes are the best ones I've ever seen. There aint no special effects here but it still is pretty spectacular. Of course, this movie is not an Hollywood super production but it still is an excellent movie that one should see at least once. The music is also fantastic, seeing those guys shoot each others and thoses cars explode with some 70's era funk music is just too entertaining. I recommend this movie to any action or thriller movie fans. Tarantino fans might also be surprised..this movie obviously influenced Tarantino a lot. See for yourself.",
         "I would leave college early everyday just to find what Detroit street they would be filming at that particular day. It was an exciting time seeing such local personalities as Dick Purtan, Woody Willis, Laura Lee, Mike Lucci of the Detroit Lions, John Nichols, and the one and only Martha Jean \"The Queen\" Steinberg. This was a great time for me and for the city of Detroit. I have a copy of this film and watch it whenever I can. A must see movie for all Detroiters. A favorite of Quinton Tarrentino.",
         "Arthur Marks somehow knew how to do it: combining the tough and thoughtful police-thriller with a seeming exploitation (or blaxploitation) flick into something worthwhile. It may not be for some; matter of fact, from all I can tell looking at various reviews it's made little of an impression aside from negative. But I was drawn into this seedy, multi-racial tale of dirty criminals and (some) dirty cops and a dirty politician because of the simple strengths of the acting and (most of) the writing, not to mention an explosive climax and a nifty opening heist scene. It's even more than nifty; Marks somehow has the cojones to make a poignant moment in this scene, as well as a couple of other times in the film (i.e. Ruby dying in Jessie's arms), where the singer who's doing a number gets cut-off by the tape recording telling everyone to get down and fork over the cash and jewels... and she just goes on singing, and a song sung with a mournful voice. The nuts and the bolts of the plot are that in Detroit, where according to officer/athlete Jessie Williams (Hari Rhodes) his new partner Danny Bassett (Alex Rocco) is in the minority in the black-dominant area, a heist has taken place during a fund-raiser for an up-and-coming politician (perfectly one-note Rudy Challenger), and there's already tension: is it an all-black gang, or all-white? Can there be a crack when those the cops find immediately shoot back and end up shot dead? It all leads down to a pimp and his girl, or so it's thought, and not everything is what it seems with tough/smart cop Bassett, yada yada. Describing a lot of the plot isn't necessary, as much of the interest in Detroit 9000 are in scenes of pure attitude, of this time and place in this city a microcosm of racial strife and unrest. If anything it's not even a blaxploitation movie, per say, but something of a black pride movie in a strange way. And there's at the least some equality: the gang is found to be multi-racial, including a dead) Indian from Canada! There are ways this movie can get cheesy or stuck in its 1973 time-frame, and of course the clothes, the slang, and the soundtrack all speak to that. But I enjoyed how Hampton's screenplay struck a line between giving many of these characters, including supporting ones like Ruby Harris and Ferby some personality past their stock characters, or how the wit creeps up as really unexpected (the line Clayton's \"assistant\" gives to a prostitute is so classic QT lifted it for Jackie Brown). And Rhodes and Rocco, otherwise usually relegated to supporting and character-actor parts in other movies, get to show what their made of as cops on a dirty case that just gets dirtier. Lastly, without sacrificing some sophistication in the writing or a refreshingly bittersweet ending, Marks tops it all off with that big chase going six or seven ways across the railroad tracks and fields and cemeteries of *really* gritty parts of Detroit and put to a raucous, spot-on soundtrack. In a word (and I can almost hear a James Lipton voice saying this as I type this): under-rated.",
         "Not your typical Blaxploitation movie. I rented it because Vonetta McGee is in it but was pleasantly surprised. You should see the top tier Blaxploitaion movies (Fred,Pam,Jim,Isaac) first to appreciate this one. Definitely a sleeper.",
         "A white Detroit detective (Alex Rocco) has to investigate a heist at a political fundraiser and he's none too happy about it. He's even less happy when he's forced to partner up with a black detective (Hari Rhodes). Despite their differences, the two cops work well together and get to the bottom of things. Alex Rocco and Hari Rhodes are both good. Beautiful Vonetta McGee isn't on screen nearly enough but has an important part. The minor roles are played by a variety of actors, some of whom seem like complete amateurs who recite their lines robotically. The actress playing Rocco's wife has one scene and she uses it to give a lesson on terrible acting. Mostly straight but there are some unintentional moments of hilarity. Such as a car moving at slow speed driving into a parked car, causing both vehicles to instantly explode like they were packed with dynamite. Or an older white reporter seriously asking the Chief of Police \"Do you think it was a honky caper?\" There's also a scene that rips off Dirty Harry's \"do you feel lucky punk\" scene. The dialogue is different but the scene is too similar to be a coincidence considering Dirty Harry came out a couple years before this and that scene was an instant classic. It's a good blaxploitation flick. I enjoyed all of the Detroit locations, including many now-demolished buildings. It's obviously a limited movie, in terms of budget, but it's still entertaining.",
         "\"Detroit 9000\" reminded me a lot of \"Dirty Harry\"--mostly because the star, Alex Rocco, has little time to be pleasant to his superiors--he's just a good and tough cop who wants to do his job. The other star, Hari Rhodes, isn't exactly a saint either! The big difference, however, is that \"Detroit 9000\" is a MUCH earthier film--with lots of cursing, racial epithets and stuff parents probably do NOT want their kids seeing. Of course, it wasn't like \"Dirty Harry\" was a family film, either! The film begins at a big fund-raising affair where lots of black community members are in attendance. A group of robbers break up the party and take a fortune. But, interestingly enough, these guys were real pros and they haven't got anything to work on--even the races of the crooks. When the case is given to the Lieutenant (Rocco), he quickly sees that he's pretty much screwed--and is quick to tell his boss! That Rocco isn't a man known for his tact! Following this, he begins following down leads--leads that lead him to a brothel, a brief lesbian sex scene, a crooked black politician and even abortion doctor! As I said, this IS an earthy film! So is the film worth seeing? Well, if you are looking for a blaxsploitation film, perhaps not. While it has some elements of blaxsploitation, it's really more of a cop story that happens to be in Detroit--and the good guys (relatively speaking) are cops. If you are looking for a family film or one to show your mother, DEFINITELY not. But, if you can get past all the nastiness (and there is a lot), the film is exciting, bloody and interesting--and the acting is pretty good from these second and third-tier actors. I also thought the movie was a bit of a surprise because I always thought Detroit was a lot less safe than it was in this movie! By the way, one scene from the film seems like it was lifted from \"Dirty Harry\" (1971). When the cop shoots a suspect with a gun, he tells the bleeding guy \"Go for it, you #^$&%@... Go on maybe I haven't got the guts to kill you...\". And the way it was set up was so similar to Dirty Harry's confrontation with the bank robber. Also, at the minute mark, watch the prostitute get in a cab and the cab is a DIFFERENT cab when she gets out (note the bumpers, among other differences).",
         "I noticed with some amusement that in the end credits, the Detroit PD is thanked for their participation. The Chief of Police even has one speaking line playing himself (and boy, can you tell he can't act). The reason for the amusement is that in this movie the police shoot first and ask questions later. Not the kind of PR, I would think a police force would want. Other than that, this is your standard cops and robbers film dressed up for the '70's with a racial angle. Alex Rocco is given a thankless role of a lifer cop that can't get ahead and is saddled with a mentally ill wife. He makes up for this by hanging out at the local whorehouse. Hari Rhodes is his dashing partner that has a groovy wardrobe and likes to chase after suspects while wearing a trenchcoat. The movie moves along until the penultimate shootout that makes absolutely no sense (why do people that are only guilty of a robbery, take on a whole police force?). Not only do we see one shootout but since there are four bad guys, we get to see four. Then there is a twist ending that is supposed to leave one guessing what really would have happened but only left me thinking how stupid it was. Seeing that director Arthur Marks was also behind the braindead \"Friday Foster\" and \"Bucktown\", I shouldn't have wondered.",
         "\"Lieutenant Danny Bassett\" (Alex Rocco) has just been handed an extremely volatile case involving some burglars who have stolen approximately $4 million in cash and jewels from a fund-raiser being hosted of a black Detroit congressman. There is no way he can win because if the suspects turn out to be black the mostly black population will think it's a cover up. If the perpetrators are white then the white population will think it's a whitewash to appease the black community. And obviously if he fails to find the culprits the public will want his head on a silver platter. To make things even worse a black police sergeant named \"Jesse Williams\" (Hari Rhodes) is also assigned to the case who Lt. Bassett believes will get all of the credit for apprehending the suspects instead of him. Anyway, for a \"blaxploitation\" film this movie wasn't too bad. While the film was a little rough around the edges I liked the selection of Detroit for the movie which was a refreshing change from the usual locations (New York, Los Angeles and Chicago). I also liked the addition of Vonetta McGee as the prostitute \"Roby Harris\". Again, this wasn't a bad blaxploitation film and I rate it as about average.",
         "Another entry into the blaxploitation genre, Arthur Marks's \"Detroit 9000\" has a black detective and a white detective cooperating to investigate the theft of some jewels from a congressman's fund raiser in the Motor City. For the most part the movie has a lot of the things that we expect to see in a blaxploitation flick, although they put an interesting twist on racial stereotypes: the black detective is the refined character while the white detective is the streetwise one. There was even a line or two that they obviously lifted from \"Dirty Harry\". Otherwise, it was just a fun movie with a funk soundtrack. Among the cast members are Hari Rhodes, Alex Rocco (Moe Greene in \"The Godfather\"), Vonetta McGee and Scatman Crothers (Dick Hallorann in \"The Shining\"). Detroit was long seen as the backbone of the US economy and now it's bankrupt. Geez."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Action"
      ],
      "productionCompanies": ["Holly Hill Productions"],
      "summaries": ["After a fundraiser for a black politician is robbed, Detroit police put two detectives, one white and one black, on the case, who try to work together under boiling political pressure."],
      "budget": 0
   },
   "movielensId": 2308,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-08-01",
      "dvdReleaseDate": "2000-11-14",
      "directors": ["Arthur Marks"],
      "runtime": 106,
      "movieId": 2308,
      "title": "Detroit 9000",
      "mpaa": "R",
      "actors": [
         "Alex Rocco",
         "Vonetta McGee",
         "Hari Rhodes",
         "Ella Edwards",
         "Scatman Crothers",
         "Herb Jefferson",
         " Jr.",
         "Robert Phillips",
         "Rudy Challenger",
         "Sally Baker",
         "George Skaff",
         "Stacy Keach",
         " Sr.",
         "June Fairchild",
         "Marilyn Joi"
      ],
      "imdbMovieId": "0069966",
      "originalTitle": "Detroit 9000",
      "genres": [
         "Drama",
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": [
         "drWnXchUaYo",
         "CypXP290RJc"
      ],
      "plotSummary": "After a fundraiser for a black politician is robbed, Detroit police put two detectives, one white and one black, on the case, who try to work together under boiling political pressure.",
      "tmdbMovieId": 85837,
      "avgRating": 2.9,
      "releaseYear": "1973",
      "numRatings": 45,
      "posterPath": "/kDrblsZBZCbDgmcYRPNMMDwNZ8e.jpg"
   }
}