{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "austria",
            "id": 1201
         },
         {
            "name": "village life",
            "id": 1842
         },
         {
            "name": "heart disease",
            "id": 2690
         },
         {
            "name": "self-defense",
            "id": 2801
         },
         {
            "name": "mountain village",
            "id": 2802
         },
         {
            "name": "testament",
            "id": 2850
         },
         {
            "name": "farm worker",
            "id": 3009
         },
         {
            "name": "heart-throb",
            "id": 3188
         },
         {
            "name": "peasant",
            "id": 4402
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "oppression",
            "id": 158455
         }
      ],
      "imdb_id": "tt0141824",
      "video": false,
      "title": "The Inheritors",
      "recommendations": [
         11122,
         21467,
         9010
      ],
      "backdrop_path": "/iCDLPw5TZoyOM6m1Pd0mTUZyhg1.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Lukas",
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b137",
               "name": "Simon Schwarz",
               "profile_path": "/k6A9AWeImpRaVXJNq3lLWHGaSnw.jpg",
               "id": 15121,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Emmy",
               "gender": 1,
               "credit_id": "52fe42e5c3a36847f802b13b",
               "name": "Sophie Rois",
               "profile_path": "/ny7Qq4TpzO6BhaZwZ5xJ9866GhL.jpg",
               "id": 15122,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Severin",
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b13f",
               "name": "Lars Rudolph",
               "profile_path": "/qiWu2gphSg64igYl3Nx0hEIOQF3.jpg",
               "id": 1087,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Großknecht",
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b143",
               "name": "Tilo Prückner",
               "profile_path": "/b1CKloEXUcA1mXEgPcDHEHWiH63.jpg",
               "id": 13812,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Danninger",
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b147",
               "name": "Ulrich Wildgruber",
               "profile_path": null,
               "id": 15123,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Alte Nane",
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b14b",
               "name": "Julia Gschnitzer",
               "profile_path": null,
               "id": 15124,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Rosalind",
               "gender": 1,
               "credit_id": "52fe42e5c3a36847f802b14f",
               "name": "Elisabeth Orth",
               "profile_path": null,
               "id": 15125,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Ganders",
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b153",
               "name": "Werner Prinz",
               "profile_path": null,
               "id": 15126,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b109",
               "name": "Stefan Ruzowitzky",
               "profile_path": "/qlN1bMiTQxcOzMMgNQutA6GI47Q.jpg",
               "id": 15115,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b10f",
               "name": "Stefan Ruzowitzky",
               "profile_path": "/qlN1bMiTQxcOzMMgNQutA6GI47Q.jpg",
               "id": 15115,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b115",
               "name": "Danny Krausz",
               "profile_path": null,
               "id": 14616,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b11b",
               "name": "Kurt Stocker",
               "profile_path": null,
               "id": 15116,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42e5c3a36847f802b121",
               "name": "Peter von Haller",
               "profile_path": null,
               "id": 15117,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b127",
               "name": "Britta Nahler",
               "profile_path": null,
               "id": 15118,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b12d",
               "name": "Erik Satie",
               "profile_path": "/x22NQLDijAjH0CiHLP9qXuhU3p7.jpg",
               "id": 15119,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42e5c3a36847f802b133",
               "name": "Heinz Ebner",
               "profile_path": null,
               "id": 15120,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.825099,
      "production_countries": [{
         "iso_3166_1": "AT",
         "name": "Austria"
      }],
      "id": 1039,
      "vote_count": 7,
      "budget": 0,
      "overview": "In a small farming valley in Austria in the beginning of the 20th century a tyrannical farmer is found dead, and all the farmhands are relieved to be free of their tyrant. But the farmer was childless, so suddenly they all inherit the farm together. Now conflicts begin, as nobody is the boss and nobody has to obey.",
      "similar": [
         553,
         979,
         346,
         281957,
         1049,
         9654,
         10315,
         11121,
         880,
         3134,
         994,
         219,
         9061,
         506,
         11351,
         357096,
         207768,
         244509,
         11235,
         8999
      ],
      "original_title": "Die Siebtelbauern",
      "runtime": 95,
      "poster_path": "/39UvdRSdETUixSeQ86KI996e7J8.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bayerischer Rundfunk",
            "id": 162,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dor Film Produktionsgesellschaft GmbH",
            "id": 608,
            "origin_country": ""
         },
         {
            "logo_path": "/t0QBs2fI3mE3HxgoH1n39bYuzNu.png",
            "name": "Österreichischer Rundfunk (ORF)",
            "id": 3391,
            "origin_country": "AT"
         }
      ],
      "release_date": "1998-06-19",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "The rich get richer... and sometimes the poor get richer too.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Austria",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stefan Ruzowitzky"],
      "runtime": 95,
      "synopsis": "This is an interesting but harsh movie. Many people will find it too depressing to be enjoyable.",
      "writers": ["Stefan Ruzowitzky"],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0141824/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyMzE0NzA0N15BMl5BanBnXkFtZTYwNDk5OTg5._V1_SY225_CR47,0,214,225_AL_.jpg",
      "actors": ["Stars: Simon Schwarz, Sophie Rois, Lars Rudolph | See full cast and crew »"],
      "reviews": [
         "A most unusual film, set in Alpine Austria before the 2nd World War, in which innocent peasants are pitted against greedy,malevolent farmers. The peasants inherit their farm after their master is murdered, but the other farmers and the local priest cannot accept that peasants should own land. So after the initial exuberance of inheritance, the film gets bleaker as the farmers plot to undermine and drive away the new owners, whose success challenges the traditional hierarchy. It is a confrontation familiar in many Westerns - but much more realistic and in consequence that much more gripping. Sub-plots involving each of the inheritors make this a complex and moving story, including a murder mystery and a rural class struggle. The initial driving force is Emmy, a feminist model as she stands up to the foreman and farmers, despite being labelled a whore. But she, like the others, is not just a one-dimensional heroine. Life is difficult as we see the inheritors cope with and buckle under the pressures. The Alpine landscape is an intrinsic part of the film, as we see the seasons change along with the main characters' moods and fortunes. Stefan Ruzumowsky's photographic techniques enhance the interaction of landscape and character and make for an exciting and absorbing film, well worth searching out.",
         "This is a terrific film which I found really gripping because of its story of the unequal fight between a group of peasants and local landowners. So few films seem to portray inequality and the fight for justice that The Inheritors seemed to me like a breath of fresh air. I thought the story was simply but beautifully told, the scene at the communal meal where the characters assert their right to the ownership of the farm against the wishes of the brutal foreman is understated and powerful. The way they are shown standing up to his bullying against the backdrop of the place set as usual for the now dead owner is keenly observed and uplifting. The film looks superb, its rural setting is very authentic, and the performances of the actors catch well the growing confidence and political awareness of the peasants, always laced with elements of self-doubt. There is a tragic core to the film and a melancholy tone but it is never dull or depressing, the characters seem too busy with trying to make good their chance of a better life.",
         "This film is extremely well paced and beautifully photographed, and the characters are easy to relate to. Seven peasants unexpectedly inherit the farm on which they work after the farmer dies. The neighboring farmers view this as a breach of the rigid class structure in rural 19th century Austria and try to destroy the \"One-Seventh Farmers.\" The tenacity with which the new owners defend their farm (and one another) is very touching. I loved it!",
         "When an old \"Bauer\" is found dead, his highly unusual \"last Will and Testament\" puts in motion an avalanche of events, and many dirty old secrets are unearthed, causing an uproar in the small community of landowners and peasants. This film offers many parallels to societies of various times. The basic element of two sets of justice, one for the (untouchable) upper class, and another for the little people, who have to accept whatever is dished out from above, can be likened to similar injustices happening to this very day. The brutality of the wrongs committed to the innocent is often shown in graphic realism. Viewers should be mindful of this, to not be offended by any shocking scenes. Non-gratuitous, thus essential to plot development, the violence furthers the story line. This film can be categorized as a tragedy, although a small glimmer of justice and hope for a better tomorrow is offered in the end. The occasional expressions of human decency and compassion are noteworthy. Only when others realize an injustice and show this by their acts of kindness towards the victims, can we be assured that a better future is before us. Internationally acclaimed, this film is well worth a watch!",
         "An extended demonstration that proletarian struggle is as likely in the pastures as in the steelworks. We side with the peasants as they first feel their way into owning the means of production, then fight the hovering capitalist class as they snipe from the sidelines. A bucolic fantasy overtaken by a sobering chill and a sickening end.",
         "When a farmer is murdered he unexpectedly wills his farm and all his belongings to his 10 peasants, 7 of which decide, even more unexpectedly, to keep the farm and try to run it themselves despite the scorn and outrage of the \"legitimate\" farmers. Thus, they become the \"one-seventh farmers\" in this second feature length movie by prominent Austrian writer/director Stefan Ruzowitzky. A beautifully made movie about class struggles, injustice and vain arrogance (among other things), Die Siebtelbauern is also not a film that unravels the way you'd like it too (thus, it isn't really for everyone). This is quite a bleak film, but it is also extremely engaging as you truly feel for the characters, who were all wonderfully acted. Also serving the film perfectly is its beautiful music, consisting mainly of haunting piano pieces which set the tone very well. Most amusing of all is a well-made nod by Ruzowitzky to First Blood (aka the first Rambo movie) towards the end of the film, which you're likely to appreciate if you've seen said film. All in all, while it isn't essential viewing, this is a splendidly crafted little film, very engaging, beautiful, realistic and dark, and at least on par with Ruzowitzky latest, the Oscar-winning WW2 prison film Die Fälscher (The Counterfeiters).",
         "As I watched \"Die Siebentelbauern\", I was reminded of the film, \"Gosfard Park\", with its theme of class struggles among the \"helpers\" or servants and the upper class at that time. In both films, the moral of not judging another person by their position within society, such as if they are a cook or maid, but viewing them for their true personality, is something which can and should be applied to today's world. In terms of a \"real world\" application, one could view the abuse of a employee by their bose similiar to the kind of abuse, which occured between some servants and masters. Class struggles exist today, just in a different light-the work world.",
         "I increasingly find myself tending to veer away from the more commercial mainstream cinema in an effort to find films which have a story to tell. Catherine Deneuve's comments at this year's `Mostra' are still ringing in my ears \u0096 i.e. she complained of Hollywood cinema being dominated by special effects and hardly any story to go along with. I heartily agree; thus it was with expectancy I watched the Austrian-German production of `Die Siebtelbauern'. On the whole I would say the result was satisfying \u0096 perhaps not great cinema, but at least an interesting tale unfolds in an atypical circumstance. The fable leaves you with some philosophical points to ponder. Seven workers on a farm, including even illiterates among them, inherit the farm the rich landowner leaves them at his death. Happy-go-lucky simple peasants begin to have problems in life, which previously they had never had, both among themselves and with other landed gentry of the district. Considering that many of those taking part in the film are not really professional actors anyway, one should allow certain weaknesses to be overlooked: the story is intriguing, the photography is wonderful, and I at last find an anchor-base from which to be able to comprehend Erik Satie's music with an element of background reality, however allegorical it may be. Well worth a watch, especially if you are not expecting highly-polished glamorous film-making; on the other hand, I would more highly recommend the Italian film `L'Albero degli Zoccoli' (1978) directed by Ermanno Olmi: a poetic rural tale with genuine amateur actors \u0096 an exceptional film.",
         "Whenever I see a movie which deals with injustice stories I feel frightened that it may happen to me. Turn of the 20-th century Austria under the Keiser was otherwise a 'modern' country by European standards, and yet such an injustice story is very credible, and it could have happened elsewhere(although not exactly in the same way in classless rural America). The story line is tragic: a land-owner who has been ruthless and evil during his lifetime, is found dead. For an unknown reason he decides to be generous in his death and leaves his property to the ten peasants who were working on it. The plot thickens. The 'peasants' are not supposed to become property owners. The fact that they do own property now causes trouble with the rest of the village farmers who are unwilling to accept the new breed of farmers, they try to burn their property and this causes a chain of events in which Lukas, the main character, is killed and the others have to flee to America. The lawlessness of the ruling class is the topic here, and it hurts to see how much power they have. A second story line is that of another injustice, that done to Rosalind, the mother Lukas never knew, and who turns out to be the one who killed the farmer because of what he did to her when she was young. In a story resembling Charles Dikens's dramas, she was raped by the farmer and then accused of stealing from him. Her child is Lukas, who never knew his mother,and also never knew who was his father, growing up as 'the foundling' and being ridiculed by everyone in the village. The only flaw I found with this movie is that there are a few flat characters, such as the former foreman, who have no real reason for being so evil. The idea is the communist idea, of the exploitation of the poor by the rich, and the existence of the oppressing class society in old Europe. The idea of injustice by the rich and powerful is not new and can be found also in westerns. The film would have been more satisfying however if the final outcome would have been more positive, good overcoming evil in their own society. But of course, one cannot change the course of history, and indeed at that point in time the only way out of the situation would not have been fighting the system but fleeing to America.",
         "The Inheritors (Die Siebtelbauern), as I remember it, was amusing and also thought-provoking about general socio-economic changes of the past two centuries or so that today many people in Western countries probably take for granted. Perhaps in vague way, it reminds me of an allegory such as Orwell's Animal Farm in the sense of seeing political theory in an intimate, emotional story rather than in some abstract manifesto. While the film might not be the most \"profound\" work of art ever made, it nevertheless deserves a viewing. I say it is quite entertaining and in short, thumbs up."
      ],
      "genres": [
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Bayerischer Rundfunk (BR)",
         "Dor Film Produktionsgesellschaft",
         "Österreichischer Rundfunk (ORF)"
      ],
      "summaries": ["Austria, a little farming valley. Beginning of the century. When one of the farmers is found murdered one day, his labourers know of nothing, but are relieved, as the tyranny has ended. Then, something new happens for the first time in history: The farm workers inherit the whole farm together, as the farmer himself was childless. Now, conflicts come up, as nobody is the boss and nobody has to obey."],
      "budget": 0
   },
   "movielensId": 2309,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1998-06-19",
      "dvdReleaseDate": "1999-10-19",
      "directors": ["Stefan Ruzowitzky"],
      "runtime": 95,
      "movieId": 2309,
      "title": "The Inheritors",
      "mpaa": "R",
      "actors": [
         "Simon Schwarz",
         "Sophie Rois",
         "Lars Rudolph",
         "Tilo Prückner",
         "Ulrich Wildgruber",
         "Julia Gschnitzer",
         "Elisabeth Orth",
         "Werner Prinz"
      ],
      "imdbMovieId": "0141824",
      "originalTitle": "Die Siebtelbauern",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["O7ENCacB9Es"],
      "plotSummary": "In a small farming valley in Austria in the beginning of the 20th century a tyrannical farmer is found dead, and all the farmhands are relieved to be free of their tyrant. But the farmer was childless, so suddenly they all inherit the farm together. Now conflicts begin, as nobody is the boss and nobody has to obey.",
      "tmdbMovieId": 1039,
      "avgRating": 3.36667,
      "releaseYear": "1998",
      "numRatings": 45,
      "posterPath": "/39UvdRSdETUixSeQ86KI996e7J8.jpg"
   }
}