{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ohio",
            "id": 2494
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "disabled",
            "id": 158558
         },
         {
            "name": "learning disability",
            "id": 170783
         },
         {
            "name": "birth defect",
            "id": 170786
         },
         {
            "name": "suit of armor",
            "id": 170801
         }
      ],
      "imdb_id": "tt0119670",
      "video": false,
      "title": "The Mighty",
      "recommendations": [
         17207,
         48287,
         26258,
         48816,
         35645,
         49478,
         8986,
         33657,
         17745,
         19033,
         18856,
         106143,
         31220,
         61418,
         17133,
         83489,
         17949,
         25969,
         47608,
         47881
      ],
      "backdrop_path": "/84WdkWrEnJoPJuNyGsPxesTily0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gwen Dillon",
               "gender": 1,
               "credit_id": "52fe4534c3a36847f80c1f1b",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maxwell \"Max\" Kane",
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f1f",
               "name": "Elden Henson",
               "profile_path": "/nX2c32A2ppiw5IC86zUM4JTLpoz.jpg",
               "id": 20220,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kevin \"Freak\" Dillon",
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f23",
               "name": "Kieran Culkin",
               "profile_path": "/swcqQCMREeGCk6FAxIfczGpFBys.jpg",
               "id": 18793,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Gram",
               "gender": 1,
               "credit_id": "52fe4534c3a36847f80c1f27",
               "name": "Gena Rowlands",
               "profile_path": "/kRHNvkcJlwBr1Xb9XREiZob29NX.jpg",
               "id": 4800,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Grim",
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f4f",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Iggy",
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f53",
               "name": "Meat Loaf",
               "profile_path": "/43nyfW3TxD3PxDqYB8tyqaKpDBH.jpg",
               "id": 7470,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mrs. Addison",
               "gender": 1,
               "credit_id": "52fe4534c3a36847f80c1f57",
               "name": "Jenifer Lewis",
               "profile_path": "/yMClokTiKKwa3KWSfxT1wsy9YZ.jpg",
               "id": 15899,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Kenny Kane",
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f5b",
               "name": "James Gandolfini",
               "profile_path": "/19r3knxqTAPUgfItOPXg3ouOcpI.jpg",
               "id": 4691,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Loretta Lee",
               "gender": 1,
               "credit_id": "52fe4534c3a36847f80c1f5f",
               "name": "Gillian Anderson",
               "profile_path": "/uXw82aq2bH7GUYQIaoihXwDolLK.jpg",
               "id": 12214,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f2d",
               "name": "Bob Weinstein",
               "profile_path": "/hheuMcH8MnFGmatPvhdLUNnSOwm.jpg",
               "id": 1307,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f33",
               "name": "Harvey Weinstein",
               "profile_path": "/jonLOgQIZPBn650kLcsKOPois7U.jpg",
               "id": 59839,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f39",
               "name": "Peter Chelsom",
               "profile_path": "/wFquKk8EJ0U2ZXg9hoTxtskDZtF.jpg",
               "id": 36804,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4534c3a36847f80c1f3f",
               "name": "Rodman Philbrick",
               "profile_path": null,
               "id": 59637,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4534c3a36847f80c1f45",
               "name": "Martin Walsh",
               "profile_path": "/eFdV5n5GV01fwNRzrJn299aFUsq.jpg",
               "id": 9154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4534c3a36847f80c1f4b",
               "name": "Trevor Jones",
               "profile_path": "/86HjonjMXwcDyOlpaQW1SVR9CXh.jpg",
               "id": 7020,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.208952,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9821,
      "vote_count": 76,
      "budget": 0,
      "overview": "This tells the story of a strong friendship between a young boy with Morquio's syndrome and an older boy who is always bullied because of his size. Adapted from the novel, Freak the Mighty, the film explores a building of trust and friendship. Kevin, an intelligent guy helps out Maxwell to improve his reading skills. In return, Kevin wants Maxwell to take him out places since he is not allowed out unauthorized. Being the social outcasts of the town, Kevin and Maxwell come to realize that they are similar to each other and accept that they are \"freaks\" and nothing will stop them.",
      "similar": [
         398818,
         9779,
         84892,
         14,
         449176,
         391713,
         11421,
         26371,
         376660,
         24584,
         13193,
         281007,
         304410,
         129139,
         36040,
         9571,
         13990,
         100898,
         27103,
         10938
      ],
      "original_title": "The Mighty",
      "runtime": 100,
      "poster_path": "/mPd6AxMdTtOvfKd8c2Wc3OalIhG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1998-10-23",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "The quest for friendship is the noblest cause of all",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Chelsom"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Rodman Philbrick",
         "Charles Leavitt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119670/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2ODQzNDgwNF5BMl5BanBnXkFtZTcwNDI5OTEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Kieran Culkin, Elden Henson, Sharon Stone | See full cast and crew »"],
      "reviews": [
         "This movie is a real sleeper. I heard it was pretty good from a friend. My friend really understated. Every thing about this movie is thoroughly enjoyable. The story is enthralling. The cinematography and special effects are wonderful. The acting is, well Harry Dean Stanton and Gena Rowlands do their usual great job and the two boys who play Max and the Freak (Kevin), Elden Ratliff and Kieran Culkin are impressive. Meat Loaf and Gillian Anderson are a trip to watch and Sharon Stone showed me acting that I didn't think she had in her. All in all a cast that does a great job. The sound track is really something. I thoroughly enjoyed the music. If there was a small impediment in the film, it was a story that could of played on sympathy, but I don't think it was harmful. I've seen this storyline before, but the way it was done I didn''t care. See it.",
         "I heard about \"The Mighty\" after I saw The Battle of Shaker Heights and thought I'd find more movies with Elden Henson. I find that he has an ability to play the stupidest characters well (\"Idle Hands\") and the most clever (\"Shaker Heights\"). Anyway, I rented The Mighty because of its good rating and strong cast. It was not what I expected.. it was so much greater. I have seen more than one's share of films and trust that the Mighty will not disappoint. A gem in the rocks? Much more. I have never read \"Freak the Mighty\" but this movie has me out seeking a copy. Of course, Rowland's and Stanton's acting was solid. Elden Henson's and Kieran Culkan's are stunning. I believe this is one of Sharon Stone's best performances and Gillian Anderson shows her ability and range. Gandolfini was also as strong an asset as anyone else. This movie was just filled with stellar performances and moments that just make the audience get into the scene. I really wish this movie had been advertised much more. I mean, my seeing it was quite an oddity. Makes me wonder how many of these great unseen movies I'm missing. Rent it. Buy it. Borrow it. You will not regret it.",
         "This movie was great and I'd encourage anyone to see it. Both of the young actors are fantastic, especially Eldon Henson, and the adults in the movie are pretty good, too. Gillian Anderson and Henson have a really beautiful moment at a bus stop near the end. I also cried at one point quite a lot. It really was an amazing movie and deserves some praise.",
         "\"Sometimes seems like the whole world has just seen me on America's Most Wanted.\" (Max Kane) So says the imposing gentle giant Max (the excellent Elden Ratliff). He is a 13-year-old with a murdered mother and murdering jailbird father (James Gandolfini), who has twice failed 8th grade and lives with disgruntled grandparents Gram and Grim (the particularly morose Harry Dean Stanton and Gena Rowlands). It's a wonder he isn't Mad Max. However, he has a saviour. A minor miracle named Kevin Dillon (Kieran Culkin). Sounds cheesy, but The Mighty is anything but. Peter Chelson, director of the inventive and original Funny Bones, has lovingly superimposed Rodman Philbrick's successful children's book Freak The Mighty to the screen. The result is as moving as any kiddies film you've seen in the last ten years. Kevin is suffering from Morquio's syndrome, a progressively degenerative disease that makes him unable to walk without leg braces. However, the boy is a considerable intellectual giant trapped inside a small, fragile body. As luck would have it he is consigned to tutor Max in remedial reading. In the words of Bogart it's the start of a \"beautiful friendship\". Kevin introduces the big guy to Arthurian legend. \"Every word is part of a picture. Every sentence is a picture. All you do, is let your imagination connect them together. If you have an imagination that is,\" he says. Inspired by the knights in the book, the boys invent a fantasy world in which honour is everything. Together, Max and Kevin set out to battle their foes, both real and imagined. Do not be put off by the presence of a Culkin or the mention of King Arthur. The Mighty is sincere, without being turgidly earnest, and genuinely uplifting. Sharon Stone equips herself well as the distraught mother of Kevin, but can't quite convince us that she doesn't ooze glamour. The \"bad\" kids also do not quite fit, resembling the troublesome urchins in Bugsy Malone rather than vicious Cincinnati hoodlums. However, these are minor quibbles, for ultimately The Mighty is several notches above the average children's film. Ben Walsh",
         "Caught this one on late-night cable (where else) and just had it on in the background while I worked.... About ten minutes in it pretty much had my attention. About 30 minutes in, as the unique relationship between the two main characters comes into being, I was hooked. This thing fires on all pistons. Great story, great actors, intelligent humor, moments of genuine tension, and genuinely touching moments without a hint of sappiness. There's not a cliché' in site. The script is wonderful, and the director throws a few remarkable cinematic touches at us, despite this being obvious a lowish-budget flick. Did I mention that it's a wonderful, wonderful film? I'd give it a \"12\" if I could.",
         "A touching story about a friendship between two middle school boys. Max(Henson) is a big kid who has a rough past, while Kevin or \"freak\" as they call him in the film is a boy with a physical disability that prevent him from walkin without stilt like crutches. Kieran Culkin was great in this film, very good performance early in his career. Elden Henson was not bad in a role that could have been played better, but he was decent, it was a bit of a hard role. Gandolfini was great and stole his limited number of scenes. Harry Dean Stanton was good as well, as was Gillian Anderson. The one disappointment was Sharon Stone who was very good in her scenes, but a bit wasted due to the screenplay concentrating mostly on the teenage characters. This film moves a bit slow, but is nonetheless a very heartwarming and touching picture. The direction is good, and screenplay is solid as well, acting is good for the most part. a Solid film. 8/10",
         "Granted,this film was no \"blockbuster\" when it came out in 1998. It did good business but after it's run,it was sort of forgotten. I have never even seen it on TV (to my knowledge). Thank goodness for home video rental & libraries! I just watched it for the first time in 7 years and it was still as great as it was then. Simple plot,a very large boy with a troubled family past,meets and makes friend with a young boy who,despite walking with two hand-grip crutches seems almost fearless and able bodied. As well as very able minded,a genius he is! I wont spoil this movie by going into too much detail except to say,watching these two young actors \"interact\" is what makes it such a triumph in film-making. Stone is great also as the little boy's mother and one would almost not recognize Gillian Anderson outside of the X-Files,I know I didn't! Buy or rent it. Good for kids,to age 8 and up I'd say! Edit : August 2010 , finally read the book!",
         "Peter Chelsom's \"The Mighty\" is a good way to witness the bonding between two young boys whose lives come together in the most unexpected ways. These two wounded souls see in each other what they would like to be. Max would like to be as intelligent as Kevin, and Kevin would like to have Max's health. Max's father having killed his mother, is serving time in jail. He is being raised by his aging grandparents. Max has withdrawn from the world. He is doing poorly in school having repeated the seventh grade and has no social graces. Kevin is a boy suffering from a debilitating disease that has made him walk with the help of crutches. Kevin is made Max's reading tutor. It's appalling to see a grown boy like Max struggling to read a book. With Kevin's help he not only improves his reading, but form a winning team in trying to defeat the bullies that make their life impossible. Max begins carrying Kevin on his shoulders all over the city. Eventually, fate intervenes in their lives. Max's father comes out of jail and he kidnaps his own son. Kevin, is instrumental in rescuing his buddy, but at the same time, his illness gets the best of him. This is a film that is deceiving. Judging by all the big names in the cast, one doesn't expect the movie to be basically about the two boys. Elden Henson and Kieran Culkin are Max and Kevin, respectively. Both do excellent work under the inspired direction of Mr. Chelsom, who gets also good ensemble work from his cast. Gena Rowlands, Harry Dean Stanton, Sharon Stone, Gillian Anderson and James Gandolfini play second fiddle to the two young actors, who steal the movie and make it their own. This is a positive film about how to overcome obstacles in life without fear.",
         "This is a great movie with great actors. I really liked the two friends, especially the tall kid (I'm too lazy to look his name up again)...anyhow...he has done some good work in some very small films (mostly), and he always gets the characters he plays just right. The movie overall is a very touching story, and it's hard not to get teared up every now and then. The cast works really well in all the roles, and all of the acting is very good. I really like the use of music in this movie, it goes a long way in making the story that much better...and it seems to lend a certain mood to the entire film. It's refreshing to see \"feel- good\" movies like this, without all the pointless, useless violence and/or sex scenes. It seems to be a movie made for one reason- to entertain and enlighten (to a point)...not for cash, like most movies. It might not have done a huge box office, but it's well worth whatever you spend renting it, or you might stay up late and catch it on one of the premium networks. I would definitely recommend this movie, you won't be sorry. 9/10",
         "This movie was very good. I don't usually rate a movie a full ten. I believe that I have only rated maybe a dozen movies in my lifetime this high. The ending musical score will make one soar with the bird. It is an amazing final scene. Others I have scored high are Network, A Clockwork Orange, O Brother, Where Art Thou? The Long Riders and Cat Ballou. I believe that Harry Dean Stanton and Sharon Stone did not receive enough on screen time. The Mighty flowed pretty smooth and there weren't a lot of slow periods. I would have liked to have seen more action when the boys were bullied but then again that may have given younger viewers ideas. But beware..the soundtrack to The Mighty does not include the ending theme music which is the best part of the soundtrack."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Chaos Productions",
         "Jane Startz Productions",
         "Miramax"
      ],
      "summaries": [
         "This tells the story of a strong friendship between a young boy with Morquio's syndrome and an older boy who is always bullied because of his size. Adapted from the novel, Freak the Mighty, the film explores a building of trust and friendship. Kevin, an intelligent guy helps out Maxwell to improve his reading skills. In return, Kevin wants Maxwell to take him out places since he is not allowed out unauthorized. Being the social outcasts of the town, Kevin and Maxwell come to realize that they are similar to each other and accept that they are \"freaks\" and nothing will stop them.",
         "This is a story of two guys: Max looks like a slow-moving idiot and is almost illiterate and Kevin has a rare disease that physically deformed him. Kevin lives next door to Max and one day is assigned as a reading tutor to him. Together they travel to the land of knights and heroes in their books.",
         "This is the heart-warming story of a unique friendship shared by two seventh grade boys, Kevin and Max. Kevin, afflicted with a rare physical disability that prevents him from living a normal childhood, is an extremely intelligent boy who lives in the world of his imagination. Max on the other hand, is an over-weight boy who suffers from a learning disability and has failed the seventh grade several times. Fate brings the boys together when Kevin is assigned to tutor Max in his reading skills; here their magical journey begins. These two boys, who appear on the surface to have nothing in common, find they share many painful realities of being outcasts, and of being abandoned by their fathers early in life. Kevin's enchanting world of knights and their quest for justice is brought into reality through his exciting journey with Max. Through their adventures, they find a friendship providing completeness of self and an unbreakable bond of love."
      ],
      "budget": 0
   },
   "movielensId": 2310,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-23",
      "dvdReleaseDate": "1999-06-29",
      "directors": ["Peter Chelsom"],
      "runtime": 100,
      "movieId": 2310,
      "title": "The Mighty",
      "mpaa": "",
      "actors": [
         "Sharon Stone",
         "Elden Henson",
         "Kieran Culkin",
         "Gena Rowlands",
         "Harry Dean Stanton",
         "Meat Loaf",
         "Jenifer Lewis",
         "James Gandolfini",
         "Gillian Anderson"
      ],
      "imdbMovieId": "0119670",
      "originalTitle": "The Mighty",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["55NnLGNeZ-k"],
      "plotSummary": "This tells the story of a strong friendship between a young boy with Morquio's syndrome and an older boy who is always bullied because of his size. Adapted from the novel, Freak the Mighty, the film explores a building of trust and friendship. Kevin, an intelligent guy helps out Maxwell to improve his reading skills. In return, Kevin wants Maxwell to take him out places since he is not allowed out unauthorized. Being the social outcasts of the town, Kevin and Maxwell come to realize that they are similar to each other and accept that they are \"freaks\" and nothing will stop them.",
      "tmdbMovieId": 9821,
      "avgRating": 3.59971,
      "releaseYear": "1998",
      "numRatings": 1023,
      "posterPath": "/mPd6AxMdTtOvfKd8c2Wc3OalIhG.jpg"
   }
}