{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "deaf-mute",
            "id": 1635
         },
         {
            "name": "listening",
            "id": 3770
         },
         {
            "name": "man-woman relation",
            "id": 5756
         },
         {
            "name": "deaf",
            "id": 33756
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "sign language",
            "id": 188953
         }
      ],
      "imdb_id": "tt0090830",
      "video": false,
      "title": "Children of a Lesser God",
      "recommendations": [
         12560,
         62529,
         12614,
         58886,
         30500,
         41647,
         162853,
         231040,
         143770,
         94732,
         195092,
         195073,
         231423,
         212185,
         148791,
         114145,
         190574,
         231375,
         231035,
         163386
      ],
      "backdrop_path": "/r2sJ5DTyIrVoShXF1xaf0TmBekp.jpg",
      "revenue": 31853080,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "James Leeds",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803bac5",
               "name": "William Hurt",
               "profile_path": "/zp6UOht6c1iyHDbpYn1hkX103lG.jpg",
               "id": 227,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Sarah Norman",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803bac1",
               "name": "Marlee Matlin",
               "profile_path": "/jqu19nl2p46GE6UAkfztD7jpKOv.jpg",
               "id": 19797,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Mrs. Norman",
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803bb07",
               "name": "Piper Laurie",
               "profile_path": "/eKjVK5MQ5RK9XuVLaCC2oYACmbK.jpg",
               "id": 6721,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Dr. Curtis Franklin",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803baff",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Lydia",
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bb0b",
               "name": "Allison Gompf",
               "profile_path": null,
               "id": 25187,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Johnny",
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bb0f",
               "name": "John F. Cleary",
               "profile_path": null,
               "id": 25188,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "William",
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bb03",
               "name": "John Limnidis",
               "profile_path": null,
               "id": 25186,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Glen",
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bb13",
               "name": "Philip Holmes",
               "profile_path": null,
               "id": 25189,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Orin",
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803bb17",
               "name": "Bob Hiltermann",
               "profile_path": "/21VwWqVf87gSDmcwunUaoRdplqY.jpg",
               "id": 25190,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Cheryl",
               "gender": 0,
               "credit_id": "599b2c98c3a3681d4b0029fd",
               "name": "Georgia Ann Cline",
               "profile_path": null,
               "id": 1873994,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Danny",
               "gender": 0,
               "credit_id": "599b2ca792514127dc002846",
               "name": "William D. Byrd",
               "profile_path": null,
               "id": 1873995,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Tony",
               "gender": 0,
               "credit_id": "599b2cb4c3a3681d9300278e",
               "name": "Frank Carter Jr.",
               "profile_path": null,
               "id": 1873996,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Mary Lee Ochs",
               "gender": 0,
               "credit_id": "599b2cd0925141279700290f",
               "name": "E. Katherine Kerr",
               "profile_path": "/rXWKKtItHcuRh5NENl0gVkhKYc4.jpg",
               "id": 1218055,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Alan Jones",
               "gender": 0,
               "credit_id": "599b2cdfc3a3681dce00284e",
               "name": "John Basinger",
               "profile_path": null,
               "id": 1873997,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Tom Schuyler",
               "gender": 0,
               "credit_id": "599b2ceb92514127930029d2",
               "name": "Barry Magnani",
               "profile_path": null,
               "id": 1873998,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803bacb",
               "name": "Randa Haines",
               "profile_path": null,
               "id": 19798,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bad1",
               "name": "Mark Medoff",
               "profile_path": null,
               "id": 19799,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bad7",
               "name": "Burt Sugarman",
               "profile_path": null,
               "id": 25184,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803badd",
               "name": "Patrick J. Palmer",
               "profile_path": null,
               "id": 10829,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803bae3",
               "name": "Michael Convertino",
               "profile_path": null,
               "id": 4055,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe431ec3a36847f803bae9",
               "name": "John Seale",
               "profile_path": "/w4wp04pRMqJI2vt3gFTdIWLDDzp.jpg",
               "id": 2702,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe431ec3a36847f803baef",
               "name": "Lisa Fruchtman",
               "profile_path": null,
               "id": 3274,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803baf5",
               "name": "Gretchen Rennell",
               "profile_path": null,
               "id": 7534,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe431ec3a36847f803bafb",
               "name": "Barbra Matis",
               "profile_path": null,
               "id": 25185,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.51088,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1890,
      "vote_count": 89,
      "budget": 0,
      "overview": "James is a new speech teacher at a school for the deaf. He falls for Sarah, a pupil who decided to stay on at the school rather than venture into the big bad world. She shuns him at first, refusing to read his lips and only using signs. Will her feelings change over time?",
      "similar": [
         9813,
         378064,
         858,
         112160,
         141,
         634,
         242224,
         258480,
         271397,
         43923,
         8981,
         297762,
         437557,
         27586,
         713,
         2771,
         9587,
         3134,
         11236,
         13075
      ],
      "original_title": "Children of a Lesser God",
      "runtime": 119,
      "poster_path": "/93JsPFbIWXQBv99aQcz5Rzoa7zt.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1986-09-13",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Love has a language all of its own.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Randa Haines"],
      "runtime": 119,
      "synopsis": null,
      "writers": [
         "Mark Medoff",
         "Hesper Anderson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090830/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1Mzg2MzQ4MV5BMl5BanBnXkFtZTcwNzAxMzUwMg@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: William Hurt, Marlee Matlin, Piper Laurie | See full cast and crew »"],
      "reviews": [
         "Hollywood is full of overly wrought love stories in which the conflict seems contrived merely to create drama or comedy or both. In Children of a Lesser God the love is so simple, and the conflict so believable, that it feels less like watching a movie, and more like watching friends walk through their own personal story. The attraction between Matlin and Hurt is obvious, but genuine, and is filled with the kind of \"touches\" that make it feel real. It is also a visually beautiful film. Each shot is set like a still photographer capturing an image. The overwhelming beauty of the New Brunswick coast creates a background for the film that leaves one with the feeling of watching a moving painting. Matlin has unfortunately not since been offered anything near this piece in which to display her amazing talent. It is a shame that a woman who could stand alongside Katherine Hepburn and Jodie Foster as all time great actresses is not having the opportunity to display that talent because of her hearing disability.",
         "This is perhaps the most moving and thought-provoking film about love and being in a relationship that I have ever seen. Matlin takes your breath away as you fall in love with her and she breaks your heart. Randa Haines documents, meticulously, the real effort and struggle that must go into negotiating a romantic relationship between any two individuals, and also the priceless dividends we reap by doing so- namely, love, home, friendship, acceptance, family: life. \"Children of a Lesser god\" allows you to think, feel, and experience the things all good movies should. I highly recommend it...Matlin gives an awe-inspiring performance, 100% deserving of the Oscar she won for it. William Hurt balances the entire film, a feat which perhaps made him even more deserving of an Academy Award. All-in-all, if you want to watch a movie that tackles the timeless and immortal themes of love, communication, our relationship to the world, our relationship to our significant other, and most importantly our relationship to ourselves, I highly recommend this film. It will move you to tears.",
         "This is one my favorite movies of all time. The quality of the acting leaves me breathless. The scene where Sarah is dancing slowly to a song by the Staples Singers says so much - the tempo is fast and most people were disco dancing or \"stepping\" to \"I'll Take You There.\" Sarah feels the real underlying slow beat of the music and responds to that. It was a very moving scene. Piper Laurie as her mother was phenomenol. Her expressions and body language said so much more than her words. You could tell she really loved Sarah and was frustrated that she didn't really understand her. She also had a little bit of the \"bury your head in the sand\" approach to Sarah's deafness. Sarah was determined to have the world accept her on HER own terms and simply turned her back on it when it did not. Sarah was intelligent, beautiful and fun. She couldn't understand why people seemed to define and categorize her by her deafness. She was so much more than that and William Hurt's (I don't remember his name in the movie) character was sensitive enough to recognize that. His character was a little condescending and pushy, and I can see where he would get on any girl's nerves because he was not a good listener. He wanted Sarah to be the person he though she should be and justified it under his guise of \"helping\" her to cope in a hearing world. She was smart enough to figure him out and reject his attempt to mold her. You could feel Sarah's loneliness in her silent world and you knew that she wanted love, friends and happiness just like the rest of us, but didn't know if she would ever get them. I really loved the character and the whole movie. It gave us a brief glimpse into a deaf person's world through some extraordinary scenes: Sarah swimming and describing to William Hurt exactly how she imagined waves sounded, and getting it right; Marian Lesser communicating only in sign language at the party which gave William Hurt's character a chance to see things from another perspective. I think he learned that there is more than one standard way to live and enjoy life and being unable to hear isn't the worst thing that could happen to a person.",
         "Yes, this is a love story about two unusually attractive people but its power comes from Hurt and Matlin's ability to increasingly convey vulnerability and authenticity as they fight to become completely real to each other. Marlee in particular is remarkable in her expressiveness. There is a scene where she watches Hurt while she's in an indoor swimming pool and you only see her eyes over the edge of the pool -- but the depth and variety of what \"just those eyes\" express! Because all of us intuitively know what they are going through as they strip away layer after layer -- who of us hasn't feared exposure of the person we feel the world shouldn't see? -- we are drawn into their revealing their secret selves because we wish we knew who OUR OWN secret self is. And the film is funny, engaging, touching, crazy and human!",
         "Hurt is excellent, Laurie and Bosco are outstanding, but Matlin gives one of the most amazing cinematic performances of all time. She is scintillating. The play is even more forceful with her gritty performance that it was with Phyllis Frielich on broadway. The direction makes up what it lacks in imagination with conviction and sincerity. I recommend it highly.",
         "There are certain minorities that are not often represented in films, and the deaf is one of these groups. It is fascinating to watch this film, as it provides an insight into working with the deaf, and trying to make it so they can cope in a world full of noises. William Hurt gives off a very naturalistic performance, managing to add eccentricity to his role without overdoing it, and his acting also includes having to sign naturally. Even though it seems like an audience pleaser to have him translate out loud everything that Marlee Matlin is saying, it is still a credible performance. Matlin is also very good, deaf in real life, and she won an Oscar for her role. The film is let down however by the choice of a generic plot structure. The impending character relationships and storyline are very predictable, although the screenplay has some interesting ideas to keep it afloat. A lot of the film is concerned with being able to accept a person for who he or she is, and whether one should adjust one's ways or having others adjust for them. It is a good film, and has careful sound mixing work too. Matlin's constant anger is perhaps not realistic, and it is very easy to see where the film is going, but these points do not stop it from being effective viewing and good film-making in general.",
         "When I first saw this movie I knew only the hand alphabet, but this movie made me want to learn more. After years of picking up bits here and there I am amazed at how well William Hurt used signs. Personally I think basic sign language should be taught in all schools. This is a very touching love story and I never get tired of seeing it. James is not perfect as the teacher trying to deaf students to speak. He makes many mistakes, but you can see how he cares very much. The love he has for Sarah is very real. I felt so sorry for Sarah but I also knew that she was a survivor. I would love to have that kind of strength. I have seen Marlee Matlin in lots of things since this and she is definitely a great actor.",
         "I enjoyed this movie because I understood, at least in part, the need for isolation as a defence against the world. I also believe that one can find someone to share the silence and it is that that makes being vulnerable worth it. Life can have a harmony of two together if you are willing to give it your all.",
         "William Hurt plays a speech therapist, James Leeds, a gifted teacher. His success in his field has not prevented him from being an egotist, anddisrespecting other cultures. Marlee Matlin plays a Deaf woman, Sarah Lee, who's damaging family experience has caused her to become so angry that even though she is an intelligent, sassy, sensual, independent woman, she prefers to mop floors in her old school. Sarah is contrasted with the other Deaf people who are working on their speech. Although he signs, James is highly dogmatic about the primary necessity of speech. The other Deaf people come across as disabled in comparison, their speech flawed compared to Sarah's eloquent and expressive signing. Their vocabulary is basic; in one scene their attempt at signing delights the hearing audience as they imagine the Deaf kids getting closer to being \"normal\". James falls in love with Sarah's strong and commanding personality, but paradoxically still treats her in a patronising way, aiming to \"improve\" her by working on her speech. It becomes a battle of wills between them as Sarah seeks to have autonomy over her preferred medium of communication. Even so, the dynamic of the relationship spurs Sarah on beyond the narrow horizons of her menial job.",
         "Oh, I loved this movie! What a wonderful romance through the barriers of language! Marlee Matlin is wonderful, and William's singing is really good. Watch with someone you love and appreciate your relationship even more, also pay attention to the words and ways that Hurt looks at her, so romantic!"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["James is a new speech teacher at a school for the deaf. He falls for Sarah, a pupil who decided to stay on at the school rather than venture into the big bad world. She shuns him at first, refusing to read his lips and only using signs. Will her feelings change over time?"],
      "budget": 0
   },
   "movielensId": 2312,
   "movielens": {
      "languages": [
         "Český",
         "English"
      ],
      "releaseDate": "1986-09-13",
      "dvdReleaseDate": "2000-12-12",
      "directors": ["Randa Haines"],
      "runtime": 119,
      "movieId": 2312,
      "title": "Children of a Lesser God",
      "mpaa": "R",
      "actors": [
         "William Hurt",
         "Marlee Matlin",
         "Piper Laurie",
         "Philip Bosco",
         "Allison Gompf",
         "John F. Cleary",
         "John Limnidis",
         "Philip Holmes",
         "Bob Hiltermann",
         "Georgia Ann Cline",
         "William D. Byrd",
         "Frank Carter Jr.",
         "E. Katherine Kerr",
         "John Basinger",
         "Barry Magnani"
      ],
      "imdbMovieId": "0090830",
      "originalTitle": "Children of a Lesser God",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["E0AMKG31wME"],
      "plotSummary": "James is a new speech teacher at a school for the deaf. He falls for Sarah, a pupil who decided to stay on at the school rather than venture into the big bad world. She shuns him at first, refusing to read his lips and only using signs. Will her feelings change over time?",
      "tmdbMovieId": 1890,
      "avgRating": 3.72101,
      "releaseYear": "1986",
      "numRatings": 2889,
      "posterPath": "/93JsPFbIWXQBv99aQcz5Rzoa7zt.jpg"
   }
}