{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120603",
      "video": false,
      "title": "Beloved",
      "recommendations": [
         68665,
         53104,
         35151,
         86215,
         81626,
         306307,
         23532,
         32904,
         77936,
         106222,
         26195,
         116014,
         465,
         25985,
         111883,
         31094,
         44806,
         28741,
         19809,
         25624
      ],
      "backdrop_path": "/rXVcTEiLLvkI3dGiPqOiOuPq3dP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sethe",
               "gender": 1,
               "credit_id": "52fe47199251416c91069f31",
               "name": "Oprah Winfrey",
               "profile_path": "/jlsGiD71V3sZYrGG5aNgcQsElMn.jpg",
               "id": 13309,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paul D Garner",
               "gender": 2,
               "credit_id": "52fe47199251416c91069f35",
               "name": "Danny Glover",
               "profile_path": "/jSNTEnm0Sxm8FRtoBfJmhmQyozH.jpg",
               "id": 2047,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Beloved",
               "gender": 1,
               "credit_id": "52fe47199251416c91069f39",
               "name": "Thandie Newton",
               "profile_path": "/sW6XsnM2DkX6ujOXZ38aIQAMIWi.jpg",
               "id": 9030,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Younger Sethe",
               "gender": 0,
               "credit_id": "52fe47199251416c91069f3d",
               "name": "Lisa Gay Hamilton",
               "profile_path": "/a9DRGto0Dm63mbqq56dhw4aZBzM.jpg",
               "id": 64908,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Stamp Paid",
               "gender": 2,
               "credit_id": "52fe47199251416c91069f41",
               "name": "Albert Hall",
               "profile_path": "/yHGN2pIdBcBk19sAu0EchOxfYMY.jpg",
               "id": 8354,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Ella",
               "gender": 1,
               "credit_id": "52fe47199251416c91069f45",
               "name": "Irma P. Hall",
               "profile_path": "/jotUUXdkfC7kdreWHSEVamz2mUy.jpg",
               "id": 43853,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Denver",
               "gender": 1,
               "credit_id": "52fe47199251416c91069f49",
               "name": "Kimberly Elise",
               "profile_path": "/315K0qi3aFmcgGweUiLwhdrvcfU.jpg",
               "id": 55314,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Baby Suggs, aka Grandma Baby",
               "gender": 1,
               "credit_id": "52fe47199251416c91069f4d",
               "name": "Beah Richards",
               "profile_path": "/iJjXKrigq7w7zLl3nHnr4AUESjm.jpg",
               "id": 32774,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Grace",
               "gender": 0,
               "credit_id": "58bd6fb09251413435001e34",
               "name": "Vertamae Grosvenor",
               "profile_path": "/lWsntXgKQslH9pLZRnVYCfusErR.jpg",
               "id": 1770964,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "M. Lucille Williams",
               "gender": 1,
               "credit_id": "5a054a919251417dc900d5b4",
               "name": "Dorothy Love Coates",
               "profile_path": null,
               "id": 1920842,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47199251416c91069f53",
               "name": "Jonathan Demme",
               "profile_path": "/17dEjoWccPf9NDm43XP44vhSTEd.jpg",
               "id": 16294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47199251416c91069f59",
               "name": "Toni Morrison",
               "profile_path": "/h8PnSOLvLOTYAfP6BWGQNmX38Jv.jpg",
               "id": 992503,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47199251416c91069f5f",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "563bb43bc3a3681b5c026efb",
               "name": "Tak Fujimoto",
               "profile_path": "/stUrxvmoFNrNLskc2oPhrOOeinB.jpg",
               "id": 16300,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 1,
               "credit_id": "563bb44a9251416d520168f2",
               "name": "Rachel Portman",
               "profile_path": "/AkMflxC3EkbWuyPoltQ406EJvue.jpg",
               "id": 3562,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 1,
               "credit_id": "584dc031c3a368321c00247d",
               "name": "Akosua Busia",
               "profile_path": "/wxelYaGa4xWcFhII3EebwX5pscZ.jpg",
               "id": 13308,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "584dc04d92514118e00022ee",
               "name": "Richard LaGravenese",
               "profile_path": "/8AF47SFj7L50qpWIz8PmdOEcU62.jpg",
               "id": 2163,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "584dc0b0c3a368322e002728",
               "name": "Adam Brooks",
               "profile_path": "/yUyhsz2KZ87ePFxyQGeW9FjoGZ6.jpg",
               "id": 16328,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "584dc0e8c3a36832340023b3",
               "name": "Andy Keir",
               "profile_path": null,
               "id": 63980,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "584dc0f7c3a368322e00278b",
               "name": "Carol Littleton",
               "profile_path": "/wsQP1noRhkMRujRJ3uVntLXSFLf.jpg",
               "id": 9966,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.097359,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39437,
      "vote_count": 33,
      "budget": 0,
      "overview": "After Paul D. finds his old slave friend Sethe in Ohio and moves in with her and her daughter Denver, a strange girl comes along by the name of \"Beloved\". Sethe and Denver take her in and then strange things start to happen...",
      "similar": [],
      "original_title": "Beloved",
      "runtime": 172,
      "poster_path": "/jwzOg5RBIF2ZkF67BnYibSPp4P8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Harpo Films",
            "id": 3298,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-16",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "The past has a life of its own.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jonathan Demme"],
      "runtime": 172,
      "synopsis": "The story, set shortly after the Civil War, revolves around Sethe, a former slave living on the outskirts of Cincinnati. When the film begins, an angry poltergeist is terrorizing Sethe and her three children. After Sethe temporarily soothes the angry spirit, her two sons run away from home, never to return. Ten years later, Sethe (Oprah Winfrey), who by this time lives alone with her daughter Denver (Kimberly Elise), runs into Paul D. (Danny Glover) an old friend from Sweet Home, the plantation Sethe escaped from many years earlier. She invites him into the house where he encounters the angry spirit head-on. Paul D. stands his ground with the spirit, driving it off. After everything in the house calms down, Paul D. and Sethe, from a mixture of unexpressed emotions and the equal share of a painful past, have passionate sex in her bedroom. After Sethe invites him to stay for a while, he heartily agrees. Shortly after Paul D. moves in, a young woman (Thandie Newton) stumbles into Sethe's yard, falling into a deep sleep and loudly snoring beneath a tree. She is clean and well groomed, dressed in black silk dress and hat. Sethe and Denver take an immediate liking to the mysterious stranger, bringing her into the house and placing her in bed. Paul D. on the other hand feels suspicious; he wonders how someone who travelled such a long way could be so clean or have such soft well-maintained feet. When the visitor awakes, she demands food in a voice that is croaky with disuse. When the women ask her name, she spells it out for them--Beloved. Denver, who has experienced social isolation as the result of the goings on in the house, is especially happy to have Beloved around, spending many hours playing and talking with the young woman. One night, Beloved reveals her otherwordly origins. Denver, who immediately realizes the import of Beloved's confession, asks her never to tell Sethe who she really is. Beloved nastily informs her that she came to the house to see Sethe, not her, and that Denver is never to tell her what to do. However, Beloved does apologize to Denver once she realizes that she has hurt her feelings and the two young women quickly make up. Shortly after, Beloved, sensing that Paul D. dislikes her, casts a spell on him that renders him powerless and sexually assaults him. Paul D. resolves to tell Sethe about what happened only to change his mind and ask Sethe to have a baby with him. Sethe, despite misgivings about her age, eagerly accepts his proposal. Paul D. then tells a co-worker, Stamp Paid (Albert Hall) about his plans. Stamp Paid, who has known Sethe for many years, pulls an old newspaper clipping about Sethe out of his pocket. Paul D., who can't read, then asks Stamp Paid to tell him the story behind the clipping. During a flashback, it is revealed that Sethe had run away from Sweet Home after a particularly brutal beating. (Sethe had been sexually assaulted at the instigation of Schoolteacher, the owner of Sweet Home, by several of the farm hands. She complained to Mrs. Garner, Schoolteacher's wife, who confronted him about what happened. Schoolteacher then ordered the field hands to whip her savagely, leaving a massive tree-like scar imprinted on her back.)) Heavily pregnant with her fourth child, Sethe arranges to have her three older children sent ahead to Cincinnati to live with their paternal grandmother, Baby Suggs (Beah Richards). After the children are gone, Sethe plans to slip off in the night with her husband where they will make their way to the Ohio River, rendevous with Stamp Paid, and cross into Ohio. When her husband fails to show, Sethe runs off alone. She then crosses path with Amy Denver, a kind white woman who attends to Sethe's numerous injuries and delivers Sethe's child. She promises to name the baby Denver before Amy helps her cross the river. After arriving in Ohio, Sethe meets up with Stamp Paid, who delivers her to Baby Suggs' house. Although she is dismayed to discover that her husband never made it to his mother's house, she is overjoyed to be reunited with her children. However, her happiness is short-lived. Slaves catchers are tipped off to the fact that Sethe is living with Baby Suggs. They come to the house to arrest Sethe, in a attempt to drag all of them back into the horrors of slavery. Sethe, desperate to prevent her children from reliving her own past, murders her older daughter by slitting her throat with a saw. She subsequently knocks her sons unconscious and nearly kills Denver by swinging her through the air by her ankles. (Stamp Paid manages to catch the baby before her head strikes the ground.) Paul D., horrified by the revelation and suddenly understanding the origin of the poltergeist, confronts Sethe. Sethe unapologetically justifies her actions saying that the baby was better off dead than enslaved. Paul D. departs shortly thereafter, something that doesn't upset Sethe or the other women all that much. After Paul D. leaves, Sethe, while sitting in front of a warm fireplace with Denver and Beloved, hears Beloved hum a familiar melody. She recognizes the song, as it is one she sang only to her children. Beloved tells her she has always known the song. At this point, Sethe realizes that Beloved is the re-incarnation of her dead daughter. Feeling a mix of elation and guilt, Sethe spends all her money on elaborate gifts for her daughters. After all the money is spent, however, Beloved demands more gifts, having increasingly destructive tantrums when she realizes that they will no longer be forthcoming. Several months later, Beloved's malevolent presence causes living conditions in the house to deteriorate. The women live in complete squalor. Sethe has had a complete nervous breakdown, losing her job in the process. Consequently, there is little food to eat. Beloved, who has taken to walking around nude, is noticeably pregnant from her encounter with Paul D. Denver even more ashamed than she had been before almost completely withdraws from Sethe and Beloved, who have shunned her completely. However, with the spiritual manifestation and inspiration of her grandmother, Baby Suggs, Denver summons the strength to leave the house at last and seek employment, in order to save her mother and to somehow calm Beloved. She seeks out her previous mentor, Lady Jones, whose school she left when a young boy questioned Denver about her mother's violent act. Although Lady Jones is unable to pay her for any domestic duties, she sees Denver off with a basket of food. When she later tells everyone at church of Sethe's predicament, baskets and plates of food begin appearing at 124. Denver also decides to travel to the Bodwins home, which belongs to the white related pair of abolitionists who gave Baby Suggs 124 to live in, and also saved Sethe from being hung due to her crime. She appeals to Janey Wagon, who remembers Baby Suggs and takes pity on Denver, offering her a night shift that would allow her to take care of her mother during the daytime. Although Denver does not mention that Beloved is the main source of her mother's dilemma, Janey's suspicions are further heightened by Denver's odd behavior, and she discusses the problem with the local churchladies. After realizing that Beloved is Sethe's murdered daughter, they decide on a plan of action. While some believe Sethe had it coming to her, Ella, the one woman who helped bring Sethe to 124 along with Stamp Paid and witnessed Sethe's murder of her children along with him, disagrees. Although Sethe's crime alienated her along with the other churchladies, she believes something from such a terrible past cannot be allowed to interfere with the future, nor does it have the right to destroy its own mother. With this in mind, they march to 124, in hopes of exorcising the \"demon\" from Sethe's home. Meanwhile, Denver sits quietly at 124, waiting for Mr. Bodwin to pick her up for her new job. Inside, Sethe chips away frantically at a block of ice, her mind further deteriorating as Beloved continues to dominate the household. When Denver informs her that she is leaving, Sethe hears nothing and continues to chip away at the ice. When Denver goes and sits down on the porch outside again, she notices a large group of women slowly approaching 124. When Ella and the churchladies arrive at 124, they survey the home from outside its gate, as if determining what exactly lies within it. Suddenly, they begin to wail, sing hymns, and utter prayers out loud, hoping to bring the house some sort of peace. Inside, Sethe and Beloved hear the churchladies and after staring out of the window, Sethe begins to exit the house, but not before placing the ice pick into the sleeve of her dress. She grabs Beloved, who is dragging an old quilt along with her, and opens the door. Upon seeing Beloved's round belly, thick and unkempt hair, and shining, smiling face, they begin to pray and wail increasingly. As they continue to do so, it seems to have somewhat of a positive effect on Sethe, as she begins to slowly come back to reality. However, Mr. Bodwin arrives for Denver just as this is all occurring. Although, he is confused by everthing, he cannot tear his eyes away from Beloved's eccentric form. But as Sethe's eyes lock on Mr. Bodwin, it causes an opposite reaction. Instead of seeing Mr. Bodwin, who she already doesn't know, she notices his white attire, hat, and mustache, and instantly recollects Schoolteacher, the main source of her traumatic life and the horrifying events that followed. Without warning, she grabs the concealed ice pick and sprints towards \"Schoolteacher,\" attempting to kill him. As Sethe runs towards the women and Mr. Bodwin, Beloved begins to scream loudly, as she remembers how her mother \"left\" her before and believes she is trying to do so again. Denver races after Sethe, trying to stop her from killing Mr. Bodwin. The churchladies, believing Sethe has snapped and is trying to attack them, swarm around Sethe and hold her down, in order to pray and calm her spirit. Mr. Bodwin, oblivious to everything but Beloved, continues to stare at her. Beloved's screaming rises to a fever pitch and in some way succumbing to the \"loss\" of her mother yet again, she disappears. As the churchladies hold on to and pray over Sethe, Denver rises and looks towards the porch. She sees nothing but an old quilt lying in front of an open door. Some months later, Paul D bumps into Denver at the marketplace. He notices that she has made quite a transformation: she speaks with confidence, maturity, and sincerity, and when Paul D offers her his opinion, she refuses it, stating that she \"has her own.\" She tells him she has continued to work for the Bodwins and under the tutelage of Ms. Bodwin, may become a student at Oberlin College. When Paul D asks about Sethe, Denver expresses her worry over her mother, as she hasn't left her room or bed since the day Beloved \"left.\" She soon departs, but she tells him that he can visit her mother, but to be careful of how he speaks to her. Later at 124, Paul D arrives to find Sethe lying in her room. She is clearly suffering from a deep malaise, caused by Beloved's departure. Paul D assures Sethe that he will now take care of her, along with Denver. Sethe doesn't see the point, as Beloved is gone and she was her \"best thing.\" Paul D disagrees, telling Sethe that she, in fact, is her own best thing.",
      "writers": [
         "Toni Morrison",
         "Akosua Busia"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120603/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjUyOTEzMzI5MV5BMl5BanBnXkFtZTcwNTY0MzQyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Oprah Winfrey, Danny Glover, Yada Beener | See full cast and crew »"],
      "reviews": [
         "Beloved is one of the best movies of the last decade. I have read many, many reviews which seem to have been written by those who have little to no idea of just how complex and difficult Toni Morrison's original novel can be. Of course Beloved (the movie) will be long, and of course it will be emotionally draining and even confusing - the book was! That said, I loved the novel and the film version of it, which follows the original material almost verbatim. (To try and change the story would be to tamper needlessly with a Pulitzer and Nobel Prize-winning book). I am no Oprah nut but she obviously had a deep respect and understanding for the story, which is evident in her surprisingly understated acting. Thandie Newton was simply amazing; I am glad I watched the film if for nothing else than the chance to see her performance (which, to be honest, has helped a key facet of the book make sense for me). The production design is flawless, and, as always, Jonathan Demme proves he's more than above average as a director. If you like pulp trash and want your movies dumb, loud, and shallow, avoid the movie version of Beloved. But if you're looking for a magnificently acted and gorgeously produced film, see this movie the first chance you get. I'm very glad I did.",
         "I read Beloved in an intro English course and it took me a long while to get used to Toni Morrison's writing style. She once said in an interview that she wrote the book to be disorienting, in some ways to re-enact the feeling of the slave diaspora. I thought the book heart-wrenching, at times gut-wrenching, and vivid. The character of Paul D never made much sense, seeming like a man waiting for something to happen, but Sethe burned off the page. What I remember most is Baby Suggs' speech at the rock, which the film has divided into three segments. I projected Beloved for the college theater and I have to say it was long and arduous, especially if you haven't read the novel. There is no SENSE to the PAIN that goes on with these characters; in Braveheart and Titanic, we have a certain tragic pleasure in mass death or torture that we can't receive from Beloved. I read a lot of comments talking about the ghost in Beloved, but the ghost is more of a catalyst for looking into the characters than the star of the film. I admired the time put in most. It just seemed like Demme and Tak Fujimoto, and the lighting designer as well, gave the actors the time they needed to act and sink into things: unlike traditional MTV-editing, some scenes were comprised of only one shot, usually tracking, as Paul D and Sethe in the cornfield. The score was brilliant; Portman really found a grace in stillness and the trembling African voice and the flute. It was bare but riveting at the same time. People have said that the film went for too much shock value. That's possible- did we need the close-up of the dead child at the breast? No. But then again when we read it in the book, don't we think of it? Don't we for a split second see that image in our heads? I for one thought of much more graphic things when Morrison discussed Paul D and Beloved's night in the shed. The camera and the actors treat the world of Beloved and the audience with respect. Winfrey does seem more like someone who loves Sethe's character, than Sethe herself, but she did it for me. The sadness, the strength, emptiness, she did it, and Lisa Gay Hamilton as the young Sethe was riveting with her time in the film. The look in her eyes when Schoolteacher says \"Animal\" is amazing. Danny Glover always does a good job, but he didn't really amaze me. For me, you know what you're getting with Glover, nice guy, troubled soul, easy-going with fits of rage every now and then. It's what he likes to play, and he does it well here but no surprises. The surprises are Winfrey, and Kimberly Elise especially in those crucial minutes when she decides to leave home, the fear and determination on her face. (She somehow becomes more sexual by the end of the film when she sees Paul D.) Thandie Newton is incredibly freaky and disgusting as Beloved with the exception of that ONE long gaze she gives Danny Glover that night, seduction, perfect symmetry. And Beah Richards as Baby Suggs: I wanted her to be my mother. She broke my heart with her religion: \"This is the prize. This is the prize.\" The preaching scenes are INCREDIBLE in this film, especially since Tak Fujimoto chooses a circular tracking shot that allows them to do it all at once. There isn't much redemption at the end. Sethe is drained and miserable. Paul D is on his own but still not totally free. I think Roger Ebert's comment put it best: the happy ending of Beloved is that the ordeal is OVER. There is no sense to the pain, but one hopes at the end that there can be healing. I loved this film. I loved the fact that it's not hammering any one message home, but you can take things about motherhood, race, brutality, the dangers of love and commitment, freedom, and chains out with you: it's all there. And it is as beautiful as it is wrenching.",
         "I fail to realize why people are giving the movie bad reviews. I think people were expecting another Color Purple. Well I think a damn good movie was made and the people who didn't like it just didn't understand. The movie is not hard to understand. Oprah was a slave who had gained freedom; then one day the people tried to take her kids away to slavery. Oprah didn't want that so she attempt to kill them. One thing that really set the plot to the movie is one died and came back as a ghost. Many people are also talking bad about Thandie's part, but she was a ghost who was 2 years old in the body of a 20yr old. She came back and only wanted her mother. Beloved set a spell on Paul D because she wanted to be close to her mother like he was. What is so hard to understand about the movie I don't get. I think everyone is so used to the same type movies. When something different and better come along their brains lock up. The only thing I can suggest \"GO BUY THE BOOK\", it only cost $15.00. Now that I've explained the movie some go see it again.",
         "I've read through through some of these reviews, and I'm sorry, but I have to disagree with quite a lot of them. I think the film is amazing, intelligent and emotive, and does justice to Toni Morrison's incredible novel (one of the best I have ever read). However, I can understand why some people are confused; I think the film is easier to grasp if you read the book. To clarify some of the confusion: * Sethe (Oprah) intends to kill her children before taking her own life, to protect them all from the suffering that awaits them at Sweet Home (the plantation). However, she only succeeds in killing her baby daughter, Beloved, before she is caught. * Sethe is imprisoned for killing her daughter, but is later released due to the efforts of abolitionists (including Baby Sugg's landlord). * Beloved dies as a young infant, and, despite the fact that she returns in the body of a young woman- the age she would have been, had she lived- she retains the emotional and social maturity of a baby (hence the freaky baby- wailing noises that Thandie Newton makes). * The scene where Oprah's character, Sethe, urinates, actually denotes that her waters are breaking again, before the second 'arrival' of her daughter (this happens when the family meet Beloved at the house) * Beloved seems to be both the 'reincarnation' of Sethe's dead daughter, and an embodiment of every African who suffered or died during slavery (particularly those slaves who died before their stories could be passed on). I apologise for the 'geekiness' of my semi- in-depth analysis- I studied the novel as part of my degree, and loved this adaptation. I think the actors are all amazing, and the film is definitely worth watching- especially if you are willing to read the book x.",
         "I found it difficult to understand the movie, and some of the dialogue, but it mattered little. I wish I'd read the book--perhaps I will, but I don't think so. A film must stand by itself, or it is not a film. \"Beloved\" has long passages of greatness. First, it contains one of the best and most fascinating performances I've seen in years, given by Thandie Newton. She spent most of \"Gridlock'd\" in a coma, unfortunately, and that's the most notable role she's had until this one. Her first speaking (if you'll call it that) line is gripping, frightening, and amusing, and she plays a mental defective in a manner which I've never seen before. She has the loudest, rudest character, and many actresses would be put off by some of the things she must do throughout the film. However, our attention is also held by her quiet moments, as well as a few shots where the camera is content to gaze tranquilly into her beautiful eyes. That camera is conducted with the supreme artistry of one of my favorite photographers, Tak Fujimoto, who was with director Jonathan Demme since the late '70s. Fujimoto is in love with earth and flesh tones here, but he also shoots his actors' eyes as if they were a part of the human body we'd never really noticed before, and wanted to give them the attention they deserved. It's a great approach to cinematography that pays off an infinite number of times, from the first major shot, of Sethe and Paul D reuniting (as Winfrey and Glover look at each other, they look not just into the camera, but directly into OUR eyes), to the last major shot, Jason Robards (God love him) staring in horror at a most unusual scene in front of Sethe's home. This film is no \"The Color Purple\", with Welles-influenced camera angles and sacchirine-induced uplift. \"Beloved\" is a long, difficult, often off-putting film which doesn't really provide the big payoff at the end. This isn't necessarily good, but it isn't necessarily bad, either. Highlighted sequences include two truly remarkable sermons in the woods by Baby Suggs (Beah Richards--Oscar-nominated in '68 for \"Guess Who's Coming to Dinner?\"), a horrifying opening which features the most gruesome use of animatronics to date, and the notorious flashback which explain what has haunted Sethe all these years, and who Beloved really is. I compare this film with \"The Thin Red Line\". Both come from notable directors, are based on famous novels, used huge budgets, and were very long. Both films disappointed many, many people. Most importantly, however, they both had parts which were greater than the whole, occasional strokes of genius, and were made by men who took the art of filmmaking seriously.",
         "Beloved the movie seeks to rival Beloved the novel in telling the African-American story. While it could not attempt to capture all of the richness of Morrison's great novel, it does do what it can in the constraints of a feature movie. The performances are phenomenal, and any Oscar nominations will be well deserved. The Ohio/Kentucky background takes one's breath away and the movie really does grip its viewer during key scenes However, Morrison's non-linear style did not translate as well on the big screen and the flashbacks are truly confusing at points. Moreover, the movie has about three natural climaxes which heighten the viewer's awareness of the length of the movie. All told, it is a good movie, but it is not a must-see movie, nor will it have the cultural impact Oprah intended. (As for no likeable white characters which some posts have charged, first Mr. Baldwin is a likeable white person. Second, in a post-slavery society of Ohio/Kentucky, why do there have to be any good whites in this narrow world? Oh yeah, don't be mad at Oprah for that--Morrison didn't include any in her book either)",
         "When I logged onto IMDb and came to the \"Beloved\" page (after finishing watching the film), I was extremely surprised at the average 5.4 user rating that this film had. 5.4, are you kidding me? I went in seeing this film without ever reading (or having any knowledge of) the award-winning novel that the film is apparently very tightly based upon. Even without that, this film was amazing. The movie begins with a woman named Sethe (Oprah Winfrey), a former slave living in 1800s Cincinatti, where an unseen presence is tearing apart her house, throwing things against the walls, and injuring her dog. Her two sons ultimately run away, terrified of the house, and her youngest daughter, Denver is forced to stay. Cut to eight years later, a friend of Sethe's, Paul D. (Danny Glover) reenters her life and moves in with Sethe. \"We got a ghost here\", Denver tells him, and Paul D. mentions feeling an evil presence in her house, but Sethe tells him it's \"only sadness\". Then later on, a mysterious young woman who calls herself \"Beloved\" is found standing in the front yard of the house. She can barely speak, can't move, and is almost like an infant in the body of a teenager. But who is she, where did she come from, and why is she there? Sethe's dark past holds the secret to Beloved's identity, which is revealed later on in the film. \"Beloved\" isn't a horror film, and I wasn't expecting one either. Granted, there are a few disturbing scenes (and a handful of rather scary moments), but this film is a drama more than anything and really focuses more on it's characters. The story itself is an interesting one at that, and after seeing this I'm tempted to go read the novel (which I hear the film is adapted to very closely). Everything in the film seems to be put together very nicely, and (unlike many people who claim to not be able to follow the story) I followed it very easily. There are some harsh themes that are a consistent part of the plot (mainly Sethe's horrible past as an abused slave) and there are some scenes that are truly hard to watch. While the supernatural element is a main theme in the movie, this isn't your average ghost story. It's not horrific or in-your-face, it's a much lighter and touching. I don't want to go too in-depth into the plot, because there are things that I could easily spoil and wouldn't want to - see the film for yourself. Character development is rampant in the film, and each of the characters mature in a different way throughout the course of the movie, and makes for some very interesting viewing as each of them grow in different ways. Performances are amazing from everyone involved. I'd never seen Oprah Winfrey act, I'd just seen her television talk-show a few times, but she proves in this film that she can (and very well too). Danny Glover also gives a very nice performance but it's overshadowed by the rest of the cast. Thandie Newton plays Beloved, and plays it perfectly - her character is mysterious and obscure, and she does it well. Kimberly Elise plays Sethe's daughter, Denver, and plays the character excellently. I can't say anything bad about the acting in any aspects - to sum it up as a whole, the acting here is just flat-out amazing. Along with the wonderful acting, the directing is great also. Academy Award winner Jonathan Demme (who also directed the award winning crime-suspense masterpiece \"The Silence of the Lambs\") handles the story well and keeps things consistently absorbing and ultimately haunting. Very nice cinematography is present too, and there are tons of symbolic images throughout the film that are placed nicely in the mix, along with a lot of shots of nature and wildlife. Overall, \"Beloved\" is an amazing movie, and the people who are rating this as a '1/10' must have not seen very many movies, because this film is so far from a '1' that it's not even funny. Don't let the average user rating scare you off from this film, because it really deserves much better than that. I guess this is one of those \"love it or hate it\" movies, but I thought it was an unforgettable movie. 10/10.",
         "I saw this amazing film at the theatre and was skeptical going in due to Oprah's campaigning for it so heavily but was blown away regardless--after watching it again I understand her pleas. This stunning story and its brilliant execution by an outstanding director, cast and crew was seen by far too few people. It should have swept the oscars and if I recall--was merely nominated for costume design the same year that literally no black actors, directors, or films were nominated in any of their categories. wow--a real eye opener on how little respect good art recieves even today--let alone artists of color. I'd like the opportunity to tell each and every member of the cast how astonished I was even hours later. A beautiful, rich, and generous film. An earnest thank you to everyone who helped get it made. Bravo and thank you!",
         "READ THE BOOK, PEOPLE, READ THE BOOK! The book helped me understand the film and the film helped me understand the book. This is an amazing piece of work. Winfrey gives a moving and observant performance and Thandie Newton is startling. Some scenes are intense, making you think whether you would kill your child. I didn't notice any gliches and I think the film screams for Oscars. I think this whole slave movie thing going on is getting boring but when they are made with such power and great directing and acting, I praise God for it! Demme gives us one of the most touching ghost stories and certainly the strangest, in a while.",
         "Famous feminist writer, Toni Morrison, deserved to win a Pulitzer Prize for her historical novel that represents Black American's struggles with slavery and freedom. How anyone, let alone hundreds of voters here, could rate this marvelously directed & performed film a 1 is beyond me. Oprah Winfrey is the leading lady of the cast who ultimately demonstrates what is an Oscar-entitled performance. Sethe, the character Winfrey plays is one of the most complex & challenging ones that I can imagine for any actor to take upon themselves. In fact, Winfrey stayed so true to her character, in my mind, she became Sethe: a former slave mother, a million & a half miles away from a Oprah the billionaire guest show host in Chicago! Danny Glover also gave a grand performance that was equally far from any other role I've seen him play. He & Winfrey together are a fine big screen match who I hope are in movies with Pulitzer prize winning plots as thick as is this one."
      ],
      "genres": [
         "Drama",
         "History",
         "Horror"
      ],
      "productionCompanies": [
         "Harpo Films",
         "Clinica Estetico",
         "Touchstone Pictures"
      ],
      "summaries": [
         "After Paul D. finds his old slave friend Sethe in Ohio and moves in with her and her daughter Denver, a strange girl comes along by the name of \"Beloved\". Sethe and Denver take her in and then strange things start to happen...",
         "Slavery, brief freedom, and their lasting psychological presence. Some years after the Civil War, former slave Sethe lives with her grown daughter Denver outside Cincinnati. Sethe is stolid and hard working; Denver wants society. Paul D, a former slave who knew Sethe, happens on them and joins the farm and family, but not before the house rattles and pitches, as if spirits reject Paul D's coming. Next, inexplicably, a young woman about Denver's age arrives, behaving in childlike ways, speaking and walking awkwardly, calling herself \"Beloved.\" Who she is, her effect on Sethe, and Paul D's responses propel Sethe into the past and Denver into a new maturity.",
         "Based on the book by Toni Morrison, in which a slave is visited by the spirit of her deceased daughter."
      ],
      "budget": 53000000
   },
   "movielensId": 2314,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-16",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Jonathan Demme"],
      "runtime": 172,
      "movieId": 2314,
      "title": "Beloved",
      "mpaa": "R",
      "actors": [
         "Oprah Winfrey",
         "Danny Glover",
         "Thandie Newton",
         "Lisa Gay Hamilton",
         "Albert Hall",
         "Irma P. Hall",
         "Kimberly Elise",
         "Beah Richards",
         "Vertamae Grosvenor",
         "Dorothy Love Coates"
      ],
      "imdbMovieId": "0120603",
      "originalTitle": "Beloved",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["WNz7mV8ob2Q"],
      "plotSummary": "After Paul D. finds his old slave friend Sethe in Ohio and moves in with her and her daughter Denver, a strange girl comes along by the name of \"Beloved\". Sethe and Denver take her in and then strange things start to happen...",
      "tmdbMovieId": 39437,
      "avgRating": 2.89653,
      "releaseYear": "1998",
      "numRatings": 720,
      "posterPath": "/jwzOg5RBIF2ZkF67BnYibSPp4P8.jpg"
   }
}