{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119986",
      "video": false,
      "title": "Reach The Rock",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Quinn",
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a0113",
               "name": "William Sadler",
               "profile_path": "/nnr5u5lTL9cScrMSKV5MwslgSnn.jpg",
               "id": 6573,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Robin",
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a0117",
               "name": "Alessandro Nivola",
               "profile_path": "/lLlaotVNM6dhjXj7GWVLSedugct.jpg",
               "id": 4941,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ernie",
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a011b",
               "name": "Bruce Norris",
               "profile_path": "/c5O2Iicvw9fMfLUe7XtljJUWFVB.jpg",
               "id": 11621,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Donna",
               "gender": 1,
               "credit_id": "52fe46b8c3a368484e0a011f",
               "name": "Karen Sillas",
               "profile_path": "/kjvCblLqywvFknAxmQgHAtKabPx.jpg",
               "id": 135162,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lise",
               "gender": 1,
               "credit_id": "52fe46b8c3a368484e0a0123",
               "name": "Brooke Langton",
               "profile_path": "/u44XljgfkA6KBmJlEPyquR6bmL.jpg",
               "id": 35980,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ed",
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a0127",
               "name": "Richard Hamilton",
               "profile_path": "/2LkJGXKvRo7tmu6jUhIJ6G4jmXI.jpg",
               "id": 9633,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Danny",
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a012b",
               "name": "Norman Reedus",
               "profile_path": "/dtnLzCWTVOE57ELwDwp4hmIXxrW.jpg",
               "id": 4886,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a0109",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46b8c3a368484e0a010f",
               "name": "William Ryan",
               "profile_path": null,
               "id": 65482,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "561fbc1dc3a3680e0e003b60",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "561fbc3692514171cd003ada",
               "name": "Ricardo Mestres",
               "profile_path": null,
               "id": 58015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "561fbc4ec3a3680e20003c38",
               "name": "John McEntire",
               "profile_path": null,
               "id": 1522812,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "561fbc6492514171c500395d",
               "name": "John J. Campbell",
               "profile_path": null,
               "id": 5227,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "561fbc7a92514171c70038dd",
               "name": "Gerald B. Greenberg",
               "profile_path": null,
               "id": 852,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561fbc8bc3a3680e1600357f",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561fbc9ec3a3680e0e003b8c",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561fbcaf92514171c70038ee",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561fbcd592514171cd003af4",
               "name": "Jeffrey Townsend",
               "profile_path": null,
               "id": 12927,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "561fbce7c3a3680e24003d18",
               "name": "Caty Maxey",
               "profile_path": null,
               "id": 137175,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "561fbcfac3a3680e19003916",
               "name": "Joe Bristol",
               "profile_path": null,
               "id": 1522813,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "561fbd0c92514171d6003741",
               "name": "Ellen Ryba",
               "profile_path": null,
               "id": 18133,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "561fbd2892514171d6003750",
               "name": "Lexa Van Doren",
               "profile_path": null,
               "id": 1522814,
               "department": "Art",
               "job": "Art Department Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "561fbd44c3a3680e1900392c",
               "name": "Miriam Hoffman-Durand",
               "profile_path": null,
               "id": 1522815,
               "department": "Costume & Make-Up",
               "job": "Costume Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "561fbd59c3a3680e19003936",
               "name": "Rosalie Piazza",
               "profile_path": null,
               "id": 1522816,
               "department": "Costume & Make-Up",
               "job": "Set Costumer"
            },
            {
               "gender": 0,
               "credit_id": "561fbd70c3a3680e0e003bca",
               "name": "Alicia Accardo",
               "profile_path": null,
               "id": 1386923,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.01258,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63709,
      "vote_count": 4,
      "budget": 0,
      "overview": "A small town troublemaker (Alessandro Nivola), directionless and alienated, ends up spending a night in a jail cell, where he and the police chief (William Sadler) engage in a battle of wills and wit.",
      "similar": [],
      "original_title": "Reach The Rock",
      "runtime": 100,
      "poster_path": "/dkFUMRe0lLDgq998BebwrRtggKZ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nlG4JEjJ7SAFDehgIVvHFBPW23y.png",
         "name": "Gramercy Pictures",
         "id": 37,
         "origin_country": "US"
      }],
      "release_date": "1998-10-16",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bill Ryan"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["John Hughes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119986/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5NDE5NDEzN15BMl5BanBnXkFtZTcwNTY2NzUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: William Sadler, Alessandro Nivola, Bruce Norris | See full cast and crew »"],
      "reviews": [
         "This movie proves that you don't need a high dollar cast and/or special effects, violence or sex to make a good film. This had none of those things, yet it held my attention by the actors' performances and the silence that was there, between the lines, so to speak. The attention to detail in minor points was also evident. After watching this film, I think I should look at other films produced by this team of dream makers. At one point, I commented to my viewing companion that this movie had the feel of an older David Lynch production right down to the music, i.e. Blue Velvet and Twin Peaks. Thank you Mr. Hughes for such a delightful movie.",
         "I was channel hoping when I caught the start of this film but it was one of those gems that really had me hooked. Everything was superb, from the performances, script, editing etc. It lets you into the lives of the people concerned in a most enlightening, thought provoking way. I believe the true measure of a film is how it leaves you and how it remains with you. Again this is a gem, catch it if you can.",
         "While 2/3 of the IMDb reviewers cast a very satisfactory and satisfied vote between 7 and 10, most professional critics unmercifully panned the movie\u0085 you cannot help wondering if we saw the same film\u0085 Unfortunately, the film had already several disadvantages: a somewhat cryptic title which failed to attract attention, no stars, no backing from the distributor; so, if you look at the gross turnover in movie-halls, the result is a sheer catastrophe\u0085. It is a pity, as the film is highly enjoyable - though unusual in many respects: it combines extremely funny scenes with very serious ones; there are practically two settings only: the street at night and the jail; and the cast is limited to seven players: two cameos (wizened Richard Hamilton, and intriguing Norman Reedus as the drowned man), two supporting ones (lovely Karen Sillas and seldom-seen Bruce Norris as the pair looking unsuccessfully for privacy); and three main roles : reliable William Sadler, excellent as the police sergeant; bland-faced promising Alessandro Nivola as the hero, and strikingly beautiful (and good actress) Brooke Langton, climaxing the film. Like many others, I came across the film on TV by chance, \u0096 but probably in a shortened version: I witnessed Nivola setting up an intricate booby-trap with a paint-tin and the town-clock\u0085 but nothing came out of it. Missed a good laugh, for sure\u0085.",
         "You can probably use the old Woody Allen line, \"I like your earlier, funny ones\" in describing the ENTIRE career of writer/director John Hughes. The list rattles off like 80's Night on TBS: from \"National Lampoon's Vacation\" and \"Sixteen Candles\" to \"Pretty In Pink\" and \"Planes, Trains & Automobiles\". Hughes was a filmmaker who literally caught lightning in a bottle - a former advertising copywriter who had the marrow of moviegoers' funnybones and could write smart dialogue and smart situations like nobody else at that time. Hughes literally cranked out some of the most hilarious, most loved films of the 1980's, ones that will stand the test of time. Over time, Hughes also seemingly asked himself that, in the movie biz, why improve on a good thing when you can just repeat it. His canon of work ALSO includes \"Some Kind Of Wonderful\" (a hollow sex-reverse of \"Pretty In Pink\"), \"Career Opportunities\", \"Home Alone 2\" (awful), \"Curly Sue\" (incredibly awful), \"Baby's Day Out\", \"Dutch\" (a \"Planes, Trains...\" ripoff) and others. By finally, completely tarnishing his former luster by cranking the same few movies out, he cruised into a lazy write-o-bot/photocopier mode by catering to snot-nose \"Home Alone\" kids instead of speaking to his fan base that followed him from the promise of his articles in National Lampoon Magazine through to smaller pix like \"Nate & Hayes\", \"National Lampoon's Class Reunion\" and the hit \"Mr. Mom\", into his 'teenage' phase, and then onto more adult-themed projects like \"She's Having A Baby\". Let me put this as forwardly as possible: I like John Hughes' work. He fueled some of the happiest movie-going experiences in the 80's, and even after burning audiences with (very) lesser efforts, his former glories made makes us look forward to the next \"A John Hughes Production\" title credit. And then he dropped off the face of the earth. Secretly, under various pseudonyms, he cranked out scripts for low class fare as \"Beethoven\" and more recently \"Maid In Manhattan\", and was frequently subjected to the scourge of being rewritten by others. So, it was with great trepidation but certainly a great bit of interest that I recently took in the 1998 (basically) direct-to-video feature, \"Reach The Rock\". The film is another John Hughes-penned-but-not-directed youth tale, occurring over the course of just one hot summer night in Hughes's fictional \"hometown\" of Shermerville, Illinois. It's the simple, straight-forward story of a young \"punk\" (Alessandro Nivola - later of \"Jurassic Park 3\") with nothing much to do and not a lot going for him. When he crosses paths with town top cop William Sadler (\"Die Hard 2\"), the showdown is set for a quiet, chatty battle of wills between two very headstrong characters. The film takes a very leisurely approach in the showdown between these two characters - the lion's share of the plotted dialogue slowly unfolds between each in the town's jailhouse, and the two cross wits, barbs and truths over the course of the film's running time. Sound familiar? That's right: Hughes is at it again, repeating former glories, going back to the same well. He has taken the showdown/confessional/plot points between Judd Nelson and Paul Gleason from Hughes' touchstone, \"The Breakfast Club\" and expanded that conflict into this picture. But guess what? It works! Perhaps the passing of time (say, 13 years) has allowed the prolific writer an opportunity to revisit that dogeared script and \"stretch\" well under the radar of film criticism (this Universal-backed film never received anything approaching a limited release by its distributor). The film is SLOOOOOOOOW, but director William Ryan makes the timing work in the picture's favour. Over the course of one night, lives are changed, people are changed and attitudes are changed. And there's a LOT of talk. It's like a play - a showdown between the (conveniently) whip-smart kid and the cop who isn't the clichéd hardass. The action on-screen is cerebral, and Hughes' writing is crisp and assured. Taking place over the course of the middle of the night, the movie has a great sense of time and small-town place. A subplot involving chief Sadler's horny deputy is prefunctory, and serves as a sluggish diversion to the main attraction. \"Reach The Rock\" is absolutely nothing special for the casual viewer without a modicum of patience, but for fans of the same John Hughes that wrote some of the smartest, funniest and most thoughtful pictures of 80's, we extend a warm \"welcome back\".",
         "After having watched \"Two for the money\" and talked about Pacino and inspiration, I can't help but thinking how important something inspiring is in the film industry. Mostly in Hollywood, where inspiring films are locked in a shelf and only come out if the right people allows it and so on. There's still people who wants to leave a message to the viewer; people who has something to say. A few years ago, a man named William Ryan directed his first and only film to date, called \"Reach the rock\". The opening shots of the movie and the movement of the camera let us know that we're going to see something common in detail; something simple but with a lot of meaning. \"Reach the rock\" can be a forgettable film if you don't pay close attention. Ryan cares for his simple environment, and he cares for the meaning and the message. If you take a look at Ryan's producing credits, you'll see \"Miracle on 34th Street\" (one of my favorite films), a picture with message and meaning, listed. You are allowed to think that I'm talking a bunch of nonsense here, but I've got to make a stand for a movie like \"Reach the rock\"; a sensible, heartfelt tale that went completely unnoticeable when it came out. At first I wanted to see this film because Alessandro Nivola was in it. Nivola, a talented but still not recognized performer (stole the show in the blockbuster \"Goal!\" and brought grace alongside Amy Adams to \"Junebug\"), stars as Robin, the most rebellious kid of a small town which is no longer a kid but still does the mischief a teenager does when he wants to get attention. Quinn (William Sadler), the town chief of police, blames him for the death of his nephew Danny, a friend of Robin who wanted more than the life expectations of a little town. \"No one cares about you no more, Robin\", Quinn tells him as he puts him in a cell. Robin picks the phone and calls a girl, asking her to pick him up. This is Lise (Brooke Langton), the daughter of the most important man in town and once Robin's girlfriend. He loves her and she loves him too, but she went to the University and he never finished high school and still doesn't know what to do with his life. And what's the problem with that? Some people just don't know. But he is clever, probably more than Quinn because he destroys various stores of the town and steals a police car in the same night as he is in jail without anyone being able to blame him. Lise goes to visit Robin and denigrates him morally. However, she still wants to do things with him but he is no fool. Meanwhile, Quinn looks at the pictures of his nephew's death. Robin remembers he was with Danny and he wanted to reach the rock; a big rock in the river that represented more than the small town life. During that night, lots of revelations see the light of day and the viewer finds himself surprised more and more as the time passes. The screenplay by John Hughes is perfect, because there's a charm in the simplicity of the tale accompanied by Ryan's direction. There's a perfect mix of the drama and the comedy; there's a silence in the images that we get to hear because of the little number of actors and their more than good performances. \"Reach the rock\" had a lot more to say\u0085A lot of movies these days have; it's just that nobody sees it.",
         "I got this movie, primarily to see how it's soundtrack (which is great) related to the storyline. I was shocked to see how good the movie was! The movie is whitty, and kept my interest for the entire duration of the movie. Even my wife, who frequently dislikes indie films, enjoyed the movie. Rent it!",
         "This movie more than any other of the \"this should be brought to DVD\" category seems to be the one I keep checking on over the years hoping to find it has made it to DVD at last. I liked that it had so few actors yet told the story perfectly. Remember this was written by John Hughs, and he has some pretty great successes to his name (which is why I first chose to watch it when it came out on VHS). It tells the story of a mischievous teen who plays tricks on the police, just like we did when I was a kid growing up in a small town. Only on a grander scale than we ever did. I have no idea if generally people would like this movie, most have never gotten a chance since this went to VHS without hardly a whisper at the box office and no DVD. Perhaps I only like it because it seems to familiar to my brothers and I as teenagers.",
         "The beginning recalls Nicholas Ray's \"rebel without a cause\"(1955) .What follows is very static and is not unlike a filmed stage production:with its hints at the past and its somewhat tortured characters ,it reminds me of very lite Tennessee Williams or Arthur Miller.Never really funny ,and never really absorbing,in spite of good actors.The brunette character is eminently questionable :it's not the return of Natalie Wood in the movie I mention above.It seems that after a bout of rebellion against daddy ,she returned to his-father-who-owns-the -whole-town apparently without tears. Does not reach anything.",
         "I just happened to catch this delightful film on cable. At first I had difficulty deciding if this was a comedy or drama. Then I realized it, in fact, was a comedy/drama. I have been a fan of Nivola's for some time and was delighted to see him in this film. Seems as though his \"look\" changes with each character he plays. I last saw him in \"Junebug.\" The other actors in the film handled their characters very well although the Ernie character could have easily come off as \"Barney Pfife\" but Norris was able to hold back and make it somewhat believable. The title is rather misleading as the \"rock\" is only shown briefly and appears to be in the middle of a lake; as if swimming there would be going nowhere. All in all it kept my attention and was a very good film. In an earlier review the booby trap with the paint-tin and town clock was mentioned as not being seen. For some reason that scene ran AFTER the credits. Sort of confusing. I thought it was that last crash we heard but did not see later on in the film. Or, was the booby trap set off after Robin left the jail? i.e., after the credits. Can anyone clarify?",
         "I thought this movie was fantastic. Edgy and full of young fun I was really drawn in a recommend it for a laugh,a touch of drama and sexy Alessandro Nivola! For those wondering what happened in the clock scene watch till the very end credits-there's a sneaky ending to it all! Although the movie title is a little bland, there are some truly awesome actors in it that create a movie with attitude. I find the plot really hard to forget now as often I found myself amazed at how thought out this movie was. I watched in on TV and I'm glad I did, its the sort of movie you can snuggle up with your boyfriend/girlfriends or your best girl mates who don't mind a bit of Alessandro showing of those toned arms... Loved it, and it appeals to all."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Gramercy Pictures (I)"],
      "summaries": ["Two school kids who are best friends are drinking on the side of a river. One friend bets the other that he can't swim across the river and \"Reach The Rock\". The friend takes the bet and drowns halfway towards the rock. The entire town blames the the kid for his friends death, he runs away never to be seen again. He eventually comes back to his home town of Shermerville and goes crazy, and starts to trash the town (i.e. breaking store-front windows, stealing a police car). He also meets up with his old high school girlfriend. The majority of the movie takes place in one night."],
      "budget": 0
   },
   "movielensId": 2319,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-16",
      "dvdReleaseDate": null,
      "directors": ["William Ryan"],
      "runtime": 100,
      "movieId": 2319,
      "title": "Reach The Rock",
      "mpaa": "R",
      "actors": [
         "William Sadler",
         "Alessandro Nivola",
         "Bruce Norris",
         "Karen Sillas",
         "Brooke Langton",
         "Richard Hamilton",
         "Norman Reedus"
      ],
      "imdbMovieId": "0119986",
      "originalTitle": "Reach The Rock",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A small town troublemaker (Alessandro Nivola), directionless and alienated, ends up spending a night in a jail cell, where he and the police chief (William Sadler) engage in a battle of wills and wit.",
      "tmdbMovieId": 63709,
      "avgRating": 2.88,
      "releaseYear": "1998",
      "numRatings": 25,
      "posterPath": "/dkFUMRe0lLDgq998BebwrRtggKZ.jpg"
   }
}