{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "cooking",
            "id": 1918
         },
         {
            "name": "sense of life",
            "id": 2875
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "dating",
            "id": 13043
         },
         {
            "name": "family",
            "id": 18035
         }
      ],
      "imdb_id": "tt0111797",
      "video": false,
      "title": "Eat Drink Man Woman",
      "recommendations": [
         9261,
         12276,
         88811,
         185987,
         11300,
         68837,
         14268,
         88752,
         38143,
         32636,
         222463,
         176651,
         168814,
         283711,
         10311,
         8943,
         262650,
         72489,
         125829,
         121036
      ],
      "backdrop_path": "/oePS9g69yQUFPmrsnCWS3pYVCdA.jpg",
      "revenue": 7294403,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Chu",
               "gender": 0,
               "credit_id": "52fe43749251416c75010f03",
               "name": "Sihung Lung",
               "profile_path": "/aBb0V4IUGhu477uMS2dSONC4fHW.jpg",
               "id": 1623,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jia-Ning",
               "gender": 0,
               "credit_id": "52fe43749251416c75010f07",
               "name": "Yu-Wen Wang",
               "profile_path": null,
               "id": 65352,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jia-Chien",
               "gender": 0,
               "credit_id": "52fe43749251416c75010f0b",
               "name": "Jacklyn Wu ",
               "profile_path": "/sla7Fr3Jjl13Jldm5UkJjzrhYR1.jpg",
               "id": 65353,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jia-Jen",
               "gender": 1,
               "credit_id": "52fe43749251416c75010f0f",
               "name": "Yang Kuei-Mei",
               "profile_path": "/kXjYrXTaqTm9aB1ss8AC6ZkO4qZ.jpg",
               "id": 65354,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Li Kai",
               "gender": 0,
               "credit_id": "5300007b9251416ae1175ce7",
               "name": "Winston Chao",
               "profile_path": "/tWJmyWO2lS7WHEN0MQQhijS9EUp.jpg",
               "id": 57054,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Jin-Rong",
               "gender": 1,
               "credit_id": "55d5f35792514102d8004cb0",
               "name": "Sylvia Chang",
               "profile_path": "/2gLgQxPqunlRMdEh57ZXhAjbVZi.jpg",
               "id": 26739,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Guo Lun",
               "gender": 2,
               "credit_id": "588b742dc3a3681019009530",
               "name": "Chen Chao-jung",
               "profile_path": "/mGLi3sl93Yg5j6pRmMLE9KUQehV.jpg",
               "id": 71172,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Raymond",
               "gender": 0,
               "credit_id": "59bba59dc3a3680f1e00be9e",
               "name": "Lester Chan",
               "profile_path": null,
               "id": 565145,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Rachel",
               "gender": 0,
               "credit_id": "59bba5a8925141325400c56a",
               "name": "Yu Chen",
               "profile_path": null,
               "id": 1416647,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Madame Liang",
               "gender": 1,
               "credit_id": "59bba5af925141325400c579",
               "name": "Kuei Ya-Lei",
               "profile_path": "/Js64NbhtH8KPdeUVebxFWFpefv.jpg",
               "id": 57057,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Class Leader",
               "gender": 0,
               "credit_id": "59bba5ba925141326700ca98",
               "name": "Chi-Der Hong",
               "profile_path": null,
               "id": 1888248,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Coach Chai",
               "gender": 0,
               "credit_id": "59bba5c7c3a3680ef000d0e9",
               "name": "Gin-Ming Hsu",
               "profile_path": null,
               "id": 1888249,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Sister Chang",
               "gender": 0,
               "credit_id": "59bba5d0c3a3680f1e00becb",
               "name": "Huel-Yi Lin",
               "profile_path": null,
               "id": 1888250,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Chief's Son",
               "gender": 0,
               "credit_id": "59bba5e7c3a3680ef000d10e",
               "name": "Shih-Jay Lin",
               "profile_path": null,
               "id": 1888251,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Ming-Dao",
               "gender": 0,
               "credit_id": "59bba5eec3a3680f5000c944",
               "name": "Chin-Cheng Lu",
               "profile_path": null,
               "id": 1888252,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75010f15",
               "name": "Ang Lee",
               "profile_path": "/uTX0uIBLl3JIQunuAMDRHLorffh.jpg",
               "id": 1614,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75010f1b",
               "name": "Ang Lee",
               "profile_path": "/uTX0uIBLl3JIQunuAMDRHLorffh.jpg",
               "id": 1614,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43749251416c75010f21",
               "name": "James Schamus",
               "profile_path": "/9E0gGd0rhOZyMnBAeIqFfCAPqzn.jpg",
               "id": 1617,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43749251416c75010f2d",
               "name": "Kong Hsu",
               "profile_path": null,
               "id": 65356,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75010f33",
               "name": "Li-Kong Hsu",
               "profile_path": null,
               "id": 65357,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43749251416c75010f39",
               "name": "Feng-Chyt Jiang",
               "profile_path": null,
               "id": 57052,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43749251416c75010f3f",
               "name": "Mader",
               "profile_path": null,
               "id": 57053,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75010f45",
               "name": "Jong Lin",
               "profile_path": null,
               "id": 6230,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43749251416c75010f4b",
               "name": "Tim Squyres",
               "profile_path": null,
               "id": 1635,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54565f55c3a368642e0001d7",
               "name": "Wang Hui-Ling",
               "profile_path": null,
               "id": 28642,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.557435,
      "production_countries": [
         {
            "iso_3166_1": "TW",
            "name": "Taiwan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10451,
      "vote_count": 85,
      "budget": 0,
      "overview": "The film tells the story of a retired and widowed Chinese master chef Chu (Si Hung Lung) and his family living in modern day Taipei, Taiwan. At the start of the film, he lives with his three attractive daughters, all of whom are unattached. As the film progresses, each of the daughters encounters new men in their lives. When these new relationships blossom, the stereotypes are broken and the living situation within the family changes.. The film features several scenes displaying the techniques and artistry of gourmet Chinese cooking. Since the family members have difficulty expressing their love for each other, the intricate preparation of banquet quality dishes for their Sunday dinners is the surrogate for their familial feelings.",
      "similar": [
         49519,
         8272,
         7972,
         8545,
         8390,
         19724,
         7345,
         8967,
         334,
         634,
         11631,
         73,
         88,
         587,
         693,
         225886,
         244772,
         93456,
         274167,
         329103
      ],
      "original_title": "飲食男女",
      "runtime": 123,
      "poster_path": "/jGjSu9zlR2I8t6OE54uxSJ7M25p.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Good Machine",
            "id": 10565,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ang Lee Productions",
            "id": 5528,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Central Motion Pictures",
            "id": 25345,
            "origin_country": ""
         }
      ],
      "release_date": "1994-08-03",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Taiwan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ang Lee"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Ang Lee",
         "James Schamus"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0111797/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5NTQxMjc5MV5BMl5BanBnXkFtZTcwMjYxODcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sihung Lung, Yu-Wen Wang, Chien-Lien Wu | See full cast and crew »"],
      "reviews": [
         "A veritable smorgasbord of all the things that make life worthwhile, including good friendship, love, food and sex, can be found in Ang Lee's `Eat, Drink, Man, Woman,' the story of a widower who has raised three daughters on his own, and now that they are grown is ready to move on with his life. Chu (Sihung Lung), a celebrated chef who runs the kitchen of a huge restaurant, finds himself at an impasse however; his daughters, Jia-Jen (Kuei-Mei Yang), the eldest, a teacher, Jia-Chen (Chien-lien Wu), his second, an airline executive, and Jia-Ning (Yu-Wen Wang), the youngest, who works at a fast food restaurant, all still live with their father, and though they are adults (all in their twenties), he feels responsible for them, as they are still under his roof. They, on the other hand, feel responsible for him; he'll soon be retired, and they fear age is catching up with him. And it makes them each, in turn, think twice about career opportunities and any romantic entanglements that may appear on the horizon. it's a situation they all realize is not conducive to a happy, fulfilling and fully functional family life; the love is there, but it's seasoned with frustration, and no one seems to know what to do about it. Lee has crafted and delivered a complex, involving film, laced with poignancy and humor that deals with the kinds of problems most people face during the course of their lives. And, of course, there's the love, the many faces of which are all explored here. Food is the metaphor; Chu sets his table with a variety of tantalizing and exotic offerings, even as the table of life is set with like fare, and once set, it is up to the individual to sample what they will. Fittingly, it is at the dinner table that many of the meaningful events in the lives of the family members are revealed. Working from a screenplay written by Lee, James Schamus and Hui-Ling Wang, Lee uses the intricate emotional weave of the story to optimum effect with his ability to illuminate the sensibilities of his characters, and that he does it so well demonstrates the depth of his own insight into human nature. And that he can so proficiently transfer the emotions of the written page to the screen demonstrates his mastery of the art of film directing. As he proves with this film (as with films like `The Ice Storm' and `Crouching Tiger, Hidden Dragon'), he is simply one of the best directors in the business. Lee's unique touch is also felt in the performances he exacts from his actors, a number of which are outstanding in this film, beginning with Lung, who brings Chu so credibly to life. Wang, Wu and Yang are also exemplary in their portrayals of Chu's daughters. To their credit-- as well as Lee's-- there's not a false moment to be found in their performances, all of which stand up to even the closest scrutiny. These are all very real people in a very real setting, which enables the audience to identify and relate to the characters and their story, assuring that connection which makes this film such a satisfying experience. The supporting cast includes Sylvia Chang (Jin-Rong), Winston Chao (Li Kai), Chao-jung Chen (Guo Lun), Lester Chit-Man Chan (Raymond), Yu Chen (Rachel), Jui Wang (Old Wen) and Ah Lei Gua (Madame Ling). As with real life, `Eat, Drink, Man, Woman' is far from predictable, and is filled with twists and turns, including a surprise at the end that equals anything M. Night Shyamalan could come up with. In the final analysis, this film is a delightful, entertaining reflection upon the human condition that will awaken your taste buds and prepare you for the feast of life. And, like life, it is there for the taking; grab it with both hands and embrace it. By the end, you'll be glad you did. I rate this one 10/10.",
         "Ang Lee has turned what might have been merely an extended Taiwanese soap opera into a wise and warm exploration of family relationships, love and friendship, against the backdrop of a traditional society adapting to the modern world. Fascinating in themselves, the food preparation sequences serve as a metaphor for the skill required to transform bare existence into a rich life (and perhaps also as a metaphor for film making, where similar care and deftness are required). The film focuses on the strained relations between master chef Chu (Sihung Lung) and his three unmarried daughters, and on the relationships of all four in love and at work. These relationships run the gamut from first love to love the second time around; from those based almost solely on sex to those based on none. (Some of the most touching scenes are those between Chu and his older colleague Wen (Jui Wang.)) Via the various workplaces Lee subtly shows us the changing face of Taiwanese society. Despite her father's profession, and seemingly with his approval, his youngest daughter works in a fast-food outlet; the eldest has converted to Christianity, and teaches science to boys, who treat her with a mixture of traditional deference and western-style insolence; the middle daughter is a successful airline executive, but only because time-honoured attitudes debarred her, as a woman, from following in her father's footsteps as a cook. Unlike the classic Hollywood film, there is little out-and-out conflict in this movie, which seems to be based more on the Chinese philosophical concept of Yin and Yang, mutually dependent opposites. But whatever its underlying cinematic rationale, it is a masterpiece.",
         "The well-traveled metaphor of food as communication is given a tender, appealing treatment in Ang Lee's finely observed film about a widower whose aging and loneliness have caused him to lose touch with his three grown daughters, each of whom is looking for love in modern-day Taiwan. The father (a gallant Sihung Lung) is a master chef who has begun to lose his sense of taste while attempting to come to grips with his daughters' increasing independence and the failing health of his best friend (Jui Wang); he begins to question the basis of existence, namely love and food. The daughters, meanwhile, feeling cramped by their father's distance, begin to explore notions of freedom from their cramped quarters. Lee is in a positive, sympathetic frame of mind here, articulately exploring the theme of alienation that he would later revisit with a much more gloomy perspective in `The Ice Storm' and though the film holds virtually no surprises, it is a stylistic success, easy to like and moving effortlessly with a superior sense of rhythm; it's always pleasing, even when the content feels overly familiar. He demonstrates a healthy respect for his characters (with the exception of a divorcee whose bitter views of marriage don't stop her from pursuing Lung)--everyone gets to play out their lives with dignity and happiness and without an ounce of filmmaker moralizing.",
         "This Taiwanese movie is about the best film I have seen about the generational gap between traditional and modern Chinese cultures. The father in the movie is a widower and a superb cook who has unfortunately begun to lose his sense of taste--needing to have his assistants taste his food to get the flavor right. Much of the movie centers on the love life of him as well as his daughters, as well as the older man's friendship with a cute neighbor girl and her mother. I loved this movie because the material was handled so gently and realistically--making you really care about most of the characters. About the only one you DON'T care for is the obnoxious older lady that has set her sights on Dad! How the many relationships are resolved is masterful and provided me with a good laugh! This is a terrific movie for anyone looking for a slice of life, a movie about world cultures or someone wanting to watch a cute romantic movie. Guys--relax!!! You'll enjoy this one, too!",
         "When I finally got around to seeing this on TV a few nights ago, I had completely forgotten that Ang Lee had been the somewhat unusual (it was thought at the time) choice to direct a well-reviewed remake of Jane Austen's \"Sense & Sensibility.\" But as I watched, it struck me quite forcefully that EDMW was an updated version of an Austen movie, and a very clever one. The marriageable daughters are there, the beleaguered father, the talkative woman--in this case the neighbor with designs on Mr. Chu, and I felt that her somewhat over-the top performance was the most Austenesque of the lot. The treatment throughout is delicate, sophisticated and affectionate, and some of the twists--the religious daughter who has lied about her \"past\" to make herself seem less pathetic--truly original. Lovely performances, pretty young actresses and a good script. I wish I'd seen it earlier, but I'm grateful to a no-commercial station for putting it on now.",
         "There is usually nothing that gets me away from my newspapers on a Sunday Morning. I usually spend several hours on my back porch immersed in news and entertainment. I flipped on the TV to see what was happening in the third round of the Masters and I noticed a movie on the Indie channel that I hadn't seen and it looked interesting. Big mistake! It Was And Lee's Yin shi nan nu (Eat Drink Man Woman). The paper got put aside as I couldn't tear my eyes away from the story. It was captivating, to say the least. How a widowed father deals with three daughters was the classic relationship film.In addition, the subplot, how everyone was doing something that they thought was \"what was expected,\" instead of what they really wanted to do was a simple definition of life out of balance. Only when life is in balance can you taste the spice. You'll have to invest some time in watching this great film to understand that fully, and it will be time well spent.",
         "This movie is a visually sumptuous confection served up by Ang Lee as a follow-up to The Wedding Banquet. While some people may be put off that the film is in Mandarin with subtitles (and the DVD does not have a dubbing option), the film is so strong visually that you forget about the subtitles and just admire the thoroughly delightful story. I found the film's theme very interesting...that life constantly surprises, especially if one opens themselves up to life's possibilities. Nothing in this film plays out like you expect it to. It is the single common thread between the multiple story lines. If this film has a flaw it is that too many of the changes happen too suddenly, without an examination of the processes that led to the sudden developments. The food scenes in this film are to die for. In this case, as opposed to being a primarily carnal sensual experience as it is in films like \"Chocolat\" and \"Like Water For Chocolate,\" food also takes on a rhythmic intensity and meter here. There is amazing energy and balance displayed in the preparation and presentation of the meal. Sort of like Feng Shui for the tummy. Bon Appetit.",
         "Eat, Drink, Man, Woman is one of the best films of all time. It has all the elements of a great movie. From the opening shot to the final I was absolutely riveted to this compelling, truthful, beautiful, and humorous look into the lives of a Taiwanese family. Ang Lee, known quite famously now for \"Crouching Tiger, Hidden Dragon\" and the upcoming \"Hulk\" has done a masterful job of directing and storytelling. The cinematography is INCREDIBLE. The movie as mentioned focuses on on Widower, Master Chef Chu, who is having a hard time relating to his three independent daughters. He attempts to communicate his love for them by creating these incredible gourmet dinners. The daughters are very defined, each with a different personality. The eldest, is a Christian, which is the first time in a movie I have ever seen, where a Christian is portrayed in a favorable light. She is struggling with being an old maid and the fear of leaving her Father uncared for if she does get married. The second daughter is wild and rebellious. She is portrayed extremely well by the ultra sexy Chien Lien Wu. This woman is absolutely stunning!!! She is torn between three things, her career, her desire to be independent, and her liason's with two men, one who is married. The third daughter is portrayed sweetly and innocent who ends up stealing her best friends boyfriend away. There are many plot twists and turns, but in the end, the movie finishes in a beautiful and happy way. I have now watched this movie twenty times and I think it is a great contribution to the film world. I wish more people knew about it here in the States. This movie can move you to being a better person. On a side note, I highly recommend you order some Chinese food, because you will be starving for it before the movie is over.",
         "Being a female Asian American (1st generation), I definitely relate to the movie, especially the three daughters' devotion to their father and of maintaining and continuing family tradition. I loved the differences amongst the daughters: The older religious teacher daughter, the power executive daughter, and the teen aged daughter. However, no matter how their lives diverged, they were always brought back to the table by their ever-patient father. The little neighbor girl was absolutely adorable and the relationship between her and the father is endearing. The best scene is when she brings her lunch to school and the food is so lovely, tall of the children crowd around her and she's the hit of lunch period. Besides this movie, other Ang Lee films that are great are The Wedding Banquet and The Ice Storm and Crouching Tiger Hidden Dragon - need to see Sense and Sensibility and Brokeback Mountain (maybe even the Hulk), but this movie is my all time favorite - it makes me sad and wistful at times, but in the end, it always brings a smile to my face and touches my heart.",
         "I came across Yin Shi Nan Nu just by chance, when one day I was sorting DVD's in my local store. I was curious about the name in Spanish, and I have seen other movies by Ang Lee, but I have never repented for my sudden decision to take the movie home. This is a brilliant portrait of a family on the verge of being torn apart by their personal differences and the ominous presence of modernity, which has started to undermine the roots of the traditional Taiwanese family life. The presence of traditional Chinese Cuisine, in which Chu is both a master and the heir to hundreds of years of knowledge, serves as the perfect background to place the characters, as a metaphor for a way of life that is quickly disappearing, threatened by fast food and changes in family values. The director does not, however, focuses on mellow or sweetened scenes to show the conflict, but he maintains a humorous tone throughout the movie, placing the actors' performances on subtle gestures and witty lines which rely heavily on understatement and comedy-like situations. The basic premise of the movie suggests that change is not only inevitable but also necessary. However, the old values still need to be cherished and passed on to the next generation since they are the foundations which give sense and meaning to a life which tends to assimilate happiness to disposable items and economic success. In doing so, Chu and her daughters get reconciled, as well as their traditional background comes to terms with modernity."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Ang Lee Productions",
         "Central Motion Pictures",
         "Good Machine"
      ],
      "summaries": [
         "Senior Master Chef Chu lives in a large house in Taipei with his three unmarried daughters, Jia-Jen, a chemistry teacher converted to Christianity, Jia-Chien, an airline executive, and Jia-Ning, a student who also works in a fast food restaurant. Life in the house revolves around the ritual of an elaborate dinner each Sunday, and the love lives of all the family members.",
         "A senior chef lives with his three grown daughters; the middle one finds her future plans affected by unexpected events and the life changes of the other household members."
      ],
      "budget": 0
   },
   "movielensId": 232,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1994-08-03",
      "dvdReleaseDate": "2002-03-05",
      "directors": ["Ang Lee"],
      "runtime": 123,
      "movieId": 232,
      "title": "Eat Drink Man Woman",
      "mpaa": "",
      "actors": [
         "Sihung Lung",
         "Yu-Wen Wang",
         "Jacklyn Wu ",
         "Yang Kuei-Mei",
         "Winston Chao",
         "Sylvia Chang",
         "Chen Chao-jung",
         "Lester Chan",
         "Yu Chen",
         "Kuei Ya-Lei",
         "Chi-Der Hong",
         "Gin-Ming Hsu",
         "Huel-Yi Lin",
         "Shih-Jay Lin",
         "Chin-Cheng Lu"
      ],
      "imdbMovieId": "0111797",
      "originalTitle": "飲食男女",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["l7pKpO8NErU"],
      "plotSummary": "The film tells the story of a retired and widowed Chinese master chef Chu (Si Hung Lung) and his family living in modern day Taipei, Taiwan. At the start of the film, he lives with his three attractive daughters, all of whom are unattached. As the film progresses, each of the daughters encounters new men in their lives. When these new relationships blossom, the stereotypes are broken and the living situation within the family changes.. The film features several scenes displaying the techniques and artistry of gourmet Chinese cooking. Since the family members have difficulty expressing their love for each other, the intricate preparation of banquet quality dishes for their Sunday dinners is the surrogate for their familial feelings.",
      "tmdbMovieId": 10451,
      "avgRating": 4.02312,
      "releaseYear": "1994",
      "numRatings": 6530,
      "posterPath": "/jGjSu9zlR2I8t6OE54uxSJ7M25p.jpg"
   }
}