{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "tour bus",
            "id": 10423
         },
         {
            "name": "black and white",
            "id": 12999
         }
      ],
      "imdb_id": "tt0150230",
      "video": false,
      "title": "The Cruise",
      "recommendations": [
         37650,
         53198
      ],
      "backdrop_path": "/xKMXLYVOWsXzn2V7f4srQwBVW15.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Himself",
            "gender": 0,
            "credit_id": "52fe44ce9251416c9101d699",
            "name": "Timothy \"Speed\" Levitch",
            "profile_path": null,
            "id": 109114,
            "order": 0
         }],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ce9251416c9101d69f",
               "name": "Bennett Miller",
               "profile_path": "/x4dgCqGj5H5Px8CWse406NjDqtO.jpg",
               "id": 5345,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "554968b4c3a36841b9000c3b",
               "name": "Bennett Miller",
               "profile_path": "/x4dgCqGj5H5Px8CWse406NjDqtO.jpg",
               "id": 5345,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "554968bdc3a36841b6000a35",
               "name": "Bennett Miller",
               "profile_path": "/x4dgCqGj5H5Px8CWse406NjDqtO.jpg",
               "id": 5345,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554968cac3a36841af000ba8",
               "name": "Marty Beller",
               "profile_path": null,
               "id": 1463861,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "554968eac3a36841bf000bb6",
               "name": "Michael Levine",
               "profile_path": null,
               "id": 167357,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55496905c3a36841ab000b13",
               "name": "Kevin McLeod",
               "profile_path": null,
               "id": 1159204,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5549691292514104b8000b2a",
               "name": "J.B. Miller",
               "profile_path": null,
               "id": 1463862,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "55496921c3a36841bf000bbe",
               "name": "David Cohen",
               "profile_path": null,
               "id": 158054,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5549692e92514104ba000bcc",
               "name": "Theodore Miller",
               "profile_path": null,
               "id": 1378987,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "5549693c92514104ca000a8e",
               "name": "David Yamner",
               "profile_path": null,
               "id": 1463863,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.367702,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32326,
      "vote_count": 9,
      "budget": 0,
      "overview": "Affectionate portrait of Timothy \"Speed\" Levitch, a tour guide for Manhattan's Gray Line double-decker buses.",
      "similar": [
         2292,
         227156,
         705,
         62214,
         828,
         23049,
         9833,
         121986,
         2657,
         363,
         63849,
         91739,
         352208,
         5544,
         140420,
         922,
         9442,
         9389,
         371560,
         690
      ],
      "original_title": "The Cruise",
      "runtime": 76,
      "poster_path": "/nnN5hvuB0ZK8TUZORe4Q5ipHiLH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Charter Films Inc.",
         "id": 52758,
         "origin_country": ""
      }],
      "release_date": "1998-10-23",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Bennett Miller"],
      "runtime": 76,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0150230/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5Njg5NTAxMV5BMl5BanBnXkFtZTcwNTIzMzIzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Timothy 'Speed' Levitch | See full cast and crew »"],
      "reviews": [
         "The Cruise isn't so much of a film as it is an awakening. It is the story of one of the most unique, interesting, brilliant, and bizarre men in the most unique, interesting, brilliant, and bizarre of cities. The man is Timothy \"Speed\" Levitch. The city is New York. Timothy Levitch is a twentysomething New York City Bus Tour Guide. This is a good thing, because Levitch likes to talk, and talk, and then talk some more. Levitch is a philosopher with a unique perspective on life: He views all the worlds materials as having a symbiotic relationship with each other in a way not so much cosmic as intertwined. This leads to his belief that The Brooklyn Bridge not only is one of his best friends, but the only friend who hasn't let him down. He also feels that he has had an on again off again relationship with New York City, and he has an ongoing battle with the \"anti-cruise\" forces. See, the anti-cruise forces are those that impose conformity on Levitch. Among others, these include his Grandmother, the police, and the city map grid. All this may appear to be the ravings of a misguided lunatic, and at first glance Levitch surely fits the bill. Wearing something akin to Elton John's wardrobe, Levitch was a sight to behold at the premiere. However, there is more to him than that. You might not agree with Levitch after seeing this documentary, but you can't dismiss him either. He is often brilliant in his analysis of the inanities that we pass for our daily reality and routine. In his brilliant critique of the city grid system, when he says \"why don't we just rob all our imagination and wonder,\" we tend to agree. According to Levitch, we often do. Levitch is just as fascinating on his bus tour, speaking with a vast knowledge of NYC at a pace that demonstrates his nickname, \"speed,\" perfectly. He mentions famous names and apartments in rapid fire succession, fascinating quotes, and interesting bizarre stories that hurl at you so fast that the tour must seem like a trip into another universe. And that is exactly the point of his tale. In one of the opening sequences, he says that the goal of the city tour is to change your view forever. We see him talking and mingling with people, completely stripped of self conscience and convention that pervade our interactions. You see both a man full of insecurities, but also a man fully comfortable with them. In fact, you could even say he revels in them. Without those insecurities, he might not have the hatred of the \"anti-cruise\" forces that he, and the audience, have so much fun rebelling against. This is never more true than in a fascinating scene when he stands with his friend the Brooklyn Bridge and verbally accosts all those who have done him wrong. These include women who have spurned him, students who picked on him, and many others, including his parents. The footage is breathtaking, hysterical, and sad all at the same time. It shows a man who may or may not have come to peace with his reality, who also fully understands that the world has not. That scene, and the last one, where Levitch decides whether to open a door that leads to top of a skyscraper, considering the risk of the alarm going off, are the best in the film. That last one, which clearly demonstrates how and why Levitch has made the unique choices he has made, is all the more powerful, once we've gotten to know him. The triumph of the filmmakers is in finding the material to begin with. Levitch is absolutely fascinating, and the filmmakers have brought this to the surface. They are smart enough to know they have a winner, and their style is for the most part unobtrusive. They show Levitch just being Levitch. Where the film has triumphed is at the editing level. The film's flow makes sense, and the footage they capture brings us the essence of the man. After these 87 minutes, we feel like we know Levitch. We have seen him laugh, cry, scream, and talk, and talk, and talk. We have gone along for the ride. While we may not be fighting the \"anti-cruise\" forces after we've seen this story, we did for these 87 minutes. As the saying goes, \"There are 8 million stories in the naked city,\" and we would all be better for seeing this one.",
         "Timothy \"Speed\" Levitch is more than just a New York crank, he's a spokesman for the genX drop out philosophy; find the space you are happy in, forget the rest. Forget the conventions, forget the rules. He's cruising because he's in love with everything that is creative and destructive in himself. That's what a romantic does. And he is the quintessential modern romantic. The Cruise has been criticized as for being a purely sympathetic portrait of Levitch-- but that's what makes it so exhilarating; we are brought to Levitch's way of seeing; we don't come to judge, but to cruise. When I try to think of flaws in this movie, I come up with virtues: that we don't get enough, that Levitch's secrets are not revealed, that we are left wondering about the reactions of those pastel-visored tourists... these mysteries actually augement the movie's charm. I should have given it a nine.",
         "This movie is just fascinating to me. It is essentially just a documentary that follow a quirky New York tour guide around. Then you begin to listen to what he is saying and you get under his skin in a weird way. You realize that here is a man with an absolute joy of life and a philosophy that truly does work for him. As strange as he may be, we should all be so lucky to have it all figured as as he seems to. He speaks in a flowing stream-of-consciousness style and seems to enjoy using multi-syllabic words. We watch as he lectures his tour groups on various aspects of New York history and landmarks and on only one occasion do we see anyone sort of laughing and mocking. No one else seems fazed by him at all. Is this just New York? He is a philosopher of the city. His philosophy reflects living in an urban jungle of steel and concrete. He feels the city as a Native American might \"feel\" the woods. This movie is highly recommended. Seek it out.",
         "I am a bit surprised to see the negative reviews on here because I thought the film was an absolute blast! The film follows an eccentric tour bus guide in New York City who speaks in a unique style with a wealth of knowledge about his beloved city. There is no more, on the surface, than that central premise. However, the gentleman starring in this feature is a more interesting character than one might imagine could exist in such a position. Not only is he quite extraordinarily intelligent, but he has a very unusual perspective and form of delivery that is extremely engaging and fun to listen to. I found myself not wanting the film to end as I grew to respect some of his ideas more and more. His oddball posture is so unique that it feels as though the movie front-loads viewers with strangeness, only to allow the more relatable side of him to slowly show itself as the film rolls forward. However, his ideas are simply more accessible as his delivery becomes more familiar to the viewer. A second viewing of the film showed me that I was too overwhelmed, in the beginning of it the first time around, by the sheer idiosyncrasy to pay attention enough to follow his line of expression. I highly recommend this movie to anyone who likes unique characters or really good contemplative and philosophical conversation.",
         "This little film could also have been a great story for The New Yorker. When I saw Tim \"Speed\" Levitch, I thought, Wow, I know this guy! He's every New Yorker I've ever met - tough, effete, gruff, wise, silly, profane, provincial, cosmopolitan, neurotic, eloquent, voluble, accessible, insecure, indomitable... A few points: I hope Speed wasn't fired by Grey Line (like he was afraid he'd be) for his choice comments and his non-regulation livery. Grey Line should wise up and charge a premium for the \"Speed Tour\" and give Tim Levitch a fitting raise. More than anything else, \"The Cruise\" is a portrait of a natural-born poet in his element.",
         "It's hard to tell. I was the Assistant Music Supervisor on this film and the reason it was shot in B&W was because Bennett Miller made the film on about $5,000 - It had nothing to do with trying to be \"Arty.\" I saw the rough cuts of the film, and they were great because they gave you more of a glimpse into Tim's life. I ran into him on Wall Street this spring (2005), where he was shooting something. We chatted for a few minutes, but he was predictably vague about what he was doing and trying to comprehend the \"Tim-Speak.\" The WTC scene is a little spooky to watch these days, but it's my favorite scene in the film for posterity reasons.",
         "Part Allen Ginsberg, part Woody Allen with a sprinkling of Harvey Fierstein and Albert Camus Timothy Speed Levitch takes you on a unforgettable tour of NYC - The genuineness of his love for NYC, it's history, it's culture is infectious- There is an alluring innocence about Levitch though you can't help wondering what the issue or issues are that darken his soul; is it drugs, his sexuality, mental illness? Add Levitch to the long list of highly actualized, highly troubled human beings whose struggles illuminate the journey. The scene of his visit to the grounds of the twin towers is haunting and you wonder if this film could have been made in post 9/11 world",
         "For anyone who has spent any time with New York or New Yorkers, this film is a must see. After you spend 90+ minutes with Timothy Levitch, you have to love the guy and hope that nothing tragic ever happens to him. I'd love to see him make a successful transition to the late night talk show circuit. Timothy Levitch is just a precious, complex jewel of a person. May he live long and prosper. The director had a very cooperative subject, who is very comfortable being his unaffected self.",
         "I really well spoken film. To think that the point of this film is that the world sucks is to completely miss the point. This is a celebration of New York city. A celebration of civilization. Yes, there are rants that seem pessimistic yet remain intelligent. \"Speed\" is poetic. Cinematography requires more for a city with such aesthetic qualities in its landscapes and architecture. At the same time, Speed's vocals make up for anything the camera loses and/or misses. I suppose this movie is more about Speed's interpretations and the way He sees New York than how it could be seen through a lens. It's his lens that we are permitted to see through.",
         "what a perfect movie. yes speed levitch is definitely pretentious, but his passion is undeniable. i found his nasal voice and odd ambling walk (he almost seems like he's walking with clown shoes on) fascinating. if for no other reason, watch this movie if you need to laugh, because there is such a childishness about this man, and his persistent illusions of the world around him, that you can't help but marvel at his whole vocabulary, his worn jackets, his philosophy of \"the cruise\" and \"the anti-cruise.\" you will never meet a person quite like him, but you should at least imagine what it would be like. best of all, he is a real person, and this portrait of him is exquisite."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["Charter Films Inc."],
      "summaries": ["Affectionate portrait of Tim \"Speed\" Levitch, a tour guide for Manhattan's Gray Line double-decker buses. He talks fast, is in love with the city, and dispenses historical facts, architectural analysis, and philosophical musings in equal measures. He's reflective and funny about cruising: he loves it, got in it to meet women, and he'd quit work if he could. His personal life is disclosed in small doses: he takes home $200 a week for 20 hours work, home is his suitcase and wherever he can flop, he's been arrested for going out on the roof tops of skyscrapers to see his city; he stands between the towers of the World Trade Center, spins until he's dizzy, then looks up."],
      "budget": 139064
   },
   "movielensId": 2323,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-23",
      "dvdReleaseDate": "2006-03-07",
      "directors": ["Bennett Miller"],
      "runtime": 76,
      "movieId": 2323,
      "title": "The Cruise",
      "mpaa": "PG-13",
      "actors": ["Timothy \"Speed\" Levitch"],
      "imdbMovieId": "0150230",
      "originalTitle": "The Cruise",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Affectionate portrait of Timothy \"Speed\" Levitch, a tour guide for Manhattan's Gray Line double-decker buses.",
      "tmdbMovieId": 32326,
      "avgRating": 3.66602,
      "releaseYear": "1998",
      "numRatings": 259,
      "posterPath": "/nnN5hvuB0ZK8TUZORe4Q5ipHiLH.jpg"
   }
}