{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "nightclub",
            "id": 2334
         },
         {
            "name": "pet shop",
            "id": 2589
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "unhappiness",
            "id": 156455
         }
      ],
      "imdb_id": "tt0109759",
      "video": false,
      "title": "Exotica",
      "recommendations": [
         10217,
         40156,
         2297,
         10341,
         43344,
         41796,
         18900,
         33214,
         18602,
         32636,
         1785,
         11911,
         21430,
         36096,
         41662,
         28942,
         113936,
         151307,
         78572,
         1405
      ],
      "backdrop_path": "/oIzCTMJvo6uJGrPyz5BFdIJcLSX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Francis",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e09",
               "name": "Bruce Greenwood",
               "profile_path": "/his8sEwC8FLC4dAxVSu9GNicE6Z.jpg",
               "id": 21089,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Christina",
               "gender": 1,
               "credit_id": "52fe43d9c3a368484e001dfd",
               "name": "Mia Kirshner",
               "profile_path": "/n8XXrUi2PEdY6MiEaTQD0fgavsW.jpg",
               "id": 18658,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Eric",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e05",
               "name": "Elias Koteas",
               "profile_path": "/11pXICpcdGJxGG8H8g1Bk3qc66V.jpg",
               "id": 13550,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Thomas",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001ded",
               "name": "Don McKellar",
               "profile_path": "/cV1nEafG1CqIdnrce5pVw2hcaep.jpg",
               "id": 20173,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Tracey Brown",
               "gender": 1,
               "credit_id": "52fe43d9c3a368484e001e1d",
               "name": "Sarah Polley",
               "profile_path": "/asFwK6hCFYHtHVJoOwMBSMTETtg.jpg",
               "id": 98,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Zoe",
               "gender": 1,
               "credit_id": "52fe43d9c3a368484e001e01",
               "name": "Arsinée Khanjian",
               "profile_path": "/7N76v1poYcmHqz1rvkraPt2AZvJ.jpg",
               "id": 7708,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Harold",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e0d",
               "name": "Victor Garber",
               "profile_path": "/xFgPEfVEqz7Li2xoyjRPEKCjCrH.jpg",
               "id": 8536,
               "order": 6
            },
            {
               "cast_id": 3,
               "character": "Inspector",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001df1",
               "name": "David Hemblen",
               "profile_path": null,
               "id": 58805,
               "order": 7
            },
            {
               "cast_id": 4,
               "character": "Customs Officer",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001df5",
               "name": "Calvin Green",
               "profile_path": null,
               "id": 123319,
               "order": 8
            },
            {
               "cast_id": 5,
               "character": "Man in Taxi",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001df9",
               "name": "Peter Krantz",
               "profile_path": null,
               "id": 123320,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Scalper",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e11",
               "name": "Jack Blum",
               "profile_path": null,
               "id": 123323,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Man at opera",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e15",
               "name": "Billy Merasty",
               "profile_path": "/1UWPbafma5HU3LlrkSHcolOBXNM.jpg",
               "id": 61159,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Doorman",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e19",
               "name": "Ken McDougall",
               "profile_path": null,
               "id": 123326,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Man at Opera",
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e21",
               "name": "Damon D'Oliveira",
               "profile_path": null,
               "id": 111817,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001de9",
               "name": "Atom Egoyan",
               "profile_path": "/3lARbiaNDZbN0LBpXHNuSM9U4ur.jpg",
               "id": 56205,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d9c3a368484e001e27",
               "name": "Atom Egoyan",
               "profile_path": "/3lARbiaNDZbN0LBpXHNuSM9U4ur.jpg",
               "id": 56205,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.902266,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 20156,
      "vote_count": 83,
      "budget": 0,
      "overview": "In the upscale Toronto strip club Exotica, dancer Christina is visited nightly by the obsessive Francis, a depressed tax auditor. Her ex-boyfriend, the club's MC, Eric, still jealously pines for her even as he introduces her onstage, but Eric is having his own relationship problems with the club's owner, Zoe. Meanwhile Thomas, a mysterious pet-shop owner, is about to become unexpectedly involved in their lives. Gradually, connections between the traumatic pasts of these characters are revealed.",
      "similar": [
         4771,
         339692,
         627,
         507,
         2142,
         521,
         3134,
         298312,
         8810,
         948,
         11564,
         11798,
         6075,
         431,
         109421,
         101,
         205,
         141,
         281957,
         241
      ],
      "original_title": "Exotica",
      "runtime": 103,
      "poster_path": "/ays6xwNBACFV2tO7TYNqvcFOZLO.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "עִבְרִית",
            "iso_639_1": "he"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Alliance Entertainment",
            "id": 10166,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ego Film Arts",
            "id": 12800,
            "origin_country": ""
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "1994-09-24",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "In a world of temptation, obsession is the deadliest desire.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Atom Egoyan"],
      "runtime": 103,
      "synopsis": "Thomas (Don McKellar) goes through the customs check-in gate at an airport, surreptitiously watched by officials from behind a security mirror, as one guard talks about how to spot a smuggler. When Thomas arrives at his home we see he has large eggs taped to his stomach that he has brought in through customs undetected. As we move to Exotica, a dance club sporting a hot house theme where women dance for men, we are introduced to Francis (Bruce Greenwood) who comes to the club regularly to see his favorite dancer Christina (Mia Kirshner) perform her School Girl performance. They are watched by Eric (Elias Koteas) the club DJ who has a past history with Christina, and who also functions as bouncer when clients violate rules by touching the performers. An accountant by trade, Francis arrives at the pet shop of Thomas the next day to examine his accounting books, unaware that the smuggler has a rare exotic egg at his house that he is incubating. Later that night while attending an opera performance Thomas picks up a man who happens to be the customs officer who had watched him at the airport. Later when the customs officer steals the egg from Thomas, we learn that Francis is part of a larger investigation to see where Thomas has untaxed coming in to his business. The relationship of Eric and Christina is a love affair that has gone sour mainly because Eric made a deal with club owner Zoe (Arsine Khanjian) to allow her to have his child. As announcer for the performers Eric holds a particular bitterness connected with Christina that is apparent in the way he announces her special dance. Eric is jealous that Christina has broken up with him and he resents the attention that Francis gains from the young dancer, so he anonymously suggests that Francis touch Christina as she performs, an act that the two men know is prohibited. When Christina is dancing for Francis, he touches her stomach and Eric violently ejects him from the club. When Francis enlists the aid of Thomas and recovers a gun, he returns to Exotica to confront Eric in a stunning and emotional climax. Yea but who knows what's going on in this movie?",
      "writers": ["Atom Egoyan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0109759/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4OTMzMDczOV5BMl5BanBnXkFtZTYwODYyMTg4._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Bruce Greenwood, Elias Koteas, Don McKellar | See full cast and crew »"],
      "reviews": [
         "'Exotica' is clearly Egoyan's best film and his most successful presentation of the motifs that have characterized his films throughout his career; these include the presentation of the narrative out of chronological order, the interaction of characters by means of videotape and hidden surveillance, the relationship between parent and child, and the repetition of situation and dialogue. The film's theme involves the superficial barriers-both physical and psychological-that prevent people from making a genuine emotional connection with others; as we watch the film we witness how various people react to these barriers and struggle to break them down. The film's strong emphasis on structure and focus on Thomas' and Francis' parallel 'hunts' for human contact can't help but remind of that masterpiece of medieval literature 'Sir Gawain and the Green Knight' (this is a work that Egoyan was born to adapt to the screen). In my opinion each of the film's six major characters parallels another to compile three pairs. The first pair of characters is composed of Thomas and Zoe. The most obvious similarity between these two is that each owns one of the film's two principle locations. Thomas' pet store and Zoë's strip-club are comparable in that both are businesses whose principle merchandise is living creatures that are excessively displayed so as to persuade the customer to make a purchase. Moreover, while the pet store is lined with glass cages and fish-tanks, the walls of the strip-club are composed of two-way mirrors through which employees can secretly observe the customers. In addition to the life that each openly sells, both also possess hidden life. We see this in Zoë by the fact that she is very pregnant, but must disguise her appearance so as not to remind customers of the possible consequences of the lecherous behavior that her club encourages. Likewise, in the film's first scenes we see that Thomas is pregnant in a different way. Here, he is smuggling exotic bird eggs into the country by strapping the eggs to his stomach in order to hide them from Canadian customs officials. This hidden life also extends to their introverted personalities. To combat their inability to communicate verbally, both try to make interpersonal connections by means of physical contact. In a sense, then, Thomas and Zoë (as the Greek origin of her name might suggest) are givers of life both openly in their businesses and privately in their interaction with others. Next, Francis and Eric are parallel characters because of their mutual obsessions with Christina. Although Christina is intended to be seen as a sex object, neither Francis nor Eric has any interest in her in this regard. Instead, she symbolizes an emotional relationship that both once had, but now have lost. When they eventually discover their real relationship, Francis and Eric find that they do not need Christina and make an emotional bond with each other, which is symbolized by a physical embrace. Lastly, Christina and Tracey can be associated because Francis considers both as symbols of his dead daughter. However, Francis' relationships with Christina and Tracey both fail because he is unable to develop bonds that go beyond their assigned roles as a stripper and babysitter. Therefore, while Zoë and Thomas can be seen as givers of life, Christina and Tracey clearly receive life by taking on the roles that Francis and Eric impose on them. There are also many reoccuring images and symbols that reinforce the emotional isolation of the characters. The use of secret surveillance by two-way mirrors serves both as an invisible yet uncrossable boundary between people who would otherwise be very close to one another and as a way for the characters to make private judgments of those who are being unwittingly observed. In fact, while Eric secretly observes and judges Francis during his nights at Exotica, Francis, because of this job as an auditor, does the same to Thomas during the day. Egoyan reminds us that this relationship can ultimately be extended to include the audience members, who also make private judgments of the film's characters (we've this before in films like Hitchcock's 'Rear Window' and Powell's 'Peeping Tom'). As we watch the film, we too are in a sense reaching out to forge an emotional connection that transcends the barrier of the medium itself. The film's overriding presence of money suggests to the characters that the only legitimate grounds for a relationship is financial, and any time an emotional connection is made the characters feel guilty if they are not paying for it. Finally, the frequent appearance of parrots and their uncharacteristic silence reflects the characters' inability to communicate and overcome the losses of their past. I've really grown to admire this film and Egoyan's work in general. In 'Exotica' he creates a work of complex symmetry and interconnecting symbols while also conveying an atmosphere of lyrical intensity.",
         "Don't be fooled by the soft-porn title or the \"sexy thriller\" style art on the VHS box and DVD cover. This, like Egoyan's follow-up masterpiece \"The Sweet Hereafter\" is an intricate, elliptical, and tragic look at grief and loss focusing on the people who work at and patronize a Toronto strip club. It's all very literary and symbolic (the exotic creatures of the pet shop being audited by Bruce Greenwood's tax man with a sad secret mirroring the exotic dancers of the club where he finds his solace after hours) and surprisingly emotional (especially at the end). Character development, secrets, and inner truths are revealed slowly and carefully and in non-linear fashion by Egoyan's delicate director's hand. The \"exotic\" flavored yet haunting musical score is an added bonus. Worth a look if you are in the right mood and know what to expect from Egoyan.",
         "I can't remember seeing a film as intriguing, complex, and beautifully photographed as \"Exotica.\" I nearly didn't watch it because the video cover advertized it as an \"erotic thriller\" and the image on the front is of Mia Kirchner doing her strip-tease bit. Granted, \"Exotica\" centers around a \"gentleman's club\" of the same name, but to call this film a simple erotic thriller is to miss out on a lot, on too much. \"Exotica\" follows four seemingly unrelated storylines: a man sitting alone at a table in a strip club, another man smuggling exotic parrot eggs into the country (\"Exotica\" takes place in and around Toronto), two apparent strangers walking in a field of green, and a young girl who plays a flute in an empty house. Egoyan begins with these vastly different puzzle pieces then slowly, inexorably brings them together. Atom Egoyan is one heck of a masterful director. He is the epicenter of this cinematic symphony that leads carefully from movement to movement until the finale bursts forth in equal measure of catharsis, discovery, and tragedy. Plot to him is like tapestry weaving. He threads narrative, characters, time, and setting in such complicated iterations that one is at once nearly overwhelmed by the intricacy and awed at his skill, a testament to his brilliance as well as his belief that a film-going audience is actually intelligent. At it's heart, \"Exotica\" is a tragedy of circumstances. Or better yet, a collision of tragedies of circumstances. Indeed, the film isn't so much about tragedy as it is about those who survive tragedy and the toll a single event can exact for the rest of the lives of those who survive. Exotica, the gentleman's club, serves merely as a focal point where all these individual tragedies radiate to. Equally haunting in all this is the music. Mychael Danna's score sets the film's tone: dark, \"exotic,\" deceptively simple but savvier than it lets on. Also worthy of note is the music in the club itself, a blend of American house funk and Middle Eastern tones, warbled in Arabic. I highly recommend this film. Ignore the naked women who sashay from time to time in front of the screen (difficult as that may be at times) in the scenes shot in the club. The really interesting stuff occurs at the margins of the film, as the gulf separating the storylines begin to vanish, and the final scene gives you the keystone to a horrifying clear vision of a sadness so overwhelming that no one in the film escapes unscathed.",
         "Just seen this for the second time. First time I saw it (about a year ago), I wasn't really sure what to make of it, but there were scenes from it (when Elias Koteas reveals why his connection to the disturbed and grieving father and the scene with the father and his daughter's babysitter at the end) that have always stuck in my mind. A very haunting and beautiful movie (even though it gives a very unpleasant view of life), with a haunting snake charm style score and starring the brilliant Elias Koteas (from \"Crash\") and the lovely Mia Kirshner (from early first season \"24\" and \"The Crow: City Of Angels\"). Victor Garber (Sidney's dad in \"Alias\") also has a couple of scenes. Not to many tastes but very rewarding if you can appreciate it (although it's sense of detachment probably puts off a lot of people). It seems to me to explore the theme of people trying to connect, in a very insular and ultimately unfulfilling way (the young gay man who goes to the ballet every night and gives away his \"extra ticket\" for companionship or the grieving father who pays a young girl to \"babysit\" his empty house so that he can have the illusion his daughter is still around for example), and also the theme of loss (variously of loved ones, innocence, youth, opportunity etc). The Exotica strip club seems such hollow place but at the same time it seems almost understandable that it would draw hapless souls night after night with nowhere else to go. Some of the dialogue seems poetic, cynical and truthful all at the same time. A film that you really need to watch to the end before you really feel you understand it's puzzle (and even then there seems to be something just out of grasp this viewing). A moving portrait of life that will linger in your mind afterwards.",
         "CAUTION-SPOILERS AHEAD-EXOTICA has been overwhelmingly praised by the critics. I think the Tomatometer is at 95% favorable. Here is my take on EXOTICA-maybe it will help some viewers to appreciate this fine film. The film is very much a paradox, sensual but sterile, intense but distant, hollow but haunting. It is a complex story with a relatively simple theme. The characters include Francis (Bruce Greenwood) as a Canadian government revenue auditor who is auditing the financials of an exotic pet store (whose owner Thomas is played by Don McKeller) while trying to exorcise his demons at a strip club called EXOTICA. During his nocturnal visits to the club he pays his niece Tracey (played by Sarah Polley) to baby-sit his seemingly absent daughter. The viewer gets to know the strip club DJ, Eric (Elias Koteas); a stripper, Christina (Mia Kirshner) who dances for Francis and happens to be Eric's ex-girlfriend; and the very pregnant (by Eric) club owner Zoe (Arsinee Khanjian) who is having an affair with Christina. The plot is an example of elliptical storytelling in that it moves in a purposeful ever-circling way to slowly reveal the connections between the worlds of each character. There is enough misdirection to keep the viewer wary of their perceptions. They must pay complete attention and remember what they see. There are significant technical reasons to like this film. It is first and foremost a director's film and Adam Egoyan's directing is amazing. A director is responsible for both casting and for directing their cast. For Exotica Egoyan added to his cast of regulars two of the best young actresses (Kirshner and Polley) in Canada. Kirshner's performance provides an extremely unusual combination of sensuality and thinly masked pain. Polley is simply the most subtly expressive actress in film today. They are world class talents who seem to deliberately stay away from mainstream films but have little trouble getting lots of work. Greenwood, McKellar, Koteas, and Khanjian, are likewise excellent. Egoyan kept all six reined-in so that their performances are low-key and restrained. While there were many stylish and beautiful camera shots he mostly keeps the characters at a distance. Exotic décor, busy sets, atmosphere, restrained acting, minimal tight shots, and frequent plot misdirection keeps the viewer from bonding or strongly identifying with the characters. He did not want the viewer getting into the heads of the characters, he wanted us to internalize the theme and to take it into our heads. This way if we pay attention we will learn as much about ourselves as we will about the characters. The theme is substitution, how the process of living is simply a process of substitution. We grow out of things and find substitutes for them. We lose something precious but we carry on by finding a substitute. We expand our horizons and find substitutes that we did not know about or that we thought unattainable. We need something we can't have so we find something that works as a substitute. Sometimes the substitutes are an improvement on the original, sometimes they are a better match with a new stage of life, sometimes they are an imperfect substitute but the best that we can manage, and sometimes (certainly in this film) they are an addictive trap that keep us from moving on or growing. Most people's dreams don't come true and they settle for a substitute, often without really noticing. The most compelling scene in `Field of Dreams' is when Burt Lancaster is talking about what it was like to give up his dream of playing major league baseball. He says: `It was like coming this close to your dream and then watching it brush past you like a stranger in a crowd. At the time I didn't think much about it. We just don't recognize the most significant moments in our lives when they happen. Back then I thought: there will be other days, I didn't realize that was the only day'. While his character accepted the end of his dream and substituted a life as the town doctor, in Exotica the substitutes are dysfunctional because there is no acceptance. That is why so many of the substitutions involve payment, a transactional substitution is a temporary event and allows the illusion to stay alive. Exotica focuses on the substitutes used by its central characters. Francis substitutes Christina for his daughter and Tracey for Christina (when she was his daughter's babysitter). Eric substitutes his club DJ job for the career he wanted in radio, he substitutes his voyeurism in the club for his inability to have a lasting relationship. Zoe substitutes for her dead mother and continues to run the club, instead of a husband she has Eric contractually substitute so that she can have a baby. Thomas substitutes his opera liaisons for a real relationship and substitutes an incubator for the eggs he has taken from a nest. Christina substitutes a protective Francis for her uncaring and probably abusive father. Voyeurism substitutes for interaction. Eric's voyeurism eventually leads him to the conclusion that the Francis-Christina mutual dependency has gone from a temporary coping mechanism to an addictive trap. He elects to destroy that relationship by convincing Francis to touch Christina. Eric knows that the relationship must end once this occurs, no matter how Christina reacts. Either she will no longer be able to use Francis because he betrayed her trust or Francis will no longer be able to use her because he can no longer maintain his illusion of protecting her purity. Then they will both have to move on and seek new and hopefully more positive substitutes. Contrary to some who have commented on this film I did not see any real `plot holes'. Almost every detail is eventually explained and if anything Egoyan made the plot a little too predictable. But at least this was balanced by some interesting misdirection-like having Tracey live above a shabby strip mall so you jump to the conclusion that she is a child prostitute and that Francis has a thing for young girls. Certainly on the second viewing it is clear that many clues are provided and that the outcome is being subtly telegraphed throughout the film in a kind of mental striptease. As already mentioned, the really unique feature of this movie is that the viewer does not really connect with the characters but instead connects with the substitution theme. The audience is given a new perspective from which to think about their own substitutions. Perceptive members of the audience are forced to be more than observers. This is powerful stuff.",
         "Perhaps Atom Egoyan's most successful film. Egoyan's technique is to fracture a story like a jigsaw puzzle, giving the viewer bits and pieces which only all connect in the final scene. That ripping apart of reality is especially appropriate here, since the movie is about people putting their lives together after terrible trauma. It's also about the danger in leaping to conclusions - the viewer is often tempted to make a judgement about what he or she sees, and that judgement is often both wrong and unfair. If this all sounds like homework, be assured that the movie is also a lot of fun: it's sexy and interesting and inspired.",
         "Spoilers herein. Many of the most intelligent films begin with the notion that life is a performance, possibly an acting out of remembrances. Then, as the filmed performance of that life performance unfurls, we have amble opportunity for layer shifting and ambiguities... lots of things that amplify power like the notion of an actor who is acting that they are acting, or better: not acting, just \"staying.\" We have here one of the tightest films I've ever encountered. The stance of the acting, the braiding and mirroring in the story, the score and the camera eye are completely congruent. So completely congruent that I have placed it as a 4 of 4, which is more than just a good film. In my system, it denotes required viewing, sort of an equivalent of Bloom's list of great books without which one cannot invent intelligence. The trip is rugged, demanding but rewarding. We have a young woman acting as a schoolgirl and providing succor to a wounded gent. We have her former lover, damaged and bitter at his frustrations, `directing' her. Both work for someone who hides addiction under the blanket of tradition. The wounded gent is incapable of performance (even `touching') so acts as codependent, demanding recipient of performances. This is the stuff of life that anyone experiences. Here, it is framed within a certain kind of stage. Within this, we have watchers, auditors, voyeurs, monitors, toilet interlocutors, two-way mirrors. We also have pregnancy, eggs, children... and death. The bearer of eggs (soon to be lost to love) and the wounded gent are thrown together, and thus begins the braid. The end of the braid puts us at the point where one performance cannot continue, but the other must go on. Is it \"reality\" that continues? Ted's evaluation: 4 of 4 -- Every visually literate person should experience this.",
         "When you first look at the VHS box for this movie, it looks like a slightly upscale version of Showgirl. Nothing could be further from the truth. This is a sad, painful, mysterious movie that explores human relationships in a very unusual way. Yes, lots of it takes place at a strip club,but it's not very sexy or explicit. You have to pay careful attention to this movie. It bounces around in time, and all the threads of the plot don't come totally together until the very last moment of the movie. But it has a devastating and gripping payoff. ONLY FOR INTELLIGENT MOVIE GOERS. It's a tough movie, kinda slow, but it is unusual, inventive and in my opinion, very satisfying. Also recommend THE SWEET HEREAFTER, directed by Atom Egoyan as well. Same fractured structure and sense of sadness. But beautiful.",
         "I first became aware of Atom Egoyans work after watching \"Felicias Journey\" on television. This was an unusual film in that I was not sure whether I was enjoying it or not, but equally could not have switched it off. It was only when I found myself thinking about the film some days later that I realised what an excellent piece of cinema I had witnessed. Through IMDb I checked for other work by this director & came across \"The Sweet Hereafter\". I quickly obtained a copy, and whilst watching it became spellbound by its slow burning intensity and the excellent performances of Bruce Greenwood, Ian Holm & the wonderful Sarah Polley. I needed to see more, and bought a copy of \"Exotica\". This film is an absolute masterpiece. Again, like \"Sweet Hereafter\" it has a slow burning quality,accentuated by the repetitive nature of the lives of the main characters. Excellent performances from Bruce Greenwood, probably one of the most underrated & understated actors of his generation, Sarah Polley, Elias Koteas and the beautiful Mia Kirshner. As you watch this film, you wonder how the lives of these characters will eventually impact on each other, and your mind searches for possible explanations. When this explanation arrives, it hits you like a tidal wave, washing away any doubts that you may have had about the quality of Egoyans storytelling. After gorging myself on a surfeit of summer blockbusters, which although enjoyable at the time, like a Chinese meal, leave you empty again some few hours later, I needed nourishment for my mind as well as my eyes. The discovery of the genius of Atom Egoyan has provided this spiritual feeding.",
         "I don't have much to add that hasn't already been said. \"Exotica\" is a great example of a movie that works with a budget limit and comes off better than all of these multi-million dollar Hollywood FX-bonanza's. An intricate and refreshing story where you get to know the characters piece by piece. The movie requires patience in the early stages, but once it clicks, there's no looking back. A masterpiece of a movie."
      ],
      "genres": [
         "Drama",
         "Mystery"
      ],
      "productionCompanies": [
         "Alliance Entertainment",
         "Ego Film Arts",
         "Miramax"
      ],
      "summaries": [
         "The 'Exotica' is a nightclub on the outskirts of Toronto, where Eric, DJ and MC, watches nightly as his ex-girlfriend Christina performs. Watches jealously, especially as far as the extra attentions regular customer Francis garners are concerned. Thomas, meanwhile and erstwhile, goes through a series of, um, interesting situations involving his pet shop, a gruff taxi-sharing stranger, unexpected tickets to the opera and smuggled eggs of a rare bird. Multiple story lines unfold in a splendid tangle of cutbacks, forward and backward references and recurring themes, all woven around the Exotica, its customers and employees. A calm roller-coaster ride of a movie, visually and intriguingly and emotionally moving. O, and the sound track is notable, too.",
         "This psychological thriller is true to its subjects as well as being complex, dynamic, and overly dramatic. How something so long ago, seemingly trivial, years later with more significant trauma, turns repressed emotions into a dysfunctional life and distorted thinking. This is all merged into a psychological menagerie that unfolds piece by piece to perfection."
      ],
      "budget": 2000000
   },
   "movielensId": 233,
   "movielens": {
      "languages": [
         "English",
         "עִבְרִית"
      ],
      "releaseDate": "1994-09-24",
      "dvdReleaseDate": "1999-11-16",
      "directors": ["Atom Egoyan"],
      "runtime": 103,
      "movieId": 233,
      "title": "Exotica",
      "mpaa": "R",
      "actors": [
         "Bruce Greenwood",
         "Mia Kirshner",
         "Elias Koteas",
         "Don McKellar",
         "Sarah Polley",
         "Arsinée Khanjian",
         "Victor Garber",
         "David Hemblen",
         "Calvin Green",
         "Peter Krantz",
         "Jack Blum",
         "Billy Merasty",
         "Ken McDougall",
         "Damon D'Oliveira"
      ],
      "imdbMovieId": "0109759",
      "originalTitle": "Exotica",
      "genres": [
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["tNxozZb7jr4"],
      "plotSummary": "In the upscale Toronto strip club Exotica, dancer Christina is visited nightly by the obsessive Francis, a depressed tax auditor. Her ex-boyfriend, the club's MC, Eric, still jealously pines for her even as he introduces her onstage, but Eric is having his own relationship problems with the club's owner, Zoe. Meanwhile Thomas, a mysterious pet-shop owner, is about to become unexpectedly involved in their lives. Gradually, connections between the traumatic pasts of these characters are revealed.",
      "tmdbMovieId": 20156,
      "avgRating": 3.52723,
      "releaseYear": "1994",
      "numRatings": 3636,
      "posterPath": "/oIwrh7QhwUNxejsvgKtFG4V0gaQ.jpg"
   }
}