{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "documentary",
            "id": 10073
         },
         {
            "name": "contest",
            "id": 11836
         },
         {
            "name": "endurance",
            "id": 155395
         },
         {
            "name": "pickup truck",
            "id": 158606
         }
      ],
      "imdb_id": "tt0116481",
      "video": false,
      "title": "Hands on a Hard Body: The Documentary",
      "recommendations": [
         63923,
         43983,
         25099
      ],
      "backdrop_path": "/trHO32mIL8yVTEBQiRkuxqPV3uj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe47899251416c7509d031",
            "name": "S.R. Bindler",
            "profile_path": null,
            "id": 75882,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.290264,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18603,
      "vote_count": 8,
      "budget": 0,
      "overview": "Hands on a Hard Body: The Documentary is a 1997 film documenting an endurance competition that took place in Longview, Texas. The yearly competition pits twenty-four contestants against each other to see who can keep their hand on a pickup truck for the longest amount of time. Whoever endures the longest without leaning on the truck or squatting wins the truck.",
      "similar": [
         533,
         75311,
         251471,
         15800,
         13532,
         91356,
         81899,
         173484,
         23050,
         258837,
         329697,
         169864,
         256402,
         142988,
         77597,
         71506,
         55194,
         187808,
         34126,
         160220
      ],
      "original_title": "Hands on a Hard Body: The Documentary",
      "runtime": 98,
      "poster_path": "/vm3BFvPCz498WfuNrDclxSYTruU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-06-01",
      "vote_average": 8.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["S.R. Bindler"],
      "runtime": 98,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116481/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxOTYxODYyN15BMl5BanBnXkFtZTcwMDI3MDg4OQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Sid Allen, Brent Baskin, Greg Cox | See full cast and crew »"],
      "reviews": [
         "I don't want to scare anyone away with the \"D\" word, so let's just say that this non-fiction gem is one of the year's best movies and worth begging your video store manager to stock. Using a no-frills action-and-interview technique, director S. R. Bindler follows the fate of 23 Texans who enter a bizarre annual promotional contest run by the local Nissan dealer. The contestants are to stand around a blue pickup truck, with one hand touching it at all times, and the last one left standing (70-80 hours later) wins the truck. Yes, I did say this was non-fiction! Fortunately for Bindler (or perhaps through his expert handling of them) the contestants turn out to be a colorful cross section, and you soon find yourself picking favorites and even rooting for them! The film manages as much suspense as any sporting event, with a lot more curiosity. Also, some profound themes start creeping in. This movie is sure to invite comparisons with those of Errol Morris, due to the eccentricity of its subject, and those who like Morris's work will surely like this. But Bindler deserves credit for forging his own less flashy style, and for giving us this one-of-a-kind, unforgettable experience.",
         "My reluctance to see this film in the theater was based solely on my friends' inability to describe what the film was about to my satisfaction. \"It's about this contest. These people put their hands on this truck, and the last one to remove their hands wins the truck. It's so good. I promise.\" Yeah, whatever. My friends finally convinced me to go, and I was amazed. And very soon after that, I was the friend in the role of inarticulate defender, dragging anyone who would listen along with me for my second and third viewings. My eloquence has not increased over the last two years, so I will simply say you will not be disappointed in watching Hands on a Hardbody. You may even be reminded how closely related we all are as human beings. You may also remember how dramatic and intriguing even the most seemingly uninteresting premises can be. And I defy you not to laugh out loud and/or get misty-eyed at some of the participants, not because they are presented as comic foils or ignorant east Texans, but because they are as human in their words and actions as you are likely to see in a film, documentary or otherwise.",
         "If you've ever wondered what it's like to be in one of those contests where you have to keep one hand on a car for as long as possible, this movie will definitely fill you in on what will go down. Like many other people, if I ever had the chance to participate in a contest like this, I'd probably jump at the chance. Well, after seeing this, maybe not. Depends how nice the car/truck is. Because after watching all the personalities fade away either physically or mentally, it's really an eye-opening experience, that no person should take lightly. You've got people from all walks of life participating. From country bumpkin folk who just desperately want to win, to past winners, to Jesus-freaks who believe the power of the one above will push them to the ultimate goal, to even waitresses and ex-marines. All are entertaining in their own right, but a few select characters, like my favorite, the black dude, who should have taken up stand-up comedy as a means of living, rule the day. Usually this appears to be some sort of fun, play around type contest, but the thing is, it's anything but. Backs, ankles, feet begin to hurt and eventually if you're up for over 30 hours or so, the mind begins to fade. You always knew that these types of things would occur, but to watch them is a totally different story. And I must admit, it's pretty damn funny. Watching one dude say he'll be here for a while, and then fast forward a couple hours and he appears to be on death's door. Hands on a Hard Body, isn't a contest for body-builders (though they may do well, if their mind is strong), but for everyday, hard-working people who want to win their hand at a brand new truck and some well-deserved respect along the way. If you're ever given the chance to enter one, research it a little bit because this movie definitely shows the viewer these contests aren't as easy as they appear.",
         "An unexpected look at an apparently simple contest. This movie has tension, humor, insight, and heart. For so many Americans the divide between making it and failing is a working car. In a small town we see what some people will do to win a fully-loaded new pick-up truck. One person here commented that the film exploits the poor people in the contest. I disagree. The people are presented as rounded individuals and the film includes interviews with the main characters, showing their viewpoints and not in a condescending way. The audience will find them amusing, but the tension comes from taking the contest seriously, and therefore, we take the contestants seriously too. We laugh at the human condition. It's a shame this DVD is out of print. We still need this film!",
         "i bought this DVD on impulse based on all the ravingly positive user comments at amazon.com. ever skeptical i figured nothing could be that funny, but it was under $10 and so i thought what the hell, something with so many raves has to be at least worth a smile right? wrong!! its hysterical, rolling on the floor laughing your ass off funny. rarely have i watched something that made me laugh and laugh and laugh so hard. a whole bunch of rednecks going through some insane communal sleep deprivation exercise. and what a bunch of characters! i swear they will live with me forever. the smiley-happy black dude, his shoes and his snicker bars - just classic. it also has an ending/climax that couldn't have been better if an Oscar winning scriptwriter created it. the video quality is something awful, but in this case content rules! you really have to see this movie...really!",
         "A number of the other reviews are from Texans who wonder if you have to be from Texas to appreciate this film. No, you don't! It's a fascinating slice of American life that I think is insightful to anyone. It would also be a great film for people from overseas to learn something about middle American culture. This movie follows 20 people in their attempt to win a pickup truck. What I loved about this film is that (a) even that there's no action sequences with special effects, the film has a wonderful sense of tension and suspense, due largely to (b) the fact that the director doesn't just turn the camera on and expect magic to happen, but managed to interview a number of the contestants before hand and really get into their heads via some well done interviewing and editing. This film has some wonderful psychological portraits, which make the suspense heightened as you wait to see how the contestants hold up over the very long wait. While I watched this, I was sort of reminded of the Dogma 95 resolution, to only use hand-held cameras and available situations, so that the story and the acting are what stand out, not \"movie magic.\" By those standards, this film measures up quite well -- and it's not even fiction!",
         "Hollywood could not have made a thriller this compelling. This was the first \"sports\" movie I have ever seen where you couldn't predict the ending of the film after the first five minutes. I watched the film on video with about four others in my family. We were practically sitting on the edge of our seats near the end and we were all rooting for a different person. All of the characters were classic and the ending was perfection. This is truly a great film.",
         "I'm sure you've read enough of the other reviews to understand the story, so I won't go back over that. I simply wanted to add that this story is \"deep\". It is one of the most human and moving and exciting and funny documentaries I have ever seen. The movie in many ways transcends its limited scope and gives us glimpses into human nature that are truly universal. We see friendship, anger, sacrifice, jealousy, hope, pettiness, faith all arise from such a simple contest. The ending is so perfect that it'll bring a tear to your eye. To quote Benny, the sage of the film, \"It's a human drama thing.\" Absolutely.",
         "Benny Perkins, the man who won a truck before and comes back to try the contest a second time, is a genuine cowboy genius. His opinions on the contest and his philosophy of life are inspirational. Maybe the reason Benny's thoughts made it into the film is that he gave a sit-down interview. Most of the other interesting action of the film happens off-screen, because Bindler and the other film makers failed to capture it. They miss people cheating in the contest, they miss Benny deciding to drop out, they even miss the most vital moment of the contest, when the first runner-up takes their hand off the truck. Bindler also uses choppy, melodramatic, and extremely repetitious editing techniques. While this is a great subject for a documentary, and there are many fascinating people, especially Perkins, in the contest, Bindler fails to make a film to do th",
         "Hands On A Hard Body is a documentary about a contest where a handful of people compete to win a truck by standing for as long as they can. They must have at least one hand one the truck at all times and are not allowed to lean or bend over. The last one left after all others have given up wins the truck. These contests can last for several hours, some even going for days, and are one of the greatest tests of someone's patience, endurance, and willpower. To be honest, I didn't expect much going into Hands On A Hard Body; in fact I expected to be bored out of my mind. As the film opened and the first few shots came across the screen I was fully prepared for a potentially mind-numbing 98 minutes. What I didn't prepare for was that I might have a great time watching it. As the film rolled on and I started to learn about the contestants I was surprised to see that I was actually rooting for some of them, and then I realized something I could have never prepared myself for: I was actually enjoying the movie. I'm not usually a fan of documentaries because they depict real-world events and, to be completely honest, I don't enjoy reality. I like watching movies with original stories because I am given the opportunity to escape the dullness of everyday life and be taken to another, more exciting world. I especially enjoy a movie with an engaging story that absorbs me into its world and lets me get to know the characters because their struggles become my own, taking me away from my boring reality and drawing me into a more interesting one. Because documentaries are a depiction of reality I prefer to avoid them and watch the latest blockbuster instead. Hands On A Hard Body, however, is a rare documentary. From when the first contestants started dropping out to when the final few were fighting with all of their might I was on the edge of my seat, as if I were watching a blockbuster rather than a documentary. You got to know each contestant, decide which ones you liked or disliked, and then rooted for the ones that won you over, sharing in their struggles as you saw them strive and suffer to win that truck. There was one contestant in particular that I really identified with. As the film went on I was so absorbed into the story that I wanted to see this contestant win more than anything but was ultimately disappointed when they were not victorious. However, despite their loss I enjoyed every minute I spent with them. I wish there were more documentaries like Hands On A Hard Body, but not just because I want to be entertained; I want to be reminded that life is not always as dull as I think it is. Hands On A Hard Body showed me that there are moments when life is free of all stress and responsibilities, feeling less like a documentary and more like a summer blockbuster."
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "Idea Entertainment",
         "J.K. Livin Productions",
         "Wessex Entertainment Group"
      ],
      "summaries": ["Twenty-four contestants compete in an endurance/sleep deprivation contest in order to win a brand new Nissan Hardbody truck. The last person to remain standing with his or her hand on the truck wins. An absurd marketing gimmick at first glance, the contest proves to be much more..."],
      "budget": 0
   },
   "movielensId": 2330,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-06-01",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["S.R. Bindler"],
      "runtime": 98,
      "movieId": 2330,
      "title": "Hands on a Hard Body: The Documentary",
      "mpaa": "PG",
      "actors": [""],
      "imdbMovieId": "0116481",
      "originalTitle": "Hands on a Hard Body: The Documentary",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Hands on a Hard Body: The Documentary is a 1997 film documenting an endurance competition that took place in Longview, Texas. The yearly competition pits twenty-four contestants against each other to see who can keep their hand on a pickup truck for the longest amount of time. Whoever endures the longest without leaning on the truck or squatting wins the truck.",
      "tmdbMovieId": 18603,
      "avgRating": 4.06705,
      "releaseYear": "1997",
      "numRatings": 865,
      "posterPath": "/vm3BFvPCz498WfuNrDclxSYTruU.jpg"
   }
}