{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0158493",
      "video": false,
      "title": "Belly",
      "recommendations": [
         19848,
         22067,
         19092,
         8291,
         14017,
         20322,
         22314,
         13408,
         28121,
         36923,
         16136,
         14469,
         28353,
         14805,
         10611,
         13815,
         39349,
         21301,
         10952,
         29461
      ],
      "backdrop_path": "/A56gbpeOsgWkM6VINQsh1E3n6we.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tommy 'Buns' Bundy",
               "gender": 2,
               "credit_id": "52fe452a9251416c7504de73",
               "name": "DMX",
               "profile_path": "/eoAfTjFs6SiXGBmdlfasb0J9fHw.jpg",
               "id": 21355,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sincere",
               "gender": 2,
               "credit_id": "52fe452a9251416c7504de77",
               "name": "Nas",
               "profile_path": "/yharVnp5e77FMj7qBBZ3AYkQm6.jpg",
               "id": 104779,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe452a9251416c7504de7b",
               "name": "Hassan Johnson",
               "profile_path": "/1HqCWMiN5KkSMmkWCTmfzix4Gyx.jpg",
               "id": 91508,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kisha",
               "gender": 1,
               "credit_id": "52fe452a9251416c7504de7f",
               "name": "Taral Hicks",
               "profile_path": "/rjWkC2Yi9UuMkPKu6BNkQNroHIl.jpg",
               "id": 17919,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tionne",
               "gender": 0,
               "credit_id": "52fe452a9251416c7504de83",
               "name": "Tionne Watkins",
               "profile_path": "/wiSLqcA481SX0SA1c3IrMO9UYou.jpg",
               "id": 104780,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Knowledge",
               "gender": 0,
               "credit_id": "52fe452b9251416c7504de9f",
               "name": "Oliver 'Power' Grant",
               "profile_path": "/xPynR09zYELLpbiqvb3xVKGMOvC.jpg",
               "id": 1107016,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Lennox",
               "gender": 0,
               "credit_id": "52fe452b9251416c7504dea3",
               "name": "Louie Rankin",
               "profile_path": "/3xItFtl7dX4CO0JJGIqPy7AQNL3.jpg",
               "id": 75838,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "LaKid",
               "gender": 0,
               "credit_id": "52fe452b9251416c7504dea7",
               "name": "James Parris",
               "profile_path": "/sZSKXdNJU4pwNaT5pwTyoDXSUgQ.jpg",
               "id": 176824,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Shameek",
               "gender": 2,
               "credit_id": "52fe452b9251416c7504deab",
               "name": "Method Man",
               "profile_path": "/3LXIZTItw2fnA8gdBLJPLXg0DEC.jpg",
               "id": 5384,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe452b9251416c7504deaf",
               "name": "Kurt Loder",
               "profile_path": "/9qv1vFWudb7N3HrS4Tk228EwCwo.jpg",
               "id": 151361,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe452a9251416c7504de89",
               "name": "Hype Williams",
               "profile_path": null,
               "id": 139874,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe452b9251416c7504de8f",
               "name": "Anthony Bodden",
               "profile_path": null,
               "id": 233448,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe452b9251416c7504de95",
               "name": "Nas",
               "profile_path": null,
               "id": 233449,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe452b9251416c7504de9b",
               "name": "Hype Williams",
               "profile_path": null,
               "id": 139874,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58b9b6e0c3a36866b700cea6",
               "name": "Malik Hassan Sayeed",
               "profile_path": null,
               "id": 1614965,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.123087,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12888,
      "vote_count": 50,
      "budget": 0,
      "overview": "Tommy Brown and Sincere are best friends as well as infamous and ruthless criminals and shot-callers in the hood. Respected by many but feared by all.  As the police are closing in on them and new players are looking for a come up, will their reign last?",
      "similar": [],
      "original_title": "Belly",
      "runtime": 96,
      "poster_path": "/od6CFLhqaSmOMeFuqVPC6ZEU4Fi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Artisan Entertainment",
         "id": 2188,
         "origin_country": ""
      }],
      "release_date": "1998-11-04",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Money, power, respect... but who's got your back?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Jamaica",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hype Williams"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Anthony Bodden",
         "Nas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0158493/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwOTE1MTc1N15BMl5BanBnXkFtZTcwMjI0MTUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Nas, DMX, Taral Hicks | See full cast and crew »"],
      "reviews": [
         "Please disregard the above review. Either the viewer likes being spoon-fed his films, or was not paying attention. Note that the viewer didn't even attempt an understanding of the title \"Belly,\" which was the central theme of the film. The viewers others comments can stand for themselves. In all honesty, the first time I watched this film, I actually turned the volume down -- I was enraptured by the way each scene was composed on the frame. Visually, this movie is stunning. The director has a striking style, and besides that, he is PRODIGIOUS -- there appears to be no end to the ways that he can make his compositions rich in visual entertainment and information. I can enumerate a list of techniques he used here, but that will be an exercise in boredom for today's cyber-nauts. Even more important, the compositions are never created for their own sakes, which was my initial criticism the first time I saw it -- they really do propel the film. The style is integral to the story. Get the film and you will see what I'm referring to; if you disagree, say so in your review. 80% of the film seems to be a riff on the hip-hop video aesthetic (never mind the fact that the director greatly defined the recent shape of this aesthetic) and myth. In it's third act, however, it uses the very same conventions -- outlaw figures, ostentatious style, and violence -- to confront and question these aesthetics. In the climactic ending, this criticism is embodied in the confrontation between one of the heroes of the film (DMX) and a figure symbolic of actual figures from black history. The director actually used an anachronism to face down a contemporary hero, and argues for the relic. What the film argues for, as embodied by the final speech of the Minister character, is a message so powerful and relevant -- particularly to the very people who will associate themselves the most with this film -- that it will leave you breathless. It is a timeless message passed down from antiquity, framed by the most daring and contemporary of directors. It is an exhilarating juxtaposition. What of the title, \"Belly?\" A belly is what a pregnant woman has; it is the external shape of soon-to-be-born child. It is the womb, the source of life. It is the promise of what is to be, as well as the origins of what is. If you abstract it, it's shape will be that of a circle - the symbol of wholeness, of the journey to individuation. It is the same difficult journey that the movies' anti-heroes take. BELLY is a powerfully visual, yet simple tale about redemption. Not to be missed.",
         "I really get p***ed off at movie critics sometimes. This is one of those times. I have insomnia, see what's on TV, check the rating (1 star out of 4) and almost pass it by, but decide to watch it for the camp value. Why did critics hate this? Why do they in general hate movies like this? The film immediately reminded me of \"The Harder They Come\", \"Pusher\" (Nicolas Winding Refn's fantastic Danish film), \"Laws of Gravity\", \"Kids\", \"Clerks\", \"Mean Streets\", \"Zebrahead\", \"The Killing of A Chinese Bookie\", \"Boogie Nights\", \"Rome, Open City\" and \"The Bicycle Thief\". Why does it seem that film critics love neo-realism if its 'white', but usually hate it otherwise. If you're a fan of these kinds of movies, give this one a chance. Unfortunately, with the unfavorable judgment from up on high that this film received, I doubt anyone will read these words. Darn critics. I don't usually insinuate things like this, but I have to wonder if a racial aspect is at play here, that maybe xenophobia deflected a lot of critics from giving this one a chance. Oh well, I loved it in any case.",
         "I expected \"Belly\" to be a self-indulgent, expanded version of the gangster rap videos that gave Hype Williams the power in Hollywood to make a feature film. I was right, but what I didn't expect was for it to be so good. I was mesmerized by \"Belly\" from the opening sequence of choreographed violence and music. Critics of this film should look to its film roots - film noir - movies that grow from the underground crimeworlds in America, that pleasure us with their money schemes, guns, and drug use. \"Belly\" has this, and more style than I have seen in any movie in recent years. It has dazzling visuals, and a respectable plot that borrows from \"Scarface\" among others. The acting is respectable, and I didn't see the movie as a piece of media to exploit the careers of its stars, I found it to be a good piece of cinema that legitimizes Nas, DMX, Method Man, Taral Hicks, and Tionne Watkins as actors. The music is great, notably the D'Angelo's \"Devil's Pie\" that shows crime being played out. The cinematography is stylized and beautiful. The dancing in Jamaica, the shootout in the strip club in Omaha, the opening sequence, the climax with the reverend where the issues that the film may be exploiting are addressed and in my eyes therefore considerate. Its a shame this film was so overlooked by critics. I think within it lies the future of both the gangster movie and the musical.",
         "When I first saw the preview for BELLY, I thought it was going to be another one of those violent and predictable gang banger movies. But Belly is way more than just a rap video/gang banger movie. Yes, the elements of both are there which only add to an even better storyline. Because Hype Williams is a director of music videos helps him incorporate those styles into the film which are unbelievable. Although it may not seem so, the acting by DMX, Nas, and Method Man was real and well done. Unlike many other films of its genre, BELLY actually maintains a positive message throughout the film and gives a sign of hope rather than doom. The combination of superb camera work, slammin soundtrack, and complex story made it a must-see in my opinion. It does contain endless scenes of numbing violence but that only adds to the strong reality of the film. I hope to see more from Hype in the future, looking forward to it!",
         "Despite any other negative reviews I truly enjoy this movie! The plot line parallels Scarface very closely but is done in such a different way that the movie has a feel of its own. The acting is excellent, and not just for rappers. All the performances in the movie can hold their own without any pretext. The plot in fast paced and intricate with twists, turns, ups and downs. The language is graphic but not unrealistic for the type of characters portraited. All in all this movie is entertaining from start to finish and all of my friends that have watched it with me have enjoyed it (even those that don't like rap at all). 8 out of 10",
         "First off this is one of those movie where you either hate it or love it. I loved the movie. I found it to be one of the better urban movies to come out in the 90's not better then boyz n da hood or menace II society. But It was the best one that centered around life in New York's crime underworld. I also think it's DMX's best movie so far. The movie is stylishly filmed by Director Hype WIlliams and the characters are extremely realistic. The dialog is also realistic. The movie might fall short when it comes to how the plot is set up and the overall development of the characters. That is not to say that the movie doesn't have an overall significant meaning because it does. It addresses some of the problems that face inner city youth today. Most people that don't like this movie fail to realize this fact. The minister character in the movie is not important but rather what he is saying is. With that said I feel that the movie takes bold steps to show how certain ways of life are wrong and why they should be changed. The movie is also not your typical crime/drug movie however it does have some of those moments that could have been rethought to be a bit more interesting. With all that said I recommend the movie to be at least watched once because if nothing else the movie does have a great soundtrack and decent plot.",
         "Many will say that this film is \"Too much like a music video\" and in many regards it is. However this movie has many strong points, mainly it's beautiful visuals, the heart-pumping soundtrack, and it's overall lasting power. Visually this movie is amazing, the deep colors and reflective surfaces give it a fairy tale appearance. Although this style has been done since (i.e;Traffic), in Belly it works well. This visual presentation does not carry the whole movie though. The story line is decent (Think Scarface, or Blow) it is nothing that has not been done before. Although with belly you don't have any remorse for the main character as you do with tony montanya. This film is great on a big plasma TV with surround sound. on a tiny TV with built in speakers...it is lame.",
         "when I read the reviews,I thought that maybe I should'nt see the movie,but I was desperate to rent it since DMX was in it.When I finished watching the movie,I thought that the people were full of crap.This movie was a great example of real life and it had a very good and touching ending.10/10",
         "This movie was very very interesting. It grabs people in to watch more of it. It is bold and a Hype has scored high with this film. I have seen many gangster movies but this one falls in the catagory with boys in the hood. People who did not under stand it, Watch it Again and AGAIN!",
         "I can't really give you a plot outline for the film, since I was beating myself in the face with a blunt object every ten minutes. Although, I can tell you the little bits that I got from it. Two gang members are living the high life, with sex, booze, drugs and money. Soon they both realize that they are heading down the wrong path, one wants to go back to Africa to get in touch with his roots, and tries to convince his girlfriend to join him, while the other gets all religious. I was told to watch this film because it was, and I'm quoting, \"The Black Scarface\". Let me say that this is not anywhere near the calibre of Scarface. The one and only way I can ever see someone making this strange comment would be because in one particular scene, they directly ripoff Scarface. It involves a man who is on drugs seeing on video cameras strangers entering his house. He grabs guns and then goes on a killing spree. Exactly like Pacino in Scarface. The guy doesn't even make it out alive, he dies, like Pacino from behind. Nothing in this movie is worth commenting on, I'm hurting right now trying to write this review because I have to think about the film. Why is it that rappers think they can have an acting career? LL Cool J can pull it off because he is actually decent at acting. The people involved in Belly give Busta Rhymes a run for his money as worst rapper actor. DMX, who is in random martial art flicks (Cradle to the grave, Exit Woods) is playing the exact same character he does in every other movie. Seen one, seen them all. Nas for some random reason wants to go back to Africa in the film, I found myself on the floor in tears, both fro laughter and sadness. I don't think he raises his voice once in the entire movie. Hype Williams, is a music video director. He directs rap videos, which is evident here because this movie is just one big overly long rap video. If Williams were to have more films under his belt, he may be able to reach Uwe Boll's credibility. Yes, this movie is worse then House of the Dead, or even Alone in the Dark. I rank Belly as the second worst film I have ever seen, the worst goes to the atrocious Carnivore. There is no substance to Belly, it tries to be all style. The opening sequence isn't ALL that bad, but it isn't good either. My entertainment level went from mediocre to negative zero after the first robbery. It never recovered and I'm kind of ashamed to admit I've seen this trash. Belly gives Showgirls and The Matrix Revolutions a run for their money for the worst sex seen in cinema history. It's over before it begins and you can't make out what is even going on. With a horrible script and director that has no credit to his name, you'd think the movie would be bad...but this goes beyond that. It's as if when the director had nowhere else to go with the movie he would throw in random shootout scene, simply to add more minutes to the already too long running time (which isn't even that long, but it sure as hell seems like it). Nobody in the cast makes an effort to entertain us or even try to be remotely believable. Here's a suggestion for Williams and his future film making, if there is any future film making. Get real actors, not your friends. Also, try filming a movie with a decent script that is easy to follow. Belly goes all over the place with random events. More then once I was sitting there wondering who this person was and why they are on the screen. So if you happen to see this sitting on the shelf at your local video store, do yourself a favour and rip out your eyeballs for even looking at the box cover. The only thing that this is good for is taking a bat to it, or flushing it down the toilet, maybe even leaving at a friends house in hopes it will never come back. I was haunted in my dreams the week after watching Belly and every now and again I get a headache when someone mentions the film. I'm taking Tylonol Extra Strength right now finishing this review up. Let's just hope the so called sequel never sees the light of day."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": ["Big Dog Films"],
      "summaries": [
         "Tommy Brown and his friend Sincere are gangsters who have learned how to make a good living by dealing drugs and pulling armed robberies. Tommy and Sincere have been able to move out of the ghetto in Queens where they were raised and relocate to an upscale section of Manhattan; they would seem to have it made, but both realize that their lives are headed toward a dead end. Sincere begins getting in touch with his African roots and tries to convince his girlfriend Tionne that they should emigrate to the Motherland, while Tommy has a religious awakening and joins the Nation of Islam.",
         "A pair of vicious black gangsters have spiritual awakenings."
      ],
      "budget": 3000000
   },
   "movielensId": 2332,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-11-04",
      "dvdReleaseDate": "2004-01-20",
      "directors": ["Hype Williams"],
      "runtime": 96,
      "movieId": 2332,
      "title": "Belly",
      "mpaa": "R",
      "actors": [
         "DMX",
         "Nas",
         "Hassan Johnson",
         "Taral Hicks",
         "Tionne Watkins",
         "Oliver 'Power' Grant",
         "Louie Rankin",
         "James Parris",
         "Method Man",
         "Kurt Loder"
      ],
      "imdbMovieId": "0158493",
      "originalTitle": "Belly",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["VPEVkNCr00M"],
      "plotSummary": "Tommy Brown and Sincere are best friends as well as infamous and ruthless criminals and shot-callers in the hood. Respected by many but feared by all.  As the police are closing in on them and new players are looking for a come up, will their reign last?",
      "tmdbMovieId": 12888,
      "avgRating": 2.95192,
      "releaseYear": "1998",
      "numRatings": 208,
      "posterPath": "/od6CFLhqaSmOMeFuqVPC6ZEU4Fi.jpg"
   }
}