{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0155753",
      "video": false,
      "title": "I'll Be Home for Christmas",
      "recommendations": [
         40688,
         13962,
         42580,
         26386,
         26441,
         9446,
         12312,
         39128,
         11164,
         40490,
         34600,
         14819,
         10371,
         17207,
         14709,
         11317,
         17834,
         16723,
         12559,
         20726
      ],
      "backdrop_path": "/2fP8yZHl3FxJUouMCTBqTnSUrno.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Jake Wilkinson",
               "gender": 2,
               "credit_id": "52fe47019251416c7508ac13",
               "name": "Jonathan Taylor Thomas",
               "profile_path": "/1S8DpfNv6iiQRuKFPtb5u6sCQ5G.jpg",
               "id": 53283,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Allie",
               "gender": 1,
               "credit_id": "52fe47019251416c7508ac17",
               "name": "Jessica Biel",
               "profile_path": "/34c4S8IX9JQPoEAMJ4o5FTVbzM1.jpg",
               "id": 10860,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe47019251416c7508ac1b",
               "name": "Adam LaVorgna",
               "profile_path": "/hynib27Gn37y1gMvz2zUrvs7VtH.jpg",
               "id": 56487,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Jake's Dad",
               "gender": 2,
               "credit_id": "52fe47019251416c7508ac1f",
               "name": "Gary Cole",
               "profile_path": "/cqsNC0LRZZz2k1dbgIcGITQ4DZN.jpg",
               "id": 21163,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Carolyn",
               "gender": 1,
               "credit_id": "52fe47019251416c7508ac23",
               "name": "Eve Gordon",
               "profile_path": "/ijna7rHzJzzPyRDeMxK1xKLN1k5.jpg",
               "id": 23706,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tracey Wilkinson",
               "gender": 1,
               "credit_id": "52fe47019251416c7508ac27",
               "name": "Lauren Maltby",
               "profile_path": "/ugWWqnkkO58teeZxHr3f2KJfLbM.jpg",
               "id": 81170,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Officer Max",
               "gender": 2,
               "credit_id": "52fe47019251416c7508ac2b",
               "name": "Sean O'Bryan",
               "profile_path": "/doVNkZLo1aqfRVfUymkjuTpyUYa.jpg",
               "id": 33836,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Tom Tom Girl Gloria",
               "gender": 1,
               "credit_id": "557f6c309251412f1d000394",
               "name": "Kathleen Freeman",
               "profile_path": "/wdNFoCWk58bgTRxoqPV8uN9UoGO.jpg",
               "id": 7210,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Ethan",
               "gender": 2,
               "credit_id": "5a25834c92514103390dc893",
               "name": "Boyd Banks",
               "profile_path": "/mDsIaLKyGqyV1Nt0pV9joGkQNSP.jpg",
               "id": 20196,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47009251416c7508ac03",
               "name": "Arlene Sanford",
               "profile_path": "/dHPhsNnybFnfNsWXYVPZkrZC4OF.jpg",
               "id": 15042,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47009251416c7508ac09",
               "name": "Tom Nursall",
               "profile_path": null,
               "id": 66566,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47019251416c7508ac0f",
               "name": "Michael Allin",
               "profile_path": "/hognyG15sTfJ41ZNPgkDvMnHTUZ.jpg",
               "id": 33314,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "56521840c3a368070a00b750",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.500085,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17037,
      "vote_count": 77,
      "budget": 30000000,
      "overview": "Estranged from his father, college student Jake is lured home to New York for Christmas with the promise of receiving a classic Porsche as a gift. When the bullying football team dumps him in the desert in a Santa suit, Jake is left without identification or money to help him make the journey. Meanwhile, his girlfriend, Allie, does not know where he is, and accepts a cross-country ride from Jake's rival, Eddie.",
      "similar": [
         9479,
         634,
         10872,
         51052,
         11395,
         13673,
         11881,
         1581,
         1585,
         10147,
         13377,
         18147,
         17979,
         287903,
         5825,
         5255,
         8871,
         10719,
         112160,
         858
      ],
      "original_title": "I'll Be Home for Christmas",
      "runtime": 86,
      "poster_path": "/j8fIMRp8SHSzCGPaoaFSIVNrsiE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1998-11-12",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Somewhere between L.A. and N.Y. Jake found the meaning of Christmas.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Arlene Sanford"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Tom Nursall",
         "Harris Goldberg"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0155753/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNjkwNDkwOF5BMl5BanBnXkFtZTcwMjM5NTUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jonathan Taylor Thomas, Jessica Biel, Adam LaVorgna | See full cast and crew »"],
      "reviews": [
         "Well, I'd give this a 6 out of 10 because I love Christmas, but really the plot was fairly thin and wasn't this same idea run through in John Hughes \"Dutch (aka Driving Me Crazy) - kid doesn't want to go home (for Thanksgiving in that movie), but then he has all sorts of adventures on the road on his way home and learns his lesson, etc, etc. The only problem with this movie is that, unlike \"Dutch\", I honestly didn't feel that JTT had learned his lesson at all, he was still a scam artist at the end. Disney should really learn some lessons from John Hughes / Chris Columbus, they really know how to make a kids live-action movie! I was so disappointed because it sounded like a really fun idea, but turned into the plot of a so-so TV movie. It's worth seeing, but go on cheap Tuesday, or with free tickets, you'll feel less ripped off!!",
         "Jonathan Taylor Thomas plays Jake, a college student in California who hasn't come home to New York for the holidays since his father remarried. The father makes Jake a deal he can't refuse: get home by 6 p. m. Christmas Eve, and he can have the Porsche they rebuilt together. One problem: Jake helps some athletes cheat on a final exam, but his plan is sabotaged, and 'Eddie and the boys' leave him in the desert wearing a Santa suit, with nothing but a note they signed. Eddie sets out to take Jake's girlfriend home. Jake calls her but there is a problem with her answering machine. Jake calls home for help but he has lied and schemed too many times before. It is his ability to lie that gets him on the road making progress toward his goal, but also into new jams. He sees Eddie several times (what are the chances?) but his girlfriend doesn't see him until the fourth time, and that doesn't turn out well. Of course, Eddie and Jake's girlfriend don't get along too well in their travels east. It's a fun film if not great. Jake helps several people, including himself, learn the true meaning of Christmas. Lots of great scenery in the first half of the movie, and a lot of the music is good, with styles including jazz and bluegrass. And the situations Jake gets himself into are quite funny. Have you ever seen a 5K race where all the entrants are dressed like Santa? It's a family film with a little off-color humor (I saw the edited version, so no bad language to speak of).",
         "rules are all very well and good, but why should I have to write at least 10 lines about a movie when others have extensively critiqued it already, and all I want to do is disagree with the bad reviews? Sheesh. I almost didn't watch this film, after reading some of the comments here, but as it was on TV and I had nothing better to do, I ignored the bad reviews and was glad I did. Sure, it is lightweight and the plot is a bit far-fetched, but so what? It is a Christmas movie, folks, nothing more, nothing less. Jonathan Taylor Thonas strikes just the right note as a college student trying to get home for Christmas, and learning to shed his selfish, self-centered attitudes as he does. There were some genuinely funny moments, a lot of touching moments, and the only fart joke I have ever laughed at. The great scenery (parts of BC and Alberta pretending to be various locations in a cross-country race across the USA) added to the enjoyment of the film. I was just going to say \"Ignore the bad reviews, I liked it\" but I had to pad it out . IMDb, don't you know that brevity is the soul of wit?",
         "'Couldn't stand this film. First of all, it's star: Jonathan Taylor Thomas. Remember when he used to be a cute kid who was good in everything he did? But fate played a horrible joke on him: He grew up. He got bigger, he is no longer cute, and worst of all, he's lost his trademark voice!! It's gotten deeper and more wise allecky. He was cute when he was young, but now he grew up into an UNFUNNY, unloveable being. He can sort of relate to Macaulay Culkin. Only difference: Jonathan's Dad isn't crazy! (That's not for sure because I don't know the man). About this film. Thomas plays Jake, a smartass college student who always wheels and deals and get's into trouble. Now Jonathan was 17 when he made this movie, so it's very unbelieveable that he could be a college student. He has a ditzy girlfriend, who in my opinion, is not that hot! But Jake is crazy about her. But one day he get's into trouble and they glue a Santa suit to him??? And leave him in the desert for dead. Meanwhile he had made a deal with his parents that if he's home by Christmas, Dad will give him the car he and Jake used to work on. So Jake breaks his back trying to get home to New York. Always running into trouble with UNFUNNY results!!! What is more, Jake's girlfriend is riding with an idiot named Eddie. I hate those two. (NOW THIS REVIEW MAY HAVE A SPOILER OR TOO, FOR THOSE OF YOU WHO HAVEN'T SEEN THIS MOVIE. NOW IT MAY SPOIL IT FOR YOU, BUT HEY, NOBODY'S FORCING YOU TO READ THIS) Now after all the hassle, Jake returns home and decides he doesn't want the car. Whoever wrote this movie deserves to be kicked in the face! Just like the people who acted in it! Jonathan Taylor must have a bad agent! That creep wouldn't even do the final episode of Home Improvement!!! Like many other actors, Jonathan Taylor Thomas is washed up! I guess Disney figured if they did a Christmas movie with Tim Allen, why not do one with Jonathan? Only difference: Tim Allen was actually good in his Xmas movie. What JTT should do is give up acting all together and actually do something with his life. He could write and direct movies! He could become a doctor, or something, help this screwy world. Acting is not a good perfession to go into. Because let's face it, movies and TV are not exactly keeping us alive. In conclusion, don't see this film! It's predictable right down to the last second! So go watch another Xmas movie, like The Grinch! Jonathan Taylor Thomas, persue a better career! Thank you. And Happy Holidays! -----------",
         "i like this film because the whole IDEA of it was to make it home on time for Christmas in order for Jake to be given the Porsche. now I've seen some of the other comments given about this film...its JUST A MOVIE. i think who ever wrote it was just trying to make a point to their story and for people to understand that it didn't matter about the Porsche or getting home by six O'Clock. it just mattered that you got home and spent it with the family. thats what i think the writer and director was trying to show. this film is good for a holiday movie. i would suggest this to any family who spend holidays together and looking for a film thats funny and has humor in it.",
         "Quite frankly, I am in shock. The worst theatrical movie I have ever watched is currently \"Cruel Intentions,\" but today I watched \"I'll Be Home for Christmas,\" expecting a funny holiday movie, but instead I got cinematic trash that gave \"Cruel Intentions\" a run for the money as worst theatrically released movie ever. Every scene, every joke, every situation, and every main character is loathesome. The entire movie is one big insult to the intelligence. Surely someone involved with this project should have realized what a tragic mess they were making and said something to put a stop to it. But alas it was not to be. *Minor spoilers herein* Instead we are treated with an insufferable comedy centered on a totally obnoxious and arrogant rich kid. I wasn't sympathetic to him at all and I didn't buy his transformation for a moment. Nor did I find any of his snafus funny. Every single mishap was an unfunny bomb. I mean, are we supposed to laugh when Thomas consistently lied or stole to get his way? What's so awful about it (aside form the moral standpoint) is that everyone bought his lies. Only an idiot would believe what he said. What about when he gave away stolen appliances to children in a hospital? Worst moment of all (which had me screaming at the television for the madness to stop) involved the bus-liver gag. Thomas uses a sandwich, crayons, and a cooler to make it look like a liver needed to be delivered in a nearby town. But they didn't even bother to show how Thomas obtained these items from the people in the neighboring seats, or why the guy with the cooler didn't realize the liver was in HIS cooler! Anyway, this is hands down the worst Christmas movie I have ever watched. I would love to pick this dog apart, but I seem to get hate mail whenever I trash a so-called family movie, so I'll just leave you with the short warning to avoid this mess at all costs. My Christmas present to you. Humbug! Zantara's score: 1 out of 10.",
         "Don't get me wrong, this is a great movie... But it's not one you can watch over and over.. This movie isn't a Jingle all the Way :) But, if you're in the mood for a christmas movie, watch it, you'll like it. There are some funny parts, not too many serious parts, if any.. But there are some funny things in it.",
         "OK. You can't expect a new \"Miracle on the 34th street\" here. But I like the Christmas season and the movies that are carried on with it. But the most important for me: My 9 yo son laughed a lot.....",
         "I'll Be Home For Christmas Since being home for Christmas is the best present, why can't it be the only present you have to buy your family? Even better, why can't there be a bribe involved like the one in this comedy? When his father (Gary Cole) entices him home for the holidays with a Porsche, Jake (Jonathan Taylor Thomas) and his girlfriend Allie (Jessica Biel) trade in their tickets to Mexico for ones to NYC. But unforeseeable forces separate them: Jake is spirited away on a hitchhiking adventure through the desert dressed as Santa Claus, while Allie is escorted to New York by Jake's nemesis (Adam LaVorgna). On the road, Jake realizes that all of his strained relationships need repairing. Surprisingly heartfelt, I'll Be Home For Christmas is a zany road movie to a fault. However, the travel obstacles faced by Jake are somewhat relatable. Incidentally, most Christmas visitors come bearing gifts of influenza. (Yellow Light) vidiotreviews.blogspot.ca",
         "`Home Improvement' star Jonathan Taylor Thomas stars in this predictable family comedy as a college kid whose father will promise him a new car if he makes it home before Christmas dinner begins. Thomas is in top form, but this should have been a two-part episode of `Home Improvement,' for he had left the show not long before this film was released. The Santa Race is the highlight of the film, but because there is little else here that is entertaining, this movie is only recommended for fans of the teen star. 2 out of 5"
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Mandeville Films",
         "Kyra Productions"
      ],
      "summaries": [
         "A college student experiences difficulty in getting home for Christmas after being hazed by his friends. While struggling to get home in time for Christmas, he learns quite a bit about himself and the true meaning of the holiday.",
         "Jake enjoys college life at his patient, rich father's expense and slickly seduces home town girlfriend Allie on campus. Jake already cashed his ticket home (upstate New York) for two to Cabo, but she refuses a holiday while expected home and father promises him a vintage Porsche if home for Christmas Eve dinner. Jake's rival Eddie, who always had an eye on Allie, finds out and arranges for Jake to miss their appointment so he can offer her a lift, Jake is left in a Santa suit in the desert. Resourceful Jake races against time and fortune, in a sabotage war with Eddie."
      ],
      "budget": 30000000
   },
   "movielensId": 2339,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-11-12",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["Arlene Sanford"],
      "runtime": 86,
      "movieId": 2339,
      "title": "I'll Be Home for Christmas",
      "mpaa": "G",
      "actors": [
         "Jonathan Taylor Thomas",
         "Jessica Biel",
         "Adam LaVorgna",
         "Gary Cole",
         "Eve Gordon",
         "Lauren Maltby",
         "Sean O'Bryan",
         "Kathleen Freeman",
         "Boyd Banks"
      ],
      "imdbMovieId": "0155753",
      "originalTitle": "I'll Be Home for Christmas",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [
         "_78cM5PZtYE",
         "j2NC4KVE99U"
      ],
      "plotSummary": "Estranged from his father, college student Jake is lured home to New York for Christmas with the promise of receiving a classic Porsche as a gift. When the bullying football team dumps him in the desert in a Santa suit, Jake is left without identification or money to help him make the journey. Meanwhile, his girlfriend, Allie, does not know where he is, and accepts a cross-country ride from Jake's rival, Eddie.",
      "tmdbMovieId": 17037,
      "avgRating": 2.58333,
      "releaseYear": "1998",
      "numRatings": 390,
      "posterPath": "/j8fIMRp8SHSzCGPaoaFSIVNrsiE.jpg"
   }
}