{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "sister",
            "id": 5923
         },
         {
            "name": "motorcycle",
            "id": 14735
         },
         {
            "name": "ireland",
            "id": 14985
         }
      ],
      "imdb_id": "tt0120643",
      "video": false,
      "title": "Dancing at Lughnasa",
      "recommendations": [
         79816,
         50225,
         41166,
         69719,
         86676,
         42586,
         15730,
         116014,
         71559,
         41007,
         343725,
         64828,
         84278,
         13681,
         12660,
         40694,
         31875,
         14344,
         91217,
         100017
      ],
      "backdrop_path": "/5hB8hgJkOIJsv1grjIFjzWUMQmW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kate Mundy",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d1e9",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Christina 'Chrissy' Mundy",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d1ed",
               "name": "Catherine McCormack",
               "profile_path": "/a8Jszh3rHQ2T4u1VyE4lXrb0uDI.jpg",
               "id": 2462,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Agnes 'Aggie' Mundy",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d1f1",
               "name": "Brid Brennan",
               "profile_path": "/m63Toyj0Wyv7PmxnjlS8t4wwm4M.jpg",
               "id": 42601,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Margaret 'Maggie' Mundy",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d1f5",
               "name": "Kathy Burke",
               "profile_path": "/vqCHCywlp7HfoKBW6ZzCuQmnJx9.jpg",
               "id": 37759,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Rose 'Rosie' Mundy",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d1f9",
               "name": "Sophie Thompson",
               "profile_path": "/39q6651Z7Ux8xrmRDhbXyOXGRom.jpg",
               "id": 32990,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Father Jack Mundy",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d1fd",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Gerry Evans",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d201",
               "name": "Rhys Ifans",
               "profile_path": "/p0rbwzc4Yj2oHW0iiln0X0Wx9EK.jpg",
               "id": 7026,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Danny Bradley",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d205",
               "name": "Lorcan Cranitch",
               "profile_path": "/5aqVmTXW2hc8b30jcoWKO9YiXHF.jpg",
               "id": 42565,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Michael 'Mike' Mundy",
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d209",
               "name": "Darrell Johnston",
               "profile_path": null,
               "id": 42835,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Father Carlin",
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d20d",
               "name": "John Kavanagh",
               "profile_path": "/3ElWQEcnhi3lgYtbWPVV9EfExdw.jpg",
               "id": 20282,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Vera McLoughlin",
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d211",
               "name": "Marie Mullen",
               "profile_path": null,
               "id": 42836,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Sophie McLoughlin",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d215",
               "name": "Dawn Bradfield",
               "profile_path": null,
               "id": 42837,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Austin Morgan",
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d219",
               "name": "Peter Gowen",
               "profile_path": "/cg8HiiICVTcZDcJBskp4cJfBJhf.jpg",
               "id": 42838,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Chemist",
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d21d",
               "name": "Kate O'Toole",
               "profile_path": "/2zQlFNz9hnQ0V8bx5nnCwcJYgm3.jpg",
               "id": 42839,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d1e5",
               "name": "Pat O'Connor",
               "profile_path": null,
               "id": 19969,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d223",
               "name": "Frank McGuinness",
               "profile_path": null,
               "id": 43621,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d229",
               "name": "Brian Friel",
               "profile_path": null,
               "id": 43622,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d22f",
               "name": "Noel Pearson",
               "profile_path": null,
               "id": 33390,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d235",
               "name": "Jane Barclay",
               "profile_path": null,
               "id": 43383,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4402c3a36847f807d23b",
               "name": "Bill Whelan",
               "profile_path": null,
               "id": 43623,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d241",
               "name": "Kenneth MacMillan",
               "profile_path": null,
               "id": 43624,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4402c3a36847f807d247",
               "name": "Mark Geraghty",
               "profile_path": null,
               "id": 43625,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "52fe4402c3a36847f807d24d",
               "name": "Mary Selway",
               "profile_path": null,
               "id": 668,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4403c3a36847f807d253",
               "name": "Humphrey Dixon",
               "profile_path": null,
               "id": 12759,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.181067,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 5332,
      "vote_count": 12,
      "budget": 0,
      "overview": "Five unmarried sisters make the most of their simple existence in rural Ireland in the 1930s.",
      "similar": [
         8272,
         369557,
         4170,
         8967,
         2288,
         4347,
         858,
         111,
         73,
         334,
         2064,
         97367,
         244772,
         277216,
         11012,
         1116,
         8838,
         12253,
         10054,
         164457
      ],
      "original_title": "Dancing at Lughnasa",
      "runtime": 96,
      "poster_path": "/ewQ7AeXw0ErCWqvRBxX5wHAnFPl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/voYCwlBHJQANtjvm5MNIkCF1dDH.png",
            "name": "Sony Pictures Classics",
            "id": 58,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Bórd Scannán na hÉireann",
            "id": 1898,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Radio Teléfis Éireann",
            "id": 1899,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-04",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Five sisters embrace the spirit of a people.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Pat O'Connor"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "Brian Friel",
         "Frank McGuinness"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120643/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU1MjQyNDc0OF5BMl5BanBnXkFtZTcwODY1NzcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Meryl Streep, Michael Gambon, Gerard McSorley | See full cast and crew »"],
      "reviews": [
         "What distinguishes stage from screen? If a viewer had only Brian Friel's play, `Dancing at Lughnasa' and its cinematic adaptation to judge from, he or she might be tempted to answer that, while stage is highly engaging and meaningful, screen is superficial, insulting, and thin in content. Friel's play is structured in such a way that a film version necessarily provides a fascinating comparison of the two mediums. However, director Pat O'Connor's efforts tend to demonstrate the weaknesses of cinema rather than the strengths. Adapting a play to the screen has often proved to be a tricky business; it involves some pitfalls which this film does not manage to avoid. Screen is extremely literal. It allows for--in fact, often demands-- a sense of realism seldom conveyed on stage. The makers of `Dancing at Lughnasa' are clearly appreciative of this fact, and have made valiant, if not always successful, allowances for it. The primary result of their efforts is a heightened sense of setting. The world these characters inhabit feels real. We get shot after shot of Irish countryside; set and costume design seem perfect for Ireland in the 1930s. Mark Geraghty's production design is one of the best things about this film. Additionally, excellent accent work by all the actors proves perfectly convincing and adds depth to the setting. However, such a literal medium has its drawbacks. In particular, young Michael's narration, which was used to achieve a specific effect in the play, seems unnecessary here. The play's Michael is full-grown and speaks young Michael's lines as his `memories' take place in the action on stage. The film makers did well to recognize that there was no cinematic equivalent for this; having the adult narrator speak the child's lines would have seemed ridiculous. However, in removing that aspect of the narrator's role, they stripped away most of his significance, as well. The film's narrator seems like an afterthought, occasionally intruding into the action to tell us that what we are seeing is a memory. We could easily forget that the events are, in fact, happening in flashback. While some of the abstract elements of Friel's original play do not translate well onto the screen, individual performances are only aided by the medium. Since film is not hindered by the simple vocal requirements of stage, the actors are able to convey much more subtlety of meaning. The players in this film version are, without exception, excellent. Meryl Streep stands out as the proper, reserved Kate. Her manner is nervous and slightly shrill, but conveys genuine concern for her sisters. When Kate opens up and allows herself to dance, Streep shows a joyful abandon which is believable and pleasant to see. Another standout performance is delivered by Michael Gambon in the role of Father Jack. His lines are spoken with calm assurance, betraying Jack's senility only by their complete lack of relevance. Gambon's distant eyes and quiet detachment reinforce the feeling that he exists in a world entirely different from the rest of the family, a point which is absolutely crucial to his character. Supporting characters are also portrayed dead-on. This film has some of the best acting that could have been hoped for. Despite these considerable advantages, the movie runs into trouble when it tries to adapt Friel's plot to the screen. Film is so much more visual than theater that it demands a great deal of variation in order to keep the viewer interested. Since we do not have the benefit of the actors' physical presence, we need other things to hold our attention. In attempting to add variety to the play's structure, screenwriter Frank McGuinness breaks up Friel's original dialogue into smaller scenes, most of which involve household chores. McGuinness also tries to represent some events which the play's dialogue only alludes to. The result is a film which is so fragmented that we lose sight its content. Friel's dialogue is integrally important to his play, and the same is true for the film. However, the way that the film breaks up this dialogue among tiny scenes is extremely distracting. We lose sight not only of the dialogue's meaning, but of the relationships between characters. Since the adapted structure requires that the five sisters rarely appear in the same scene together, it is very difficult to get any sense of the dynamic in the household. Ultimately, so much time is spent with action rather than dialogue that the characters lose a great deal of their depth. Perhaps film makers did not trust their audience to be as interested in the characters as in the events. It is somewhat unjust to evaluate an adapted play simply in light of the original. However, this cinematic version fails to hold up even on its own terms. It is difficult to conceive what value those who have not been exposed to the original play could see in this adaptation. What we get is a good-looking, but ultimately insubstantial, portrait of five women who could all stand to let their hair down a little bit more than they do. I can't help but think that Friel had more in mind than demonstrating the value of letting one's hair down.",
         "This movie was completely wonderful for every single moment. The cast is terrific from top to bottom; the cinematography is gorgeous, even the soundtrack is memorable. It is the type of movie where very little happens, but it does not matter a bit. The characters are intriguing enough to hold your interest. I do not know how Streep does it; I think her talent is limitless. Everyone else is great too. For 92 minutes you will forget everything else and if you can allow yourself, you will be swept away by this movie.",
         "This movie version is pleasant enough but does not have the power of the stage play upon which it is based. Spoilt brat that I am, I saw the original production at the RNT in 1990 with the amazing Alec McCowen as Uncle Jack. I am a great fan of Michael Gambon, but he is simply miscast in that role for the movie. Not so Meryl Streep, who does a superb overpowering aunt. The delightful Catherine McCormack and Rhys Ifans do a good job of the love interest. This is nevertheless a shadow of the stage play. My better half liked it, but had not seen the stage version. For lovers of Irish drama the film is worth 90 minutes of your time.",
         "Watchable but instantly forgettable film of Brian Friel's award-winning play which provides its greatest pleasures through the strong performances of its ensemble cast. Five independent-minded sisters living in Donegal in the mid 1930s face the possibility of change when economic and emotional circumstances conspire against them. The return of their brother from religious missions in Africa signals the beginning, and as the pagan festival of Lughnasa, which celebrates the harvest and forebodes the coming of winter, is celebrated around them, they must come to terms with changes in their own relatively comfortable middle class world. The ten year old son of one of them views events with a nostalgic eye which nonetheless sees the hardship and heartbreak which occurs around him. Despite director Pat O'Connor's valiant attempts to \u0091open out' the play, the film is still extremely theatrical. The inclusion of landscape shots and the restaging of certain scenes in outdoor locations unavailable in the theatre does not really make the film cinematic. It merely adds visuals to what is still a complex series of linguistic exchanges which delineate and explore character. Authentic production design and costuming and the persistent presence of a traditional-themed score by Bill Whelan contribute to the feeling of the film, and with the help of good accent work by the cast, it manages to successfully evoke a feeling of time and place. However it remains an extremely well produced stage play on film, and is still bound by blocking and staging conventions which allow the actors to meet and greet one another to exchange their thoughts and feelings. The closest the film comes to a visual symbolic system is the use of dance and ritual to underscore the social and emotional tensions. The undercurrent of paganism which defines the relationships between people and their sense of the cosmos is constantly evoked (as it was in the play), and the film begins with a credit sequence featuring images of African tribes people in traditional costumes. But other than the climactic dance scene where the sisters celebrate their sisterhood to the strains of ceili music, the film rarely manages to escape the enclosed and cerebral world of the stage version. But paradoxically, the reliance on actors plying their trade on well written words (rather than visuals) is the thing which saves the film from itself. Meryl Streep gives a convincing performance (and manages a creditable accent) as the repressed, authoritarian schoolteacher who heads the female clan, and she is more than matched by Michael Gambon's endearing performance as the slightly baffled priest whose exposure to the customs and rituals of Africa have coloured his perceptions of home. The rest of the cast (the non-stars, so to speak) are equally good, particularly Sophie Thompson as the simple minded Rose and Kathy Burke as the chain smoking Maggie. Catherine McCormack and Brid Brennan (the latter a veteran of the Abbey Theatre production) have less showy roles, but work distinctive characterisations in with those of the others with ease and skill. Supporting male performances from Rhys Ifans and young Darrell Johnston are also good, and the film also comes with a rich voice over provided by Gerard McSorley (who played the part of the the child at an adult remembering in the stage version). This aspect of the film alone is probably worth the time and attention required to view it, but on the whole it is a less rewarding experience than the play itself. While an unfair basis upon which to criticise a work of adaptation, the material was perhaps fundamentally unsuited to cinematic treatment. Though Frank McGuinness has done his best to translate the themes and character issues, and has successfully done so insofar as it applies to theme and character, this is not so much a film version as a film of the play with some additional settings and scenes which prevent it from becoming completely unwatchable. What power it has comes from the power of the play, and it is mostly evinced at the level of verbal discourse. Theatrical adaptation is a minefield for film makers and has produced varying results in the past. Dancing at Lughnasa does not distinguish itself in the annals of this sub-section of film history, but for those patient enough with its lack of genuine cinematic interest, it offers certain pleasures which should pass the time painlessly enough.",
         "Given the luxury of owning films via DVD collections offers the opportunity to revisit at will the works the viewer found worthy of purchase. Such is the case with the luminous 'Dancing at Lughnasa', a 1998 release by director Pat O'Connor to the tunes of a lilting screenplay by Frank McGuinness based on Brian Friel's 1990 play of the same name. Though low key and not a popular hit at the box office, this is one of those rare films that combines a very simple tale about common folks brought to life by a cast of extraordinary actors. The story is set in Donnegal, Ireland in 1936 (just before WW II)choked the world) and simply relates the life of a family of five single sisters and the love child of one of them. The action is spare, centering on the visit of their brother home from the missionary work in Uganda inalterably changed from the experience, on the loss of job of the supporting eldest sister, and the return of the errant father of the love child for the summer, and other daily challenges. The stresses and strains these small events play on the sisters is eventually climaxed in the dancing festival that marks the Feast of Lughnasa (a persistent pagan celebration that challenges the very Catholic foundation of the Irish community), a compelling event that parallels the returned priest brother from the mission fields where he has gained insight into the desperate need for community, happiness, dancing and celebration as the essential needs of humankind. The cast is flawless: Meryl Streep is superb as the elder sister bitterly bound to holding the family together at all costs, Catherine McCormack as the mother of the lovechild, Kathy Burke, Sophie Thompson and Brid Brennan; Michael Gambon as the deranged returned brother; and Rhys Ifans as the errant father of the child. They interact and play like fine chamber music. The brilliantly green and gorgeous countryside is captured eloquently by Kenneth MacMillan. In every aspect of production the film fits like a tightly intertwined puzzle. It simply glows. Revisiting 'Dancing at Lughnasa' is an even finer trip than the first exposure. Highly Recommended.",
         "The acclaimed stage play from Brian Friel has been successfully adapted for the screen in this visual treat from Pat O'Connor. The beautiful landscapes of Donegal do not smother the intelligent performances such as from Meryl Streep (Kate Mundy), Catherine McCormack (Christine Mundy) and Rhys Ifans (Gerry Evans). Those critics who have condemned the movie for being simple and about ordinary people seem to miss the point. This is meant to be a simple story about ordinary people - and that is why it is so moving! More importantly though - 'Dancing at Lughnasa' is also entertaining and really deserved better than the mixed reviews on initial release.",
         "Not since \"Steel Magnolias\" have I seen a film that centralized dynamic female roles on the silver screen. It's rare, if not completely impossible these days that a movie is carried by female characters with male actors as \"supportive\" roles. This film not only does THAT, but does it SUPERBLY. That isn't to say that the male actors were not good in it. I'm merely saying the movie was carried by female roles rather than male ones -- an absolute delight to see. It is by far one of the best films I've seen all year and I recommend it to anyone who is 1. a Meryl Streep fan or 2. craving to see a divine film about extraordinary women.",
         "I wasn't really sure what to expect from this movie, since I had no idea what the play was about or anything. The only actor in the movie I had heard of was Meryl Streep, but that didn't matter because she was the reason I went to see the movie. As always, her accent was pitch perfect, right down to the Donegal vowels. Her performance was also incredible, which deserves some recognition but probably won't get any. The rest of the cast was also wonderful, particularly Sophie Thompson as Rose. If anyone else should get recognition, it should be her because her performance was heart-wrenching and bittersweet. So GO AND SEE IT!!! NOW!!",
         "This is a lovely film with a simple story line: the day to day lives of a family (all women, though one brother who very much counts at least in his ruined optimism) and a (love) child and a father. I found the group very loving and burning deep inside for life to bring them something each wanted. The terminal sadness lay in the fact that none of them were able to rise to a powerful and charismatic persona that conquers the world, which has so often been used in other films (Seldom in plays. They are too real and difficult.) to satisfy our need to live through the character(s) and become a force to be reckoned with. I never read the play (to my chagrin) nor did I see the Broadway show which I recall received much praise, but though I too was saddened as the family structure unravels, I felt it was so true that I had to accept the way the story comes to a close. I didn't view the film with the thought of this family being staunch Catholics, with the fervid strictness imposed on the lives of believers (in that country, particularly). Nevertheless I found the dance (where Danny tries to overwhelm Rose, and thanks to her brother does not succeed) alarming and disquieting, whereas the dance performed by the five sisters was alive with joy and desire-- abandon--which when the music stops, they each fall into self-consciousness at the revelation of their deep feelings. I give the movie a 9 only because I do not have the technical, critical, artistic knowledge to give it the 10 I believe it deserves.",
         "A misfiring film. It has a truly exceptional cast and it is a great disappointment that it can't pack the punch that it promises. My biggest gripe is that we're implicitly promised a big dance set-piece which never materialises. Obviously there is a mitigating dance sequence (which, like all sequences, is well played). The problem is that the family unit needs a sequence where they come, corporately, up against the outside. Whilst the familial tensions, aspirations and fears are played out in a string of scenes revolving around the cottage, the film needs a formal tipping point more critical than the drip-effect of their failing employment. Meryl Streep has been, arguably, the finest female actor in the world for the past decade and it is a great credit to both her and her co-stars that she doesn't overbalance the ensemble. Despite their absorbing performances it doesn't work though - I'd say a fault of writers Brian Friel and Frank McGuiness. 4/10"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Bórd Scannán na hÉireann",
         "Capitol Films",
         "Channel Four Films"
      ],
      "summaries": [
         "A young boy tells the story of growing up in a fatherless home with his unmarried mother and four spinster aunts in 1930's Ireland. Each of the five women, different from the other in temperament and capability, is the emotional support system, although at times reluctantly, for each other, with the eldest assuming the role of a 'somewhat meddling' overseer. But then into this comes an elderly brother, a priest too senile to perform his clerical functions, who has \"come home to die\" after a lifetime in Africa; as well, there also arrives the boy's father, riding up on a motorcycle, only to announce that he's on his way to Spain to fight against Franco. Nevertheless, life goes on for the five sisters, although undeniably affected by the presence of the two men, they continue to cope as a close-knit unit... until something happens that disrupts the very fabric of that cohesiveness beyond repair.",
         "Five unmarried sisters make the most of their simple existence in rural Ireland in the 1930s."
      ],
      "budget": 0
   },
   "movielensId": 2341,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-04",
      "dvdReleaseDate": "1999-06-15",
      "directors": ["Pat O'Connor"],
      "runtime": 96,
      "movieId": 2341,
      "title": "Dancing at Lughnasa",
      "mpaa": "PG",
      "actors": [
         "Meryl Streep",
         "Catherine McCormack",
         "Brid Brennan",
         "Kathy Burke",
         "Sophie Thompson",
         "Michael Gambon",
         "Rhys Ifans",
         "Lorcan Cranitch",
         "Darrell Johnston",
         "John Kavanagh",
         "Marie Mullen",
         "Dawn Bradfield",
         "Peter Gowen",
         "Kate O'Toole"
      ],
      "imdbMovieId": "0120643",
      "originalTitle": "Dancing at Lughnasa",
      "genres": ["Drama"],
      "youtubeTrailerIds": [
         "z7Crz4124e8",
         "I6zdcNcxNwU"
      ],
      "plotSummary": "Five unmarried sisters make the most of their simple existence in rural Ireland in the 1930s.",
      "tmdbMovieId": 5332,
      "avgRating": 3.2116,
      "releaseYear": "1998",
      "numRatings": 319,
      "posterPath": "/ewQ7AeXw0ErCWqvRBxX5wHAnFPl.jpg"
   }
}