{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "anarchic comedy",
            "id": 236316
         }
      ],
      "imdb_id": "tt0116488",
      "video": false,
      "title": "Hard Core Logo",
      "recommendations": [29642],
      "backdrop_path": "/uuBSWCslVIVSxhkXctLfUqN8roA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Joe Dick",
               "gender": 2,
               "credit_id": "52fe4420c3a368484e010da1",
               "name": "Hugh Dillon",
               "profile_path": "/hwA4QTkxPGRf3pWWd4a9E08mWuR.jpg",
               "id": 67704,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Billy Tallent",
               "gender": 2,
               "credit_id": "52fe4420c3a368484e010da5",
               "name": "Callum Keith Rennie",
               "profile_path": "/80DeOyHJPv44RUYW7tpEpINv7sX.jpg",
               "id": 540,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Buck Haight",
               "gender": 2,
               "credit_id": "52fe4420c3a368484e010da9",
               "name": "Julian Richings",
               "profile_path": "/ia2Xo99pxLX3sxZ0jVcj7eai56l.jpg",
               "id": 2320,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "539596a70e0a266dbb0067ea",
               "name": "Bruce McDonald",
               "profile_path": "/kDGPKUd7bKNsxvQ5UwvClP9FpQ8.jpg",
               "id": 55189,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55464806c3a3680cd5007066",
               "name": "Kevin Fair",
               "profile_path": null,
               "id": 1362798,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.995708,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 21589,
      "vote_count": 9,
      "budget": 0,
      "overview": "Bruce Macdonald follows punk bank Hard Core Logo on a harrowing last-gasp reunion tour throughout Western Canada. As magnetic lead-singer Joe Dick holds the whole magilla together through sheer force of will, all the tensions and pitfalls of life on the road come bubbling to the surface.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         8810,
         948,
         298312,
         14433,
         4771,
         4638,
         12162,
         769,
         68,
         185,
         949,
         205,
         8923,
         241
      ],
      "original_title": "Hard Core Logo",
      "runtime": 92,
      "poster_path": "/xh9pDoIMztITSSaXz3Gnkcwz8NR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Terminal City Pictures",
         "id": 3981,
         "origin_country": ""
      }],
      "release_date": "1996-10-25",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Bruce McDonald"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Noel S. Baker",
         "Michael Turner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116488/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwNzMyMzg1N15BMl5BanBnXkFtZTcwMDQ4OTQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Hugh Dillon, Callum Keith Rennie, John Pyper-Ferguson | See full cast and crew »"],
      "reviews": [
         "It resembles \"Spinal Tap\" only in that it's about a fictitious rock band on its way down. This is a more ambitious movie, and its mood is much darker -- while it has its comic moments, it's not a film to watch when you're feeling down. This particular American viewer had no trouble with the Canadian references -- yes, we can tell Canadian cities apart and know exactly which Quebeckers the bassist was talking about. In fact, the Canadianness of the movie was part of its appeal, and I'm not just talking about the stunning scenery. I do have to admit overlooking the angle about Canadian musicians selling out to the American scene -- I was more attuned to the sellout on the personal rather than national level. Bands in the States lose musicians to L.A., too. At its core, this is a movie about friendship and betrayal, and in the end, betrayal wins. It's a hard, honest movie, not easy watching but worth the effort. (Parents, this one isn't for the kiddies -- lots of obscenity and some violence, though none of it is gratuitous to the story.)",
         "This is easily all around one of the best Canadian films ever made. Yes it is a mockumentary, yes it is follows around a rock band (rockumentary) but for every other reason this really should not be compared to Spinal Tap. It really isn't a comedy, although it has some great moments in it. It's also not about a band \"struggling with fame\" which is what EVERY OTHER rock movie is about (Almost Famous, That Thing You Do, Spinal Tap, The Doors, you name it). Just four guys holding on to a dream that should have faded years ago, all the while trying not to kill each other. I always knew Hugh Dillon was really the lead singer for the Headstones, so I realized it wasn't really a documentary but thought Hard Core Logo the band might still have existed and this was a tribute. Not the case, but that takes nothing away from the movie. They say not to watch this movie if you're in a band because it'll make you never want to play. At the same time, I think anyone who has been in a band will appreciate it that much more picturing how their little arguments would be amplified to 10 years later. It's an overall great gut check to picture just ow much you love playing music, especially if noone wants to listen.",
         "Really interesting film for anyone familiar with the hardcore music scene that deals with the problems and moral dilemmas of a reunited band. The problem is the movie is mismarketed as a comedy. Humor in the movie is quite present though dark and dry (though still very funny). This movie is actually quite a bit better than spinal tap. It's not mocking a bad band of a genre, but exploring the problems of the scene by looking at what's viewed to be a good one. The only similarity between this film and spinal tap is the narrative framework, which is that of a documentary, though in this film, that device becomes less obtrusive, and in all honesty could have been removed. Also, this movie has much more of a human heart than a film like spinal tap or fear of a black hat (another movie that got lumped into the \"mockumentary\" genre). The big problem I think is that this movie is represented as a comedy, and it's as dramatic as it is humorous. Terrific ending too. Recommended to those who enjoy dark comedies and punk rock.",
         "Let's get it over with right from the beginning: the only thing that \"This Is Spinal Tap!\" and \"Hard Core Logo\" have in common is the documentary set up. While Spinal Tap was a comedy that - as the name of the genre \"mockumentary\" suggests - mocked the heavy metal scene, \"Hard Core Logo\" is a character study that takes an honest look at a band and life on the road. Actually, the whole framework is rather unnecessary in this movie as it serves no real purpose and characters didn't act like they were in front of a camera (unlike say \"The Office\", where people behaved as if they were aware of being filmed). Besides, the pictures are shot too beautifully anyway for this to feel like a real documentary. That's not to say \"Hard Core Logo\" isn't realistic, though. The movie gives us a quite real impression of being in a punk band, caught between different agendas, personalities, power struggles and the sheer need to survive. This is why, apart from a few moments that will make you chuckle, \"Hard Core Logo\" isn't really trying to be funny, either. Just like real life the tragic moments outweigh the comedic ones by far. The acting is great and the soundtrack is accurate, two very important things to make a movie about punk rock work. Apart from maybe the drummer the band members aren't over-subscribed and you can really see guys like Joe Dick or Billy Talent playing in actual bands (guess what, Hugh Dillon actually was the singer of his own band, The Headstones). \"Hard Core Logo\" works on every level and is very entertaining to watch, too. There are quite a few details in the story hinted at rather subtly, which you're probably not going to get the first time around, so a second or third viewing is recommended.",
         "To try and comment on this film without mentioning Spinal Tap would be hard considering not only all the comments that have gone before but also the synopsis provided on this site. And the fact that not even real Rockumentary's can be reviewed without mentioning it hints at the brilliance of that film. Hard Core Logo, is not, however, Spinal Tap......and it's none the worse for it. Hard Core Logo is an intelligent drama (with the occasional comic moment) about the intense love between two friends and their mutually destructive force on each other when their paths once again entwine together years after the dissolution of their band. The copy I watched was pretty pore so I can't really comment on the cinematography but I can imagine, from the fuzzy version I did see, that its strikingly beautiful in it's own slightly decrepit way. The plot line is almost non-existent leaving the main focus on the four members of the band, mainly founding members Joe Dick and Billy Talent. So without good actors this film would sink. As it is the director has pulled fantastic, three dimensional, heart rending performances from both Hugh Dillon and Callum Keith-Rennie. Hugh Dillon's Joe Dick is a self destructive black hole that pulls in those around him. His love for Billy can never be doubted but he can't stand to think he's been left behind and will do almost anything to bring Billy back into his life. Dillon's energy and screen presence is quite extraordinary. Billy on the other hand is trying to get out, not just for money reasons but because he sees it as a way of salvaging his life from his group of self destructing band mates. Keith-Rennie's performance is all in the close ups of his face or his performance in the background of a scene while watching those around him. Billy talks crap but his face never lies. well, at least that was my take on this film...and that really is where Hard Core Logo comes into it's own. With so much of what the characters actually mean not being said (they chose, instead, to spout the generally expected views of a rock band) it really does depend on the viewer what film they watch. Bruce McDonald is a director that knows the beauty of well acted silence. They don't need to say anything for us to know exactly what these characters are feeling. Truly spectacular. But I'm rambling, seriously, watch it, don't watch it, but if you don;t you're genuinely missing out!!",
         "Someone once asked me if I were stranded on a desert island and could only watch one movie for the rest of my life, what would it be? Without question, it would be this mockumentary gem from The Great White North. Cheers to all those involved: to Hugh, Callum, John, Bernie, and Julian, whose performances are all top-notch; to Noel and Michael, whose writing exemplify true Canadian talent and spirit; and to Bruce, who brought it all together beautifully. If you haven't seen this movie, FIND IT. You'll laugh, you'll cry, it'll move you.",
         "This Is Spinal Tap (1984) is generally regarded as the quintessential rock 'n' roll mockumentary\u0097a hilarious look at the inept trials and tribulations of a heavy metal band. On the opposite end of the spectrum is Hard Core Logo (1996), a no frills balls-to-wall look at a fictitious punk rock band. Where Tap is a funny satire, Logo has a much darker undercurrent that gives it an unpredictable edge. Retired for some years, legendary Canadian punk rock band, Hard Core Logo reunites for a one-off benefit concert for their mentor, Bucky Haight who supposedly had both legs amputated after being shot by a crazy fan. The gig goes so well that the band's charismatic lead singer, Joe Dick convinces everyone to go on a mini-tour across Western Canada with a documentary crew tagging along for the ride. It takes no time at all for all the old gripes and grudges to resurface, most significantly, the fact that lead guitarist, Billy Talent is close to signing on with Jenifur, an MTV-friendly band that has made it to the cover of Spin magazine. This doesn't sit to well with Joe who comes from the old school of punk rock that refuses to sell-out to major labels or appear in glossy corporate magazines. As the tour progresses, the friction between the band members becomes more palpable until it achieves a critical mass. Hard Core Logo is the third film in Bruce McDonald's informal rock 'n' roll road movie trilogy that started with Roadkill and Highway 61. While something of a minor sensation in Canada, McDonald's films have been largely ignored in the United States, due mostly to lack of proper distribution. This changed somewhat with Logo when Quentin Tarantino saw it a film festival and liked it so much that he bought the US distribution rights under his Rolling Thunder vanity label. There is a certain raw vibe that permeates Logo and this is perfect for its rough around the edges subject matter. The unrefined attitude is due in large part to the presence of Hugh Dillon as Joe Dick. Not a professional actor but rather lead singer of the Canadian blues punk bank, The Headstones, Dillon's lack of formal training gives his performance a certain unpredictability that is perfect for his character. He obviously drew a lot on his own real life experiences of being in a band and this makes everything he says and does that much more believable. The interplay between the rest of the band is also very well done. Callum Keith Rennie plays the gifted, low key guitarist who has clearly surpassed his bandmates, Bernie Coulson is the crazy drummer who seems clueless but knows what to do when it counts, and finally John Pyper-Ferguson is the terminally burnt out bass player whose road diary provides the film's voice-over narration. The way these guys joke and argue with each other\u0097like adults who refuse to grow-up\u0097is so good that it feels like they've really been in a band together for many years. Filmmaker Bruce McDonald keeps this all together with his solid direction. He has an excellent sense of pacing\u0097the movie never gets boring\u0097and he instinctively knows that the essence of any good rock 'n' roll movie is, as he puts it, \"extremely loud music and cool shots.\" Cinematographer Danny Nowak uses the shaky, hand-held camera-work that documentaries are known for and he also shoots the band in cool slow motion shots that emphasizes their iconic status. Along with the aforementioned Spinal Tap and Cameron Crowe's Almost Famous, Hard Core Logo is one of the best fictitious rock 'n' roll movies ever made. It has a genuine appreciation for music and an acute knowledge of the conventions and clichés of the genre. Like Spinal Tap, McDonald's film isn't afraid to make fun of these conventions and like Almost Famous, there is an authenticity to how the band is portrayed and the music they make. Forget the Miramax version and hunt down a copy of this new special edition\u0097it's definitely worth those extra Canadian dollars.",
         "I love \"Hard Core Logo\", a fine black comedy. Hugh Dillon, Callum Keith Rennie, John Pyper-Ferguson, Bernie Coulson, and Julian Richings as Bucky Haight all did a great job portraying an aging band that never lived up to it's own ambitions. Frankly, I am so tired of \"This is Spinal Tap\", a film I liked the first two times I saw it. It wore thin on me all too quickly. I still love HCL, and that has to be because it is based on Michael Turner's book. Turner's own experiences in the Hard Rock Miners informed his writing and that legitimacy was kept in tact in the film. Also, from a Canadian point of view, I liked it because it was a straight up story and a straight up film. Far too often it seems that Canadian filmmakers feel that they have to go out of their way to make odd/disturbing films that just come across as pretentious and 'faux-Euro', or make films designed to pander to the lowest common denominator of the Hollywood market. MacDonald made his own film for himself and I for one am grateful.",
         "Hard Core Logo, much like every other Canadian movie, is a purely original movie. It takes a look at Vancouver's favourite bad boys of punk, Hard Core Logo. Bruce McDonald's direction is simply amazing and Callum Rennie and Hugh Dillon are brilliant as Billy Tallent and Joe Dick. The frenzied music drives the picture and Noel S. Baker's writing shows just what a first-time script writer can do with a little persistence and many script rewrites. Hard Core Logo has been compared to This is Spinal Tap. Although there are similarities, HCL's furious, biting, raunchy humor, wit and believability crushes Spinal Tap and leaves it flapping in the wind like yesterday's news.",
         "This is a dramatic comedy, and more than any other type of dramatic comedies, it''s dark and very real. Though there are quite a few jokes, many inside jokes, it melts into the tension of the four guys like a fast gliding bird would melt into a brick wall in a cartoon. Worthy to be a classic. Hugh Dillon is a great actor and has perfect chemistry with Callum Keith Rennie."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Terminal City Pictures",
         "Shadow Shows",
         "Ed Festus Productions"
      ],
      "summaries": [
         "Bruce Macdonald follows punk bank Hard Core Logo on a harrowing last-gasp reunion tour throughout Western Canada. As magnetic lead-singer Joe Dick holds the whole magilla together through sheer force of will, all the tensions and pitfalls of life on the road come bubbling to the surface.",
         "The successful fringe punk band, Hard Core Logo - formed in 1978 and disbanded in 1991 - are reuniting five years after their break-up for what they believe is a one-time only benefit concert for front man Joe Dick's musical idol, Bucky Haight, who lost his legs in a gun shooting. But they decide to mend their differences, which revolved primarily around their former manager Ed Festus and the strong personalities of the two front men, Joe Dick and Billy Tallent, and embark on a concert tour of western Canada. As documentary filmmaker Bruce McDonald films the band on tour, the old wounds between all four band members may not have healed as Billy, arguably the band member with the brightest post-Hard Core prospects, may garner more attention than the band's true leader Joe. The problems may not be able to endure the added stress of being constantly in front of Bruce's documentary camera, which, when unedited, does not lie."
      ],
      "budget": 0
   },
   "movielensId": 2342,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-10-25",
      "dvdReleaseDate": "2001-06-12",
      "directors": ["Bruce McDonald"],
      "runtime": 92,
      "movieId": 2342,
      "title": "Hard Core Logo",
      "mpaa": "",
      "actors": [
         "Hugh Dillon",
         "Callum Keith Rennie",
         "Julian Richings"
      ],
      "imdbMovieId": "0116488",
      "originalTitle": "Hard Core Logo",
      "genres": [
         "Drama",
         "Comedy",
         "Music"
      ],
      "youtubeTrailerIds": ["CAw_HZ4GsFc"],
      "plotSummary": "Bruce Macdonald follows punk bank Hard Core Logo on a harrowing last-gasp reunion tour throughout Western Canada. As magnetic lead-singer Joe Dick holds the whole magilla together through sheer force of will, all the tensions and pitfalls of life on the road come bubbling to the surface.",
      "tmdbMovieId": 21589,
      "avgRating": 3.59963,
      "releaseYear": "1996",
      "numRatings": 271,
      "posterPath": "/xh9pDoIMztITSSaXz3Gnkcwz8NR.jpg"
   }
}