{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "double life",
            "id": 848
         },
         {
            "name": "wrestling",
            "id": 5970
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "doctor",
            "id": 13005
         },
         {
            "name": "naked",
            "id": 157813
         },
         {
            "name": "murder hunt",
            "id": 217324
         },
         {
            "name": "chiropractor",
            "id": 219900
         }
      ],
      "imdb_id": "tt0120767",
      "video": false,
      "title": "The Naked Man",
      "recommendations": [],
      "backdrop_path": "/nSUyJEy4sedBQvNfuJ5Nm6ZJ4El.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Dr. Edward Bliss, jr",
               "gender": 2,
               "credit_id": "52fe44a0c3a36847f80a0c6b",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Sticks Varona",
               "gender": 2,
               "credit_id": "52fe44a0c3a36847f80a0c6f",
               "name": "Michael Jeter",
               "profile_path": "/kCFHCa8Uy4rsgbzWxPCu8xSut6A.jpg",
               "id": 2169,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Deloris",
               "gender": 1,
               "credit_id": "52fe44a0c3a36847f80a0c73",
               "name": "Rachael Leigh Cook",
               "profile_path": "/cotGJui5H2Te2ThYERndc3DOVOm.jpg",
               "id": 38581,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Kim Bliss",
               "gender": 1,
               "credit_id": "52fe44a0c3a36847f80a0c77",
               "name": "Arija Bareikis",
               "profile_path": "/qxJ6M4eCAhUlXkAaXCK8iGLl14g.jpg",
               "id": 33432,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Stick's Driver",
               "gender": 2,
               "credit_id": "52fe44a0c3a36847f80a0c7b",
               "name": "John Carroll Lynch",
               "profile_path": "/5eEGOANKnCCj7FLa3oV28gGYWkW.jpg",
               "id": 3911,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a0c3a36847f80a0c5b",
               "name": "Ethan Coen",
               "profile_path": "/AH5YwNZC5txyJKyjVZhA4ZXFzP.jpg",
               "id": 1224,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a0c3a36847f80a0c61",
               "name": "J. Todd Anderson",
               "profile_path": null,
               "id": 54563,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a0c3a36847f80a0c67",
               "name": "J. Todd Anderson",
               "profile_path": null,
               "id": 54563,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.78639,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8336,
      "vote_count": 3,
      "budget": 0,
      "overview": "",
      "similar": [
         4771,
         445954,
         18587,
         15069,
         26390,
         15762,
         12150,
         4638,
         96,
         979,
         1949,
         281,
         75780,
         281957,
         357096,
         133805,
         2142,
         21484,
         1266,
         9411
      ],
      "original_title": "The Naked Man",
      "runtime": 98,
      "poster_path": "/tlQfxumzFJV6U31ckL3qLNdWDwO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-08-02",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["J. Todd Anderson"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "J. Todd Anderson",
         "Ethan Coen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120767/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NjQ2MjA4NF5BMl5BanBnXkFtZTYwMzM2MzA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Michael Rapaport, Michael Jeter, John Carroll Lynch | See full cast and crew »"],
      "reviews": [
         "Of course, this isn't a Coen brothers film, but it does have a strong connection to their films with Ethan Coen contributing to the script (but not producing) and with the Coen's storyboard artist J. Todd Anderson directing and also co-writing. As to be expected, it's not as good as a full Coen brothers effort, but worth a look for anyone who is a fan of the Coens (as I am). That said, it's not a great movie. It does have a pretty funny central concept, but to me, it never seemed to completely get off the ground. J. Todd Anderson directs the film in a similar style to Joel Coen, but he isn't near as good as writing funny dialog. There is some stuff here that people with a weird sense of humor (like me) will appreciate, but mostly the film is meandering and pointless. Definately not on the same level as the Coen brothers' classics, but worth seeing for anyone who likes the Coens, or weird comedies in general.",
         "I admit it - the reference to Ethan Coen on the sleeve of this straight-to-video oddity secured a rental. I wasn't disappointed. The Naked Man bears all the hallmarks of a Coen-penned script - albeit from the more fantasy oriented side of their cadre (see also The Hudsucker Proxy and the Sam Raimi directed Crimewave). Also, the very first sound you hear is a man screaming - another Coen favourite. This is not to detract from J. Todd Anderson's direction. The whole production has a surreal air. He places events in a small town in middle America, but it doesn't seem out of place. You never forget this is supposed to be a fantasy. Look out for it next time you're in Blockbuster. If you don't expect something as masterly as The Big Lebowski or The Hudsucker Proxy, you'll love it. A lo-fi Coens flick, if you will.",
         "This movie is more than just a film co-written by Ethan Coen (of the Coen brother fame). And if your expecting a Coen brother movie, its different but it does have some familiar ties to films made by the Coen brothers. What else would you expect from Director J.T Anderson who has been the storyboard artist on almost all of the Coen brothers projects, and J.T's characters are every bit as interesting as any created by his co-writer and his brother. This movie lives on the dynamics between its characters, and of course great photography by Jeff Barklage. (I think every Coen brother film has had great photography that pushes the story and the characters.) But enough about Coens. This is a fun film and a good film, and I cannot understand why OCTOBER and UNIVERSAL did not release this sucker.",
         "I rented this movie for two reasons, first and foremost because the box contained the 'C' word. No not that 'C' word, the other one.... Coen, Ethan Coen. One half of the duo which brought us the Big Lebowsi, Fargo and the Hudsucker Proxy and even though he only has a co-writing credit (along with director J. Todd Anderson)it's easy to see his influence. The second reason was the excellent Michael Rapaport, who you may or more likely not, recognise from True Romance and Beautiful Girls. He's in fine form here as a Chiropractor who sidelines as rather odd looking Wrestler who wears a suit that looks like he's had his skin removed. SPOILERS***** When his family of chemists are massacred by the local pharmaceutical mafia head, Sticks Verona he loses the plot (although Coen and Anderson don't) and becomes a wrestling super hero using his Chiropractic skills to disable his enemies. One ridiculous plot twist after another follows as the Naked Man seeks his horrible revenge on the quadraplegic Sticks Verona. He's not an evil man, he just has back problems. This is not a great movie, it's a good movie. It is though, always entertaining and thoroughly bizarre!",
         "This movie is great. I have rented it a couple of times now and find something new each time. It is HILARIOUS!! The acting is firmly tongue in cheek and well done. My favorite character of all is the police detective -- I'd love to see a movie just about him (hint-hint Mr. Anderson). I haven't laughed out loud at a movie in a long time. Bravo!",
         "When I saw this movie, I was on the one hand overwhelmed and on the other hand very disappointed. It is a tragic and in some parts surrealistic comedy that is standing close to Bertolt Brecht's theater dramas and his V-effect and the German Dadaism-Artists. It may be considered as a sequel or even as a conclusion of other Coen - movies OR as just a big piece of humbug. I myself was thinking between these two aspects for a long time. And I came to the conclusion that everybody has to decide for himself. The thing that was really fascinating were the characters: real types - to speak in the traditional language of drama - not complex protagonists made me think about the sense of this movie. And to come back to the title of this comment: It is really a thin line between a very complex piece of film-artwork and rubbish. Decide for yourselves!",
         "One half of the Coen Brothers has co-written one of the weirdest and most intelligent comedies I've ever had the pleasure of viewing. Underrated actor, Michael Rappaport excellently portrays the inscrutable chiropractor/wrestler of which the title refers. The Naked Man features wonderfully quirky performances, equally quirky dialogue and a storyline just strange enough to keep anyone interested. Fans of David Lynch or John Waters, don't miss this!",
         "I didn't think this film had any particular motives until I saw the \"Aww Pharmacist Dad, drugs aren't the answer, you can just heal people by adjusting their spine!\" scene. That's when I knew we were in it deep. I have been to 3 separate chiropractors in my life (2 the wacko kind, like the Naked Man, who claim that all sorts of emotional and physical illnesses can be fixed by spinal adjustments- not medically possible) and luckily 1 who knew that, well, a chiropractor is simply there to help you with SPINE PROBLEMS. Not to fix your cruelty and rage, not to restore health to other body parts, but simply to IMPROVE THE BACK. If you think I'm on a high horse you're right, but frankly, it's only in opposition to what the movie would have you believe. The truth is that A. chiropractors do not go to medical school and are not in any conventional sense 'doctors' and B. there is no evidence that chiropracty can solve non-spine-related issues. Oh, and C. this movie is bad. Not so bad it's funny, or so bad it's good, just BAD.",
         "Was unaware of this, and believe me as much as I love movies, I feel no shame about that. However, this is a must-see for those of us who crave escape into silliness occasionally. The Naked Man is the wrestling moniker of a mild mannered chiropractor with a brutal, but golden touch played by Michael Rappaport, Brooklyn's answer to Gary Busey. All he seeks in life is reunion with his father, a stern pharmacist and believer in pills, and to be a provider to his \"best girl\" and soon-to-be-born son. However, chilling tragedy strikes in a hilarious Ethan Coen way which sends our back stretcher on a wild mission of revenge in his wrestling persona aided by Delores, a biker babe liberally pierced. Their targets are Sticks Verona, a drug kingpin played by an always funny Michael Jeter, and his driver of the huge semi that he lives in, an Elvis clone who lives on peanut butter sandwiches with bacon. Also, the jewel in the cast, a chain smoking detective wearing a six month shirt and a raincoat that even Columbo would Goodwill, is played by that unique actor Joe Grifasi. There is a long, dialogue-free, classic scene of the beginning of his day that is a gem. Half a load on will get you through the awful parts to the good stuff which is inspired. Shameless fun.",
         "The director has, on a low budget, created a tight script, with beautiful timing. Rapaport plays a pro wrestler (whose persona is \"The Naked Man\")/chiropractor who is thrust into responding to an attempted gangland takeover of his small town. Wonderfully acted from the chain smoking cynical cops, to the paraplegic gangster, to his Elvis impersonating enforcer, and finally to the biker girlfriend follower. All the little bits were perfect and the movie was a hilarious comedy."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Naked Man Productions",
         "October Films"
      ],
      "summaries": ["A man takes matters into his own hands when a pharmaceutical kingpin moves into his town to cause some real trouble."],
      "budget": 0
   },
   "movielensId": 2343,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-02",
      "dvdReleaseDate": null,
      "directors": ["J. Todd Anderson"],
      "runtime": 98,
      "movieId": 2343,
      "title": "The Naked Man",
      "mpaa": "",
      "actors": [
         "Michael Rapaport",
         "Michael Jeter",
         "Rachael Leigh Cook",
         "Arija Bareikis",
         "John Carroll Lynch"
      ],
      "imdbMovieId": "0120767",
      "originalTitle": "The Naked Man",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "",
      "tmdbMovieId": 8336,
      "avgRating": 3,
      "releaseYear": "1998",
      "numRatings": 27,
      "posterPath": "/tlQfxumzFJV6U31ckL3qLNdWDwO.jpg"
   }
}