{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "women",
            "id": 515
         },
         {
            "name": "rape",
            "id": 570
         },
         {
            "name": "mercenary",
            "id": 3070
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "serbian",
            "id": 9285
         },
         {
            "name": "atrocity",
            "id": 11872
         }
      ],
      "imdb_id": "tt0120070",
      "video": false,
      "title": "Savior",
      "recommendations": [
         219575,
         107934,
         22491,
         31643,
         25297,
         50116,
         14759,
         15669,
         208377,
         399786,
         44004,
         57873,
         31692,
         15720,
         56179,
         56448,
         41852,
         130002,
         69007,
         29973
      ],
      "backdrop_path": "/rDKLghHVvFipbufjJoDvP0QYeOq.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "gerithecat",
         "id": "4fcb0a54760ee37536000ee7",
         "content": "outstanding thriller. compelling and violent depiction of the Bosnian conflict from the eyes of a broken professional soldier discovering his life again after personal tragedy and rage. based on true events, this is a powerful and moving drama, also Quaids best performance to date.",
         "url": "https://www.themoviedb.org/review/4fcb0a54760ee37536000ee7"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Joshua Rose",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040ca9",
               "name": "Dennis Quaid",
               "profile_path": "/fSnnQg8y1LB9yHbn2WuEcUb8i9Y.jpg",
               "id": 6065,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Paris Priest",
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040cad",
               "name": "Pascal Rollin",
               "profile_path": null,
               "id": 21019,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Christian",
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040cb1",
               "name": "Catlin Foster",
               "profile_path": null,
               "id": 21020,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040cb5",
               "name": "Stellan Skarsgård",
               "profile_path": "/zSCU2agleLtJEvzj98jEesVhBxa.jpg",
               "id": 1640,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Colonel",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040cb9",
               "name": "John Maclaren",
               "profile_path": "/bLAjD9xwJgRHk1dmTIjDV4e8rqf.jpg",
               "id": 21021,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Vera",
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040cc9",
               "name": "Nataša Ninković",
               "profile_path": "/bwAVKizSqchnxaJ53Gtu1ZEutL4.jpg",
               "id": 36647,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Maria Rose",
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040ccd",
               "name": "Nastassja Kinski",
               "profile_path": "/4ru0isgjh43sPCpHMyXa0OuLkJn.jpg",
               "id": 2630,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Goran",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040cd1",
               "name": "Sergej Trifunović",
               "profile_path": "/4AR7yKBsAPgXLA5GmirVY4fzxoE.jpg",
               "id": 66027,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040c87",
               "name": "Predrag Antonijević",
               "profile_path": "/mIf0JkT40wXPo7zReoqFFst85ba.jpg",
               "id": 21013,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040c8d",
               "name": "Robert Orr",
               "profile_path": "/1fnh6iPohS10SXQg2a8Xk9kkXaM.jpg",
               "id": 21014,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040c93",
               "name": "Oliver Stone",
               "profile_path": "/uHdNGBkrI74eYfUP2Uie7nuo0Nn.jpg",
               "id": 1152,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040c99",
               "name": "Janet Yang",
               "profile_path": null,
               "id": 21015,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040c9f",
               "name": "Ian Wilson",
               "profile_path": null,
               "id": 21017,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040ca5",
               "name": "Ian Crafford",
               "profile_path": null,
               "id": 10935,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040cbf",
               "name": "Gabriella Cristiani",
               "profile_path": null,
               "id": 11383,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040cc5",
               "name": "David Robbins",
               "profile_path": null,
               "id": 10364,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 5.966057,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2042,
      "vote_count": 34,
      "budget": 10000000,
      "overview": "A hardened mercenary in the Foreign Legion begins to find his own humanity when confronted with atrocities during the fighting in Bosnia",
      "similar": [
         979,
         281957,
         9331,
         3134,
         994,
         588,
         357096,
         185,
         1369,
         205,
         8456,
         600,
         281,
         2652,
         395834,
         180863,
         263472,
         15069,
         8999,
         445954
      ],
      "original_title": "Savior",
      "runtime": 99,
      "poster_path": "/yiTmcM8vij79EBi8shF7S7ZxJ7f.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "",
            "iso_639_1": "sh"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Initial Entertainment Group (IEG)",
         "id": 7380,
         "origin_country": ""
      }],
      "release_date": "1998-11-20",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "He's fighting a war he doesn't believe in, hoping to find something he does.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Predrag Antonijevic"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Robert Orr"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120070/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwNTE1MDUxNF5BMl5BanBnXkFtZTcwNDg1ODEyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Dennis Quaid, Nastassja Kinski, Pascal Rollin | See full cast and crew »"],
      "reviews": [
         "I suspect that for most Western Europeans and Americans the name 'Bosnia' is now no longer simply the name of a country, but also carries a subliminal implication of atrocity and ethnic viciousness. I doubt, then, that many people would approach this film with any false expectations of what it will contain. That said, viewers should not come to this film for a political explanation of why and how the war happened - for that, it's probably best to read a few books. This film does attempt to give a human explanation of how and why wars like this one happen and continue to happen, though. Inevitably, some have accused Savior of bias; though an American film, the director is a Serb, and it was filmed on location in Montenegro; with such emotive subject matter partiality would hardly be surprising. Indeed, the film does not flinch from discussing atrocities committed by Bosnian Muslims. Those who accuse this film of being pro-Serb, however, should consider that one of the most hateful caracters in the whole film, whom we witness carrying out pointlessly vicious acts of cruelty and mysogyny, and who happily admits to being a serial rapist, is himself a Serb. Viewers should instead look to the human heart of this film. Dennis Quaid gives us a superb performance, rendering a character of some complexity (look at his expression when one character tells him 'You are a good man'). He is ably matched by Natasja Nincovic's complicated, battered portrayal of a Serb woman - and not merely a 'rape victim' stereotype that we know from other films. There is a religious subtext for those who like looking for such things - plenty of Christ imagery, chiming nicely with the title. There is a special irony in the cross Joshua carries; apparently a Catholic, he has come to Bosnia specifically to kill Muslims in revenge for the loss of his family in a terrorist bombing - yet by joining the Serbs he is also aligned against the Catholic Croats. Perhaps this says something about the self-destructive nature of his revenge, and about his own internal conflict. This is a film about a man divided against himself, in a country divided against itself. It is particularly effective that the main character in this film is an American. We are tempted to comfortably see him as 'one of us', a decent man in the midst of a barbaric war - but we are not allowed such passive comforts. Eaten by revenge and pain, little seperates Joshua from his barbaric 'sidekick' Goran, whose mindless cruelty he meets with contempt but also inaction. His own conduct is difficult to stomach, but nonetheless presented as the actions of a human, not a monster. What Antonijevic's film does, then, is look at the line between those who have, and those who have not, become indifferent to the suffering of others - it is in this way that the perpetuation of war is explored. There are no politics, no discussion of religion, or of 'age old ethnic hatreds'. The focus of this strong film is the simple human cost both in lives extinguished and lives mutilated by war. Indeed, for those not very familiar with the details of the war in Bosnia, the practical anonymity of the different soldiers throughout the film will heighten the sense of War as something soldiers do to Civilians. People who respect and appreciate this film should steer clear of the recent Behind Enemy Lines however - it reuses fragments of the Lake scene in Savior to simplistically anti-Serb effect, completely bastardising the intent of the people who originally created those images. Nonetheless, despite what has been done to it Savior remains beautifully acted, tragic, mature film-making.",
         "I know that many people consider this movie 'Politically incorrect'. Probably it is in some way. I'm not from the Balkans, but I live very near and I remember very well that war in front of my door and I was against the Serbs. This movie was made by a Serb director and show his point of view. Anyway I think that in this movie you can see what was that war for civilian people, any side they were. I found it a true document about the war, and, in the end, I was not disturbed by the fact that it was a movie from a Serb director. I think that this demonstrates that it's a good movie. After watching this movie, you don't hate the Serbs, the Croatians or the Bosnians, you hate the war for the consequences on civilian people.",
         "Great movie and easily Dennis Quaid's best work. Very tough to watch at times but in the end extremely rewarding and cathartic. Its so appreciated that some artists in the world have something to say and do a timely, thoughtful movie to tell the world what they are missing or ignoring. You can either see what they have to say, or see the next assembly line CGI garbage. I suggest that any mature moviegoer give this a look. There is some unexpected humor, a lot of horror and carnage and heartache, and I do suggest you keep the tissues close by for a some incredibly emotional scenes. There is not a whole lot of dialogue which is also much appreciated. Most of the time actors are better when they have nothing to say but alot to express. The actors in this movie are all very natural and real. Not the least of which was the baby! One of the best performances by a new born I've ever seen..this child is beautiful. Thanks to Dennis Quaid who probably made the equivalent of cab fare for this one..you did a great job in an invaluable movie.",
         "1993, Bosnia. Having seen his wife and son murdered by Muslim terrorists, Guy has become bitter and hard and is fighting as a mercenary for the Serbs. When a prisoner exchange sees his partner take a girl he knows and try to kill her and her unborn mixed child, Guy is forced to kill him to protect them. However he then finds himself in a bitter war with a woman and child that no one wants. I have seen this movie twice now and can find little to dislike about it, but also realise that it is not for a fun evening in with friends. The film is unrelentingly bleak and depressing as it is a look at the bitter and cruel war fought in Bosnia. The subject matter is framed around Guy, as a man who has been turned hard by the horror he has seen and it works well for this reason. We see it through the eyes of a man who has seen it all and has no more hurt left to feel. The film doesn't simply act out atrocities for us to watch but frames them within this story \u0096 however we know that nothing is made up or exaggerated in terms of the bigger picture. The film lacks any sort of traditional American cop-out (it's no spoiler to say that Guys wife and child don't turn out to be alive after all!), only the opening `this is why he's like this' 10 minutes are a little too neat and could have been dispensed with \u0096 I didn't need it to explain why he was dead inside, only that he had become it due to war \u0096 which was partly true. However this doesn't really take away from the film, only slightly weaken the character. The cast are pretty good but the film is 99% Quaid's. He gives a great performance which is subtle and very downbeat. His eyes are where most of the acting occurs and he does it very well \u0096 his character is very unsympathetic and has only a marginal redemption to look forward to but yet Quaid mixes it very well. Kinski is out of the film before her name has even appeared on screen, while Ninkovic does a good job, again despite a unsympathetic character. The rest of the cast are OK but hard to judge as much of the dialogue is in Serbo-Croatian and their performances are hard to judge. Faces such as Skarsgård add interest, but I did wonder why he had bothered for such a short time on screen. Overall this is not a fun film to rent on Friday night but a bleak anti-war film that will leave you in no doubt that the conflict in Bosnia (and perhaps everywhere else) is of no value when compared to the enormous cost in terms of human life and suffering.",
         "I noticed this had been produced by Oliver Stone when I saw it for sale, thus my reasoning for snapping it up. Usually what Stone touches turns to gold and this is no exception This film will move you to tears; mark my words. I wasn't ready for it, or at least wasn't expecting it. Realism is the key to its power. While some viewers may focus on which ethnic groups are committing what crimes, for the wider audience I think it has a commentary on the human race in general and what it is capable of. Quaid performs his part from top to bottom, which drains the viewer of emotion, making one actually process information that has previously just been news broadcast. A good mix of local and international filmaking skills also present what I would consider an accurate picture of the racial and religious groups depicted in the movie. I'm sure insiders will disagree, but from my time spent in the region, there was not a scene or individual character where I was skeptical of objectivity - from the bus driver to father. There is so much to be said about Savior, and it is a must see for any international audience. It may unearth a conflict of opinions among serbs, croats and bosnians, but perhaps they would be reading too much into it...",
         "At first on hearing Dennis Quaid I thought this would be usual \"Hollywood Hero saves the world\" offering from the Hollywood Studios. How wrong I was,Dennis Quaid gives a stunning performance of a good man struggling to understand a world of brutality and inhumanity. Against all odds he does what he thinks his right and realizes the baby represents the only hope he and the human race have? There will probably be critics from those who were involved the conflict who will say this is an inaccurate \"Hollywood Version\" of events.This may or may not be true, but what Quaid has done here is made a bridge from the world depicted here and the rest of the world not involved in the conflict, enabling us to understand it more. This film is not mainstream enough to have become a blockbuster,with lots of honours, but I would like to think Quaid and Kinski will remain justifiably proud of their involvement in this film for all time.",
         "\"Savior\" came to me as a movie half-seen on HBO. What I saw was enough to intrigue me to search for the DVD. The DVD is currently out-of-print. Luckily I was able to find one on an online auction site and I am pleased to say that I am quite happy with my purchase. This movie takes a serious look at war and it's effects on a soldier who has joined the foreign legion, a woman he meets, and an infant who enters their life. The setting is Bosnia and war is brutal. The hero finds himself surrounded by death and destruction. He chose his life as a soldier in the Foreign legion as an act of revenge to purge his anger from losing his family. Soon, war and anger overcomes and all that is left is the \"Savior\". Who is the savior? I'll leave that up to you the viewer to discover for yourself. Excellent film overall. This is my favorite performance by Dennis Quaid.",
         "I watched this movie with skepticism but I have to admit I was wrong. This is a powerful movie and it left me drained out by the time it got over. The last 15 to 20 minutes are sure to move even the cold hearted so,I am surprised and saddened that there are still some folks here at the forum fighting over its anti/pro Muslim/Serbian credentials. There is no winner in any war - only despair & death and at times, a faint glimmer of hope. Saviour depicts this with astonishing realism and at times,is difficult to watch but I guess that what war is all about. Dennis Quaid gives an Oscar winning performance and considering, the fact that Oliver Stone produced this, it has a antiwar platoonesque feel to it.",
         "Rated:R Runtime:104mins Release Date:1997 In a time of darkness and despair, Joshua Rose is a man in search of redemption and hope. His only chance to find it is the last place he intended it to be. Within himself. Savior tells the incredible true story of Joshua Rose (an always brilliant Denis Quade), a man, who after seeing his wife (played by the stunning Nastassija Kinski who unfortunately doesn't have a lot of camera time) and child brutally murdered by an extremist group, goes on a murderous rampage to avenge their deaths and fill the emptiness that they have created within him. But instead of making the wrong things right and alleviating the emptiness, Joshua too is now an extremist killer who must flee the country and assume a new identity as Guy, a member of the French foreign legion. Here he takes refuge and joins a cause in hopes that he can redeem the wrongs that he has committed. But as the war progresses for this sniper, he just gets deeper in to the darkness. Until, however, he is called in to do a refugee escort mission and meets Verra a beautiful surbian woman who is pregnant with her Muslom rapist's child. After having a scuffle with his partner over the woman and then subsequently murdering him, Joshua, Verra and her infant son embark on a powerful journey of hope and redemption through the war torn plains of Serbia. Remarkable is the only way I can start off my review of this movie. This In my opinion is the most underrated drama of all time. The characters are so beautifully created by the great actors playing the roles that you actually believe these experiences are happening to these people. Quade who I mentioned earlier is an amazing talent who is truly one of hollywoods best shines, like the north star. Next is the ultra talented and little known actress Natasa Ninkovic who turns in a performance so brilliant I would have nominated her for an academy award had I been on the committee. Director Peter Antonijevic creates a movie so powerful that scenes seem to actually come out of the television and literally pull on your emotions. I must admit that I really hope hollywood uses this virtually unknown director much, much more in the future. Writer Robert Orr knows how to put together a movie, his script is first rate and just glows with realism. He also boasts great ideas and shows how brutal war can be. For instance a scene where Quade must sit and watch a bus load of people either get clubbed over the head with a choice blunt weapon from a golf bag or get moad down in firing squad fashion. The journey that he takes the characters on delves so far in to the black, take for instance the scene I recalled earlier wich happens to occur within the first five or ten minutes in which Rose get's the appalling opportunity to see what his family looks like after they've been charred to a crisp by a devastating explosion, that you can't even begin to think that Quade has any chance of finding the good in the world or even in himself for that matter. But through twists of fate and a little compassion Rose start's seeing a chance and so does the viewer. To Finalize this without giving this movie the exact credit that it deserves would be an absoloute sin. This is the most powerful Drama I have ever had the pleasure of viewing, and had it had a couple of more scenes in wich the viewer was able to witness a little more of the war aspect of that torn country I would have given this piece of artistry a perfect ten (and I almost and I stress almost never give out that mark). I would personally like to thank everyone involved in this movie especially co-producer Oliver Stone and the great cinematographers who captured the feel and landscape of the country beautifully, for allowing me the pleasure of enjoying this priceless gem. Now drama's are actually at the bottom of my film category list just due to the fact that they are all seemingly soap opera's that run in the same direction, but to all of those reading, for the drama genre and movies in general this dynamic film truly is a Savior. Overall Rating: 9 out of 10",
         "Wow, this a grim film. Don't look for a lot of laughs in this one! It's not bad if - and that's a big \"if\" - you can get past the first 45 minutes. I got past it on the first viewing but not on the second. It was just too much. Seeing youngsters assassinated, families blown up and then a pregnant woman kicked several times in the stomach was too much for me Dennis Quaid plays an American soldier overseas whose family dies at the hands of a Muslim bomber. He gets revenge by heading to a local mosque and begins shooting everyone inside. Quaid is then sent away to a foreign legion and winds up in the middle of the Bosnia War between Muslims and Serbs, and along the way caring for that pregnant woman who was treated so brutally. This is a very somber film, very depressing in spots, but worth one look. I don't know if you'd want to see it more than that."
      ],
      "genres": [
         "Drama",
         "War"
      ],
      "productionCompanies": ["Initial Entertainment Group (IEG)"],
      "summaries": [
         "Joshua is a former U.S. military official who fled to the Foreign Legion when his wife Maria was killed by Muslim fundamentalists in Paris, and now he's a mercenary, fighting in the Yugoslav war on the Serbian side against Muslims.",
         "A hardened mercenary in the Foreign Legion begins to find his own humanity when confronted with atrocities during the fighting in Bosnia."
      ],
      "budget": 10000000
   },
   "movielensId": 2358,
   "movielens": {
      "languages": [
         "English",
         "Français",
         ""
      ],
      "releaseDate": "1998-11-20",
      "dvdReleaseDate": "1999-04-20",
      "directors": ["Predrag Antonijević"],
      "runtime": 99,
      "movieId": 2358,
      "title": "Savior",
      "mpaa": "R",
      "actors": [
         "Dennis Quaid",
         "Pascal Rollin",
         "Catlin Foster",
         "Stellan Skarsgård",
         "John Maclaren",
         "Наташа Нинковић",
         "Nastassja Kinski",
         "Sergej Trifunović"
      ],
      "imdbMovieId": "0120070",
      "originalTitle": "Savior",
      "genres": [
         "History",
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["ONDaW2rd7uM"],
      "plotSummary": "A hardened mercenary in the Foreign Legion begins to find his own humanity when confronted with atrocities during the fighting in Bosnia",
      "tmdbMovieId": 2042,
      "avgRating": 3.51418,
      "releaseYear": "1998",
      "numRatings": 141,
      "posterPath": "/yiTmcM8vij79EBi8shF7S7ZxJ7f.jpg"
   }
}