{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "airport",
            "id": 822
         },
         {
            "name": "in love with enemy",
            "id": 930
         },
         {
            "name": "canadian",
            "id": 2519
         },
         {
            "name": "necklace",
            "id": 2599
         },
         {
            "name": "fear of flying",
            "id": 4544
         },
         {
            "name": "deal",
            "id": 5011
         },
         {
            "name": "vineyard",
            "id": 5334
         },
         {
            "name": "smuggling",
            "id": 6212
         }
      ],
      "imdb_id": "tt0113117",
      "video": false,
      "title": "French Kiss",
      "recommendations": [
         11777,
         2058,
         12157,
         7300,
         11860,
         2064,
         10449,
         10806,
         858,
         3525,
         10407,
         4587,
         9058,
         8866,
         10699,
         11472,
         10660,
         1049,
         11467,
         10859
      ],
      "backdrop_path": "/yS0YFDsgfpV145n2MoIhcCKuWvi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe423ec3a36847f800f1f7",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Luc Teyssier",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f1fb",
               "name": "Kevin Kline",
               "profile_path": "/u9QXn3fL7zCC2c6HA2vFgH1JxZg.jpg",
               "id": 8945,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f1ff",
               "name": "Timothy Hutton",
               "profile_path": "/ypC4mzLExwmG0QHfi8vFe9LTeSi.jpg",
               "id": 16327,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Inspector Jean-Paul Cardon",
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f203",
               "name": "Jean Reno",
               "profile_path": "/cdsN5efCYGQWlPrj7vFlZRBTR16.jpg",
               "id": 1003,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Perfect Passenger",
               "gender": 2,
               "credit_id": "53e9ef3e0e0a2660250013d1",
               "name": "Adam Brooks",
               "profile_path": "/yUyhsz2KZ87ePFxyQGeW9FjoGZ6.jpg",
               "id": 16328,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Bob",
               "gender": 0,
               "credit_id": "557c39afc3a368631d001adc",
               "name": "François Cluzet",
               "profile_path": "/rE7utJuaZiR9NLjxmtQJZET0q4d.jpg",
               "id": 33161,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Juliette",
               "gender": 1,
               "credit_id": "557c39efc3a3686328001d98",
               "name": "Suzan Anbeh",
               "profile_path": "/krQXb4OXzEWurxeDk7pEtYVaN7B.jpg",
               "id": 20018,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Lilly",
               "gender": 1,
               "credit_id": "557c3a2792514153ad00189a",
               "name": "Renée Humphrey",
               "profile_path": "/q8Kf2vOuU80APe2cxDS0kSrp7BC.jpg",
               "id": 23647,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f209",
               "name": "Lawrence Kasdan",
               "profile_path": "/pBAB9NAMRhL2IBYcgLu6P1CdXbW.jpg",
               "id": 8844,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f20f",
               "name": "Adam Brooks",
               "profile_path": "/yUyhsz2KZ87ePFxyQGeW9FjoGZ6.jpg",
               "id": 16328,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f215",
               "name": "Charles Okun",
               "profile_path": null,
               "id": 16329,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe423ec3a36847f800f21b",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f221",
               "name": "Owen Roizman",
               "profile_path": "/3dl1QnuVmqz0US2t5tMVmNqPK7u.jpg",
               "id": 16331,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f227",
               "name": "Joe Hutshing",
               "profile_path": null,
               "id": 4186,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe423ec3a36847f800f22d",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.906408,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 397,
      "vote_count": 242,
      "budget": 0,
      "overview": "French Kiss is director Kasdan’s best film since the Bodyguard. The plot involves a couple in love and one woman’s attempt to fly to Paris to get her lover back from a business trip and marry him. On the way she unknowingly smuggles something of value that has a petty thief chasing her across France as she chases after her future husband.",
      "similar": [
         1281,
         707,
         283227,
         8195,
         3989,
         9280,
         451945,
         760,
         2926,
         6935,
         662,
         4909,
         375867,
         3482,
         314402,
         31685,
         31208,
         14556,
         283330,
         10401
      ],
      "original_title": "French Kiss",
      "runtime": 111,
      "poster_path": "/bZqvonwVru1XtnniQZgZRa3Znyk.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/sOg7LGESPH5vCTOIdbMhLuypoLL.png",
            "name": "PolyGram Filmed Entertainment",
            "id": 1382,
            "origin_country": ""
         },
         {
            "logo_path": "/cifwIG2aVR1dRis6yoiilq4qeIh.png",
            "name": "Working Title Films",
            "id": 10163,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Prufrock Pictures",
            "id": 34207,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-05-05",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Lawrence Kasdan"],
      "runtime": 111,
      "synopsis": "When Kate's (Meg Ryan) fiancé; Charlie (Timothy Hutton) calls from Paris to tell her he's in love with another woman, Kate determines to do anything to get him back. She even overcomes her fear of flying so she can chase him down in the romantic city of lights. Then, while airborne, the panicky Kate meets Luc (Kevin Kline), a somewhat sleazy character who just happens to be a thief -- and who secretly plants a stolen possession in her bag. Luc intends to retrieve the loot when they land; unfortunately a conman grabs the bag first, thwarting Luc's well-laid plans. Soon he and Kate are frantically scouring the beautiful French countryside in hopes of getting back her precious carry-on. The romantic situation hardly goes smoothly, either: Kate continues her obsession with ex-fiancé Charlie, while Charlie's new girlfriend takes a liking to Luc... who unexpectantly falls in love with the broken-hearted Kate.",
      "writers": ["Adam Brooks"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113117/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkzMjg5MDQ3M15BMl5BanBnXkFtZTgwOTM5NTE0MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Meg Ryan, Kevin Kline, Timothy Hutton | See full cast and crew »"],
      "reviews": [
         "I just watched this and fell in love! Everything about it was entrancing! Superb acting, fantastic scenery, and you have got to love that soundtrack! I absolutely love Kevin Kline, and he nailed it again in French Kiss. Can I help it if I like him as a French man? Meg Ryan was astoundingly funny. Comedic performances were perfect and the romantic side was so sweet it will break your heart! If you get the chance to see this, whether it be on TV or whatever, watch it. It will make you laugh out incredibly loud (ahem, like me) and cry at its ending (again, like me). I give this a 10 out of 10. But, then again, that is just me. You'll have to check this out to be the judge of that yourself.",
         "A truly funny piece. It's the one we get out of our collection when we just want to sit down and watch something familiar, funny and just NICE. Meg Ryan reveals herself as a true comedienne and Kevin Kline is the funniest Frenchman you ever loved to hate. So what if we know exactly what's going to happen? That's the way with romantic comedies, as it is with most 'genre' movies. Even after having seen it at least a dozen times, we still laugh when Ryan sneaks up on her absconded fiancee and his new girlfriend and in the process causes major havoc in a posh French cafe; or when Kevin Kline tells her how the uptight nature of the Americans makes his 'ass twitch'.",
         "What's wrong with Kevin Kline's accent? My mother's family are from France and they talk like that...sort of. Well, who cares? This is a fun, fun film and I enjoyed it from title to credits. Meg Ryan in her low key but hyper way (now, if that seems like an oxymoron, watch her performance) is wonderful. BTW, I've set next to her character on an International flight... The story is great. Kline's character is lots of fun and Meg Ryan just melts you. Jean Reno is wonderful as the cop who helps Kline redeem his soul. Also, good work by Timothy Hutton and others. This is a fun film and I'm at a loss as to why the critics slammed Kevin Kline's accent... I found it believable because there are many French accents, depending on the region of origin and Kline is a good-- non, très, très bon acteur.",
         "A Francophile will probably like this film. I did. Meg Ryan plays a woman who's on the verge of marrying a Canadian, so she's denounced her American citizenship. She's also afraid of flying so she stays home while her fiance goes to Paris on business. Things take a turn for the worse when he calls, saying he's met the woman of his dreams and he's staying in France. Frantic to get back her man, she boards a plane. Next to her sits a French thief, beautifully played by Kevin Kline, who has problems of his own, most notably how to smuggle a diamond necklace out of the country. It's a character-driven plot that Cary Grant would have loved - two people who are seemingly so \"repelled\" by each other but all they need are the right elements to fall in love. I'm generally not a fan of the romantic-comedy, but the French setting sucked me in as did a supporting role played by the always excellent Jean Reno. As for the authenticity of Kline's accent, I had a good friend from France who claimed it was \"formidable.\" So there. Very entertaining and worth a watch. Want more French choices? Try \"Frantic\" with Harrison Ford, it's Hitchcockian; \"Green Card,\" who can resist Depardieu?; and my all-time favorite Meg Ryan film \"Addicted to Love.\" It's a great black comedy and it has the sizzlingly sexy Tcheky Karyo. \"C'est magnifique!\"",
         "I absolutely LOVED and adored this movie! Seriously, its a funny romantic comedy, plus there are so many fun lines that you can quote--\"All men are bastards!\" My friends and I have made a habit of watching it every year! Its about a woman, Kate, who has her whole life planned out. Then, her fiancée goes on a trip to France, meets another woman, and calls home to break up with Kate. She decides to go win him back and gets on a plane. On the plane, she meets Luc, a french thief. She ends up going after her fiancée and everything seems to go wrong. Anyways, I would recommend it for just a funny, light hearted, fun with the girls type of movie.",
         "I would basically just like to say that every woman that loves a good romantic comedy should see this movie. I have seen this movie probably over a hundred times and it never gets old. I have it on DVD and yet every time I happen to catch it on TV, I just have to watch it. I know most of the words by heart. Kevin Klein plays the perfect guy you almost love to hate because he makes you so angry for the dumb things he does then turns around and makes you swoon. And then of course Meg Ryan is always the perfect pick for these kinds of films. What can I say other than opposites really do attract in this fun-loving completely romantic movie. This is definitely a classic movie in my mind and a must buy, not rent.",
         "If there is a Kevin Kline in France, that is. This film is one of the better romantic comedies, maybe just because Kevin and Meg are perfect together. Both with excellent comic timing, and a chemistry that was quite wonderful.Jean Reno and Timothy Hutton round out a wonderful cast. The soundtrack is fantastique-I own and listen to it often. Hey-if my husband the NASCAR addict will sit,watch,laugh, and enjoy then I say guys can enjoy this too. The ending scene is inspired, WHAT a kiss! Definitely one to add to your DVD collection. I can't understand the low voting scores since I see so many positive comments here....",
         "This is a really cute little romantic comedy. The story revolves around a young history teacher, Kate, who's afraid of flying but forces herself to hop on a plane for Paris to try and win back her fiancé, Charlie, who has dumped her for a gorgeous French woman. However, her seat mate on the plane happens to be a charming French crook named Luc, who uses the unsuspecting Kate to smuggle his stolen diamond necklace for him. Then, casting himself as an expert in affairs of the heart, he resolves to help Kate win back her man, later complicated by the fact that he falls for her himself. Their adventures across France, from Paris to Cannes, in pursuit of the fiancé and his new girlfriend, make for some pretty amusing scenes. The plot is livened up by the repercussions of Luc's larcenous tricks, little sub-plots with a fellow con artist and a cop who owes him a favour. My sole complaint with this movie is a couple of unnecessary f-words and a fair bit of profanity, especially on Kate's part (taking the Lord's name in vain), reflective of the screenwriters' laziness in avoiding clever dialogue in these scenes. Meg Ryan is her usual cute, bubbly, rather ditsy self in the role of Kate and Timothy Hutton is suitably obnoxious and despicable as Charlie, the fiancé who dumped her. However, the real star of this film is Kevin Kline, who puts genuine charm into the role of this rakishly endearing thief, Luc, and demonstrates an extremely credible French accent, in my opinion. His entire persona here makes it difficult to believe that Kline isn't really French. He must have had a fantastic language coach! Also, there is great on screen chemistry between Meg Ryan and Kevin Kline. It's a delightful, light hearted film, a good date movie, and not necessarily just a chick flick as my husband enjoyed it too.",
         "This was one of the best comedies of the 1990s - with While You Were Sleeping, There's Something about Mary, Four Weddings and a Funeral, Flirting with Disaster, perhaps When Harry Met Sally or Sleepless in Seattle. It's a charming movie. I'm not particularly a Meg Ryan fan - (funny that I just named two of her movies in a top comedy list!). She's at her best here. The movie is funny but has more heart than most comedies - the scenes with Luc's family are lovely and memorable - not at all overdone, just right. The movie's at its best when the principals are all together at Cannes - it becomes less humorous but very warmly romantic. The characters are so well written - there is even sympathy for Timothy Hutton's character. The chemistry between Ryan and Kline (which I wouldn't have believed before I saw it) is very much there. By the time Kevin Kline is singing La Mer over the last of the closing credits (after Louis Armstrong has sung La Vie en Rose), you'll want to see it again. Kevin Kline is just magnificent - a quite real,interesting, amusing person is created. The Meg Ryan character's primness is irritating - but then one must see why Timothy Hutton found her so (comically, the movie's idea of primness is that she was deflowered at 18 not 13!). You'll like it.",
         "Don't ever say all writers are hacks. The writer of French Kiss, sitting next to Kline on the plane, has done a job from a perspective most people will not catch, and you have to give him credit for doing it. I am fairly sure both Ryan, Kline, Reno and the rest were aware of what was going on, but I am equally sure this flew totally over the heads of 99% of the US audiences. For this movie, amongst other things, is a sometimes not so subtle and other times very subtle cut-up on US tourists in Europe. There are so many scenes which have this double entendre - if you get them it's hilarious and heart-warming, if you don't get them, then explaining them will help nothing and serve only to enervate the narrator. And the puns - I've witnessed people seeing this movie over and over and over and not getting them. After half a dozen viewings they suddenly go 'ah' and get it. This is good screen writing. Kline's Parisian sounds spot on. Suspicion is he was coached - and excellently - in the unique 'gutter' accent found in the city of light. This film has everything. It's not your classical 'meets cute' but - where does one begin? Can one ever end? This mini-review has gone on for several hundred words already and the iteration has not started. Get it!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Polygram Filmed Entertainment",
         "Prufrock Pictures",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Kate and Charlie have a perfect life planned out before them: buying a house, marriage, kids, the whole works. Kate's fear of flying keeps her in Canada while Charlie goes to Paris for a medical convention. While there Charlie is smitten by the lovely Juliette. He calls off the wedding with Kate and she nervously boards a plane to get him back. She ends up sitting next to the petty French thief Luc Teyssier. He hides a stolen necklace and smuggled grape vine in her bag to get it through customs. Her bag is stolen, the necklace apparently lost, and Kate and Luc head to Cannes -- Luc to find the necklace and Kate get Charlie back. Along the way, Kate and Luc begin having feelings for each other -- which change the course of their lives.",
         "A woman flies to France to confront her straying fiancé, but gets into trouble when the charming crook seated next to her uses her for smuggling."
      ],
      "budget": 0
   },
   "movielensId": 236,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1995-05-05",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Lawrence Kasdan"],
      "runtime": 111,
      "movieId": 236,
      "title": "French Kiss",
      "mpaa": "PG-13",
      "actors": [
         "Meg Ryan",
         "Kevin Kline",
         "Timothy Hutton",
         "Jean Reno",
         "Adam Brooks",
         "François Cluzet",
         "Suzan Anbeh",
         "Renée Humphrey"
      ],
      "imdbMovieId": "0113117",
      "originalTitle": "French Kiss",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["N3W5oAOZAWY"],
      "plotSummary": "French Kiss is director Kasdan’s best film since the Bodyguard. The plot involves a couple in love and one woman’s attempt to fly to Paris to get her lover back from a business trip and marry him. On the way she unknowingly smuggles something of value that has a petty thief chasing her across France as she chases after her future husband.",
      "tmdbMovieId": 397,
      "avgRating": 3.30605,
      "releaseYear": "1995",
      "numRatings": 13617,
      "posterPath": "/bZqvonwVru1XtnniQZgZRa3Znyk.jpg"
   }
}