{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "trailer park",
            "id": 900
         },
         {
            "name": "pop culture",
            "id": 1740
         },
         {
            "name": "drug dealer",
            "id": 2231
         },
         {
            "name": "heroin",
            "id": 2671
         },
         {
            "name": "fetishism",
            "id": 2843
         },
         {
            "name": "spanner",
            "id": 2874
         },
         {
            "name": "excrements ",
            "id": 3443
         },
         {
            "name": "disgust",
            "id": 3444
         },
         {
            "name": "dog dirt",
            "id": 3445
         },
         {
            "name": "van",
            "id": 4580
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "adult humor",
            "id": 11192
         },
         {
            "name": "unsimulated sex",
            "id": 12420
         },
         {
            "name": "cult classic",
            "id": 165580
         },
         {
            "name": "drag",
            "id": 171636
         },
         {
            "name": "hitchhike",
            "id": 206977
         }
      ],
      "imdb_id": "tt0069089",
      "video": false,
      "title": "Pink Flamingos",
      "recommendations": [
         14267,
         14269,
         14262,
         14195,
         11855,
         13702,
         53380,
         20850,
         116180,
         25625,
         30645,
         290991,
         119064,
         19236,
         11822,
         4241,
         27813,
         48636,
         129970,
         1559
      ],
      "backdrop_path": "/gsOZZZbvb8F1ptfbvPtm0FVIrox.jpg",
      "revenue": 6000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Divine / Babs Johnson",
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d22b",
               "name": "Divine",
               "profile_path": "/A3uiSXlOpCJ5ycYO0TGZ0YF9VRT.jpg",
               "id": 10369,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Raymond Marble",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d22f",
               "name": "David Lochary",
               "profile_path": null,
               "id": 10370,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Cotton",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d233",
               "name": "Mary Vivian Pearce",
               "profile_path": null,
               "id": 10371,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Connie Marble",
               "gender": 1,
               "credit_id": "52fe426bc3a36847f801d237",
               "name": "Mink Stole",
               "profile_path": "/ew1Ro2VvDR1YjaJAvO7ZjTNe7oK.jpg",
               "id": 9292,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Crackers",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d23b",
               "name": "Danny Mills",
               "profile_path": null,
               "id": 10372,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Edie",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d23f",
               "name": "Edith Massey",
               "profile_path": "/hObN98deAAKsHHC6gJhps2CrUdk.jpg",
               "id": 10373,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Channing",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d243",
               "name": "Channing Wilroy",
               "profile_path": null,
               "id": 10374,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Cookie",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d247",
               "name": "Cookie Mueller",
               "profile_path": null,
               "id": 10375,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Suzie",
               "gender": 1,
               "credit_id": "52fe426bc3a36847f801d24b",
               "name": "Susan Walsh",
               "profile_path": null,
               "id": 10376,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Linda",
               "gender": 0,
               "credit_id": "52fe426bc3a36847f801d24f",
               "name": "Linda Olgeirson",
               "profile_path": null,
               "id": 10377,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Party Guest",
               "gender": 2,
               "credit_id": "593dd21a92514105e2024485",
               "name": "Jack Walsh",
               "profile_path": "/3zQboyL6xA1U6MIOGdaUhLTZjbi.jpg",
               "id": 1832086,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d203",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d209",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d20f",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d215",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d21b",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d221",
               "name": "Vincent Peranio",
               "profile_path": null,
               "id": 10368,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe426bc3a36847f801d227",
               "name": "Vincent Peranio",
               "profile_path": null,
               "id": 10368,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 9.246695,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 692,
      "vote_count": 142,
      "budget": 12000,
      "overview": "Notorious Baltimore criminal and underground figure Divine goes up against Connie & Raymond Marble, a sleazy married couple who make a passionate attempt to humiliate her and seize her tabloid-given title as \"The Filthiest Person Alive\".",
      "similar": [
         449176,
         376867,
         1378,
         1213,
         1429,
         627,
         11386,
         338189,
         455661,
         258480,
         16367,
         428493,
         3134,
         184352,
         4927,
         11000,
         12143,
         26280,
         468,
         1420
      ],
      "original_title": "Pink Flamingos",
      "runtime": 93,
      "poster_path": "/oRNBSoftw842k8cHQMjczZJ3z3A.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Dreamland Productions",
         "id": 407,
         "origin_country": ""
      }],
      "release_date": "1972-03-12",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "An exercise in poor taste",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Waters"],
      "runtime": 93,
      "synopsis": "The film opens on a view of a pink trailer that seems to be located in a clearing near a rural wooded area. A voiceover narrator identifying himself as Mr. J (John Waters) discusses the current status of \"notorious beauty\" Divine (Divine), who has gotten tabloid attention due to her criminal career. The tabloids have given Divine the title of \"Filthiest Person Alive\", and the coverage has forced her to disguise herself. She has adopted the alias of Babs Johnson and retreated to this rural trailer just outside Baltimore. She lives there with her son, Crackers (Danny Mills), and a young woman named Cotton (Mary Vivian Pearce), whom Mr. J identifies as Divine's \"traveling companion\". Also living in the trailer is Edie (Edith Massey), Divine's obese, senile mother. Inside the trailer, Edie has awakened and calls out to Babs; Edie sleeps in a playpen in the living room, wearing nothing but a bra, girdle and underpants. Edie demands that Babs bring her eggs, and we come to understand that Edie is obsessed with eggs. When Babs doesn't respond soon enough, Edie tries to get Cotton to bring her eggs. Babs appears first, wearing a garish outfit. Her hair is an unnatural bright yellow color, with an unusually high hairline and a fall attached. Babs and Edie have a brief discussion, with Babs being very patient and accomodating of her obviously feeble-minded mother. Edie calls the trailer a \"train\", and worries about when the Egg Man (Paul Swift) is going to stop by. Babs assures her that they still have eggs that she can prepare for her. Mr. J then discusses Connie (Mink Stole) and Raymond Marble (David Lochary), whom he calls \"two jealous perverts\" who are insanely jealous of Divine's fame. Connie is a strange looking woman with hair dyed bright red. We meet her as she is conducting a strange job interview in her home. She tells a young woman named Sandy Sandstone (Nancy Crystal) that she cannot offer her employment because she does not know enough about Divine; apparently, the Marbles intend to spy on Divine and learn details about her lifestyle. Connie is a snobbish woman who belittles Sandy and infuriates her until she storms out in a rage. The film cuts back and forth between Divine's family and the Marbles, as they progress on a collision course with one another. Divine and Crackers go into town to run errands in Divine's Coup De Ville. Along the way, they deliberately run a jogger (Steve Waters) off the road and pretend to pick up a soldier (Elia Katz) hitch-hiking home, pulling away at the last minute before he can get in the vehicle, much to the amusement of Divine. Connie then meets with a lesbian couple (one of them Pat Lefaiver) who have come to her to adopt a baby. While Connie is talking to them, she sends her servant, Channing (Channing Wilroy) into the basement. There are two young women imprisoned down there, one dead (Marina Melin) and one alive and enraged. The dead woman has just given birth and Channing takes the baby upstairs so Connie can sell it to the lesbian couple. Before he leaves, the surviving girl, Susie (Susan Walsh), verbally berates Channing and curses him for his role in her kidnapping. She, too, is pregnant, and Channing is the father. Channing impregnates the women and gets rid of the bodies when they die in childbirth. After she parks the car, Crackers goes off on his own to make a date he has with a young woman. In a small grocery store, Divine shoplifts a steak from the butcher counter by discarding the wrapping paper and concealing the meat under her dress between her legs. She strolls through downtown Baltimore and turns the heads of passersby, then walks through a suburban neighborhood and urinates on the front lawn of a large stately home. We then see Raymond Marble, whose long hair is dyed bright blue. Raymond has a fetish for indecent exposure; he lurks outside of an office building and follows two young women as they walk to a park to eat their lunch. Raymond sneaks up behind them while wearing a bizarre mask, then opens his long coat to reveal his penis hanging outside his pants with a long piece of sausage attached to it. The girls run off screaming and he takes the purses they have left behind. Later, Raymond and Connie welcome Cookie (Cookie Mueller) to their home. Cookie is a young woman who tells the Marbles that she can get them information about Divine because she is Crackers's date for the afternoon. The Marbles reveal their scheme: learn about Divine's private life and find the best way to disgrace her, while simultaneously seizing her title as \"The Filthiest Person Alive\". The Marbles tell Cookie about their baby ring, and they reveal that they also own several pornography shops and front money to heroin pushers in elementary schools. They feel that this is much filthier than Divine, and are resentful of the attention she has gotten. Cookie and Crackers go back to the trailer, where Cookie has a private conversation with Edie. Edie reveals that it is Babs's birthday and a party is planned. She also tells Cookie a few things about their home life. Meanwhile, Crackers excitedly talks to Cotton about his date, and tells her he has something special planned. Cotton is a voyeur who likes to watch Crackers in sex acts with women, and insists that Crackers never touch her personally. After introducing her to Cotton, Crackers takes Cookie to the little shed behind the trailer that he uses as a private bedroom. Inside, Crackers and Cookie are naked on the dirty cot, and Crackers shoves two live chickens at Cookie's nude body while she screams in horror. The chickens claw large scratches on her body, and in the process become crushed and killed between the bodies of Crackers and Cookie. Crackers slits the throat of one chicken and the blood gets all over the two of them. Cotton watches all of this from the window of the shed, shuddering in ecstasy. Immediately afterwards, the Egg Man pays a visit to the trailer, calling out as he arrives. Edie hears him and becomes excited, screaming out for him as if she's afraid he will not stop otherwise. Cotton arrives and invites the Egg Man to Babs's birthday party, then she buys all of the Egg Man's eggs for Edie. Back at the Marbles, Raymond and Connie are making love by sucking each others toes, and we can see that their pubic hair is dyed to match the bright blue and red color of their hair. A phone call from Cookie interrupts them and she gives them the information she has collected about Divine's living arrangement and her birthday party. \"You have no idea what I had to go through to get that information!\" she tells them. The Marbles are thrilled that they know personal details about Divine, and they send her a surprise package in the mail--the address simply reads \"Babs Johnson, A Trailer, Phoenix, Maryland\". At the trailer, Divine prepares the steak she shoplifted and feeds it to her family. A postman (Bob Skidmore) interrupts their dinner, and Divine confronts him angrily, furious that someone has dared to approach the trailer. When he runs off, she unwraps the package to discover human excrement inside. A birthday card announces that Divine is no longer The Filthiest Person Alive. Divine flies into a rage, swearing vengeance for the obscene gesture. Connie and Raymond kidnap Linda (Linda Olgeirson), another young woman, after picking her up while hitch-hiking. They drug her and have Channing place her in the basement, where Susie begins to rant at him again. Channing, who is disgusted that part of his job is to have sex with unconscious women and get them pregnant, has devised a new method: he masturbates into his hand and uses a syringe to inject the semen into Linda's vagina. Things progress. The Egg Man proposes marriage to Edie and she accepts, and he promises to take her to a large poultry factory for their honeymoon. The birthday party goes ahead as planned, with scores of guests indulging in all sorts of decadent behavior. Raymond and Connie, aware of the party, sneak up into the woods and watch from a distance as Divine snorts drugs with a friend, a woman performs a striptease with a snake, and in one of the movie's most memorable moments, a nude man throws his legs over his head an demonstrates his unusual ability to make his anus dilate rapidly over and over. Raymond and Connie are shocked at this display, and promptly phone the police to report Divine's party. The police arrive, but Divine and her group assassinate them with their bare hands, ripping their bodies apart and eating them raw as in \"Night of the Living Dead\". Connie and Raymond, gloating over the fact that they've called the cops on Divine, return home to discover Channing dressed in Connie's clothes, imitating both Raymond and Connie. Furious, they lock him in his \"room\", which is really just a closet. They then set out for their final act of vengeance: to burn down Divine's trailer. Raymond finds time to stop at the local park to commit another act of indecent exposure, but he is horrified when his victim, a lovely young woman putting on makeup in the park, opens her dress to reveal that \"she\" has male genitals. She laughs with glee as Raymond runs off. Divine and Crackers, having learned of the Marbles through gossip, invade the Marble residence, licking the furniture and rooms to \"curse\" the house. To further contaminate the dwelling, Divine and Crackers commit an act of incest, with Divine performing oral sex on him. They are interrupted by the sound of Channing, still locked inside the closet. They tie him up and intimidate him into telling them about Connie and Raymond. He also mentions the girls in the basement, and they take him downstairs to verify it. Sure enough, the imprisoned girls are there. Divine and Crackers disapprove of this variety of depravity committed by the Marbles, and they free the girls, allowing them to castrate Channing as an act of revenge. Meanwhile, the Marbles invade Divine's trailer, now empty due to Edie's departure with her new husband. They pour gasoline all over and ignite it, delighting in their final act of aggression toward their enemy. After the Marbles run off, Divine returns with Crackers and Cotton to find the trailer ablaze. Beside herself with sorrow and rage, she sets out to seize the Marbles immediately. When the Marbles return home, they discover their house has been contaminated. Their sofa and chair \"reject\" Connie and Raymond, spitting them onto the floor when they try and sit. The rest of the house reacts similarly as the Marbles walk through it in a panic. Discovering Channing's \"room\" empty, they wonder if he's set the girls free. In the basement pit, they find Channing's body, castrated and bled out. The girls are gone. Connie and Raymond assume the girls have sent for the police and they try to flee, but Divine, Cotton, and Crackers are waiting for them in the living room. They abduct the Marbles, tying them up and taping their mouths shut, and drag them back to the site of the trailer for a \"trial\" and execution. Divine summons the local tabloid press for exclusive coverage of the event. Representatives from three tabloids arrive and witness the mock trial for Connie and Raymond. Crackers and Cotton provide testimony and pronounce the verdict and punishment: guilty, with the death penalty to follow. After tarring and feathering the bound couple, Divine executes them with a handgun. The reporters thank her for the scoop and depart to write their articles, while Divine has a discussion with Cotton and Crackers about their next move. They decide to change their appearances and move to Boise. Mr. J discusses their reputation in the last scene of the movie, which depicts the trio preparing to leave Baltimore for Boise. Divine spots a small dog moving its bowels, and in one movement, she kneels down and picks up the excrement and puts it in her mouth, chewing it briefly before spitting it out. The camera zooms in for a closeup of her face as she smiles and ends the movie. Pat Moran...Patty Hitler (Party Guest In Nazi Uniform) Jack Walsh...Party Guest Jackie Sidel...Party Guest Julie Munshauer... Party Guest Steve Yeager... Nat Curzan from \"The Tattler\" George Figgs... Bongo player John Oden... Onlooker George Stoll... Onlooker David Gluck... Onlooker Elizabeth Coffey...Chick with a Dick Margie Donnelly...Onlooker Margie Skidmore...Brunette in park Berenica Cipcus... Blonde in park Iris Burman... Party Guest Randy Burman... Man at deli with hot dog pack / Party Guest Don Blumberg... Party Guest Vincent Peranio ... Musician at party Bob Adams... Police officer who gets shot Mark Lazarus... Officer David Lehman... Party Guest Catriona Maloney... Party Guest Richard Keller.. Cab Driver Charlie Swope... Party Guest Barry Golome...Party Guest Ed Peranio... Party Guest Elia Katz... Army Guy Billy Davis...Party Guest Howard Gruber... Party guest sniffing popper Van Smith... Guest at party in drag Chuck Yeaton... Deli clerk Laurie Birnbaum... Party Guest Lenny Taylor... Extra Trick Grantham... Party Guest Mark Isherwood... Party Guest Randy Damm... Party Guest Alan Reese... Party Guest Alberta Reese... Party Guest Cowboy Foulke... Party Guest David Sander... Party Guest Brigette Grey... Party Guest John Herndon... Party Guest Ellis Clark... Party Guest Joe Wilepski ...Party Guest Jimmy Hutzler... Party Guest Paul Landis... Party Guest Lawrence Irvine... Party Guest Max Mueller... Noodles (uncredited)",
      "writers": ["John Waters"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0069089/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0OTMzNzAxN15BMl5BanBnXkFtZTYwNDgxMTg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Divine, David Lochary, Mary Vivian Pearce | See full cast and crew »"],
      "reviews": [
         "I first saw Pink Flamingos in the mid 70's, back before VCRs. A college dorm had rented a print, and in a drunken state I've not achieved again this past quarter-century, I went to see it. Having finally seen it again only recently, this time sober, I'm here to tell you... it looks a hell of a lot better when you're drunk. Those who call it \"great\" or a \"masterpiece\" are plain wrong, they don't recognize what they are seeing. The camera work is a hair's breadth above home movies; the acting and story are... well, they are better than in porn flicks and even some straight-to-video movies, but, jeez, not by much. And then there is the primary purpose behind Pink Flamingos -- to make the most disgusting, revolting movie possible, perhaps even conceivable. But... BUT... Pink Flamingos is distinctive. Even if you - yes YOU out there - the reader, wanted to make the most disgusting movie in the world and even if you had the money and the skills that John Waters lacked in 1972, you couldn't make a film as good as he did. Yes, GOOD! You couldn't because, first of all, I doubt you have the same quality of acquaintances that Waters had and put into into his early movies. And it's not just a matter of WHAT they will do, but HOW they do it. Waters' actors had a style, no matter how bizarre, that is rarer than most depravities. Could YOU recognize the virtues of, let alone even find, someone like Edith Massey? I doubt it. Which leads to the second point. Pink Flamingos has panache! It has a free-wheeling sense of daring-do that borders on innocent fun. So, although the movie is so disgusting that I wish it had never been made, it is not a squalid film. And I don't think YOU, the reader, or anyone other than Waters could have pulled that off. It doesn't make Pink Flamingos a masterpiece. It does make it unlike any other film.",
         "\"Pink Flamingos\" is a cult classic.The plot of this film revolves around the throwdown challenge to Divine's supremacy as the filthiest person alive.\"Pink Flamingos\" contains some memorably repulsive scenes like a sex scene with a chicken and the scene where Divine eats fresh dog feces.Yes,the movie is shocking and funny at the same time,but the biggest laughs come from the actors' lines.Check out especially this line from Divine:\"Kill everyone now!Condone first degree murder!Advocate cannibalism!Eat s***!Filth is my politics!Filth is my life!\".On the whole,I really enjoyed this film.Still its tagline \"An Exercise in Bad Taste\" should be taken to heart and even those used to the gross out movies today may find this gem hard to stomach.Highly recommended.",
         "On the surface \"Pink Flamingos\" could easily be dismissed as a nostalgic piece of shock cinema. With an unparalleled level of notoriety -- based almost entirely on the final scene, the film has become a curiosity of sorts and a right of passage for those testing their own boundaries of decency. Beneath this seedy exterior however, lies a brilliant and biting satire of society's obsession with fame and the lengths one will go to in order to achieve it. This theme is relevant even more so today than it ever was. Just consider the over abundance of reality TV shows, for example 'Fear Factor' \u0096 a show boasting contestants eager and willing to outdo one another by performing a variety of dangerous stunts and eating unimaginable specimens \u0096 how is this any different than the characters in 'Pink Flamingos' attempting to outdo one another in an effort to claim the dubious title of the filthiest people alive? Society is (and has always been) captivated with sensationalism; from the Roman era and the coliseum packed with bloodthirsty audiences, to modern day and the likes of the 'Jerry Springer Show' (of which Babs Johnson and the Marbles would make excellent guests!!). The purpose of \"Pink Flamingos\" is to not only put a hilariously depraved spin on the fascination with celebrity but to also provide a cautionary tone to the dissolution of society itself. The performances are all top-notch; especially the ever-dependable and over-the-top Mink Stole, as heartless Connie Marble; and scene stealing Edith Massey, as Edie 'The Egg Lady'. It's amazing that the film is over thirty-years old because the message is just as fresh today as it was back in 1972.",
         "Like those who listened to radio reports about the attack on Pearl Harbor, every one who has ever seen PINK FLAMINGOS can tell you exactly where they were when they first saw it--and some thirty years later the movie is still one of the most unspeakably vile, obnoxious, repulsive, and hilariously funny films ever put to celluloid, guaranteed to test the strongest stomachs and the toughest funny bones. Filmed with a close-to-zero budget and some of the shakiest cinematography around, PINK FLAMINGOS tells the story of two families that compete for the tabloid title of \"The Filthiest People Alive.\" Just how filthy can they be? Plenty: the film includes everything from sex with chickens to what I can only describe as a remarkable display of rectal control to a heaping helping of doggie doo, and I guarantee that you won't want to eat an egg for at least several weeks after seeing it. The cast is either wonderful, atrocious, or atrociously wonderful, depending on how you look at it. The star, of course, is Divine... and to describe Divine as the BIGGEST drag queen on the planet would the understatement of the year. She is a mammoth creature given to BIG eye makeup, BIG orange hair, and BIG expressions--she is the Charleton Heston of drag, and whether she is almost running down a jogger, pausing to use the bathroom on some one's front lawn, or startling real-life shoppers by taking a stroll along a Baltimore sidewalk she is both unspeakable and unspeakably funny. Others in the cast include Mary Vivian Pearce, Danny Mills, and the ever-appalling Edith Massey as members of Divine's family; and Mink Stole and David Lochary as the white-slaving, baby-selling couple who challenge Divine's status. It should be pretty obvious that PINK FLAMINGOS is not exactly a movie that will appeal to just every one, and viewers who know director John Waters only through such later films as HAIRSPRAY and CRYBABY will be in for a major jolt. But if you want to see something so completely different that even Monty Python couldn't imagine it, this is the movie for you. Just make sure you eat before you see it, because you probably won't want to eat afterward--and you might want to keep a barf bag handy just in case. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "There is no film to put beside Pink Flamingos by way of comparison. It is a film genre of it's own. I read and hear reviews of this movie that express disgust and horror and I picture John Waters chuckling. This was the intent, it was meant to upset the status quo and in \"politically correct\" times that we live in, isn't it a small surprise to see this film come to the forefront again? This is a movie that will freak out the uptight for as long as it exists in any media. It was meant to. As much as \"Clockwork Orange\" talked about \"ultraviolence\" this movie is all about ultra-bad taste. We can numb ourselves to sex and violence but Pink Flamingos is a movie you just will never get used to. There will be something in this movie that will get to you. As a last resort to make sure everyone is offended before you leave the theatre, John includes the always discussed poodle scene. No reason for this scene, except to make sure he gets you and also to make sure you leave talking about it. Obviously filmed on a budget, and using Water's stock cast, this is a movie simply about a contest to see who are the filthiest people alive. All the characters are bizarre in one way or another. This movie reminds me of \"Rocky Horror Picture Show\" in that everyone in the film has something odd about them and both movies joyfully celebrate these uniquenesses. Not a movie to buy for Mom on Mother's Day... but worth seeing just to say you did.",
         "My 10/10 rating of course applies only if you're willing to get completely and utterly grossed out*. Because you know that only John Waters can do that. In \"Pink Flamingos\" (his directorial debut), he portrays two families locked in combat to see who can be the filthiest person alive. What Divine famously does at the end pretty much answers the question. But even aside from that, the movie is basically an excuse to shock people beyond what anyone would usually imagine. You had better have a very strong stomach to watch this movie. Even some of the lines are rather mind-blowing. *Otherwise, avoid this movie like you would the ebola virus!",
         "A very strange, disturbing but intriguing film. I don't think I ever needed to see what a human being can do with his butt, and I doubt if I'll ever want to see it again. That said, there is much to be amused by, like Divine's take on Jayne Mansfield's classic walk in \"The Girl Can't Help It\" and putting slabs of meat between her legs in a grocery store. A gritty feel very much like a Russ Meyer film. Generally poor acting, with the notable exception of Divine.",
         "The filthiest person alive, Divine, is using the codename Babs Johnson and living in a trailer in the woods with her retarded mother Eddie (Edith Massey), who loves eggs; her mad hippie son Crackers (Danny Mills); and her mate Cotton (Mary Vivian Pearce). The envious couple Connie (Mink Stole) and Raymond Marble (David Lochary), who abduct and impregnate female hitchhikers to sell their babies to gay and lesbian couples, using the money to invest in heroin and sell in schools, hire Cookie (Cookie Mueller) to have sex with Crackers and spy Divine to compete for the title of \"the filthiest people alive\". When the competition begins, Connie and Raymond Marble learn why Divine has this title. The underground \"Pink Flamingos\" is outrageously sick, disgusting and grotesque\u0085 but also funny. John Waters' intention is certainly to shock the audiences and is certainly very well succeeded. The bizarre characters present some of the most scatological and gross scenes I have ever seen, like Divine chewing excrement of dog, or Crackers \"singing\" with his anus, and there is no limit for the sick mind of John Waters. The viewer has to have empty stomach to see the whole movie. In the Extras of the DVD, John Waters presents deleted scenes, inclusive with the fate of Cookie. The trailer used to promote the film in 1972 is hilarious, since it does not show any scene, but people being interviewed about the movie. My vote is five. Title (Brazil): \"Pink Flamingos\"",
         "Mild spoilers: I like it when a filmmaker is able to surprise or shock me. . I hate people who only go to movies that make them feel good and never challenge them. I admire directors who try to push people's buttons. I bring this up because while watching Pink Flamingos (1972) my most profound feeling was one of extreme boredom. Apparently a lot of people are convinced this movie is disgusting and shocking, which leads me to believe they've been living under rocks or the roof of a protective, loving family. Throughout most of PF, the bad pacing and incredibly bad acting were enough to obscure whatever `shocking/disgusting' things might have been happening on screen. The acting in PF is by far the worst aspect of the film and no doubt greatly contributes to the shoddy pacing. No one gives anything even approaching an amateurish performance. The actors shout out their extremely bad lines with great force yet at the same time manage to sound as if they're reading from a cue card. Either that or they seem so self-conscious that it impossible to ignore the fact that they're trying to act and are failing miserably. Take the four reporters at the end who show up to cover the trial of Raymond and Connie Marble. They were not even for one minute convincing enough to portray fake reporters let alone real or even satirical reporters. So we sit through truly agonizing conversations, which makes scenes seem even longer than they really are, as we sit and endure and finally beg for the people in the film (I refuse to call them actors) to shut up. Eventually they do, but Waters mostly fills these pauses with long shots of something or other (often people walking), followed by brief spurts of `action' (in the kicking down of doors sense of the word) and confrontation, which inevitably lead to yet more excruciating discussions. Basically, it takes far too much time and far too much talk to do anything in Pink Flamingos, which at 108 minutes would still be too long if cut to 60. There are perhaps 35 minutes of concise action and less than 10 minutes of salvageable dialogue that could be culled into a far better film. In truth, there was one aspect of the movie that offended me. I refer, of course, to the scene in which Crackers has a three-way with Cookie and a chicken and in the process swings the chicken around by its neck. It didn't bother me at all that he seemed to be raping Cookie, but I was incensed by the abuse suffered by that animal. As if swinging it around and stuffing it between them wasn't bad enough, the actions taken by Danny Mills (the man playing Crackers) appeared to have killed that chicken. I understand that animals are often used in movies and may come to be injured or even killed by accident, but when that injury seems to be the direct result of abuse by a cast member, I find that utterly unjustifiable. In fact, I find it so reprehensible that that removed any possible impact the film may have held. I went through the rest of the film thinking `Crackers is a filthy asshole being played by a guy who is a cruel jerk.' Perhaps part of the problem is that I wasn't even born until 9 years after PF was released and didn't see it until a full thirty years after it's first screenings. Whatever it is trying to satirize means nothing to me. I can understand why it might have been offensive to audiences in the 70's (the swearing, the violence, the full frontal nudity) but most of it is old hat to me (okay, except for Divine eating dog feces at the end. I will admit that I found that relatively gross). South Park, Meet The Feebles, Dead Alive, all of these not only shocked me more, were more gruesome (the climax of Dead Alive used 300 liters of blood shooting out at 5 gallons a second - from a lawnmower), but are also far more clever than Pink Flamingos",
         "Babs Johnson (Divine) lives in a trailer with her son Crackers, her daughter Cotton and her mother Edie (Edie Massey). She's in competition with a couple named Connie and Raymond Marbles (Mink Stole, David Lochary) to be named the filthiest person alive. The film shows their attempts to outdo each other. This film is very much NOT for everyone. It's a in your face no holds barred assault in bad taste. Crackers has sex with a woman with a live chicken between them while his sister watches; the Marbles pick up female hitchhikers, impregnate them, keep them chained in the basement and sell the babies to lesbian couples; Divine and family have a party which includes cannibalism etc etc. It's disgusting but, in a way, not unwatchable. It's SO over the top and is so unapologetic about it that it's kind of fascinating. As director John Waters might say, it's bad taste done well. Also it's kind of amusing to watch--the acting is so wretched (especially by Massey) that you just watch it in disbelief. A friend laughed out loud at how bad Massey was (she improved in later pictures). This is NOT for people who are easily offended. Even though it's over 30 years old it's STILL shocking. However if you have an open mind and can take a lot of extreme behaviour this is a must-see. The only part that really was too much is what Divine does at the very end."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Horror"
      ],
      "productionCompanies": ["Dreamland"],
      "summaries": [
         "Sleaze queen Divine lives in a caravan with her mad hippie son Crackers and her 250-pound mother Mama Edie, trying to rest quietly on their laurels as 'the filthiest people alive'. But competition is brewing in the form of Connie and Raymond Marble, who sell heroin to schoolchildren and kidnap and impregnate female hitchhikers, selling the babies to lesbian couples. Finally, they challenge Divine directly, and battle commences...",
         "The filthiest person alive, Divine, is using the codename Babs Johnson while living in a trailer in the woods with her mother Eddie, who loves eggs, her mad hippie son Crackers and her mate Cotton. The envious couple Connie and Raymond Marble, abduct and impregnate female hitchhikers to sell their babies to gay and lesbian couples. The money they make is invested in heroin that's sold in schools. They hire Cookie to have sex with Crackers and spy Divine to compete for the title of \"the filthiest people alive\". When the competition begins, Connie and Raymond Marble learn why Divine has this title.",
         "In a trailer outside of Baltimore lives Divine, under the fake name Babs Johnson. Hiding from the press after being granted the title \"filthiest person alive'', she also has her mom (Who idolizes eggs), her equally criminal some Crackers, and girlfriend Cotton. Despite occasional visits by neighborhood friendly Mr. Eggman, an upper-class couple name the Marbles do all they can do so they can be even filthier that Divine is. Now it's a battle between the filthiest.",
         "Notorious Baltimore criminal and underground figure Divine goes up against Connie & Raymond Marble, a sleazy married couple who make a passionate attempt to humiliate her and seize her tabloid-given title as \"The Filthiest Person Alive\"."
      ],
      "budget": 10000
   },
   "movielensId": 2361,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1972-03-12",
      "dvdReleaseDate": "2001-10-02",
      "directors": ["John Waters"],
      "runtime": 93,
      "movieId": 2361,
      "title": "Pink Flamingos",
      "mpaa": "",
      "actors": [
         "Divine",
         "David Lochary",
         "Mary Vivian Pearce",
         "Mink Stole",
         "Danny Mills",
         "Edith Massey",
         "Channing Wilroy",
         "Cookie Mueller",
         "Susan Walsh",
         "Linda Olgeirson",
         "Jack Walsh"
      ],
      "imdbMovieId": "0069089",
      "originalTitle": "Pink Flamingos",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["-3NkIHPs5t4"],
      "plotSummary": "Notorious Baltimore criminal and underground figure Divine goes up against Connie & Raymond Marble, a sleazy married couple who make a passionate attempt to humiliate her and seize her tabloid-given title as \"The Filthiest Person Alive\".",
      "tmdbMovieId": 692,
      "avgRating": 3.2997,
      "releaseYear": "1972",
      "numRatings": 1338,
      "posterPath": "/oRNBSoftw842k8cHQMjczZJ3z3A.jpg"
   }
}