{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "transvestism",
            "id": 108
         },
         {
            "name": "transvestite",
            "id": 640
         },
         {
            "name": "cult film",
            "id": 34117
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "hermaphrodite",
            "id": 239393
         },
         {
            "name": "pseudo-surrealism",
            "id": 239394
         },
         {
            "name": "experimental film",
            "id": 240650
         }
      ],
      "imdb_id": "tt0045826",
      "video": false,
      "title": "Glen or Glenda",
      "recommendations": [
         23020,
         36489,
         32623,
         28172,
         27313,
         25028,
         29343,
         127148,
         26326,
         249011,
         67430,
         144943,
         126218,
         85461,
         47841,
         115039,
         28177,
         47827,
         86502,
         22642
      ],
      "backdrop_path": "/glMaYzQZMutdKNWzPi3mx7KrFCh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "(as Daniel Davis) Glen, aka Glenda",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e4d",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Barbara",
               "gender": 1,
               "credit_id": "52fe447cc3a368484e025e63",
               "name": "Dolores Fuller",
               "profile_path": null,
               "id": 99126,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Dr. Alton (Narrator)",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e67",
               "name": "Timothy Farrell",
               "profile_path": null,
               "id": 100348,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Ann, aka Alan",
               "gender": 0,
               "credit_id": "5a3f27ae9251411f3e018a2a",
               "name": "'Tommy' Haynes",
               "profile_path": null,
               "id": 1947279,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "X",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e45",
               "name": "Bela Lugosi",
               "profile_path": "/nI14KbMwRNyl8v2Ds5TVAzhu5No.jpg",
               "id": 1547,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Inspector Warren",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e49",
               "name": "Lyle Talbot",
               "profile_path": "/gHbCftyesSSHRCEClOQUOVjISV8.jpg",
               "id": 34119,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "The Devil / Glen's Father",
               "gender": 0,
               "credit_id": "5a3f27e10e0a264fd2003407",
               "name": "'Captain' DeZita",
               "profile_path": null,
               "id": 1947283,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Johnny, Glen's friend",
               "gender": 0,
               "credit_id": "5a3f27f50e0a264fb90035b3",
               "name": "Charles Crafts",
               "profile_path": null,
               "id": 1947285,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Sheila, Glen's sister",
               "gender": 0,
               "credit_id": "5a3f28399251411fab019f23",
               "name": "Evelyn Wood",
               "profile_path": null,
               "id": 1947289,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Nurse Stevens",
               "gender": 0,
               "credit_id": "5a3f28250e0a264fd200345a",
               "name": "Shirley Speril",
               "profile_path": null,
               "id": 1947288,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Patrick-Patricia",
               "gender": 0,
               "credit_id": "5a3f28819251411f9d019e24",
               "name": "'Mr. Walter' Hadjwiecyz",
               "profile_path": null,
               "id": 1947290,
               "order": 10
            },
            {
               "cast_id": 9,
               "character": "Banker / Reporter / Pickup Artist",
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e6b",
               "name": "Conrad Brooks",
               "profile_path": "/ccuggOAsOHthPN1kdhDbhH69Xwn.jpg",
               "id": 97824,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Man with Receding Hairline",
               "gender": 0,
               "credit_id": "5a3f280ec3a36859160037ed",
               "name": "Henry Bederski",
               "profile_path": null,
               "id": 1947287,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Judge",
               "gender": 0,
               "credit_id": "5a3f2893c3a368589000323f",
               "name": "William C. Thompson",
               "profile_path": null,
               "id": 65502,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Janitor at Patrick's Apartment",
               "gender": 0,
               "credit_id": "5a3f28a49251411f3e018b55",
               "name": "George Weiss",
               "profile_path": null,
               "id": 90770,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e53",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe447cc3a368484e025e59",
               "name": "William C. Thompson",
               "profile_path": null,
               "id": 65502,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe447cc3a368484e025e5f",
               "name": "George Weiss",
               "profile_path": null,
               "id": 90770,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e71",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe447cc3a368484e025e77",
               "name": "Edward D. Wood Jr.",
               "profile_path": "/8ZoVOGxMYwamLR3Unlkrq3rpSQ2.jpg",
               "id": 44763,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5a3f2918c3a36858e4003528",
               "name": "Jack Miles",
               "profile_path": null,
               "id": 1947292,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5a3f292c0e0a2620e901e9f3",
               "name": "Harry Thomas",
               "profile_path": null,
               "id": 1066814,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "5a3f295cc3a36858e0003884",
               "name": "Dr. William Baker",
               "profile_path": null,
               "id": 1947294,
               "department": "Crew",
               "job": "Other"
            },
            {
               "gender": 0,
               "credit_id": "5a3f297c0e0a264f85003734",
               "name": "Sanford H. Dickinson",
               "profile_path": null,
               "id": 1947295,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5a3f2990c3a36858e00038ca",
               "name": "Ben Winkler",
               "profile_path": null,
               "id": 1341042,
               "department": "Sound",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "5a3f29a6c3a36858e40035d7",
               "name": "Bud Schelling",
               "profile_path": null,
               "id": 1947296,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a3f29c0c3a36858c50039e7",
               "name": "Scott McCloud",
               "profile_path": null,
               "id": 935748,
               "department": "Crew",
               "job": "Second Unit"
            }
         ]
      },
      "genres": [],
      "popularity": 2.445781,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24018,
      "vote_count": 37,
      "budget": 0,
      "overview": "A psychiatrist tells two stories: one of a transvestite (Glen or Glenda), the other of a pseudohermaphrodite (Alan or Anne).",
      "similar": [
         449176,
         184352,
         428493,
         9800,
         142,
         2667,
         376867,
         398818,
         258480,
         9090,
         11000,
         455661,
         338189,
         26280,
         11386,
         468,
         140,
         26371,
         1420,
         17483
      ],
      "original_title": "Glen or Glenda",
      "runtime": 71,
      "poster_path": "/oLPrH8zkJsYcZwNHkz6ju2f4Lr1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Screen Classics (II)",
         "id": 17100,
         "origin_country": ""
      }],
      "release_date": "1953-01-01",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "The strange case of a \"man\" who changed his SEX!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Edward D. Wood Jr."],
      "runtime": 65,
      "synopsis": "Glen or Glenda tells two stories. One is about Glen ( Edward D. Wood Jr.), who secretly dresses as a woman but is afraid to tell his fiancée. The other is about Alan ( 'Tommy' Haynes), a pseudohermaphrodite who undergoes a painful operation to become a woman. Both stories are told by Dr. Alton ( Timothy Farrell). There's a second narrator, called the Scientist ( Bela Lugosi), whose commentary on the action contains more philosophical pronouncements than facts. The movie will also have flashbacks-within-flashbacks and a strange dream sequence. The introductory title card reads: \"In the making of this film, which deals with a strange and curious subject, no punches have been pulled--no easy way out has been taken. Many of the smaller parts are portrayed by persons who actually are, in real life, the character [sic] they portray on the screen. This is a picture of stark realism---taking no sides---but giving you the facts---All the facts---as they are today....You are society---JUDGE YE NOT.....\" When the first scene opens, we see the Scientist sitting in a large chair with some kind of netting over it. He is shot from the shoulders up as he looks down. The shadow of the camera falls on the right side (his right) of the chair. Behind him, and above his head, we see three shelves. The top shelf has two skulls on either end and a lion's head in the middle. The second has a shrunken head on the left side (his left). Sticking out from the back of the chair is a long, cylindrical object with a round head. The camera pulls back. The shadow of the camera disappears from the chair and from the wall behind the Scientist. We see more of the room. On the Scientist's left is a skeleton hanging from the ceiling. On his right is a figure, also hanging from the ceiling, that looks like a native African in a loin cloth. We hear the sound of a violent wind. The Scientist is reading a large book. He closes it and looks up at us. He speaks: \"Man's constant probing of things unknown, drawing from the endless reaches of time, brings to light many startling things. Startling? Because they seem new? Sudden! But most are not new. The signs of the ages!\" A shot of the sky as lightning tears through it. We dissolve to the Scientist mixing chemicals in test tubes. He pours the results into a beaker and is happy with the result. \"A life has begun!\" he declares. He laughs. A busy city street. Via a trick shot we the Scientist on the top half of the screen as he looks down. \"People!\" he spits. \"All going somewhere! All with their own thoughts! Their own ideas! All with their own personalities! One is wrong because he does right. One is right because he does wrong. Pull the string! Dance to that which one is created for!\" He looks ready to pounce, but then laughs and then sighs ironically. \"A new day is begun,\" he continues. We hear the sound of a baby. \"A new life is begun.\" A shot of an ambulance and the wail of its siren cut him off; but he reappears, superimposed on the screen. \"A life is ended.\" We meet a corpse lying on a daybed. The corpse is of a man wearing women's clothing. Insp. Warren ( Lyle Talbot), who is investigating this case, quickly sees this is a case of suicide. A note left near the body confirms it. This note, read aloud in a voice-over, says, \"The records will tell the story. I was put in jail recently. Why? Because I, a man, was caught on the street wearing women's clothing. This was my fourth arrest for the same act. In life, I must continue wearing them. Therefore, it would only be a matter of time until my next arrest. This is the only way. Let my body rest in death forever in the things I cannot wear in life.\" Later, Insp. Warren seeks to know more about transvestites and transsexuals. He goes to a psychiatrist, Dr. Alton, for the facts. By this time the story has hit the papers. \"Let us get our stories straight,\" says Dr. Alton. \"You're referring to the suicide of the transvestite?\" Warren replies, \"If that's the word you men of medical science use for a man who wears woman's clothing, yes.\" \"Yes, in cold, technical language, that's the word, as unfriendly and as vicious as it may sound. However, in actuality it's not an unfriendly word. Nor is it vicious when you know the people to whom it pertains.\" Insp. Warren brings up the case of a man's recent sex change, which Dr. Alton was involved in. \"[Will an] operation do these people any good?\" \"Some cases yes, some no. [...] You can only fully understand the sex change by taking two entirely different cases, two men with exactly the same background from childhood to manhood and onto their own decisions and destinations.\" Insp. Warren says, \"I'd like to hear the story to the fullest.\" Dr. Alton rejoins, while turning to us in close-up, \"Only the infinity of the depths of a man's mind can really tell the story.\" The picture goes blurry. We cut to flashes of lightning and sounds of thunder. Presently we're looking down at the Scientist who squints at us and says, \"Dr. Alton, a young man though he is, speaks the words of the all-wise.\" He goes on to say, \"No one can really tell the story. [Presumably he means the story of Glen/Glenda.] Mistakes are made. But there is no mistaking the thoughts in a man's mind. The story is begun!\" Now we see Glen, dressed as Glenda, walking down the street. He's wearing a skirt and an angora sweater, while looking into a shop window. Dr. Alton (not the Scientist) says in a voice-over, \"One might say, 'There but for the grace of God go I.'\" We see a newspaper with the headline, \"WORLD SHOCKED BY SEX CHANGE.\" \"Why,\" asks Dr. Alton, \"is the world shocked by this headline?\" \"Airplanes!\" we hear an old woman say in a voice-over, as we watch a plane dropping cargo. \"Humph! Why, it's against the Creator's will. If the Creator wanted us to fly, he'd have given us wings.\" Dr. Alton says, \"But we fly. Maybe some of you may still remember an even sillier remark.\" \"Automobiles!\" says an old man in a voice-over, as we see a field worker in a sombrero. \"Bah! They scare the hosses [sic]! If the creator hadda meant for us to roam around the countryside, we'da been born with wheels!\" \"Silly?\" Dr. Alton chides. \"Certainly. We were not born with wings. We were not born with wheels. But in modern [sic] world of today, it's an accepted fact that we must have them. So we have corrected that which nature has not given us. Strangely enough, nature has given us all these things. We just had to learn how to put nature's elements together for our use, that's all. Yet the world is shocked by a sex change!\" We see Glen (as Glenda) at home. \"Give this man satin undies, a dress, a sweater and a skirt,\" Alton continues, \"or even the lounging outfit he has on, and he's the happiest individual in the world. He can work better, think better. He can play better. And he can be more of a credit to his community and his government because he is happy. These things are his comfort. \"But why the wig and makeup?\" Alton continues. \"He dares to enter the street dressed in the clothes he so much desires to wear, but only if he really appears female: the long hair, the makeup, the clothing, the actual contours of a girl.\" Do transvestites want to change their bodies? \"Many of them simply want to change the clothing they wear to that [which] is worn by the opposite sex.\" We meet Barbara ( Dolores Fuller), Glen's fiancée. She and Glen seem happy together, but Glenda casts a shadow over his mind. Barbara is blissfully ignorant, but she does notice that Glen needs his nails trimmed. They're almost as long and as pretty as hers. Dr. Alton continues his lecture: \"Modern man is a hardworking human. Throughout the day his mind and his muscles are busy at building the modern world and its business administration. His clothing is rough, coarse, starched, according to the specifications of his accepted job. \"At home,\" he continues, \"what does modern man have to look forward to for his body comfort? The things provided for his home, a wool or flannel robe, his feet encased in the same thick, tight-fitting leather that his shoes are made of. These are the things provided for his home comfort.\" Dr. Alton has an explanation for baldness: \"Men wear hats, which cut off the blood flow to their heads.\" His statistic? \"Seven out of ten men wear hats. ... Seven out of ten men are bald. \"Just for comparison, let's go native. Back to the animal instinct.\" We see African natives, beating drums and dancing. Surrounding them are skulls affixed to posts. The men have fancy masks. The women are unadorned. \"There in the lesser civilized part of the world, it's the male who adorns himself with the fancy objects, such as paints, frills and masks. The true instinct. The animal instinct. Bird and animal life. Is it not so that it's the male who is the fancy one? Could it be that the male was meant to attract the attention of the female? \"What's so wrong about that?\" he asks as a male carries off a female. \"Where is the animal instinct in modern civilization? Female has the fluff and the finery, as specified by those who design and sell. \"Little Miss Female,\" says Dr. Alton, \"you should feel quite proud of the situation. You of course realize that it's predominantly men who design your clothes, your jewelry, your makeup, your hair styling, your perfume. But life, even though its changes are slow, moves on. There's no law against wearing such apparel on the street, as long as it can be distinguished that man is man and woman is woman.\" But if man dresses as woman? We ridicule him, says Dr. Alton. We see a woman reading the newspaper with the ubiquitous headline, \"WORLD SHOCKED BY SEX CHANGE.\" The paper is covering her face. When she sets it down, it turns out \"she\" is a man ( Conrad Brooks) wearing a dress, earrings and a long, thick beard. \"You're doing it now,\" he says. \"Laughing. Yet, it's not a situation to be laughed at.\" Dr. Alton turns back to Glen. Young Glen wore his sister's dress to a Halloween party and won first prize. \"Then one day,\" says Dr. Alton, as we see Glen lounging in his sister's clothes, \"it wasn't Halloween any longer. \"Glen is a transvestite, but he is not a homosexual,\" he continues. \"Transvestism is the term given by medical science to those persons who desperately wish to wear the clothing of the opposite sex, yet whose sex life in all instances remains quite normal.\" Barbara starts to realize that something is wrong. She asks Glen, with more irony than she knows, if the trouble is ... another woman? We abruptly cut to a shot of stampeding buffalo. Then we dissolve to the Scientist crying, \"Pull the string! Pull the string! A mistake is made. The story must be told!\" (The meaning of this brief scene is open to interpretation.) Glen goes to his friend Johnny ( Charles Crafts) for advice. Johnny is also a transvestite, whose wife divorced him when she found him wearing her clothes. Johnny advises Glen to tell Barbara about \"Glenda.\" Dr. Alton explains that Glen should have seen a competent psychiatrist. He notes that some transvestites take their secrets to the grave. We proceed to a flashback-within-a-flashback in which Dr. Alton rhetorically asks \"Glenda\" if she remembers the time, a year before, when Glen and Barbara had accepted each other. We see Glen and Barbara accepting each other. We return from the flashback-within-a-flashback to the flashback. Glenda rushes into her house and then collapses as we hear a thunderclap. We dissolve into the Scientist delivering a cryptic warning: \"\"Bevare! Bevare! Bevare of the big green dragon that sits on your doorstep. He eats little boys! Puppy dog tails and big, fat snails! Bevare! Take care! Bevare!\" Next is a dream sequence. We see shots of Glen (dressed as Glenda) alternating with those of Barbara. Glenda's hand gestures indicate that she wants Barbara to draw nearer. Barbara is in mental agony, which she indicates by holding her head in her hands and then dropping to the floor and slapping it with her palms. Glenda leaves the frame and the picture goes black. An effect, that's partly an iris out and partly a wipe, reveals Barbara struggling underneath something that looks like a tree. Glenda tries to pull it off her, but then she disappears, leaving Barbara to struggle alone. Glen appears and manages to pull off the tree and save her. We dissolve to a preacher. Barbara and Glen enter from behind the camera, facing the preacher and away from us, the audience. The preacher opens his book and then looks to his left. Satan appears. The preacher reaches toward Satan who gives him a ring. (Presumably, that is. Glen is obscuring the view.) The ceremony continues as Satan nods approvingly. Glen and Barbara kiss and walk toward the camera. We dissolve to the Scientist. \"Tell me, tell me, dragon! Do you eat little boys? Puppy dog tails and big, fat snails?\" We dissolve to a close-up of Glen, lit from underneath, as smoke rises from behind him. He looks up at us, shaking violently. A child's voice says, \"Puppy dog tails! Puppy dog tails! Puppy dog tails! Everything nice. Everything nice. Ha, ha, ha! Puppy dog tails!\" We abruptly cut to the Scientist. We alternate between shots of him, looking disgusted and outraged, shots of Glen looking frightened, and shots of women employed in various sado-masochistic activities. Both Glen and Bela seem to be reacting to the women. The vignettes: A half-dressed woman is whipped by a shirtless man. A woman stands at a pole, inviting some unseen person to come closer, as her dress nearly falls off. A woman in a flower-print dress seems bothered by it, so she rips it off. A woman performs a semi-dance routine as she slowly lifts up her dress to reveal her underwear. A woman with her mouth gagged frees another gagged woman whose hands are tied to a bamboo pole that's set across her shoulders. A woman writhes on her couch in ecstasy. A second woman sneaks up and ties her hands together and then gags her. A brunette sits at her vanity combing her hair. Later, she's nearly nude on her couch as she writhes around on it. A man with a pointed beard appears and rapes her. The vignettes end with a shot of Lugosi giving an expression of amused resignation. (Note: the sequence in italics is missing from some prints. Originally, the producer inserted this soft-core pornography into the film against the director's wishes. Ed Wood had nothing to do with it. Note also that in some prints the dream has a bit more footage than what is described here, and it runs in a slightly different order.) Then we're back to the dream sequence. We see Glen in his house, only the furniture has been turned upside down and the fireplace is tilted, giving the place an air of surreality. A sinister voice (not the Scientist's) says, \"Big green dragons and big fat snails. Beware! Take care!\" \"I'm a girl!\" says the smug little child's voice. Then, \"I'm not! You're a boy! A puppy dog tail! Ha! Ha! Ha!\" A man with a pitying expression appears out of thin air. Glen reacts with fright. Then he sees the ghostly image of a woman looking angry. \"Everything nice!\" says the disembodied girl-voice. \"Puppy dog tails, puppy dog tails, puppy dog tails!\" A man and a woman, both looking censorious, fade into the scene, as they stand in front of a chalk board. An older woman, equally disapproving, pops in behind them. The girl repeats her nursery rhyme phrases as others, including Glen's sister, appear. They all point to him and surround him, lead on by Satan. When they disburse, we see that Glen is now Glenda again. He, as she, is now happy. The music is sweepingly romantic. Barbara walks in and gestures for Glenda to come near. She does, but then changes to Satan. Barbara reappears on a tipped-over love seat, and her outfits change supernaturally. She beckons Glenda again, and then laughs in Glenda's face. A sad Glenda's mental state is represented by the superimposed image of several hands with wiggling fingers. The various people reappear and laugh as they wiggle their fingers menacingly. Satan is pleased by all this. Then the male voice says, \"Beware! Beware! Beware of the big green dragon that sits on your doorstep. He eats little boys. Puppy dog tails and big fat snails. Beware, take care! Beware.\" The delighted expression leaves Satan's face. The Prince of Darkness looks frightened. The dream ends with Glenda falling down and upsetting the tipped-over love seat. Glen has decided to tell Barbara of his dual personality, \"to tell her of the nighties and negligees, the sweaters and skirts, the robes and dresses, the stockings and the high-heeled shoes, the wig and the makeup. All that goes to make Glen into Glenda. He tells Barbara he cannot cheat her of the knowledge that she as his fiancée should possess. All the facts. He tells her softly, hurriedly at first, then slowly as he becomes more technical. His hands move to caress the smooth material of her angora sweater, which he has so long, so desperately wanted to put on his own body. He tells of this to her, and she looks to the sweater and to his hands. Then, when it is all over, and that much of the story he knows is told, Barbara is not sure of her own thoughts.\" Glen appears to the Scientist, kneeling down with a silent plea. The Scientist, who has had no interaction with the other characters until now, makes a gesture of contempt that causes Glen to disappear. Barbara makes a decision. She takes off her angora sweater and hands it to Glen. Next we hear the story of Alan/Anne. Alan's parents always wanted a girl. Instead they got a pseudohermaphrodite, who was more boy than girl. Dr. Alton explains: \"[A] hermaphrodite is one who has the organs of both the female and the male in plain sight. A pseudohermaphrodite is one who has one perfectly formed organ of either sex, and one imperfectly formed one that's difficult to detect.\" Alan's main comfort during his stay in the army was a suitcase secretly filled with women's clothes. \"Wherever Alan went,\" says Dr. Alton, \"the suitcase was sure to go.\" Eventually, Alan gets a sex change. \"Never was there a whimper from [Alan],\" says Dr. Alton of Alan's surgery and hormone shots, \"because he knew that at the end of it all, he would at least be that what he had always dreamed\"--a woman. The Scientist waves his hand over Alan and causes him to disappear. Then he waves his hand again and causes him to reappear as Anne. Anne does become a woman and society accepts her. But what of Glen/Glenda? Glenda, Dr. Alton explains, is a fictitious character created by Glen to take the place of the love he never received from his mother or father. Barbara \"kills off\" this character by becoming everything to him that Glenda was: his mother, little sister and wife. \"But what of the hundreds of less fortunate Glens the world over?\" asks Dr. Alton. We return to the Scientist and hear the ominous rumbling of thunder. \"Yes, but what of the others, the less fortunate Glens the world over?\" he asks. \"Snips and snails and puppy dog tails!\"",
      "writers": ["Edward D. Wood Jr."],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0045826/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjExMTg3ODEzMl5BMl5BanBnXkFtZTgwMjMyNTc2MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Edward D. Wood Jr., Bela Lugosi, Lyle Talbot | See full cast and crew »"],
      "reviews": [
         "Ed Wood was one of the greatest moviemakers in film history. Could he direct? Not really. Were his movies technical masterpieces? Could his actors act? Did he have huge budgets? No. We're here fifty years later, talking about him, because he created worlds on film nobody had ever seen before or since. His characters talked like nobody we've ever heard before (though there are strong echoes in the works of Hartley and Lynch). And unlike every Hollywood movie ever made, Ed ripped open his heart and poured it out on the screen. Never more so than in \"Glen Or Glenda,\" his original avant-garde masterpiece. Avant-garde? You heard me. What is the definition of avant-garde film? Some attributes are unconventional narrative, unique visual style, radical rejection of artistic or social norms, an often willful disregard for reality. Gloria Floren said \"Avant-garde films are often iconoclastic, mocking conventional morality and traditional values; the filmmaker's intense interest in eccentricities and extremes may shock viewers.  Indeed, the avant-garde film maker's purpose may be to wake or shake up the audience from the stupor of ordinary consciousness or the doldrums of conventional perspective.\" Imagine if people viewed \"Un Chien Andalou\" or \"Meshes Of The Afternoon\" or \"Eraserhead\" with fratboy derision instead of holy reverence. They'd be viewed as unwatchable nonsense too. Everybody'd have a good snark watching for continuity errors and bad camera moves. Does \"Glen or Glenda\" rise to the level of those classics? Time will tell, but try this experiment: watch it as if it were, and see. The results may surprise you. Here are some hints. Lugosi is not a mad scientist--he's God, looking down upon twisted human morality and \"pulling the strings\". The \"green eyed monster\" that \"eats little boys\"? Envy. Envy of women and in this case, their clothes. That envy has \"eaten\" vast amounts of Glen's life, it's been a torture to him. There are numerous references to that torture and misery. There's also an entire section devoted to judgment--human judgment versus that reserved to God. The \"nonsensical\" stock footage of buffaloes and the army? It signifies the rush of adrenaline, fear and anxiety as \"Glen\" tries to confront his identity and \"come out\" to his girlfriend. Far from random, it's actually used with ingenuity and skill. The symbology of scenes in which \"Glen\" battles his female self and resists the devil should be obvious. But then again, a generous viewing of \"Glen or Glenda,\" rather than a beer-fueled \"let's watch a crap movie\" viewing, would reveal a great deal. Even the campy scene at the end, when Dolores Fuller relents and gives Glen her sweater, comes with the always-missed segment where God absolves Glen of his misery. There are a dozen moments like this. Sure, there are a dozen technical flubs and random nonsense too, but all good art is organic. There's a guy wearing a Timex in \"Ben-Hur,\" for god's sake. The \"narrator\" seems comical and dated to us, but in 1953 he was standard-issue, and the lines we now take as campy were then revolutionary, almost treasonous. A plea for tolerance for sexual and gender differences? Condemning the police for arresting gays and transvestites just for existing? During the McCarthy era, when all homosexuals were presumed to be communists? A film like that is bound to make some enemies. Especially a film that featured, not actors playing \"deviants,\" but the deviants themselves, in their own words. It's telling that the extreme-religious-conservative Medved brothers were the ones who named Ed Wood \"worst director of all time.\" They must have thought they were really sticking it to Ed Wood for making all those subversively weird films involving crossdressing and homosexuals and society's outcasts. Thankfully, irony remains the most powerful force in the universe, and their mean-spirited declaration made Ed Wood a household name. Whether they admit it or not, a lot of this movie's detractors are laughing at the subject, not the movie. Many others are baffled by the unconventional narrative. Just because you don't get something, doesn't mean there is nothing to get. It's easy to give any movie the MST3K treatment, especially ones that veer into uncomfortable or seemingly absurd territory. If you're looking for the worst movie ever made, go watch \"Armageddon\" or \"Crossroads.\" If you're looking for THE pioneering moment in GLBT film history, the greatest and most underrated American DIY avante-garde feature of its time, or an experience that just might change the way you view movies and the world at large, start right here.",
         "GLEN OR GLENDA is uniquely bad. Suffice it to say, one has to witness it in order to really believe it. There's almost no point of writing a sensible review of this \"movie\" because it's beyond wonky. It's so bad that it's almost pure genius. Bunuel couldn't have created a more surreal film than Ed Wood's treatise on the merits of cross-dressing. The \"movie\" is 70% stock footage or stuff that has nothing to do with the main \"story.\" A huge chunk of the amazing dream sequence is just a nudie cutie. The \"acting\" is abysmal. Dolores Fuller wins the award for worst actress of all time. The dialogue is so hilarious that it's endlessly quotable. But the whole thing is oddly frank and earnest and because of this, this kooky disaster of a movie actually has a heart, which is more than you can say about most movies out there. I love it. There's almost nothing like it.",
         "Ed Wood. The so-called \"worst director of all time\". Sorry, there are plenty of other directors who could take that title because Ed Wood is not that bad of a director nor a bad person. Ed made movies to make movies, not to make a buck. And that's why his films are sort of poignant in their flaws. \"Glen or Glenda?\" is a statement, not a film. It is a statement about transvestism, the truth behind it, and gives several (for the most part, factual) cases of transvestites and transsexuals. Wood is world-reknowned for being a transvestite with a fetish for angora sweaters. And here, he is brave enough to cast himself in an autobiographical role (Glen) and let the world know (yet, he hides under the pseudonym of Daniel Davis). \"Glen or Glenda?\" is a bad movie lover's dream. Hilarious dialogue, no coherent plotline, and many memorable sequences of transvestites and their hardships. The narrator does a splendid job of camping things up while explaining how a transvestite is not a homosexual, how it is more healthy to wear womens' clothing, and the tragic results of misunderstood transvestites. Plus, you get Bela Lugosi as God (he's nice and campy), several out-of-place striptease and cheesecake scenes (pretty graphic for 1953), and Dolores Fuller (Wood's real-life girlfriend) as Glen's fiancee. Too many people rated this movie with a 1. But \"Glen or Glenda?\" is not as bad as \"Orgy of the Dead\" or other later Ed Wood classics. In fact, \"Glen or Glenda?\" is arguably Wood's greatest achievement. Check it out, I strongly recommend it.",
         "I am a huge fan of Ed, after seeing \"Ed Wood\", and I have since bought the book \"Nightmare of Ecstacy\". Also, I bought all of the films that he had made that I could get my hands on. Like it or not, \"Glen Or Glenda\" was a landmark film! This particular film was made WAY AHEAD of it's time!! While I was first watching Tim Burton's fantastic film, recreating the making of \"Glen Or Glenda\", I noticed that there were things in it that seemed rather familiar to me, even after 30+ years have passed, and that is what partly interested me in looking into both the book, and Ed Wood's films. What I discovered was, I had seen this film when I was in GRADE SCHOOL!! After viewing the REAL \"Glen OR Glenda\" film, I realized that I had had seen this exact same film before, although heavily edited! It was shown as a part of our sex-ed class!! I can hardly believe it that they showed us this back then, but they did. No thanks to the school I went to, and the horribly incompetent teachers, but they did show it! Now, fast forward to today, the reason for all of the extra scenes near the end of the film, such as the 'Devil' sequences, and the rest of the rather abstract looking scenes, were not originally part of the screenplay. Those scenes (baffling and dumbfounding), were NOT part of the film as Ed had written. His script left the running time short of what George Weiss had told him he wanted, a 7 reel, 16MM film, which was what he needed to sell it. A 16MM reel runs about 10 minutes, and George needed a 70 minute film (at least), because he pre-sold it in several states as a \"Feature\", before he actually found out what it really was. He wasn't too pleased with what Ed had made, but he was able to distribute it to his clients, after all of the extraneous material was added at the end. George did eventually make his money back, and he and Ed worked on a couple of other projects, unlike what is shown in the \"Ed Wood\" film. Even today, though, I think that this film was made way before it's time, and Ed Wood should deserve some credit for trying to bring a sense of understanding to what was then a totally misunderstood way of life for a select few.",
         "Say what you will about Ed Wood, he was definitely an auteur. His films, bad as they are, have a definite style all their own. While I was watching \"Glen Or Glenda\", I was consumed with how jaw-droppingly bad the movie was. The funny thing is, I was also entertained by it, and so was everyone else in the theater when I saw it (yes, I caught this movie on the big screen at a revival). I started thinking about how Ed Wood so desperately wanted to make a movie that he fashioned this film out of anything he could, stretching the script far beyond its own capacity and inserting bizarre fantasy sequences to pad out the running time, which would have been about 20 minutes tops had he cut the crap. Basically the film is an autobiographical plea for acceptance of transvestism, with Wood himself in the starring role. There is no real story, but rather a series of vignettes in which Wood appears in and out of drag, comes clean to his girlfriend about why her angora sweaters are all stretched out. In seemingly unrelated footage, Bela Lugosi camps it up on a haunted house set, and I'm fairly certain he's supposed to be playing God. Wow. There are no words for what a mess the movie turned out to be...so much so that it becomes fascinating. In my opinion, the worst crime a movie can commit is being completely boring, and in that regard \"Glen or Glenda\" is not guilty. Incompetent on every other level imaginable, the film truly must be seen to be believed.",
         "Ever since Tim Burton's wonderful 'Ed Wood' raised Ed Wood Jr's profile and made his seriously bent movies movies better known than they have ever been, some cult movie fans have gotten their noses out of joint. Wood's reputation as the worst director ever pushes some buffs buttons as it marginalizes already marginalized film makers like Ray Dennis Steckler, Ted V. Mikels, Herschell Gordon Lewis, Al Adamson and other \"so bad it's good\" directors. I leave more knowledgeable fans than me to argue over who REALLY is the worst, but there's no denying that Wood's movies are quite unlike anything made before or since. 'Glen Or Glenda' is his best movie, or if the term \"best\" misleads, his Ed Woodest. I've lost track of how many times I've seen it over the years but it never loses its power to amuse and astound. Every single time I watch it I am flabbergasted! It literally has to be seen to be believed. Wood plays the title character, a man wrestling with his transvestitism. His girlfriend is played by Dolores Fuller, the cop by Lyle Talbot, the psychiatrist by Timothy Farrell, all three familiar faces from other Wood classics like 'Plan Nine From Outer Space' and 'Jail Bait'. But the real reason to watch this is the utterly bizarre performance from horror legend Bela Lugosi, credited on the version I watched as \"scientist\", and on the IMDb as \"The Spirit\", who may or may not be God. His rantings of \"Pull the strings! Pull the strings!\" and nonsensical stuff about \"Green dragons\" and \"puppy dog tails\" will stay in your head for YEARS, if not for the rest of your life! Wood intercuts this with nutty stock footage like buffalo stampedes, and one of the most wacked out nightmare sequences ever seen, which includes lots of chubby gals in states of undress, some S and M, and and an appearance by Satan. Believe the hype - everything you've heard about this one is true! Fifty years on it's STILL one of the weirdest movies ever made. If you haven't seen 'Glen Or Glenda' you just don't know what you're missing!",
         "The 1950s: a rigid and conforming time period in American history, a time when homophobia ran rampant and \"diverse lifestyles\" simply were not tolerated or glorified, came the 1953 transvestite drama 'Glen or Glenda'. 'Glen or Glenda' was Edward D. Wood's feature-length directorial debut and is considered by many to be one of the most obscure films of all time. Ed Wood's first \"big picture\" was quite a special one for him, the main reason being that it told a story very dear to him. Ed Wood was in many senses, the character of Glen/Glenda. The fact is, Ed Wood did find comfort in women's clothing and he did favor angora sweaters to the traditional shirt and tie which defined the era. These factors contribute to the film making, the effort, and ultimately the passion behind the film. Ed Wood was making a picture with a subject matter very dear to him and it comes through in this fine piece of work. Glen or Glenda is now considered to be a cult classic, but at the time it explored previously uncharted territory (not that this was a \"smash-hit\" when it came out in 1953 either). However, this is certainly not to say that the film is irrelevant to today's social standards, regulations, and expectations, on the contrary it proves to be quite pertinent to life in the 21st century. 'Glen or Glenda' opens with a character simply cast as 'Scientist' (Bela Lugosi) prophetically speaking of the society in which we live and its and loathing of the seemingly abnormal or unknown. He speaks of society's outcasts, the troubled world in which they live, and the problems they face in their day to day lives. The story ensues as the police arrive at the scene of a recent suicide. The victim was a well-known transvestite, cast out by society and all others around him. Among the police is Inspector Warren (Lyle Talbot). Troubled by this seemingly strange case, he seeks help in Dr. Alton (Timothy Farrell), a respected psychoanalysis who has encountered various transvestites in his line of work. He begins to tell Inspector Warren of a patient he once dealt with named Glen. Glen was engaged to be married to Barbara (Dolores Fuller), but had been hiding a dark secret from his fiancée; Glen (or Glenda?) was secretly a transvestite. Alton continues to tell Inspector Warren of the internal struggle within Glen: whether to tell Barbara of his secret lifestyle or to keep it to himself\u0085 or to entirely stop wearing the clothes which make him feel so much like himself? Although the subject matter, upon first glance, may seem to some a tongue in cheek jab at the transvestites and other \"oddballs\" of the world, it was not intended that way - nor does it come across as such after viewing the film. 'Glen or Glenda' is a startlingly solid effort at a fresh (and controversial) subject of the 1950s. Not only was the film fresh and innovative, but it prospered on a technical level as well. With excellent cinematography and pristine, appropriate lighting, the film is technically quite good. Dolores Fuller's acting is well-below average, but the other characters offer decent performances (Ed Wood's acting is curiously above average (seeing how he had little to no professional acting experience). Bela Lugosi's performance is, as always, a strong one with memorable dialogue. Although Lugosi is technically listed as a 'Scientist' in the film, symbolically he represents God. He is the one who pulls the strings; he is the one who has become filled with contempt for the human race and its judgmental nature. The symbolism within 'Glen or Glenda' is often overlooked and classified as \"inept dialogue\", but to an acute observer, it is astoundingly developed. The \"green-eyed monster\", mentioned by Bela Lugosi's character, can be interpreted as Glen's envy of women and their clothing. The seemingly random stock footage of the Buffalo represents the rush that Glen feels when symbolically transformed into Glenda. When realized, 'Glen or Glenda' is full of metaphoric meaning and symbolism, as well as a fresh plot, rife with unique social commentary. 'Glen or Glenda' is a film which does not dance around the subject matter. It recognizes an important (at least to director Ed Wood) and controversial social issue and discusses it in full, leaving nothing left unspoken. The film proves itself to be enjoyable and entertaining to watch throughout, with some memorable performances (for better or for worse...) and an interesting plot. With such originality and such passion, Glen or Glenda is a film which should be respected and treasured, rather than criticized for its below-average acting, seemingly strange dialogue, and obscure premise, for its pure outspoken zealousness in the 1950s, a period when transvestism and homosexuality were blatantly not openly accepted. Is this to say that these lifestyles are accepted today? Shall we consult Pat Robertson or perhaps George W. Bush on this matter? The film is just as relevant today as it was in 1953 when it was first released. Glen or Glenda proves to be entertaining and intriguing, full of obscure characters and a fresh subject matter: a film far ahead of it's time.",
         "I don't know where this movie falls in the development of camp, but it sure is a milestone along the way to Pink Flamingos and other masterpieces of bad taste. \"All those people, all going somewhere!\" Ok, so the dialogue is laughable, the editing could have been done better than a 6 year old, and there is really no development. But this is entertainment and a pretty brave statement in favor of those who've been bending gender for centuries. I value Ed Wood for giving a voice, albeit a fractured one, to those thousands of men who have feared their feminine side, and those who, like the young fellow in the film who killed himself, have been silenced by prejudice, fear, and hatred. Watch it with a friend, preferably one who wears angora.",
         "Like in \"plan nine outer space\" ,Ed Wood tries to put a message across in his film.In his sci-fi flick,he made his E.T. blame the human race for their self-destruction :it was not unlike Robert Wise's \"the day the earth stood still\" and not more naive than the latter.The main difference lies in the fact that Wood had a shoestring budget with his cardboard flying saucers and his shower curtain in the \"plane\" \"Glen or Glenda\" is anything but stupid.Just tell me the name of a director (in the USA or elsewhere) who dared to treat such a taboo subject: the transvestites -not necessarily homosexual- and even the transsexuals.His film ,with voice over galore,although dated today of course was a plea for tolerance.The fact that Ed Wood himself used to dress himself as a woman (see Tim Burton's eponymous movie) is proof positive that he knows what he is taking about. Bela Lugosi's part,on the other hand,gets in the way.Is he a scientist? a puppeteer who plays with humans? or \"simply\" God Himself?(do not laugh at him!when Agnes Varda ,an intellectual director of the notorious French Nouvelle Vague , films such drivel (\"les Creatures\",1966) ,the highbrows praise her to the skies ) Despite ludicrous special effects ,terrible acting and poor lines,Ed Wood's film is anything but derivative.",
         "I bought this movie after watching Tim Burton's biography \"Ed Wood (1994)\". I expected something quite clumsy and was delighted with the result : The questions that are being asked and answered are really interesting and Ed Wood dealt with these a very artistic way. Of course, one could argue this is gross and that the topic lacks subtility but you have to envision yourself back in 1953 and I guess you'll suddenly realise how prophetic this movie was. I gave it 10/10 : I'll watch it again and again."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Screen Classics (II)"],
      "summaries": [
         "\"Glen or Glenda\" tells two stories. One is about Glen, who secretly dresses as a woman but is afraid to tell his fiancée, Barbara. The other is about Alan, a pseudohermaphrodite who undergoes a painful operation to become a woman. Both stories are told by Dr. Alton, who also delivers an earnest lecture on tolerance and understanding. There is a second narrator, called the Scientist, whose commentary on the action contains more philosophical pronouncements than facts. The movie also has flashbacks-within-flashbacks and a strange dream sequence. We meet Insp. Warren, whose investigation of a transvestite's suicide leads him to learn more about men in women's clothes; Johnny, whose wife left him when she discovered what he wears when she's away; Barbara, oblivious to Glen's desire to wear her angora sweater; Satan, who invades Glen's nightmare; and others. Meanwhile, the Scientist will only offer cryptic advice. \"Beware!\" he warns. \"Beware of the big, green dragon that sits on your doorstep. Beware! Take care! Beware!\"",
         "Upon discovering the suicide of a known transvestite, the police inspector seeks enlightenment from a psychiatrist familiar with the phenomenon. The psychiatrist tells him two tales. Glen is to be married to Barbara, but must find a way to tell her of his desire to wear her angora sweater, and of his cross-dressing needs in general. Another is the story of Alan, who decides to physically become a female via surgery (based on the contemporary story of Christine Jorgensen). Throughout the film a scientist inanely babbles about life and death in order to somehow elucidate the story.",
         "Cross-dressing B-movie auteur Edward D. Wood Jr. was unleashed upon an unsuspecting world with this purportedly sincere attempt at understanding transvestism rendered unintelligible by Ed Wood's unfathomable script, bizarre pantomime-esque vignettes and a visibly morphine-addled Bela Lugosi shouting about big green dragons.",
         "A psychiatrist tells two stories: one of a transvestite (Glen or Glenda), the other of a pseudohermaphrodite (Alan or Anne)."
      ],
      "budget": 20000
   },
   "movielensId": 2362,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1953-01-01",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Edward D. Wood Jr."],
      "runtime": 71,
      "movieId": 2362,
      "title": "Glen or Glenda",
      "mpaa": "",
      "actors": [
         "Edward D. Wood Jr.",
         "Dolores Fuller",
         "Timothy Farrell",
         "'Tommy' Haynes",
         "Bela Lugosi",
         "Lyle Talbot",
         "'Captain' DeZita",
         "Charles Crafts",
         "Evelyn Wood",
         "Shirley Speril",
         "'Mr. Walter' Hadjwiecyz",
         "Conrad Brooks",
         "Henry Bederski",
         "William C. Thompson",
         "George Weiss"
      ],
      "imdbMovieId": "0045826",
      "originalTitle": "Glen or Glenda",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A psychiatrist tells two stories: one of a transvestite (Glen or Glenda), the other of a pseudohermaphrodite (Alan or Anne).",
      "tmdbMovieId": 24018,
      "avgRating": 2.73522,
      "releaseYear": "1953",
      "numRatings": 406,
      "posterPath": "/oLPrH8zkJsYcZwNHkz6ju2f4Lr1.jpg"
   }
}