{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "rio de janeiro",
            "id": 1809
         },
         {
            "name": "dirty cop",
            "id": 11719
         },
         {
            "name": "fletch",
            "id": 172455
         },
         {
            "name": "cabana",
            "id": 172463
         },
         {
            "name": "country club",
            "id": 172466
         },
         {
            "name": "divorce lawyer",
            "id": 172471
         }
      ],
      "imdb_id": "tt0089155",
      "video": false,
      "title": "Fletch",
      "recommendations": [
         14628,
         9080,
         10890,
         11418,
         14170,
         11591,
         11977,
         8388,
         11153,
         10023,
         11584,
         10859,
         2617,
         11718,
         10141,
         11896,
         11419,
         13665,
         8873,
         15596
      ],
      "backdrop_path": "/9XslOpki9QEFDfOHLzaQLJqx8Xl.jpg",
      "revenue": 59612888,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Irwin 'Fletch' Fletcher",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf209",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Chief Jerry Karlin",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf20d",
               "name": "Joe Don Baker",
               "profile_path": "/7WQq2nmSXXIC4vR3MhHLYRZD2wE.jpg",
               "id": 10671,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gail Stanwyk",
               "gender": 1,
               "credit_id": "52fe4526c3a36847f80bf211",
               "name": "Dana Wheeler-Nicholson",
               "profile_path": "/xxeZ2ZVM3t9NWLLpu8qmzJesktz.jpg",
               "id": 58866,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frank Walker",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf215",
               "name": "Richard Libertini",
               "profile_path": "/yPJRC8N0ITxLuJzIbIDeGgT6lz6.jpg",
               "id": 20163,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Alan Stanwyk",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf219",
               "name": "Tim Matheson",
               "profile_path": "/iQQCtIS9bQJlQ8OMOzeidsJptAQ.jpg",
               "id": 21561,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dr. Joseph Dolan",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf21d",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Larry",
               "gender": 1,
               "credit_id": "52fe4526c3a36847f80bf221",
               "name": "Geena Davis",
               "profile_path": "/6b8cRJOItz7yNpYuLCPkl5kv4m2.jpg",
               "id": 16935,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Fat Sam",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf255",
               "name": "George Wendt",
               "profile_path": "/wbDxe198w5Yu8zYdxkV9vmexN1E.jpg",
               "id": 66606,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Stanton Boyd",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf259",
               "name": "Kenneth Mars",
               "profile_path": "/xS8r7UXRtBLLCa5MPo0zYP66VlZ.jpg",
               "id": 9601,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Speaker",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf25d",
               "name": "Bill Henderson",
               "profile_path": null,
               "id": 80746,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Ted Underhill",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf261",
               "name": "William Traylor",
               "profile_path": "/m0I8yYx2HG0qxkT4TeUM1LMHTNm.jpg",
               "id": 124602,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Marvin Gillet",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf265",
               "name": "George Wyner",
               "profile_path": "/pWd7EqBz83MWu6FfLG0Eco7yY5d.jpg",
               "id": 14669,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Detective #1",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf269",
               "name": "Tony Longo",
               "profile_path": "/1kRcEeiz6cFAX41xz9ttCDE2MfG.jpg",
               "id": 13644,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Gummy",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf26d",
               "name": "Larry \"Flash\" Jenkins",
               "profile_path": "/iriLZ3jKRlGp1Ykusqj3G65zLSu.jpg",
               "id": 124603,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Creasy",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf271",
               "name": "Ralph Seymour",
               "profile_path": "/7lu95loRqfN0TTWZGM1QfI5hX8W.jpg",
               "id": 5147,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Himself",
               "gender": 2,
               "credit_id": "56520b639251410f190025f9",
               "name": "Kareem Abdul-Jabbar",
               "profile_path": "/xUzZxzrAaAKZ1l2quIJRgmBwOGU.jpg",
               "id": 14414,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Jim Swarthout",
               "gender": 2,
               "credit_id": "56520b7bc3a368070a00b557",
               "name": "William Sanderson",
               "profile_path": "/vR2EnhcPUqkIeXmHf10Sokeuw1J.jpg",
               "id": 590,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf227",
               "name": "Michael Ritchie",
               "profile_path": "/62566NoTLMRVLdoE07RG1B55zxy.jpg",
               "id": 12964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4526c3a36847f80bf22d",
               "name": "Gregory McDonald",
               "profile_path": null,
               "id": 58867,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "52fe4526c3a36847f80bf233",
               "name": "Andrew Bergman",
               "profile_path": "/gTx35MhqW8MlGv7JlYnCJQClebi.jpg",
               "id": 41550,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf239",
               "name": "Peter Douglas",
               "profile_path": "/979ooAln7rl5sVvxQ4Ba90Mh7v7.jpg",
               "id": 56940,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf23f",
               "name": "Alan Greisman",
               "profile_path": null,
               "id": 27541,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf245",
               "name": "Harold Faltermeyer",
               "profile_path": "/bqVaAHxzDxLQ1qe3yEko4WSQgWG.jpg",
               "id": 799,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf24b",
               "name": "Fred Schuler",
               "profile_path": null,
               "id": 3659,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf251",
               "name": "Richard A. Harris",
               "profile_path": null,
               "id": 3985,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.720288,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9749,
      "vote_count": 251,
      "budget": 8000000,
      "overview": "A veritable chameleon, investigative reporter Irwin \"Fletch\" Fletcher might drive his editor up the wall, but he always produces great pieces for the newspaper. When his next story is about the drug trade taking place on the beach, Fletch goes undercover as a homeless man. Unaware of Fletch's true identity, businessman Alan Stanwyk offers Fletch $50,000 to kill him. Intrigued, Fletch decides to unearth the full story behind the offer.",
      "similar": [
         1949,
         269,
         496,
         891,
         15,
         11615,
         350,
         65754,
         16995,
         11355,
         9772,
         314365,
         446354,
         3078,
         2142,
         1266,
         1372,
         10774,
         3085,
         49526
      ],
      "original_title": "Fletch",
      "runtime": 98,
      "poster_path": "/t8VjThRC6uKvjR5jVlhj5bBBUUy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1985-05-31",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/1mfDXSIPdbpBfTtdjmKnfSuAYUx.jpg",
         "name": "Fletch Collection",
         "id": 104833,
         "poster_path": "/kf8dk2ASMf0DEi5TZRXK47MDeHU.jpg"
      },
      "tagline": "Meet the only guy who changes his identity more often than his underwear.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Michael Ritchie"],
      "runtime": 98,
      "synopsis": "Los Angeles Times reporter Irwin \"Fletch\" Fletcher (Chevy Chase) is writing an article exposing the drug traffic on the beaches of Los Angeles. Posing as a homeless addict during his investigation, he is approached by Alan Stanwyk (Tim Matheson) who mistakenly assumes Fletch is a junkie. Taking him to his luxury mansion in Beverly Hills, Stanwyk formally introduces himself and that he works for Boyd Aviation as the executive vice president Stanwyk claims to have bone cancer, with only months left to live, and wishes to avoid the pain and suffering. Stanwyk offers $50,000 for Fletch to come to his mansion in a few days time, kill him, and then escape to Rio de Janeiro, staging the murder to appear as the result of a burglary. Fletch is suspicious but ostensibly agrees to the plan. Along with his colleague Louisa Larry (Geena Davis), he begins investigating Stanwyk instead of completing his drug trafficking exposé, much to the dismay of his impatient boss and editor Frank Walker (Richard Libertini). Fletch endures a rectal exam from Stanwyk's doctor, Dr. Dolan (M. Emmett Walsh), in a failed attempt to talk Dolan into divulging medical information about Stanwyk. Later, disguised as a doctor, Fletch accesses Stanwyk's file at the hospital and learns Stanwyk lied to him about having cancer. Fletch visits Stanwyk's wife Gail (Dana Wheeler-Nicholson) at her tennis club and, pretending to be a friend of her husband's, flirts with her during an impromptu tennis lesson. Looking into Stanwyk's finances, Fletch finds that Gail recently converted $3 million of her personal stock in Boyd Aviation into cash for her husband to buy a ranch in Provo, Utah. Fletch breaks into the realtor's office and discovers the deed lists the sale price as only $3,000. Meanwhile, LAPD Chief Jerry Karlin (Joe Don Baker) gets wind of Fletch's soon-to-be-published drug article and meets with him, saying the article will jeopardize his undercover operation on the beach. Chief Karlin threatens to kill Fletch unless he agrees to drop the investigation. Fletch refuses to do so, and as a result, Karlin puts out a phony APB on Fletch for drug dealing, thus making Fletch a fugivitive. Back at the tennis club, Fletch overhears a rude club member, Mr. Underhill (William Traynor), insulting a waiter and decides to use Underhill's tab to treat Gail to an expensive lunch in her private cabana. Fletch informs Gail of the details to her husband's murder scheme and the fraudulent ranch deal. Fletch surveils Stanwyk making a suspicious briefcase exchange with Chief Karlin, but is unable to determine the nature of their relationship. He returns home to find LAPD officers lying in wait at his apartment and flees and manages to avoid being caught after a seriously harrowing car chase. Fletch returns to Provo to hide out and, under the guise of an insurance investigator, interviews Stanwyk's parents. Fletch discovers Stanwyk has been secretly married to another woman for eight years, having used Gail for her money. At the climax, Fletch arrives at Stanwyk's mansion on the night of the plotted murder only to find Stanwyk armed and ready to kill him instead. Fletch reveals he is aware Stanwyk's real plan was to fake his own death by killing Fletch and burning his body beyond recognition. Stanwyk would then escape to Brazil with his other wife as well as Gail's $3 million. Stanwyk was also using his private jet to smuggle cocaine from South America to supply Chief Karlin who in turn profited by blackmailing ex-convicts like Fat Sam (George Wendt) to peddle it on the beaches. Chief Karlin unexpectedly shows up and, upon learning of Stanwyk's intentions to flee with $800,000 of the Chief's drug money, kills Stanwyk. Chief Karlin then turns the gun on Fletch but is knocked unconscious by Gail. Some time later, Chief Karlin is indicted due to Fletch's investigation. Fletch begins dating Gail and in the final scene, takes her on a vacation to Rio, Brazil.",
      "writers": [
         "Gregory McDonald",
         "Andrew Bergman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089155/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5ODU5MzU0OV5BMl5BanBnXkFtZTcwNzM1MzI0MQ@@._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Chevy Chase, Joe Don Baker, Dana Wheeler-Nicholson | See full cast and crew »"],
      "reviews": [
         "This movie is over the top hillarious - I don't know what hyped up dope that the last person who left a comment was on, but I LOVE this movie! What really makes the movie is both Fletch's imagination, his flair for developing different characters, and especially his speed talking. examples include \"I love your body Larry (Geena Davis)\" while on the phone in front of a hotel clerk, \"Nugent, Ted Nugent\" when asked by Alan what his name was, \"What kind of a name is Poon anyways?\" asks Mr. Boyd, to which Fletch's reply is, \"Comanche Indian\". This movie totally rocks and you will love seeing it AGAIN and AGAIN!!! It is so much better than jay and silent bob strike back, you'll be laughing for hours! enjoy!",
         "Chevy Chase plays investigative reporter Irwin M. Fletcher, nicknamed Fletch, who's disguising himself as a junkie on the beach to uncover a smuggling ring. He gets spotted by Tim Matheson, a real estate millionaire, who asks Fletch to kill him so his wife can receive the inherit. Fletch goes snooping around and finds out that his smuggling ring investigation might somehow be tied to the millionaire. With a different leading man this film could very well have been a full blown thriller. Imagine John Frankenheimer directing and Robert De Niro starring. But, in dealing with what's at hand, Fletch is a good comedy where Chase can showcase his range of disguises and delivery of good one-liners. Chase absolutely smothers the film with wisecracks and the overall very well constructed mystery is nearly overlooked. With repeated viewings I've actually come to appreciate the film more for it's genuinely gripping detective story elements, it really does boast a solid mystery that unfolds well. There's one thing for sure here; you have to be a fan of Chevy Chase for this film to work for you. Since I'm a fan the film is in high regard. Chase's wisecracks aren't all brilliant but they're mostly very good and here he's at the top of his game. Fletch and Clark Griswold are the two characters Chevy Chase will most be remembered for.",
         "Fletch is a refreshing departure from most modern crime/mystery flicks, and cop comedies. Chevy Chase plays Fletch, an undercover journalist with a penchant for clever disguises. The film takes itself seriously, as we see Fletch run from place to place making up names and solving the mystery. What makes this film great is that it's not a comedy by nature, but that the character Fletch is a comical man. Thus, we laugh at him and the situations he makes for himself. The film doesn't need to poke fun at itself, we have enough fun watching Fletch. It's hokey at times, and some of the supporting actors can be a little flimsy, but if you're interested in a great light-hearted mystery from the 80's, Fletch is a great watch!",
         "Class! just pure class, nothing long winded just short and sweet, made at a time when chase was top of his class with others like steve martin, as for the film its a good story with many many jokes most of which you will have to see the film again to catch as some as they are very fast such as name changes he comes up with, it still stands up well today even if some jokes are lost on people to young to remember certain peoples names, its a shame people like chase don't get the films that made them so big in the 80s but times and tastes change, i myself am a chase fan and this film is him doing what he does best. SEE IT",
         "Chevy Chase's finest comedy. It's the part that he really sunk his teeth into. It's a perfect blend of humor, mystery and drama. Although Chase gets more mileage out of it because of the laughs, it's an intriguing character in all respects. Michael Ritchie directs nicely and the supporting cast works well, particularly Libertini as Fletch's noisy and brassy editor in chief. This is a film that is filled with more classic one liners than any film in the 1980's. It's one that makes us miss the old Chase and wonder why he's planning to make yet another \"Vacation\" movie. We miss you, Chevy!",
         "\"Fletch\" (circa 1985), the original \"Fletch\" flick, features Chevy Chase at his prime who, in his own inimitable way, plays a straight-faced, bemused, fast-double-talking investigative reporter who solves a major drug smuggling operation. \"Fletch\" is currently on the cable merry-go-round and makes for a fun and entertaining watch for Chase fans or Chase fans to be.",
         "In what may have been the high point of Chevy Chase's career, he plays Irwin \"Fletch\" Fletcher, a reporter who writes a column under the name Jane Doe. When a man hires Fletch to kill him, Fletch decides to investigate the man. As you might imagine, in the process, he gets more than he bargained for. And there's several gags throughout the movie. Of course, since this is a Chevy Chase movie, you don't even really need to pay attention to the plot. It's overall just an excuse for the star to goof off. Maybe not as much as he did on \"Saturday Night Live\" or in \"National Lampoon's Vacation\", but he's still funny as ever. He must have had fun making this movie.",
         "**Quote Spoilers Ahead** Oh man, what can I say? Chevy Chase has some of the best deadpan oneliner deliveries of his career in this hilarious comedy about the shenanigans of investigative reporter Irwin M. Fletcher, alias \"Fletch F. Fletch\", \"Nugent; Ted Nugent\", \"Dr. Rosen-rosen, Rosen-penis\", \"Igor Stravinsky\",\"G. Gordon Liddy\" Etc. Etc!! I love how Chase's character plays off of such character actors as Joe Don Baker, George Wendt, and M. Emmett Walsh. The they are excellent foils for Chevy Chase's very funny and sometimes subtle jokes and insults! Some highlights of the film are the physical exam scene (Fletch refers to Walsh's character as \"Dr. Jellyfinger\"!-Priceless!), The country club scene with such lines as \" Yes, very good; I'll have the steak sandwich and... a steak Stanwyk.\" And no one should miss the chase sequence thru the streets of LA in a 'borrowed' Alfa Romeo Spyder! \"Just gotta check the fluorocarbon output!\",\"Hey Fred! How's the herpes? Does it hurt?\". Which leads up to the improvised speech Fletch gives in tribute to \"Fred 'the Dorf' Dorfmann\", the father of \"Internal Bushings\"... \"No more alcohol and sedatives in her life.\" So much is going on here, that repeated viewings are definitely recommended by this reviewer to catch all the asides and little moments to be had in this film! I also split my sides during the autopsy sequence. \"Have you ever seen a spleen this large?\"-\"Not since breakfast.\" All in all, lots of action, general hamminess and a very good supporting cast making this one a keeper for anyone's movie collection! Highly recommended for comedy fans and a must see. One of the best examples of this type of humor! \"It's all ball bearings these days!\"\"You and Tommy LaSorda?...I hate Tommy LaSorda!\"\"I feel like a hundred dollars.\"\"Nice garage. Must've cost hundreds.\"\"...I saw the bright red Oldsmobuick of Mr. Arnold T. Pants, Esq. Attorney at Law.\"\"Get me some gauze pads and 30-weight for that fetzer valve... and clean those windows, they have filth and muck on them!\"\"Does this entail me dressing up as 'Little Bo-Peep'?\" Very Quotable... I give it an 8.8/10.",
         "Spoiler This movie is by far one of the most well-crafted scripts ever. Every joke is put in the perfect place and Chevy Chase has the right dry humor to deliver them. In between the jokes is a decent plot of a journalist Irwin Fletcher aka Jane Doe (Chase) who uncovers a major story on drugs, murder, multiple wives and crooked cops. This movie has it all. It goes as follows: Fleth meets Allen Wyck who asks him to kill him. Fletch accepts and later falls for Wyck's wife. In the course of his love he spends much time on the beach hanging with junkies Fat Sam and Gummy--which is how he stumbles onto the crooked cops. Later investigating Mr. Wyck he learns he is married to a girl in Provo, Utah. When it's discovered Fletch goes to his ends to put it all together finding out that Police Chief Carlin is in cahoots with Wyck on a scam worth millions. Fletch wins, gets the girl and so goes it. With classic dialogue to be repeated throughout the ages, such as: \"I'll have a Bloody Mary, a steak sandwich...and a steak sandwich.\", \"I was going to buy this place till I found out Butch Cassidy killed himself here. Bow and Arrow...very strange.\", \"What the hell you need with ball bearings?\" and \"Can I borrow your towel? My car just hit a water buffalo.\" I have owned this movie for years and laugh everytime I see it. Disappointed as I was with the sequel \"Fletch Lives\", this is the keeper. I would recommend this movie to anyone who was looking for some laughs.",
         "I sat and larfed my butt off when I saw this in Beeville TX summer '85. And it still holds up today, though the score is kinda crappy, still...you gotta love the get ups, the one liners, and the mystery, too, kinda works. Check out the scene where joe Don Baker threatens Chevy with the gun...Baker wasn't kidding. He was gonna do in Fletch right then and there. They had just enough oomph in the mystery/police corruption angle to let you know that this wasn't just Slapstick Chevy. It works. I enjoyed seeing Jim Bob from the Waltons play a bit as a car thief, who gets stuck in a car chase with Chevy, the Kareem cameo, hmmmm, and the pretty generic blonde who Chevy gets at the end. She is quite nice, doesn't seem to have had much of a career...(Dana Wheeler-Nicholson?) Overall, enjoyable, they coulda made 3-4 of these. *** outta ****"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Vincent Pictures"
      ],
      "summaries": [
         "Irwin \"Fletch\" Fletcher, Los Angeles journalist, really lives for his profession. As Jane Doe, he publishes articles that have caused several heads to roll in the past. Now, Fletch is at it again: In disguise as a bum, he lives at the beach, researching drugs and their dealing. One day, Fletch is addressed by Alan Stanwyk, a rich man, who asks him, the bum, a favour. For the sum of $50,000, Fletch should kill poor cancer-ridden Mr. Stanwyk with a gun, so that his wife will get the insurance money. What the guy didn't think of was Fletch's real profession. Returning into normal life, Fletch instantly takes up research not only to find out that Mr. Stanwyk is healthy as life itself but he also runs into certain connections between drug dealing at the beach, Alan Stanwyk, his private jet, the police and a very expensive piece of Land in Utah.",
         "Fletch is an ace reporter. While working on a story on Drug sales, he is approached by Alan Stanwyck who wants Fletch to murder him to save him from a lingering cancer death. Fletch begins to nose around and finds irregularities in Stanwyck's past and Underhill's Visa Number."
      ],
      "budget": 0
   },
   "movielensId": 2371,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-05-31",
      "dvdReleaseDate": "1998-08-19",
      "directors": ["Michael Ritchie"],
      "runtime": 98,
      "movieId": 2371,
      "title": "Fletch",
      "mpaa": "PG",
      "actors": [
         "Chevy Chase",
         "Joe Don Baker",
         "Dana Wheeler-Nicholson",
         "Richard Libertini",
         "Tim Matheson",
         "M. Emmet Walsh",
         "Geena Davis",
         "George Wendt",
         "Kenneth Mars",
         "Bill Henderson",
         "William Traylor",
         "George Wyner",
         "Tony Longo",
         "Larry \"Flash\" Jenkins",
         "Ralph Seymour",
         "Kareem Abdul-Jabbar",
         "William Sanderson"
      ],
      "imdbMovieId": "0089155",
      "originalTitle": "Fletch",
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["4sMMt2M3RiU"],
      "plotSummary": "A veritable chameleon, investigative reporter Irwin \"Fletch\" Fletcher might drive his editor up the wall, but he always produces great pieces for the newspaper. When his next story is about the drug trade taking place on the beach, Fletch goes undercover as a homeless man. Unaware of Fletch's true identity, businessman Alan Stanwyk offers Fletch $50,000 to kill him. Intrigued, Fletch decides to unearth the full story behind the offer.",
      "tmdbMovieId": 9749,
      "avgRating": 3.42654,
      "releaseYear": "1985",
      "numRatings": 7528,
      "posterPath": "/t8VjThRC6uKvjR5jVlhj5bBBUUy.jpg"
   }
}