{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "handcuffs",
            "id": 772
         },
         {
            "name": "police chief",
            "id": 2993
         },
         {
            "name": "police operation",
            "id": 4668
         },
         {
            "name": "spying",
            "id": 5265
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "police everyday life",
            "id": 7477
         },
         {
            "name": "police academy",
            "id": 40957
         },
         {
            "name": "commandant",
            "id": 208260
         }
      ],
      "imdb_id": "tt0089822",
      "video": false,
      "title": "Police Academy 2: Their First Assignment",
      "recommendations": [
         12118,
         10587,
         11825,
         11895,
         9336,
         11546,
         36593,
         9595,
         37137,
         9671,
         9396,
         9255,
         306,
         96,
         9493,
         12154,
         9594,
         6280,
         9604,
         10136
      ],
      "backdrop_path": "/t97wr6zbY9CGg1qsOwkLldICEJg.jpg",
      "revenue": 55600000,
      "reviews": [{
         "author": "Ian Beale",
         "id": "58a0be739251412b67001d20",
         "content": "**Superior to the first movie**\r\n\r\nThis movie has so many great moments. All of the original gang return - except Harris and Callahan. Lt. Mauser ( Art Metrano) is the new slimy adversary here along with his braindead sidekick, Proctor. \r\n\r\nHighlights include the hilarious Kirkland family and their _bouts_ of affection, an overly sticky black sock, a gang of moronic street thugs led by the cretinous Zed (Bob Goldthwait) and a hilarious scene in a sushi bar.  \r\n\r\nThe last of the truly funny Academy movies.",
         "url": "https://www.themoviedb.org/review/58a0be739251412b67001d20"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Carey Mahoney",
               "gender": 2,
               "credit_id": "52fe43389251416c75007fc5",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Hightower",
               "gender": 2,
               "credit_id": "52fe43389251416c75007fc9",
               "name": "Bubba Smith",
               "profile_path": "/2T5nQh0xQZfpJOcQGN9PKqCJgK.jpg",
               "id": 57349,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Tackleberry",
               "gender": 2,
               "credit_id": "52fe43389251416c75007fcd",
               "name": "David Graf",
               "profile_path": "/hf4duQ2dITqZWGRktvr2ezmsPRR.jpg",
               "id": 57353,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Larvell Jones",
               "gender": 2,
               "credit_id": "52fe43389251416c75007fd1",
               "name": "Michael Winslow",
               "profile_path": "/G3GZNtLSVhohjR0QEIt2EYjneZ.jpg",
               "id": 14672,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Zed",
               "gender": 2,
               "credit_id": "52fe43389251416c75007fd5",
               "name": "Bobcat Goldthwait",
               "profile_path": "/wYwGbSqEGAqpT4or8YHQ79ycoz4.jpg",
               "id": 95024,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Sgt. Kathleen Kirkland",
               "gender": 1,
               "credit_id": "52fe43389251416c75007fd9",
               "name": "Colleen Camp",
               "profile_path": "/3SbQnaC4SjykOIPDzrDlyIKzD9I.jpg",
               "id": 13023,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Doug Fackler",
               "gender": 2,
               "credit_id": "53c0ba1a0e0a2615890080c3",
               "name": "Bruce Mahler",
               "profile_path": null,
               "id": 57356,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Laverne Hookes",
               "gender": 1,
               "credit_id": "53c0ba2f0e0a26158f007c97",
               "name": "Marion Ramsey",
               "profile_path": "/xd5omaBzCiDeAc91MOfFD9ane6a.jpg",
               "id": 186816,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Lt. Mauser",
               "gender": 2,
               "credit_id": "53c0baae0e0a26157f0082eb",
               "name": "Art Metrano",
               "profile_path": "/3IPQYpit646GjHd1cjfgiqGFfIh.jpg",
               "id": 15212,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Commandant Lassard",
               "gender": 2,
               "credit_id": "53c0bad10e0a26157f0082f4",
               "name": "George Gaynes",
               "profile_path": "/cntFGEwxz14xvl8KXW2WXahpvS5.jpg",
               "id": 57351,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Chloe",
               "gender": 1,
               "credit_id": "53c0bb2f0e0a26158f007cb2",
               "name": "Julie Brown",
               "profile_path": "/8a1NwjIyjOWmYTqdj4fuxqKlzR5.jpg",
               "id": 40680,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Merchant",
               "gender": 0,
               "credit_id": "53c0bb430e0a261579007f20",
               "name": "Tim Kazurinsky",
               "profile_path": "/4MeLlddWvGZGFpHvwwTtrgHepP2.jpg",
               "id": 95216,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Mojo",
               "gender": 2,
               "credit_id": "574f87709251417a2e00026d",
               "name": "Christopher Jackson",
               "profile_path": null,
               "id": 1587179,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007f97",
               "name": "Jerry Paris",
               "profile_path": "/mVcAxdJG3uFVhr5erMCOZvla9UA.jpg",
               "id": 41720,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007f9d",
               "name": "Neal Israel",
               "profile_path": null,
               "id": 57359,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007fa3",
               "name": "David Sheffield",
               "profile_path": null,
               "id": 57327,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007fa9",
               "name": "Barry W. Blaustein",
               "profile_path": "/gxV95QsO45TyPSFw9wnfk9U8L79.jpg",
               "id": 57328,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007faf",
               "name": "Paul Maslansky",
               "profile_path": null,
               "id": 33096,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007fb5",
               "name": "Robert Folk",
               "profile_path": null,
               "id": 43393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007fbb",
               "name": "James Crabe",
               "profile_path": null,
               "id": 14843,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43389251416c75007fc1",
               "name": "Bob Wyman",
               "profile_path": null,
               "id": 12016,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 14.37415,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10157,
      "vote_count": 421,
      "budget": 0,
      "overview": "Officer Carey Mahoney and his cohorts have finally graduated from the Police Academy and are about to hit the streets on their first assignment. Question is, are they ready to do battle with a band of graffiti-tagging terrorists? Time will tell, but don't sell short this cheerful band of doltish boys in blue.",
      "similar": [
         75780,
         11825,
         11423,
         10587,
         96,
         807,
         4771,
         193893,
         49524,
         984,
         2142,
         25376,
         9411,
         6973,
         11689,
         10651,
         2275,
         1586,
         357096,
         1949
      ],
      "original_title": "Police Academy 2: Their First Assignment",
      "runtime": 87,
      "poster_path": "/iNlm1BBGCwfP207QzuUk2Ei13sG.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Ladd Company",
            "id": 7965,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1985-03-28",
      "vote_average": 5.7,
      "belongs_to_collection": {
         "backdrop_path": "/4fjmNFs31JPfa4rYtE3gNDspGlk.jpg",
         "name": "Police Academy Collection",
         "id": 9338,
         "poster_path": "/q6npkfLX1jryO4a3GI63WJW9TrT.jpg"
      },
      "tagline": "To protect, to serve... and make you laugh. America's funniest crimebusters are back!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jerry Paris"],
      "runtime": 87,
      "synopsis": "In this sequal to the first Police Academy movie, a nerdish storefront owner named Mr. Sweetchuck, is attacked and robbed of $8. by a local street gang known as \"The Scullions\" whom are led by the infantile Zed (Bobcat Goldthwait). After hearing about the incident, Chief Henry Hurst (George G. Robertson) arrives at the 16th precinct and notifies its captain, Pete Lassard (Howard Hesseman) that the precinct is the worst in the city for even old ladies throw things and spit at passing policemen on the street outside the station. Nevertheless, Hurst gives him 30 days or else Lassard is out. Before he leaves, the coniving Officer Mauser (Art Metrano) schemes his way into talking to Hurst. Hurst promises him the rank of captain should Lassard fail. Pete calls his brother, who happens to be Commandent Eric Lassard (George Gaynes) and asks him for six new recruits, as was promised by Hurst. Throughout the movie, Mauser is seen scheming with his dim-witted partner Sgt. Proctor (Lance Kinsey) as he attempts to take control of the precinct. The recently graduated Carey Mahoney (Steve Guttenberg), Larvell Jones (Michael Winslow), Eugene Tackleberry (David Graf), Moses Hightower (Bubba Smith), Laverne Hooks (Marion Ramsey), and Douglas Fackler (Bruce Mahler) join the 16th precinct, and some are assigned a veteran officer partner since they're rookies: Fackler has Dooley (Ed Herihly), Mahoney has the overweight Vinnie Schtulman (Peter van Norden), and Tackleberry has Sgt. Kathleen Kirkland (Colleen Camp). At first, Tackleberry disapproves that his partner, Kirkland, carries stigmatized faults because of the fact she's a woman, but they later hit it off when they compare their preference of gun choices. Tackleberry later confides to Mahoney that he may have fallen in love with her. Mahoney and Schtulman spot a robbery at a merchant's place called \"Schewchuk's Lighting\", a chandelier store owned by the nerd Mr. Sweetchuck (Tim Kazurinsky) (Zed's victim from the opening scene), but the robbers escape through a back door before Mahoney and Schtulman even enter the shop. Eventually Fackler, Tackleberry and Kirkland arrive, each one contributing in his own characteristic way to the destruction of the store. Mauser is ready to suspend them, but Mahoney makes a passionate plea that convinces Lassard to give them another chance. While all this is going on, Zed and his gang go shopping in a supermarket. They cause havoc as they go, leaving the store with wagon-loads without paying. and Mr. Sweetchuck is already at hand in the supermarket to be further tormented this time by Zed and his group. Mauser gives Mahoney a new assignment; patrolling a tunnel which is congested with traffic, and thus covering him and his partner with soot in the process. Mahoney gets revenge on Mauser by switching his shampoo with Tackleberry's epoxy resin solution, which glues his hands to his hair. He ends up embarrassing himself in front of the station by being tricked into leaving the locker room... fully nude. As a result Mauser has to wear a freakish red wig through the remainder of the film. On his morning drive to the station the next day, Pete Lassard spots some of Zed's men and tries to deal with them, but is eventually over-powered and spray-painted. After his rousing speech to finish what they started, the whole gang is riled up. Progress is made and most of the gang is captured (leading to 42 arrests), but Mauser informs the captain that most of the charges were dropped for brutality and lack of evidence. Mahoney sees that Mauser did this deliberately to discredit Captain Lassard. As revenge, Mahoney has a full body cavity search done on Mauser (the search was supposed to go to one of the arrested gangmembers). Meanwhile, Tackleberry goes on a date with Kirkland, where they stay out late dancing. They profess their love for each other and have sex (but removing their numerous concealed weapons first before clothes). Across town, Pete goes to see his brother Eric at a Japanese steakhouse, and Eric comes out with an idea to hold a fair. At the night of the fair though, Zed's men trash the place. As a result, Lassard is out of a job the next day, while Mauser is promoted Captain. His first act is to remove Mahoney and Schtulman, whom are quick to object to Mahoney's dismissal. Mahoney, Schtulman, and Pete Lassard get together in an last-ditch attempt to stop the gang. They send in Mahoney undercover to find the leader of the gang. (Everybody at this point doesn't know Zed's name or that he is the gang leader.) Lassard and Schtulman wire Mahoney, using duct tape and a radio microphone. Under the guise of \"Jughead,\" he is able to infiltrate the gang and find out both their hiding spot and the name of their leader. His cover is blown however due to the radio microphone cutting into a baseball game, which leads to Lassard calling every man to the location. Mauser intervenes, but takes Fackler through the air duct. However, Fackler accidentally bumps him and pushes him inside. The police arrive and arrest every gangmember there. Zed escapes with Mahoney, but Lassard arrives and prepares to shoot Zed with a loaded pistol. Mahoney punches him down a flight of stairs, while Hooks arrests him. It is then revealed that Lassard's gun wasn't loaded, as he \"never carried live ammo since '73\". The movie ends with the officers attending Tackleberry and Kirkland's wedding. They drive off the Police Academy lot in a monster truck. At the same time a new group of police cadet misfits join the academy. Among them is the natural-born-geek Mr. Sweetchuck, and the \"redeemed' Zed.",
      "writers": [
         "Neal Israel",
         "Pat Proft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089822/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc5NDQ4OTM0Ml5BMl5BanBnXkFtZTYwMDA2MjQ5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steve Guttenberg, Bubba Smith, David Graf | See full cast and crew »"],
      "reviews": [
         "Police Academy is such a classic, it has some of the best laughs and is just such a great time to watch it wither it's by yourself or with a group of friends. So I couldn't resist, I had to see the sequels, but I was really nervous when I kept checking all the ratings for the sequels, they're all pretty low and below average. So I was expecting Police Academy 2: Their First Assignment to be absolutely bad, but actually I did laugh quite a bit. I admit this was below what the first one was with the laughs and the story, but I felt like it was a decent follow up with the first Police Academy movie. It was cool to see the old gang back together and just having fun like they did in the first film. The story is a little weak but it's still a lot of fun to watch and has some great laughs. A violent, well, um, if that's the right word, a violent gang has moved in on the town and are just making it into a havoc for anyone to live in. They are also making a mockery of the police, well, that's not too hard to do since they're pretty incompetent, so the chief wants a new team. He is given the class of '84, who haven't had any good jobs since they graduated, but now they are back together to get this gang out of town. At first they just end up screwing just as badly, but come together to be the best police force in town. Police Academy 2: Their First Assignment in my opinion is a fun movie, I think the 4.8 rating is a little harsh, I understand the low 5's, but I think the reason why is because it is a little less than the first Police Academy movie, now of course I would say to stick with the original for right now, but I wouldn't shy you away from the sequel. Anyone who says they didn't laugh once during this movie must be lying, because the scene where they put super glue in their Sergent's shampoo was beyond hilarious, it's a classic. So just go ahead and have fun with this movie, I think you'll enjoy it. 5/10",
         "Police Academy 2 (1985) was quickly rushed into production to capitalize upon the surprisingly successful first film. The recruits have finally graduated from the academy and are now assigned positions throughout the city. Crime is rampant and the people are afraid to leave their homes because of a local crime wave. A group of young punks (led by Bobcat Goldwait) have recently assaulted the chief of police (Howard Hesseman). With the city in turmoil and with his job being threatened by the Chief's right hand man, he turns to the new recruits to help clean up the city. I hate it when they franchise a movie and tone down the raunchy humor and crude manners, elements that made the first one a success. The movie is funny but it's not as good as the first film. Sadly the creativity and humor of the Police Academy films goes down the eventual slippery slope. By the fifth film the series becomes very unwatchable and extremely redundant. Even though it's a step down from the first film, it's still entertaining. Recommend x",
         "The original Police Academy was stupidity maxed out but brought together with a weird outlandish cast that manages to stay with you and has such become a classic. Not too mention that it grossed over 100 million dollars so a sequel is a must do for Hollywood. Let's face it, there was enough characters and ideas in this franchise to do a sequel, or six sequels as the case turned out to be. Nonetheless it made sense after showing all the cadets make it to graduation that we would get to see them on the job. Thus continues Police Academy: Their First Assignment. Most of the original cast returns...Steve Guttenberg as Carey Mahoney, Bubba Smith, David Graf, Michael Winslow, Bruce Mahler, Marion Ramsey, and even George Gaynes in a more cameo type role as Cmdt. Eric Lassard. Guttenberg's Mahoney seems toned down in this sequel which is unfortunate. He doesn't show a lot of the smart-ass, prank playing personality that made the original so great. Everyone else plays their roles similar to that of the original so the jokes when it comes to the characters haven't changed a lot...just perhaps more of them. Michael Winslow as the noise making Larvell Jones is used far more in this one than in the original. Also at the forefront is Eugene Tackleberry who is a great character and he's a lot of fun and a great hero to watch. Sadly the film is noticeably missing G.W. Bailey, who plays Mahoney's perfect adversary Lt. Thaddeus Harris. He's replaced by Art Metrano who plays Lt. Hauser, the wanna-be Captain who will stop at nothing to see the force fail so that he can take over. He's good and it's fun to watch him get pranked by Mahoney but he doesn't have the seriousness/comedic timing that G.W. Bailey had as Harris. The late Jerry Paris takes over on the directing helm and seems to keep the Police Academy recipe in full force. As mostly a TV Director but a seasoned actor Paris should know all about comedy. Also to keep things fresh that added some new faces to the cast. Bob 'Bobcat' Goldthwait stars as the leader of the gang that is ruining the neighborhood that the Academy cadets are trying to clean up. Granted the first few moments of Goldthwait played Zed or playing himself are funny. The voice and the nervous little tics are humorous but then they just aren't funny anymore. And he's far from believable as the leader of any gang. Tim Kazurinsky plays Sweetchuck, the innocent, scared little store owner being harassed by Zed and his goons. And Howard Hesseman as Captain Lassard, little brother of Eric Lassard. Hesseman is good as their leader but the story isn't strong enough so everyone kinda falters because of it. Just like the first, Police Academy 2 is STUPID!! But that is exactly what Police Academy is and meant to be. It doesn't try to be anything but. All the characters are funny and have their own little quirks and it's a revisiting that was to be expected and done in an okay style. It's still even not as good as the original, but it is a sequel. The plot and story isn't quite as interesting as the original. Everything else is practically the same, and more of it!! There are still several silly little spots that you'll find yourself laughing out loud about. It's slapstick and still low budget and just fun. Rent this one with the original and you'll have a good laugh. Don't take it too seriously!! 6/10",
         "After the Police Academy surviving the graduating class that these most unusual police cadets are in, the whole group is assigned by special request of Howard Hessemann brother of Academy Commandant George Gaynes to his precinct which has seen an outbreak of gang violence. Hessemann is looking for some new and idealistic recruits to help him out. Instead he gets these goofballs. If Steve Guttenberg learned Courtesy, Professionalism, and Respect at the Academy it's all forgotten by him and his fellow graduates. They also get involved in departmental politics as second in command Art Metrano at the precinct wants this crew to foul up. And they do everything they can to oblige him. Police Academy movies are a guilty pleasure of mine. They can be described as gross, vapid, stupid, puerile, and funny as all hell. I'm so glad they wrote in George Gaynes into this film showing his graduates and how well they do in Police Academy 2: Their First Assignment. There is something downright lovable about the clueless Captain Lessard whom he plays. And Art Metrano is the kind of villain you just love to hate and you just love seeing how Guttenberg and the rest get back at him in their own little ways. The regulars are all there, Bubba Smith with that 6'7\" inch frame of his, showing that size does indeed matter, Michael Winslow and that uncanny ability of sound effects, David Graf as Tackleberry who finds true love in this one with Colleen Camp. My favorite however is Marion Ramsey, little Officer Hooks with the squeaky voice. You can't help but love her. Police Academy 2: Their First Assignment may be the funniest of the series. Watch it and see if you agree.",
         "Police Academy 2 Their First Assignment is filled with non stop laughs from start to finish honestly I enjoyed this movie more than it's sequels because after wards it got a bit boring. This time around we see Police Academy graduates Carey Mahoney (Guttenberg) and his friends Jones (Winslow), Hooks (Ramsey), Hightower (Smith), gun loving Tackleberry (Graf), and Fackler (Mahler) assigned to the 16th precinct to help stop a gang led by Zed (Goldthwait) that's terrorizing the neighborhood. Meanwhile Lieutenant Mauser (Metrano) does all he can to prevent the new recruits from succeeding if all fails he'll replace Pete Lassard (Hesseman) the brother of Commadant Lassard (Gaynes) as captain. So the group fights back with slapstick humor and crazy antics, along the way Tackleberry falls in love with fellow officer and also gun lover Kathleen Kirkland (Camp)It was so funny seeing Mahoney get revenge on Mauser by switching the shampoo with epoxy resin made me laugh so hard.",
         "The crew of the first \"PA\" movie are back! Carey Mahoney(Steve Guttenberg), Moses Hightower(Bubba Smith), Eugene Tackleberry(David Graf, 1950-2001), Laverne Hooks(Marion Ramsey), Larvelle Jones(Michael Winslow), and all the others from the original. This one is really of the hook. It got some great scenes here I really like. Tackleberry mentions his sex life to the others, so when he's partner with a female officer, you see what I mean. However, each one of them have a flair for guns. That's a great start there. Then there's a scene where Jones goes kung fu cinema on the bad guys. If you thought his sound effects on the first on was something, the fight scene is really something to remember by. Then there's a person in the department who is worse than Harris(G.W. Bailey), it's Mauser(Art Merano). The gang got him good when Jones switched the shampoo with the epoxy, and they have him leaving the shower, exposed. The real challenge is when they took out the gang who are running rampant all over the city. It's a surprise when they got Zeb(Bob \"Bobcat\" Goldwait) to join the force, and BIGFOOT as the honeymoon vehicle? What a hoot! I liked the movie very well. 4 out of 5 stars!",
         "Police Academy 2 is a cinematic masterpiece. I was really surprised on how the cast came together to make a very good film. Howard Hessman AKA Dr. Johnny Fever from WKRP in Cininnnati, makes his only appearance in the series as Lasards brother. There chemistry on screen is unmatched and its a shame that they never teamed up again. Tim Kazerinsky plays the role of Sweetchuck, a very complicated man with many unfulfilled dreams. Bobcat Goldwait also makes his first appearance in the film. This film feels good from start to finish.Steve Guttenburg remains in top form as does Bubba Smith, and the late David Graf round out a talented cast.",
         "Police Academy 2: Their First Assignment was the last film to be remotely funny out of the further Academy films. No wonder almost every single orignal cast member dropped after the 4th film. My favorite character in this film however, and the only being who made it funny, was Bob Goldthwait. He and his raspy voice are hilarious, and make this film worth watching. I saw it on at 1 am once. I guess it's the only time slot the channel figure that no one will be watching. Anyway, it's worthy of a one time viewing, as the first, though they are both rip-offs of the film stripes. But still, see 1 & 2 once, and don't bother with the rest. 2.5/5 stars. JOHN ULMER",
         "Police Academy 2 is a joy from beginning to end. It's faster moving than the original and above all else, funnier. Director Jerry Paris ensures that the audience are going to have a good time with this picture. No blow jobs this time, instead we have forced anal inspection, which is probably less embarrassing to watch and much more hilarious.We also have more sight gags: Tackleberry's sweaty sock sticking to a door, Sweetchuck inadvertently punching a gang member,goldfish boiling on hotplates.We get our first glimpse at psycho gang leader, Zed. We meet the lunatic Kirkland family.Police Academy 2 has it all! This is the best of the series.It was downhill from here, I'm afraid.",
         "police academy 2 is one of the best. summary:(spoilers) the 16 th precinct is not doing so well with a gang in their district led by a gang leader zed.all the people from the original police academy are sent to the precinct,funny mahoney,gun loving tackleberry,accident-prone fackler,motor mouth jones,hightower and short voice hooks,there are some newcomers,paranoid captain lassard,ambitiuos leutenant mauser and sgt.proctor.they all go out and fail,so the captain has a word with them.they finally do good but some of the charges had to be dropped.the captain see's his brother at a chinese resturant and calls the waiter a stupid b***+ ard when just then cmnt.lassard says why not do a street fair,that fails so he quits,lt.mauser is now captain mauser and the defacto commander of the 16th precinct,there are many pranks played on him such as giving him a body cavity search and gluing his hands to his head while taking a shower. when mahoney gets suspended, him and the former captain team up to find the gang,well the find them and mahoney goes undercover at the old zoo.capt.mauser shows up and foils lassard's plans to attack and gets dopey fackler to go up with him to the air vent,when up there fackler pushes mauser down the vent by accident and then all the gang members get arrested and put behind bars the film ends with tackleberry getting married to his partner kirkland and with lassard being bumped up to captain and mauser being bumped down to lt,or maybe thats when he starts his own academy and becomes a cmnt in the next one,oh well,i loved this one but the only thing that was missing was lt.harris,they were trying to make mauser like harris but it just was not the same 9/10 stars"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Ladd Company, The"
      ],
      "summaries": [
         "Mahoney and friends have graduated from the Police Academy - Dümmer als die Polizei erlaubt (1984) and are issued with their first assignments. As before, their cheerfulness and devotion to duty outweighs any shortcomings, but are even they ready to do battle with a band graffiti daubing terrorists?",
         "Carey Mahoney and his friends Larvell Jones, Eugene Tackleberry, Moses Hightower, Laverne Hooks, and Douglas Fackler have now graduated from the Police Academy - Dümmer als die Polizei erlaubt (1984), and are ready to start going after real criminals. Their assigned precinct, which has the city's highest crime rate, is under the command of Captain Pete Lassard, the younger brother of academy commandant Eric Lassard. Chief Henry Hurst has told Pete that if the precinct's crime rate is not lowered, then Pete will no longer be captain. A big step toward lowering the crime rate would be to stop a local gang of toughs and their leader, Zed. The assignment goes to Mahoney and his fellow graduates. Mauser, a lieutenant at the precinct, doesn't want to see them succeed, because Mauser wants to replace Pete as captain. That's why Mauser begins to roadblock any efforts against Zed. Not to be outmaneuvered, Mahoney and his friends plot an appropriate revenge on Mauser while they go after Zed.",
         "The part of the city which has the highest crime rate is under the care of Captain Pete Lassard, when the chief demands that he turn things around or he is out. He in turn calls his brother, Eric, the academy commandant, and requests some new people. He recommends recent graduates, Mahoney, Hightower, Jones, Tackleberry, Fackler, and Hooks. Now they are teamed up with some veteran officers, who are not exactly competent, and along with their inexperience they cause more trouble than the gang they are pursuing. And they also have to deal with Lieutenant Mauser, who wants them to fail, so that he could become the new Captain.",
         "Watch out! A wacky wizard of Ozzy and his leathered and studded band of punky pranksters are on the prowl, spray-painting the town red and emptying the pockets of anyone sharing the sidewalk. In the wake of the new crime wave, people might be wondering where the educational system has gone wrong. But relax, America. Think of the Police Academy - Dümmer als die Polizei erlaubt (1984). Now that's the kind of school people can trust, the kind of school whose grads fight crime with slapstick instead of nightsticks. Those goofy oddballs in blue are going to tangle with the pinhead punkers. The Police Academy regulars, from meathead Mahoney to the impeccably inept Cmdt. Lassard, are back again to answer law enforcement's most uproarious role call.",
         "When a new gang moves into town it's up to the screwball police team to stop them."
      ],
      "budget": 0
   },
   "movielensId": 2379,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-03-28",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Jerry Paris"],
      "runtime": 87,
      "movieId": 2379,
      "title": "Police Academy 2: Their First Assignment",
      "mpaa": "PG-13",
      "actors": [
         "Steve Guttenberg",
         "Bubba Smith",
         "David Graf",
         "Michael Winslow",
         "Bobcat Goldthwait",
         "Colleen Camp",
         "Bruce Mahler",
         "Marion Ramsey",
         "Art Metrano",
         "George Gaynes",
         "Julie Brown",
         "Tim Kazurinsky",
         "Christopher Jackson"
      ],
      "imdbMovieId": "0089822",
      "originalTitle": "Police Academy 2: Their First Assignment",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["0b3WZ2K473s"],
      "plotSummary": "Officer Carey Mahoney and his cohorts have finally graduated from the Police Academy and are about to hit the streets on their first assignment. Question is, are they ready to do battle with a band of graffiti-tagging terrorists? Time will tell, but don't sell short this cheerful band of doltish boys in blue.",
      "tmdbMovieId": 10157,
      "avgRating": 2.46462,
      "releaseYear": "1985",
      "numRatings": 4013,
      "posterPath": "/iNlm1BBGCwfP207QzuUk2Ei13sG.jpg"
   }
}