{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "governor",
            "id": 5744
         }
      ],
      "imdb_id": "tt0091777",
      "video": false,
      "title": "Police Academy 3: Back in Training",
      "recommendations": [
         10157,
         10587,
         11895,
         11825,
         11546,
         9336,
         306,
         9396,
         36593,
         37137,
         9594,
         9671,
         10535,
         9595,
         9255,
         96,
         9876,
         6280,
         9493,
         11595
      ],
      "backdrop_path": "/fxIm54v5iHtGmgVQKAu5zyN9L7T.jpg",
      "revenue": 43579163,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Sgt. Carey Mahoney",
               "gender": 2,
               "credit_id": "52fe44b89251416c7503eba9",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Sgt. Moses Hightower",
               "gender": 2,
               "credit_id": "52fe44b89251416c7503ebad",
               "name": "Bubba Smith",
               "profile_path": "/2T5nQh0xQZfpJOcQGN9PKqCJgK.jpg",
               "id": 57349,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Sgt. Eugene Tackleberry",
               "gender": 2,
               "credit_id": "52fe44b89251416c7503ebb1",
               "name": "David Graf",
               "profile_path": "/hf4duQ2dITqZWGRktvr2ezmsPRR.jpg",
               "id": 57353,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Sgt. Larvelle Jones",
               "gender": 2,
               "credit_id": "52fe44b89251416c7503ebb5",
               "name": "Michael Winslow",
               "profile_path": "/G3GZNtLSVhohjR0QEIt2EYjneZ.jpg",
               "id": 14672,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Cadet Zed",
               "gender": 2,
               "credit_id": "52fe44b99251416c7503ebc5",
               "name": "Bobcat Goldthwait",
               "profile_path": "/wYwGbSqEGAqpT4or8YHQ79ycoz4.jpg",
               "id": 95024,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Sgt. Hooks",
               "gender": 1,
               "credit_id": "53c0bc210e0a26157f008324",
               "name": "Marion Ramsey",
               "profile_path": "/xd5omaBzCiDeAc91MOfFD9ane6a.jpg",
               "id": 186816,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Lt. Callahan",
               "gender": 1,
               "credit_id": "53c0bc350e0a261579007f40",
               "name": "Leslie Easterbrook",
               "profile_path": "/22kMcKhiWhq0C5BAhoURdVIdXUn.jpg",
               "id": 22252,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Comdt. Mauser",
               "gender": 2,
               "credit_id": "53c0bc7d0e0a26157f008334",
               "name": "Art Metrano",
               "profile_path": "/3IPQYpit646GjHd1cjfgiqGFfIh.jpg",
               "id": 15212,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Cadet Sweetchuck",
               "gender": 0,
               "credit_id": "53c0bc910e0a2615820081d6",
               "name": "Tim Kazurinsky",
               "profile_path": "/4MeLlddWvGZGFpHvwwTtrgHepP2.jpg",
               "id": 95216,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Comdt. Lassard",
               "gender": 2,
               "credit_id": "53c0bcaf0e0a26157f00833e",
               "name": "George Gaynes",
               "profile_path": "/cntFGEwxz14xvl8KXW2WXahpvS5.jpg",
               "id": 57351,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Sgt. Copeland",
               "gender": 2,
               "credit_id": "53c0bcf40e0a261576008301",
               "name": "Scott Thomson",
               "profile_path": "/7d61uG3mF0oEGSOLJWl9DwvDXeQ.jpg",
               "id": 9997,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Sgt. Fackler",
               "gender": 2,
               "credit_id": "53c0bd060e0a261576008306",
               "name": "Bruce Mahler",
               "profile_path": null,
               "id": 57356,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Cadet Nogata",
               "gender": 2,
               "credit_id": "53c0bd310e0a261585007ef7",
               "name": "Brian Tochi",
               "profile_path": "/2nAC2ssCFu74zkhg1722WQhArGO.jpg",
               "id": 16060,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Lt. Proctor",
               "gender": 0,
               "credit_id": "53c0bee10e0a261585007f3e",
               "name": "Lance Kinsey",
               "profile_path": "/ilFV8TFr6ckK5OAjjsAneDAMRcp.jpg",
               "id": 141429,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Cadet Fackler",
               "gender": 0,
               "credit_id": "53c149b0c3a3684cf400667c",
               "name": "Debralee Scott",
               "profile_path": "/lGXgX3naJRqtlqf0ho4Te8nt5GX.jpg",
               "id": 57354,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Mr. Bellows",
               "gender": 2,
               "credit_id": "550204f8925141275c002eb8",
               "name": "Jack Creley",
               "profile_path": null,
               "id": 12485,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c7503eb93",
               "name": "Jerry Paris",
               "profile_path": "/mVcAxdJG3uFVhr5erMCOZvla9UA.jpg",
               "id": 41720,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c7503eb99",
               "name": "Robert Folk",
               "profile_path": null,
               "id": 43393,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b89251416c7503eb9f",
               "name": "Robert Saad",
               "profile_path": null,
               "id": 65689,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b89251416c7503eba5",
               "name": "Bud Molin",
               "profile_path": null,
               "id": 30725,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c7503ebbb",
               "name": "Paul Maslansky",
               "profile_path": null,
               "id": 33096,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b89251416c7503ebc1",
               "name": "Gene Quintano",
               "profile_path": null,
               "id": 56953,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 7.614049,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12118,
      "vote_count": 325,
      "budget": 0,
      "overview": "When police funding is cut, the Governor announces he must close one of the academies. To make it fair, the two police academies must compete against each other to stay in operation. Mauser persuades two officers in Lassard's academy to better his odds, but things don't quite turn out as expected...",
      "similar": [
         114150,
         533,
         86130,
         585,
         9472,
         55721,
         254470,
         335797,
         1370,
         10404,
         62211,
         44214,
         45317,
         22,
         101299,
         665,
         1124,
         15121,
         8328,
         3600
      ],
      "original_title": "Police Academy 3: Back in Training",
      "runtime": 83,
      "poster_path": "/A0WHx049ty1RJ57XeQwweRxhHbW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Police Academy Productions",
            "id": 69583,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1986-03-20",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/4fjmNFs31JPfa4rYtE3gNDspGlk.jpg",
         "name": "Police Academy Collection",
         "id": 9338,
         "poster_path": "/q6npkfLX1jryO4a3GI63WJW9TrT.jpg"
      },
      "tagline": "Run for cover!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jerry Paris"],
      "runtime": 83,
      "synopsis": "The movie begins in a large garage structure, where Captain Proctor (Lance Kinsey) and Commandant Mauser (Art Metrano) (from Police Academy 2) meet up with former Police Academy cadets, (now Sgts.) Chad Copeland (Scott Thomson) and Kyle Blankes (Brant van Hoffman) (from the first Police Academy movie). It seems one of the two Police Academy schools is getting the axe, and Mauser wants Copeland and Blankes to make sure that Lassard's one screws up. The next day, after the governor's speech in which he will appoint a committee to evaluate which of the two schools should remain open, Mauser starts getting an edge by kissing up to the governor (offering the committee an escort, showing governor pages of useful tactics, etc.). Nearby, the elderly and slow-witted Commandant Lassard (George Gaynes) gets an idea on how to win: along with now Sgt. Jones (Michael Winslow) and Lt. Callahan (Leslie Easterbrook), he calls back his former class of '84 alumni misfits; Sgt. Mahoney (Steve Guttenberg), Sgt. Hightower (Bubba Smith), and Sgt. Tackleberry (David Graf) to the acdemy to help train the new recruits. Among the new recruits are Sgt. Fackler's wife (Debralee Scott), the nerdish store owner Sweetchuck (Tim Kazurinsky) (from Police Academy 2), former street gang leader Zed (Bobcat Goldthwait) (also from Police Academy 2), Karen Adams (Shawn Weatherly), and Tackleberry's brother-in-law Bud Kirkland (Andrew Paris). Tomoko Nogata (Brian Tochi) is a slow-witted Japanese recruit of Mauser's academy, but decides to put him in with Lassard's academy instead. After a few weeks of recruiting, Nogata is lovestruck over Callahan, and Sweetchuck contemplates quitting after his roommate Zed drives him crazy (although Tackleberry talks him out of it). Copeland and Blankes make the recruits do stuff that would make the committee think they were hopeless. Mauser wants them out on the field soon, knowing the committee will be there. The recruits fail, and are teased by Mauser and Proctor. However, Mahoney gets back at them by taping Mauser's eyes closed while doing a taste test. Proctor succeeds in removing the tape, but the tape pulls off Mauser's eyebrows. Both Lassard and Mahoney give a pep talk to each of the cadets before training resumes. At the policeperson's ball, Mahoney meets up with his hooker friend from the first film and has her do a favor on Proctor after he insults Mahoney and Adams. Copeland accidentally spills punch on Mrs. Hurst, and Mauser tries to inferfere. Meanwhile, the hooker tricks Proctor into removing all his clothes and then locking him out of the hotel room (much to the dismay of onlookers). He goes out and steals a car and drives to the academy. The car is out of gas, however, and Proctor enters a building. However, the building he walks into is the gay dance club for men called the Blue Oyster Bar (briefly seen in the first two films). The next day, Mauser insults Lassard in front of the recruits by telling him that he is winning (after he pestered Hurst so much that Hurst made him believe he was winning), so Mahoney gets him back by giving a speech at the ball and then putting the microphone in a pitcher of water. When Mauser grabs it, it electrocutes him. On the final day of the cadet training/evaluation competition, one person from each school attends the governor's ball. (Proctor misunderstands and sends in two, one of whom portrayed by David James Elliott) Copeland and Blankes play with the computer system as cars are sent to wrong locations, but are caught by Hooks who punches them out cold. At the governor's party, a gang of thieves dressed as busboys kidnap Hedges and take the governor hostage. but the squad arrives in time to save the day and rescue the governor. Lassard's school stays open, and the epilogue shows Commandant Lassard making a speech on how the academy is grateful for the \"many, many\" recruits. The graduating class salutes to the camera before the movie ends.",
      "writers": [
         "Neal Israel",
         "Pat Proft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091777/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3ODI1NzI1OF5BMl5BanBnXkFtZTYwODE5MzA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steve Guttenberg, Bubba Smith, David Graf | See full cast and crew »"],
      "reviews": [
         "Here we go\u0085I don't care what anyone says, this is funny. Yes the series gets worse with each film, but any of the first 4 are better than any American Pie, or any teen comedy ever. The characters have already been established, with the main additions being Bobcat Goldthwaite as Zed, who is endlessly funny, and Mauser as the rival Cmndt. Plot? There are two Police Academies; one must close so a series of competitions are set up to see which is better. Mauser recruits Copeland and Banks from Lassard's school as traitors, but Mahoney and crew eventually prove the better. But these movies are not about plot. Some would say they're not about comedy, or anything else, but as a kid, nothing made me laugh more than these films. And they still do. Jones makes loads of noises, Tackleberry watches his in laws punch each other, Mahoney makes his usual comments, but Zed and Procter are my favourites here. The Blue Oyster Bar is back, and other scenes that keep me laughing are the arrival of Sweetchuck to the Academy, crashing into the car, and Zed singing to make a door fall. I see why people find these completely irritating, but I'm pis*ing myself thinking about them. While I was reading some of the (mostly negative) reviews of this, where people were slagging off the parts they didn't find funny, I was in stitches. May say something about me-but that's something I'm not ashamed of. 8 out of 10",
         "Police Academy 3 (1986) The inmates are now running the asylum. Mahony and company are now instructors at the place they once attend. Running out of ideas and funny situations, the film starts to repeat (ad naseum) many of the gags and punchlines from the first two films. While new characters are being added to the series, a few old one decide to leave (for good). If you notice, the bigger the star Steve Guttenberg becomes, the lesser screen time he gets. Oh well. Slightly recommended. If the producers have thought with their heads instead of their pocket books, they should have put this series to bed instead of dragging it out and running the series until the wheels and the engine fell off.",
         "(POSSIBLE SPOILERS) Police Academy 3:Back In Training is a brilliant film which returns our heroes back to the academy. Since the second film, Mauser has been promoted to Commandant in charge of his own academy...but his job may be in jeopardy. The state decides that it cannot finance two academy's so a competition is declared between Eric Lassard's academy and Commandant Mauser's academy. All the favourites such as Mahoney, Jones, Hooks, Hightower and Tackleberry are back to help train the new recruits which include Zed (the punk from the second film)and Sweetchuck (the little wimp from the second film). We also see the return of the sneaky Kyle Blanks and Chad Copeland. Copeland and Blanks are in cahoots with Commandant Mauser who wishes to discredit Lassard's academy. As usual, there are some great scenes. My favourite scenes were the sneaky Sergeant Proctor ending up nude on the streets, Mauser losing his eyebrows and the ending where the new recruits chase the bad guys on speedboats. All in all, Police Academy 3 is a damn good film.",
         "While still suffering from the humor limitations of being rated PG, \"Police Academy 3\" has sight gags enough to make it worth watching a few times (at least more often than \"Part II\"). The gang's all here and trying to train a new line of cadets in their own image (poor cadets) while Lassard (Gaynes) tends to his goldfish and tools about in his modified golf cart. Even Bobcat Goldthwait returns as Zed, this time training to be a force of good. His scenes breathe a lot of life into this affair, as he screams at doors until they fall down, terrorizes his fellow cadets, hot wires police cars with his teeth and sings at the most inopportune times. Everyone else has at least one good scene, maybe two. And considering how many are in the cast, that leaves room for a lot of good scenes. Even Georgina Spelvin is back from the original and, bless her, she makes good, too (though not as hilarious as in the original). This is about as good as the sequels get, so look no further for laughs than \"Police Academy 3: Back in Training\". Definitely Bubba Smith's finest hour. Seven stars. Good job, officers.",
         "Yes, combine the first two movies take away most of the cussing and raunchy jokes and you have the start of the very stale Police Academy sequels. I enjoyed the first two films, and I will say this one had some laughs, but way to much wrong with it to be considered even an okay film. The only redeeming factor is that once again G.W. Bailey is absent and the more funnier Mauser is in this one with his assistant Proctor. They made for most of the humor and Mauser's absence in the next film stands out to me. The story has two police academies in an area and one of them is to be shut down. Mauser is in charge of one, and granted how did he get an academy since the last movie is a rather good question. One wonders is this supposed to be a sequel and for the most part other than this strange turn it seems to be. Most of the jokes have been done, Bobcat is back and you wonder why. He was good in the last movie, in this one his presence is overkill. I thought how Mahoney in the first film got into the academy there is no way Bobcat could have. So all in all the start of very weak sequels and you will begin to know the jokes by heart.",
         "Police Academy 3 (1986) ** 1/2 (out of 4) The gang is back and this time they must train some new recruits and if they fail the academy might be shut down for good. Once again, for a fan I think this film still has enough laughs be be mildly entertaining but there's no doubt this is where the series started to slip away. While there aren't as many laughs here as the previous two films the thing manages to stay alive due to the nice characters created by the cast. Guttenberg, Smith, Graf, Winslow and Leslie Easterbrook are back with Bob Goldthwait and Tim Kazurinsky returning from the second film. The movie tries to have a plot with the academy threatened to be shut down but of course this just sets up all the attempted laughs. The best moments of the movie happen as we get a semi-remake of the original film as we see the new recruits going through their training. This film only runs 83-minutes, which certainly wasn't the normal thing in 1986 so that should tell you that the screenplay doesn't go for too much.",
         "In this sequel, the same slapsticks that have been used in the first two movies are apparent and that's what makes it fun to watch. Michael Winslow, who plays Jones, has once again entertained me with his vocal prowess. Also Hooks' (Marion Ramsey) timidness is easily shrouded by her tough side always saying \"Don't move, dirtbag!\" Steve Guttenberg (Mahoney) didn't need to stretch his role for this one. It is still fun to watch after 13 years of it's initial release. One of a perfect movies to watch on a lazy Sunday afternoon.",
         "It's back to where it all started for the gang as they assist trainees who are as inept as they were. Squealing Goldthwait is now a wannabe cop and in a perfect idea by the screenwriter is roommated with meek little Mr. Sweetchuck, whom he terrorized throughout part 2. The most notable newcomer is Brian Tochi as the Japanese youngster obsessed with Easterbrook's breasts (who wouldnt be?). The climax is a little more exciting than in the recent films (a jet-ski chase) and is filmed very nicely. And it's odd how with each film the running time gets shorter, only 83 minutes here. But still enjoyable the third time around.",
         "Police Academy films are a weakness of mine, they are stupid, vapid, idiotic and funny as all hell. I do so love these characters and they are in top form as the goofball graduates from the first Academy come back to save their alma mater. It seems that budget constraints have forced Governor Ed Nelson to close one of the two Police Academies. The first one is run by clueless Commandant Lassard as played by George Gaynes. The second is a discipline factory run by the nemesis of the graduates from the second Police Academy movie, Sergeant Mauser, played with relish by Art Metrano now a commandant of that Academy. So a contest is to be held to see which one stays open and our regulars, Steve Guttenberg, Bubba Smith, Michael Winslow, Marion Ramsey, David Graf, and Leslie Esterbrook go back to help the captain they made life hell for as cadets. When you think about it, are the Police Academy movies any different than the classic Keystone Kops? A lot of the same gags are used and a lot more of them that could never have been got away with back in those days. But the idea is the same, an irreverence for law enforcement in the funniest way. These are not films to write elegant tomes about, they are films to laugh whatever part of your anatomy off you want.",
         "A few years ago I watched Police Academy, which became one of my favorite comedies, but I never could find any of the sequels. Even though I have been warned that these sequels are not any good, I'm still curious, I just finished Police Academy 3: Back in Training last night and even though it's not as funny as the first Police Academy film, it still has a few decent laughs. I think the ratings here on IMDb are so low because a lot of people are not giving these movies a good chance. If you wanna see these sequels, just have an open mind to it, because some of these sequels are still pretty funny. I liked having the gang back together, even good old obnoxious Zed, and they've added a few new characters to the story that are so much fun to watch. Due to money shortage, the governor has to cut one of the two police academies in the city. The way to choose which academy is going to last is a competition, to see which pulls out the best trained policemen. So the class of 1984 is back to help their academy out and help train new recruits, including our villain from the second Police Academy, Zed, has decided to clean up his act while picking on a poor little nerd, Sweetchuck, but end up being quite the funny pair together. But the other academy is going to do whatever they can to sabotage and win the competition away from Lasard's Police Academy. No, this isn't by any means a pure comedy that has you constantly laughing, but it still delivers a few good moments. I know he is getting little obnoxious, but Michael Winslow with the voices, I loved when he was training a student and making noises like she was a bad driver, then he stopped and said \"ok, if I hear any of those noises, you fail\". Back in Training is worth the look if you're interested in seeing the sequels, I would recommend it, Back in Training has it's laughs, just have an open mind and have fun. 5/10"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": [
         "Police Academy Productions",
         "Warner Bros."
      ],
      "summaries": [
         "When police funding is cut, the Governor announces he must close one of the academies. To make it fair, the two police academies must compete against each other to stay in operation. Mauser persuades two officers in Lassard's academy to better his odds, but things don't quite turn out as expected...",
         "When police funding is cut, Governor Neilson announces that one of the city's two police academies will have to be closed down. To make it fair, Neilson announces a competition to determine which academy will stay opened. Commandant Eric Lassard calls back some of his former students to train the new batch of students, hoping to get the edge on the rival academy, which is run by Commandant Mauser. Lassard's new instructors, the former students he has brought back, include Carey Mahoney, Eugene Tackleberry, Moses Hightower, Debbie Callahan, Larvell Jones, Laverne Hooks, and Douglas Fackler. Among the new students at Lassard's academy are Cadet Nogata, Cadet Karen Adams, Cadet Bud Kirkland, Cadet Sarah, Cadet Hedges, former gang leader Zed, and Zed's roommate, Cadet Sweetchuck. In order to increase his own academy's chances of winning, Mauser persuades two of Lassard's officers, Kyle Blanks and Chad Copeland, to turn traitor and help Mauser. The competition becomes complicated when a local marina is robbed by a gang of thieves who are dressed as busboys.",
         "The city has two police academies, one is under the eye of Commandant Lassard and the other is under Commandant Mauser. Now Mauser has learned that the State is considering closing one of the academies, and to protect himself, he approaches Blanks and Copeland and instructs them to make sure that Lassard's cadets all foul up. Lassard on the other hand calls his \"favorite graduates\", Mahoney, Hightower, Jones, Tackleberry, and Hooks, and along with their former instructor, Callahan, they try to train the cadets and hopefully save their academy.",
         "From the beginning, they were a breed apart. They were raw, inept, blunderheaded civilians who signed up for the Police Academy. And they became raw, inept, blunderheaded cops. Then, the bumblers in blue took to the streets to confront a crime wave . . . and somehow refrained from waving back. Now the lovable lunkheads with the fun-track minds are at it again! Determined to save their alma mater from getting the ax during a state-wide budget slash are the gifted, goofy original Police Academy grads: Mahoney, Hightower, Tackleberry, Jones, Hooks and Callahan, all led by the befuddled but unbowed Cmdt. Lassard. Also in the arresting cast are several returnees from the school's second adventure, including meddling Cmdt. Mauser.",
         "The alumni of Commandant Lassard's Police Academy - Dümmer als die Polizei erlaubt (1984) return to the school to train new recruits and prevent its closure."
      ],
      "budget": 0
   },
   "movielensId": 2380,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-03-20",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Jerry Paris"],
      "runtime": 83,
      "movieId": 2380,
      "title": "Police Academy 3: Back in Training",
      "mpaa": "PG",
      "actors": [
         "Steve Guttenberg",
         "Bubba Smith",
         "David Graf",
         "Michael Winslow",
         "Bobcat Goldthwait",
         "Marion Ramsey",
         "Leslie Easterbrook",
         "Art Metrano",
         "Tim Kazurinsky",
         "George Gaynes",
         "Scott Thomson",
         "Bruce Mahler",
         "Brian Tochi",
         "Lance Kinsey",
         "Debralee Scott",
         "Jack Creley"
      ],
      "imdbMovieId": "0091777",
      "originalTitle": "Police Academy 3: Back in Training",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["QBai0KLPCXY"],
      "plotSummary": "When police funding is cut, the Governor announces he must close one of the academies. To make it fair, the two police academies must compete against each other to stay in operation. Mauser persuades two officers in Lassard's academy to better his odds, but things don't quite turn out as expected...",
      "tmdbMovieId": 12118,
      "avgRating": 2.26573,
      "releaseYear": "1986",
      "numRatings": 3306,
      "posterPath": "/A0WHx049ty1RJ57XeQwweRxhHbW.jpg"
   }
}