{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "handcuffs",
            "id": 772
         },
         {
            "name": "police operation",
            "id": 4668
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "police everyday life",
            "id": 7477
         },
         {
            "name": "miami beach",
            "id": 208335
         }
      ],
      "imdb_id": "tt0095882",
      "video": false,
      "title": "Police Academy 5: Assignment Miami Beach",
      "recommendations": [
         11895,
         10587,
         11546,
         12118,
         10157,
         9336,
         306,
         11630,
         10535,
         9594,
         9396,
         9290,
         10345,
         9876,
         9671,
         12154,
         6280,
         9531,
         96,
         37137
      ],
      "backdrop_path": "/33DZxIZmFIATL3L5iPXu0s9aiBN.jpg",
      "revenue": 19510371,
      "reviews": [{
         "author": "Potential Kermode",
         "id": "589e6b6d9251411721003910",
         "content": "**Those Academy imbeciles are back!**\r\n\r\n...and this time there are plenty of _golf balls to slip on._ Never before have I laughed so long and so hard at a man slipping on a golf ball. Captain Harris lost his trouser because the silly man who makes the sounds made an _amusing beeping noise._\r\n\r\nThis deeply complex and inventive script hits all the right targets and the viewer will often find themselves gasping for air and choking on their own tonsil due to incessant laughing.\r\n\r\nA fat man eats a donut and the jam squirts out. I cracked my kidney laughing. I've never been so amused ever - the donut had jam in it and the pressure of the bite caused the jam to break free of its _outer casing._",
         "url": "https://www.themoviedb.org/review/589e6b6d9251411721003910"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Sgt. Moses Hightower",
               "gender": 2,
               "credit_id": "52fe448d9251416c75038bf3",
               "name": "Bubba Smith",
               "profile_path": "/2T5nQh0xQZfpJOcQGN9PKqCJgK.jpg",
               "id": 57349,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Sgt. Eugene Tackleberry",
               "gender": 2,
               "credit_id": "52fe448d9251416c75038bf7",
               "name": "David Graf",
               "profile_path": "/hf4duQ2dITqZWGRktvr2ezmsPRR.jpg",
               "id": 57353,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Sgt. Larvelle Jones",
               "gender": 2,
               "credit_id": "52fe448d9251416c75038bfb",
               "name": "Michael Winslow",
               "profile_path": "/G3GZNtLSVhohjR0QEIt2EYjneZ.jpg",
               "id": 14672,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Lt. Debbie Callahan",
               "gender": 1,
               "credit_id": "52fe448d9251416c75038bff",
               "name": "Leslie Easterbrook",
               "profile_path": "/22kMcKhiWhq0C5BAhoURdVIdXUn.jpg",
               "id": 22252,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Captain Thaddeus Harris",
               "gender": 2,
               "credit_id": "52fe448d9251416c75038c09",
               "name": "G. W. Bailey",
               "profile_path": "/oHwJ8QTvYPLGqc6Kwgp5Lb6nOo.jpg",
               "id": 27237,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Officer Thomas 'House' Conklin",
               "gender": 0,
               "credit_id": "52fe448d9251416c75038c0d",
               "name": "Tab Thacker",
               "profile_path": null,
               "id": 1276381,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Hooks",
               "gender": 1,
               "credit_id": "53c0c01c0e0a26157f0083ba",
               "name": "Marion Ramsey",
               "profile_path": "/xd5omaBzCiDeAc91MOfFD9ane6a.jpg",
               "id": 186816,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Kate",
               "gender": 1,
               "credit_id": "53c0c0330e0a261579007fce",
               "name": "Janet Jones",
               "profile_path": "/vtSxLHwrv0GHWFoVuVePrluMOXM.jpg",
               "id": 19257,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Proctor",
               "gender": 0,
               "credit_id": "53c0c0410e0a26157c007ff0",
               "name": "Lance Kinsey",
               "profile_path": "/ilFV8TFr6ckK5OAjjsAneDAMRcp.jpg",
               "id": 141429,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Nick",
               "gender": 2,
               "credit_id": "53c0c0520e0a26157600837f",
               "name": "Matt McCoy",
               "profile_path": "/hBbrWq1WolrEG9kSxEASywFz5OK.jpg",
               "id": 42206,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Lassard",
               "gender": 2,
               "credit_id": "53c0c0650e0a261576008382",
               "name": "George Gaynes",
               "profile_path": "/cntFGEwxz14xvl8KXW2WXahpvS5.jpg",
               "id": 57351,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Mayor of Miami",
               "gender": 2,
               "credit_id": "53c0c0a20e0a26157c007fff",
               "name": "James Hampton",
               "profile_path": "/bVes3w8EelatQe7yuJ2OiNL8QOG.jpg",
               "id": 14848,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Julio",
               "gender": 2,
               "credit_id": "54f3b0b092514179a700082c",
               "name": "Ruben Rabasa",
               "profile_path": "/uKtvqVjW4gz3LGOcBldbmFE0Rtc.jpg",
               "id": 1434041,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448d9251416c75038bd7",
               "name": "Alan Myerson",
               "profile_path": null,
               "id": 14995,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe448d9251416c75038bdd",
               "name": "Stephen Curwick",
               "profile_path": null,
               "id": 70613,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe448d9251416c75038be3",
               "name": "Robert Folk",
               "profile_path": null,
               "id": 43393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448d9251416c75038be9",
               "name": "James Pergola",
               "profile_path": null,
               "id": 56130,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe448d9251416c75038bef",
               "name": "Hubert C. de la Bouillerie",
               "profile_path": null,
               "id": 58730,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe448d9251416c75038c05",
               "name": "Paul Maslansky",
               "profile_path": null,
               "id": 33096,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 11.204442,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11825,
      "vote_count": 250,
      "budget": 0,
      "overview": "The Police Academy misfits travel to Miami, Florida for their academy's commanding officer, Lassard, to receive a prestigious lifetime award pending his retirement, which takes a turn involving a group of jewel thieves after their stolen loot that Lassard unknowingly has in his possession.",
      "similar": [
         10157,
         75780,
         11423,
         10587,
         4771,
         96,
         49524,
         807,
         193893,
         984,
         2142,
         25376,
         9411,
         6973,
         10651,
         2275,
         1586,
         357096,
         4638,
         949
      ],
      "original_title": "Police Academy 5: Assignment Miami Beach",
      "runtime": 90,
      "poster_path": "/iwYu3FsGSNAaDgRC9i9Z7l1iVFm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1988-03-17",
      "vote_average": 4.8,
      "belongs_to_collection": {
         "backdrop_path": "/4fjmNFs31JPfa4rYtE3gNDspGlk.jpg",
         "name": "Police Academy Collection",
         "id": 9338,
         "poster_path": "/q6npkfLX1jryO4a3GI63WJW9TrT.jpg"
      },
      "tagline": "Hold everything! The cadets are dropping in on Miami Beach for an all new adventure.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Myerson"],
      "runtime": 90,
      "synopsis": "The cynical Captain Harris and his dim-witted lacky Lt. Proctor finally finds the goods he needs to push Commandant Eric Lassard out at the Police Academy: he is one year late for mandatory retirement. But before he retires, Lassard is chosen as \"Police Officer of the Decade\", and brings his favorite graduatesSgts. Hightower, Jones, Tackleberry and Hooks, Lt. Callahan, and new graduate Officer Thomas \"House\" Conklinto the National Police Chiefs Convention in Miami Beach to celebrate with him. Harris and Proctor decide to travel down to Miami Beach to discredit Lassard once again so Harris can attempt again to take over the police academy for himself. But Harris and Proctor are tricked into chartering an old rickety cargo flight down to Florida while the police academy group travels first class aboard a 747 plane. While there, the misfit police officers meet Lassard's nephew, Sgt. Nick Lassard of the Miami Police Department. The fun is complicated when he unwittingly takes a bag belonging to jewel thieves containing stolen merchandise. As the jewel thieves try to get the bag back, and Captain Harris tries to prove to Commissioner Hurst that he's the right man to replace Commandant Lassard, the usual hijinks ensue, including Lassard trying to guess the annual procedural demonstration. At the awards cerrimony, when the jewel thieves kidnap Commandant Lassard, he goes willingly, thinking it is indeed the procedural demonstration. It launches a negotiation, which Captain Harris botches, getting himself captured as well. A chase across the Everglades ensues to rescue the oblivious and absent-minded Commandant. During the chase, Harris falls overboard and is nearly eaten by a large aligator, until Hightower dives into the water to rescue him and subdue the aligator. When the chase leads to the end, Lassard is held at gunpoint by the jewel thief's leader, still thinking that its a demonstration. When Nick tells his uncle that this isn't a demonstration, the elderly Commandant knocks out the jewel thief by himself and captured him. The next day, when Commandant Lassard is giving his \"Police Officer of the Decade\" award and announces his retirement from the force, a loophole by Nick shows that his manditory retirement is in fact opinal and that he can retire anytime he wants to. Lassard then changes his mind about retiring much to great joy and aplause.",
      "writers": [
         "Neal Israel",
         "Pat Proft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095882/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwMjM5NzgyNV5BMl5BanBnXkFtZTYwMzE3MTM5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bubba Smith, David Graf, Michael Winslow | See full cast and crew »"],
      "reviews": [
         "The first \"Police Academy\" movie was good. The second one was interesting. The third and fourth were forgettable. But this one is abysmal. Note to the producers: this is suppose to be funny. There's a few scenes that merit a smile, but the movie is generally boring. Great to see Harris and Lessard, but I miss Mahoney and Sweetchuck. Thank God it's got a short running time. And thank God I got it for free at my local library. This is it for me folks, I'll stop at the 5th installment of the series and leave the rest to those who want to waste their time. Seen at home, in Toronto, on January 21st, 2007. 54/100 (BOMB)",
         "I really don't get it with these movies; thought the makers that after so many bad movies that THIS, this fifth would really break threw with it's extremely original story and laughs - well, no. The movies don't get a bit better, they just keep getting worse. The laughs are so childish, so boring and stupid that it's very difficult seeing the fun in this at times. The characters that were in the first one original and entertaining, hasn't grown one day older and it gets stuck. It doesn't leap forward, nothing really interesting or entertaining happens, so it's just so fabulously bad! The whole Police Academy thing isn't that an awful idea, but it's the way that they simply kept stretching the limits of the whole plot. The thing gets really silly, really childish and awfully bad, and what's with the thing that always the makers wants to have this new, bad thing popping up at the end?",
         "It's a tiresome continuation of the same depressingly futile, execrable material that plagued the series from #3. A hopeless pantomime consisting of extended camp chases, the Captain being coated in various effluvia, oafs falling over and so forth. The PG certificate squeezes out the raunchy spirit which enlivened the original. The Alzheimer-ish buffoon Commandant Lassard is propelled to the fore with no effect upon the quality, which would be laudable if there was any. Guttenberg's libidinous, puerile cretin character, Mahoney, is missing yet unmissed. The rest of the shamelessly worthless crew are back exhibiting timing which would embarrass a wristwatch from the Poundshop.",
         "This film had me in stitches!!! Literally. In my outrage at how awful the film was, I left the cinema early, grumbling and grasping around in the darkened auditorium. I passed a famous golfer who was sitting in my aisle, however I slipped on one of his loose golf balls and tumbled to the floor. The whole cinema audience started laughing! They were pleased that they had gained at least one laugh from their miserable experience. Such a shame that a man breaking his back in real life is funnier than Police Academy 5. I was visited by the golfer some months later, he arrived at my hospital ward. He had brought me some grapes and a copy of Police Academy 7...",
         "If you're a fan of the Police Academy movies, or even if you've just been forced to endure them for reasons you'd rather not go into, then the fifth film in the series isn't the worst film you'll ever see. It's not the worst film in the series. It is certainly below average though. Most of the gang return, though this is the first instalment without Steve Guttenberg or his character (Mahoney) in the mix, and this time the flimsy plot concerns Commandant Lassard (George Gaynes) heading to sunny Miami for a tribute to his good work. He takes along the regular cast members and also manages to pick up the wrong luggage at some point, luggage that belongs to some incompetent robbers who would really like to get their stolen goods back. I'd be lying if I said that I didn't chuckle on a few occasions while watching this movie but the laughs came despite the obvious, weak gags. Familiarity doesn't always breed contempt though I'm sure others completely disagree with me on that point. Although they're looking a bit tired by now, Michael Winslow, Marion Ramsey, David Graf, Bubba Smith, Leslie Easterbrook, G. W. Bailey, Lance Kinsey and even George R. Robertson (who played Chief/Commissioner Hurst in six of the movies) still manage to coast along with their portrayal of characters that audiences have grown to enjoy spending time with. Matt McCoy as Nick Lassard (the commandant's nephew) is a major weak link, just too bland to prove an able replacement for the character of Mahoney, but Rene Auberjonois almost makes up for this in the last half hour or so when his villain gets to engage in some great banter while trying to evade capture. Writer Stephen Curwick and director Alan Myerson both fail to bring anything worthwhile to the series. The former provides a limp script that works best when rehashing the gags we've all seen before while the latter just doesn't put any real effort into the execution of the material. But, then again, who could come in at this point and make the whole thing feel fresh and new again? Probably nobody, which tells you all you need to know about how much mileage there was to be had in the first place.",
         "Amusing golf ball slippage indeed. I split my pant laughing. Funny noise man- I shat myself. Tall man - I burst my kidney. Quiet woman who shouts at the end - I leaked urine with laughter. Gun man who likes guns - I burst my colon and shat myself: so amusing. This was was notable for the silly men slipping on golf balls and for Captain Harris' trouser falling down in the airport. I am laughing still. Laughing, soiling, leaking urine and reminiscing about this pant splitter of a movie. I love it. I shall recommend it to all of you as one big mother of a pant splitter. You will laugh, cry, soil, split and above all leak at this movie.",
         "Goodness me, this is probably the funniest film I have seen since Police Academy 4, which I watched immediately before this. I cannot describe how pant sh*ttingly amusing this film is. Several times during watching it, I swear I sh*t my pants laughing. I accidentally ripped my trouser in my fit of joviality. I sh*t bricks, leaked urine and gained a pain in my jaw from my incessant grinning and trouser splitting jollification. Kubrick couldn't have done a better job with this. Directed by Kubrick, this would have been a grey, stagnant and cold piece with little thought for characters slipping on golf balls and such. What a beautiful, valid piece of cinema. This had to be seen in the cinema as mass laughter is better than solitary laughter in your living room. The audience virtually burst my eardrums in the cinema. It was incredible. Lots of people, all ripping and soiling their trousers due to expanded stomachs and gasping for air, due to jollification and leaking urine in unison. I'll never forget this one.",
         "Commandant Lassard is forced to retire when he reaches the state's mandatory retirement age. He heads to Florida to receive a special award for his service and the Academy gang follows along. While there, they meet Lassard's nephew Nick (Matt McCoy), who is a poor replacement for Mahoney. And so here we are: the first Police Academy movie without Steve Guttenberg and the first sequel without Bobcat Goldthwait. It's also the first that is completely unfunny and just outright terrible. Although Guttenberg and Bobcat are absent, there are many returning cast members from the series. Bubba Smith, Michael Winslow, David Graf, Leslie Easterbrook, G.W. Bailey, Marion Ramsey, and George Gaynes all return. Sadly, these actors who were all so likable in the series up until now are kind of annoying here. Terrible direction for a series that just gets worse from here on out.",
         "Crossed up by Harris, our heroes - led by a wimpy Bobby Sherman look-a-like - must clean up his mess and rescue Lassard. As every second counts, what do they do? Coordinate with Miami PD and the FBI? Heck, no! They change into Police Academy shorts and t-shirts! This and the very idea of Lassard as Officer of the Decade is fair warning you better check your brain at the door before watching \"PA 5\" or your head will explode! Of course, if our heroes had any brains, they (and Harris) would be ecstatic that someone was actually stupid enough to take Lassard off of their hands! Too bad the movie is so lame, because it's actually ahead of its time: Harris never goes anywhere without Proctor; Harris mocks Proctor's pass at a woman; Harris and Proctor get foam on their noses while sipping \"potato\" coladas; Proctor wears a wet suit showing his ass-ests; the wimpy Bobby Sherman look-a-like becomes Wayne Gretzky's ball-busting fiancée's bitch; the Bobby Sherman look-a-like writes on Harris with semen-like sunblock. There ought to be a law! Hee! Hee!",
         "As with the previous three sequels, this one is no different, the first is still the best, and there are pretty much no moments that make you laugh. Basically head of the police academy Cmndt. Eric Lassard (George Gaynes) has reached retirement age, to the delight of Capt. Thaddeus Harris (G.W. Bailey), planning to take over his job, but not before Lassard receiver a prestigious lifetime award in Miami, Florida. Accompanying Lassard (and Harris) are ex-graduates Sgt. Moses Hightower (Bubba Smith), Sgt. Larvelle Jones (Michael Winslow), Sgt. Eugene Tackleberry (David Graf), Lt. Debbie Callahan (Leslie Easterbrook) and Sgt. Laverne Hooks (Marion Ramsey). Unfortunately in the arrivals of the airport, Lassard accidentally swapped his bag with some criminals for an identical bag containing a container of diamonds. After a while of trying to find the bag the bad guys eventually kidnap Lassard, and demand the academy help them get away. Also starring Janet Jones as Kate Stratton, Lance Kinsey as Lt. Proctor, Matt McCoy as Sgt. Nick Lassard, René Auberjonois as Tony Stark, George R. Robertson as Commissioner Hurst, Tab Thacker as Officer Thomas 'House' Conklin, Archie Hahn as Mouse, James Hampton as Mayor of Miami and Jerry Lazarus as Sugar. Steve Guttenberg said a firm \"no\" to being in this or any other sequels that may (and did) follow, good choice, this is probably the worst of the sequels, not even the self-made sound effects of Winslow can save it, nothing to laugh at, lovable characters not doing anything exciting, just a complete waste of time. Poor!"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "The old Commandant Lassard, leader of the Police Academy - Dümmer als die Polizei erlaubt (1984), goes to Florida to receive an award. In the city arrives also the cynic Captain Harris who wants to take Lassard's job. Harris wants to place himself in a favourable light in front of the high military hierarchy but, at the airport, Lassard exchanges his bag with another one...",
         "Commandant Eric Lassard, the head of the Police Academy - Dümmer als die Polizei erlaubt (1984), has reached mandatory retirement age, much to the delight of Captain Thaddeus Harris, who is planning to take over Lassard's job. Lassard and a handful of the Academy's former students travel to Miami for a special ceremony where Lassard is to be honored as the Police Officer of the Decade at a convention. Along for the trip to Miami are Moses Hightower, Eugene Tackleberry, Larvell Jones, Debbie Callahan, Laverne Hooks, Tommy \"House\" Conklin, and Commissioner Henry Hurst, along with Harris and his right-hand man Proctor. A jewel thief named Manny has smuggled stolen diamonds in a camcorder. Manny's suitcase is accidentally switched with Lassard's identical suitcase at the airport in Miami. This gets Lassard and Harris kidnapped by Manny and his two henchmen Julio and Pete, with everyone, including Lassard's nephew, Sergeant Nick Lassard, in pursuit.",
         "Sun, fun and babes in shades. Where else but Miami Beach? Buffoons, blockheads and party-hearty animals. Who else but the Police Academy - Dümmer als die Polizei erlaubt (1984) gang? In this fifth funfest, our heroes jet to Miami for a convention honoring beloved Cmdt. Lassard. But crime doesn't take a vacation, even if our police favorites do. Lassard is kidnapped. And not even the lure of limbo beach parties will stop the intrepid troopers' uproarious rescue attempts. How determined are they? As determined as a guy rasslin' an Okefenokee Swamp 'gator. Make that 10 guys and gals. Deploying the laugh weaponry are returning rookies Hightower, Jones, Tackleberry, Hooks, House, and Callahan, plus malicious meddlers Harris and Proctor. And on board as the ensemble's newest go-getters are Kate and Nick.",
         "The Police Academy - Dümmer als die Polizei erlaubt (1984) misfits travel to Miami, Florida for their academy's commanding officer, Lassard, to receive a prestigious lifetime award pending his retirement, which takes a turn involving a group of jewel thieves after their stolen loot that Lassard unknowingly has in his possession."
      ],
      "budget": 0
   },
   "movielensId": 2382,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-03-17",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Alan Myerson"],
      "runtime": 90,
      "movieId": 2382,
      "title": "Police Academy 5: Assignment Miami Beach",
      "mpaa": "PG",
      "actors": [
         "Bubba Smith",
         "David Graf",
         "Michael Winslow",
         "Leslie Easterbrook",
         "G. W. Bailey",
         "Tab Thacker",
         "Marion Ramsey",
         "Janet Jones",
         "Lance Kinsey",
         "Matt McCoy",
         "George Gaynes",
         "James Hampton",
         "Ruben Rabasa"
      ],
      "imdbMovieId": "0095882",
      "originalTitle": "Police Academy 5: Assignment Miami Beach",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["FKEspwO4vHA"],
      "plotSummary": "The Police Academy misfits travel to Miami, Florida for their academy's commanding officer, Lassard, to receive a prestigious lifetime award pending his retirement, which takes a turn involving a group of jewel thieves after their stolen loot that Lassard unknowingly has in his possession.",
      "tmdbMovieId": 11825,
      "avgRating": 2.01013,
      "releaseYear": "1988",
      "numRatings": 2714,
      "posterPath": "/iwYu3FsGSNAaDgRC9i9Z7l1iVFm.jpg"
   }
}