{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "mayor",
            "id": 1919
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "investigation",
            "id": 5340
         },
         {
            "name": "adversary",
            "id": 5440
         },
         {
            "name": "gang",
            "id": 10726
         },
         {
            "name": "jewel thief",
            "id": 156236
         }
      ],
      "imdb_id": "tt0098105",
      "video": false,
      "title": "Police Academy 6: City Under Siege",
      "recommendations": [
         11825,
         10587,
         11546,
         12118,
         10157,
         9336,
         11630,
         10535,
         306,
         9290,
         12154,
         9396,
         6280,
         12110,
         9876,
         9671,
         11595,
         36593,
         9594,
         5550
      ],
      "backdrop_path": "/7m6D3kQBrbMcqxwrSNEsvs1XuMS.jpg",
      "revenue": 11567217,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lt. Moses Hightower",
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad5f",
               "name": "Bubba Smith",
               "profile_path": "/2T5nQh0xQZfpJOcQGN9PKqCJgK.jpg",
               "id": 57349,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sgt. Eugene Tackleberry",
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad63",
               "name": "David Graf",
               "profile_path": "/hf4duQ2dITqZWGRktvr2ezmsPRR.jpg",
               "id": 57353,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sgt. Larvelle Jones",
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad67",
               "name": "Michael Winslow",
               "profile_path": "/G3GZNtLSVhohjR0QEIt2EYjneZ.jpg",
               "id": 14672,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Capt. Debbie Callahan",
               "gender": 1,
               "credit_id": "52fe449c9251416c7503ad6b",
               "name": "Leslie Easterbrook",
               "profile_path": "/22kMcKhiWhq0C5BAhoURdVIdXUn.jpg",
               "id": 22252,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Captain Thaddeus Harris",
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad99",
               "name": "G. W. Bailey",
               "profile_path": "/oHwJ8QTvYPLGqc6Kwgp5Lb6nOo.jpg",
               "id": 27237,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Sgt. Nick Lassard",
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad9d",
               "name": "Matt McCoy",
               "profile_path": "/hBbrWq1WolrEG9kSxEASywFz5OK.jpg",
               "id": 42206,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Hooks",
               "gender": 1,
               "credit_id": "53c0c0fd0e0a261576008398",
               "name": "Marion Ramsey",
               "profile_path": "/xd5omaBzCiDeAc91MOfFD9ane6a.jpg",
               "id": 186816,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Proctor",
               "gender": 0,
               "credit_id": "53c0c11e0e0a26158f007d66",
               "name": "Lance Kinsey",
               "profile_path": "/ilFV8TFr6ckK5OAjjsAneDAMRcp.jpg",
               "id": 141429,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Fackler",
               "gender": 2,
               "credit_id": "53c0c1320e0a2615890081a4",
               "name": "Bruce Mahler",
               "profile_path": null,
               "id": 57356,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Lassard",
               "gender": 2,
               "credit_id": "53c0c1440e0a26158f007d6c",
               "name": "George Gaynes",
               "profile_path": "/cntFGEwxz14xvl8KXW2WXahpvS5.jpg",
               "id": 57351,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Ace",
               "gender": 2,
               "credit_id": "53c0c1870e0a26157c008020",
               "name": "Gerrit Graham",
               "profile_path": "/uXcWDznKXAbquPEHLlKKm7EeyoF.jpg",
               "id": 26283,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad71",
               "name": "Pat Proft",
               "profile_path": null,
               "id": 12991,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad77",
               "name": "Peter Bonerz",
               "profile_path": "/p3bWr96CDFsKS8LlYT6bIK9a3ez.jpg",
               "id": 14987,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad7d",
               "name": "Pat Proft",
               "profile_path": null,
               "id": 12991,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe449c9251416c7503ad83",
               "name": "Hubert C. de la Bouillerie",
               "profile_path": null,
               "id": 58730,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad89",
               "name": "Robert Folk",
               "profile_path": null,
               "id": 43393,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe449c9251416c7503ad8f",
               "name": "Charles Rosher Jr.",
               "profile_path": null,
               "id": 41151,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe449c9251416c7503ad95",
               "name": "Paul Maslansky",
               "profile_path": null,
               "id": 33096,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 10.386332,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11895,
      "vote_count": 235,
      "budget": 0,
      "overview": "Our favourite police men are called together to deal with a gang who rob banks and jewelers. Using their various talents as well as their extraordinary luck, the crooks stand no chance against our men and women wearing blue..",
      "similar": [
         4771,
         984,
         10651,
         96,
         769,
         193893,
         75780,
         281,
         339692,
         395834,
         868,
         2142,
         25376,
         11647,
         1266,
         429733,
         11423,
         8012,
         261023,
         357096
      ],
      "original_title": "Police Academy 6: City Under Siege",
      "runtime": 84,
      "poster_path": "/9mW8fM0PkXvSSmLODTb2OAYEQTY.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1989-03-09",
      "vote_average": 4.8,
      "belongs_to_collection": {
         "backdrop_path": "/4fjmNFs31JPfa4rYtE3gNDspGlk.jpg",
         "name": "Police Academy Collection",
         "id": 9338,
         "poster_path": "/q6npkfLX1jryO4a3GI63WJW9TrT.jpg"
      },
      "tagline": "The Grads are going undercover in the city to unmask the mastermind of crime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Bonerz"],
      "runtime": 84,
      "synopsis": "The police must investigate a series of robberies along a strip of land in the city. The new mayor of the city (Kenneth Mars) assigns Captain Harris (G.W. Bailey) and Lt. Proctor (Lance Kinsey) to the case, but while on stakeout the Wilson gang manages to slip through their fingers. The Mayor wants Harris and Proctor to work with Police Academy head Commandant Lassard (George Gaynes) on apprehending the gang. Lassard assembles a seven-man team consisting of Hightower (Bubba Smith), Tackleberry (David Graf), Jones (Michael Winslow), Hooks (Marion Ramsey), Callahan (Leslie Easterbrook), Fackler (Bruce Mahler), and Lassard's nephew, Nick (Matt McCoy) who transfers from Miami (in the previous film Police Acdemy 5) to the city to remain close to his friends and dull-witted uncle. After distributing flyers as to the information of the Wilson gang and getting nowhere, Nick McCoy stumbles upon a paper heading of an antique diamond heading to a museum, and gets an idea to use it as bait: however the robbers nab the diamond anyway by cutting a hole in the truck and escaping through the sewer system. McCoy then decides to go undercover to get information regarding a possible hideout, but Harris decides to go undercover to get a confession. It turns out that Harris goes undercover as a window washer at a tall building, for which he has a fear of heights, and gets a confession of himself on tape after his loyal but numb-skull lacky, Proctor, accidentally knocks him over the balcony. It is revealed here that the robberies are committed by a group of three dim-witted criminals who do not seem to be able to do this on their own, and it is revealed they are being guided by a literally shadow figure known as the \"Mastermind\", who speaks to the three behind a wall of glass and uses a voice distortion device. He devises a plan to get the cops out of the way. Commandant Lassard and his men are later suspended after drugs are planted in Lassard's locker, pending an investigation. The misfit cops decide to clear Lassard's name by nabbing the gang and the ringleader. Accessing data files from a computer, McCoy deduces that the robberies are occurring along a bus route, thus intentionally lower property values in that part of the city. They also learn that someone must be 'leaking' information to the bad guys, which is why they are always one step ahead of the Police Academy. The Police Academy force finds and does battle with the Wilson gang, while Nick chases the leader. A pursuit follows, which leads to Commissioner Hearst's (George Robertson) office. It is revealed that the Mayor is the \"Mastermind\" and that Captain Harris has been unwittingly leaking information during his daily meetings with the Mayor. Hearst apologizes and reinstates the force, and a plague is given to honor the officers' bravery the next day. As the movie closes, Harris is sitting in a chair when a string tying the balloon float is cut, lifting his chair and floating him up into the air as he shouts Proctor's name.",
      "writers": [
         "Neal Israel",
         "Pat Proft"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098105/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMzA1ODg0Nl5BMl5BanBnXkFtZTYwODY0MTI5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Bubba Smith, David Graf, Michael Winslow | See full cast and crew »"],
      "reviews": [
         "but on the other hand it's not the funniest movie ever made and it's just a rehash of the last 5 movies, but it's STILL good and worth watching if you've nothing better to do & obiously if you've seen the first 5. There isn't much of a story but what there is of it consists of a gang of 3 goons who work for a MR BIG bringing down property prices by going on a City wide crime-wave with the Academy the only people who can stop them.. and that's about it Of course there's loads of slaptick mainly down to the inept Capt. Harris and partner LT.Proctor. Most of the other usual cast remains What with Bubba Smith (hightower) doing his strong man thing, Leslie Easterbrook (Callahan) doing her strong ass-kicking woman thing & The late David Graf (Tackleberry) doing his gung-ho ass-kicking stuff that we've seen in all the other 5 movies so It might get tiresome for hard to please critics, but for a bit of lightweight entertainment that won't tax your Brain too much it's nigh on Unbeatable My vote for what it's worth 7/10. Followed by Police Academy 7: Mission to Moscow the last movie which flopped at the Box-office (maybe it was an academy too many for film fans who though they'd suffered enough)",
         "In \"Police Academy 6: City Under Siege\", the gang's all here to save a crime-ridden city from the wrath of 3 white guys named the Wilson Heights Gang...I imagine this complicated premise was pitched to Warner Bros execs something to the effect of \"Um, they like to rob stuff...and they're bad guys. Oh, and the city's under siege because of them.\" I know this is slapstick and it was never intentioned to be taken seriously, but even when writing a film like this you have to TRY, at least TRY to write something good!! Anyway, the cast is all here, again, and they're not unlike the line of lower-income, shady low-lifes I see waiting outside the Department of Labor office every morning to pick up their unemployment checks. I don't think these guys even bother auditioning for other parts anymore, they're all blacklisted for life. There's Lt. Harris, once funny and a believable antagonist, now a cartoonish straight man to his bumbling apprentice Proctor, the two of them like some ill-fated and painfully unfunny Abbot & Costello bit that goes on too long. Way, way, waaaaay too long. There's Hightower, for the sixth time, he's big and black. Really big and black. Ha-ha-ha. Hooks and Tackleberry are here, oh Lord, don't forget about Hooks and Tackleberry...she's mousy and timid but sometimes she yells loudly, and T-man, he's a walking arsenal who loves guns! Most interesting though is Nick McCoy (I can't remember the character name) who's simply a modern replacement for Steve Guttenberg and his Carey Mahoney. Both are bright-eyed and boyish, both the unofficial leader of the gang. Put all these guys together and you have...well, you have...you have a cast, I guess. Police Academy 6 should have been the end. The sad, painful end to a once respectable series (meaning the first P.A. only) that had gone on seemingly forever, like that old uncle who lives in Jersey who's 103 and can't walk or talk, just lays in bed and mumbles in pain with everyone waiting for him to pass on and finally be at peace. Instead, a seventh police academy was made. It never made it to the theaters and I have yet to see it, but I remember seeing its preview in the movies some years back...as soon as the title and Robert Folk's Academy March started, a universal groan filled the theater. I think the marketing execs were in that theater and got the idea. But don't worry, Academy fans, I'm sure there'll be an eighth and a ninth, and a tenth...it will outlive us all, this series. And true genius is never recognized in its own time.",
         "'Bad jokes is where I draw the line!' As Hightower says in the 6th adventure of our favorite misfits. This time the story is about a gang (well, there's 3 of them anyway), who keep on robbing juwelry stores and banks along a busroute... but why, and how?! And who is their secret boss? Oh well, never mind the plot. It's just a filler between the sketches of the heroes and their peculiarities. The strong Hightower, gun crazed Tackleberry, big-breasted Callahan and the rest of them. We all know them from before, and once you've seen one episode, you kinda saw them all. Weak point of the movie is the absence of Mahoney (the star of the series) and Zed (the funniest). Best scene is when Jones takes on one of the gangmembers in Bruce Lee style. Oh well, I had some laughs, and City Under Siege won't be in my bottom 100. I'd give it 4/10.",
         "Finally, almost done with the Police Academy sequels, I finished the 6th movie in the series, Police Academy 6: City Under Siege, now this movie by no means is the worst movie ever, but it's the weaker of the movies and disappoints more than makes you laugh. With the earlier sequels, I've been surprised, with all the low ratings, I still was laughing at the movies, just because I think people were taking the movies too seriously or comparing too much to the original Police Academy. Now the last Police Academy may not have had Mahony, Steve Guttenberg's character, but it still made me laugh, but I miss the old gang, they were what made the sequels a lot of fun. I also once again missed Zed and Sweetchuck, certain characters just made these movies into fun comedies, but City Under Siege tries too hard. The class is back together to save the city from jewelery thieves, but the plot thickens when they find out that the leader of the gang is connected with the police. But of course Harris is after all the credit of making the bust on the jewelery thieves and taking the credit, even by mocking the old class that always pull something over their heads. But they find out that there is something deeper than just having the jewels, the thieves are going to own this town unless the police academy stops them. Police Academy 6: City Under Siege still delivers some really good laughs here and there, you always have to love the pranks the class pulls on Harris, G.W. Baily plays them off so well and makes the memorable. Also you have to love Bubba Smith who is the classic big guy you just don't wanna mess with. But as far as the sequels go, this was without a doubt the weaker, from what I understand Mission in Moscow is the worst, so I'm going to do my best to have faith and just hope the series ends with a bang. Police Academy 6: City Under Siege, I recommend it if you are looking to see the series, but as a comedy, it's just alright. 3/10",
         "Like the last movie, Police Academy 6 starts out with Harris and Proctor on some ridiculous mission to outsmart the rest of the crew and ensure that they get all of the glory for something or other. At least this time they're not breaking and entering like they were in the last movie, but have stationed them on a stake-out at a location that they are sure is going to be the next hit for the dreaded Wilson Heights Gang who, if nothing else, should definitely find someone else to come up with a threatening name so they'll sound more like a group of hardcore criminals and less like a gated community. But in other news, Harris is in charge of his own precinct now, Tackleberry's got a son, and some old characters like Mrs. Feldman and Fackler are back. I have to admit that I am still confused by feelings of reminiscence for Mahoney, not the least reason for which is that, believe it or not, this is the first genuinely stupid entry in the entire series. Yeah, they're slapstick comedies, but my god, how many decades have people been splitting their sides watching slapstick comedies? You could argue that the slapstick was the first real narrative story-telling that came along in film, and the Police Academies are no different, they just haven't stood up to the test of time so well. Oh, and they're also hampered by stupid-ass sequels like this one and the next one. And hopefully not part 8 which, at this point, remains theoretical. So what's going on this time? We have another small group of mind-bogglingly stupid bad guys, which is not a bad thing in itself, but apparently someone took my words too seriously when I originally reviewed Police Academy 5 and said that the movies are essentially kid's movies, because in this installment we get a cartoonish villain that is a bizarre combination of the Wizard of Oz and Dr. Claw from Inspector Gadget. I guess I should be more careful what I say when I review movies. On the other hand, the first time I ever reviewed Police Academy 5 was about 22 minutes ago, so there is some legitimacy to the theory that it couldn't have affected the thought patterns of screenwriters Neal Israel and Pat Proft, who wrote Police Academy 6 back in the late 80's. But you never know. But get this, here's the supervillain's scheme \u0096 he plans to use his henchmen to raise the crime rate in a certain strategic location in order to drive down property values, then he'll buy up all the property himself, see that the crime rate goes back down and the property values up, and then live like a king off the interest or whatever for the rest of his life. Actually, when you think about it, that's not the dumbest plot pattern. In fact, compared to how moronic the rest of the movie is, it's not that bad. At least they didn't have a villain who tried to outdo even the most outlandish 007 villains and like, you know, hold the sun for ransom or something. Again, most of the original cast is back, but I still miss Mahoney and Zed, and the screenwriters (yeah, it took more than one to come up with this thing) unfortunately have no idea what to do with the characters that we've come to know and love laughing at. Everyone is undercover and their ridiculous assignments are supposed to generate automatic laughs from us, but worst of all, some of the scenes are such disassociated skits from the plot that the story as a whole falls apart. For example. in one attempt to get into a public place and question the public about the whereabouts of the criminals and whatnot, Jones, Calahan and Hooks go into a bar, where Jones puts on a show for all the barflies doing a brilliant impression of Jimi Hendrix to the delight of the crowd and then they leave without having learned or even trying to learn anything. But at least it's in keeping with the rest of the movie, which is the first tremendous step down into the depths of idiocy in the entire series. If you thought any of the previous movies were stupid, MAN you're gonna love this one! But I do have to say that, like part 5, there are some moments in this one that I distinctly remember loving to death when I was about ten years old, like the scene where the huge bad guy who looks like a lumberjack comes outside with an ice-cream cone with like eight scoops of ice cream stacked up on it and goes, \"Oh BOY!\" but then takes one lick, pushing it off where it lands with an audible splat on the pavement and he goes, \"Crapola!\" Okay, so it's not funny in writing. Sue me. But show me a ten year old kid who doesn't laugh at that and I'll show you a kid with some developmental problems that far exceed any of the time-wasting nonsense in this movie. By the way, as I mentioned in my review of part 5, make sure to watch the little reminiscent documentary that you'll find on the DVD, it might be funnier than anything in the whole movie! Check this out, besides glorifying the movie like it's some overlooked Oscar winner, director Peter Bonerz (my god, can you imagine having THAT name in junior high school?) lists off the numerous references and homaaaaaages that can be found within its pristine contents, including everything from Orson Welles to Hitchcock himself! Sadly, your brain has to be securely in the \"off\" position in order to enjoy the movie, but it may add to the comedy just to know that some effort was put in to put those references in there!!",
         "The makers of this supposedly popular franchise just didn't know when to stop, so the first film is still best, and it is pretty much a laughter free film. Basically a string of robberies are being carried out on the same street by the same three crooks, and obviously it is the Police Academy bunch led by Commandant Lassard (George Gaynes) to find them and the connection of these robberies. Lt. Moses Hightower (Bubba Smith), Sgt. Eugene Tackleberry (David Graf), Sgt. Larvelle Jones (Michael Winslow), Capt. Debbie Callahan (Leslie Easterbrook), Sgt. Laverne Hooks (Marion Ramsey) and Sgt. Nick Lassard (Matt McCoy) all back again to save the day, with Captain Harris (G.W. Bailey) along with Lt. Proctor (Lance Kinsey), still trying to show them up, or save the day himself, but failing. I have to say the chase sequence, involving a monster truck, actually wasn't too bad, the heroes all get their small moments, oh, and The Mastermind turns out to be The Mayor (Kenneth Mars), and he was robbing all the buildings to make them more valuable to buy. Also Bruce Mahler as Sgt. Douglas Fackler, Gerrit Graham as Ace, George R. Robertson as Police Commissioner Hurst, Brian Seeman as Flash, Darwyn Swalve as Ox, Home Alone's Billie Bird as Mrs. Stanwyck, Arthur Batanides as Mr. Kirkland, Beans Morocco as Bank President and Daniel Ben Wilson as Tackleberry Jr. As with the other previous films, Winslow seems to be the only funny thing with his self-made sound effects, including a quick Donald Duck impression, beat boxing and of course the robot imitation, although Smith and Graf also get their moments, and Bailey gets more pranks played on him than the previous films. As for the rest of the film, pointless and pretty boring, and unfortunately, the last to feature all continuing actors (besides Steve Guttenburg) together, the next (and hopefully last) sequel, celebrating the 10th anniversary of the first film, only featured five of them. Poor!",
         "Police Academy 1 through 3 showcased it's raunchy to to comedic perfection. While being hysterical the first three (especially the first) also showed a lot of social commentary, talking about sexism, and racism. But there was really nothing left after three. they still kept it going, why I don't know but they did. This time around there is a crimewave, and half of the cast is still gone, and for good reason. Michael Winslow and Bubba Smith just aren't enough, and the obnoxious Captain Harris can't save the movie either, and neither can new addition Kenneth Mars. Stick with the first three, they will crack you up, but this while a marginal improvement over 5 isn't enough to save it. I guess the series ran out of jokes.",
         "This film does not deserve to be in the bottom 100. Part 7, probably, but this is an improvement over part 5, and a genuine attempt to get back to the origins of the series, that which made it so popular and funny. A trio of criminals are causing havoc in the city, stealing diamonds and outwitting the cops at every turn. It seems they are working for a criminal mastermind who plans to lower property prices for his own eventual gains. The cops along with Lassard, Harris and Proctor try to uncover the crooks and work out who the mastermind is. This film has many more funny moments than 5 and 7, and the characters get a chance to fully exploit their individual traits, juxtaposed against the 3 criminals. Nick Lassard returns, but still he is no match for Mahoney. The three criminals are pretty good, and provide a few good moments. Once again it is Harris, Proctor and Lassard who shine, but the rest of the recruits seem more interested than they did in 5. Fackler returns to add some more humour, and overall the film is funny. Of course if you don't like this sort of thing, there is little to recommend it. It is less childish than 5 and 7, there are better performances, and the plot is more linear, rather than seeming like a series of sketches. That said, most of the humour is slapstick, sight gags which have been done better before. However, fans of the series will enjoy it, and remember it is meant to be stupid, not meant to be a cinematic or artistic masterpiece. People reviewing this usually use it to let out all their venom as it is an easy scapegoat. Well, just calm down and save your venom for part seven. Or even better, save it for a film which should have been good, one made with artistic merit in mind which fails. Like Fight Club...",
         "This is actually better than police academy 5. A lot better. There are more laughs, and the plot is not too predictable. Again Leslie Easterbrook flirts with her breasts, which i like by the way. ( I'm not a girl. I'm a boy.) If she said \"Who wants to go one on one?\" I would go. 6/10",
         "Sure the police academy movies are hardly what one would call great but I still like them. They make me laugh and I like to laugh. I think most of the sequels are amusing in parts. This isn't the worst(that would be part 7.) and it isn't the best(that would be the original one) but it is really a funny enough movie. for A FIFTH SEQUEL. It has some great moments, but some really stupid moments too. Most of the stuff that happens to proctor and captain harris is really damn funny, the mayor was a laugh, and the end of the movie is pretty amusing to boot. It also has a better plot then most of the other ones. It goes like this, some crooks are robbing banks and jewerlers. There being hired by Mr. Big so that the value of that street will be worthless and he can buy it, so thats better then most of the other ones if you ask me. Part 5's plot was better, but this isn't a review for part 5 now is it? nope. All in all, It was a decent enough sequel. As I said before, It has some great moments, and some stupid moments, but for a fifth sequel to a cheesy(but funny) 80s sex comedy it's good. 6/10"
      ],
      "genres": [
         "Comedy",
         "Crime"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "A string of business robberies have taken place in the city's Wilson Heights neighborhood, all done by the same three crooks. Captain Thaddeus Harris is no longer in the same precinct with a certain group of cops that he doesn't like. That's why Harris is so happy to be in the Wilson Heights precinct. But then The Mayor tells Harris that business in the city is plummeting because of the robberies. Since there appears to be a leak in Harris's precinct, the Governor has sent in a team to stop the Wilson Heights gang. Much to Harris's dismay, the team is led by Commandant Eric Lassard, so Harris knows who the team members are -- exactly the cops that he doesn't like. The team members are Nick Lassard, Moses Hightower, Eugene Tackleberry, Larvell Jones, Debbie Callahan, Laverne Hooks, and Douglas Fackler. The stakes are raised when Commandant Lassard is accused of being the mastermind behind the robberies, and the team must clear his name.",
         "A gang is terrorizing citizens by robbing stores in the Wilson Heights district of town. Since a leak in the department is suspected, the Governor has chosen the officers from the police academy along with Captain Harris and Lt. Proctor to catch the criminals using old fashioned police work. When Commandant Lassard is indicted, the officers must bring the gang and Mr. Big to justice to clear him.",
         "Those bumbling cadets take to the streets when three inept goons successfully orchestrate a metropolitan crime wave."
      ],
      "budget": 0
   },
   "movielensId": 2383,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-03-09",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Peter Bonerz"],
      "runtime": 84,
      "movieId": 2383,
      "title": "Police Academy 6: City Under Siege",
      "mpaa": "PG",
      "actors": [
         "Bubba Smith",
         "David Graf",
         "Michael Winslow",
         "Leslie Easterbrook",
         "G. W. Bailey",
         "Matt McCoy",
         "Marion Ramsey",
         "Lance Kinsey",
         "Bruce Mahler",
         "George Gaynes",
         "Gerrit Graham"
      ],
      "imdbMovieId": "0098105",
      "originalTitle": "Police Academy 6: City Under Siege",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["f52e7LNT474"],
      "plotSummary": "Our favourite police men are called together to deal with a gang who rob banks and jewelers. Using their various talents as well as their extraordinary luck, the crooks stand no chance against our men and women wearing blue..",
      "tmdbMovieId": 11895,
      "avgRating": 1.88145,
      "releaseYear": "1989",
      "numRatings": 2480,
      "posterPath": "/9mW8fM0PkXvSSmLODTb2OAYEQTY.jpg"
   }
}