{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "bath house",
            "id": 4652
         },
         {
            "name": "turkey",
            "id": 5733
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "gay relationship",
            "id": 10198
         },
         {
            "name": "love affair",
            "id": 14720
         }
      ],
      "imdb_id": "tt0119248",
      "video": false,
      "title": "Steam: The Turkish Bath",
      "recommendations": [
         203139,
         24754,
         130405,
         47619,
         151330,
         47953,
         36542,
         69746,
         149715,
         56310,
         32728,
         20116,
         31978,
         177656,
         27181,
         326835,
         43657,
         17021,
         89608,
         87017
      ],
      "backdrop_path": "/rg8ceusDas8ZehpgTLczRle7Rwh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Francesco",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04ca41",
               "name": "Alessandro Gassman",
               "profile_path": "/3zss1TgmQZU0GSUGDGMbmfWS2e6.jpg",
               "id": 57345,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Marta",
               "gender": 1,
               "credit_id": "52fe452dc3a368484e04ca45",
               "name": "Francesca d'Aloja",
               "profile_path": "/bXSFasVd9xK3kjgdQDPhNXTlNPL.jpg",
               "id": 78711,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Oscar",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04ca49",
               "name": "Carlo Cecchi",
               "profile_path": "/oIOFKqLJVpE6FFlcYyDOur1HxGl.jpg",
               "id": 96974,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Osman",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca4d",
               "name": "Halil Ergün",
               "profile_path": "/Mul4ypT2wnARLV1pw8E8OPHPhI.jpg",
               "id": 96975,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Perran",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca51",
               "name": "Şerif Sezer",
               "profile_path": null,
               "id": 96976,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mehmet",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04ca55",
               "name": "Mehmet Günsür",
               "profile_path": "/pyRaLDWMhUd1IPLyb3uNUkxiSqW.jpg",
               "id": 96977,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Fusun",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca59",
               "name": "Basak Köklükaya",
               "profile_path": null,
               "id": 96978,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Paolo",
               "gender": 2,
               "credit_id": "52fe452dc3a368484e04ca5d",
               "name": "Alberto Molinari",
               "profile_path": "/yXqFVFKZ86XkMMBckEZ3btdIGpr.jpg",
               "id": 96979,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Zozo",
               "gender": 0,
               "credit_id": "52fe452dc3a368484e04ca61",
               "name": "Zozo Toledo",
               "profile_path": null,
               "id": 96980,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe452dc3a368484e04ca3d",
            "name": "Ferzan Özpetek",
            "profile_path": "/wRqKScMvUBNbwYkYipCXfVSOxx1.jpg",
            "id": 72197,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.333742,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "TR",
            "name": "Turkey"
         }
      ],
      "id": 27104,
      "vote_count": 32,
      "budget": 0,
      "overview": "Francesco and Marta run a husband-and-wife design company in Rome. When Francesco's aunt dies in Instanbul he travels there to sort out the hamam turkish steam bath that she left him. He finds a love and warmth in his realtives' Instanbul home that is missing from his life in Italy.",
      "similar": [
         449176,
         184352,
         380874,
         26280,
         47643,
         26933,
         338189,
         258034,
         11421,
         26371,
         376867,
         428493,
         413666,
         10938,
         1966,
         1213,
         398818,
         322127,
         261776,
         11386
      ],
      "original_title": "Hamam",
      "runtime": 94,
      "poster_path": "/7djUV6eFo4Vgl4ODakrUnyqxXh1.jpg",
      "spoken_languages": [
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Türkçe",
            "iso_639_1": "tr"
         }
      ],
      "production_companies": [],
      "release_date": "1997-10-24",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "What he inherited was a sexual awakening...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ferzan Ozpetek"],
      "runtime": 94,
      "synopsis": "An Italian designer travels to Istanbul to sell a traditional Turkish steam bath left to him by a deceased aunt. Upon arrival, he becomes enthralled by the city and decides to renovate and return the bath to the public. This sudden change of heart may have something to do with the fact that he's fallen in love with a beautiful young local boy. Their romantic relationship is cut short when the designer's wife arrives in Turkey with her own agenda.",
      "writers": [
         "Ferzan Ozpetek",
         "Ferzan Ozpetek"
      ],
      "originalLanguage": "Turkish",
      "imdbLink": "http://www.imdb.com/title/tt0119248/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2ODY4Mjk5NF5BMl5BanBnXkFtZTYwMjI2ODY4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Alessandro Gassman, Francesca d'Aloja, Carlo Cecchi | See full cast and crew »"],
      "reviews": [
         "\"Steam\", also known as \"Hamam\" or \"Il Bagno Turco\" is one of the best movies I have ever seen! After repeat viewing you will notice the beauty of the story, characters and the city of Istanbul! Francesco is the sole heir of his aunt, the sister of his mother, whom he has never known! Being single, after a life of love and tragedy, she was living the last years of her life with a Turkish family in an old original part of Istanbul. Due to the downfall of tradition, the Hamam lost its appeal and had to be closed. Francesco, an architect/interior designer, living in Italy, in a wealthy part of Rome with his girlfriend goes to Istanbul to take care of the estate of his aunt. From his arrival he is drawn into the mysterious world of Hamam! Great is his surprise that his inheritance is a Hamam! After getting to know the family, Francesco is engulfed in this new old world of Turkey and Istanbul. Going from very wealthy in Rome to being a guest of a very poor Turkish family, Francesco's life and the Hamam become \"one\". Francesco has decided to rebuild his life without his girlfriend and Rome and starts rebuilding the Haman in Istanbul to its former glory with the help of Mehmet, son of the Turkish family, who, during the course of the restauration, becomes his lover. From then on things start to develop very quickly in a storm of old against new, east against west, money against poverty, greed against tradition, love against hate and finally gay against straight untill the very end! The conclusion is as shocking as unexpected! A movie to be viewed and reviewed again and again! Highly recommended!",
         "In the US, this film is being 'pitched' as a film about sexuality. In truth, that is not the film's focus. The main character travels to Turkey and undergoes an unexpected personal transformation. Part of this transformation has to do with same-gender sexuality. But you will enjoy the film much more if you forget about that entirely, and let the story unfold. I think that the film's main characteristic is that it is subtle. The main character is not shouting his confusion from the rooftops; the viewer is left to draw conclusions from glances and actions (or the lack thereof). Some self-reflection comes in the form of letters that his aunt wrote to his mother, with the implication that he feels the same way. Steam, or Hamam, is about suddenly finding one's \"home\", and being willing to accept that discovery and embrace it.",
         "This film is really a very subtle, literate story. Nothing hits you over the head, there's nothing to win or lose at the end, it's just characters and events unfolding and interacting within a languid pace. It's really a beautiful film, both in scenery, sentiment and depth of feeling. If you've ever visited Istanbul you should see this film. I expected to see the Hagia Sophia and Blue Mosque right off, but you never see them-- the film chooses to see Istanbul through the charming back alleys and everyday people. The traditions of the country and the warmth of the people are ever-present in this film. Istanbul itself is like a character here, and its special charms are at the center of the story. If you have visited there, you will understand why the characters become so captivated. But this film only uses Istanbul and the Hamam as a vehicle for showing its characters ways of finding happiness and tranquility in one's life. The story is much more general and eternal. It shares that quality with literature-- it is at once about these specific characters, and also about everyone, everywhere. Here in New York this film is called \"Steam\" and is being sold as a major homoerotic experience. It's sad that they have to cheapen this wonderful movie in that way, and people going expecting to get their jollies will be woefully disappointed-- and entirely missing the point. One tends to think of Turkish/Italian cinema as not being as technically sophisticated, but this film is vary carefully and intelligently written and directed. This really is one of those special, beautiful movies, not as flashy or intense as some, but I think I will remember this film for a long time. --- Check out website devoted to bad, cheesy and gay movies: www.cinemademerde.com",
         "This is a wonderful film about happiness and love, not some sex film. Finding your true place in life physically as well as emotionally is the theme. Everything is beautiful about this movie, the people, the love between the two men and the between the family and Francesco. Great performances by the cast, especially Alessandro Gassman. Beautiful scenes of Istanbul, which I am sure is not seen by the usual tourist. I loved this movie and highly recommend it.",
         "An official selection of the Cannes Film Festival, \"Steam (The Hamam)\" is a mesmerizing, astounding film that grips you almost from the beginning. Francesco and Marta are a feuding, materialistic, adulterous married couple. But when Francesco inherits a Turkish bath from an aunt he barely knew, he heads to Instanbul to sell it. There, he is seduced away from his high-tech, wealth-obsessed life by the slow, human pace of life led by the people of the ghetto. Francesco finds his bitterness salved by the love of the family who manages the hamam, his heart stolen by the family's hunky son Mehmet, and his too-fast life slowed by the need to rebuild and maintain the hamam. And then Marta arrives, wondering what the heck has gotten into her husband... The film even has a surprise ending. The musical soundtrack was a major hit on the dance circuit. And the film itself became notorious when the Turkish government refused to nominate it for a best foreign film Oscar because of its homosexual content. (The controversy led the Academy to change the way foreign films are nominated.) \"Steam\" is MUST-see, ranking right up there with \"Muriel's Wedding\" and \"Four Weddings and a Funeral.\"",
         "So let's restrict ourselves to the most beautiful shot. The closing scene, I think. Here we find yet another of the main characters we have started to know throughout the story, being sucked into the gentle, demanding, chaotic, smoky, colourful and slow whirlpool that is this movie's Istanbul. An antique cigarette holder, a loved-one's sweater, and a calm, steady gaze over the Bosphorus. Representative, in its way, for the entire film. Understatement at its finest.",
         "I like a movie that has a distinct climax, yet is easy to overlook or perhaps miss altogether. The climax of Hamam is when Francesco hands his wife the letters from his aunt and asks that she send them back when she's finished reading them. It is a seemingly small, inconsequential gesture -- but an act of conviction that describes a person's inner workings far more than could ever be achieved with an abundance of words. It is truly a beautiful moment -- one of many -- and a reason this is a film worth viewing.",
         "First off the bat, the homosexual suggestive advertising of this film is misleading: it was not the central theme nor occupy any more than a second's brief moment. This film actually has a very poignant way of telling a story, which is set in Istanbul (this was what drew me to see this film as I remembered my visit to Turkey and fascinated by the city of Istanbul), and Istanbul is really the central backbone of this movie. Story unfolds in a very ordinary everyday way, and through out the film, yes, things just unfold and nothing is presented elaborately \u0096 no fuss no emphasis \u0096 they all come across in subtle nuances. One recurring activity is eating: breakfast, family dinner at home, dining at a restaurant -- the colorful food on the table, and the people at the table --- it's all happening in a casual simple everyday manner. Yes, it's like you're there with them -- the \u0091regular' streets and neighborhood of Istanbul the city that tourists do not see. Meanwhile layers of emotions subtly unraveling and the central characters: Francesco and his wife, Marta, each of their own feelings go through stages of change\u0085through each of their experiences of Istanbul and Francesco's aunt Anita's words\u0085 It all come together\u0085and you will enjoy this film. An ordinary extraordinary film this is.",
         "I agree with those who comment that marketing this as a gay film is an indulgence in false pretenses, but I and my friends have enjoyed this thoughtful, beautifully filmed parable of self-discovery as a parable for the coming-out process. The vagueness and the fact that so much of the story is told through glances, gazes, and shimmering vistas of Old Istanbul means that everyone can bring their own story along with them to illuminate the hints and nuances of this remarkable film. The ensemble performances were very powerful, and I honestly couldn't find any false notes here, though the atmosphere of Mediterranean melodrama at the film's sudden and somewhat awkwardly contrived conclusion seemed a little heavy and perhaps unnecessary as an ending to the serenity of the film as a whole. I quite liked the music, and I enjoyed the director's eye for everyday details in a landscape that is very exotic to a North American filmgoer--reminiscent of The Scent of Green Papaya, or Raise the Red Lantern.",
         "This movie was not at all what I expected. The way it was being advertised, one would have thought it was nothing more than a bunch of hot guys getting it on in a steam room. But this movie wasn't even close to being that shallow. The story is very bittersweet, about two people finally finding themselves only to lose it in the end. There is no conventional happy ending here, but I cannot decide if it is a sad ending. You'll have to see for yourself. Definitely a must see for anyone, gay or straight. The story is the thing here. If you're looking for sex of any kind, you might as well look elsewhere."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Sorpasso Film",
         "Promete Film",
         "Asbrell Productions"
      ],
      "summaries": ["Francesco and Marta are husband and wife running a small design company in Rome. When Francesco's long forgotten Aunt Anita dies in Istanbul, he travels there to look after the sale of the hamam (one of a few traditional Turkish baths left) he inherited. There he meets the family running the hamam, gets attracted to a member of it and the whole Turkish atmosphere and decides not to sell the hamam.."],
      "budget": 0
   },
   "movielensId": 2388,
   "movielens": {
      "languages": [
         "Italiano",
         "Türkçe"
      ],
      "releaseDate": "1997-10-24",
      "dvdReleaseDate": "2000-07-24",
      "directors": ["Ferzan Özpetek"],
      "runtime": 94,
      "movieId": 2388,
      "title": "Steam: The Turkish Bath",
      "mpaa": "",
      "actors": [
         "Alessandro Gassman",
         "Francesca d'Aloja",
         "Carlo Cecchi",
         "Halil Ergün",
         "Şerif Sezer",
         "Mehmet Günsür",
         "Basak Köklükaya",
         "Alberto Molinari",
         "Zozo Toledo"
      ],
      "imdbMovieId": "0119248",
      "originalTitle": "Hamam",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["IsolrGofG6U"],
      "plotSummary": "Francesco and Marta run a husband-and-wife design company in Rome. When Francesco's aunt dies in Instanbul he travels there to sort out the hamam turkish steam bath that she left him. He finds a love and warmth in his realtives' Instanbul home that is missing from his life in Italy.",
      "tmdbMovieId": 27104,
      "avgRating": 3.4235,
      "releaseYear": "1997",
      "numRatings": 183,
      "posterPath": "/7djUV6eFo4Vgl4ODakrUnyqxXh1.jpg"
   }
}