{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "motel",
            "id": 2669
         },
         {
            "name": "stolen money",
            "id": 8627
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "psychosis",
            "id": 160059
         },
         {
            "name": "psycho",
            "id": 176182
         }
      ],
      "imdb_id": "tt0155975",
      "video": false,
      "title": "Psycho",
      "recommendations": [
         10576,
         11675,
         11618,
         12662,
         11377,
         15516,
         40377,
         11415,
         9877,
         9424,
         11601,
         806,
         9272,
         9406,
         10906,
         16780,
         11442,
         10984,
         11357,
         794
      ],
      "backdrop_path": "/7Aw6Yy5vPvB1LR6mOdeTi1WNN8m.jpg",
      "revenue": 37141130,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Norman Bates",
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f29",
               "name": "Vince Vaughn",
               "profile_path": "/r6ISnWjO5fA9QA1BTWUGaqdPyxE.jpg",
               "id": 4937,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Marion Crane",
               "gender": 1,
               "credit_id": "52fe441b9251416c75028f2d",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Lila Crane",
               "gender": 1,
               "credit_id": "52fe441b9251416c75028f31",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Samuel 'Sam' Loomis",
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f35",
               "name": "Viggo Mortensen",
               "profile_path": "/qmC8XfeiFhQtJGKlUk5KyGkPoWp.jpg",
               "id": 110,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Milton Arbogast",
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f39",
               "name": "William H. Macy",
               "profile_path": "/cYmHYCGxkOVZgu2oDyhF6lKgfaj.jpg",
               "id": 3905,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Dr. Simon",
               "gender": 2,
               "credit_id": "54156ce30e0a261c270017d7",
               "name": "Robert Forster",
               "profile_path": "/3ulaOBmEqmGQ8ywo8wHAqGJ2odX.jpg",
               "id": 5694,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Sheriff Chambers",
               "gender": 2,
               "credit_id": "54156d0e0e0a261c35001723",
               "name": "Philip Baker Hall",
               "profile_path": "/eH7GrivSuLEvhJL85qPkhNvg3E7.jpg",
               "id": 4492,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Tom Cassidy",
               "gender": 2,
               "credit_id": "54156d330e0a261c270017e1",
               "name": "Chad Everett",
               "profile_path": "/vRqcTOn7cRsioglC3zEnQMSsIUg.jpg",
               "id": 15013,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Mr. Lowery",
               "gender": 2,
               "credit_id": "5a18b6400e0a264cd001f305",
               "name": "Rance Howard",
               "profile_path": "/i7tkpb7GLJXjwUNyrpOy63FiStt.jpg",
               "id": 22250,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Caroline",
               "gender": 1,
               "credit_id": "5a18b6690e0a264cc401e2fc",
               "name": "Rita Wilson",
               "profile_path": "/jsIeIIzvirqMMCua4fA0ziRsRIs.jpg",
               "id": 12931,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Patrolman",
               "gender": 2,
               "credit_id": "5a18b713925141033301eaad",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Car Dealer",
               "gender": 2,
               "credit_id": "5a18b72cc3a3680b8f01f490",
               "name": "James Le Gros",
               "profile_path": "/rqBjmSkcRGwtwpb2tTjGcqLtKyG.jpg",
               "id": 6474,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f07",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f0d",
               "name": "Joseph Stefano",
               "profile_path": null,
               "id": 7300,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f13",
               "name": "Robert Bloch",
               "profile_path": "/5jW9ppMTpAQpBQn1e9LgaR8Np6h.jpg",
               "id": 7299,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f19",
               "name": "Brian Grazer",
               "profile_path": "/yqiKX3auDuorea0BOtuB6Ifhyp6.jpg",
               "id": 339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f1f",
               "name": "Gus Van Sant",
               "profile_path": "/3vLQK7nbmOTBVJrdfrmySCYZFJX.jpg",
               "id": 5216,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe441b9251416c75028f25",
               "name": "Amy E. Duddleston",
               "profile_path": null,
               "id": 57050,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f3f",
               "name": "Christopher Doyle",
               "profile_path": "/u7xRErdN6ya9qzOG8PVa2QshZFC.jpg",
               "id": 1357,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe441b9251416c75028f45",
               "name": "Bernard Herrmann",
               "profile_path": "/nuGwEH9lJIBTEzsmB4bGDgJ9qgj.jpg",
               "id": 1045,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.89487,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11252,
      "vote_count": 316,
      "budget": 60000000,
      "overview": "Criminal on the run, Marion Crane takes refuge at the motel operated by Norman Bates - a troubled man whose victims encounter a grisly fate at the hands of his \"mother.\" Marion soon becomes the next victim and her disappearance prompts inquiries from her sister and a private investigator. They both soon discover the morbid bond linking Norman to his mysterious \"mother\" at the Bates Motel.",
      "similar": [
         357096,
         123109,
         15069,
         8090,
         1586,
         2832,
         807,
         21484,
         984,
         36599,
         15762,
         9299,
         979,
         1949,
         948,
         238636,
         395834,
         3597,
         4771,
         96
      ],
      "original_title": "Psycho",
      "runtime": 105,
      "poster_path": "/5emaTTGS8rnLgZrBS98zqv1XWqE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": "/4PR5ZyqlDrMqx1h5PyOL4VRL70z.png",
            "name": "Imagine Entertainment",
            "id": 23,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-12-04",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "A new vision of a classic nightmare.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gus Van Sant"],
      "runtime": 105,
      "synopsis": "When Phoenix secretary MARION CRANE, late 20s, meets her lover SAM LOOMIS in a seedy downtown hotel, she longs for the respectability of marriage. But Sam, owner of a hardware store in Fairview, California, burned by his previous marriage, is skittish of commitment, crushed by debt and alimony demands from his ex-wife, feeling incapable of supporting Marion in another marriage. Marion returns to her job in a real estate office owned by MR. LOWERY, only to find that a vulgar Texan, MR. CASSIDY, is buying his daughter a house with cash - four-hundred thousand dollars. Both Marion and co-worker CAROLINE are stunned by all the cash, and Mr. Lowery, nervous, asks Marion to bank it on her way home, as shes developed a headache and is leaving early. But Marion decides the money might buy her out of the dilemma with Sam, and she packs hastily, taking off in her car for Fairview with the cash stuffed in an envelope. On the way, she attracts the suspicion of a PATROLMAN, and Marion, increasingly agitated, trades her car for a new one - paying with five-thousand dollars from her stolen cash. Haunted by fantasies that her crime will be discovered Monday morning, Marion runs into bad weather, checking into a rundown motel called \"The Bates Motel,\" operated by young, neurotic, apparently callow NORMAN BATES, who is clearly attracted to Marion and talks about his dominating mother, whom Marion thinks she sees walking behind a bedroom curtain in the huge gingerbread mansion behind the motel. Norman brings the disheveled Marion a quickly prepared supper, but, having heard the curses hurled at Norman by his vengeful mother, Marion has lost her appetite. In Normans parlor, decorated by the birds he stuffs as part of his taxidermy hobby, Norman talks of his mother, the burden of her difficult personality. When Marion returns to her room, she makes a decision to return the money in the morning, first calculating what she has spent. Unknown to Marion, the aroused Norman is watching her through a hole in the wall. Marion disrobes, stepping into the shower, but shes suddenly attacked by what appears to be a crazed old woman in a dress and cheap fright wig - a brutal murder that leaves the bathroom splattered with blood. Norman is horrified when he finds the body, but ever the dutiful son, he cleans up the mess, wrapping Marion's body in the shower curtain and placing it in the trunk of her car, along with her newspaper, which, unbeknownst to Norman, contains the stolen money. Norman drives the car to a nearby swamp, pushing the car into the murky water that eventually claims it. Meanwhile, Marion's sister, LILA, visits Sam, hoping to find her sister. A detective, SAM ARBOGAST, also shows up, hired by Marion's boss to locate Marion with a minimum of fuss. Sam makes it clear he has no idea where she is, despite Marion and Arbogast's theories to the contrary. Arbogast follows Marion's trail, eventually coming across the Bates Motel, where he, too, sees a silhouette of an old woman walking behind a bedroom curtain in the old house. Arbogast interviews Norman, who is clearly nervous and obviously hiding something. Arbogast, not yet suspecting the worst, calls Lila, telling her that he thinks Norman is protecting Marion and that Arbogast intends to interview Norman's mother. Arbogast returns to the property secretly, entering the house behind the motel and climbing the stairs to Normans mothers room. Before he reaches the top, Arbogast is savagely attacked, apparently by the same old woman, stabbed to death at the bottom of the stairs. Later, Norman carries his mother down to the fruit cellar to keep her safe, chatting with her all the way down. With Lila and Sam wondering where Arbogast is, they grow curious about the Bates Motel, the detectives last stop. Sam visits the motel, but he finds out little. Later, he and Lila decide to visit SHERIFF CHAMBERS and his wife, MRS. CHAMBERS. But after laying out their suspicions, Lila and Sam are shocked to find out that Normans mother has been dead and buried for several years, found murdered in her bed with her lover. The next day, Chambers reports that he visited Norman but that everything seemed normal. Certain they can find a clue if they visit the motel themselves, Lila and Sam check in under phony names as man and wife. They get into Marions room, finding two clues: a missing shower curtain and a scrap of paper indicating that Marion subtracted an amount from four-hundred thousand dollars. It doesnt prove much, however, since Norman never denied that Marion was there. Determined to speak with Mrs. Bates herself, Lila heads for the house while Sam keeps Norman distracted in his office. Lila enters the house, searching for Mrs. Bates, moving about her empty bedroom, later Normans. When Norman realizes that Lila has gone up to the house, he struggles with Sam, knocking him unconscious and running up to the house. Lila sees him coming, hides in the stairway leading to the cellar, then decides that Mrs. Bates might be down there, after all. Lila enters the cellar, approaching Mrs. Bates, who's sitting with her back to her in a chair. Lila touches the old womans shoulder, only to find that it isnt Mrs. Bates at all, but her rotted corpse! Horrified, Lila shrieks in terror, her scream of terror joined by another scream û that of Norman, who, wearing a wig and a dress, is masquerading as his mother, wielding the same deadly knife he used to kill the others while in the same guise. Sam dashes in just in time to save Lila from the same horrible fate. At the local courthouse, Lila, Sam and Chambers await word from psychiatrist, DR. SIMON, hoping to find out the truth about Marions fate. Following a GUARD whos taking Norman a blanket, Dr. Simon enters another room, where Norman, his back to him, sits in a strange calm. But when Simon asks Norman a question, the young man answers in his mothers voice. Indeed, the battle for identities has been won - Norman has become his mother. It is therefore Norman's \"mother\" who explains Normans pathological jealousy of her, how he killed her and her lover with strychnine, framing the mother, and then, experiencing such guilt, stole her body, weighted the coffin, then assumed her identity, hoping to erase the crime. But the \"Norman's Mother\" half of his personality is now victorious, convinced that it was her son, not she, who killed Marion and Arbogast. Simon returns to Lila, Sam and Sheriff Chambers, explaining the bizarre split in Norman's personality. Meanwhile, Norman, alone, has utterly become his mother, who, thinking in v.o., regrets having to incriminate her son. Noticing a fly as it comes to rest on her hand, Norman/Norma refuses to swat it, hoping that theyll observe the truth about her: that she wouldn't even harm a fly...",
      "writers": [
         "Robert Bloch",
         "Joseph Stefano"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0155975/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTE5ODc3MDIzMl5BMl5BanBnXkFtZTYwMDU0NzE5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vince Vaughn, Anne Heche, Julianne Moore | See full cast and crew »"],
      "reviews": [
         "Yes, why? Among the filmmakers that came out in the 80's and 90's Gus Van Sant is one of my idols. There are others, a few. Steven Sodebergh, PT Anderson, Tim Hunter, Danny Boyle, Martin Donovan, Harmony Korine, Wes Anderson. Idiosyncratic, infuriating some times, but consistent, surprising, unpredictable. Their names make me switch on the TV, go to a video store or even buy a ticket and go to a movie theater. Van Sant's \"Psycho\" however, gives me pause. Why? I wonder. A shot by shot massacre of one of the perennial classics. The color was jarring, the performances, atrocious. What was Vince Vaughn doing? Was it a parody? A bad joke? What the hell was it? Anne Heche as Janet Leigh? Who dressed her? Viggo Mortensen with a cowboy hat. Viggo is a superb actor but in this case he couldn't make us forget John Gavin and if Julianne Moore had been introduced to the world through this performance there wouldn't have been any \"The Hours\" for her, \"The Minutes\" maybe. So, here I am, bad mouthing the work of one of my idols. The crashing question remains: Why, Mr. Van Sant? Maybe, in the words of President Clinton, because he could. I'm afraid that's no excuse.",
         "Hitchcock's original classic benefited tremendously not only from the performance of, but also the 'look' of Anthony Perkins. He projected a kind of clean-cut innocence: a young teen-idol type of persona. He was not an actor who had portrayed baddies before this; nor was he physically suited to the role of what the public might have imagined a psychopath to look like, especially in the 50's when this ultra-chilling aspect of mental illness (split personality psychosis) was relatively unexplored in film. Which is exactly why the casting of him as Norman Bates was a slice of true Hitchcockian genius. Audiences were taken by surprise to put it mildly. That's why this re-make does not work, even a little bit, in spite of trying to be an exact copy. Whereas Anthony Perkins looked like someone you would never think of as being a serial killer, Vince Vaughn is easily imaginable as one. He lacks the frail look of Perkins and his acting chops are clearly inferior as well, at least in this role (honestly - has there ever been an actor who could convey nervousness as genuinely as Anthony Perkins?). While it was a pointless re-make to begin with, the miscasting of the story's most important character sucks this film down completely. As a side note, I feel that Hollywood's propensity for re-making great movies because 'young' people refuse to watch anything that's not filmed in color not only stinks to high heaven of corporate greed but is exceptionally disrespectful to the original work. As for viewers who can't watch black and white - it's their loss. Hopefully they'll mature sometime in the future and no longer require shiny colours to hold their attention. When they do they'll discover that sometimes black and white works far better. With the background muted, the story and performances are that much more front and center. And in many cases the mood or atmosphere created through black and white cinematography is just not attainable in colour.",
         "This is, per se, an above average film but why in the name of Bog was it made? It's impossible to treat it as a thing unto itself because it is an almost shot-for-shot remake of an Alfred Hitchcock classic of 1960. You can't watch it without the 1960 film nudging into your consciousness. What does the word \"credit\" mean? How can we credit Van Sandt and his associates with anything except deciding to use different actors, slightly different sets, and color? Anne Heche is attractive but lacks Janet Leigh's stolid determination to become a respectable middle-class woman. And Heche is younger than Leigh, who brought to her fruitless attempt to marry and settle down, the desperation of a woman facing forty. And Heche doesn't project anxiety the way Leigh did. The scene with the CHP officer looking in her car window illustrates the weakness in the role. In the original, the officer asks, \"Is there something wrong?\" Leigh: \"Of course not. Am I acting as if something were wrong?\" The officer hesitates before replying: \"Well, frankly, yes.\" That exchange is omitted from the remake for the simple reason that Heche isn't nervous enough. The worst change, without a doubt, is the substitution of Vince Vaughn for Anthony Perkins. It may not be Vaughn's fault. Who could match Perkins in the role? Perkins is twitchy, bird-like, long-necked, cloaked in an externally charming exterior that masks an inner vacuum. His every move (eating candy corn, with his adam's apple bobbing) and every utterance, the faint laugh, the arid chuckle, is spot on. He just can't be improved upon. Vaughn brings to the role the presence of a short-haired beefy guy who was just discharged as a Lance Corporal from the U. S. Army. To suggest his psychosis all he can do is superimpose a maniacal giggle on top of what appears otherwise a perfectly normal Norman in speech and manner. (Unlike the original Norman, Vaughn doesn't even stumble over the word \"fallacy\" because it resembles \"phallus\".) He could be just hanging around the motel waiting to hear about his application for a football scholarship to UCLA. The direction deserves a few comments. I don't see what it adds to the story when we see Norman masturbating while peeping in on Anne Heche. I don't OBJECT to it. I wonder why it's there, just as I wonder why the rest of the movie is there. And, I suppose in order to impress us with how much color adds to the visual experience, Van Sant seems to have missed a bit of Hitchcock's more subtle stuff. Heche is given underwear of all different colors -- green, pink, orange, and -- mango? Is that a color? If so, what the hell color is it? Never mind. The point is that in the original, when the traveling camera first peeks through the window of the Phoenix hotel it captures Janet Leigh in bed wearing a pure white half slip and a white bra. Later, after she has stolen the money, we see her in her underwear again -- this time both her slip and bra are black. Tis a small thing, but Hitch's own. At that, the idea of shooting in color might not have been bad except that the black-and-white shooting of the original was superb. The color and odd lighting effects in this version turn the ordinary, dull, and subliminally ominous motel into something that looks like it belongs in the seedier part of Las Vegas. Most of all, the 1960 film was shocking in more ways than one. I can remember seeing it in a drive-in in San Diego and staring aghast at the screen when it became clear that the central character was actually DEAD -- half-way through the movie! Nothing like it had ever been done before. That murder in the shower, in both movies, was a big improvement over Robert Bloch's original novel, by the way, in which the author writes something like, \"The murderer then entered the bathroom and cut off her head with a knife.\" I'm not making that up. Well, not entirely. Even here, Van Sant's movie gives us excess. There is more blood and more bare flesh. And where Hitchcock closed in first on the blood circling the bathtub drain and dissolved to Marian's blankly open eye, then pulled the camera back slowly to reveal her face, he rotated his camera from a slight tilt to the proper vertical, giving the viewer a sense of not just disbelief at the murder, but a dizzying disbelief. Van Sant doesn't tilt his camera a delicate 10 or 20 degrees as Hitchcock did. He practically twirls it on its axis. It won't do to call this a bow to Hitchcock because it's not. It's a pecuniary plundering of Hitchcock's material (already ripped off in \"Psycho\" I, II, III, IV, and \"Psycho: The Beginning Years\", and \"Come Into My Parlor: Mrs. Bates' Revenge,\" and \"Hand Me That Knife, Would You?: The TRUE story of Norman Bates.\") A rehashing of and grinding away at truly original stuff, a crumenal act if not a criminal one. And that's not to mention the many homages in other films, especially the French, such as the notorious \"ocean of boredom\" scenes between Marcel Brulee and Jeanne Gateau in the much-admired \"La Mere de la Nuit.\" (Maybe I'd better add that that last sentence is a terrible attempt at a parody of academic critics. And when a chicken's guts grind corn, it's a \"crumenal\" act. I won't go on except to say these gags, shabby as they are, are more fun than the movie.) So who was it made for? I'd have to guess. Kids who are too young to know about the original and who don't like movies in black and white? Kids who are hoping to see another ordinary slasher movie? Chimpanzees?",
         "Marion Crane steals $400,000 and is escaping to meet her boyfriend. When she gets tired during a stormy night she stops at the Bates motel. When she goes missing her sister, boyfriend and a private detective start to look for her. However the Bates motel run by Norman and his mother is a place of many secrets. Remakes are regular things nowadays, but carbon copies are rare. This is a lift in terms of dialogue, shots almost everything at times. The big question is why? As a film in its own right it's not terrible but comparing it to the original it literally pales in comparison (despite the colour!). Why did we need this \u0096 sure on some level it may reach those who haven't seen the original and don't want to watch an 'old' film. But really \u0096 why should we indulge the multiplexers who refuse to watch anything made before 1991? It's not bad \u0096 it's poor a poor relation of the original. In the UK we often get 50th anniversary etc re-releases of old films nationwide (admittedly not in all cinemas), in fact Psycho was out a few years ago. So the idea that a cheap copy is good because it'll help open it up to new audiences. The cast are all OK \u0096 until you watch the original. Then Vaughn stands out as doing a poor imitation, Heche is nowhere near Leigh and Julianne Moore has too much 'strong woman' baggage from other roles to do well. Admittedly the all-star cast gives weight to the roles that were relatively minor \u0096 Macy, Mortensen, Forster, James LeGros, Philip Baker Hall etc \u0096 although really the question is why they all queued up to be in this toss! Overall it's so-so as a film. However when you compare it to the original it's really a poor show and, because it's a carbon copy, you can't help but compare it line for line, scene for scene, actor for actor.",
         "This is easily the worst remake in film history. I have never understood the idea of a remake at all. If a film, like Psycho, is so good to start with why on earth do you want to try and improve on it? If you insist on tampering with perfection, why then do you have to try to recreate it in it's whole? There is nothing original here. Gus Van Sant put nothing of himself into this film. They say imitation is the highest form of flattery, but this is ridiculous. There are a lot of sides to a character as complex as Norman Bates, and I suspect that Vaughn may have wanted to explore them. Instead Van Sant forced him into sticking to a cheap imitation of Anthony Perkins. Perkins turned in a performance that lead to one of the most memorable characters in film history and it would have been impossible for any actor, no matter how good to recreate that. The rest of the characters are stuck just as tight to similarly wooden imitations of the originals. It is almost painful to watch very talented actors (namely William H Macy) have that talent stifled. In the end, Gus Van Sant set out to pay homage to a great film. Instead he cheapened it, and created a movie that is not worthy of late night cable.",
         "No matter what other people have said you can't review this movie without comparing it to the original, if it existed on it's own it would be a 2-3 out of 5 film but it is a remake of a 4-5 out of 5 film and so has standards to live up to and we need to see if it reached those standards. If the film was a re-working or, as in Planet of the Apes, a re-imagining of the original you would be able to look at the film in it's own right, only referencing the original. Imagine it this way, if someone took the model in the 'Mona Lisa', posed her in a different way, and painted her you could only compare the framing,concept etc to the original but if someone just repainted her in the position of the original you would have to compare it totally. That said this film doesn't just fail to be as good as the original it fails spectacularly, like it or not the original was one of the best movies ever made, the shower scene will never be forgotten, the remake was meant to be a celebration of Hitchcock but ended up actually degrading him and his master work. The degrading aspects of this picture were Vince Vaughn and Anne Heche. It's nothing to do with wether they acted better or not it's that the relationship between Norman and Marion in the original was really quite innocent, Norman didn't really understand sex, he had hardly any contact with the outside world and when he meets beautiful Marion and watches her change you feel that he is partly doing it from fascination as he doesn't really understand sex and his attraction to her,this makes Norman sympathetic and almost an anti-hero, you are on his side because he doesn't fully understand the world and is constantly fighting with himself and his 'Mother'. In the remake that whole dynamic is gone, I must admit to Janet Leigh not being my type but she is very attractive and you can see that, Anne Heche is really unattractive and so Norman finding 'her' Marion attractive is unbelievable if you add that to Vince Vaughn's Norman masturbating whilst looking at her and you get a Norman that is just waiting for a chance to jack off at any naked woman no matter what she looks like, who you feel absolutely no sympathy for, they further destroy Norman's innocent nature by putting the porno mags in his room. It destroys a character that we have come to like and feel sorry for, it's like re-making 'It's a wonderful life' and having the main character a pimp, totally degrading. The only other character that I had problems with was Rita Wilson as Caroline, Marion's workmate. In the original when Pat Hitchcock says the line 'he must have noticed my wedding ring' it elicits a response of laughter as she is absolutely kidding herself, when Rita says it it just seems plausible as there really isn't any other reason why any man would flirt with Anne Heche over her. I'll admit that I am very biased, the original 'Psycho' is my favorite film of all time, had the film been a reworking, with a different angle, then you could have turned these characters on their heads and it would have been perfectly acceptable. Hitch famously thaught the film would be too gory in colour and made it in black and white to lessen it. This also made the film more atmospheric and frightening in it's own way and it gave it a beauty that could never be captured in colour and it is a sad statement about how movies are de-sensetising the public that people have said how the shower scene was more frightening in colour. (n.b before people think 'he can't spell' remember I'm from England and we spell it colour) A remake should be just that, re made, this is a forgery, a complete copy and a very bad one at that. I could go on comparing but there is no point, almost everything is superior in the original. The only one thing that is better is the performance of Viggo Mortensen as Sam Loomis, John Gavin was very flat in the original (Hitch called him 'The Stiff' behind his back) and Mortensen gives a more believable if less likeable performance. William H. Macy and Julianne Moore are the only other actors that hold up to the originals. Overall a movie that should be labeled 'Expensive Embarrassing Failed Experiment. Only view if comparing to original or if original is unknown to you. But view original too' The movie would have got a 3 out of 5 if it were original or a reworking but as it is 0.5 out of 5 (for Macy, Moore and Mortensen)",
         "I know curiosity killed the cat, but I simply had to see the remake of Psycho, especially after being on such a Hitchcok journey recently and knowing his work. I've watched the original Psycho though since I was a kid, I knew how to respect it and not only that, it was an excellent movie! One of the best, in fact! The first thing I said when I heard about the remake was \"How do you remake perfection?\". I stuck to that as well, but I think I have a more open mind now and figured maybe it was a way of introducing Psycho to a new generation. But this turned into a total insult and slap to the face of the original Psycho. I know this has been said, but I watched the making of this film, and the director was like \"Oh, I just want to update it and shoot each scene shot by shot like the original\"... what's the friggin' point?! OK, but I want to judge this movie on it's own, despite it's insulting blows the original. I mean, the acting wasn't up to par, but honestly, it looked like the actors just watched the original and just memorized the lines from there and made it their crappy own. Watching the making of this film, I wanted to slap Anne Hasche, she said \"I've never seen the original, I just wanted to work with Gus.\" Ooh, that made me angry, because frankly, it's not just that, she really sucked in this role as Marian, she wasn't convincing, not to mention her shower scene really was horrible. Vince Vaughn didn't make... let's just put it this way, the film was horribly miscasted. This was a sin against film and on it's own, this was actually a bad movie. It was too much and destroyed what could've been a new introduction for a new generation. But to Gus, leave the film making the one's who KNOW WHAT THEY'RE DOING! 1/10",
         "Well, I have to agree with the critics on this one, who all said \"leave it alone.\" Why they had to make this re-make of the 1960 \"Psycho,\" I don't know. My guess is they wanted to reach a new audience and thought color and modern-day actors were the answer, since those were the main changes. The dialog was the same and the story the same. On one hand, I applaud them for not making this over with a lot of profanity and nudity and making it a sleazy film. Yet, if they were going to keep everything the same, why bother when you weren't going to improve on Tony Perkins, Janet Leigh and the original cast? Did they honestly think Vince Vaughn was going to be as good or better than Perkins? Are you kidding? Ann Heche, with her short mannish-haircut, is going to be better than Leigh? I don't think so! Yes, the colors were pretty in here but it's the black-and-white photography that helped make the 1960 version so creepy to begin with. It's perfect for the story, not a bunch of greens and pinks! Once again, I guess the filmmakers were banking on an audience that never saw the original. This was just a stupid project that never should have gotten off the ground.",
         "I know that the original Psycho was a classic and remaking it was a mistake, ESPECIALLY a shot-by-shot remake. I think that that has been more or less proven by the rest of the comments here. But there's far more wrong with this movie than just that. The first problem is the color. The original film was shot in black and white but, what few people realize is, the original was shot AFTER color film had been invented. The choice of black and white film was partially a budget concern, but it was also a stylistic choice of Hitchcock's. Now, this is not to say that the remake should have been redone in black and white, but the colors of this movie are all too wrong. The most predominant colors in the film are orange and green, particularly on Marion who is not supposed to be a flashy character. The bright colors make it look like a happy movie and, when horrific events take place in these color schemes, it looks like a cartoon more than anything and the audience is inclined to laugh rather than scream. The second problem is the lighting. This is a dark dark tale which should be highlighted by dim lighting, but this remake seemed not only to fail in this but seemed to go in the OPPOSITE direction. Most of the scenes are very brightly lit, even at times when it is illogical to do so because it's at NIGHT! Another obvious problem is Vince Vaughn's performance. Yes, he does pull off Norman Bate's awkwardness and madness quite well, I don't deny him that. But there is one element to the character that he failed to show: the softness. There should be a certain deceptive friendliness to the character, at least at first, which then fades away once we realize the truth about him. Beyond being a character trait of Norman Bates, this is a recognized character trait of ALL PSYCHOPATHS!!!! There are a few good aspects of this film. Some of the performances are great. As I said, Vince Vaughn came very close to pulling off a decent portrayal of Norman Bates. Viggo Mortensen and Juliane Moore were great together and their chemistry was very different from the characters in the original, which was a welcome change. Anne Heche may have been atrocious but, unlike Janet Leigh who was untruthfully advertised as one of the biggest stars of the film, Anne Heche was given last billing in the opening credits. I read on the cover of a copy of the Psycho novel that Gus Van Sant claimed this was not a remake of the Hitchcock film but rather a new adaptation of the original novel. I now wish that I had bought that book and saved the comment because, after seeing this film, that comment is quite possibly the funniest thing I have ever seen. There was no attempt in this film to disguise the fact that it was a rip off of the original, and it would be far more believable if Van Sant had tried to tell us that he was really a three ton ape from the planet Zafroomulax. So many shots were copied exactly without any actual thought as to why Hitchcock had composed the original shot in that way. Such as the scene in which Sam and Lila are talking while their faces are entirely covered in shadow. Hitchcock covered these actors' faces in shadow because he thought they were bad actors and wanted to hide their faces so nobody could see their awful performances, not because of any artistic or stylistic purpose. In other words, my review is about as pointless as the movie itself in that it replicates something that's already been said. Like everyone else here, I reccommend you don't waste your time on this film and get the original.",
         "The most disposable movie in the history of cinema?This one is a strong contender!Why wasting so much money for such a pointless useless work? The only difference between the HItchcock classic and this poor imitation is color,wide screen and Leila's Walkman!!A movie which's supposed to generate thrills and fear leaves me completely indifferent. Now you' re going to tell me it will urge the young generations to see the original?balderdash!This \"psycho 1998\" is a giant spoiler. They could have done something different,for instance ,by casting an actor closer to Bloch 's Bates ,an obese man.They content themselves with an obnoxious rehash!A pox on it!and long live Alfred Hitchcock!"
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Imagine Entertainment"
      ],
      "summaries": [
         "Marion Crane steals a lot of cash from a man whom her boss is in business with. On the way to see her boyfriend, she stops off by an old motel, run by the odd Norman Bates. She is murdered in the shower. Her sister, boyfriend, and a private investigator try to find out where she is, while we learn more about Norman Bates.",
         "A remake of Alfred Hitchcock's Psycho, the film is about Marion Crane, who after stealing $40,000 cash, leaves town and ends up at the Bates Motel where she meets the troubled Norman Bates who seems to be dominated by his mother.",
         "In this remake of Alfred Hitchcock's masterpiece, Anne Heche takes over Janet Leigh's role of Marion Crane, a young secretary whose boyfriend, Sam Loomis, has troubles paying off a debt and his wife's alimony. One day, a rich client of her boss buys a house with $400,000 in cash. To fix her problems, Marion steals the money and heads out to California to live her dream life with Sam. But she gets lost in a bad storm and stops at the Bates Motel, where the proprietor, Norman Bates, lives a very troubled life with his dominating mother, whom he lives with in their house on the hill next to the motel. A week later, Marion has vanished and no one can find her or the stolen money, not even Sam, her sister, Lila, or a private detective who has been hired to find Marion and the money. But a deadly secret is waiting to be discovered inside the Bates house.",
         "A young female embezzeler arrives at the Bates Motel which has terrible secrets of its own."
      ],
      "budget": 20000000
   },
   "movielensId": 2389,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-04",
      "dvdReleaseDate": "1999-06-08",
      "directors": ["Gus Van Sant"],
      "runtime": 105,
      "movieId": 2389,
      "title": "Psycho",
      "mpaa": "R",
      "actors": [
         "Vince Vaughn",
         "Anne Heche",
         "Julianne Moore",
         "Viggo Mortensen",
         "William H. Macy",
         "Robert Forster",
         "Philip Baker Hall",
         "Chad Everett",
         "Rance Howard",
         "Rita Wilson",
         "James Remar",
         "James Le Gros"
      ],
      "imdbMovieId": "0155975",
      "originalTitle": "Psycho",
      "genres": [
         "Mystery",
         "Thriller",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "Z1qVzqMG4VQ",
         "mnMPY-6m_gQ"
      ],
      "plotSummary": "Criminal on the run, Marion Crane takes refuge at the motel operated by Norman Bates - a troubled man whose victims encounter a grisly fate at the hands of his \"mother.\" Marion soon becomes the next victim and her disappearance prompts inquiries from her sister and a private investigator. They both soon discover the morbid bond linking Norman to his mysterious \"mother\" at the Bates Motel.",
      "tmdbMovieId": 11252,
      "avgRating": 2.82503,
      "releaseYear": "1998",
      "numRatings": 3512,
      "posterPath": "/5emaTTGS8rnLgZrBS98zqv1XWqE.jpg"
   }
}