{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "christmas party",
            "id": 1441
         },
         {
            "name": "loss",
            "id": 6203
         },
         {
            "name": "snowman",
            "id": 10115
         }
      ],
      "imdb_id": "tt0141109",
      "video": false,
      "title": "Jack Frost",
      "recommendations": [
         9021,
         9446,
         11395,
         13673,
         332,
         11637,
         888,
         12139,
         13767,
         9574,
         9279,
         3050,
         11011,
         9449,
         10510,
         6283,
         20737,
         6878,
         9822,
         11158
      ],
      "backdrop_path": "/15FdBioriLIBiJqG3MFBlNGgHzp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jack Frost",
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf0e7",
               "name": "Michael Keaton",
               "profile_path": "/myVdrYNGTgqunLfUSaM8DuVD7DL.jpg",
               "id": 2232,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gabby Frost",
               "gender": 1,
               "credit_id": "52fe4525c3a36847f80bf0eb",
               "name": "Kelly Preston",
               "profile_path": "/kxTQVsfZkI3DdzBqutw4zZapRB.jpg",
               "id": 11164,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mac MacArthur",
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf0ef",
               "name": "Mark Addy",
               "profile_path": "/tGWYaLPIGvPJiKx9KzTBMITo7uK.jpg",
               "id": 13633,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Charlie Frost",
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf117",
               "name": "Joseph Cross",
               "profile_path": "/i2W2NGZwYm9Lep0ytHZ8XPN6lno.jpg",
               "id": 33528,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Sid Gronic",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf11b",
               "name": "Henry Rollins",
               "profile_path": "/2E0cZdoJsdt1Lv4waG3s6fsfJeU.jpg",
               "id": 9290,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Natalie",
               "gender": 1,
               "credit_id": "52fe4526c3a36847f80bf11f",
               "name": "Mika Boorem",
               "profile_path": "/amQuR9PGz0yt6IXNnwLOAEkfPcq.jpg",
               "id": 21027,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Tuck Gronic",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf123",
               "name": "Andrew Lawrence",
               "profile_path": "/uRBbgjhqqWhxm7v61MGD9ze09OT.jpg",
               "id": 16479,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Spencer",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf127",
               "name": "Eli Marienthal",
               "profile_path": "/eK4kfRpE12lCoCamBJWyHfWDDbq.jpg",
               "id": 116027,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf12b",
               "name": "Will Rothhaar",
               "profile_path": "/xWcCuxFOrFNhrWM2eUqGjI8kL13.jpg",
               "id": 149484,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Rory Buck",
               "gender": 2,
               "credit_id": "52fe4526c3a36847f80bf12f",
               "name": "Taylor Handley",
               "profile_path": "/qLJg0e7ObS8YDmW1UxqVo5VOJ5Y.jpg",
               "id": 66741,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Audience Member",
               "gender": 0,
               "credit_id": "54b09089c3a3680945000e5b",
               "name": "Paul F. Tompkins",
               "profile_path": "/io7wjqqVziL3P9Cg9myX46h9lTd.jpg",
               "id": 1219029,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "John Kaplan",
               "gender": 2,
               "credit_id": "54b090adc3a368094e000fea",
               "name": "Dweezil Zappa",
               "profile_path": "/d2HSXwuYiTKzL1Lo1IEtMsAa0WX.jpg",
               "id": 120952,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "TV Weatherman",
               "gender": 0,
               "credit_id": "54b090c5c3a368094e000fec",
               "name": "Jay Johnston",
               "profile_path": "/tez2yLdvX40JNvZVTePuEYecda0.jpg",
               "id": 1215262,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Spencer's Dad",
               "gender": 2,
               "credit_id": "54b090f4c3a3680939000dc4",
               "name": "Googy Gress",
               "profile_path": "/fSDIWq5MGkRRJn2Zmcl96t8JDg.jpg",
               "id": 93846,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Policeman Dave",
               "gender": 0,
               "credit_id": "54b09113c3a3680945000e6d",
               "name": "Wayne Federman",
               "profile_path": "/1nXstDwfsjg4h1HyYDTZsgiEy5r.jpg",
               "id": 170759,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Trevor (Lead Guitar)",
               "gender": 2,
               "credit_id": "54b0912bc3a3680940000d40",
               "name": "Trevor Rabin",
               "profile_path": null,
               "id": 894,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "School Teacher (uncredited)",
               "gender": 0,
               "credit_id": "5506e29792514179fb001f60",
               "name": "Moon Unit Zappa",
               "profile_path": "/g6y0u0G7wV1mbZqix3alTAjrBfX.jpg",
               "id": 140387,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf0f5",
               "name": "Troy Miller",
               "profile_path": null,
               "id": 58868,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf0fb",
               "name": "Irving Azoff",
               "profile_path": null,
               "id": 58869,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf101",
               "name": "Mark Steven Johnson",
               "profile_path": "/6trChNn3o2bi4i2ipgMEAytwmZp.jpg",
               "id": 16837,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf107",
               "name": "Trevor Rabin",
               "profile_path": null,
               "id": 894,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf10d",
               "name": "László Kovács",
               "profile_path": "/qvsRxyAPJw9Kv8ubV2AKWLiUcz8.jpg",
               "id": 8862,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4525c3a36847f80bf113",
               "name": "Lawrence Jordan",
               "profile_path": null,
               "id": 49286,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "54b091d8925141746c000cda",
               "name": "Mark Canton",
               "profile_path": null,
               "id": 46088,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 6.197698,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9745,
      "vote_count": 339,
      "budget": 27000000,
      "overview": "A father, who can't keep his promises, dies in a car accident. One year later, he returns as a snowman, who has the final chance to put things right with his son before he is gone forever.",
      "similar": [
         10147,
         17979,
         11395,
         9279,
         13673,
         9021,
         1585,
         8871,
         9479,
         634,
         51052,
         1581,
         296100,
         5255,
         10719,
         858,
         425,
         637,
         675,
         772
      ],
      "original_title": "Jack Frost",
      "runtime": 101,
      "poster_path": "/cPmO5VZhqN4ocrgxjGaFmLeMREv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Canton Company",
            "id": 22351,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Azoff Entertainment",
            "id": 10619,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-12-10",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Jack Frost is getting a second chance to be the world's coolest dad... if he doesn't melt first.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Troy Miller"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Mark Steven Johnson",
         "Mark Steven Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0141109/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5MTY3NDE0NF5BMl5BanBnXkFtZTcwNTc4NjEyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Keaton, Kelly Preston, Joseph Cross | See full cast and crew »"],
      "reviews": [
         "This movie is a really cute movie and a great one to watch around the holidays with your family. It's not too cute though so that it becomes unlikable. It was interesting to see Michael Keaton in the Dad role (I've never him as anything besides Batman) and I think he made a really good Dad. I liked the way they dealt with death, it had a very real sense about it. Which is strange, because you have the Dad come back as a SNOWMAN (hah) but once you get over that (it does take a little while, don't give up) it becomes really nice. I like the ending - I guess I shouldn't give it away, but it was sweet without being corny. There is a really thin line between cuteness and overkill, but this movie is still on the cute side. (I gave it 9/10.)",
         "What I thought was essentially a kids' movie turned out to be a much more pleasurable experience. I know, I may be biased a bit towards anything MK-related, however even my best friend (who was with me at the time when we saw it) liked it a lot, even if we saw it closer to Summer rather than Christmas (it came out in Malta, Europe - where I was still living at the time - like some 6 months after it came out in the US!). Anyway, Michael Keaton yet again gives a great performance as a 'snow'man trying quite desperately to make up for lost time. Kelly Preston is good too as his wife and the kid is ok-ish (we've seen much better kid actors, in my opinion). It's only Mark Addy who seems like a fish out of water and looks like he's only in it either because he's a friend of the director or something! He just doesn't seem to gel! All in all, a very cute and neat movie, with good work from Keaton and a rocking good soundtrack, with tracks from the boys Hanson, among others, and Keaton himself raunchily singing a couple of tracks penned by someone from Yes. Great for a night in with the family.",
         "My daughter and I saw this movie today, and I actually say that it could as well be rated G, and that the message has been very good, specially for those whom never stop for a moment to evaluate which is more important in life: family, or work and finances. In real life we know it would be impossible to happen, however the motivation in this picture might wake some people up to reality, and more home dedication. Very well done.",
         "Ok.. This movie seems to be getting a rash of negative reviews. 1).Bad special effects-this movie was NOT made to \"show-off\" special effects. I didn't go for the special effects 2).Lame story- why did you go to the movie in the first place when you knew it was about a deceased dad coming back as a snowman. I didn't go hoping for a realistic plot. 3) Bad acting- Did you actually expect to see an Oscar nominated performance from a talking snowman. Lay off the negative aspects and enjoy the movie for what it is. I obviously had reservations about going to see this movie, but our 2 1/2 year old daughter wanted to go. She wanted to go to see Jack Frost, the snowman. Hey, a movie of a real live snowman - Is this what it really is about? This movie has a story to tell. And that is what makes this movie a little more special. For those of you who overlook or can't see the meaning of the story, probably do the same with the 'magical' season it is intended to represent. *** out of *****",
         "This film definitely deserves higher marks, I don't know why anyone would give it a 1??? I was going to give it a 9, but decided on a 10 to bring up the percentage- help me out people! There is something for everyone in this movie, fun snow action for the kids, lessons on being a good friend and sticking up for others, lessons on being a good father, and a great soundtrack including some pretty good blues tunes! This movie also dealt with the death of a loved one in a very real way- not bad for a comedy/drama. I've always liked Michael Keaton and he doesn't disappoint me here.",
         "I have been resenting this movie for the longest time. But I should have seen it before today...but I shouldn't trash what I haven't seen, right? Because it was a good movie. I happened to catch it on HBO Plus today...it kind of dragged on a little bit, but other than that...ok, I have to admit it, it was kind of touching. I think I saw one review trashing the special effects...come on, how low can you go? I think the people that hate this movie had to have seen a LITTLE bit of something that they liked...it's a family movie that appeals to kids and adults, and that's what I think it did. I will leave it as that. A great Christmas movie. 7.5/10",
         "Sorry everyone, but I liked this movie. I even cried at the end. My kids freaked when the snowman started to talk and move - one of them got scared by a guy in a teddy bear suit when she was about 3, and she hasn't got over it yet (2 yrs later). They had loved the start of the movie, with the snowball fight and building the first snowman, but as soon as the second snowman came to life we had to turn the video off. I couldn't believe in Kelly Preston as the mother of an 11-yr-old boy, but in spite of that the casting was great. And Michael Keaton with blond hair is such a hunk . . . Give it a go!",
         "Jack Frost, is a great holiday flick to watch around the Christmas season Michael Keaton played the role of the main character pretty well it was amazingly good. This story is about a musician whose trying to make it big in the music business and provide a good life for his wife Gabby (Preston) & their son Charlie (Cross). However he has a tiny problem keeping promises and missing out on important events. Things take an unexpected turn when Jack dies in a car accident before Christmas, one year passes and Charlie still misses him very much. After building a snowman something mysterious happens the snowman comes to life with the spirit of his father in it. Now Jack has the chance to make up for lost time and bond more with his child before disappearing forever. My favorite scene is when Charlie & his mom see Jack's spirit for the last time before saying goodbye that made me cry a bit. This movie is so wonderful and it has an important message it's never too late to spend more time with your family all in all it's a fantastic flick to watch with your family.",
         "Jack Frost is a happily married man, with a son. Until, one stormy night, Jack dies and a year later he is given the chance to come back as a snowman to visit his wife, Gabby and son, Charlie. Jack Frost is a really sad film but a great one, at that. Michael Keaton, Kelly Preston, Joseph Cross and Mark Addy are just some of the brilliant cast included in this great film, which also has some really great music. I give Jack Frost a well deserving 10/10. This film is a must-see for everyone.",
         "I will never understand why so many viewers dislike \"Jack Frost.\" It is a movie with heart warming and refreshing storyline. Michael Keaton stars as Jack Frost in this awesome movie about getting a second chance at being the world's greatest dad. Kelly Preston, Joseph Cross and Mark Addy co-star. I first noticed Joseph Cross, Charlie Frost, in the 100th episode of \"Touched By An Angel\" and since then I knew he was a talented young actor. Cross once again teamed with Keaton in \"Desperate Measures\" another awesome movie overlooked by the viewing audience. \"Jack Frost\" is the kind of movie that has heart-warming moments intertwined with comedic wit. Keaton and Cross seem to have a lot of fun making this movie together and it showed in their performances. Scenes like the one that had Jack Frost throwing snowballs at the school bully and his friends as well as the chase that followed made it all worthwhile to see because this is what makes movies so good. Watching this movie, it reminded me of \"Ghost\" because of its sweeping and heartwarming storyline. Chemistry is one of the elements I look for in a great movie. \"Jack Frost\" has this element and more. While an unusual but a brilliant pairing, Keaton and Preston bring chemistry to \"Jack Frost,\" a movie that seems to be better than others I've seen before. I think Michael Keaton is one of the best actors I've seen and his performance in \"Jack Frost\" is one of his best films to date so WATCH it."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Azoff Entertainment",
         "Canton Company, The"
      ],
      "summaries": [
         "Jack Frost is a singer who's on the road most of the time so he can't spend a lot of time with his son Charlie, although they love each other very much. When Jack dies in a car accident, Charlie becomes a very sad young man, until... Jack returns as a snowman! Now they can do all the things they've missed when Jack was human, but what will people think when they see Charlie talking to a snowman and what will happen when the weather gets warmer?",
         "A father, who can't keep his promises, dies in a car accident. One year later, he returns as a snowman, who has the final chance to put things right with his son before he is gone forever."
      ],
      "budget": 27000000
   },
   "movielensId": 2392,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-10",
      "dvdReleaseDate": "1999-11-02",
      "directors": ["Troy Miller"],
      "runtime": 101,
      "movieId": 2392,
      "title": "Jack Frost",
      "mpaa": "PG",
      "actors": [
         "Michael Keaton",
         "Kelly Preston",
         "Mark Addy",
         "Joseph Cross",
         "Henry Rollins",
         "Mika Boorem",
         "Andrew Lawrence",
         "Eli Marienthal",
         "Will Rothhaar",
         "Taylor Handley",
         "Paul F. Tompkins",
         "Dweezil Zappa",
         "Jay Johnston",
         "Googy Gress",
         "Wayne Federman",
         "Trevor Rabin",
         "Moon Unit Zappa"
      ],
      "imdbMovieId": "0141109",
      "originalTitle": "Jack Frost",
      "genres": [
         "Comedy",
         "Family",
         "Drama",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["ZFoWiUqrhoE"],
      "plotSummary": "A father, who can't keep his promises, dies in a car accident. One year later, he returns as a snowman, who has the final chance to put things right with his son before he is gone forever.",
      "tmdbMovieId": 9745,
      "avgRating": 2.39932,
      "releaseYear": "1998",
      "numRatings": 1917,
      "posterPath": "/cPmO5VZhqN4ocrgxjGaFmLeMREv.jpg"
   }
}