{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "challenge",
            "id": 5399
         },
         {
            "name": "change",
            "id": 6223
         },
         {
            "name": "religion",
            "id": 11001
         },
         {
            "name": "suburb",
            "id": 14632
         },
         {
            "name": "church",
            "id": 14765
         },
         {
            "name": "belief",
            "id": 187343
         },
         {
            "name": "masses",
            "id": 217325
         }
      ],
      "imdb_id": "tt0087688",
      "video": false,
      "title": "Mass Appeal",
      "recommendations": [],
      "backdrop_path": "/zOVRIpPnsglBCMRBIFvyGP8uzhR.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Father Tim Farley",
               "gender": 2,
               "credit_id": "52fe4ae0c3a36847f81e64c9",
               "name": "Jack Lemmon",
               "profile_path": "/chZmNRYMtqkiDlatprGDH4BzGqG.jpg",
               "id": 3151,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mark Dolson",
               "gender": 2,
               "credit_id": "52fe4ae0c3a36847f81e64cd",
               "name": "Zeljko Ivanek",
               "profile_path": "/bQbyb11FgEPwNSfFeb6ChTfkqEM.jpg",
               "id": 6752,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Monsignor Thomas Burke",
               "gender": 2,
               "credit_id": "52fe4ae0c3a36847f81e64d1",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Margaret",
               "gender": 1,
               "credit_id": "52fe4ae0c3a36847f81e64d5",
               "name": "Louise Latham",
               "profile_path": "/eEWubDJHN9YwfEdUAbJm4moyqjj.jpg",
               "id": 6932,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mrs. Hart",
               "gender": 1,
               "credit_id": "52fe4ae0c3a36847f81e64d9",
               "name": "Alice Hirson",
               "profile_path": null,
               "id": 14106,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4ae0c3a36847f81e64c5",
               "name": "Bill C. Davis",
               "profile_path": null,
               "id": 1050181,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4ae0c3a36847f81e64df",
               "name": "Glenn A. Jordan",
               "profile_path": null,
               "id": 30038,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.588735,
      "production_countries": [],
      "id": 110643,
      "vote_count": 3,
      "budget": 0,
      "overview": "A young seminarian rattles the established order at a Catholic parish run by an older pastor. (TCM.com)",
      "similar": [
         9946,
         13363,
         1023,
         1813,
         324786,
         615,
         145,
         1832,
         310,
         583,
         5876,
         9945,
         9411,
         335778,
         7340,
         48171,
         193687,
         205220,
         184346,
         2331
      ],
      "original_title": "Mass Appeal",
      "runtime": 99,
      "poster_path": "/yyCXkzmi8jChDD6qSmhD2QVs1E.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1984-12-14",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Glenn Jordan"],
      "runtime": 99,
      "synopsis": null,
      "writers": [
         "Bill C. Davis",
         "Bill C. Davis"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0087688/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMDg5OTQ5N15BMl5BanBnXkFtZTYwNzY4Nzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jack Lemmon, Zeljko Ivanek, Charles Durning | See full cast and crew »"],
      "reviews": [
         "I consider this film to be a real little gem -- unlike the original Broadway production. Its premises ring true and the ensemble acting is superb. Lemmon and Ivanek are extremely well matched as lost or submerged parts of the other in this cautionary tale about mainstream religion straining at the limits of its ability to accommodate and hold accountable truths found in the \"wider\" world. Lemmon's performance, especially, is artless and memorable, avoiding sentimentality and undue predictability. It is most unfortunate that in the days after Lemmon's death that no reviewer of his oeurve decided to cite this film or show clips from it in describing the actor's versatility and \"every-manness.\" It should not be missed; so compelling is the uneasy and finally transformative relationship between the two men that one is left wondering what happens to both priest and seminarian in the years that follow. Rent this of a Sunday afternoon when you're longing to experience some rising spirit.",
         "\"Mass Appeal\" is enjoyable on several levels. It works as an examination of the depth of contemporary religious beliefs and their current role in our society, as an indictment of an inflexible system (the Catholic church), and as a comment on the travails of two very different men (ostensibly of the same \"cloth\") seeking spiritual happiness. Unfortunately, as a \"mass appeal\" film, not all of the issues are satisfactorily handled, but the film is entertaining nonetheless. Greg Cundiff's excellent review neatly summarizes some key plot issues and holes. For example, I found Ivanek's/Dolson's devotion and desire compelling, but what on earth would make him think that a parish of strangers would listen to his excoriations and then embrace him as their pastor? I agree with Cundiff that the lack of clarity surrounding this fundamental plot point does not help the film. I was also disappointed that Durning's character was unambiguously drawn as the heavy. A more balanced approach may have helped here. Farley's attempt at leading a discussion of the role of women priests is unusually framed, but ultimately leaves the viewer desiring a more compelling resolution to the issue. Strongly on the plus side, Lemmon is an excellent choice for the lead (whi ch allows him to display his comic and dramatic talents equally). Farley's story is as compelling as Dolson's, and Lemmon squeezes every drop of drama from the script. His final \"mass appeal\" is quite affecting. Ivanek is intense as Dolson, but Charles Durning's role could be played by anyone. The film is nicely \"shot\" and has an exhilarating soundtrack at points. A \"7\" out of \"10.\"",
         "Last night we showed `Mass Appeal' at our parish's monthly Movie Night - REEL Conversations. There was a mixed reaction from the viewers and some lively discussion afterwards. Some questioned why Hollywood has trouble portraying Catholics (priests, monsignors, laity) in a positive light. We had difficulty coming up with a movie that showed a believer acting like a true believer. In this film, for example, in times of crisis or need, the characters don't turn to prayer for God's help. Seemed odd. We very much enjoyed the dialog between the mentor priest and young seminarian. It was interesting to see the roles of the two alternate throughout the movie. Plenty of still-pertinent topics they covered (authority of the church, power, homosexuality, celibacy, sin, being lukewarm in one's faith) with some very interesting outcomes. All in all, an enjoyable film with moments of great humor and warm sentiment. A fine choice for a group discussion. One that challenges your faith and is encouraging to those who believe.",
         "Jack Lemmon shines as Father Farley, a spineless priest who'll say anything to anyone if it makes his life easier. Through a series of circumstances, he has to face himself as a result of being \"assigned\" Mark Dolson as a deacon. When I first watched this movie, I was disappointed by the ending, because it didn't seem to resolve the main issue (which concerns Mark Dolson). But eventually I realized that it issue was Father Farley, and his spinelessness, and Mark Dolson was merely the means by which Farley is brought to terms with himself. My second favorite movie of all time.",
         "Father Farley drinks a little. He also goes to the races, is bad with first names, and tells \"little lies\" to get him out of tricky situations, like those involving domestic quarrels and slideshows with Monsignor Burke. But his parish loves him. Then he is assigned to look after a passionate young deacon who challenges him to step out of his blissful rut. Jack Lemmon gives a very lived-in, often moving performance as Father Farley, and the best moments of \"Mass Appeal\" give us a chance to see Lemmon in his seriocomic element. But the film as a whole feels less smooth. Though it raises questions about saying what one believes versus being popular, \"Mass Appeal\" struggles to find a balance of its own, whether it wants to be a Neil Simon-style light comedy or a searing examination of the Catholic Church today. Still, \"Mass Appeal\" is more good than not. It deals knowingly with the concepts of Catholicism, and hones in on the charms and pitfalls of the parochial life with small-bore detail. \"Did I tell you about the coughs?\" Father Farley tells the deacon, Mark Dolson (Zeljko Ivanek), cluing him in on one of the telltale signs a sermon-giver is losing his congregation. When giving a sermon, never say \"you,\" always say \"we.\" Less confrontational that way. The problem is that Dolson is all about confrontation. He already has Monsignor Burke (Charles Durning) fuming about being called a \"homophobic autocrat\" for kicking out a pair of seminarians suspected of sleeping together. Dolson speaks in favor of the ordination of women, tells Farley he'd be a better priest if he drank less, and calls out the congregation during one sermon for their mink hats and blue hair. Farley squirms from his seat behind the altar while his acolyte implodes in the pulpit, ignoring his hacking throng. \"We'll be going out the back today,\" he mutters to an altar boy in a classic Lemmon aside. My main problem with \"Mass Appeal,\" as noted by other posters, was that I was never sold on Dolson's reason for becoming a priest. He seems more like a mouthpiece for Bill C. Davis, adapting his Broadway play, to vocalize his concerns about the church's position on wedge issues like celibate gays in the clergy. Ivanek plays him as a character who acts more from anger than conviction, which seems a wrong choice. You don't have to be an autocratic homophobe to think this guy, celibate or not, will have problems with his priestly office somewhere down the road. There's a frostiness to Ivanek's scenes with Lemmon that's off-putting, and the sentiment squeezed out of them sometimes feels stagey and forced. Director Glenn Jordan worked mostly in TV movies, and while he frames his scenes well and builds a good pace, there's often a pedestrian quality to the overall presentation. You can't stick in a car chase with a film like this, but there are too many talking-head shots. The best parts of the movie are Lemmon's scenes with Monsignor Burke, which Durning invests with his typical mix of menace and affability. Not just a heavy, Durning plays him as a bit lost. Burke really likes Farley but alienates him at the same time with his bullying, as subservience is the only kind of devotion this sacerdotal relic understands. When Dolson calls him out on his harshness, Burke targets him for his frankness and justifies his vendetta as churchly devotion. One wishes Davis made Burke more than the bad guy, perhaps found a way to make him a more active player in the spiritual journeys of Farley and Dolson, journeys left largely unexplored here. Instead he's made the object of anger for the other characters, and even has a wormy henchman on call. Didn't Burke have his days as a lost seminarian, too? \"Mass Appeal\" gets by with its light charm, its probing and atypical focus on the Catholic faith in practice, and most especially Lemmon's strong central performance. Even if you don't like Lemmon in every film of his you see, it's safe to say you will like him here. Sometimes it takes a lesser film to display a great actor, and that's what you get here.",
         "MASS APPEAL (3 outta 5 stars) You know, there probably isn't a movie Jack Lemmon has ever made that isn't worth watching... if only for his being in it. For instance, Mass Appeal isn't much of a movie... it was based on a minor play and outside of two showy roles for a couple of capable performers it doesn't seem to have much point. Luckily Jack Lemmon and Zeljko Yvanek are up to the task and the movie is a pleasant enough diversion... even if it does strain credulity at times. Lemmon is a well-established, beloved Catholic priest who is given the task of honing the skills of an opinionated, headstrong, young man fresh from seminary school. Lemmon has one month to shape him up or ship him out. A minor scandal erupts when young Ivanek defends a pair of ex-homosexuals that he went to school with and who have been expelled... then his own sexuality is brought into question. Good dialogue but the movie plays itself out predictably. Not a classic but definitely worth checking out.",
         "Mark Dolson (Zeljko Ivanek) wants to be a priest because, as a child, someone boiled his goldfish. The alternate version is as uninspired - because he does not find fulfillment in intimate relationships with either sex, he is qualified for the priesthood. At any rate, he says that he wants `to help people.' A bit of a loose cannon, Dolson is sent by the Monsignor to serve as deacon for the now jaded Father Farley (Jack Lemmon). What ever his faults may be, Dolson is impassioned. He wants to make a difference. The problem is that it is unclear as to whether the priesthood is the place for him to do it. As a vehicle for exploring the question of gays (or women for that matter) in the Roman Catholic priesthood, Mass Appeal is lacking because of this lack of clarity. His lack of a clear `call' is foregrounded by his lackluster attempts at sermons. All Mark knows is that he wants to move people. He is uncertain about where his congregation is, or where he wants to move them. Farley steps in to suggest that he go for beloved. Hence the play on words in the title. Farley wants Mark to gain Mass Appeal by making the Mass appealing: if someone finds God in the process, hey that's ok too. Dolson will have none of this and founders. Farley's appeal is that he knows the system. One gets the impression that he wants someone to rock the boat. Of course the irony of the situation is that in order to shake up the system, one must first join it. Does this film have a meaning or a message? Well yeah, it does. But that is something for each viewer to figure out for him or herself. It won't make you hate or love the church (any church \u0096 this one just happens to be Roman Catholic). Did I like the film? Yes. Is it my favorite? No \u0096 not even close. It is a study of idiosyncrasies and harmless little lies (`I didn't know there was such a thing,' says Dolan). Jack Lemmon is in it for goodness sake, what else could you want?",
         "As yet another \"lapsed Catholic,\" I can say that I loved this film when I first saw it 20 years ago. And today, given the current state of the Catholic Church in America, it is even more relevant. The issue of homosexuality in the priesthood is raised, and handled in a sensible way. \"Celibacy is celibacy.....even if your thing is goats.\" Were only the Vatican of 2005 so sensible. But the strength of the movie is a glimpse into the life of a parish priest. A flawed man...certainly...in many ways. But who among us is not flawed in some way. Not a particularly profound movie. But an entertaining one; and one which does raise issues for Catholics (and lapsed Catholics) to think about. For me, if I lived near St. Francis, I would probably stop. For the dialogue sermon.....and the Maryknoll Marionettes.",
         "Mark Dolson is an eager Catholic seminarian who throws himself-- body, mind, and emotion-- fully into everything he does. Father Tim Farley has fallen into a comfortable rut in his suburban parish, where he is loved and valued precisely because he doesn't make waves. Mark torments his teachers with unanswerable questions and unending intellectual debate. Father Farley relies on practiced clichés and vanilla humor to fill the air during the sermon slot of his morning services. When no other priest will take Mark on as a parish intern, the bishop gives him to Father Farley. The pairing of Zeljko Ivanek and Jack Lemmon is perfect in this character-driven film. The characters are multi-layered, and the issues they wrestle with are as pertinent now as they were in 1984.",
         "Pity the poor congregation of St. Francis Parish, subject to \"dialogue sermons\" (what???), autobiographical psycho-babble and in the end, self-righteous calls to rise up against the local Church hierarchy. If things are really like this in the Catholic Church today, its enough to make this lapsed Catholic stay that way for a long time. That said, and hoping that this does not mirror reality, the movie works as entertainment, largely due to the performances of the two main characters. Jack Lemmon is delightful and convincing as a lonely priest who has found strategies (some decent ones, some hurtful) to survive who takes on the task of mentoring and tempering the well-meaning but naive passions of a young seminarian, also well played. The big casualty is in the one-dimensionality of the \"heavy\" played by Charles Durning, and perhaps of all of his cronies as well. Well, Catholic bashing is nothing new, mostly by ex-Catholics, but it always diminishes the dialogue such issues could provoke. However, there is more to the movie than this, especially in some very good characterizations of Catholic lay people, Louise Latham's housekeeper in particular."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "David Foster Productions",
         "Jalem Productions",
         "Operation Cork"
      ],
      "summaries": ["A popular Connecticut priest shields a seminary rebel from the wrath of a stern monsignor."],
      "budget": 0
   },
   "movielensId": 2397,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1984-12-14",
      "dvdReleaseDate": null,
      "directors": ["Glenn A. Jordan"],
      "runtime": 99,
      "movieId": 2397,
      "title": "Mass Appeal",
      "mpaa": "",
      "actors": [
         "Jack Lemmon",
         "Zeljko Ivanek",
         "Charles Durning",
         "Louise Latham",
         "Alice Hirson"
      ],
      "imdbMovieId": "0087688",
      "originalTitle": "Mass Appeal",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young seminarian rattles the established order at a Catholic parish run by an older pastor. (TCM.com)",
      "tmdbMovieId": 110643,
      "avgRating": 3.32249,
      "releaseYear": "1984",
      "numRatings": 169,
      "posterPath": "/yyCXkzmi8jChDD6qSmhD2QVs1E.jpg"
   }
}