{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "barn",
            "id": 3875
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "reindeer",
            "id": 10385
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0098115",
      "video": false,
      "title": "Prancer",
      "recommendations": [
         166680,
         7234,
         38716,
         86726,
         56931,
         52745,
         7237,
         99914,
         26542,
         99008,
         128780,
         31265,
         31124,
         22466,
         36257,
         42699,
         55239,
         97421,
         42015,
         90450
      ],
      "backdrop_path": "/44NCtACvtuUwuysdxuFWwvklWRN.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Riggs",
               "gender": 2,
               "credit_id": "52fe44b1c3a368484e0318db",
               "name": "Sam Elliott",
               "profile_path": "/f2AxZZ6d0Cit0tmf6wYTHcGfwT9.jpg",
               "id": 16431,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mrs. McFarland",
               "gender": 1,
               "credit_id": "52fe44b1c3a368484e0318e3",
               "name": "Cloris Leachman",
               "profile_path": "/8ByYhjEHavhZiQYriHVXsWUfu8c.jpg",
               "id": 9599,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Aunt Sarah",
               "gender": 1,
               "credit_id": "52fe44b1c3a368484e0318ef",
               "name": "Rutanya Alda",
               "profile_path": "/gVOyv8nNYwXmQU7kixKxILUMM50.jpg",
               "id": 80135,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Orel Benton",
               "gender": 2,
               "credit_id": "52fe44b1c3a368484e0318e7",
               "name": "Abe Vigoda",
               "profile_path": "/luWKPNb58IgJ2ovrtgPAzHGLLYL.jpg",
               "id": 3093,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mr. Stewart / Santa",
               "gender": 2,
               "credit_id": "52fe44b1c3a368484e0318eb",
               "name": "Michael Constantine",
               "profile_path": "/fZXfSyDEeIWzGudVhgwG3f9HTl0.jpg",
               "id": 14884,
               "order": 4
            },
            {
               "cast_id": 2,
               "character": "Jessica Riggs",
               "gender": 1,
               "credit_id": "52fe44b1c3a368484e0318df",
               "name": "Rebecca Harrell Tickell",
               "profile_path": "/hovpCxPqtcSdkvfaAlAu9uEE0on.jpg",
               "id": 93217,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Carol Wetherby",
               "gender": 1,
               "credit_id": "52fe44b1c3a368484e0318f3",
               "name": "Ariana Richards",
               "profile_path": "/b4S0q3uSDIophwYcPlBABgJObSX.jpg",
               "id": 4788,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Steve Riggs",
               "gender": 2,
               "credit_id": "577a03f89251413d02000450",
               "name": "John Duda",
               "profile_path": null,
               "id": 949848,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Herb Drier",
               "gender": 2,
               "credit_id": "577a047a9251413c730004ba",
               "name": "Mark Rolston",
               "profile_path": "/bsh3cqDNwVvux4NdaY1Bj4S7mNS.jpg",
               "id": 6576,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Billy Quinn",
               "gender": 2,
               "credit_id": "577a04b792514114c6001471",
               "name": "Johnny Galecki",
               "profile_path": "/iY3e0Zw5lygRO4BXbhcSxMcPEb9.jpg",
               "id": 16478,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Minister",
               "gender": 0,
               "credit_id": "577a04ec9251413b9900054c",
               "name": "Walter Charles",
               "profile_path": null,
               "id": 1218105,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Mr. Young",
               "gender": 0,
               "credit_id": "577a05249251413b740005a6",
               "name": "Victor Truro",
               "profile_path": null,
               "id": 163851,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Mrs. Fairburn",
               "gender": 0,
               "credit_id": "577a054f9251413b740005bc",
               "name": "Marcia Porter",
               "profile_path": null,
               "id": 1645076,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Mr. Soot",
               "gender": 0,
               "credit_id": "577a057c9251413b99000586",
               "name": "Loren Janes",
               "profile_path": "/vEZ5Wt10rP9culxXjXUBagIfNGU.jpg",
               "id": 951607,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Wagnall",
               "gender": 0,
               "credit_id": "577a05a19251413b740005f2",
               "name": "Robert Zimmermann",
               "profile_path": null,
               "id": 1645077,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Mrs. Hofsetter",
               "gender": 0,
               "credit_id": "577a05e292514114c6001506",
               "name": "Shirley Starnes",
               "profile_path": null,
               "id": 1645078,
               "order": 15
            },
            {
               "cast_id": 19,
               "character": "Bert",
               "gender": 0,
               "credit_id": "577a06319251413b74000641",
               "name": "Michael Luciano",
               "profile_path": null,
               "id": 91422,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b1c3a368484e0318f9",
               "name": "John D. Hancock",
               "profile_path": null,
               "id": 79726,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b1c3a368484e0318ff",
               "name": "Greg Taylor",
               "profile_path": null,
               "id": 56520,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "594682f7c3a3682619007353",
               "name": "Mikhail Suslov",
               "profile_path": "/nXPILx1AkuwzxKDG9yoYbgNloFQ.jpg",
               "id": 47947,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 4.724414,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 24951,
      "vote_count": 22,
      "budget": 0,
      "overview": "Jessica, the daughter of an impoverished apple farmer, still believes in Santa Claus. So when she comes across a reindeer with an injured leg, it makes perfect sense to her to assume that it is Prancer, who had fallen from a Christmas display in town. She hides the reindeer in her barn and feeds it cookies, until she can return it to Santa. Her father finds the reindeer an decides to sell it to the butcher, not for venison chops, but as an advertising display.",
      "similar": [
         9479,
         17979,
         51052,
         11395,
         13673,
         5375,
         1585,
         10147,
         13377,
         18147,
         287903,
         5255,
         772,
         8871,
         10719,
         364,
         634,
         338964,
         9279,
         9714
      ],
      "original_title": "Prancer",
      "runtime": 99,
      "poster_path": "/fMB3NytsHZrbb2ylntRFQtFhPPx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Raffaella Productions",
            "id": 35916,
            "origin_country": ""
         },
         {
            "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
            "name": "Orion Pictures",
            "id": 41,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cineplex-Odeon Films",
            "id": 5231,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Nelson Entertainment",
            "id": 365,
            "origin_country": ""
         }
      ],
      "release_date": "1989-11-17",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "They lost the true spirit of Christmas...And found it locked in the heart of one little girl.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John D. Hancock"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Greg Taylor"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098115/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEyOTgyNjk3N15BMl5BanBnXkFtZTcwMTMwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sam Elliott, Cloris Leachman, Rutanya Alda | See full cast and crew »"],
      "reviews": [
         "Some occasionally clumsy dialogue only mildly undercuts the virtues of Greg Taylor's thoughtful script, which provides a surprisingly realistic depiction of the joys and heartaches of simple lives at Christmastime. Rebecca Harrell is superb as 9-year-old Jessica, who finds an injured reindeer in the woods near her Michigan farm and determines to nurse it back to health in time to help pull Santa's sleigh on Christmas Eve. She's a marvelously realized character, refreshingly minus the cute kid mannerisms of many a Hollywood acting tyke. I particularly liked the way she deflected her father's tirades with her singlemindedness of purpose: he might get mad at her, but she was still going to do what she had to do. Very childlike, and very real. A subplot about Jessica's helping a reclusive, eccentric neighbor (played by Cloris Leachman in a virtual cameo) seems truncated and unnecessary, but for the most part Taylor's scenario sticks to the basics and is better for it. Characters surrounding Jessica act like real people, not stereotypes, and events transpire with a sense of realism, not melodrama. Credit for this tale's effectiveness also goes to Sam Elliott, who plays Jessica's father, a recent widower, with a harsh demeanor that seems to mask real pain and desperation. Thus his rapprochement with his wayward daughter carries unexpected depth of feeling and could not fail to move all but the most cynical. For a dad like me, I admit it put a big lump in my throat. Despite a somewhat flawed climax -- to my mind, the vfx shot of Santa's sleigh coursing across the sky is unnecessary, given the magic moment just prior to it that reveals reindeer hoofprints leading to a precipice -- this nice little holiday film delivers a timeless message about faith and selflessness. Recommended for mature kids of 8 or older.",
         "This film proves that there are still unspoiled hearts left on Planet Earth. Those who find it sappy or irrelevant have spent too much time wearing Grinch suits and need a good dose of humanity to thaw that hard matter in their chests that passes for a heart. The child actors are the heart of _Prancer_. They are real, never overacting or coming off as children playing at making a film. Sam Elliot is the epitome of the overstressed, depressed man who has lost his wife and despairs of losing everything else too. His transformation is believable and worthy of the time spent to watch his character unfold. Cloris Leachman is a delight as the female Scrooge who is touched by two children--Jessica who reintroduces her to the joy of Christmas, and a little boy in church who reintroduces her to the joy of human fellowship. Above all, this is a story of transition. The earnest child must move forward to knowledge, and the jaded grownup must move back to mystery and faith. If your Christmas is too much take and not enough give, I prescribe hot chocolate, hot buttered popcorn, and a viewing of Prancer with people you love. Better yet, do as we have and make this movie part of your personal holiday tradition. It might help make you a better person the rest of the year.",
         "Prancer is one of those special movies that come along every once in a great while that truly touches your heart. It doesn't rely on gimmicks or special effects, but relies on the characters themselves. Jesse, the central character in the story, finds an injured reindeer near her home, and believes it to be Prancer. And she nurses the reindeer back to health in order to deliver him back to Santa Claus on Christmas Eve. The true meaning of the movie is said by the preacher in the church during the Christmas service. Today's kids grow up so fast, and loose the child-like faith that Jesse has in a few short years. They then don't believe in anything that science doesn't prove. But Jesse, against impossible odds, sticks to her beliefs, and in the end brings back the faith of those who lost theirs long ago. Prancer is one of those holiday movies to buy for both your kids and yourself.",
         "This is one of the best contemporary Christmas movies made. A very sincere and sweet movie, but one that won't give you tooth decay. Rebecca Harrell gives one of the most believable and intelligent performances as a young girl who nurses an injured reindeer back to health and holds the belief that the reindeer is indeed Prancer. Sam Elliot gives a strong performance as the girl's apple farmer father who has fallen on hard times and is trying to raise his kids without a mother. The rural scenery of this film is beautiful of the farms and woodlands and gives the film a real feeling of Christmas. A very simple plot fuels the movie, but it grows surprisingly darker and deeper as the film progresses and will be tugging at your heart strings by it's conclusion. Highly recommended viewing for kids and adults and all believers of Santa Claus.",
         "In general, I think Christmas has lost its meaning for most people. Now, the main goal of the holidays seems to be to spend as much money as possible. In the process, people lose sight of the fact that we are celebrating the birth of the Son of God. I try hard not to get too wrapped up in the frenzy of the commercialization of Christmas. So, I try to find ways to make my season peaceful and meaningful. Prancer is one of the joys of the season for me. It's themes about keeping faith in the face of all those who don't believe, love overcoming hard luck, and courageously facing loss as a way of dealing with it are timeless. Rebecca Harrell as Jessica Riggs is the star of this movie, and Sam Elliot couldn't have been cast in a better role. During the holidays, I try to find one evening to build a crackling fire, sip hot chocolate, and settle down to watch Prancer. It has become my favorite Christmas movie, and one of my favorite movies of all time. What makes it even more precious is that it was filmed near my home, in LaPorte, Indiana. The beautiful snowy fields, orchards and woods filmed in the movie are just outside my door! I hope you all enjoy Prancer as much as I do!",
         "With all of the hype that surrounds the many Christmas releases and remakes, here's an original that all of the family should see. It is sweet yet real. It restores hope and decency to movies. We've rented it before, now we own it. After \"A Christmas Story\" and the Alistaire Sim version of \"A Christmas Carol\", this is the Christmas movie our family MUST watch every year.",
         "\"Prancer\" is about a young girl, Jessica Riggs, who unexpectedly finds a wounded reindeer, whom she believes belongs to Santa. With her father under financial pressure, and who ignores her a lot, she has a tough time. She wants to look after it and nurse it, but has to do it secretly since her father is against it and could kill it at any moment. She often have minor fights and arguments with her father regarding family matters and her own life. Meanwhile, her duty, she feels is to take good care of Prancer. Jessica Riggs's role was played by Rebecca Harrell, and she must have been the perfect young child to do the role. Her natural, childlike attitude couldn't have got any better, and that was seen in the movie. I still remember myself crying a bit while watching it as a child. It still brings tears in my eyes while watching even today. I advise those who wish to watch this movie watch it by around Christmas, and that would be the right time....And believe me, you won't be disappointed.",
         "Not many peop;e remember this movie. Most of my friends have never even heard of it. But at my house, it has always been a huge part of Christmas. Every year we watch it. I think its a beautiful story about believing in Santa (or, Prancer). I love the father, and how in the end he ends up believing to. Or at least, helping Jessica believe. I'm surprised that this one isn't up there with \"A Christmas Story\". It should be. I love the excerpts from The Virgina Letter. I've been watchign this movie since i was born (literaly) It was made the year i was born. And i will continue to watch it with my children, and grand children.",
         "While not without a couple of problems [like pacing], PRANCER is one of the better family/holiday movies I've seen. I didn't see this until after I saw PRANCER RETURNS about a week ago on cable. After PRANCER RETURNS [the sequel to this] was over, I went to the video store and rented this. Now while this one seemed to have a lower budget than PRANCER RETURNS, it still is just as well-acted and heartwarming [if not even more so]. Most holiday movies tend to show the holidays as times where everything is perfect, but this one shows that the holidays aren't as perfect as we'd like them to be. It's able to capture the ups and downs of the holidays while keeping everything pretty close to reality. Though I really enjoyed the film, CHRISTMAS VACATION remains to be my favorite holiday flick.",
         "Few movies inhabit the world of childhood quite as authentically as \"Prancer.\" Until the very last moments, it doesn't matter whether young Jessica's belief that she has found one of Santa's reindeer is literally true. The fact that she could believe such a thing so strongly, and selflessly act on her belief to help the lost reindeer, is compelling enough on its own. Children occupy a world where naive clarity mingles with a confusing knowledge of how much of adult life remains unknown. \"Prancer\" creates an atmosphere that lets adults dip back into that almost-forgotten way of experiencing the world. Sam Elliott delivers a fantastic performance as Jessica's father, a farmer who has recently lost his wife and will soon probably lose his farm. He is on the verge of losing his family, and the father-daughter relationship at the heart of the movie feels unaffectedly real. Cloris Leachman's turn as an embittered neighbor deserves note as well. The film's greatest flaws occur in its last two minutes. First, a critical continuity error shows that the reindeer has shed a jingle-bell harness just before the sound of the harness is supposed to indicate the animal's presence. Finally, at the very end, the movie shatters its ambiguity about the literal truth of the reindeer's identity. In doing so, it negates the foundation of the story's authenticity and dramatic power, and trivializes the final reconciliation between Jessica and her father. If the reindeer is not a supernatural being, then Jessica is a silly little girl and the audience has been had. But if the reindeer is a magical beast from Santa's stable, then it is not a leap of faith for Jessica's father to accept her improbable belief in the animal. By revealing the answer one way or the other, \"Prancer\" cheapens itself and significantly undermines the emotional power of an otherwise subtle and moving drama."
      ],
      "genres": [
         "Drama",
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Cineplex-Odeon Films",
         "Nelson Entertainment",
         "Raffaella Productions"
      ],
      "summaries": [
         "Jessica, the daughter of an impoverished farmer, still believes in Santa Claus. So when she comes across a reindeer with an injured leg, it makes perfect sense to her to assume that it is Prancer, who had fallen from a Christmas display in town. She hides him in her barn and feeds him cookies, until she can return him to Santa. Her father finds him and decides to sell him to the butcher, not for venison chops, but as an advertising display.",
         "A farm girl nurses a wounded reindeer she believes is one of Santa's, hoping to bring it back to health in time for Christmas. Her holiday spirit inspires those around her, something her disheartened father is having trouble understanding."
      ],
      "budget": 0
   },
   "movielensId": 2400,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-11-17",
      "dvdReleaseDate": "2001-10-02",
      "directors": ["John D. Hancock"],
      "runtime": 99,
      "movieId": 2400,
      "title": "Prancer",
      "mpaa": "G",
      "actors": [
         "Sam Elliott",
         "Cloris Leachman",
         "Rutanya Alda",
         "Abe Vigoda",
         "Michael Constantine",
         "Rebecca Harrell Tickell",
         "Ariana Richards",
         "John Duda",
         "Mark Rolston",
         "Johnny Galecki",
         "Walter Charles",
         "Victor Truro",
         "Marcia Porter",
         "Loren Janes",
         "Robert Zimmermann",
         "Shirley Starnes",
         "Michael Luciano"
      ],
      "imdbMovieId": "0098115",
      "originalTitle": "Prancer",
      "genres": [
         "Drama",
         "Family",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["LsSM-cxp_ZQ"],
      "plotSummary": "Jessica, the daughter of an impoverished apple farmer, still believes in Santa Claus. So when she comes across a reindeer with an injured leg, it makes perfect sense to her to assume that it is Prancer, who had fallen from a Christmas display in town. She hides the reindeer in her barn and feeds it cookies, until she can return it to Santa. Her father finds the reindeer an decides to sell it to the butcher, not for venison chops, but as an advertising display.",
      "tmdbMovieId": 24951,
      "avgRating": 2.8299,
      "releaseYear": "1989",
      "numRatings": 388,
      "posterPath": "/fMB3NytsHZrbb2ylntRFQtFhPPx.jpg"
   }
}