{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "return",
            "id": 1571
         },
         {
            "name": "pregnant",
            "id": 10721
         },
         {
            "name": "shape shifting alien",
            "id": 14729
         },
         {
            "name": "pregnant woman",
            "id": 18011
         },
         {
            "name": "expectant father",
            "id": 160945
         },
         {
            "name": "expectant mother",
            "id": 160946
         },
         {
            "name": "pregnant wife",
            "id": 161534
         },
         {
            "name": "shape shifter",
            "id": 162532
         },
         {
            "name": "cocoon",
            "id": 163481
         },
         {
            "name": "senior citizen",
            "id": 163484
         },
         {
            "name": "human alien",
            "id": 163488
         },
         {
            "name": "human form",
            "id": 163491
         },
         {
            "name": "ice cream sundae",
            "id": 163497
         },
         {
            "name": "wife and husband lead actors",
            "id": 163503
         }
      ],
      "imdb_id": "tt0094890",
      "video": false,
      "title": "Cocoon: The Return",
      "recommendations": [
         10328,
         18410,
         9409,
         10859,
         10631,
         11384,
         10498,
         8494,
         12088,
         12661,
         11133,
         15582,
         26827,
         11595,
         2614,
         12120,
         9085,
         10303,
         11630,
         12154
      ],
      "backdrop_path": "/k2p8bbDARn6QwyJRsQfLldTJB38.jpg",
      "revenue": 25024919,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Arthur 'Art' Selwyn",
               "gender": 2,
               "credit_id": "52fe441e9251416c75029671",
               "name": "Don Ameche",
               "profile_path": "/q4t9dds6jQuuqpMLvALbOqVJRFV.jpg",
               "id": 18156,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Benjamin 'Ben' Luckett",
               "gender": 2,
               "credit_id": "52fe441e9251416c75029675",
               "name": "Wilford Brimley",
               "profile_path": "/t0TLF4qXgXiroirvjVWWP88B0GD.jpg",
               "id": 11065,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sara",
               "gender": 1,
               "credit_id": "52fe441e9251416c75029679",
               "name": "Courteney Cox",
               "profile_path": "/1mBVn6MiP69dxpKJkPCK3ckBuHI.jpg",
               "id": 14405,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Joseph 'Joe' Finley",
               "gender": 2,
               "credit_id": "52fe441e9251416c7502967d",
               "name": "Hume Cronyn",
               "profile_path": "/zcEvBQlYHT8QzfTe7YIGHsjz0oY.jpg",
               "id": 7668,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bernard 'Bernie' Lefkowitz",
               "gender": 2,
               "credit_id": "52fe441e9251416c75029681",
               "name": "Jack Gilford",
               "profile_path": "/mc8fpSHQ8Kds8MKwyHHJzrMz57I.jpg",
               "id": 64929,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Jack Bonner",
               "gender": 2,
               "credit_id": "52fe441e9251416c750296c7",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe441e9251416c750296cb",
               "name": "Barret Oliver",
               "profile_path": "/20MDrTcH9QJI9VK5vFQH6jKTVBZ.jpg",
               "id": 29508,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Marilyn 'Mary' Luckett",
               "gender": 1,
               "credit_id": "52fe441e9251416c750296cf",
               "name": "Maureen Stapleton",
               "profile_path": "/7zazX6qycXK1CBXkNT1t9FCEEkk.jpg",
               "id": 21151,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Ruby Feinberg",
               "gender": 1,
               "credit_id": "52fe441e9251416c750296d3",
               "name": "Elaine Stritch",
               "profile_path": "/4QGJE8HwbJXdb7MrsINR8zJtDzp.jpg",
               "id": 36802,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Alma Finley",
               "gender": 1,
               "credit_id": "52fe441e9251416c750296d7",
               "name": "Jessica Tandy",
               "profile_path": "/tDoTea4JEVuo8wgzkOxUpd1Drkh.jpg",
               "id": 5698,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Bess McCarthy Selwyn",
               "gender": 1,
               "credit_id": "52fe441e9251416c750296db",
               "name": "Gwen Verdon",
               "profile_path": "/tOPI0ZXMnVAoDBHBkK0lZkyEPxp.jpg",
               "id": 54122,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c75029687",
               "name": "Daniel Petrie",
               "profile_path": null,
               "id": 40549,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe441e9251416c7502968d",
               "name": "David Saperstein",
               "profile_path": null,
               "id": 43979,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c75029693",
               "name": "Stephen McPherson",
               "profile_path": null,
               "id": 33893,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe441e9251416c75029699",
               "name": "Elizabeth Bradley",
               "profile_path": null,
               "id": 68856,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c7502969f",
               "name": "Stephen McPherson",
               "profile_path": null,
               "id": 33893,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c750296a5",
               "name": "David Brown",
               "profile_path": "/fUWueOqqSkc9yc6svhOKlQr656F.jpg",
               "id": 5322,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe441e9251416c750296ab",
               "name": "Lili Fini Zanuck",
               "profile_path": "/qowwpTsd4cJAlmdi7Bb4tARL3IP.jpg",
               "id": 5707,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c750296b1",
               "name": "Richard D. Zanuck",
               "profile_path": "/uoPXQ29L8vlphMuojaBlmuwi1Mu.jpg",
               "id": 1297,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c750296b7",
               "name": "James Horner",
               "profile_path": "/oLOtXxXsYk8X4qq0ud4xVypXudi.jpg",
               "id": 1729,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c750296bd",
               "name": "Tak Fujimoto",
               "profile_path": "/stUrxvmoFNrNLskc2oPhrOOeinB.jpg",
               "id": 16300,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe441e9251416c750296c3",
               "name": "Mark Warner",
               "profile_path": null,
               "id": 1732,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe441e9251416c750296e1",
               "name": "Ve Neill",
               "profile_path": "/gNYwxuK5Z7Nr3tWtSWv0qAueUIs.jpg",
               "id": 406204,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.728262,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11285,
      "vote_count": 122,
      "budget": 17500000,
      "overview": "The old age pensioners that left at the end of the first film come back to earth to visit their relatives. Will they all decide to go back to the planet where no-one grows old, or will they be tempted to stay back on earth, or will they?",
      "similar": [
         76494,
         10328,
         336435,
         199151,
         245104
      ],
      "original_title": "Cocoon: The Return",
      "runtime": 116,
      "poster_path": "/AkPcfRIZ1ZynIB2nnOOOWzHPOT9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Zanuck/Brown Productions",
            "id": 1865,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1988-09-13",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/o32F4wuQJPBnP5FVkOGP9DxGYJI.jpg",
         "name": "Cocoon Collection",
         "id": 86307,
         "poster_path": "/qKtNXCcY3DMJ8T7cs47yDwpU5fT.jpg"
      },
      "tagline": "This holiday season, journey to the most wonderful place in the universe... home.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Daniel Petrie"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "David Saperstein",
         "Stephen McPherson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094890/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5NDk0ODM3N15BMl5BanBnXkFtZTcwOTYyOTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Don Ameche, Wilford Brimley, Courteney Cox | See full cast and crew »"],
      "reviews": [
         "The original Cocoon was touching, sweet, optimistic, and heartfelt. Most of the wonderful ensemble cast reunited for this sequel, but sadly, something went awry. You learn nothing about what they've seen during five years spent with the aliens . Further, it seems like everything the characters accomplished the first time around was repealed in this story. Their desire to join the aliens in the first place was predicated on a variety of factors, but each of those reasons is dissected and trashed this time out. Suddenly, there is conflict and suffering during a brief one-week visit. Characters get sick, everyone argues, nobody seems happy. As if that isn't bad enough, a tragic suicide attempt is played almost like a joke. Since when is suicide funny? Steve Guttenberg's character was integral to the first movie, but now he's just written as a clownish buffoon. The grandson's teen angst is annoying. There are a few notable moments, however. One scene between Jessica Tandy and Hume Cronyn is deeply touching. The plight of a captured alien being studied is properly sympathetic. But scenes like these are intermingled with a menagerie of subplots which dart around between serious and comedic. This sequel wanders too far afield from the spirit of its predecessor. The result is gloomy and disappointing. See the original, instead.",
         "I had hesitated on watching this sequel because it good bad reviews, but I really enjoyed it. They had to come back for the cocoons, right? What makes this movie worthwhile is that all of the Seniors struggle with whether they want to leave Earth again. Immortality isn't all it's cracked up to be.",
         "After I enjoyed the first Cocoon so much I decided that the sequel could not be too bad. For the most part, the Cocoon: The Return remains a generally enjoyable film even if most of the magic remained in the original. In this one, the elderly friends return back to earth to catch up on everything that had missed out on while they were away. The biggest problem when they get back to earth is that all of the special protection from illness and aging that they had with the aliens eventually wears off, and if they don't get back to their planet with the aliens quickly, some of them may die. Overall, an enjoyable and harmless sequel to the original. If you liked the original you will most likely enjoy this sequel. ***1/2 out of *****.",
         "Completely lacking in originality, and even more in unpredictability, \"The Return\" gives one the feeling of 'déjà vu', as director Petrie sticks with the identical formula in order to guarantee success. This unfortunately also guarantees that we will get no inspiration from this sequel. Yet in this light it is well filmed, with each character returning to fill us with the same emotions as the first \"Cocoon\" film. Stars Don Ameche, Wilford Brimley, Hume Cronyn, Jessica Tandy and Steve Gutenberg all return among others. James Horner's music is also back to enhance the mood. Never as good as the first, but never mind. Sunday, May 24, 1992 - Video",
         "This is a sequel, and it's better than most sequels. However, most sequels don't hold up against the original film and this one's no exception. The same cast is back and the acting is certain up to par in this film, but the impact of the story isn't there. I believe this film would have done fairly well had it not been a sequel, but the magic was gone, sorta like the magic from the pool in the first film. The cast does a good acting job and they try, they really do, but this film just doesn't cut the mustard (from whence came THAT expression?) as compared to the first film. I'm sorry, because I truly liked the first film. This is overall a very good film and nicely acted, written and executed. However, as I said, the magic from the first film is just missing because we knew pretty much what to expect. It's sad that few sequels are as good as the original.",
         "I found this movie to be an unexpected delight! It was engaging well written and executed, and it left me with a great feeling when it was over! What more could you ask for? Well how about the endearing performances, and chemistry between Hume Cronyn, and Jessica Tandy? Not to mention Don Ameche and Wilford Brimley. All together you have a fine film with many levels of warmth, and good humor. You'll love it! Watch and see!",
         "***SPOILERS*** ***SPOILERS*** This movie got really bad reviews... but I think it's almost just as good as the first one! Sure... it hasn't got the BEST plot in the world... but the cute older people return! That's enough to make me watch it! (Note: Bit of a spoiler coming up here... but not TOO in depth) Wilford Brimley and Maureen Stapleton again do a fine job as they contemplate whether to stay with their beloved daughter and grandson, or to return to the planet of Antarea. Jack Gilford again shines... this time with Elaine Stritch! Jessica Tandy and Hume Cronyn give an especially moving performance as his leukemia returns... and she's hit by a car. (VERY depressing point in the movie... it'll bring tears to your eyes) And, saving the best for last, Gwen Verdon and Don Ameche... again, bringing a sparkle to their parts and doing a wonderful job! (I must say though... it's kind of weird that they made Bess pregnant.... considering Gwen was 63 and all at the time...) A definite must see... but only after you've seen the first!",
         "There is certainly an argument as to whether Cocoon: The Return need have ever been made. Ben (Wilford Brimley) had explicitly told his grandson that he would never see him again, it serves to cheapen that scene and many other scenes of finality in the original that they 'return' for this sequel. Another annoyance is that the hospitals and doctors that the oldsters frequent don't seem to wonder how the hell these guys have risen seemingly from the dead. That said, it's wonderful to see the senior actors return again, and some very real issues are covered which make this more than a worthwhile sequel all things considered. The scene of sacrifice with Joe (Hume Cronyn) and Alma (Jessica Tandy) is a whirlpool of emotion and I defy anyone not to be moved by this pair of stunning performances - it really does tug on the heartstrings, as much as anything in the first movie does. It's also superb watching Bernie (Jack Gilford) move on with his life by dating the feisty Ruby (Elaine Stritch) who is more than a match for the cantankerous curmudgeon. Some brilliantly moving moments as Bernie believes he is betraying his late wife by kissing another woman... And that's what the Cocoon movies do, they move you, they move senior citizens - disregarded by society - to the forefront of importance and rightfully so too, before we were around - they were. They deserve these films to showcase the hardships they have to go through in later life, where a great deal of them to crave immortality...these films take a look what if?...and then...is it what it was cracked to be. Wonderful films, wonderful actors - I'll defend these movies to the end.",
         "[CONTAINS SPOILERS] The all-star cast of veteran actors, headed by Academy Award® winner Don Ameche, is back in their first adventure since their last. Set 5 years since the first Cocoon. Making this one take place in the year 1990. For the past 5 years, life on the planet earth was pretty dull. Bernie Lefkowitz was aging. He missed his wife very much and wasn't too fond of the new management at the home. Sea captain Jack Bonner's business was failing. Ben Luckett's grandson, David, was 14 and not so good with baseball. One day, David got a message from his grandfather saying he was coming to see him. He and his friends were gonna hitch a ride with the Antareans who had some business to take care of. Ben and Mary Luckett came to visit David and his mom. Art and Bess Selwyn, Joe and Alma Finley went to visit Bernie. The seniors had mostly forgotten life on earth. Art, Ben and Joe went to the beach and played volleyball with some young girls. Art soon get's the news that Bess is pregnant. Jack Bonner is reunited with Kitty. They go out to dinner but Kitty wanted to \"share herself\" with Jack again. They make quite a scene in the restaurant, and as if this wasn't bad enough, an oceanography team was lifting a cocoon out of the ocean! They had to get it back! The seniors also forget that life on earth doesn't mean being young and vibrant forever. Ben feels it when he teaches David to play baseball. Joe felt it and the doctor informed him that he had leukimia again. Now why did that worry him so much? He was going to return to Antarea in a few days so it would be gone. What's he got to worry about? Plenty, because the next day Alma is hit by a car and nearly dies. Joe transfers what Antarean energy he had left into her and he sadly died. They were all sad over the loss of their friend. Art and Ben join Kitty in retrieving the cocoon taken from the ocean. They infiltrate the oceanography center and get it back. Then they meet up with Walter in the middle of the ocean. Art and Bess would be returning to Antarea. Ben and Mary decided to stay. Alma and Bernie stayed also. Cocoon II: The Return is as good as the first. I'm glad there was a sequel so we could be reunited with our old friends again. Everybody's back. Don Ameche, Wilford Brimley, Hume Cronyn, Jessica Tandy, Jack Gilford, Maureen Stapleton, Brian Dennehy, and Gwen Verdon. Not to mention Tahnee Welch and Steve Guttenberg. I wonder if there will be a Cocoon III. I doubt it, but if there was, it could star Wilford Brimley, Maureen Stapleton and Steve Guttenberg. It could be set 20 years after the original Cocoon. They gotta help the Antareans again. Maybe Ron Howard could direct. But anyway, for now, you gotta see Cocoon II if you saw the first one. It's just as good. Well not AS good, but it's respectable. It comes recommended by me so you know it's good. --",
         "I mainly rated the movie a 7 due to the (once again) excellent acting of the majority of the cast and the strictness of the story to the original. So many movie sequels fail due to lose of the original story but this film extends it nicely! Courtney Cox's addition into the cast (though small) was a good decision. A major problem though is the 3rd story within about David (now much older) and Grandfather Ben, which could be good but they ruin it by not going farther in and just half-heartedly putting it in there. Another large problem is the fact that Ron Howard was not able to direct this film and it shows! Also Welch's performance in this sequel has her character change to that of something you wouldn't recognize to the Kitty in the first film...which totally throws off some of the movie. The ending though couldn't have been done any better and it ends the 2 film series nicely!"
      ],
      "genres": [
         "Adventure",
         "Comedy",
         "Mystery",
         "Romance",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Zanuck/Brown Productions",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Art, Ben and Joe are back! So are their wives and good friend Bernie in their first adventure since their last! Five years since the senior citizens blasted off into space with the Antareans return to earth because their alien friends have to collect the rest of the cocoons in the ocean, believed to be in danger from an earthquake. Ben and Mary visit their family, while Art and Joe visit Bernie, who's still hangin' on. Art, Ben and Joe had forgotten what it was like on earth and immediately begin to feel their weaknesses, except for Art's wife who's pregnant! Meanwhile in the ocean, a biologist company snatched a cocoon out of the ocean and are doing research on it...",
         "The old age pensioners that left at the end of the first film come back to earth to visit their relatives. Will they all decide to go back to the planet where no-one grows old, or will they be tempted to stay back on earth?"
      ],
      "budget": 17500000
   },
   "movielensId": 2408,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-09-13",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Daniel Petrie"],
      "runtime": 116,
      "movieId": 2408,
      "title": "Cocoon: The Return",
      "mpaa": "PG",
      "actors": [
         "Don Ameche",
         "Wilford Brimley",
         "Courteney Cox",
         "Hume Cronyn",
         "Jack Gilford",
         "Steve Guttenberg",
         "Barret Oliver",
         "Maureen Stapleton",
         "Elaine Stritch",
         "Jessica Tandy",
         "Gwen Verdon"
      ],
      "imdbMovieId": "0094890",
      "originalTitle": "Cocoon: The Return",
      "genres": [
         "Comedy",
         "Drama",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "Ol4B6nAvBak",
         "E288zThpr8Q"
      ],
      "plotSummary": "The old age pensioners that left at the end of the first film come back to earth to visit their relatives. Will they all decide to go back to the planet where no-one grows old, or will they be tempted to stay back on earth, or will they?",
      "tmdbMovieId": 11285,
      "avgRating": 2.5022,
      "releaseYear": "1988",
      "numRatings": 2045,
      "posterPath": "/AkPcfRIZ1ZynIB2nnOOOWzHPOT9.jpg"
   }
}