{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "school friend",
            "id": 2921
         },
         {
            "name": "religion and supernatural",
            "id": 3684
         },
         {
            "name": "sherlock holmes",
            "id": 9401
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         }
      ],
      "imdb_id": "tt0090357",
      "video": false,
      "title": "Young Sherlock Holmes",
      "recommendations": [
         11002,
         11558,
         14170,
         13665,
         10023,
         9941,
         12151,
         8850,
         19382,
         11896,
         2614,
         10303,
         11843,
         10658,
         10631,
         14506,
         5968,
         6081,
         9873,
         11591
      ],
      "backdrop_path": "/sw9Y59UG8wi6XaHrSMoFY6zVYdZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sherlock Holmes",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1c9",
               "name": "Nicholas Rowe",
               "profile_path": "/iA32qMujonoTzU1DdlnTRemBvRQ.jpg",
               "id": 984,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "John Watson",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1cd",
               "name": "Alan Cox",
               "profile_path": "/wgAIYhDXXgdcHzLvSlQ1gm9sVAb.jpg",
               "id": 70881,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Elizabeth Hardy",
               "gender": 1,
               "credit_id": "52fe449e9251416c7503b1d1",
               "name": "Sophie Ward",
               "profile_path": "/fZUeign4RwFWa8DG4vqlM8m7cf6.jpg",
               "id": 31921,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Professor Rathe",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1d5",
               "name": "Anthony Higgins",
               "profile_path": "/1cjZmBBVlUCZlLqX4Jn1EOdVulw.jpg",
               "id": 660,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Mrs. Dribb",
               "gender": 1,
               "credit_id": "532ad323c3a3681ff0001991",
               "name": "Susan Fleetwood",
               "profile_path": "/sOcuuRW1sr9DIxvTIpPb30JBKY5.jpg",
               "id": 87415,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "Det. Sgt. Lestrade",
               "gender": 2,
               "credit_id": "5a239f2ac3a3680b8f0c1ecb",
               "name": "Roger Ashton-Griffiths",
               "profile_path": "/3lvWs4Kz0aATpcSY7PyPhkKgH6W.jpg",
               "id": 20243,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Dudley's Friend",
               "gender": 2,
               "credit_id": "54008e710e0a2658d80024ab",
               "name": "Matthew Ryan",
               "profile_path": null,
               "id": 98098,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Dudley",
               "gender": 2,
               "credit_id": "54008eab0e0a2658ee00253f",
               "name": "Earl Rhodes",
               "profile_path": null,
               "id": 982402,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Chester Cragwitch",
               "gender": 2,
               "credit_id": "5a239f4992514103290c600b",
               "name": "Freddie Jones",
               "profile_path": "/mh2aJ6fuzsjsCG8bNyelPuqPHt3.jpg",
               "id": 12517,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Bentley Booster",
               "gender": 2,
               "credit_id": "5a239f5a925141032c0c3f4e",
               "name": "Patrick Newell",
               "profile_path": "/xiERZ2OiSRzBUwoP1qi0ORaJe3P.jpg",
               "id": 1224759,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Bentley Bobster",
               "gender": 2,
               "credit_id": "5a239f630e0a264cca0c06c2",
               "name": "Patrick Newell",
               "profile_path": "/xiERZ2OiSRzBUwoP1qi0ORaJe3P.jpg",
               "id": 1224759,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "Khasek - Lower Nile Tavern Owner",
               "gender": 2,
               "credit_id": "5a239f8192514103290c602f",
               "name": "Nadim Sawalha",
               "profile_path": "/94kMNtU2FYXruX4BOOjWrWkoe2x.jpg",
               "id": 2980,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1db",
               "name": "Barry Levinson",
               "profile_path": "/AvPOBBODhSCtUJAqxeq2s0nYnTw.jpg",
               "id": 8246,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1e1",
               "name": "Arthur Conan Doyle",
               "profile_path": "/wkfHlJ56PpSqui0Cjhnahs3sfZg.jpg",
               "id": 25167,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1e7",
               "name": "Chris Columbus",
               "profile_path": "/2fHN78oumrJRM84UydgfVzj0YEl.jpg",
               "id": 10965,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1ed",
               "name": "Mark Johnson",
               "profile_path": "/yKGF6cbzyP03Gl1QhVLCu1gWSW6.jpg",
               "id": 5162,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe449e9251416c7503b1f3",
               "name": "Kathleen Kennedy",
               "profile_path": "/6rGtk7OdbkO2QDM2OQxt9Blww3O.jpg",
               "id": 489,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1f9",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b1ff",
               "name": "Steven Spielberg",
               "profile_path": "/pOK15UNaw75Bzj7BQO1ulehbPPm.jpg",
               "id": 488,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b205",
               "name": "Henry Winkler",
               "profile_path": "/bwRNFbcotcEeZcKzlbUia4juF6N.jpg",
               "id": 31903,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b20b",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b211",
               "name": "Stephen Goldblatt",
               "profile_path": null,
               "id": 5582,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b217",
               "name": "Stu Linder",
               "profile_path": null,
               "id": 5166,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.856622,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11904,
      "vote_count": 211,
      "budget": 18000000,
      "overview": "Sherlock Holmes and Dr. Watson meet as boys in an English Boarding school. Holmes is known for his deductive ability even as a youth, amazing his classmates with his abilities. When they discover a plot to murder a series of British business men by an Egyptian cult, they move to stop it.",
      "similar": [
         984,
         96,
         357096,
         445954,
         10651,
         2749,
         37645,
         49524,
         10528,
         1572,
         281957,
         4638,
         4771,
         75780,
         807,
         44147,
         306,
         2142,
         15069,
         9873
      ],
      "original_title": "Young Sherlock Holmes",
      "runtime": 109,
      "poster_path": "/wtf58Ld4C23zQFidUfH4lN2aR1f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/mpGWkDeikYLeAR8LVNaixig0vwE.png",
            "name": "Amblin Entertainment",
            "id": 56,
            "origin_country": "US"
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1985-12-04",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Before a lifetime of adventure, they lived the adventure of a lifetime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barry Levinson"],
      "runtime": 109,
      "synopsis": "The film opens in late 19th century London one evening. A hooded figure raises a blowpipe and shoots a dart into an older businessman named Bentley Bobster ( Patrick Newell) outside a restaurant. He shakes the sting off thinking it an insect. After ordering dinner, however, he suffers a terrifying hallucination in which his dinner, a roasted bird, attacks him. He shakes this off, and returns to his third-floor flat. Another hallucination appears, however, leading him to believe that his apartment is on fire. He throws himself out the window and is killed when he hits the ground in an apparent suicide. The credits roll. The scene switches to a boy's school in London were the teenage John Watson ( Alan Cox) is a new student at the Brompton Academy. As he moves into the dorm he finds the next bunk over is occupied by the teenage Sherlock Holmes ( Nicholas Rowe). The two become friends and Holmes introduces Watson to Professor Waxflatter ( Nigel Stock), a retired teacher with rooms and a laboratory in the school's attic. Waxflatter is bit of a mad inventor who is constantly testing a human-powered flying machine. Holmes also introduces Watson to Elizabeth ( Sophie Ward), Waxflatter's teenage niece who shares his rooms and has a budding romantic relationship with Holmes. As we follow Holmes and Watson we see them attend a fencing class. The teacher, Professor Rathe ( Anthony Higgins), chooses Holmes as his opponent in a demonstration match. Though Holmes does well, Rathe eventually defeats him. Rathe complements Holmes on the match, but warns him that he lets his emotions get the best of him and it leads him to make rash moves and ultimately lose. We see a second attack take place: The hooded figure enters a church and shoots a dart into the sole occupant, the Reverend Duncan Nesbitt ( Donald Eccles). The reverend hallucinates that the stained glass figure of a knight jumps from its window and chases him down the aisle. He runs through the front doors and out into the street where he is run over by a horse-drawn carriage and dies. One evening a suspicious character comes to visit Waxflatter and the professor asks the teenagers to leave the room. Holmes has noticed that Waxflatter has circled articles in the paper dealing with the mysterious deaths of the businessman and the reverend. He begins to suspect that the three things are connected. His suspicions are confirmed when Waxflatter, a few days later, seems to go crazy in a curiosity shop, grabs a knife and kills himself. Watson, who is outside of the shop immediately afterwards, is bumped by a hooded figure that drops a blowpipe. Watson picks it up and shows it to Holmes. Holmes wants to investigate, but unfortunately a fellow student has framed him for cheating and he is expelled from the school. With Elizabeth's permission, however, he hides in Waxflatter's old rooms and enlists Watson as his ears and eyes in the investigation as he must be careful about being seen in the area. Elizabeth connects Watson's story of a hooded figure with that of an incident earlier on where her dog chased a hooded figure through the school courtyard tearing a piece of cloth off its cloak. Holmes takes the cloth and analyzes it. He finds wax on it is made only by the firm \"Froggit and Froggit\" located in a less than reputable part of London. He and Watson also find out that the blowpipe seems to be Egyptian and related to a cult. The three travel to the firm and get inside the building. There they find a stockroom housing a pyramid several stories tall. Inside the pyramid is the reproduction of an Egyptian temple. A ceremony run by the secret Egyptian cult is beginning. While Elizabeth and Watson watch from the safety of a small hidden room that overlooks the temple, Holmes climbs down to gather evidence. The ceremony reaches a climax when a drugged teenage girl is wrapped up like a mummy, placed in coffin and covered with hot wax released by a priest wearing a headpiece that looks like the Egyptian god Anubis. Realizing the girl will be killed, Holmes tries to intervene, but he is outnumbered and he, Watson and Elizabeth are forced to flee from the building. They are chased by the members of the cult who manage to shoot darts into all three of them. The three try to hide in a cemetery, but are overcome by hallucinations. Holmes ties Elizabeth up so she cannot hurt herself, but finds himself overcome with illusions concerning his parents. Watson finds himself contending with an illusion of dessert pastries that attack him and stuff themselves down his throat. Holmes manages to shake off the hallucination, but then sees an Egyptian with a sword about to attack him. At first he thinks this is an illusion too, but suddenly finds it is real and he is forced to defend himself. Fortunately the cemetery watchman, armed with a shotgun, intervenes and saves him. The three are taken before police Sergeant Lestrade ( Roger Ashton-Griffiths). Holmes earlier tried to convince the detective that the three deaths were connected, but Lestrade dismissed his observations. Holmes tries again, giving Lestrade the three darts to be tested, but the detective throws the teenagers out. He is about to throw the darts out too, when he pricks himself on one of the points. The three teenagers head back to Waxflatter's attic. There Watson finds a drawing of a group of men in their 20s. Holmes recognizes three of them as the young Waxflatter, the Reverend, and Bobster. A fourth figure, a wealthy man named Cragwitch ( Freddie Jones), is the mysterious stranger who visited Waxflatter. Holmes decides they need to talk to him. Before he can act on this Professor Rathe enters the room, followed by Mrs. Dribb ( Susan Fleetwood), the school nurse. Rathe is angry at Holmes for disobeying the order to go home, and Watson and Elizabeth for hiding him. The boys are locked in a room until they can be sent away. Elizabeth is put in the care of Mrs. Dribb. The room does not hold Holmes for long and he and Watson are off to see Cragwitch. The man is at first suspicious and greets them with a shotgun. However, Holmes is able to convince them they are there to help and Cragwitch invites them in and spills the story. The men in the picture were part of a group that decided to build a hotel in Egypt. The project failed, but not before it had desecrated the cult's underground temple and destroyed the mummies of five young princesses held sacred by the cult. Husband and wife leaders of the cult were also killed and their small children ( a girl and a boy) vowed that when they grew up they would seek revenge on the men, rebuild the cult and replace the mummies of the princesses. All the men, except Cragwitch are now dead. As Cragwitch is explaining this a hooded figure hits him with a dart from the window. Holmes and Watson try to subdue Cragwitch, but he is about to kill Holmes when he is knocked cold by Lestrade who has arrived just in time. The detective decided there was something to Holmes's story after all when the pinprick of the dart gave him a hallucination and he nearly killed himself. With Cragwitch under police protection, Holmes and Watson head back to the school and are almost there when Holmes comes to the revelation that the cult boy must be the grown up Rathe and his sister is most likely Mrs. Dribb. He also realizes they intend to make Elizabeth into the final replacement princess mummy. As they approach the school they see a carriage containing, Rathe, Dribb and Elizabeth leave. They are unable to catch it and Holmes decides the only way to get to the warehouse in time is to use Waxflatter's untested flying machine. It works and the boys set down on the river near the warehouse. Observing the temple they see a drugged Elizabeth being wrapped. The boys are outnumbered, but Holmes decides that if he can attach a line from the chandelier at the top the temple to one of the support beams, he can bring much of the structure down by releasing the winch that keeps the chandelier in place. They do this and it leaves the temple in ruins as well as diverting the wax away from Elizabeth at the last moment. In the confusion Watson and Holmes race to Elizabeth's rescue. Holmes is caught in a sword dual with Mrs. Dribb that ends when her ceremonial robe catches on fire and she is killed. Holmes is knocked out, however, and left lying on the chandler as the temple burns around him. Watson gets Elizabeth out of the temple, but loses her to Rathe (who was the priest with the Anubis mask). Watson finds himself torn between rescuing Elizabeth or Holmes. Suddenly he gets an idea that will do both. Using a rope with a grappling hook he attaches one end to the chandler chain and catches the other on the rear of the carriage Rathe is using to take Elizabeth away. As the carriage leaves it pulls up the chandler and brings Holmes to safety. When the chandler can go no further, however, the carriage is torn in two stopping Rathe. By then Holmes is up again. He and Watson rescue Elizabeth and pursue Rathe back into the dock area. Rathe produces a pistol and tries to shoot Holmes, but Elizabeth takes the shot instead. As Watson attends to her Rathe and Holmes duel with swords, first on the dock, then on the ice. Rathe seems to be winning until the ice cracks beneath their feet. Rathe disappears into the water and Holmes escapes. On the dock Elizabeth is dying. She and Holmes exchange their love before she passes on. Back at the school Watson says goodbye to Holmes as the boy detective finally leaves for good. Watson notes that he expects this is not the last time he and Holmes paths will cross. The credits roll. As the credits roll we watch a sleigh traverse a snowy countryside. At the end of the credits a mysterious figure exits the sleigh and enters an inn. On the register he writes the name \"Moriarty.\" The camera reverses angle and we see it is the smiling figure of Rathe.",
      "writers": [
         "Arthur Conan Doyle",
         "Chris Columbus"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090357/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA0NjMyMTg4NV5BMl5BanBnXkFtZTcwMDIwNTAwMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Nicholas Rowe, Alan Cox, Sophie Ward | See full cast and crew »"],
      "reviews": [
         "What if Sir Arthur Conan Doyle created a story where Sherlock Holmes and Dr. John Watson met as adolescents? What if he made it a very suspenseful mystery that explanied may of the great sleuth's character traits and stylistic characterisics? What if...well, he did not, but screenwriter Chris Columbus, director Barry Levinson, and producer Steven Spielberg do bring us a fine film that does these things called Young Sherlock Holmes. Young Sherlock Holmes is the meeting of fantasy film and classic literature, and it is a meeting that coexists very nicely. The great detective meets his future colleague and friend Dr. Watson in a London prep school amidst the mystery of what six men did many years ago in Egypt. Several of the men begin to die in horrible, inexplicable ways, and the young Holmes suspects mischief. The film is a veritable treasure trove of Sherlock Holmes allusions. The film is fast-paced, fun, fantastical, and creates insights into why Holmes developed emotionally the way he did. Nicholas Rowe does a superb job playing Holmes, bringing to the role intelligence as well as compassion. Alan Cox does an equally good job playing his young sidekick and doctor to be. The special effects are first-rate, yet in no way detract from the Victorian world of Doyle and Holmes and Watson. Start watching and it will not be long before you'll be saying, \"The game is afoot!\"",
         "There are probably more Sherlock Holmes stories not written by Conan Doyle than were written by him. Some are quite bad but every now and then a good one comes along. \"Young Sherlock Holmes\"is one of the better ones and works on the premise that Holmes and Watson did not meet as adults in \"A Study In Scarlett\" but in boarding school. Of course they are in London where the young Holmes detects a link between a series of bizarre murders (depicted in some lively and imaginative special effects). The game is afoot and along the way (with a slight tongue in cheek) we learn where Holmes picked up some of his more famous trademarks and most infamous nemesis. A well written script, fine cast of actors and a physical production that recreates late 19th century London in grand fashion. A film to sit back and enjoy.",
         "I feel one of the true tests of a good movie is how it holds up over time. Can't believe it has been 18 years since I first viewed this little gem, and it was as good today as in 1985! Among other reasons, the Holmes and Watson characters were obviously cast for their youthful likeness to the characters in the old Basil Rathbone series of movies. Take a good look! This a wonderful penning of the proposed early days of the two and a very original concept. Probably only true Holmes officiandos will see some obvious references to the adult Rathbone character, and these add to the cleverness of this version. Make certain to stay 'til the end of the credits; Sherlock Holmes fans will receive an ingenious clue to the his \"future\".",
         "Young Sherlock Holmes was one of the best movies I saw when I was a kid and it amazes me up to this day.London was pictured perfectly by Barry Levinson with the help of course of Stephen Goldblatt (the cinematographer). The spcial effect by ILM was brilliant and they were the milestone of the special effects of today.The music of Bruce Broughton is one of the best of the 80's. The acting is good for this kind of film, not bad but not brilliant either. The script written by Chris Colombus (director of Harry Potter Films) is very good and it keeps you guessing up until the end. Watch this movie and you won't be dissapointed. (Wait after the end credits roll to see one last scene...)",
         "Intriguing story, not based on a Doyle idea, about the meeting of Sherlock Holmes and his good friend Watson. Even as youngsters, they unravel mysteries together and find themselves in constant mayhem and peril. Rowe is an outstanding young Sherlock, while Cox is an exceptional younger Watson. Barry Levinson directed this fun look at the master detective in his younger years.",
         "My son turned 12 in August. We purchased this movie at a drugstore while on vacation because I remembered watching it a loving it when I was younger. My son has a love of mysteries and \"spies\", so I thought that this would be a good movie for him to enjoy. He watched it twice the first day and has seen it several times over the last couple of weeks. It really appeals to younger mystery fans, even though it is rated PG-13, for violence. I would recommend any parent see this movie before they let their kids see it. Some of the violence is hallucinatory, and therefore quite \"scary\". I think the way it begins Holmes's and Watson's friendship is fun and creative. I think the script and characterizations are well done (especially in light of more current movies, which are just to draw viewers to the theater and have no substance.) The casting was inspired, and I don't see how they could have improved upon it. The cinematography was great and the special effects very good for the time of this movie. Some people might find Holmes's character a bit smug, but that is accurate to the stories by Sir Arthur Conan Doyle. I recommend this movie to mystery fans, fans of Sherlock Holmes (but NOT \"perfectionist\" fans), and anyone who enjoys a young fellow showing up his elders.",
         "In the mid 80s, audiences were hungry for heroes in the mould of Indiana Jones. Films featuring Sherlock Holmes were quite out-of-fashion. People expected a hero with a bit of dash and a penchant for action; not a meticulous, stuffy, ultra-intelligent sleuth. Young Sherlock Holmes and the Pyramid of Fear is an unusual hybrid, because it takes the period trappings of a Holmes mystery and dresses them up with Indy-style action and mysticism. The story has young student doctor John Watson arriving at a boarding school in Victorian London. He meets, for the very first time, a brilliant young student named Sherlock Holmes and they rapidly become friends. At the same time, a series of bizarre murders have been going on close to the school. In each case, people have had terrible hallucinations and in desperate states of panic have inadvertently killed themselves. Holmes and Watson investigate, and uncover an ancient cult which is responsible for the killings. The film has its share of problems. For one thing, purists will know that the very first meeting of Holmes and Watson was described at the start of the book A Study in Scarlet, and didn't take place in a school. Some of the performances are overly hammy, particularly Freddie Jones in yet another of his wild-eyed characterisations. The idea of a huge pyramid being ingeniously concealed beneath a London warehouse is hard to swallow (surely someone would have noticed them building a construction of this size in such a tightly-packed city). However, the problems can be forgiven because the film moves at a lively pace and is invested with lots of clever dialogue and stirring action. There's even a touch of humour (something lacking from the original Conan Doyle novels). One scene in particular is most amusing, when young Watson is shot with an hallucinatory dart and imagines an army of living cream buns jumping into his mouth! The climactic duel on the ice is very excitingly staged too. There's also a surprisingly downbeat event at the end which thankfully strips the film of the typical 80s sentimentality. This is agreeable and entertaining stuff.",
         "I love this movie. The young actor to me was a young Sherlock Holmes. Nicholas Rowe as Sherlock, was human, respectful, humble, polite, wise and treated Watson like a brother not like the combative relationship in Sherlock Holmes 2009 and 2010. This Sherlock Holmes was not showy he was just a normal inquisitive guy who had instincts about certain crimes and went to the Lestrade/police with them. Sherlock was in love in this movie. Like the other movies this one had things that were not believable but more believable than 2009 and 2010 with their metal robots and ships. The special affects where great when victims experience the effects of the drug when shot with a blow gun. They saw thing like statues come alive and skull etc very scary. Watson's experience after being shot with the drug were funny. A stone opened at the cemetery that had shelves with all kinds of pastries. The pastries started jumping off the shelf,on to the ground talking to each other. They were all different sizes and shapes with big eyes and some pastries started shoving other pastries in to Watson mouth cherry cream and all. Really humorous . There wasn't a lot of fighting in this film until the end. It was like one of the Indiana Jones movies with the cult members running for their life and the building falling down. This is one movie that did not disappoint me.",
         "The crime solving team of teenagers Sherlock Holmes (Rowe) and John H Watson (Cox), prep school students by day, but crime solving sleuths at night. When young John Watson starts mid term at a London Prep school, he is greeted first by a tall slender lad of about sixteen. Sherlock Holmes proceeds to tell Watson all about himself before they have exchanged hellos. The stunned Watson admires the older lad from that moment on. At first reluctant to involve himself in Holmes schemes, Watson finds himself up to his neck in a series of murders, as he trots beside the lanky Holmes. When they rescue a man from nearly killing himself to destroy an imagined attack, they are told a strange tale of betrayal and vengeance. When he attempts to get Sergeant Lestrade (Ashton-Griffiths) involved in solving the murders of several men, Lestrade calls them suicides and angrily orders Holmes out of his office. That is only the beginning of an adventure that takes the boys to the notorious Wapping district where a nefarious cult of murderous religious nuts, led by the cruel and mysterious Eh Tar (Higgins), is doing heinous things to young ladies, including - to his horror, Elizabeth Hardy (Ward) Sherlock's first love! The cast is excellent, the period London sets and costumes are great and the direction by Barry Levinson (The Natural, Rain Man) is commendable. All told, a satisfying entry into the Holmesian legend. Might be a bit intense for very young children but otherwise a fine family film. I Heartily recommend seeing this film.",
         "This is an awesome movie. The only drawback was the absurd dealing with the \"flying machine.\" Other than that, sit back and enjoy as Watson and Holmes embark on their alleged first adventure as Holmes tries to find the link between a rash of recent murders, hallucinations people have been having, and a cult. Not a bad way to spend a few hours of your time! ** 1/2 out of ****"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Family",
         "Fantasy",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Amblin Entertainment",
         "Industrial Light & Magic (ILM)",
         "Paramount Pictures"
      ],
      "summaries": [
         "Sherlock Holmes and Dr. Watson meet as boys in an English Boarding school. Holmes is known for his deductive ability even as a youth, amazing his classmates with his abilities. When they discover a plot to murder a series of British business men by an Egyptian cult, they move to stop it.",
         "Paired with the owlish, reticent young Watson, Sherlock Holmes embarks on the solution of a mystery that involves a hallucinatory and lethal drug, and a religious cult celebrating ancient Egyptian rites of mummification. They all enter and view, from a hiding place, an Ancient-Egyptian-themed cult, known as the Rame-Tep (also known as Rametep and Ramatep), performing a ceremony in which a young girl is hypnotized, wrapped in linen and killed with the pouring of boiling wax atop her body. The trio gets spotted, and are each hit by a thorn and experience their own horrific hallucinations in a graveyard, but eventually recover.",
         "When assorted people start having inexplicable delusions that lead to their deaths, a teenage Sherlock Holmes decides to investigate."
      ],
      "budget": 18000000
   },
   "movielensId": 2414,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-12-04",
      "dvdReleaseDate": "2003-12-02",
      "directors": ["Barry Levinson"],
      "runtime": 109,
      "movieId": 2414,
      "title": "Young Sherlock Holmes",
      "mpaa": "PG-13",
      "actors": [
         "Nicholas Rowe",
         "Alan Cox",
         "Sophie Ward",
         "Anthony Higgins",
         "Susan Fleetwood",
         "Roger Ashton-Griffiths",
         "Matthew Ryan",
         "Earl Rhodes",
         "Freddie Jones",
         "Patrick Newell",
         "Patrick Newell",
         "Nadim Sawalha"
      ],
      "imdbMovieId": "0090357",
      "originalTitle": "Young Sherlock Holmes",
      "genres": [
         "Action",
         "Adventure",
         "Crime",
         "Drama",
         "Family",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["kJoAQO5FX50"],
      "plotSummary": "Sherlock Holmes and Dr. Watson meet as boys in an English Boarding school. Holmes is known for his deductive ability even as a youth, amazing his classmates with his abilities. When they discover a plot to murder a series of British business men by an Egyptian cult, they move to stop it.",
      "tmdbMovieId": 11904,
      "avgRating": 3.37327,
      "releaseYear": "1985",
      "numRatings": 2821,
      "posterPath": "/wtf58Ld4C23zQFidUfH4lN2aR1f.jpg"
   }
}