{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0092173",
      "video": false,
      "title": "Violets Are Blue",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Augusta 'Gussie' Sawyer",
               "gender": 1,
               "credit_id": "52fe4e0bc3a368484e20b32d",
               "name": "Sissy Spacek",
               "profile_path": "/zauFMssYujKk7Kadz0t100VU5WE.jpg",
               "id": 5606,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Henry Squires",
               "gender": 2,
               "credit_id": "52fe4e0bc3a368484e20b331",
               "name": "Kevin Kline",
               "profile_path": "/u9QXn3fL7zCC2c6HA2vFgH1JxZg.jpg",
               "id": 8945,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ruth Squires",
               "gender": 1,
               "credit_id": "52fe4e0bc3a368484e20b335",
               "name": "Bonnie Bedelia",
               "profile_path": "/10JhoIaKHQGG0DNbQECTI4gHNn9.jpg",
               "id": 7673,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tony",
               "gender": 2,
               "credit_id": "52fe4e0bc3a368484e20b339",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4e0bc3a368484e20b329",
               "name": "Jack Fisk",
               "profile_path": "/5T0M4HdNTKkTzY7kkNYIotegJtq.jpg",
               "id": 5632,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "5414475c0e0a261992001c4d",
               "name": "Naomi Foner Gyllenhaal",
               "profile_path": "/uiMV7Sr2lQ0GHnl8r34GBK8KlXj.jpg",
               "id": 100388,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "541447b90e0a2619a4001ba6",
               "name": "Patrick Williams",
               "profile_path": null,
               "id": 7422,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [],
      "popularity": 0.962714,
      "production_countries": [],
      "id": 215875,
      "vote_count": 2,
      "budget": 0,
      "overview": "After fifteen years of traveling around the world Gussie (Spacek), a famous photographer, returns to the Maryland coastal resort where she grew up",
      "similar": [],
      "original_title": "Violets Are Blue",
      "runtime": 88,
      "poster_path": "/jEBkaGu3HaEvFzpjfdE2xvRWUNT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-04-04",
      "vote_average": 2.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jack Fisk"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Naomi Foner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092173/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3MDE0ODc5MV5BMl5BanBnXkFtZTcwNTIzODEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Sissy Spacek, Kevin Kline, Bonnie Bedelia | See full cast and crew »"],
      "reviews": [
         "This movie brought back so many memories of Ocean City, Maryland. My husband and I met there and we had so many fond memories.....we were together 33 years years and since his passing two years ago, I find myself traveling to the ocean to recapture that peace and tranquility we both had there. The movie lets me see and remember those things that young people experience in a small resort town. We lived there during the late 60's early 70's and the movie pinpointed one of the buildings we had lived in during that time, what a pleasure it was to watch the actors walk through places that my husband and I had shared many years ago......thank you!",
         "I've watched this movie at least 30 times, and I never get over how amazing it is. Sissy Spacek, Kevin Kline, and Bonnie Bedelia are so compelling, and I pine for Ocean City over and over again! This movie will take you back to every \"what if\" you ever had. A classic!",
         "This movie doesn't have a lot of great visuals (with the exception of a quick shot of Kevin Kline's cute, naked butt). It doesn't have fast-paced action.....But the story and the acting make it a great film. Kline, Spacek, and Bedelia put in some great performances, and they make this film an intense drama, with their subtle and realistic portrayals. It's certainly not the best film any of those actors ever did, but it is truly a joy to watch them in.",
         "Kevin Kline is one of my very favorites. He's quite sexy in this film. Sissy Spacek is beautiful. When the two looked at each other, they made the screen melt. This is one time I was rooting for the 'other woman.' It makes us all think about the one that got away.",
         "I have seen the movie so many times and still love it. I think the Theme Song is great (as well as being a tearjerker). If you have ever let a girl get away or lost her to someone else, this movie really hits home. If you know Ocean City, Md.; it will make you long for a vacation. Sissy Spacek, Kevin Kline and Bonnie Bedelia give excellent performances. This movie gives a great impression of Ocean City and the scenes on Assateague are excellent. If you haven't seen this film I would recommend that you try to find it or at least watch for it on TV, (though, I haven't seen it listed lately, on TV). If you are a Sissy Spacek fan or have visited Ocean City, I recommend this film, you'll love it.",
         "I saw this when I was 8 years old. Since I live in Maryland, I was so excited to find out that a movie was being filmed in Ocean City. Its definitely one to see if you enjoy a good tear-jerker. Sissy Spacek is wonderful as Gussy Sawyer, the former girlfriend of Henry Squier (Kevin Kline). There are some scenes with the Boardwalk of Ocean City that makes me homesick every time I see it.",
         "Have you ever imagined yourself going back to your birthplace after many years away? Well, imagine so. There you are, meeting your love from old times, now married. Would all that flame come back? What would happen? This film is about this. A very good option for a rainy Sunday afternoon. And Sissy Spacek, like always, shines.",
         "I was vacationing in Ocean City, Maryland when this film was being made. I remember hearing on the radio that the production crew was looking for background extras for some early scenes in the film. I wish I had tried out for one! I have always had a soft spot in my heart for this film, not simply because I love Ocean City, but because this movie is proof that a simple story, told with honest sincerity, can rise head and shoulders above flashy production values and overblown dramatics. Spacek and Klein do quite well with their lead roles. Low-key dramas like this seem more down to Earth because this is how real people such as ourselves would act in similar situations. By wisely omitting any shots of the many high rise condominiums of northern Ocean City, the filmmakers have done an excellent job of portraying this as a small coastal town. If romantic sentimentality is not your thing, you'll probably yawn through this movie. But if you're the type of person to often look back and wonder \"what if,\" then Violets Are Blue is certainly worth your time.",
         "A movie everyone can relate to. Lost love, a chance to go back and relive the past. I think everyone would like to try it just once. Kevin Kline is the sensitive leading man, and Sissy Spacek plays a great 'other woman'. Set in Ocean City, this movie will leave you remembering \"The Good Times\".",
         "In a picturesque coastal town in Maryland, a married family man is reunited with an old sweetheart, a pretty photographer who's been traveling the world for the last fifteen years. Putting freshly-scrubbed Sissy Spacek in the role as 'the other woman' doesn't really sit right with us because, basically, it's tough to swallow Spacek as the proverbial homewrecker. Sissy's real-life husband Jack Fisk directed the film, and although he sets up some good-looking shots, he doesn't feel the need to involve us in this character's thoughts: does she have a selfish agenda or is she removed from all the confusion and heartache she causes? The screenplay is a limp, squashy mess--a compendium of Woman's Picture clichés--and Kevin Kline doesn't have much to do but stare at others thoughtfully or look conflicted. *1/2 from ****"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Rastar Films",
         "Delphi IV Productions"
      ],
      "summaries": [
         "After fifteen years of traveling around the world Gussie (Spacek), a famous photographer, returns to the Maryland coastal resort where she grew up. She meets her high school sweetheart Henry (Kline), now married and running the local newspaper he's inherited from his father. An awkward and tension-filled romance ensues.",
         "Young love may endure in your heart and one day re-ignite, but reality may soon dowse the flames."
      ],
      "budget": 0
   },
   "movielensId": 2415,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-04-04",
      "dvdReleaseDate": null,
      "directors": ["Jack Fisk"],
      "runtime": 88,
      "movieId": 2415,
      "title": "Violets Are Blue",
      "mpaa": "",
      "actors": [
         "Sissy Spacek",
         "Kevin Kline",
         "Bonnie Bedelia",
         "Mike Starr"
      ],
      "imdbMovieId": "0092173",
      "originalTitle": "Violets Are Blue",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "After fifteen years of traveling around the world Gussie (Spacek), a famous photographer, returns to the Maryland coastal resort where she grew up",
      "tmdbMovieId": 215875,
      "avgRating": 2.88462,
      "releaseYear": "1986",
      "numRatings": 78,
      "posterPath": "/jEBkaGu3HaEvFzpjfdE2xvRWUNT.jpg"
   }
}