{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "journalist",
            "id": 736
         },
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "infidelity",
            "id": 1326
         }
      ],
      "imdb_id": "tt0091188",
      "video": false,
      "title": "Heartburn",
      "recommendations": [
         22414,
         40962,
         50116,
         52744,
         10551,
         36288,
         32048,
         31640,
         54087,
         26686,
         32855,
         40509,
         36094,
         25697,
         27397,
         49815,
         4988,
         31633,
         32075,
         41971
      ],
      "backdrop_path": "/8aMa4AFayX1pGDVJ6VonDW2Pvyv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rachel Samstrat",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dc8f",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mark Forman",
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dc93",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Richard",
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dc97",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vera",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dc9b",
               "name": "Maureen Stapleton",
               "profile_path": "/7zazX6qycXK1CBXkNT1t9FCEEkk.jpg",
               "id": 21151,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Julie Siegel",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dc9f",
               "name": "Stockard Channing",
               "profile_path": "/5UFMOfbzod42UiPUna59Ch1e37a.jpg",
               "id": 8893,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Arthur Siegel",
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dca3",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dca7",
               "name": "Catherine O'Hara",
               "profile_path": "/nDlIwrkmvz11mwsKSTAbM2dfDgC.jpg",
               "id": 11514,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Harry Samstat",
               "gender": 0,
               "credit_id": "52fe45a79251416c7505dcab",
               "name": "Steven Hill",
               "profile_path": "/bFmYHIgtlvGkAZirHVfNL1C0Ry7.jpg",
               "id": 21521,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Dimitri",
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dcaf",
               "name": "Miloš Forman",
               "profile_path": "/nKnsrK9h02F1QlMetkyr9R45VGM.jpg",
               "id": 3974,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Annie Forman",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dcb3",
               "name": "Mamie Gummer",
               "profile_path": "/u2MPC4TTPZKgJy5DB3Z87Ot20hc.jpg",
               "id": 47281,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Thelma Rice",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dcb7",
               "name": "Karen Akers",
               "profile_path": null,
               "id": 75688,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Juanita",
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dcbb",
               "name": "Aida Linares",
               "profile_path": null,
               "id": 75689,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Subway Thief",
               "gender": 2,
               "credit_id": "55b9b5ed92514123d80038ad",
               "name": "Kevin Spacey",
               "profile_path": "/x7wF050iuCASefLLG75s2uDPFUu.jpg",
               "id": 1979,
               "order": 12
            },
            {
               "cast_id": 29,
               "character": "Judith",
               "gender": 1,
               "credit_id": "5900e090c3a36810d700071f",
               "name": "Caroline Aaron",
               "profile_path": "/9v9h9bR4CX6MrpZFgEktTHFIlgT.jpg",
               "id": 1910,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dcc1",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dcc7",
               "name": "Nora Ephron",
               "profile_path": "/2DO8ef3VVkcmMX2m0Qfz01IkMl4.jpg",
               "id": 9248,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dccd",
               "name": "Nora Ephron",
               "profile_path": "/2DO8ef3VVkcmMX2m0Qfz01IkMl4.jpg",
               "id": 9248,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dcd3",
               "name": "Robert Greenhut",
               "profile_path": null,
               "id": 3658,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dcd9",
               "name": "Mike Nichols",
               "profile_path": "/eJgJEVil7iOJ9sTAXLCVRKfeKKM.jpg",
               "id": 5342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a79251416c7505dcdf",
               "name": "Joel Tuber",
               "profile_path": null,
               "id": 75690,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dceb",
               "name": "Sam O'Steen",
               "profile_path": null,
               "id": 12015,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dcf1",
               "name": "Juliet Taylor",
               "profile_path": null,
               "id": 1046,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dcf7",
               "name": "Tony Walton",
               "profile_path": null,
               "id": 18755,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dcfd",
               "name": "John Kasarda",
               "profile_path": null,
               "id": 17220,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a79251416c7505dd03",
               "name": "Susan Bode",
               "profile_path": null,
               "id": 17221,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe45a79251416c7505dd09",
               "name": "Ann Roth",
               "profile_path": "/cT4EtdqvG0Yq4EQ3LASXiwyndYi.jpg",
               "id": 5493,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a79251416c7505dd0f",
               "name": "Ezra Swerdlow",
               "profile_path": null,
               "id": 21968,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "5737e40ac3a3681372000ebe",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.772601,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13818,
      "vote_count": 62,
      "budget": 0,
      "overview": "Rachel is a food writer at a New York magazine who meets Washington columnist Mark at a wedding and ends up falling in love with him despite her reservations about marriage. They buy a house, have a daughter, and Rachel thinks they are living happily ever after until she discovers that Mark is having an affair while she is waddling around with a second pregnancy.",
      "similar": [
         37265,
         843,
         27066,
         36630,
         28468,
         4507,
         283227,
         884,
         32868,
         1259,
         21484,
         247,
         688,
         10998,
         106646,
         112160,
         69,
         86331,
         244772,
         634
      ],
      "original_title": "Heartburn",
      "runtime": 108,
      "poster_path": "/2lEISs6Kj1Gs4svXNWAcYcmXlNA.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1986-07-25",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Nichols"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Nora Ephron",
         "Nora Ephron"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091188/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2MjYyMTEzMF5BMl5BanBnXkFtZTcwODUxODUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Meryl Streep, Jack Nicholson, Jeff Daniels | See full cast and crew »"],
      "reviews": [
         "It is some years since I saw this film, but I definitely thought at the time it was vastly under-rated, and now that I have seen the voter's scores for this, I am surprised all over again. Obviously, I have to log off and go to the video store to refresh my memory, but: the story was great, the song Joni Mitchell contributed was one of her all-time bests, and how could Meryl Streep ever be in anything that wasn't worthwhile? By the way, the book was better, punctuated with recipes. It is an autobiographical tale, which bursts the balloon of the Watergate heroes and is definitely one of the most entertaining and realistic of the cinematic versions of life and love.",
         "Let's face it, these aren't the two most likable people on the planet, but that's only because writer Nora Ephron may have been a little too hard on herself. (Actually, she's hard on most everyone in this.) We care about this relationship, and the performances ofthe excellent cast make it intriguing at first, but viewers are just as likely to grow impatient with these characters as they do with each other. It's worth seeing, but a hard film to love. Now, some words about the Carly Simon song, \"Coming Around Again.\" I heard the song before I saw the movie and it no doubt affected my viewing of it. So many movies seem to just tack on any old song at the end credits, but this song really captures the essence of love and marriage and brings out all the emotions of a great film scene in merely a few minutes. I cannot believe the overblown \"Take My Breath Away\" from \"Top Gun\" (also overblown) won the 1986 Oscar for Best Original Song, and \"Coming Around Again\" was not even nominated! Perhaps this is why Carly Simon won her Oscar for \"Let the River Run\" two years later, to make up for this gross omission. (She would also duet with Streep during the end credits of \"Marvin's Room\"--an even better film.) The song alone is reason enough to see \"Heartburn\".",
         "Although somewhat artificial, the humor and \"heartburn\" of this Nora Ephron film seem more affecting and less manufactured than those in her more slick subsequent films, When Harry Met Sally... and Sleepless in Seattle. Perhaps the autobiographical slant helped. Meryl Streep and Jack Nicholson play a couple based on Ephron and Carl Bernstein. They meet, marry, settle in Washington, and have children. Streep's wedding-day jitters, it turns out, were amply justified; she discovers an affair between her husband and a social-climbing hostess. Streep is so luminous and so natural that one may not realize until the end of the film how completely insipid and devoid of any distinguishing qualities her character is. \"Rachel\" changes from a wan, nervous divorcee (before meeting Nicholson's character) to an obsessively devoted wife and mother who keeps babbling about how happy she is. Nicholson is well-cast as the rakish but (initially) endearing husband. The supporting cast reflects the expert hand of Juliet Taylor, Woody Allen's longtime casting director, who peppered it with many familiar faces, including Allen favorites Joanna Gleason, Caroline Aaron, and Karen Akers. Maureen Stapleton is particularly droll as Streep's shrink. Nineties audiences will enjoy seeing Kevin Spacey as a neurasthenic mugger. The comedy in the film is somewhat uneven, but often extremely engaging, as in a running parody of \"Masterpiece Theatre.\" And compare the spontaneous bravado of Nicholson's lopsided rendition of \"Soliloquy\" from Carousel (the comic highlight) to the forced quirkiness of Meg Ryan's tone-deaf \"Surrey with the Fringe on Top\" in When Harry Met Sally...",
         "Heartburn is probably classified as a \"chick flick\", but I don't care. It is a very good story about real people living in the real world. I'm sure there are many men out there that would probably fall asleep during this, due to lack of machine gun fire or kung foo fighting. But for women it is a great slice of life piece. I could watch it over and over again. It has some great comedic moments, from Mark (Jack Nicholson) and his friend Arthur (Richard Masur) several times as they have profound discussions about every day things in a Woody Allen type banter. One part that always touches me is when Rachel finds out about Mark's affair and confronts him. A few minutes later she is packing up to leave and we hear Carly Simon's song \"Coming Around Again\" on the soundtrack. If you listen to the lyrics of the song it perfectly fits the action that is going on at that moment. It helps the viewer understand Rachel's despair. Her idea of the perfect marriage has been shattered. Anyway, if you want to watch a movie with heart, then this is it. I think many of the people who say this movie is boring or garbage are too used to today's action standards and dismiss it too quickly. By the way, this is also a semi biographical account of now director Nora Ephron's marriage to a Washington journalist. The book is also a good read as well. If you think Mark treated her badly in the movie, it is nothing compared to the book. In summary, Heartburn is a movie for people who are emotional and intelligent.",
         "I can watch this movie over and over again and will never get tired of it.Meryl Streep and Jack Nicholson at their best! I originally loved the book as well. The ups and downs of a marriage juggling carreers,pregnancy,adulterous spouses,social events etc is really brought up in a masterful but still truthful way. Streep was actually pregnant for real in the movie.The subtext she brings out in her acting and all the little details just make you love her more and more. Her culinary tricks makes you run for your notebook.I actually get so hungry for Carbonara whenever I watch this movie. It is full of tears and laughter and you can't help loving it. I take this movie to my heart forever.",
         "Heartburn is a movie that admittedly requires little thinking or concentration, but I still found it very watchable. However, the beginning is a bit odd. *SPOILERS* Within the first 20 minutes Mark and Rachel have met, gone on a first date, had sex, agreed they never wanted to get married again, and then got married! I found it all very rushed and under developed, and I was tempted to turn off at this point. I was glad I didn't. Once all of this is over, Heartburn actually turns into a good movie. It's a very realistic, and often humorous account of an everyday marriage. Baby Annie is very cute! I was wondering how they managed to get a 2 year old to co-operate in such a way, but I understand that she's actually Meryl Streep's real life daughter? It definitely shows. Scenes between the two of them were really sweet and often very funny, and again realistic. But then, sadly, the ending lets this movie down. I found it very abrupt and un-explained, much like the beginning. It's a shame really, the centre of the movie is very enjoyable. I cannot understand why the producers didn't see the under-development of the plot at the beginning. And then nothing really happens at the end. Sure she leaves Mark again, but she already did that once and went back. So what exactly was she going off to do? Hmm, didn't really 'get' the ending at all. Cute scene on the plane though. *END SPOILERS* While all of this sounds relatively boring, I can assure you it isn't. Heartburn is a very pleasant movie, just don't expect any major surprises.",
         "Like a good relationship that goes sour, \"Heartburn\" is impossible to love but hard to write off entirely. Despite its fine cast and script by Nora Ephron, the film is disjointed and, ultimately, dishonest. Meryl Streep and Jack Nicholson play two Washington journalists who meet at a wedding, and \u0097 seemingly in the next scene \u0097 are saying their own vows. The developments that follow in their relationship are just as abrupt and just as believable. The rapid-fire pace of their many separations and reconciliations stretches credibility to the limit, and it's hard to generate any interest in these characters when it was never clear what drew them together in the first place. Streep does a fine job as magazine writer Rachel, but Nicholson's cad is all too familiar in his role of Mark, the womanizing columnist. Supporting players Stockard Channing, Maureen Stapleton, Jeff Daniels and Kevin Spacey, while uniformly excellent, seem underutilized and distract from the main plot. \"Heartburn\" is worth watching, if only for its strong cast, but it's as memorable as leftover lasagna.",
         "When I watch a movie I always find myself looking at the number of Oscar winners, for acting & directing, are in the movie. The Oscar winners could be for performances either prior to or subsequent to their performance in the movie I'm watching. This one features Meryl Streep, Jack Nicholson, Mercedes Ruehl, Maureen Stapleton, Kevin Spacey, Milos Forman [acting not directing] and Mike Nichols. Just goes to show that outstanding actors and directors need a good story and/or script to make a good movie. Although Nora Ephron has been nominated for 3 Oscars for screenplays she has written, this one just didn't do it for me and, from the tone of most of the comments, for many other people. Of course, I'd enjoy watching Streep & Nicholson reading the phonebook.",
         "Nora Ephron adapts her best-selling novel (a transparent dramatization of her failed marriage to reporter Carl Bernstein) to the big screen, but in the process falls into the same trap that snares too many filmed versions of popular fiction. In a nutshell, the movie is all dialogue and precious little depth, presenting a bare bones account of marital love and infidelity that skims lightly over the salient points of the relationship without ever scratching any dramatic surface. A large part of its appeal (if not its only attraction) lies in watching the not inconsiderable combined talents of Meryl Streep and Jack Nicholson, but the popularity of the two stars only undermines their ability (with a script this thin, at any rate) to effectively ply their trade. Viewers will see the actors, not the character each is supposedly portraying, and if proof were needed try to recall in detail afterward anything about their respective roles.",
         "When viewing this movie, I en visualized a film making challenge. It was almost like presenting a class of senior year cinematic arts students with a graduate project. Take Jack Nicholson, Meryl Streep and add a few seasoned comedic supporting members such as Catharine O'Hara, and produce the most boring movie imaginable. The set was dreary, repetitive, and depressing. Nicholson and Streep took to their characters well, but even their efforts couldn't save this one. The lackluster plot was commonplace and predictable. It played out like a slow moving expanded drama that replicates itself millions of times in American homes. In fact many of you could have watched the same drama unfold in the homes of your neighbors, co-workers or family. So why go to the theater or rent this DVD?"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "An autobiographical look at the breakup of Ephron's marriage to Carl \"All the President's Men\" Bernstein that was also a best-selling novel. The Ephron character, Rachel is a food writer at a New York magazine who meets Washington columnist Mark at a wedding and ends up falling in love with him despite her reservations about marriage. They buy a house, have a daughter, and Rachel thinks they are living happily ever after until she discovers that Mark is having an affair while she is waddling around with a second pregnancy.",
         "Rachel and Mark meet at a mutual friend's wedding, go to bed and get married shortly afterwards. She works in publishing in New York, he is a successful Washington columnist, who is always using his friends and social life as material for his column. All goes well initially with the marriage, despite the fact they endure months of renovation by incompetent builders on their Washington home. A child is born, Mark proves himself a fond father, and another baby is soon on the way. Then Rachel discovers that Mark has been having an affair with one of their circle. Heavily pregnant, she briefly returns to her father's home in New York. Mark comes after her; he says he loves her and asks her to return to him."
      ],
      "budget": 20000000
   },
   "movielensId": 2417,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-07-25",
      "dvdReleaseDate": "2004-07-06",
      "directors": ["Mike Nichols"],
      "runtime": 108,
      "movieId": 2417,
      "title": "Heartburn",
      "mpaa": "",
      "actors": [
         "Meryl Streep",
         "Jack Nicholson",
         "Jeff Daniels",
         "Maureen Stapleton",
         "Stockard Channing",
         "Richard Masur",
         "Catherine O'Hara",
         "Steven Hill",
         "Miloš Forman",
         "Mamie Gummer",
         "Karen Akers",
         "Aida Linares",
         "Kevin Spacey",
         "Caroline Aaron"
      ],
      "imdbMovieId": "0091188",
      "originalTitle": "Heartburn",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Rachel is a food writer at a New York magazine who meets Washington columnist Mark at a wedding and ends up falling in love with him despite her reservations about marriage. They buy a house, have a daughter, and Rachel thinks they are living happily ever after until she discovers that Mark is having an affair while she is waddling around with a second pregnancy.",
      "tmdbMovieId": 13818,
      "avgRating": 2.95913,
      "releaseYear": "1986",
      "numRatings": 575,
      "posterPath": "/2lEISs6Kj1Gs4svXNWAcYcmXlNA.jpg"
   }
}