{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "harassment",
            "id": 2539
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "rape attempt",
            "id": 10735
         },
         {
            "name": "torture",
            "id": 13006
         },
         {
            "name": "grave digging",
            "id": 170468
         },
         {
            "name": "submission",
            "id": 187236
         },
         {
            "name": "defenseless woman",
            "id": 228402
         },
         {
            "name": "police inaction",
            "id": 228403
         }
      ],
      "imdb_id": "tt0091024",
      "video": false,
      "title": "Extremities",
      "recommendations": [
         5735,
         52315,
         39074,
         4292,
         49332,
         9881,
         41974,
         60591,
         1877,
         22033,
         58419,
         41127
      ],
      "backdrop_path": "/ggOoBkkXsig7yCWpu3QPf8DAZhw.jpg",
      "revenue": 13418091,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Marjorie",
               "gender": 1,
               "credit_id": "52fe4684c3a36847f810347b",
               "name": "Farrah Fawcett",
               "profile_path": "/aUMdPKJVwIHJhZX8BZlFbroaRwP.jpg",
               "id": 28768,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe4684c3a36847f810347f",
               "name": "James Russo",
               "profile_path": "/tV4X0uEuqu6XYml3yEs9rsG9EzW.jpg",
               "id": 785,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Patricia",
               "gender": 1,
               "credit_id": "53d1536e0e0a265de700d249",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Terry",
               "gender": 1,
               "credit_id": "53d153800e0a265dfc00cf58",
               "name": "Diana Scarwid",
               "profile_path": "/1Z11dGfpfJygcL0r3CYLFREEU8l.jpg",
               "id": 2958,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Officer Sudow",
               "gender": 1,
               "credit_id": "582cc8e4c3a3683e4900275c",
               "name": "Sandy Martin",
               "profile_path": "/l7vi9wIV8yZOdv8y5h7cpFXVPRU.jpg",
               "id": 53931,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Officer #1",
               "gender": 2,
               "credit_id": "582cc8fbc3a3683e4f002812",
               "name": "Eddie Velez",
               "profile_path": "/1CbsEzlt6fQmxIo5t3QsNrqsFlb.jpg",
               "id": 88031,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Officer #2",
               "gender": 2,
               "credit_id": "582cc9089251417808002500",
               "name": "Tom Everett",
               "profile_path": "/nxrCAB3xL79EdWLwBUMwXj7FtI3.jpg",
               "id": 140250,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Woman on Phone (voice)",
               "gender": 0,
               "credit_id": "582cc959c3a3683e3800227a",
               "name": "Donna Lynn Leavy",
               "profile_path": null,
               "id": 1709782,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mother at Police Station",
               "gender": 1,
               "credit_id": "582cc96d9251417805002523",
               "name": "Enid Kent",
               "profile_path": null,
               "id": 1505203,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Pizza Man",
               "gender": 2,
               "credit_id": "582cc9959251417808002561",
               "name": "Michael Hennessy",
               "profile_path": null,
               "id": 102030,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Joe's Daughter",
               "gender": 0,
               "credit_id": "582cc9e2925141780500256f",
               "name": "Danika Hendrickson",
               "profile_path": null,
               "id": 1709783,
               "order": 10
            },
            {
               "cast_id": 7,
               "character": "Racquetball Player",
               "gender": 1,
               "credit_id": "573a4a6fc3a36854fe000628",
               "name": "Clare Wren",
               "profile_path": null,
               "id": 156575,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Security Guard",
               "gender": 2,
               "credit_id": "582cc9f9925141780800258f",
               "name": "James Avery",
               "profile_path": "/iDJcKHZ67yQv8nAeAUhM8PhQxzb.jpg",
               "id": 51547,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4684c3a36847f8103485",
               "name": "Robert M. Young",
               "profile_path": null,
               "id": 86293,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "582ccb659251417808002664",
               "name": "William Mastrosimone",
               "profile_path": null,
               "id": 80959,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "582cca1c925141780b00259f",
               "name": "Arthur Coburn",
               "profile_path": null,
               "id": 800,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "582ccaa9c3a3683e49002894",
               "name": "Curtis Clark",
               "profile_path": null,
               "id": 47855,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "582ccb01c3a3683e4f00299c",
               "name": "Sharon Bialy",
               "profile_path": null,
               "id": 6479,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "582ccb0b925141780e0025bc",
               "name": "Richard Pagano",
               "profile_path": null,
               "id": 2624,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "582ccb1b9251417805002626",
               "name": "Linda M. Bass",
               "profile_path": null,
               "id": 23973,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "582ccb26925141780b002622",
               "name": "J.A.C. Redford",
               "profile_path": null,
               "id": 66941,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "582ccb32925141780500262e",
               "name": "Chester Kaczenski",
               "profile_path": null,
               "id": 138634,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "582ccb53c3a3683e38002385",
               "name": "Burt Sugarman",
               "profile_path": null,
               "id": 25184,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "582ccb6a9251417805002645",
               "name": "William Mastrosimone",
               "profile_path": null,
               "id": 80959,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "582ccb80925141781100263f",
               "name": "Thomas Coleman",
               "profile_path": null,
               "id": 551917,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "582ccbb992514178140026e2",
               "name": "George W. Perkins",
               "profile_path": null,
               "id": 21961,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "582ccbc492514178080026a2",
               "name": "Scott M. Rosenfelt",
               "profile_path": null,
               "id": 68530,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "582ccbd392514178140026f2",
               "name": "Kerry Lyn McKissick",
               "profile_path": "/5IAKLVCEBwqWBmMG0JEYgjfDaO0.jpg",
               "id": 1355532,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "582ccbf39251417814002707",
               "name": "Michael F. Barrow",
               "profile_path": null,
               "id": 37039,
               "department": "Lighting",
               "job": "Gaffer"
            }
         ]
      },
      "genres": [{
         "name": "Thriller",
         "id": 53
      }],
      "popularity": 5.301155,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44326,
      "vote_count": 20,
      "budget": 0,
      "overview": "A woman escapes from the man who is about to rape her, but leaves her purse behind. Afraid that her attacker might come after her, she goes to the police, but with no proof of the incident, they can do nothing. In fact, the man does use the information in her bag and comes to her apartment with the intent of rape, but she sprays him in the face with insect repellent, and then holds him captive. She is then faced with deciding whether to go to the police who might not believe her and release him, or to kill him.",
      "similar": [
         156022,
         357096,
         8090,
         2652,
         281957,
         39681,
         3134,
         73861,
         123109,
         158011,
         74997,
         37645,
         979,
         1571,
         238636,
         562,
         281,
         27576,
         395834,
         588
      ],
      "original_title": "Extremities",
      "runtime": 89,
      "poster_path": "/pMN14kaump5CrzbSl1C0a2E0M4f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Atlantic Entertainment Group",
         "id": 3267,
         "origin_country": ""
      }],
      "release_date": "1986-08-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "When fear made her a victim, she turned fear into a weapon.",
      "adult": false,
      "homepage": null,
      "status": "Rumored"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert M. Young"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "William Mastrosimone",
         "William Mastrosimone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091024/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MzczODczMF5BMl5BanBnXkFtZTcwNjY5NTczNA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Farrah Fawcett, James Russo, Alfre Woodard | See full cast and crew »"],
      "reviews": [
         "EXTREMITIES is the disturbing, yet riveting screen version of a play by William Mastriosimone (who adapted his own play for the screen) about a woman who is attacked in her car one night by a would-be rapist on her way home and is terrified when she realizes the man got her purse and knows where she lives. After her roommates leave for work the next day, the guy shows up at her home and attempts to rape her. The story takes a surprising twist when, at one point, the woman turns the tables on the man and is able to overpower him; but when she realizes there is no way that attempted rape can be proved and if the man is arrested, he will just get off, she decides to keep him prisoner in the house until she can get a confession out of him. Far-fetched? Maybe. Disturbing? Definitely, but there's a wonderfully claustrophobic feel about this film, especially the middle with just the woman and her attacker, that you can't help but feel completely a part of what's going on. I did not see the play on Broadway, but I would imagine a piece like this works better onstage, but that doesn't make this film any less riveting an experience. Farrah Fawcett, one of the last actresses to do the role on Broadway, was awarded the role of Marjorie in the film version and delivers a taut and deeply moving performance as the victim who refuses to be a victim. Many critics found Fawcett's performance to be one-note, but for me, Marjorie is a woman completely numbed by what she has been through and the performance works for me. James Russo, in the performance of his career, is slimy and menacing as the would-be rapist who finds Marjorie to be much more of a challenge than he assumed. Alfre Woodard and Diana Scarwid co-star as Marjorie's roommates, who come home after Marjorie has overpowered the guy and has him tied up and stuffed in their fireplace upon their arrival. And it's the arrival of the roommates that take the story to an unexpected level because they didn't see what we saw Marjorie go through and therefore, think she should call the police and let them handle the guy. Not for the faint of heart, but if you can stand it, a gripping film experience anchored by a lead performance that will surprise you.",
         "Farrah Fawcett is superb in this powerful 1986 drama, where she plays Marjorie, a woman who manages to escape the clutches of a would-be rapist. Well done to Farrah for being a Golden Globe 'Best Actress' nominee. When her rapist Joe (terrifically played by James Russo) comes into her home, which she shares with her two roommates (who are conveniently out!), Marjorie has to play along with Joe's frightening demands. It does make for some disturbing and shocking images! When her roommates come home, they are astounded (to say the least) by Marjorie's actions, and a great performance by Alfre Woodard who desperately tries to convince Marjorie to do the right thing and turn him into the police, makes the film even more nail-biting. I do find Diana Scarwid quite irritating, but when Joe finally admits that he came there to kill them all, it makes the film a very emotional piece of drama indeed. Overall, Extremities is a brilliantly thought-out and well-acted movie and I must have watched it hundreds of time by now! Well done to everybody involved.",
         "Kudos to Fawcett to taking on roles that, at the time were considered controversial. To my recollection, rape was still a taboo subject in the 1980's, and women's rights and emotions were rarely so deeply examined during that time. Fawcett is simply a woman who is followed, then stalked by actor James Russo. He is adequate as the obsessed psychopath, but at times a bit transparent. Diana Scarwid has a bit role, as does Alfre Woodard as the house mate. Woodard worries about the legal consequences when Fawcett, the rape victim, takes revenge on the culprit. The scene where she throws a frying pan of hot oil at Russo is classic, and as the rapist he deserves it. She then keeps him in bondage, and the consequences must be faced. A very real story reflecting the emotions and rage of rape victims who have been violated, physically, and mentally. Highly recommended. 8/10.",
         "I am a Fawcett fan, liked her in Charlies Angle's and I thought she was amazing in The Burning Bed. I liked this movie more when I was a kid, probably because I had less of an understanding of reality. I thought the performances where great from the main two characters, but the rest, is just not believable. What is believable is that pig would have been released, even with a confession that was circumstantial at best, an attorney would have had a field day with that. She had a knife to his throat so it didn't mean anything. More over, it is perfectly legal to kill an intruder in your home, whether they're there to rape you or still your freaking television. So that's why the plot was ridiculous to me. I wouldn't have had to ponder anything, I wouldn't have needed a confession. What I would have done was killed him, quite painfully, and then called the police.",
         "This was some strong movie. Very powerful, very different. Yet strangely, I didn't warm to it as much as I should have. That does not diminish the movie's power. This just proved very difficult to watch. I can certainly appreciate the theme of having one's dignity stolen and the need to take back one's power. The movie itself was wonderfully acted and directed. And obviously it was SUPPOSED to be hard to watch. I just wish I had warmed to it enough to give it a 10 like \"The Accused\". I think part of the problem was the limited focus of the camera,these 2 people starring almost by themselves, the story mainly going back and forth between Farra's Character and her rapist.After awhile it gets to you. All in all this was an edgy film that's certainly thought provoking and worth watching. I doubt I'd see it again but the film as a whole is very well done.",
         "Extremities is a story of a man, overwhelmed with guilt, one that has proved to be fatal, turning him killer. When first learning of this film, back at the start of '87, I thought it was just about some psycho getting his kicks, raping women. Little did I know. Our rapist, Joe has already raped a score of women and disposed of em'. Only his latest, Marjorie (Fawcett in a great dramatic performance) has managed to escape when first car jacked and driven to a deserted underpass. Marjorie explains her situation to the police, none too helpful, where the police woman tells her straight, there's a chance he could get off. Farrah's even mistaken for a hooker by a young cop, who interrupts the not so progressing well conversation. She leaves, irate, and by not signing this certain form, the cops can't take action. The rapist has got her wallet with her id, so we know what's gonna ensue. We too see Joe, has a family where he has been kept pretty faceless up to this point. When he's in his little shed, examining Farrah's id, his cute little daughter knocks on the glass, informing him, dinner's almost ready. So now with Farrah, it's a waiting game. Her two housemates, Patti and Terri, have been informed of the situation. Even when the pizza guy, comes delivering a meal, Farrah is rather surly, when he asks if the three of them live together, which is understandable. Then days later, low and behold, a man freely enters her house, asking after a Joe. And from here, the real drama and suspense begins, claustrophobic, one would say, as Russo, great here, gets quite physical and cruel, at one point almost threatening to toss a pan of burnt bacon onto her. He also examines her particulars, even making opportunity to indulge in some forced sex, cause in reality, there's no way in hell, she'd go out with this creep of low class status. Keeping with the stage play, she finally turns the tables on the attacker, after luring him on, when on top of her, falsely. She then sprays his eyes with insecticide, cracks a hot glass kettle of coffee over his head, before strangling him and barricading him in a fireplace, from which there is no escape. Not much sooner does her two friends return from work and cross this scene of madness. The two do not agree with her illogical plan of murder, which too could be seen as logical, if this madman gets off. We do weigh these real life options. Scarwid, a great character actress, brings an effervescent, quirky and sexy character as Terri, while the more mature Woodard, gives a very humane and real performance, I liked. She's the only one showing compassion to the not so healthy looking Russo. Farrah at one point, who's taken enough of her, says \"Why don't you just f..k him. That'll make him feel better\". Extremities is a real film of real situations and choices. Even near the end, Scarwid chooses to stay with Russo, when Farrah and co, get the cops, warming up to him some, as hearing his reasons. One particular moment with Farrah running her knife down Russo's lower region, may make you flinch. This is a great dramatic film, that I wouldn't suggest a rape victim should watch. It's all too real, as are the performances, and I'm not just talking the mains. You will feel pretty washed out at the end of this, too, as in these claustrophobic movies. The up tempo music score, at it's opening is all so unfitting though, even though I liked it a lot, so.",
         "As a stage play, one can imagine how shocked audiences were when they stepped into William Mastrosimone's \"Extremities.\" Having to watch a woman on stage being brutalized in her own home by a stranger is not an experience I imagine to be fun. But it is a fascinating and utterly compelling story that leads into some very unexpected directions. In 1986, \"Extremities\" became a movie, adapted by Mastrosimone himself. With the incredible performances of Farrah Fawcett and James Russo, some very believable fight choreography, and a tightly woven script, \"Extremities\" goes to new extremes as a film. Alone in her car one night, innocent Marjorie is threatened by a man with a knife. Just before he attempts to rape her, she escapes. The bad news is the cops aren't helpful and the criminal has her credentials. He knows where she lives. A week later, Marjorie is home alone while her friends, the attractive Terry and social worker Pat, are away at work. Out of the blue, a man waltzes right into the house and asks Marjorie if a guy named Joe lives there. No matter how many times she tells him \"No Joe lives here,\" it becomes evident that this is the man that attacked Marjorie the other night. He beats her, tries to smother her with a pillow, and then tries to rape her again. But he doesn't get away with it when Marjorie sprays him in the face with insect repellent, ties him up, and jails him in the fireplace. But when Terry and Pat come home and there's no proof that the attacker laid a hand on her, Marjorie's only safety net is to keep him locked up until he confesses his sins. If he doesn't, she'll kill him. Ariel Dorfman's \"Death and the Maiden\" bears remarkable similarities to \"Extremities,\" but Mastrosimone's story works exceptionally well as a film knowing the decade that the film was released in. The same decade produced such crime movies as \"The Accused\" and TV's stunner \"The Burning Bed,\" another Farrah Fawcett feature. This was when women took hold of their sexuality and wouldn't allow themselves to be exploited by men. Keeping that in mind will allow the viewer of \"Extremities\" to connect to the plot, whether they're male or female. The movie also raises several questions about where the line is drawn in terms of justice. If a man rapes or beats a woman, does the victim have a right to physically hurt the other person? Worse: if there's no proof of rape, what can the victim do to save herself? Marjorie pulls no punches. She is dead serious about keeping the police out of it and killing this home invader. But with his word against hers, she could go to jail for life. Though she is fully aware of the consequences, she can't allow him to walk away. \"Extremities\" is controversial, and gives the viewer plenty to talk about when the movie's over. However, I find it impossible to avoid the movie's rather typical opening, which begins differently from the play. The opening is almost like a B-grade 80's slasher movie, and I'm sure that's not what Mastrosimone was aiming for. But things get much better once we're isolated with Marjorie and the rapist in the house. When he walks through the front door, the guy easily gives us the creeps. We know he's up to something. The tension grows and grows as he commits more embarrassing and painful acts towards Marjorie. When she takes control, the suspense goes together perfectly with the drama, a classy combination for a movie so gritty and violent. In terms of casting, Mastrosimone and director Robert M. Young picked up two of the stage production's regulars: the beautiful Farrah Fawcett and the alarmingly intimidating James Russo. Fawcett was just breaking free from her \"Charlie's Angels\" reputation, and this movie put her on the map. Marjorie is not at all an easy role to play, but Fawcett gladly accepts the challenge. Her performance is booming and simmering with a quiet anger. She makes Marjorie a very sympathetic and frail woman at first. Notice how her voice breaks every time she's about to cry. And when she throws the rapist in the fireplace and threatens him with a shovel, you understand her pain. Fawcett turns Marjorie into a force not to be messed with. How she walked away without an Oscar nomination proves that this woman was one of the most underrated actresses of her time. James Russo is absolutely spine-tingling as the rapist. His beady eyes and twisted smile make your skin crawl every time he's on screen, which is for the majority of the film. He, too, deserves more praise. Alfre Woodard is decent as Pat, but Diana Scarwid's performance as Terry is flawed. It is basically too over-the-top. She cries too much, and her dialog is delivered too unbelievably, her worst case being a monologue about a past encounter with a rapist. What translated so effectively on stage to the public has changed here, and the way Scarwid portrays it, it comes off more as forced subtext than being related to Marjorie's troubles. Does \"Extremities\" have its minor quibbles? Of course. Most movies do. But this is a film that plays most of its cards correctly and aims its darts close to the bullseye. If it weren't performed so believably by its leads, the movie wouldn't have nearly as much impact as the play. Movies like this are always more frightening when you realize that it can happen. Mastrosimone's story feels very real, which helps \"Extremities\" to be a powerful adaptation.",
         "I can't say that I enjoyed this movie as much as I think it achieves what it sets out to do... WAKE PEOPLE UP! The movie relies on good acting to suck you into watching the first halve then shocks you repeatedly with emotional violence. If you just want a bit of mindless Tits and ass then this is not for you but if you want to be challenged emotionally, give it a watch. I'd just like to answer the previous review who was upset because as he puts it; \"At the end this movie actually left me feeling sorry for the rapist which I sincerely doubt was the intention of the director.\" No, you didn't miss out and yes you are indeed meant to feel (a bit) for the rapist, he pushed her over the edge into a place where SHE became the monster!... that is the whole point of the play.",
         "Marjorie (a splendid and riveting performance by Farrah Fawcett) narrowly avoids being assaulted in her car by vicious serial rapist Joe (superbly played with frightening conviction and intensity by James Russo). However, Joe steals her wallet and finds out where Marjorie lives. He pays her a visit one fateful day. After subjecting Marjorie to plenty of degradation and psychological abuse, Marjorie manages to turn the tables on Joe and locks him in the fireplace. What is Marjorie going to do with Joe? Director Robert M. Young and screenwriter William Mastrosimone concoct a harsh, gritty and often disturbing morality tale that astutely nails the stark brutality and painful debasement of rape while also showing how any person when pushed to extremes is capable of shocking acts of violence and inhumanity. Joe perceives women strictly as objects while Marjorie only sees Joe as an \"animal.\" However, this movie to its admirable credit refuses to make Joe out to be simply a vile one-dimensional creep; instead he's a terrifyingly real and ultimately pitiable human monster with a wife and kid (Joe's climactic confession in particular is genuinely poignant). Fawcett and Russo are both outstanding in the leads; they receive fine support from Diana Scarwid as the passive Terry, Alfre Woodard as the sensible Patricia, and Sandy Martin as sympathetic policewoman Officer Sudow. Both Curtis Clark's agile cinematography and J.A.C. Redford's shivery, skin-crawling score greatly enhance the considerable claustrophobic tension. A real powerhouse.",
         "I've never been a fan of Farrah Fawcett...Until now. She was truly amazing in this movie. The emotion she must have gone through shooting re-take after re-take doesn't bare thinking about. This was a very hard movie to watch, the subject matter is decidedly unpleasant and you feel so helpless just sitting and watching a woman being abused for what seems like an eternity. I actually felt that the whole thing deflated somewhat when her friends returned to the house and I didn't find the conclusion at all plausible. The director seemed very keen in using height in his shots and loved using mirror reflections, I believe he should have paid more attention to the pace in the second half of this piece. I'm sure this makes a heck of a powerful piece of theatre, this movie for me, although it had merit, just fell short."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Atlantic Entertainment Group"],
      "summaries": [
         "An intended rape victim manages to escape from her attacker but leaves her purse behind. Worried that he may visit her house and finish what he has started, she contacts the police but they are unable to help, saying that she has no proof. \"If he calls, let us know and we'll send a man round!\" A fat load of good that would be. Her worst fears are realised when, alone one day in the house, her attacker visits and attempts again to rape her. Circumstances allow her not only to resist the attack but to turn the tables and lock him away. And that is where her dilemma really starts. Does she release him and risk another attack? Does she go to the police and risk being called a liar? Or does she kill him - and become as low as him?",
         "A woman takes revenge on the man who invades her home and tries to rape her."
      ],
      "budget": 0
   },
   "movielensId": 2419,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-22",
      "dvdReleaseDate": "2002-04-16",
      "directors": ["Robert M. Young"],
      "runtime": 89,
      "movieId": 2419,
      "title": "Extremities",
      "mpaa": "R",
      "actors": [
         "Farrah Fawcett",
         "James Russo",
         "Alfre Woodard",
         "Diana Scarwid",
         "Sandy Martin",
         "Eddie Velez",
         "Tom Everett",
         "Donna Lynn Leavy",
         "Enid Kent",
         "Michael Hennessy",
         "Danika Hendrickson",
         "Clare Wren",
         "James Avery"
      ],
      "imdbMovieId": "0091024",
      "originalTitle": "Extremities",
      "genres": ["Thriller"],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman escapes from the man who is about to rape her, but leaves her purse behind. Afraid that her attacker might come after her, she goes to the police, but with no proof of the incident, they can do nothing. In fact, the man does use the information in her bag and comes to her apartment with the intent of rape, but she sprays him in the face with insect repellent, and then holds him captive. She is then faced with deciding whether to go to the police who might not believe her and release him, or to kill him.",
      "tmdbMovieId": 44326,
      "avgRating": 3.18766,
      "releaseYear": "1986",
      "numRatings": 389,
      "posterPath": "/pMN14kaump5CrzbSl1C0a2E0M4f.jpg"
   }
}