{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "opera",
            "id": 2199
         },
         {
            "name": "eunuch",
            "id": 4001
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "dresden",
            "id": 6384
         },
         {
            "name": "opera singer",
            "id": 164920
         }
      ],
      "imdb_id": "tt0109771",
      "video": false,
      "title": "Farinelli",
      "recommendations": [
         65002,
         66957,
         12266,
         62847,
         134184,
         40522,
         4528,
         34068,
         111965,
         40651,
         38986,
         204853,
         130750,
         52216,
         63607,
         48561,
         51548,
         17677,
         114089,
         64522
      ],
      "backdrop_path": "/74WYEHJdmlXRWRM5SYNZZtKUyZm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Carlo Broschi (Farinelli)",
               "gender": 0,
               "credit_id": "52fe43d89251416c750205b3",
               "name": "Stefano Dionisi",
               "profile_path": "/qV9KyDhb0AuxHYMUr1UqhbBPhb.jpg",
               "id": 16240,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Riccardo Broschi",
               "gender": 2,
               "credit_id": "52fe43d89251416c750205b7",
               "name": "Enrico Lo Verso",
               "profile_path": "/riYINKQIv8mxYwtfj0L899K0iPu.jpg",
               "id": 27392,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alexandra",
               "gender": 1,
               "credit_id": "52fe43d89251416c750205bb",
               "name": "Elsa Zylberstein",
               "profile_path": "/bw1bIuyfyOyxRlx2qIKk4AwQLTU.jpg",
               "id": 39195,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "George Frideric Handel",
               "gender": 0,
               "credit_id": "52fe43d89251416c750205bf",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Margareth Hunter",
               "gender": 1,
               "credit_id": "545bccd90e0a261fad002556",
               "name": "Caroline Cellier",
               "profile_path": "/1nEAjccvMInsSq7f0G1O6GRWEno.jpg",
               "id": 25838,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43d89251416c750205c5",
               "name": "Marcel Beaulieu",
               "profile_path": null,
               "id": 41519,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d89251416c750205cb",
               "name": "Gérard Corbiau",
               "profile_path": null,
               "id": 67794,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d89251416c750205d1",
               "name": "Walther van den Ende",
               "profile_path": null,
               "id": 24721,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43d89251416c750205dd",
               "name": "Véra Belmont",
               "profile_path": null,
               "id": 41518,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43d89251416c750205e9",
               "name": "Joëlle Hache",
               "profile_path": null,
               "id": 35394,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.015064,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 10954,
      "vote_count": 27,
      "budget": 0,
      "overview": "Farinelli is a 1994 biopic film about the life and career of Italian opera singer Farinelli, considered one of the greatest castrato singers of all time.",
      "similar": [
         769,
         5915,
         462,
         11202,
         640,
         371638,
         318846,
         324786,
         389015,
         407445,
         363676,
         277216,
         396371,
         323677,
         228970,
         274479,
         152532,
         300671,
         276907,
         138843
      ],
      "original_title": "Farinelli",
      "runtime": 111,
      "poster_path": "/mF1PyZIJ2l3B3d2S41LrqjPL5Sc.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MG",
            "id": 37581,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stéphan Films",
            "id": 2359,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Italian International Film",
            "id": 1429,
            "origin_country": ""
         }
      ],
      "release_date": "1994-12-07",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Où s'arrête le pouvoir de sa voix?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gérard Corbiau"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Andrée Corbiau",
         "Gérard Corbiau"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0109771/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxMzI3MTQ2NV5BMl5BanBnXkFtZTcwMzQxMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Stefano Dionisi, Enrico Lo Verso, Elsa Zylberstein | See full cast and crew »"],
      "reviews": [
         "I know I'm being sort of anal by mentioning this, but this movie, as beautiful and enchanting as it is, has many inaccuracies. Farinelli, in addition to his handsome features and heavenly voice, was also a very humble person and hardly displayed the raucous behavior of a \"rock star\" as depicted in the film. Second, the singer was known as disinterested in sex, thus I have no idea why the sex scenes in the film were included. True, there WERE castrati who did engage in pleasures of the flesh, but Farinelli was NOT one of them, or at least there are no historical records suggesting so. All that aside, this movie was a lavishly done production and a must-see!",
         "Farinelli is not nearly as awful as I feared it would be. It's similar in many ways to Amadeus. Like Amadeus, it has glorious music beautifully performed. Like Amadeus, it tells a good (if melodramatic) story. Like Amadeus, it has a marvelous period feel. Like Amadeus, the characters in this story have the names and occupations of real people, but their portrayal on the screen is not even caricature: a caricature necessarily starts with something recognizeable. Farinelli was famous in history not merely for a phenomenal voice and outstanding musicianship and musical connoisseurship, but for poise, dignity, and perfect-pitch judgement of human character; he is portrayed throughout as a hysteric. Handel is shown as a pompous, bullying nervous wreck verging on the psychotic, quite at variance with all reliable accounts of his humor, sturdiness, practicality, and reputation for scrupulous probity toward his musicians and singers. Handel could not have said, to Farinelli, during the latter's first sensational season with the Opera of the Nobility, that he would never write another opera, and not just because Handel was no faux-Freudian opera queen: Lady History inconveniently discloses that after that 1733-34 season Handel composed and presented Ariodante, Alcina, Atalanta, Giustino, Arminio, Berenice, Faramondo, Serse, and Imeneo; his last opera, Deidamia, went unperformed, but several in that list were significant successes, and some were revived more than once. The two rival opera companies in London went down the drain more or less simultaneously, notwithstanding the enormous draw of Farinelli for the Nobility company, and notwithstanding the high quality of the music of its principal composers (Porpora, Hasse, undervalued today) and the stupendous quality of Handel's music (also undervalued); rather, the people with the money to afford the (by our standards) enormous ticket prices had simply lost interest. One commentator here is skeptical about many \"period\" details. And rightly: for starters, that's not the way boys were castrated, but you don't need to know the truth. Relax, just enjoy the music and the costumes and the actors chewing the scenery.",
         "Director Gerard Corbiau's Farinelli won Best Picture of 1995. The foreign film, mixed Italian and French, retells the story of the famous and greatest castrato singer Carlo Broschi. The film is exotic, intensely emotional and loaded with beautiful music of the Baroque Era (1600-1750). With all the good things about this movie, comes some things that might be rather disturbing or inappropriate for a younger audience. This is assuredly an adult film. There are two explicit sex scenes at the beginning and end of the film. This is a movie for an adult who is interested in the period, in the life of the castrati and in opera at this time. The opening introduces Carlo Broschi as a little boy singing in the church choir. Another young lad has been castrated to preserve his voice and is so mortified he leaps to his death. Eventually Carlo's brother Riccardo is obligated to do the same to his brother. We don't learn until later in the film that it was Riccardo and not Carlos' brother that conducted the castration. Here, Farinelli is usually quite ill and is forced to take opium as medicine. Farinelli does not seem to think highly of his brother's operas, which are written exclusively for his voice. Instead, he believes the greatest composer of this time is George Frederic Handel, played convincingly by Jerome Krabbe. In a dinner party, in which the Nobles insult Handel, Farinelli is outraged and declares that Handel will long be remembered and not the Nobles and their operas. This ends up being true since Handel is considered one of the greatest composers of this period together with Johann Sebastian Bach. The movie has some inaccuracies and are not historically true. Naturally, this being a costume drama, there are some elements which were entirely fictional created for the sake of sensationalism. Although it is true Riccardo Broschi did compose operas for his brother Farinelli, there is no real evidence they \"shared\" the women they bedded. In the movie, a Countess is so enamored with Farinelli that she jumps into bed with him only to discover he's castrated. Thus, Riccardo plants the seed and Farinelli only lures the women into bed and seduces them. This is fabricated material to \"sex up\" the movie. In real life, Farinelli I'm inclined to believe was chaste. He sung many times for religious services and was a devout Catholic. He may not have been at all bitter for his castration since he lived like a king all his life, surrounded in luxury. He was well acquainted with European royalty, all of Europe loved him and he died after years of singing in the chambers of King Phillip of Spain. The rivalry between the Nobles Theatre Opera and Handel's opera company is true. In fact, it remains the only true thing about this movie. The English in London disliked the German foreigner Handel and his prominence in London. He was so beloved that even King George and Queen Anne protected him. The Nobles schemed endlessly to get rid of Handel. The portrayal of Handel as a musical genius, a man of stubborn, perfectionist character is all true. I think the most moving scenes are those with Handel, such as the scene in which Farinelli is overhearing him play the organ in the church and is moved by the music and the scene of Farinelli singing \"Lascio Chio Pianga\" from Rinaldo which ultimately moves Handel to tears. All the scenes of opera and Farinelli singing in his majestic costumes in this movie are stunningly beautiful. Finally, this movie's soundtrack is incredible. It contains the combined voices of tenor Derek Rogin and soprano Ewa Mallas as the singing voice of Farinelli. The arias sung here are taken from Riccardo Broschi's operas Idaspe and Artaserse and from Handel's Julius Caesar and Rinaldo. A superb film and a must see for fans of Baroque opera.",
         "This remarkable film remains one of my favourites. The story line at first left me wondering why the director had chosen to make the film in the first place. Luscious scenery, beautiful costumes, sets, extravagant, but historically accurate stagings for the opera scenes, great language and dialogue - but why make a film about an all but forgotten singer from almost three centuries ago? Nothing in the film seemed to give a clue as to why anyone would go to all the bother of reconstructing a marvelous voice so painstakingly, and choose one of the great performers of our time to oversee the performances of the music. Repeated viewings did not seem to throw any light on the vexing question that, despite all the lushness and splendour I was still missing some point to the whole exercise. It was only on the third or fourth viewing that I noticed in the opening credits a small remark - in French - \"to the memory of my daughter . . \"name\"\". Suddenly the whole thing made sense. This marvelous and true story of the castrato is, perhaps, the directors attempt to describe his impotence in the face of the loss of his beloved child. Viewed in this light the ending of the film and the sequences in London between Farinelli and Benedict finally begin to have a poignancy and a sadness that is truly stunningly and sensitively achieved whilst adding to the story line. I love this film and cannot possibly recommend it enough. Any lover of Early Music should revel in it, but it has been lifted out of the ordinary and into the universal and sublime by that one small realization. Superlatives cannot do it justice.",
         "I think some long periods of Farinelli's life are left out. The film is too focused on his love life, making it definitely a female movie. There were a lot of other aspects to explore. We also get to see the obligatory scenes of audiences being mesmerized by opera, as if they were some island natives and not opera house regulars. Nevertheless, being a high budget movie, it has great costumes and beautiful scenery. Most of all you get the chance to explore the divine music of Haendel.",
         "'Farinelli' is a film well worth seeing for its memorable visual imagery and its unique soundtrack. Mid-film scenes set against the decadence of 17th-century European court life make for charming costumes and sets. Contrasting visuals of rural Italy provide their own pastoral allure that is no less charming. Moreover, the film rises admirably to the daunting technical and artistic task of reproducing the tone of a castrato voice, considering that the musical world has not seen or heard a castrato singer for more than a century. 'Ah,' you say, 'sounds gorgeous...but what's it about?' Enter Carlo and Riccardo Broschi, Italian brothers who share musical aspirations: Riccardo composes, and Carlo sings what he writes. Carlo is a gifted castrato, but Riccardo is a mediocre composer at best. In time, Carlo becomes the renowned Farinelli while Riccardo struggles with his lack of talent/recognition as well as the troublesome fact that Carlo is his meal ticket. The simple story line masks rich potential (think 'Amadeus'), but 'Farinelli' is hampered by shallow character development and its inexplicable tendency to substitute all-too-frequent sex scenes for emotional power. Without the full realization of the characters or the ramifications of the plot, the film struggles to keep a viewer engaged, at least in my own case. The beautiful pageantry of 'Farinelli' fails to compensate for its hollow dramatic core. In short? Not bad, but a better music movie is 'Amadeus'(among others), and a better movie with beautiful Italian visuals is 'A Room With A View' (among others).",
         "This movie is about Farinelli, one of the famous Castro Singers during the 18th century. He had the voice of an angel when he was a boy and since his family was very poor, an operation of castration was done to him in order to preserve his voice and help his family out in poverty. There were some strange parts during this film such as when he got older he and his brother Riccardo traveled together and never left each other. His brother was there during Farinelli's lovemaking in order to complete and finish the task that his brother could not do since he had been castrated. And then there was the white horses that Farinelli saw every time danger was present or near. This warning was not clearly explained in the film. The acting was very good. I enjoyed the variation of languages of French and Italian with a little bit of English thrown in. The costumes were excilent and the way the actors portrayed the characters during that past time period were done good. One makes you feel sorry for Farinelli because of what he did lack and also makes you feel for him because everybody would make a specticle of him because of his castration and the fact that he could not complete the task of lovemaking (personally..... I do not think that he really needed that, he was good being his own person anyway). Farinelli's popularity had worn down during the middle of his career due to his excessive use of opium in which his brother provided for him in order for him to sleep and get rid of any pain or stress. During the end of the movie we find that it is Riccardo that turned his little brother in because of his ability to sing and thus help his poor familiy. Not much is mentioned of his familiy but in the beginnig of the movie we do know that his family was poor and Farinelli offered himself as well as his voice because his voice was all that he did have in order to stay alive. This movie was a good film and I give it about a 7. There were several parts in the film that were not clearly explained and that was the only flaw.",
         "Something seems strangely amiss with what could have been a fascinating historical glimpse into the world of the castrati (castrated male opera singers) in 18th-century Europe. This 1994 Belgian film is an opulent production full of stunning costumes and set decorations, but director Gerard Corbiau is far more focused on the co-dependency between two real-life brothers, Carlo Broschi, the swoon-worthy castrato known to the world as Farinelli, and his marginally talented composer brother Riccardo. Although there are glimpses of the castration that occurred when Carlo was ten, the narrative deals very little with the psychological anguish of this act, instead showing extravagantly vainglorious scenes of Farinelli's impact on audiences at the time. It's as if the story structure of the Baroque operas written at that time took over the sensibility of the screenplay and trivialized the human complexities into exaggerated melodrama. Despite a valiant effort by Stefano Dionisi in the title role, Farinelli is portrayed as a moody, self-centered egotist rather than a misunderstood artist. Compounding the problem is the fact that his masculine speaking voice is at odds with his ethereal singing voice (obviously a creative decision so as not to alienate the general audience from the character's plight). Moreover, the computerized melding of countertenor Derek Lee Ragin and soprano Ewa Mallas Godlewska into Farinelli's voice simply does not sync up well with Dionisi's lip and throat movements. In other words, you simply don't believe it's Dionisi's voice coming out of him. When the film finally takes flight in the last third of the film, it's because the focus has shifted to the competitive, intense relationship between Farinelli and the great composer of the age, Handel. Jeroen Krabbe - familiar to American audiences for his nasty turn as Barbra Streisand's condescending husband in \"The Prince of Tides\" - plays Handel with such passionate fury that I wish the film was more about his character. This sequence climaxes with the film's musical highlight, a trio of wonderful, truly classic arias from Handel's \"Rinaldo\". Unfortunately, the remaining musical performances are not nearly as absorbing and rather repetitive. The film again flails toward the end when we are given a rather silly scene involving a solar eclipse and gratuitous nudity with a ménage a trois among Farinelli, Riccardo and Alexandra, the woman who is - quite literally - between them. The remaining performances are fine with Enrico LoVerso conveying his Salieri-like inferiority with appropriate fervor, Elsa Zylberstein beguiling as Alexandra and Caroline Cellier doing a fine Jeanne Moreau impersonation as the jaded Margareth Hunter. Overall it's still a relatively disappointing movie saved by Handel's musical genius. Except for a few trailers, there are no extras with the DVD. For those interested in the world of the castrati in more penetrating detail, I suggest reading Anne Rice's 1982 novel, \"Cry to Heaven\", and the \"Rinaldo\" arias are better served by countertenor David Daniels and mezzo-soprano Cecilia Bartoli on their 2002 cast recording conducted by Christopher Hogwood.",
         "This film was great. Even if the singing looked a little fake at times, and there was a bit too much sex than was really necessary, but a great film, with beautiful music. I thought more emphasis would have been put upon the anguish and degradation Farinelli might have felt, and more stress on the love/hate relationship the public had with the castrati, but definitely a film worth seeing.",
         "This was an extremely pretty, but ultimately pretty unengaging film. The sets are lovely and the singing, for those who like this kind of music, is great but ultimately the story failed to engage me on anything but a superficial level. The based on truth story just doesn't have enough going on to merit a movie. Yes, Farinelli has no testicles and can't ultimately satisfy his lovers. In steps his brother to \"finish the job\". About the only interesting tidbit I gathered was that you ultimately find out this brother is the one who actually arranged to turn Farinelli into a castrato. Yuck. I get that. So what is next? Unfortunately, not much."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Stéphan Films",
         "MG",
         "Italian International Film"
      ],
      "summaries": ["Farinelli, is the artistic name of Carlo Broschi, a young singer in Handel's time. He was castrated in his childhood in order to preserve his voice. During his life he becomes to be a very famous opera singer, managed by his mediocre brother (Riccardo)."],
      "budget": 0
   },
   "movielensId": 242,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1994-12-07",
      "dvdReleaseDate": "2000-08-29",
      "directors": ["Gérard Corbiau"],
      "runtime": 111,
      "movieId": 242,
      "title": "Farinelli",
      "mpaa": "",
      "actors": [
         "Stefano Dionisi",
         "Enrico Lo Verso",
         "Elsa Zylberstein",
         "Jeroen Krabbé",
         "Caroline Cellier"
      ],
      "imdbMovieId": "0109771",
      "originalTitle": "Farinelli",
      "genres": [
         "History",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "EVbyR1zJ9DQ",
         "iGhlievFg24"
      ],
      "plotSummary": "Farinelli is a 1994 biopic film about the life and career of Italian opera singer Farinelli, considered one of the greatest castrato singers of all time.",
      "tmdbMovieId": 10954,
      "avgRating": 3.39415,
      "releaseYear": "1994",
      "numRatings": 1129,
      "posterPath": "/mF1PyZIJ2l3B3d2S41LrqjPL5Sc.jpg"
   }
}