{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "martial arts",
            "id": 779
         },
         {
            "name": "karate",
            "id": 3436
         },
         {
            "name": "okinawa",
            "id": 8676
         },
         {
            "name": "revanche",
            "id": 8677
         },
         {
            "name": "self esteem",
            "id": 155023
         }
      ],
      "imdb_id": "tt0091326",
      "video": false,
      "title": "The Karate Kid, Part II",
      "recommendations": [
         10495,
         1885,
         11231,
         9396,
         8536,
         10303,
         10136,
         9671,
         2605,
         12154,
         9336,
         951,
         9494,
         11824,
         12118,
         96,
         8845,
         11967,
         10414,
         10157
      ],
      "backdrop_path": "/dRoRqvQahkeGsOKuCNdx4nPGfF.jpg",
      "revenue": 115103979,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Daniel LaRusso",
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82b1",
               "name": "Ralph Macchio",
               "profile_path": "/nTiV5ux56X4dmX5Qvriw8r7SgLz.jpg",
               "id": 2877,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kesuke Miyagi",
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82b5",
               "name": "Pat Morita",
               "profile_path": "/eMLWaQ2uQIpiyVeaU7xl0ozs2B7.jpg",
               "id": 23915,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "John Kreese",
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82b9",
               "name": "Martin Kove",
               "profile_path": "/bdhzH4rNedFA2SpAQSfkBZ11VxC.jpg",
               "id": 56117,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Miyagi's Father",
               "gender": 0,
               "credit_id": "52fe44c1c3a36847f80a82bd",
               "name": "Charlie Tanimoto",
               "profile_path": null,
               "id": 56118,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Chozen",
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82c1",
               "name": "Yuji Okumoto",
               "profile_path": "/eVq0Od53a8JdfYLGHxkBboOtsIe.jpg",
               "id": 56120,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Toshio",
               "gender": 0,
               "credit_id": "52fe44c1c3a36847f80a82c5",
               "name": "Joey Miyashima",
               "profile_path": null,
               "id": 56121,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Taro",
               "gender": 0,
               "credit_id": "52fe44c1c3a36847f80a82c9",
               "name": "Marc Hayashi",
               "profile_path": null,
               "id": 56122,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Sato",
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82cd",
               "name": "Danny Kamekona",
               "profile_path": null,
               "id": 56123,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Johnny Lawrence",
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82d1",
               "name": "William Zabka",
               "profile_path": "/kHcFbjmtF3CPK8uIDzKh5aj2bUv.jpg",
               "id": 56124,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Kumiko",
               "gender": 1,
               "credit_id": "581e17a59251410a0400c6f8",
               "name": "Tamlyn Tomita",
               "profile_path": "/iX6zGWXFWLdUnxaVebXGzXXwgft.jpg",
               "id": 3134,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Yukie",
               "gender": 1,
               "credit_id": "581e1880c3a36806f300cc28",
               "name": "Nobu McCarthy",
               "profile_path": "/h5LOqYVtaPsDQ62GkFnCkjL1ak.jpg",
               "id": 29381,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82d7",
               "name": "John G. Avildsen",
               "profile_path": "/siyDKiK6rHXoU94pnLaE6jFe5dk.jpg",
               "id": 16513,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82dd",
               "name": "Robert Mark Kamen",
               "profile_path": "/zwGjOlFGizQxtBBAlgorm1Djw52.jpg",
               "id": 61,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82e3",
               "name": "Jerry Weintraub",
               "profile_path": "/wqmJO4ChjNmmlz3wZ8qoCIC1VG9.jpg",
               "id": 1888,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82e9",
               "name": "Bill Conti",
               "profile_path": "/cR6H9EFVkeGP0TnoX9RPNBB6hSN.jpg",
               "id": 10494,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82ef",
               "name": "John G. Avildsen",
               "profile_path": "/siyDKiK6rHXoU94pnLaE6jFe5dk.jpg",
               "id": 16513,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c1c3a36847f80a82f5",
               "name": "David Garfield",
               "profile_path": null,
               "id": 31463,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe44c1c3a36847f80a82fb",
               "name": "Jane Kurson",
               "profile_path": null,
               "id": 6900,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 11.033452,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8856,
      "vote_count": 578,
      "budget": 113,
      "overview": "Mr. Miyagi and Daniel take a trip to Okinawa to visit Mr. Miyagi's dying father. After arriving Mr. Miyagi finds he still has feelings for an old love. This stirs up trouble with an old rival who he originally left Okinawa to avoid. In the mean time, Daniel encounters a new love and also makes some enemies.",
      "similar": [
         11841,
         55292,
         140300,
         9053,
         233361,
         44865,
         146,
         9502,
         604,
         682,
         605,
         11770,
         24,
         7549,
         9461,
         2024,
         98566,
         16320,
         27578,
         8456
      ],
      "original_title": "The Karate Kid, Part II",
      "runtime": 113,
      "poster_path": "/mSne9mfUcL8QCGxF891LWa7lZNI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Delphi V Productions",
            "id": 1174,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1986-06-18",
      "vote_average": 5.9,
      "belongs_to_collection": {
         "backdrop_path": "/1ok5JGCsDt4Sh3CkFeXh2F2KB7F.jpg",
         "name": "The Karate Kid Collection",
         "id": 8580,
         "poster_path": "/o6h2F0C5eZOy50Q76fNYzc9mvvw.jpg"
      },
      "tagline": "This time, the combat is real.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John G. Avildsen"],
      "runtime": 113,
      "synopsis": "The opening of the story recaps events from the end of the previous film: Daniel LaRusso squares off against Johnny in the final match of the All-Valley Karate Tournament and wins the match and the tournament when he plants his mentor's, Mr. Miyagi's, signature move, a \"crane kick\" to Johnny's chin. Following the match, Daniel is showering and suggests to Miyagi that they perhaps go on tour to different karate championships. Miyagi kindly says that Daniel should consider \"early retirement\". Daniel humbly agrees. As they walk out to the parking lot, Daniel is congratulated by the tourney's announcer and referee on his win. Kreese, Johnny's sensei and owner of the Kobra Kai dojo, stalks past, pushing people angrily out of his way. He finds his students in the lot and berates Johnny for not winning the tourney. The scene turns ugly when Johnny talks back, telling his teacher that he's sick in the head. Kreese suddenly grabs Johnny in a headlock and backhands Jimmy, another of his students. Miyagi tells Daniel to wait by their truck and confronts Kreese, ordering him to let Johnny go. When he doesn't Miyagi frees Johnny himself. Kreese furiously tries to punch Miyagi, who easily dodges the blow. Kreese's fist breaks a car window. When he tries to hit Miyagi again, he breaks another car window when Miyagi sidesteps again. Miyagi forces Kreese to his knees and prepares to deliver a seemingly deadly strike to Kreese, growling Kreese' own words about showing an enemy no mercy. He gives a huge yell but stops short of landing the blow and instead honks Kreese's nose and drops him to the ground. Miyagi explains to Daniel that Kreese will have to live with the shame of being publicly humiliated, which is far worse than death. Six months later an angry Daniel arrives at Miyagi's house. The car that Miyagi gave him, a 1948 Ford Super De Luxe, is having mechanical trouble and Daniel, dressed in a tuxedo, is talking angrily about how badly his prom went: his girlfriend, Ali, had borrowed his car and had caused the mechanical trouble. Daniel also grouses about how Ali has found a new boyfriend. To make matters worse, Daniel tells Miyagi that his mother has accepted a temporary transfer to Fresno for the summer and Daniel will have to go with her. Miyagi quickly fixes Daniel's car and takes him to the back of his house where he seems to be constructing a new room. He persuades Daniel to calm down and focus with his breathing technique and shows Daniel how to drive nails with a single shot. Daniel soon feels better and asks Miyagi what the addition to the house is for. Miyagi tells Daniel that the room is for a \"refugee\" from Fresno -- he'd talked to Daniel's mother, who'd agreed to let Daniel stay in Los Angeles with Miyagi for the summer. A few minutes later, the mail carrier shows up and gives Miyagi an overseas letter. The letter is from Miyagi's former girlfriend in Okinawa -- Miyagi's father is dying. Miyagi has to travel to Okinawa to see his father before he dies. Miyagi also tells Daniel more of the story about his leaving Okinawa: he'd fallen in love with a young woman named Yukie who was betrothed to his best friend, Sato. Miyagi talks about how he was young and foolish and had told the entire village that he was going to marry Yukie despite her parents wishes. Sato, whose karate teacher was also Miyagi's father, challenged his friend to a duel to the death. Miyagi chose to leave rather than fight his best friend. When he's about to board his plane, Daniel suddenly shows up, having persuaded his mother to accompany Miyagi on the trip. Miyagi is reluctant and Daniel tells him he'd used his savings to buy the ticket. Miyagi agrees and they both fly to Okinawa. On the plane Daniel studies a book on Okinawan history and is strangely unable to locate Miyagi's village on the map. When they arrive they are met by a young man a few years older than Daniel, Chozen, who has a car waiting for them. Before Daniel gets in the car, Chozen shakes hands with Daniel, menacingly crushing Daniel's hand. Chozen and his driver take the two to a warehouse near the airport. They are met by Sato, who still holds a grudge against Miyagi and reminds him of his actions years ago. Miyagi refuses to fight Sato. Sato and Chozen leave Miyagi and Daniel to find their own way to town. In a taxi, they stop at the US Air Force base, which Miyagi remembers being the location of his village, called Tomi. An Air Force officer tells them that the village was moved years ago when the base expanded. Arriving at Tomi, Miyagi goes immediately to his father's house. He and Daniel are met by a young woman about Daniel's age, Kumiko, and Miyagi's former love, Yukie. Yukie is happy to see Miyagi and reveals that after Miyagi had left, she hadn't married Sato & hadn't ever married. Later, Miyagi's father requests that both his son and Sato see him. He joins their hands together, asking them to make peace between them right before he dies. Sato grants Miyagi three days to mourn and funeral his held. Miyagi takes Daniel on a tour of Tomi. They arrive at the fishing house where Miyagi used to work. Miyagi shares a story about how he was distracted when a large net of fish came in and he was almost impaled on the net hook. To demonstrate, he releases one of the hooks and swivels at the hips and knees, just barely avoiding being killed. Miyagi calls it the \"drum technique\", which is reminiscent of the ceremonial drum of the local villagers. Daniel asks to try himself and is forced to jump off the pedestal and falls into the water. Miyagi announces an end to the lesson, however Daniel tries again, releasing a hook on his own and successfully dodging it. Miyagi agrees with Daniel that it was a stupid thing to do. Meanwhile, Daniel has run afoul of Chozen, who is Sato's nephew and seems intent on harassing Miyagi in his uncle's name. Daniel catches Chozen cheating the villagers for food with fake scale weights. Chozen also seems jealous of Daniel's budding relationship with Kumiko, and harangues him often. When Kumiko sees Daniel practicing the \"drum\" technique he'd learned from Miyagi, she tells him it looks like an ancient Japanese dance called \"o-bon\". Chozen shows up, drunk, and teases Daniel. The confrontation turns violent and Chozen beats Daniel. While on a date with Kumiko, they go into a bar full of locals and American servicemen who, despite their obvious ignorance of martial arts, are trying to karate chop thick sheets of ice for money. None of them have made it through more than two sheets. Daniel explains to Kumiko what they're doing wrong and one of the Americans drops a challenge. Chozen suddenly appears offering 3-to-1 odds that Daniel can't break six sheets. Miyagi steps in, having been found nearby by Kumiko, and takes Chozen's wager. Sato is there too and covers Chozen's bet. At Miyagi's suggestion, Daniel meditates for a few moments and easily breaks all six sheets. Miyagi gives Daniel his share of the money. Later that night, Daniel goes with Kumiko to a 1950s sock hop. Chozen is there and begins to beat on Daniel and takes the money he'd lost back. Daniel hits Chozen in the crotch and gets his money back, retreating with Kumiko. Miyagi meets with Sato at Sato's house. There he finds Sato practicing on a large wood plank. Miyagi knows the plank is the same one they found on the beach as friends. Miyagi appeals to Sato, saying he still doesn't want to fight his old friend. Sato scoffs and walks away. Miyagi also reconciles with Yukie, saying he's sorry for leaving her. She tells him that she'd never married because of Miyagi's conflict with Sato. Daniel and Kumiko later see Miyagi and Yukie engaged in an ancient tea ceremony where they declare their love for each other. When Miyagi's three days of mourning have passed, Sato and Chozen show up at Miyagi's home. When they are unable to find Miyagi, Sato leaves, telling his nephew to \"leave a message\" for him. Daniel is awoken by their voices and goes downstairs to the courtyard and is immediately grabbed by Chozen's friends. Chozen threatens Daniel with spear, using it to get him in a choke hold while his friends tear up the courtyard garden. Miyagi appears and orders Chozen to let Daniel go. Miyagi then engages all three boys in a short fight, defeating them all, including Chozen who tries to use the spear. Miyagi wrests it away and stops short of stabbing Chozen with it, eventually breaking it in half. He takes Daniel in the house while the boys leave, telling his student they'll leave tomorrow. The next day Sato has part of the local's gardens bulldozed. Miyagi confronts Sato again, telling him that he'll fight him on one condition: no matter who wins, the deed for the land the village sits on will be turned over to the residents forever. Sato scoffs but agrees when Miyagi tells him that it's a small price to pay. Miyagi later talks to Daniel, telling him he's willed the house in Los Angeles and all it's contents to Daniel should he die in the fight. Miyagi goes off to prepare. Daniel passes by a small chapel where he sees Sato meditating. As he walks past, he sees Kumiko sitting alone in another house. When he joins her, he sees that she's prepared a tea ceremony for them both. When the ritual is complete, the two of them kiss. Suddenly a tropical storm kicks up and they're forced to find shelter in an old concrete bunker left over from World War II. Miyagi is there already and he and Daniel see the chapel that Sato was meditating in suddenly collapse. They both run over to find Sato pinned under a thick beam. While Sato yells about Miyagi taking advantage of his helplessness, Miyagi strikes the beam, breaking it in half. They free Sato and take him to the shelter. Daniel breaks off from them to help the little girl who was on a small tower ringing the town's emergency bell. Daniel brings her down from her perch and struggles to reach the shelter. Sato orders Chozen to help Daniel, but he refuses, ashamed. Sato runs out and helps Daniel out. When he makes it back to the shelter, he tells Chozen that he's dead to him. Chozen runs off into the storm. The next day, as the villagers are cleaning up, Sato joins them and hands the deed to the land over to Miyagi. Daniel approaches him and asks if they can hold an o-bon at the ruins of an old temple near the ocean. Sato agrees. The dance is held that night. One of the events has Kumiko performing a traditional solo dance. Shortly after she begins, Chozen suddenly slides down on a lantern rope and grabs her, holding her hostage and challenging Daniel to fight him. Daniel accepts and crosses the small bridge, throwing it into the moat. The two fight, seemingly to a draw. Suddenly Miyagi and the other spectators begin using their small drums. Chozen is distracted and Daniel begins to hit him repeatedly, having learned the counter punch of the technique. Chozen is beaten and Daniel tweeks his nose in the same manner that Miyagi used on Kreese. The film ends with Miyagi smiling and Daniel holding Kumiko.",
      "writers": [
         "Robert Mark Kamen",
         "Robert Mark Kamen"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091326/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg3ODc2Nzc3M15BMl5BanBnXkFtZTYwMDMzNzc5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Pat Morita, Ralph Macchio, Pat E. Johnson | See full cast and crew »"],
      "reviews": [
         "As a huge fan of the Karate Kid trilogy, you'll have to excuse me while I give my first sentimental statement ever on IMDb. I believe in my heart that in that parallel universe where our favorite characters from film still live, that Kumiko and Daniel would be together today. Either Daniel would have gone to Okinawa to be with Kumiko or Kumiko would have come to the States to be with Daniel. Of course, we learn in Karate Kid Part III that Kumiko decided not to go with Daniel back to California. But in my mind, this is insignificant and has no negative implication for their future. Sure, they both would have had relationships with other people. But having been through what they experienced together, they would not soon forget the bond between them. You wouldn't forget someone that saved your life? Compared to Ali from Part I and Jessica from Part III, it is more than apparent that Kumiko was the love of Daniel's life. Whether it be two years or ten years after the end of Part III, Kumiko and Daniel would have eventually reconnected and continued to live their lives together. Now if you'll excuse me, I'm going to go crush a beer can on my forehead to reconnect with my masculine side.",
         "I can't tell you how good it made me feel to recapture the joy I first experienced in the theater. I was 12 years old when this came out. The story and plot are simple, and the lessons are very clear. They definitely don't make films like this nowadays. Memories of me sitting in the theater alongside my grandmother, eating loads of buttery popcorn, and telling her about all the good scenes (she couldn't see well) I have seen this movie over 200 times, and never get tired of it. I recommend viewing both The Karate Kid, and the sequel to at least get the full effect. Awesome 80's flick, and one I'm proud to own. Five stars.",
         "Two years after the success of the smash hit \u0091Karate Kid', it was inevitable that the forces behind this most entertaining movie were going to go on and continue the story. In \u0091KK2' we get to learn a lot more about the life of Mr. Miyagi and the development of his student, \u0091Daniel-san'. We once again get to see that fighting is only the last resort to your problems. There's plenty of adventure and conflict as our triumphant duo discovers more about the price of honour, the way one must fight when only the winner survives and the true power of friendship. After their triumphant victory at the \u0091All-Valley karate championships', Daniel and Miyagi continue their training, focusing on the honour and discipline of karate and the deeper powers of meditation. However, when Miyagi receives news that his father is near death, he and Daniel take off to the island of Okinawa where Miyagi's family lives. Upon Miyagi's return to his homeland, he is reunited with his long-lost childhood love, Yukie. Despite their youthful love for one another, Yukie was forced to marry Miyagi's rival, Sato, in an arranged marriage, causing Miyagi to flee Okinawa forever. Now his old rival is a powerful karate expert and a rich, embittered landowner who demands a final grudge match with the wise and elderly Miyagi. As Sato threatens Miyagi and his family, his nephew, Chozen, is out to fight Daniel in a battle of young wills. Both teacher and student are forced to stand up to their rivals in a matter of honour or shame and life or death. What I like about KK2, is how the story allows us to learn more about characters that we grew to love in the 1984 movie. Sure the movie continues where the last finished off, not like your normal sequel does. Yet it does show us a different side to what we saw in the original movie. I feel that is what a sequel is meant to do, be a little bit different and allows us to learn new things about characters that we already know. The story was once again written by Robert Mark Kamen, who I thought wrote the part about Miyagi's problems back home beautifully, as is the way that we see Daniel assimilate to the customs and traditions of the Okinawa people, and the way that Miyagi's problems in the end are Daniel's as well. I feel it always helps to have the same director back for any sequel, with John G. Avildson back to bring his touches into the story as well. The great part of KK2 has to be the return of Daniel (Ralph Macchio) and Mr. Miyagi (Noriyuki \u0091Pat\u0091 Morita). The start of film has a most powerful scene between Miyagi and sensei Kreese (Martin Kove), where Miyagi teaches Kreese a karate lesson without even raising a sweat. The popular pairs return gives the story strength to continue on as it did. They also share quite a remarkable chemistry onscreen. It also good for the story to have Daniel \u0091fatherless', as he helps his teacher come to terms with the loss of his father, in one of the more emotional scenes in the movie. I must admit I like how Miyagi has faith in Daniel, even when he does not, (there is one scene where this reigns so true in KK2, and is probably the highlight of the entire film). However, Ralph shares a very special role with Kumiko (Tamlyn Tomita), as their characters fall very much in love with each other. Kumiko wants to be a dancer, and Daniel feels that she would be a successful dancer in America. Then there is the evil side to KK2. Sato, (Danny Kamekona), is still bitter about what Miyagi did to his honour before he fled Okinawa and wants a fight so he can reclaim what he believes is rightfully his. Sato's nephew Chozen (Yuji Okumoto) also has feels his honour has been shamed by Daniel, with most of the movie showing Daniel on the receiving on end of Chozen's fist. Yuji has appeared in movies such as \u0091The Truman show', \u0091The Game' and the 2001 blockbuster \u0091Pearl Harbour'. Karate Kid II also shows off some impressive Japanese locations. The Okinawa village used as Miyagi's was striking, as were the style of the homes, as a person from western society would not be accustomed to such a different lifestyle. There is also the wonderful music that accompanies KK2. Bill Conti's melodic musical score gives the movie great tension, and you have the music from the dancing hall which was live and upbeat. Yet the standout part of the soundtrack for mine has to be the Oscar winning hit, \u0091Glory of Love', sung by Peter Cetera. That is one song I like a lot. This movie is a great extension of the \u0091Karate Kid' story, which shows an uplifting story about overcoming the odds and staying true to yourself. Miyagi's strong \u0091anti-violence' theme continues in KK2, showing Daniel that the secrets of karate are that it is only to be used it when there is no other way. This movie is also very much about forgiveness, as Miyagi says at the start of the film \u0091A person with no forgiveness in heart, living worse punishment than death'. I could not agree more with that statement. Miyagi is the standout character in KK2, as he is always calm and rational, in situations in which most of us would not be, with his character going through a range of emotions that give us a much greater insight into him. If you are a Karate Kid fan than you have to watch what is a most satisfying of sequels. CMRS gives \u0091Karate Kid II': 4 (Very Good Film)",
         "Rarely does a sequel live up to the original. This movie is one of my personal favorites. It has taught me many lessons that I still hold dear. They don't make them like this anymore. I enjoyed the fight scenes. They were handled well. It was an interesting plot to see Mr. Myagi go back to face his old friend. A story of love and friendship that turned to bitter hate over that love. And of how true friendship and true love never really die, as Mr. Myagi saves Sato, even as Sato is cursing him with every filthy insult he can think of ( it's a PG movie, though, so instead of the profane and filth, you hear things like \" lower than a snake's belly \" and \" no honor \" instead of the more colorful words we hear in movies these days. ) I loved Mr. Myagi's response to what Daniel asked in the airport. Daniel sees a poster of a karate guy breaking a board and asks if Mr. Myagi can do that. Myagi's response? \" Don't know. Never been attacked by tree. \" Live or die, man??? DIE! Wrong!! ( Honk!!! ) Priceless and timeless...",
         "I am sorry to disagree with the comments of \"drlawyer\" since it only reflects the urge to see fight scenes. Karate kid 2 is a perfect sequel and shows the spiritual side of martial arts. Why measure a sequel with the 1st movie at all? Both, (Karate kid1 and Karate kid2) are unique and have complete story lines. Even for those who only saw the second movie, there is no gap due to the main flashbacks presented in the beginning of it. The acting is excellent and has no need for quick chopped up editing like now-a-days movies do. The grief and emotions connect with the viewer. I saw both movies about 20 times and could see them 20 times again.",
         "This film is the sequel to the huge 1984 hit, \"The Karate Kid\". The film starts almost exactly where the first film abruptly ended, with Daniel(played by Ralph Macchio) winning the karate championship under the coaching of Mr. Miyagi(played by Pat Morita). Mr. Miyagi soon learns that his father is dying back in Japan and he goes there to see him one last time and Daniel decides to come along. Miyagi and Daniel run into an old nemesis of Miyagi and Daniel is repeatedly tormented by the nemesis' nephew. Daniel also finds a new love in the daughter of Mr. Miyagi's old lover. This is a generally simple film with a fine backdrop of the streets of Okinawa. Those who enjoyed the original \"Karate Kid\" should generally enjoy this predictable, but entertaining sequel. Another plus in the film is the playing of Peter Cetera's song \"Glory of Love\" in a cute scene involving Daniel and his new love and also in the end credits of the film. It is worth watching.",
         "The Karate Kid part II should have been the end of the Karate Kid Story. It was an excellent film and the story was a perfect conclusion to the Daniel/Myagi friendship. The heroine Kumiko was perfect for Daniel and in my imagination he stays with her and Myagi stays with his love from childhood and then both of them bring their ladies to the states. KK III was awful and the Next Karate Kid was just idiotic. These lame sequels don't come close to this installment which should have been the last or at least, if a third installment was going to be done, it could of had the couples form the KKII and their new lives back in the states. I love Karate Kid stories and in my imagination the story ends with this wonderful sequel",
         "Daniel Larusso is back this time in Okinawa, Japan to visit Mr. Miyagi's home village, but upon arrival they discover it's being overrun by his old nemesis and his construction company. The climatic fight scene in the vintage karate ring was about as good as a sequel can get and wasn't relying on the first film for material. If you liked the first \"KARATE KID\", this one is almost as good, but please; do not see the 3rd sequel, it is Macchio's worst film ever.",
         "One would have thought that no movie with a title like \"The Karate Kid Part II\" could possibly be any good. One would have good reason to think this. One would be wrong. This is a loser-gets-the-girl 1980s teen movie. It is the best of its kind. Even the original, I think, wasn't bad, although it's starting to show its age; the third movie was pure drivel; but this one bears repeated watching very well indeed, and I would recommend it even to people who despise, or think that they despise, the genre it belongs to. Why is it so good? I have no idea. Pure luck, I suppose. Changing the setting to Japan certainly helped. Most teen movies are earthbound by their attempts to be hip and modern and can be dated to within a year. This one was allowed to be timeless. I admit that \"The Karate Kid Part II\" will never be *regarded* as a classic, partly because so many people think that a movie with that kind of title cannot possibly be any good. And they have good reason to think this. But they're wrong.",
         "One of the few sequels that stands as good as the first one. It is very well written and the structure is perfect in terms of balancing the various themes (drama, romance, comedy, karate). The cinematography is beautiful with fantastic landscapes and vibrant colors and splendid frameworks. The story is more serious and more adult but as the first film, universal values ​​are demonstrated and explored in a creative and original ways. The music is a masterpiece and holds us since the impressive beginning (flashback scenes) to the sad but hopeful sunset after Miyagi's father's death, to the tea ceremony between Kumiko and Daniel, in my view one of the best romantic scenes ever made; to the climax of the wild storm and to the grand final confrontation. This is an underrated movie. Watching \"Karate Kid, part 2\" is like having a good lesson in the art of filming. This movie shows how to tell a story, how to develop characters and their motivations, how to create a romantic\\sensual scene without sex, how to compose a scene (just pause at anytime and you'll see a \"painting\"). All the details are important. The actors are really convincing and there's a lot of chemistry between them but that has already been established in the first one. The first Karate Kid is a classic and one of my favorite movies of all time but so is part II as well. For me they're at the same level."
      ],
      "genres": [
         "Action",
         "Family",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Delphi V Productions"
      ],
      "summaries": [
         "Picks up where the first movie (Karate Kid) leaves off. Mr. Miyagi and Daniel take a trip to Okinawa to visit Mr Miyagi's dying father. After arriving Mr Miyagi finds he still has feelings for an old love. This stirs up trouble with an old rival that he originally left Okinawa to avoid. In the mean time Daniel encounters a new love and also makes some enemies.",
         "It's summer, Daniel just broke up with his girlfriend and was told by his mother that her job needs her to move to Fresno for the summer which Daniel doesn't like. Mr. Miyagi was going to let Daniel stay with him until he receives a letter from Okinawa telling him that his father is dying. So Miyagi leaves to go there and Daniel joins him. Miyagi tells Daniel that the reason he left Okinawa was because his best friend, Sato whose family is the most affluent in Okinawa, was promised Yukie whose the girl Miyagi loved. So Miyagi asks her to run away with him and when Sato learned of this, he challenged Miyagi to a fight to the death. So Miyagi left. Upon arriving Miyagi discovers Sato still wants to fight him and his nephew and best student Chozen has it out for Daniel.",
         "Daniel accompanies his mentor to Okinawa who is off to see his dying father and confront his old rival, while Daniel inadvertently makes an enemy of his own."
      ],
      "budget": 0
   },
   "movielensId": 2421,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-06-18",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["John G. Avildsen"],
      "runtime": 113,
      "movieId": 2421,
      "title": "The Karate Kid, Part II",
      "mpaa": "PG",
      "actors": [
         "Ralph Macchio",
         "Pat Morita",
         "Martin Kove",
         "Charlie Tanimoto",
         "Yuji Okumoto",
         "Joey Miyashima",
         "Marc Hayashi",
         "Danny Kamekona",
         "William Zabka",
         "Tamlyn Tomita",
         "Nobu McCarthy"
      ],
      "imdbMovieId": "0091326",
      "originalTitle": "The Karate Kid, Part II",
      "genres": [
         "Adventure",
         "Drama",
         "Action",
         "Romance",
         "Family"
      ],
      "youtubeTrailerIds": ["ay-eT1B39zI"],
      "plotSummary": "Mr. Miyagi and Daniel take a trip to Okinawa to visit Mr. Miyagi's dying father. After arriving Mr. Miyagi finds he still has feelings for an old love. This stirs up trouble with an old rival who he originally left Okinawa to avoid. In the mean time, Daniel encounters a new love and also makes some enemies.",
      "tmdbMovieId": 8856,
      "avgRating": 2.663,
      "releaseYear": "1986",
      "numRatings": 7267,
      "posterPath": "/mSne9mfUcL8QCGxF891LWa7lZNI.jpg"
   }
}