{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "gangster",
            "id": 3149
         },
         {
            "name": "based on true story",
            "id": 9672
         },
         {
            "name": "ira",
            "id": 14552
         },
         {
            "name": "ireland",
            "id": 14985
         },
         {
            "name": "police reporter",
            "id": 162917
         }
      ],
      "imdb_id": "tt0120706",
      "video": false,
      "title": "The General",
      "recommendations": [
         74349,
         119555,
         73455,
         35123,
         8214,
         1379,
         42464,
         48145,
         122019,
         241432,
         41948,
         91426,
         1785,
         49980,
         102514,
         117478,
         42144,
         180879,
         121461,
         117239
      ],
      "backdrop_path": "/ptbUsacCRhlix51vm0j9VP5ZAR4.jpg",
      "revenue": 1214198,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martin Cahill",
               "gender": 2,
               "credit_id": "52fe46f49251416c750890ef",
               "name": "Brendan Gleeson",
               "profile_path": "/pUTBk2sqFgg4aFBXHckD0qKLUYP.jpg",
               "id": 2039,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Noel Curley",
               "gender": 2,
               "credit_id": "52fe46f49251416c750890f3",
               "name": "Adrian Dunbar",
               "profile_path": "/2dbNGBaqpnn55pOivsPh4B3dVQJ.jpg",
               "id": 42566,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe46f49251416c750890f7",
               "name": "Sean McGinley",
               "profile_path": "/yYLnTgn7RDR50crBOV7juzJlq6f.jpg",
               "id": 2468,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frances",
               "gender": 1,
               "credit_id": "52fe46f49251416c750890fb",
               "name": "Maria Doyle Kennedy",
               "profile_path": "/nK8DmGEgzGXIbyv3VyK6j7M0Gvw.jpg",
               "id": 33394,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Tina",
               "gender": 1,
               "credit_id": "52fe46f49251416c750890ff",
               "name": "Angeline Ball",
               "profile_path": "/kmyjfoY9pZCwMyGLcP1P7lQfV9e.jpg",
               "id": 63358,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Inspector Ned Kenny",
               "gender": 2,
               "credit_id": "52fe46f49251416c75089103",
               "name": "Jon Voight",
               "profile_path": "/c7BvyqlvqDkfkFqSBUCiR21fvTh.jpg",
               "id": 10127,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Jimmy",
               "gender": 0,
               "credit_id": "52fe46f49251416c75089107",
               "name": "Eanna MacLiam",
               "profile_path": null,
               "id": 63367,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Willie Byrne",
               "gender": 2,
               "credit_id": "52fe46f49251416c75089117",
               "name": "Tom Murphy",
               "profile_path": null,
               "id": 87907,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Aiden",
               "gender": 2,
               "credit_id": "58d1d3e0c3a36838c9013643",
               "name": "John Cronin",
               "profile_path": null,
               "id": 1614360,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46f49251416c7508910d",
               "name": "John Boorman",
               "profile_path": "/zPZkbiZms6DUZz74xLLFFGUJY0n.jpg",
               "id": 19665,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f49251416c75089113",
               "name": "John Boorman",
               "profile_path": "/zPZkbiZms6DUZz74xLLFFGUJY0n.jpg",
               "id": 19665,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "554b79aac3a3685e50001fac",
               "name": "John Boorman",
               "profile_path": "/zPZkbiZms6DUZz74xLLFFGUJY0n.jpg",
               "id": 19665,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "554b79bcc3a3685e5b001fa8",
               "name": "Richie Buckley",
               "profile_path": null,
               "id": 1464580,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "554b79d2c3a3685e5e00218b",
               "name": "Seamus Deasy",
               "profile_path": null,
               "id": 63355,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "554b79eec3a3685e50001fb5",
               "name": "Jina Jay",
               "profile_path": "/rMuj07hjZnT0zMC1kiBOs6IWCdO.jpg",
               "id": 474,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "554b7a1c9251410459001516",
               "name": "Ron Davis",
               "profile_path": null,
               "id": 19678,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.43188,
      "production_countries": [
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 16885,
      "vote_count": 29,
      "budget": 0,
      "overview": "In a twenty-year career marked by obsessive secrecy, brutality and meticulous planning, Cahill netted over £40 million. He was untouchable - until a bullet from an IRA hitman ended it all.",
      "similar": [
         8012,
         64689,
         186,
         769,
         2069,
         10651,
         193893,
         2252,
         1422,
         4771,
         23483,
         59,
         154400,
         245891,
         241554,
         9366,
         949,
         169917,
         324542,
         37645
      ],
      "original_title": "The General",
      "runtime": 124,
      "poster_path": "/hAPqcsMhvn0gfQRAbm2UrmDzloj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Merlin Films",
            "id": 3201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "J & M",
            "id": 3230,
            "origin_country": ""
         },
         {
            "logo_path": "/trP3GsUyIztMwcqev3jK1gOeCSA.png",
            "name": "Irish Film Board",
            "id": 5267,
            "origin_country": "IE"
         }
      ],
      "release_date": "1998-05-01",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "The extraordinary true story of the rise and fall of the gangster, Martin Cahill.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["John Boorman"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "John Boorman",
         "Paul Williams"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120706/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwOTE0NTA0Nl5BMl5BanBnXkFtZTcwNTc1MjgxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Brendan Gleeson, Adrian Dunbar, Sean McGinley | See full cast and crew »"],
      "reviews": [
         "In a small way, I'm almost glad that all films aren't as good as \"The General\". It's dripping with one of those intangible elements that seems to escape other films. Sheer quality craftsmanship and excellent storytelling. There's a very rich quality to this film. What we see on screen merely scrapes the surface of a full history that is eluded to but not entirely exposed explicitly, which is what I think works best to keep interests up. Just brilliant film work in every regard makes this story come to life. Crime, ethics, political standpoints and complex relationships. Martin Cahill, the film's central character, is the anti-hero thief, something of a modern day Robin Hood but much more visceral. I understand that John Boorman was allegedly one of Cahill's break-in victims. From what we see in the film, he remains constant to his own beliefs and principles, even if that means breaking the law at every turn. His schemes and plots to outwit the cops are so simple and effective you can't help but like him. He's very clever despite a lack of education, and he doesn't shift to the world around him as much as it shifts for him. His biggest weakness appears to be cream filled pastries. Even if he's been beaten, he won't allow his adversaries the pleasure of seeing him suffer in any way. I don't know how faithful the film is to the truth, history or the spirit of Cahill's actions. But one thing I do know is that the superb craftsmanship of this film should propel it on to everyone's must see list, but that's not too likely to be. At least for North American audiences this film has many things going against it. It's in black and white. The Irish accents are thick and difficult to understand at times. It doesn't seem to have the sort of advertising campaign that it deserves. And worst of all, it appears to have unanimous critical acclaim. Often great films aren't hits, they don't strike a chord with the masses, but in my book, that's fine. You can only tell the quality of a great film in comparison to one that's inferior. Personal taste aside, this film is simply done extremely well.",
         "This is a great film, but I should warn people who are watching this on DVD that some versions ship with a black and white on one side and a colour version on the other. Do not watch the colour version! For some reason this version has different dialogue (and possibly editing) particularly with regards to swearing - freaking replaces f**king etc. I don't know why this is so but maybe the movie was watered down to get some lesser rating. Whatever the reason, watch the black and white version and see the movie as it was meant to be seen.",
         "John Boorman's 'The General' was always going to be a controversial movie and a tough sell for its filmmakers. It's anti-hero, Martin Cahill was Ireland's most infamous criminal of recent times - so much so that there has been four screen depictions of him (Ken Stott in The Vicious Circle, Kevin Spacey in Ordinary Decent Criminal, Pete Postlethwaite in When The Sky Falls and Brendan Gleeson in The General). He was guilty of some of the country's most outrageous crimes and capable of real brutality - most notably, injuring a forensic scientist in a car bomb and literally nailing one of his gang members to the floor. Add into the mix the fact that the film has a largely Irish cast deploying thick Dublin accents and that Boorman chose to shoot it in black and white and you have a movie which wasn't exactly going to jump out at international and especially, US audiences demanding to be loved. The result is perhaps Boorman's finest work, certainly on a par with the wonderful 'Hope and Glory'. The film is also by a furlong the best of the four movies depicting Cahill's life. This is in large part due to the brilliant performance of Irish actor, Brendan Gleeson in the central role. The Irish Depardieu not only physically transforms himself into Cahill but captures the rebellious spirit, the intelligence and the charm. It would have been easy to depict Cahill as a monster. However, Gleeson and Boorman treat their audience with respect, building up a character with shades of darkness and light. On one hand, viewers are given an appreciation of how \"The General\" was able to command the love of two sisters, his children and the adulation of his criminal associates. However, Boorman's film is certainly no love letter to Cahill. We also see his sadistic side as in the bombing of the forensic scientist's car and crucifixion of one of his gang members, his lack of consideration and compassion for the 100 workers laid off at a storeroom he has robbed, his cold bargaining with the sexually abused daughter of one of his gang members. The supporting cast also put in fine performances too. Jon Voight not only masters the rural Irish brogue of the Garda (police) inspector bedevilled by Cahill but also the attitudes. It is a tough but ultimately sympathetic performance of a cop dragged unwillingly into the gutter. Maria Doyle Kennedy and Angeline Ball give charming performances as the sisters who were also the women in Cahill's rather unorthodox life, with Ciaran Fitzgerald also making a sympathetic son. Adrian Dunbar, Sean McGinley and Eanna MacLiam all put in spirited performances as members of Cahill's gang. McGinley, in particular, creates another memorably seedy performance as Gary. Special mention should also go to Pat Laffan as a brutish Garda sergeant. With it's cracking script, Richie Buckley's musical score and the black and white camerawork, 'The General' is easily up there with the best of modern movies made in Ireland (certainly, up there with Neil Jordan's 'The Butcher Boy' and Alan Parker's 'The Commitments'). It is a must see - a film which demands cult status.",
         "Brendan Gleeson's performance as notorious Irish master criminal Martin \"The General\" Cahill is a small miracle. Alternating between a brash swagger and a sullen fatalism, Gleeson utterly transforms himself (I love how he hides his face simply by cocking his head down and shielding it with his hand, peeking out between splayed fingers) into the charismatic thief. Director and screenwriter John Boorman, who delighted in revealing that he had once been robbed of a gold record by the real-life Cahill (he references it anecdotally in the film) has done some of his best work here, creating a totally engrossing character study that includes tense robberies, playful confrontations with the police, and eyebrow-raising relationships, but he never forgets to maintain the delicate balance between the light-hearted (and light-fingered) humor and the danger and desperation inherent in a high-profile life of crime.",
         "If you're watching one of the Classic Warner Brothers Gangster movies on tv and someone asserts that \"They don't make 'em like that anymore\", here's a movie to prove them wrong. As real-life Dublin gangster Martin Cahill Irish actor Brendan Gleeson provides a criminal hero to compare with those played by Edward G. Robinson and Jimmy Cagney. Brutal and Compassionate by turns, Gleeson's Cahill eschews links to anything outside himself and his home and circle of acquaintances. Hating the state, he turns Ireland's liberal justice system upon itself; hating the media, he blocks his face from TV cameras. Ultimately, it's this status as an existential outsider that brigs about his tragic downfall, but along the way there are moments of incredible comedy as the Gardai, or Irish Police are made to look like bumbling Keysone cops. The monochrome cinematograhy gives an excellent verite effect and the supporting cast with Jon Voight and a host of Irish stalwarts, are superb.",
         "\"The General\" is the nickname of the real-life, contemporary Irish criminal, Martin Cahill. Brilliantly played by Brendan Gleeson, director John Boorman dramatizes Cahill's odd career as a very successful thief and robber. Shot in black and white the movie has a gritty realism that doesn't glamorize Cahill and his gang. But Cahill, as portrayed by Gleeson and Boorman, is a likable and quirky eccentric who does things his own way, a characteristic which causes him to fall afoul of both the police and the IRA. Not your typical A-List Hollywood crime melodrama, this movie is not for everyone, especially those looking for the typical Vin Diesel or Al Pacino crime flick. This is more like the Sopranos in the Irish slums. And, I recommend it highly for a Saturday night rental; just be forewarned that it is quite brutal and intense at times.",
         "In terms of acting, direction and entertainment value, the general certainly delivers. Its is well paced, humorous and the performances of all the main actors, in particular Brendan Gleeson and Jon Voight, are excellent. I'm not sure why the film is shot in black and white, I don't think this adds particularly to the film. My one reservation about the film is the portrayal of the main character, Martin Cahill, whom I think is overly glamorised. I remember before Cahills death his exploits as I saw them in the newspapers and television, and from the many stories which circulated around Dublin at that time of his criminal activity. This was no latter day Robin Hood. He was an unusually successful thief, no doubt, but with none of the charitable spirit. He was also extremely cruel, at one time breaking into the home of a social welfare officer and torturing him for hours simply because he had refused Cahill welfare payments. I would recommend people to see this film, but at all times remember that the man it portrays was no one to be admired, but an example of the most vile thugs that Ireland has had the shame to produce in recent years. But then they say, \"The devil has the best tales\".",
         "Boorman if nothing else is a good story teller. As a director, his greatest triumph came early in his career with Deliverance. Yet as a writer, he has brought us quality films such as Excalibur, and Hope & Glory. His adaptation of the Paul Williams novel is straight forward and without frills. Martin Cahill had many aspects to his life that could have easily become the fodder for an over zealous director. Rather than seeking to build a \"background\" story out of his love triangle, Boorman handles it with style and two scenes. The movie is meant to tell you about the rise and fall of Martin Cahill with a watchful eye to the social and political forces in Ireland. Boorman does just that. The scenes are well thought out and the acting solid. While this movie never hit the critical radar in America, it was praised both in Britain and at Cannes. When your in the mood for a story of a gangster who became a populist hero, take a look at this film. But if you want swift action scenes and graphic violence, it may be time for another viewing of Bonnie and Clyde.",
         "Being Irish-American, I can tell this; there's an old joke about an Irishman who washes ashore of a new country and asks the first person he sees, \"What kind of government do they have here?\" The person tells him, and the Irishman responds, \"Well, whatever it is, I'm against it.\" Martin Cahill, from what I know, would seem to share that sentiment, but not out of any political bent; indeed, he's all the more fascinating for being completely apolitical. He just rails against any government that, by definition, is there to ensure he can't make a living at the thing he likes to do the most; steal from the rich. John Boorman's portrayal of Cahill, nicknamed THE GENERAL(the title of this movie), portrays him as the thug he can be, not only in his viciousness(the famous pool table scene), but also his selfishness(as soon as he's successful, the only \"poor\" he gives to after robbing the rich is himself and the rest of the gang), yet allows him his delusions of grandeur; after all, isn't that all we often have to fall back on? Of course, Cahill is quite talented at what he does, using ingenuity as much as brute force to get what he wants, like going to talk to police inspector Ned Kenny(Jon Voight) while his men are robbing a bank, not just to keep Kenny occupied, but to give himself an alibi(the look on Voight's face when he realizes he's been set up is alone worth the price of admission). Brendan Gleeson, a regular in Irish movies(and recently seen in LAKE PLACID), makes everything Cahill does seem somehow normal, even his habit of hiding his face with his hand when he wants to avoid unpleasantness, or the fact that he lives with both his wife and her sister(Maria Doyle Kennedy and Angeline Ball, from THE COMMITMENTS), even, of course, his job. Obviously, we're not supposed to like Cahill, but like Inspector Kenny, we develop a sneaking admiration for him just the same(if there's a flaw, it's we see Kenny sinking to the level of Cahill once by punching him out, but we don't see the character arc there). Boorman is obviously a great visual director(much has been made of the black-and-white photography - too much, in my humble opinion - while not enough has been made of his use of quick fades, which lend it a dreamlike quality), but he needs a good story to engage him. When he doesn't have it, like in BEYOND RANGOON or - sad to say, for me for the most part - DELIVERANCE, it's all empty. When he does have it, like in POINT BLANK or HOPE AND GLORY, it's engaging and compelling, and he has a great story here(isn't it funny that while he's know for his visual work, his best films, like this and HOPE AND GLORY, he also wrote?). A terrific biopic.",
         "There are few modern directors whom I respect as well as John Boorman. His biopics are always keenly observed, and he has a great eye for the comic moment. Cahill, history tells us, was a vicious thug - his only redeeming qualities, Boorman tells us, were his love for his family and comrades. Even if a few of Cahill's blemishes were airbrushed out to present him as a modern day Robin Hood, what the hell, it makes great cinema. Cahill is the perfect anti-hero, and with Boorman's decision to show us the ending at the beginning - we know that he ultimately pays the ultimate price for his crimes. No point in harping on about the use of monochrome photography. I don't particularly think it matters - it just makes me wish I was watching Casablanca. But the principal actors are perfect. Brendan Gleeson and Adrian Dunbar make a fine pairing, and Jon Voight as Cahill's nemesis, Inspector Ned Kenny, is surprisingly good at the Irish accent, and back to his best form as an actor. Boorman, although not as prolific, deserves to be regarded alongside Scorsese, Coppola and Kubrik for his insight into humanity and the sometimes strange bonds that result. No other modern directors do this as well as the above mentioned."
      ],
      "genres": [
         "Biography",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Irish Film Board",
         "J & M",
         "Merlin Films"
      ],
      "summaries": ["The real-life story of Dublin folk hero and criminal Martin Cahill, who pulled off two daring robberies in Ireland with his team, but attracted unwanted attention from the police, the IRA, the UVF and members of his own team."],
      "budget": 0
   },
   "movielensId": 2425,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-01",
      "dvdReleaseDate": "1999-07-20",
      "directors": ["John Boorman"],
      "runtime": 124,
      "movieId": 2425,
      "title": "The General",
      "mpaa": "R",
      "actors": [
         "Brendan Gleeson",
         "Adrian Dunbar",
         "Sean McGinley",
         "Maria Doyle Kennedy",
         "Angeline Ball",
         "Jon Voight",
         "Eanna MacLiam",
         "Tom Murphy",
         "John Cronin"
      ],
      "imdbMovieId": "0120706",
      "originalTitle": "The General",
      "genres": [
         "Drama",
         "Action",
         "Crime"
      ],
      "youtubeTrailerIds": ["srSNhZ8XKnE"],
      "plotSummary": "In a twenty-year career marked by obsessive secrecy, brutality and meticulous planning, Cahill netted over £40 million. He was untouchable - until a bullet from an IRA hitman ended it all.",
      "tmdbMovieId": 16885,
      "avgRating": 3.59809,
      "releaseYear": "1998",
      "numRatings": 627,
      "posterPath": "/hAPqcsMhvn0gfQRAbm2UrmDzloj.jpg"
   }
}