{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "flight",
            "id": 8044
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "disease",
            "id": 14673
         },
         {
            "name": "dying",
            "id": 41589
         },
         {
            "name": "motor neuron disease",
            "id": 209063
         }
      ],
      "imdb_id": "tt0120861",
      "video": false,
      "title": "The Theory of Flight",
      "recommendations": [
         80660,
         209251
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jane Hatchard",
               "gender": 1,
               "credit_id": "52fe4951c3a368484e1256b7",
               "name": "Helena Bonham Carter",
               "profile_path": "/rHZMwkumoRvhKV5ZvwBONKENAhG.jpg",
               "id": 1283,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Richard",
               "gender": 2,
               "credit_id": "52fe4951c3a368484e1256c3",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe4951c3a368484e1256bb",
               "name": "Gemma Jones",
               "profile_path": "/doDUez5AkN0bfqmZWB0bKO9mcJe.jpg",
               "id": 9138,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Julie",
               "gender": 1,
               "credit_id": "52fe4951c3a368484e1256bf",
               "name": "Holly Aird",
               "profile_path": "/fowpVwsru1gQUU5DywmiEw4mvga.jpg",
               "id": 47590,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Gigolo",
               "gender": 2,
               "credit_id": "54807a2fc3a36829a7002acf",
               "name": "Ray Stevenson",
               "profile_path": "/bcd9uqwfCVYsu7rduZnPVYUkyfU.jpg",
               "id": 56614,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Becky",
               "gender": 1,
               "credit_id": "5a010f22c3a36807a200a0bd",
               "name": "Ruth Jones",
               "profile_path": "/2CQP7aum5afUidQu5e5RqAXwJvW.jpg",
               "id": 192927,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4951c3a368484e1256ad",
               "name": "Paul Greengrass",
               "profile_path": "/zyJyLdHvV98Nv9mrctQsH64RxkE.jpg",
               "id": 25598,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4951c3a368484e1256b3",
               "name": "Richard Hawkins",
               "profile_path": null,
               "id": 132225,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.226323,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 76857,
      "vote_count": 9,
      "budget": 0,
      "overview": "A dreamer who aspires to human flight is assigned public service after one of his attempts off a public building. This leads him to meeting a young woman, who is dying of motor neuron disease. The strong-willed woman admits her wish to be de-flowered before her death. The man, struggling to maintain his relationship with his girl friend, declines but offers to help pay for a gigolo to do the deed. The following events play off the inherent comedy and drama of the circumstances.",
      "similar": [
         12281,
         19913,
         13,
         489,
         28178,
         68718,
         44564,
         397422,
         226,
         1024,
         862,
         72105,
         10191,
         50544,
         8839,
         277547,
         109689,
         297222,
         1262,
         20453
      ],
      "original_title": "The Theory of Flight",
      "runtime": 101,
      "poster_path": "/ajFRGmaUtT1dItVsE0gZJvEZPEz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/wdmwQuV4R1MIr8A78izZkC184uC.png",
            "name": "BBC Films",
            "id": 288,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Distant Horizons",
            "id": 1066,
            "origin_country": ""
         }
      ],
      "release_date": "1999-01-22",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Greengrass"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Richard Hawkins"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120861/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MDk2OTMyM15BMl5BanBnXkFtZTcwMjg4MTkzMQ@@._V1_SY317_CR16,0,214,317_AL_.jpg",
      "actors": ["Stars: Helena Bonham Carter, Kenneth Branagh, Gemma Jones | See full cast and crew »"],
      "reviews": [
         "Yes, I know everyone is sick of the typical sick-dying-person-of-the-week drama, but somehow this movie was drastically different from other movies based on physically challenged people. The driving force in the movie is no doubt Jane, a young woman who faces the fact that she shall die soon. (Bonham Carter) I am a veteran of pictures which feature a dying character with a physical disability. But those films somehow never got the character to seem like a person. After a while, Jane isn't a \"sick cripple\", she is a human, just a human in a wheelchair. That is all the viewer will see from Bonham Carter's portrayal. Another beautiful quality of the film is Jane refuses to be mushy and over-emotional. It is what she refuses to show that really hits home. Branagh's character Richard should not be overlooked. It's his story more or less. Jane brought Richard's redemption. He is the cripple of the story, he is the one who is dying. \"Taking flight has more than one meaning\"..Jane utters to Richard. \"The Theory of Flight\" is an original movie which I recommend to anyone looking for a fresh look on a dying person, whether you see the dying person as Jane or Richard.",
         "The Theory Of Flight is an engaging character study of an artist (Branagh) yearning to break free of boredom and mediocrity, and a terminally ill patient (Bonham-Carter) in the last stages of ASL, confined to a wheelchair, who desires to make love to a man before dying. Helena Bonham-Carter exudes wit, defiance, and independence as an ASL patient who is virtually dependent upon people around her to take care of her. Kenneth Branagh, sentenced through community service to take part in caring for her, complements Helena's charm with woeful melancholy, creating a sentimental, compelling love story in which two people try to help each other find the road to happiness, before time runs out.",
         "Not wishing to give *anything* away here, I would just say this technically excellent, flawlessly acted and uplifting little flic will reward the viewer with an excellent hour and a half's entertainment: It will amuse, surprise, possibly embarrass occasionally and almost certainly tug at the heartstrings from time to time, as it approaches the inevitable, but not obvious, ending without becoming clichéd or predictable in any way. Most definitely recommended. A previous User's Comment gives 8 out of 10 for the film and 10 out of 10 for both Branagh and Bonham-Carter's outstanding performances - I agree entirely....",
         "Despite its low-key release in this country, and its apparent disregard in other countries (the 'R' rating in the States can't have helped - honestly, just because HBC uses the C-word!), this is actually a fine piece of work. The sentimentality does occasionally threaten to choke it, but it's overcome by the playing of the two leads. It's easy to win plaudits just because you're playing a physical or mental cripple (Daniel Day-Lewis, Geoffrey Rush, Dustin Hoffman, etc.), and Helena Bonham-Carter may not quite capture the physical degradation of MND, but her vocal stretching and ruthless emotional drive compensate entirely. In fact, almost all her performance is conducted through her eyes (and what eyes!). This is an intelligent turn from an actress who is rapidly undoing her English Rose reputation, and emerging as a figure of some stature. Awards must surely follow, though not, alas, for this fine performance. Branagh, one feels, has never quite given his best on film (except possibly 'Hamlet', and there his playing was diluted by the large cast). Here, though, he tops his other appearances, playing to the hilt a self-loathing, unstable, ultimately lovable guy with a subtlety he hasn't always displayed, and exhibiting both intelligence and depth. In short, we believe him, just as much as we could NOT believe him as Frankenstein, as the priest in 'The Proposition', as the lawyer in 'The Gingerbread Man', even as Andrew in 'Peter's Friends'. This is surely his finest performance yet - so why could he not produce the goods much earlier? As a film, it looks more like a television offering, and without its stars it probably wouldn't amount to very much. But it's been a pleasure to see this pair perform their socks off like this, and I eagerly await more from them (though not 'Love's Labour's Lost'...). 8 out of 10, but Branagh and HBC get 10 out of 10.",
         "This film does a superb job of depicting the plight of an ALS (Lou Gehrig's Disease)sufferer. The subject is done with compassion as well as humor. Helena Bonham Carter is so convincing as a person with ALS that I found it hard to believe that she was only acting. Kenneth Branagh, a superb actor, lives up to expectations as the quirky artist who misbehaves and is forced to provide companionship to Helena's character as part of his \"community service\", an alternative to prison time. Watching the development of the relationship between these two is a treat from beginning to end. Tha fact that it is a fairy tale does not detract from the fabulous performances. One comes to care deeply for the two of them.",
         "Loved this film. Real people, great acting, humour, unpredictable. The characters were believable and you really connected with them. If you're looking for a film about slightly offbeat characters outside the mainstream of society and how they help each other, this would be a good choice.",
         "At the start, this one is from England, so, of course, I had 98 % chances that it will be intelligent and very good cinema. I never heard of this film before. From the minute I saw Helena Bonham-Carter, I said to myself : Oh! Here's comes the feminine version of My Left Foot. I was right, but I was also wrong. Wrong because the two movies are very differents. My Left Foot was a John Ford alike movie and this one is a Chaplin alike movie (not because this is funny, but Chaplin at that great sense of melodrama that brings tears to your eyes.) I was right because in 1990 handsome Daniel Day-Lewis turn a little bit ugly by playing an crippled person and he did it with a great sense of reality. Here, very beautiful Bonham-Carter did exactly the same thing, but with very feminine emotions. The story is well written and it's very intelligent. For me, miss Bonham-Carter gives one of the greatest woman's part of the 1990's, with Emily Lloyd in Breaking The Waves. Gee! And look at her eyes! She had the most beautiful eyes of cinema since Jobyna Ralston, Louise Brooks, Michele Morgan and Ava Gardner! She's also a true talent, as seen on many other movies. See this one, you won't regret it! And a very fine job by Branagh too!",
         "Sometimes, when you grow weary of all the glamorous! American style movies, you look forward to seeing one from Europe that does not deal much with the art's technological aspects but the story and the feelings alone. I have thought that \"The Theory of Flight\" was a film of emotions and atmosphere. Honestly, I think it was planned to be that way. Unfortunately, the result was not satisfactory. K.B. and H.B.C. are great, I can't ignore their invaluable contributions to the movie. But I feel something was lacking. The characters were not deeply analysed maybe, or the situation of being \"cripped\" was mentioned better in other films (remember \"My Left Foot\"). In the 15. minute of the movie, we have learned that Jane was desiring to lose her virginity like normal people. And the story finished! Nothing else. The remaining portion just concentrated on this matter. How about Richard's own problems, Anne's point of view on having a daughter like Jane? In fact, we don't understand Jane's feelings, too. We just make guesses depending on our knowledge of other movie characters. I finally must say that seeing K.B. and H.B.C. together in a movie was nice. They play their roles very well. But as a whole, \"The Theory of Flight\" is a shallow movie. It should have been better with these players and this interesting story.",
         "Although this movie has some weaknesses, it is worth seeing. I chose it because of the cast, and applaud Bonham Carter and Branagh for choosing roles different from those they have taken in the past. Both portray very troubled people, complete with warts, but make them likeable because of their humanity. The story is touching, but it is the performances that soar. Bonham Carter's \"Jane\" is a remarkable achievement, whose quest for romance opened my eyes to aspects of being disabled that I had not thought of before, but was interesting as well for other reasons. I felt the movie ended too abruptly, but better that than a drawn out emotionally manipulative ending (see \"Stepmom.\") The very real English setting added to my enjoyment - it was England in the 90's, both urban and rural, without being depressing.",
         "Shamefully, before I saw this film, I was unfamiliar with Helena Bonham Carter. I had to do some research, in order to assure myself she wasn't actually afflicted, as was her character, with (well?), what she was afflicted with. I was in absolute awe of this beautiful lady. She pulled it of flawlessly. Who would have thought that sexually explicit circumstances involving the final wants, and needs, of a unique young lady, could be interpreted as tender, and romantic? Well, they can be, when the right performers present them in the proper manner, as they did in this wonderful movie. I forgot to mention how dynamically beautiful Miss Carter looked in this movie. I have often said she was the most beautiful creature to have ever graced the face of our earth, but she seemed to have out done herself in this particular movie. I hope any of you who watch this movie enjoy it as much as I did. Thank you for letting me express my opinion."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Distant Horizons",
         "BBC Films"
      ],
      "summaries": ["A dreamer who aspires to human flight is assigned public service after one of his attempts off a public building. This leads him to meeting a young woman, who is dying of motor neuron disease. The strong-willed woman admits her wish to be de-flowered before her death. The man, struggling to maintain his relationship with his girl friend, declines but offers to help pay for a gigolo to do the deed. The following events play off the inherent comedy and drama of the circumstances."],
      "budget": 0
   },
   "movielensId": 2426,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-22",
      "dvdReleaseDate": null,
      "directors": ["Paul Greengrass"],
      "runtime": 101,
      "movieId": 2426,
      "title": "The Theory of Flight",
      "mpaa": "R",
      "actors": [
         "Helena Bonham Carter",
         "Kenneth Branagh",
         "Gemma Jones",
         "Holly Aird",
         "Ray Stevenson",
         "Ruth Jones"
      ],
      "imdbMovieId": "0120861",
      "originalTitle": "The Theory of Flight",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["Tg9TAbqnjGk"],
      "plotSummary": "A dreamer who aspires to human flight is assigned public service after one of his attempts off a public building. This leads him to meeting a young woman, who is dying of motor neuron disease. The strong-willed woman admits her wish to be de-flowered before her death. The man, struggling to maintain his relationship with his girl friend, declines but offers to help pay for a gigolo to do the deed. The following events play off the inherent comedy and drama of the circumstances.",
      "tmdbMovieId": 76857,
      "avgRating": 3.28779,
      "releaseYear": "1999",
      "numRatings": 172,
      "posterPath": "/ajFRGmaUtT1dItVsE0gZJvEZPEz.jpg"
   }
}