{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0142231",
      "video": false,
      "title": "Down in the Delta",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Loretta Sinclair",
               "gender": 1,
               "credit_id": "52fe4ac9c3a368484e166e45",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Earl Sinclair",
               "gender": 2,
               "credit_id": "52fe4ac9c3a368484e166e49",
               "name": "Al Freeman, Jr.",
               "profile_path": "/tAN4hyguaYPAzqvmfrdxIVZKrPr.jpg",
               "id": 19739,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Annie Sinclair",
               "gender": 1,
               "credit_id": "52fe4ac9c3a368484e166e4d",
               "name": "Esther Rolle",
               "profile_path": "/qC1k4WhH9vULIKucdBbgfiQ5bmD.jpg",
               "id": 5700,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Rosa Lynn Sinclair",
               "gender": 1,
               "credit_id": "52fe4ac9c3a368484e166e51",
               "name": "Mary Alice",
               "profile_path": "/2h20nF8gvhqhgVDV6Lru55dKB44.jpg",
               "id": 9572,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Zenia",
               "gender": 1,
               "credit_id": "52fe4ac9c3a368484e166e55",
               "name": "Loretta Devine",
               "profile_path": "/zLQFwQTFtHkb8sbFdkPNamFI7jv.jpg",
               "id": 18284,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Will Sinclair",
               "gender": 2,
               "credit_id": "52fe4ac9c3a368484e166e59",
               "name": "Wesley Snipes",
               "profile_path": "/hQ6EBa6vgu7HoZpzms8Y10VL5Iw.jpg",
               "id": 10814,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4ac9c3a368484e166e3b",
               "name": "Maya Angelou",
               "profile_path": "/wdlFPg1qhGGzctwJ1KwrPxy3T6y.jpg",
               "id": 54424,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4ac9c3a368484e166e41",
               "name": "Myron Goble",
               "profile_path": null,
               "id": 1024643,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.464701,
      "production_countries": [],
      "id": 125582,
      "vote_count": 6,
      "budget": 0,
      "overview": "Rosa Lynn sends her druggie daughter Loretta and her children Thomas and Tracy away from the big city to live with their uncle Earl in the ancestral home in rural Mississippi. Earl puts Loretta to work in his restaurant, Just Chicken, while also telling them about the generations of their family, the Sinclairs, dating back to their time in slavery before the the Civil War.",
      "similar": [
         258480,
         27586,
         370663,
         244772,
         401898,
         12793,
         858,
         141,
         634,
         242224,
         112160,
         394117,
         376867,
         17130,
         10818,
         11421,
         43923,
         152532,
         340485,
         250124
      ],
      "original_title": "Down in the Delta",
      "runtime": 112,
      "poster_path": "/2ygShFSdj1hug8xj2q28OMktAU4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-12-25",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Sometimes, the last place you expected to be is the one place you've always belonged...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Maya Angelou"],
      "runtime": 112,
      "synopsis": "Single, drug-using mom Loretta Sinclair (Alfre Woodard) lives in a rough Chicago neighborhood with her mother, Rosa Lynn (Mary Alice) and two children, 11-year-old Thomas (Mpho Koaho) and little autistic Tracy (Kulani Hassen). Afraid that her daughter's situation will deteriorate, Rosa Lynn decides to send her daughter and grandchildren to spend the summer with her cousin Earl (Al Freeman, Jr.) in the Mississippi delta. Before their departure, Rosa Lynn pawns a family heirloom candelabrum they refer to as \"Nathan\", the name of their slave ancestor. Exiting the pawn shop, Loretta throws the pawn ticket in a wastebasket, but on a whim retrieves it; perhaps she thinks she can redeem Nathan later for drugs. The three are welcomed in rural Mississippi by Earl, a man of few words yet wise, where he lives with his senile wife Annie (Esther Rolle) who is cared for by a housekeeper. Earl puts Loretta to work in his chicken joint, where she understandably has a hard time keeping up with the work and the demands of a schedule. Eventually they all bloom, with Thomas teaching Loretta enough arithmetic to be able to waitress and thus make more in tips; Loretta becoming friendly with a nice local customer named Carl (Nigel Shawn Williams), and Tracy actually saying her first words. While a few calamities ensue, one involving Earl teaching Thomas about guns and the other when Annie wanders outside unsupervised, by the end of the summer the initially sullen Loretta decides to stay on and make her life in the delta. In the final scene, Nathan is redeemed and Earl tells them all of their proud family heritage.",
      "writers": ["Myron Goble"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0142231/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjMwMTgzOTkwNF5BMl5BanBnXkFtZTcwNzQ3NjIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Alfre Woodard, Al Freeman Jr., Mary Alice | See full cast and crew »"],
      "reviews": [
         "Despite the low budget, this is a very good movie. The performances are excellent and I recommend everyone to see it. I was in tears by the end of the film. My congratulations to everyone connected with this production.",
         "\"Down in the Delta\" is one of the better movies I have viewed. I find it difficult to believe it has not received more notice and distribution among the general population, but most certainly among African American audiences. This movie brought home to me, as a white person, the destructiveness and family division inherent in slavery better than anything I have ever seen or read before. It showed a terrible dark part of slavery and the awful effect it had on families. The simple, yet very powerful, story of Nathan poignantly illustrated the loss of family and loved ones that was so much a part of slavery. This is a movie about family that transcends race or color. All people can relate to the idea of how important family is from this movie. I was able to view this movie with my wife and children and enjoy it without having to \"cringe\" because of sex, violence, or language. This shows that movies can be made that entertain and educate without being filled with gratuitous titillations. Thank you for producing a wonderful movie that I will always remember. A movie about family and for family.",
         "Maya Angelou is BRILLIANT!! This was an excellent family movie. The story was interesting. And, told in what I consider to be a typical Maya Angelou fashion -- extremely interesting and poetic -- with many underlying messages. I love how the story led up to Nathan. How the symbolism of the candelabra strengthened the family. This showed how Nathan -- the candelabrum -- indirectly and unsuspectingly filled the role that Nathan -- the man -- was not allowed to do. It was almost as though Jesse -- Nathan's son -- knew instinctively that this candelabrum would play an important role in his family for generations to come. The actors did an excellent job -- particularly Alfre Woodard and Al Freeman, Jr. I love that everyone was a star -- yet no one was a star! I highly resented that you couldn't find Down in the Delta in the movies anywhere. When it comes to black films, it seems the film industry would rather show negative black images and nonsensical movies for black audiences. I was very disappointed at the lack of availability of this very positive movie. I've only been to one movie since; and have no immediate desire to attend any others. Although I have 2 free passes in my mirror -- sent to me by one of the major theatres to pacify me when I complained about the lack of availability of this movie -- I don't want free tickets (that's why they're still in my mirror). I want freedom of choice -- of being able to see positive images of black people. Chances are you couldn't find \"Down in the Delta\" in the movies. I've purchased the DVD. I intend to purchase several more -- as well as the VHS -- to give to family members as gifts. I highly recommend this film!!",
         "Although ignored at the box-office, this movie was beautiful. A must see by all black women. It was a movie that chronicled a woman's life that is similar to so many today. It shows how family is the foundation of happy lives. This movie was very moving for me. Not to mention the wonderful absence of profanity, sex and violence.",
         "Al Freeman Jr. is one of the greatest actors of our time. This movie proved it.In fact everyone from this fine gentleman and little Kulani were all in fine form. I also enjoyed the fact that the young man in the story came from the inner city and his grandmother helped raise him so he was polite and caring. The role of Alfre found herself because of the love of her family not a man. The only problem with the movie was the presence of Nathan (sloppy symbolism) and the heavy-handed ending. And why was Anne-Marie Johnson so angry (very contrived). Maya needed some help in the editing room too! (Fades and black-outs were too long.) The movie had many messages about family that were dear to my heart.",
         "\"Down in the Delta\" is a sanitized, journeyman film about a black Chicago mother of two who is sent to visit family in the Mississippi delta region with the hope that family ties, values, and environment can help her rehabilitate herself. Although an obvious \"feel good\" fabrication, \"Down...\" has a sufficient depth and charm to make it a thoroughly enjoyable watch with some good lessons for all.",
         "This movie begins in a Chicago ghetto, where Loretta is frankly doing a miserable job as a person and as a mother of two. As a last resort they drop in on her uncle in Mississippi for the summer, and his restaurant called \"Just Chicken\". From that point the real journey begins, accompanied by a few false starts, but accomplishing a wonderful transformation of not only Loretta's immediate family, but also the others they touch. It *is* a feel-good movie, but one that works well without becoming overly sappy. It's a good story, well-acted and well-directed, and will be enjoyed by anyone who shares traditional family values.",
         "A warm and life affirming story. Alfre Woodard gives another memorable, emotionally compelling performance in a story that engages from frame one. Al Freeman's fabulously inspired and understated performance as Uncle Earl is a lesson in how to fully inhabit a character without chewing the scenery. His is a most convincing and moving performance that should not be missed. Mary Alice has become one of the great African American screen matriarchs now, possessing a vulnerable serenity in this role which underscores our hopes for the rebirth of the urban progeny at the core of this film. Maya Angelou got up to directorial speed fairly quickly in this debut although some blocking and editing from early in the project (in opening scenes especially) are rough. She doesn't show a professional sense of timing in many of her edits and scene endings, but the heart she brings to her material more than compensates. And there are instances of excellent intercharacter cutting in scenes where it counts. It's fair to say that there's not a wasted scene anywhere in this film. It's equally fair to say that some scenes show more directorial finesse than others. Look for even greater work from this master poet. The only disappointment is Stanley Clarke's score, an unfortunate embarrassment for Mr. Clarke who is an accomplished jazz bassist otherwise. His score shows little ability to become emotionally involved with dramatic material and no skill with scenic beats and transitions. Clarke had a major opportunity to deliver here and he blew it -- and this is truly a hard movie to screw up. \"Down in the Delta\" is movie blessed with plenty of heart and a talented ensemble that delivers. Well worth two hours of your time.",
         "The great thing about this film is that it's so universal. Though it is about a black family and traces its generations since slavery, what shines through is the power of family. Being around family and knowing family history has a way of giving a person a sense of purpose and self esteem that makes them feel a little more sure of himself. It's a pity though that this is not always the case, but the function of family is to heal and to give you the love and support you need to face the world. I guess that's why in this storyline, the loss of family was so tragic and the candle stick became a symbol of not just the father who was sold into slavery but the necessity of family in each person's life.",
         "Maya Angelou is a woman of many talents: poet, actor, and now film director. But it is always the poet that informs everything else she does, and DOWN IN THE DELTA is a shining example of this. Despite the range of settings, from the gritty streets of the south side of Chicago to the rural landscape of Mississippi, this film has a lyrical quality that is all the more remarkable when you realize that Angelou did not write the script, though one senses that screenwriter Myron Goble at the very least consulted with her. For a first-time effort by a woman who is really not a movie director, this is an astonishing film: it is true, it is real, and every emotion comes through clearly. This is largely due to an extraordinary cast. The great Alfre Woodard plays Loretta, a woman who is drowning the difficulties of life in the Chicago ghetto with drink and, on occasion, drugs, though at this point she appears to be self-medicating occasionally and is at least partly kept in check by her mother Rosa Lynn (Mary Alice in yet another stunning performance), who makes sure she feeds her young, autistic daughter (though Loretta's response to this is to add cola to the milk in the child's bottle), and encourages her to find work, though she does so gently and stops short of nagging, until one day when Loretta, after an abortive attempt to secure a job as a supermarket cashier, heads for the nearest liquor store and buys a bottle, and in the next scene she appears to be in a drug house. Rosa Lynn is pushed beyond her endurance, and picks up the phone and calls her brother-in-law Earl (Al Freeman Jr in what just might be the performance of his career) down in Mississippi; her idea is to get Loretta and the kids out of there for the summer in the hope that reconnecting with her family and its history will bring her out of the funk she's in. She then informs her daughter that she has two choices: go stay with Earl for the summer or have her kids taken away. Frightened, Loretta listens to her mother, something we get the impression she has made a habit of not doing lately. To finance the journey, Rosa Lynn pawns an antique silver candelabra that everyone refers to as \"Nathan.\" Even Loretta is sober enough to be shocked by her mother's actions; the candelabra has been in the family since the Civil War, and the pawnshop gives her until September to redeem it or it will be sold. Rosa Lynn buys bus tickets and ships her wayward daughter and the kids off to her brother-in-law, with whom she has been arguing over ownership of \"Nathan\" for years but who nonetheless agrees to take Loretta and the kids. Because they're family and that is all the reason he needs. Arriving at Earl's Mississippi Delta home, Loretta and the kids meet Uncle Earl for the first time. They also meet aunt Annie (Esther Rolle), Earl's wife, who is suffering from Alzheimer's disease, a situation that provides the film with added poignancy and a little bit of gentle comedy. The film does not make fun of Alzheimer's but the way the family deals with Annie's occasional difficult behavior are amusing without being in the least offensive. Rounding out the remarkable cast are Loretta Devine as the family maid/nurse to Annie, Mpho Koaho as Loretta's son Thomas, and Wesley Snipes and Anne-Marie Johnson as Earl's lawyer son Will and his somewhat snooty wife Monica. The visit proves to be cathartic for the entire family in so many ways that they are too numerous to list here, and the revelations that come in the film's denouement are heart-wrenching. The performances all around are magnificent, but at the end of the day this is largely Woodard's film: she is the character with the most to lose at the beginning, and at the end she has grown into a self-actualized woman who believes in herself and for the first time has hope for the future. The film culminates with Rosa Lynn coming down South and bringing with her the candelabra. By this time, she has told her daughter the entire history of the candelabra and what it has meant to the family, and she and her brother-in-law bury the hatchet when he hands the candelabra to Loretta and says that it is rightfully hers. Loretta's response is to return it to its rightful place on the mantelpiece. This is a movie with a big heart. There's a lot of love in this family, and it is that love that heals the wounds they have suffered. The film also has an extraordinary sense of place, despite the fact that the exteriors were shot in Toronto, Ontario; nowhere near the Mississippi Delta. Made on a modest budget (shooting in Toronto was a way to save money), this movie tells its story better than a good many movies that cost ten times as much to make. Pay a visit to the Delta. You will be moved by it."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Amen Ra Films",
         "Chris/Rose Productions",
         "Showtime Networks"
      ],
      "summaries": ["Rosa Lynn sends her druggie daughter Loretta and her children Thomas and Tracy away from the big city to live with their uncle Earl in the ancestral home in rural Mississippi. Earl puts Loretta to work in his restaurant, Just Chicken, while also telling them about the generations of their family, the Sinclairs, dating back to their time in slavery before the the Civil War."],
      "budget": 0
   },
   "movielensId": 2434,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-25",
      "dvdReleaseDate": "1999-07-20",
      "directors": ["Maya Angelou"],
      "runtime": 112,
      "movieId": 2434,
      "title": "Down in the Delta",
      "mpaa": "",
      "actors": [
         "Alfre Woodard",
         "Al Freeman",
         " Jr.",
         "Esther Rolle",
         "Mary Alice",
         "Loretta Devine",
         "Wesley Snipes"
      ],
      "imdbMovieId": "0142231",
      "originalTitle": "Down in the Delta",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Rosa Lynn sends her druggie daughter Loretta and her children Thomas and Tracy away from the big city to live with their uncle Earl in the ancestral home in rural Mississippi. Earl puts Loretta to work in his restaurant, Just Chicken, while also telling them about the generations of their family, the Sinclairs, dating back to their time in slavery before the the Civil War.",
      "tmdbMovieId": 125582,
      "avgRating": 3.51224,
      "releaseYear": "1998",
      "numRatings": 286,
      "posterPath": "/2ygShFSdj1hug8xj2q28OMktAU4.jpg"
   }
}