{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0119336",
      "video": false,
      "title": "Hurlyburly",
      "recommendations": [
         60642,
         44546,
         27984,
         34631,
         50071,
         48502,
         72711,
         18941,
         42589,
         26176,
         51067,
         25576,
         118991,
         91018,
         102639,
         43937,
         25014,
         13482,
         48130,
         26408
      ],
      "backdrop_path": "/1QZS6EXJr7JhMxXKpwgmihezOE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe449ac3a368484e02c1ed",
               "name": "Sean Penn",
               "profile_path": "/f2uy1zq0qmtLBpsr6N9uQ8FktOr.jpg",
               "id": 2228,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "52fe449ac3a368484e02c1f1",
               "name": "Kevin Spacey",
               "profile_path": "/x7wF050iuCASefLLG75s2uDPFUu.jpg",
               "id": 1979,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Darlene",
               "gender": 1,
               "credit_id": "52fe449ac3a368484e02c1f5",
               "name": "Robin Wright",
               "profile_path": "/tXfQTgcIEPP7gtVdJ44ZxZPhacn.jpg",
               "id": 32,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Phil",
               "gender": 2,
               "credit_id": "52fe449ac3a368484e02c1f9",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Artie",
               "gender": 2,
               "credit_id": "52fe449ac3a368484e02c1fd",
               "name": "Garry Shandling",
               "profile_path": "/rMSod5msflCZBZ9LfJu8n4zYkuP.jpg",
               "id": 52865,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Donna",
               "gender": 1,
               "credit_id": "52fe449ac3a368484e02c201",
               "name": "Anna Paquin",
               "profile_path": "/5Q4vZK2PqHkreQLmbPspIgrSLUP.jpg",
               "id": 10690,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Bonnie",
               "gender": 1,
               "credit_id": "52fe449ac3a368484e02c205",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe449ac3a368484e02c1e9",
            "name": "Anthony Drazan",
            "profile_path": null,
            "id": 173686,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.786198,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24525,
      "vote_count": 30,
      "budget": 0,
      "overview": "Based on a play by David Rabe, Hurlyburly is about the intersecting lives of several Hollywood players and wannabes, whose dysfunctional personal lives are more interesting than anything they're peddling to the studios.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         4638,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241
      ],
      "original_title": "Hurlyburly",
      "runtime": 122,
      "poster_path": "/zPIYrJX7yTtFGxrlorSX3FTYseo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "FilmColony",
            "id": 1811,
            "origin_country": ""
         }
      ],
      "release_date": "1998-12-25",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anthony Drazan"],
      "runtime": 122,
      "synopsis": "Eddie (Sean Penn) is a coke addled casting director who shares home, business and occasionally women with Mickey (Kevin Spacey), and copious women and drugs with two other friends Arty (Garry Shandling) and best buddy Phil (Chazz Palmintieri). Over the course of a couple of days, Arty picks up a waif (Anna Paquin) who they all use shamefully. Mickey and Eddie converse constantly at home at work and by phone, trying vainly to square a love triangle involving Darlene (Robin Wright Penn). Phil meanwhile is an out of work actor who is considering getting his second wife pregnant because it will keep them together and yet is never around for her, prefering to agonise over his \"talent\". Tellingly in one scene Eddie is challenged that he keeps Phil around to remind him he isn't the lowest of the low. Phil clearly loves Eddie and needs his validation but Eddie probably has never actually cast him in anything. Mickey seems happy to stay the cleanest and most together of the four but is cynical and manipulative. A year later the film has moved on but the characters have not (although they probably think they have). Darlene is probably having an affair. Eddie is clean but can fall off the wagon at any moment. Phil is still agonising. Eddie fixes Phil up with Bonnie (Meg Ryan) a good time girl who, it emerges, is another person used and thrown away by the gang. At one point Phil hurls Bonnie out of a moving car - totally caught up in a noir like tough guy psychosis. The location inevitably is Mulholland, later the scene of a car crash that takes Phil leaving Eddie bereft. Before that there is time for Bonnie to return bruised and broken to end up ministering to Eddies emotional need with no one paying any attention to the potentially severe injury she is suffering. Phil returns and he and Eddie start, potentially, to be truthful with each other before lapsing back into philosophising. the boys love for each other takes precedence over and of the women. Phil leaves and returns carrying his own baby that he has kidnapped. The four hand the innocent child around like a toy in a hugely tension filled scene showing their utterly selfish irresponsibility. After Phil's funeral, the final scene is Eddie in the pool potentially drowning himself (not really) only for the abandoned waif, Donna, to reappear and offer him redemption...maybe he will grasp it, but probably not. the four have an amoral view of the world and an inflated sense of their own importance. The film is a scathing commentary about the self indulgence and navel gazing when Hollywood people tell each other shocking lies about how great they all are and then cocaine helps them take each other seriously. Eddie and Phil particularly enjoy cod philosophical explorations of their drug addled psyche, neither understanding the other. Mickey is flip and dismissive of this but is no better at seeing the world without the prism of his own ego. Arty is perhaps the most self conscious because he is a jewish caricature - anxious and apparently wise. The female characters are barely less self indulgent but definitely less well written; ciphers really - this is a buddy movie where none of the characters you'd want to be your buddy.",
      "writers": [
         "David Rabe",
         "David Rabe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119336/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjU4NDA2MTA2NF5BMl5BanBnXkFtZTYwMTc4Mjg5._V1_.jpg",
      "actors": ["Stars: Sean Penn, Kevin Spacey, Chazz Palminteri | See full cast and crew »"],
      "reviews": [
         "This is a recipe for filmmaking at its finest... Get a dialog driven play, get the playwright to pen it for the screen, and toss in two of the most intense and talented actors (Kevin Spacey and Sean Penn) in the business, supported by a very talented and surprising cast. What do you get? Hurlyburly! Billed as a black comedy, this is more what I would term \"black hole\" comedy. It is VERY dark, very disturbing, and the humor comes from the characters' need to lighten up a moment or to justify their actions. This film is NOT for everyone... If you're looking for anything truly humorous, this isn't the film. But if you want to see amazing acting and professionals who work well together, this is your film. Read other reviews with cautions on this film--don't confuse the tone of someone who hates what the characters stand for, what they believe in, and how they behave with the quality of the work done by the entire cast.",
         "This was an incredibly interesting movie. Besides an exceptional cast, the dialogue is sharp and witty and there are some very intriguing issues raised. However, it seems that these positive points are lost on most viewers. My guess is it's because you cannot remain a passive viewer or an idiot and expect to find any redeeming qualities in this movie. On the surface, Hurlyburly is populated by extremely unsympathetic characters that become more debased as the movie progresses. Eddie (Penn) provides the central thrust of the movie. Eddie is also almost continually snorting coke that fuels extended often seemingly disjointed dialogue. But most of the meaning is lost and the movie can become a bit tedious if you take this dialogue literally. The drugs and depravity serve to create a plausible environment for the expression of a much greater range of thoughts and emotions. It would be hard to swallow Eddie's neurosis and paranoia if he wasn't high all the time. And, Eddie's drug addled observations and frustrations are the glue of the movie. The drugs provide the writer with a device to verbalise many thoughts that normally would not be uttered aloud. More traditionally this type of problem might be solved by using a narrator. Eddie's problems and fears are not all that different from most people ... they are just extremely amplified.",
         "This is definitely not a movie for everyone. Heavy drug use, discomfiting sexual situations, bad language, violence, a talky, \"stagey\" atmosphere, and generally despicable characters. Even if you like the actors involved, this may still not be the movie for you (my aunt rented it for my uncle and herself on the strength of Kevin Spacey's name, and he still hasn't forgiven her). Having said that, I really liked this movie. I never saw the play, but when I read through it, I thought it was the most misogynistic piece of garbage I had ever encountered. Seeing it on screen, though, was a completely different experience. I felt that I understood what the playwright was trying to get at: namely, that this is a piece about how \"Eddie, through the death of Phil, is saved from being Mickey.\" In short, a spiritual redemption of sorts. Performances are uniformly strong. I have never been a big Sean Penn fan, but I thought he did a more than competent job with Eddie, particularly in the later scenes where he veers between arrogance and pathos. Kevin Spacey seemed uncomfortable with some aspects of the dialogue (i.e. \"blah blah blah\" etc.), but otherwise did his usual masterful job, in a role which raises the same questions that many of us would like to ask of him. The role of Donna was, I felt, disfigured by the many cuts in the script--she is more of a victim than a wanton, IMHO--thus, the best thing I can say about Anna Paquin's performance is that she did well with what she was given. I had no strong objections to any of the other casting choices, except for Meg Ryan as Bonnie, who apparently cannot even play a stripper without resorting to her usual cutesy mannerisms. FWIW, I liked the director's technical choice of \"opening\" the scenes by putting the conversations on cell phones, etc. However, I would have willingly sacrificed some of the added dialogue for some of the original lines that got cut. Final analysis: I thoroughly enjoyed this movie, and plan to buy it when it comes out on video,",
         "Highlighted by emotional, believable performances by its cast (Sean Penn in particular is typically brilliant), Hurlyburly is not for everyone, but can be a powerful and compelling drama for those who approach it with an open mind. The film is frequently referred to as a comedy-drama, a misleading designation for what is a sometimes humorous, but ultimately emotional and sobering look at life in 1980s Hollywood. Particularly well-done are the cocaine-fuelled scenes which provide one of the most accurate depictions of the drug lifestyle and the effect it can have on interpersonal relationships. The film can seem over-the-top in parts, but the excess is necessary to convey the film's message. Emotional, witty, thought-provoking and on some levels deeply depressing, Hurlyburly is an underrated and under-appreciated character-driven drama that capitalizes on the talents of an all-star cast to deliver a top-notch product.",
         "HurlyBurly is one of those movies for me that i can watch over and over again, and each time see something different, each time connect to it in a different way. The movie captures one man's struggle for meaning and significance in his with a desperation that has rarely been caught on film before. The movie deals in archetypes, with nearly all the characters neatly sitting into one archetype or another. After watching the movie one cant help wonder which of the people he knows is like which of the characters in the movie. The direction and cinematography are used to serve the characters, and thats what the movie is about, the characters. Nothing much happens in the movie, other than people meeting, and people talking. I always find brutally honest characters interesting to watch, and this entire movie might just be about that. The cast, and the acting is excellent. Many people are bored by the movie because of its wordiness, and many people disparage it as a drug movie. Although the film is wordy, it is not a drug movie. I would say it is a philosophical movie if anything else. The movie forces you to be introspective, and the movie even acts like somewhat of a Rorschach test on the viewers. Some scenes, like the one where Eddie and Mickey describe the road trip, can be seen in different ways. I like to think that the way people understand this movie has a lot to do with the kind of people they are. Do watch this movie, but remember that the movie is demanding. The characters talk fast, and talk a lot. The ideas expressed are complicated, and need to be thought about to be properly understood. In fact, watch this movie twice.",
         "You liked \"Glengarry Glen Ross\"? You're gonna love THIS one. Kevin Spacey doing his patented \"snide\" riffs. Anna Paquin growing up and showing some range. Garry Shandling? Who knew? Meg Ryan finally playing something besides America's Sweetheart. Disturbingly funny in some sequences (particularly the Sean Penn-Chazz Palminteri duets) and laugh-out-loud vaudeville in others (the Spacey-Penn cell phone bit is an instant classic). The ensemble cast, with excellent direction, gets all the rhythms of the script. It may look a little over-the-top here and there but it seems to be a conscious choice by the director in this epic send-up of 80's Hollywood excess. While it's readily apparent that no one is going to go home humming the tunes from this one, it's still a bit surprising that the film garnered no major nominations. Same deal as \"Glengarry\". Give 'em a great ensemble in a black comedy with no discernible \"star\", a solid script and inventive direction and be prepared for the icy shoulder at Oscar time. It's an unjust world we live in. This movie deserves a wider audience but owing to the subject matter, it probably won't get one. But I'll give it an 85, Dick. It's got a great beat and you can dance to it!",
         "Spoilers herein. `Trainspotting' meets `The Big Kahuna' meets `The Ice Storm.' Sean Penn is the best actor in film, period. He is one of the few actors who can act several roles simultaneously. Kevin Spacey is the best ensemble leader in film today. Though here he does his old wise man character, he knows how to project his being into the actors around. You'll want to see this just to watch the craft. But the pacing is tedious. Some of the language is brilliant, And the basic notion, of obsessive self-referential examination is rich, but the enterprise fails because of the misunderstanding of time.",
         "A touching movie about friendship and dependency viewed through the distorting lens of rampant nihilism. There's a theatrical eloquence to the dialogue that lends it mesmerizing power. It has a literary quality that some people will find unbearably pretentious, but which I found deeply moving. The movie starts out with a fast paced barrage of hilarious absurdities. As it gets slower and more ponderous it sometimes veers off course, but in a sense this just deepens the sense of human frailty. Similarly the somewhat grasping conclusion does not significantly detract from the film's main thrust. Acting by Kevin Spacey, Sean Penn and Garry Shandling is absolutely top notch. Chazz Palminteri isn't always as convincing. Excellent showing by Meg Ryan.",
         "For many movie fans who truly love the art of film, a good screenplay is the jeweled movement on which marvelous films turn and pivot. They remain with you as memorable experiences, be they like Kubrick's Dr. Strangelove, Gandhi, or The Maltese Falcon. The genre hardly matters; good screen play is an essential in even the action movie. Too bad so much mediocre screen writing abounds when good talent seems so obtainable. 'Hurlyburly' was adapted from the play for the screen by the author. In a word, it is brilliant. The acting is superb in every character, and the casting was perfect. Once again, Sean Penn gives a performance that is indicative of his paramount position as one of the very best actors of his generation \u0097 a superlative star given any generation. I can just imagine that this film has made some pretty bad friends in some quarters \u0097 and in both genders. There is no hiding the fact that this sort of world exists to some extent anywhere a group of hedonistic, single males (or men who think that they are still single) gather to hang out, relax or party. But a viewer will be missing the point if she/he thinks that 's all there is \u0097 gratuitous, reckless living. Marshall McLuan's theory of amputation kept occurring to me after watching the film \u0097 the idea that with each additional machine in our culture we are being cut off from our humanity. This is a psychodrama that does not resort to the unspoken, latent trauma that lurks in the past to trouble our characters. Something in Eddie is more truncated than broken, and although he doesn't know what it is, he is intensely aware that it is causing him despair, loneliness and pain. The drugs maybe both cause and effect. Beyond the pain itself, he is completely unsure about what he thinks he is supposed to feel. Some considerable irony floats around this issue, and to the director's credit it is revealed with cunning grace. This film demonstrates that amidst all the lowest common denominating crud, American mainstream cinema is occasionally distributing intriguing works of art. This may not be the film to purposely chose on a sad evening of angst and regret, but if you were to catch it at such a moment, the performances might sweep you up, and the film that was a play could beguile you. I gave it an unequivocal 10 for the same reasons your movie guide gives 5's for the films that I would love to have in my tape and disk library.",
         "a lot of the negative reviews of this movie are a consequence of the viewers simply not enjoying this type of work. it aint a happy movie and its not for everyone. if you've never spent serious time in NYC, LA, SF or some similar city, then you probably do not 1) know and interact with people like this on a regular basis, 2) understand the true to life social context of the scenes/plot or 3) comprehend the use of drugs amongst nearly every ladder rung within certain industries and hence can't recognize that the writer/director is making a parody of it all. the writing is clearly very witty (you try writing it) and if you know people like those portrayed, then you would also see that the acting also first rate. if you don't like this because of its repetitive babble, self absorbed characters, harsh realities and use of nose candy then perhaps you just don't know that this movie is a near documentary. i recommend you visit your friends in any big city and see if you can't get to a few banker / journalist / academic / consulting / advertising / acting parties. experience, re-watch, then review."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "FilmColony",
         "Storm Entertainment"
      ],
      "summaries": [
         "Hurly-burly is an adaptation of David Rabe's well known play about the intersecting lives of several Hollywood players and wannabes who's personal lives threaten to veer into a catastrophe more interesting than anything they're peddling to the studios.",
         "Hollywood movers and shakers dissect their own personal lives when everything seems to clash together."
      ],
      "budget": 0
   },
   "movielensId": 2435,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-25",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Anthony Drazan"],
      "runtime": 122,
      "movieId": 2435,
      "title": "Hurlyburly",
      "mpaa": "",
      "actors": [
         "Sean Penn",
         "Kevin Spacey",
         "Robin Wright",
         "Chazz Palminteri",
         "Garry Shandling",
         "Anna Paquin",
         "Meg Ryan"
      ],
      "imdbMovieId": "0119336",
      "originalTitle": "Hurlyburly",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Based on a play by David Rabe, Hurlyburly is about the intersecting lives of several Hollywood players and wannabes, whose dysfunctional personal lives are more interesting than anything they're peddling to the studios.",
      "tmdbMovieId": 24525,
      "avgRating": 2.96138,
      "releaseYear": "1998",
      "numRatings": 712,
      "posterPath": "/zPIYrJX7yTtFGxrlorSX3FTYseo.jpg"
   }
}