{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "ambassador",
            "id": 1704
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "benito mussolini",
            "id": 8077
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0120857",
      "video": false,
      "title": "Tea with Mussolini",
      "recommendations": [
         40562,
         177851,
         84851,
         47855,
         181756,
         78128,
         34681,
         82520,
         146759,
         91930,
         40002,
         39806,
         47574,
         46228,
         54514,
         10918,
         18701,
         14383,
         23601,
         62984
      ],
      "backdrop_path": "/jkY5Q0FDuqECdY2ekNZ85x7shy3.jpg",
      "revenue": 21001563,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Elsa Armistan",
               "gender": 1,
               "credit_id": "52fe43619251416c7500e209",
               "name": "Cher",
               "profile_path": "/nLi4qPXWEuhjc31bmbeINLVZ8zS.jpg",
               "id": 38225,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Arabella",
               "gender": 1,
               "credit_id": "52fe43619251416c7500e211",
               "name": "Judi Dench",
               "profile_path": "/2is9RvJ3BQAku2EtCmyk5EZoxzT.jpg",
               "id": 5309,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Mary Wallace",
               "gender": 1,
               "credit_id": "52fe43619251416c7500e24f",
               "name": "Joan Plowright",
               "profile_path": "/dGtQVBpLVqb0w53m15A7nVVt30A.jpg",
               "id": 23709,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Lady Hester Random",
               "gender": 1,
               "credit_id": "52fe43619251416c7500e20d",
               "name": "Maggie Smith",
               "profile_path": "/kkMNu2iqkBPkbjhNBmDaUX7FHr.jpg",
               "id": 10978,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Georgie Rockwell",
               "gender": 1,
               "credit_id": "52fe43619251416c7500e215",
               "name": "Lily Tomlin",
               "profile_path": "/eVEt45q7QIEoZQwINx7RfTE6Sk6.jpg",
               "id": 10437,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Luca",
               "gender": 0,
               "credit_id": "54dfdc419251411953003fcd",
               "name": "Baird Wallace",
               "profile_path": null,
               "id": 1232520,
               "order": 5
            },
            {
               "cast_id": 25,
               "character": "Luca (Child)",
               "gender": 2,
               "credit_id": "54dfdd68c3a3684541004a86",
               "name": "Charlie Lucas",
               "profile_path": null,
               "id": 192953,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Paolo",
               "gender": 2,
               "credit_id": "54dfdc50c3a368454b003e15",
               "name": "Massimo Ghini",
               "profile_path": "/iSpdphEZopzvu3816YsiFhhKwRb.jpg",
               "id": 148251,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Vittorio Fanfanni",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e253",
               "name": "Paolo Seganti",
               "profile_path": "/qbnw8pKwHVzVATSweEK1iUt34Dc.jpg",
               "id": 156294,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Benito Mussolini",
               "gender": 0,
               "credit_id": "54dfdc72c3a368454b003e17",
               "name": "Claudio Spadaro",
               "profile_path": "/f2qHt1LS568EoPb9RfpAqsJlvYb.jpg",
               "id": 119352,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Wilfred Random, aka Miss Lucy",
               "gender": 2,
               "credit_id": "54dfdc8d925141469f0020d2",
               "name": "Paul Chequer",
               "profile_path": "/lEUGYIS4uu79Wocl2Ro4frKZ5GF.jpg",
               "id": 1214973,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "First Carabiniere",
               "gender": 0,
               "credit_id": "54dfdce6c3a368537a003a52",
               "name": "Giacomo Gonnella",
               "profile_path": "/grj2LcKYHB3fGTEK6vDsVFEd9s8.jpg",
               "id": 26284,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "American Dealer",
               "gender": 0,
               "credit_id": "54dfdd04c3a368537a003a56",
               "name": "Allan Caister Pearce",
               "profile_path": null,
               "id": 1427290,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "German Officer",
               "gender": 2,
               "credit_id": "54dfdd18925141195a003e15",
               "name": "Hermann Weiskopf",
               "profile_path": null,
               "id": 1185610,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Maurizio",
               "gender": 0,
               "credit_id": "54dfdd2ac3a36855c7001f63",
               "name": "Roberto Farnesi",
               "profile_path": "/2dvCcOdFnV9bU3Qv3bbOiLOUiYZ.jpg",
               "id": 128468,
               "order": 15
            },
            {
               "cast_id": 26,
               "character": "Major Gibson",
               "gender": 2,
               "credit_id": "54dfddef925141469f0020e3",
               "name": "Chris Larkin",
               "profile_path": "/kjVq9FK96gIwcfDxyB3ILMIjfvh.jpg",
               "id": 25658,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e21b",
               "name": "Franco Zeffirelli",
               "profile_path": "/rzu0vDf1FtvriZty1gJ1OwhrReN.jpg",
               "id": 24657,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e221",
               "name": "Clive Parsons",
               "profile_path": null,
               "id": 63960,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43619251416c7500e227",
               "name": "Marco Chimenz",
               "profile_path": null,
               "id": 65248,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43619251416c7500e22d",
               "name": "Stefano Arnaldi",
               "profile_path": null,
               "id": 65249,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe43619251416c7500e233",
               "name": "Alessio Vlad",
               "profile_path": null,
               "id": 65250,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e239",
               "name": "Tariq Anwar",
               "profile_path": null,
               "id": 8219,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e23f",
               "name": "David Watkin",
               "profile_path": null,
               "id": 10639,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e245",
               "name": "John Mortimer",
               "profile_path": null,
               "id": 65251,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e24b",
               "name": "Franco Zeffirelli",
               "profile_path": "/rzu0vDf1FtvriZty1gJ1OwhrReN.jpg",
               "id": 24657,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 3.469161,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         }
      ],
      "id": 10368,
      "vote_count": 40,
      "budget": 12000000,
      "overview": "Semi-autobiographical film directed by Franco Zeffirelli, telling the story of young Italian boy Luca's upbringing by a circle of English and American women, before and during World War II.",
      "similar": [
         637,
         238,
         369885,
         16869,
         2253,
         5925,
         853,
         857,
         424,
         14574,
         228150,
         423,
         613,
         4347,
         339259,
         289222,
         1251,
         802,
         351339,
         403
      ],
      "original_title": "Tea with Mussolini",
      "runtime": 117,
      "poster_path": "/zdjO9Ji3Yqn6ZDe7VwtdQ4F9G8f.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cattleya",
            "id": 10102,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cineritmo",
            "id": 10378,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Film and General Productions",
            "id": 10379,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Medusa Produzione",
            "id": 1702,
            "origin_country": ""
         }
      ],
      "release_date": "1999-03-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Franco Zeffirelli"],
      "runtime": 117,
      "synopsis": null,
      "writers": [
         "John Mortimer",
         "Franco Zeffirelli"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120857/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyNDQxODUyOF5BMl5BanBnXkFtZTcwNTczMTM3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Maggie Smith, Judi Dench, Joan Plowright | See full cast and crew »"],
      "reviews": [
         "TEA WITH MUSSOLINI is Zeffirelli's tribute to his own war-time upbringing, and while it is undeniably sentimental, it is also a wonderful movie. A young, illegitimate boy who is rejected by his father (who is married to another) is raised by his secretary (Joan Plowright). She is part of a group of English ex-pats living in life on very fixed incomes in Florence on the eve of WWII. Plowright's other peers include Maggie Smith as the insufferably snobbish widow of a consulate, who never lets anyone forget her status. There's also Judi Dench, an artist, who is a gentle soul and an animal lover. Lily Tomlin is an American who keeps a watchful eye on the ladies at the danger comes closer to engulfing them all. And then there's Cher, the widow of a rich man who comes and goes throughout Europe in search of good art and a good time. All these women have come to love the young boy who is now about 14 when the movie begins. Cher, whose character is Jewish is damn near ruined by a scheming lover, and her life is in danger. The British contingent has been sent to close quarters in Sienna where they are forced to live in close proximity to each other, as prisoners of war. The war is nearly over with the Americans advancing on Sienna. The young man helps to arrange Cher's escape and the woman stop bickering long enough to help the Americans liberate Sienna and all ends happily. Some have complained that Cher is terrible in this movie. Nonsense. She's playing a head-strong, independent woman who is in charge of her own life. This is a variation of the same theme she has worked as an actress, entertainer and personality for more than 40 years. The final parting with the young boy is tear-inducing. Cher looks sensational and gives a heart-felt performance. The ladies--Dames Joan, Maggie and Judi are adorable and winning as expected with Lily Tomlin offering a wonderful portrait of a tough journalist who comes to their support when the going gets rough. The young boy as Zeffirelli is also terrific. The scenery is gorgeous, and you can't see too many stories about interesting, off-beat characters on the loose in Italy as far as I'm concerned.",
         "This film is one of the most touching and lovely films that I have seen in many years. Its gaggle of actresses are second to none and turn out excellant performance, Joan Plowright in particular brings an irresistable sweetness to the role. People who have commented on the film so far seem to have neglected to mention the soundtrack which is beautiful and inspiring with a wonderful piano piece. Criticism that the film is too old fashioned or that the characters are unappealing and pompous seems to miss the point, the very charm of Hester (Maggie Smith in particular)is how she overcomes her snobbery at the end and realises how much Elsa (Cher, who in any other film would doubtless be misplaced but in this case fits the role like a glove) has done for the Scorpioni. In short the film is a relic of a gentler age and is simultaniously uplifting, upsetting and relaxing. I implore everyone to hunt down the soundtrack on CD to the ends of the earth if necissary.",
         "This is a melodrama and you should not expect anything else. But what a melodrama! In the hands of a great director, using an eccentric story involving some eccentric people, it conveys straight to the heart how the great darkness descended upon Europe in the 1930's. It tells you that the greatest evil is the work of humans, and that the potential for evil lurks in the human soul. But, and here is the movie greatest strength, it shows you that humans possess the capacity to be human and to act human, when they heed Shakespeare's advice: \"Love thyself last\". All the negative comments that can be made about this or that deficiency caused me to downgrade this movie's rating from a \"10\" to a mere \"9\". Go see it. If you have kids - make sure to take them along for a great and satisfying lesson about life as it should be lived.",
         "This film could have been titled 'four crazy grannies' for the marvelous portrayal of little old ladies, each more eccentric than the next. Like the comedy team of Matthau and Lemon, Dench, Smith and Plowright have a chemistry that is explosive. Maggie Smith played a role that she has spent a lifetime perfecting. She captivates us as a snobbish dowager, tantalizes us with her improbable tea party and brings us to tears when she demonstrates her capacity to grow. Although she may not have wowed us with her Shakespeare, Joan Plowright's compassion for her sudden charge made me wish (that at age 32) she would adopt me. Her love of the classics, remind us that art, literature and friends can help us transcend life's constant miseries. Cher demonstrated that she could act in any time period. While Dame Judi Dench (not allowing herself to be typecast as a Queen) portrays a particularly pitiful creature as an aging artist with more passion than talent. This film sends a clear message to Hollywood: experience and talent win out over T&A. Applause at the end of this movie is to be expected. Brava!",
         "Another Judi Dench film that in no way disappoints. This film opens the mind even more to that important chapter in history and lets you look from various perspectives at events. I found it a really fascinating film, absolutely beautiful cinematography. Excellent story telling, narrative, really well paced and put across. And wonderfully acted across the board, from main characters to all the supporting cast, I did not realise Cher was such a good actress. Stories like this based on fact, are so wonderful. And the movie captures Florence, so pleasingly, you will long to visit. A welcome break from the mindless action flicks.",
         "I had wanted to see this film for some time and when the opportunity finally materialised I was enthralled. It is probably the best performance I have seen by Maggie Smith, who often seems to be playing the same character actually. But this is her best since Miss Jean Brodie, and Joan Plowright, Judi Dench, Lily Tomlin and Cher are all equally impressive. The settings are skilfully designed to draw the viewer in, and when you are setting your movie in Florence and its environs you can't go wrong anyway. The ongoing clash between two worlds i.e. Lady Hester Random (Maggie Smith) versus Elsa (Cher) reaches a satisfying resolution which it would be unfair to reveal. There are splendid comic vignettes mixed into the overall drama. Judi Dench and her dog being thrown out of the cathedral, sharply contrasts with the chilling moment when the Jewish arts professor is taken away by the Gestapo. Understated but none the less effective, probably more so, because of it. If you haven't seen this film, see it as soon as you can.",
         "It's certainly not clear how fictionalized a version of Zeffirelli's autobiography \"Tea With Mussolini\" is, what with the usual disclaimers at the end. Even presuming this is just a riff off an incident in his life, that he had some contact with memorable English ladies, it's clearly his tribute to where his love of English literature comes from, particularly Shakespeare. He's done several Shakespeare interpretations-- movies, opera and play directing. The film has a lovely scene of him being first introduced to acting out \"Romeo & Juliet\" with puppets, as well as constant quotes from Shakespeare throughout about war and his situation. I was surprised how good the movie was - I was in tears several times, especially with visuals that bring up the same comparisons as \"The Train\" did, with art vs. war, humanity's heights of creativity vs. its lows of prejudice and violence. These Oscar-winning ladies are absolutely terrific, yes including Cher. One elderly gentleman behind me complained that Maggie Smith basically always plays the same character but I thought her character does change towards the end. The others were certainly not their usual on-screen personas, Judi Dench as a free-spirited artist, Joan Plowright as a quite warm-hearted grandmotherly type, and Lily Tomlin a hoot as a butch archaeologist. But why choose bland Italian actors for them to play off of? To make the Scorpioni, as they are called, stand out more? The Italians seemed stereotyped to me, Latin lover, ignorant peasants not appreciating their ancient artistic heritage. What the movie also brought to mind is how few Italian movies have dealt with their fascist past as much as the French have been exploring their consciences of collaboration in film. Sure \"Garden of Finzi Continis,\" \"Two Women\" and \"Life Is Beautiful\" show arrests, etc. but I don't get the sense of soul searching as to how did this happen here and could it again? Just because they didn't have Shakespeare and appreciate the treasures of the Uffizi as this film implies? (originally written 5/15/1999)",
         "This film is directed and co-authored by Franco Zeffirelli, and I couldn't resist speculating on how much of it was actually true, since it is said to be based on Zeffirelli's autobiography. However, true in part, true completely, in the end it doesn't really matter. What matters is the amazing ensemble acting by Maggie Smith, Cher, Joan Plowwright, Judi Dench and Lily Tomlin (listing them in the order of significance to the story) and the stunning beauty of Florence where the film is set. The director and photographer plainly love the city, matching the love for it of the characters. Maggie Smith as the widow of a former British ambassador, the character that actually has tea with Mussolini, is the dominant figure in the film. However, Cher, playing a wealthy American -- vulgar in the eyes of he British ladies -- who turns out to be a complex, philanthropic Jew who must be smuggled out of the country in the end; Joan Plowwright as a kind lady who takes in the bastard son of an Italian businessman and teaches him to be an English gentleman; Judi Dench as an eccentric artist whose passion is to preserve a renaissance fresco from the Nazis during the war, and Lily Tomlin as a lesbian American archaeologist all deliver sterling performances. Cher's performance is the most amazing -- she holds her own in formidable company -- but one expects, of course, to be dazzled by Maggie Smith, Joan Plowwright, Judi Dench and even by Lily Tomlin. It's a sentimental, even melodramatic, tale, but see it for the ensemble acting. I can't think of another film that equals Tea with Mussolini in that respect.",
         "Though Cher's character is difficult to believe totally and she has difficulty with her lines, Tea with Mussolini posits some interesting questions. The major question is about the question of morality in time period that was imploding morally and spiritually. The morality is not merely obeying the dictates of the Church or of the State. The second question is that the women in the film chose to ignore the reality of the brutality and evil of the regime of Hitler and Mussolini in favour of what they wanted to believe and to do. So, what is the thing that is blinding us from seeing the harm done by those who want to be nominatively in charge? Still, if people see it as mindless fluff, that is their privilege.",
         "After nearly 20 years as a top pop and television star, Cher suddenly skyrocketed to film stardom in the mid-80's, walked off with an Academy Award, ranked among the top ten box-office stars and just as suddenly disappeared from the big screen in 1991 after one last hit \"Mermaids\"(1990) cleaned up at cinemas. In 1999 she made a tremendous comeback with a multimillion selling CD \"Believe\"(Warner Bros, 1998) and most impressively returned to the big screen with a luminous performance in Franco Zefferelli's \"Tea With Mussolini\"(MGM,1999). Reviews were mixed but after I saw this in the movie theater, I felt the film was rather good. Based on an autobiography by Zefferelli recounting his early years trying to survive the Nazi-Mussolini atrocities of WWII. During this dangerous time Zefferelli was protected by a coterie of socialite dowagers played splendidly by Maggie Smith, Judi Dench, Joan Plowright, Lily Tomlin and of course Cher who was perfectly cast as a gorgeous Jewish chanteuse. The story has some holes and the film was probably edited down too much for its US release that cause some continuity issues but this is overall a charming, thoughtful period piece highlighted by Cher at her latter day peak. Shame this success did not resuscitate her dormant film career. She has made nothing of note since."
      ],
      "genres": [
         "Drama",
         "Comedy",
         "War"
      ],
      "productionCompanies": [
         "Cattleya",
         "Cineritmo",
         "Medusa Film"
      ],
      "summaries": [
         "1935. A group of elderly British women, who the Italians have named the Scorpioni, have chosen Italy, specifically Florence, as a place to live to blend their proper British sensibilities with their love of Italian art and culture. One of those Scorpioni, Mary Walsh, works as the English secretary for Paolo Innocente, who, in part because of his own wife's adamant refusal, largely neglects his illegitimate adolescent son, Luca, despite Paolo's want for Luca to grow up to be a proper young man, much like the English. Luca has lived in an orphanage since his dressmaker mother's death, death a concept that Luca does not yet understand. As such, he often runs away looking for his mother. On a mutual agreement between Paolo and Mary, Mary becomes Luca's guardian, she who will receive help in raising Luca by her fellow Scorpioni and financial help from Paolo as needed. Associated with the Scorpioni is a brash younger nouveau riche Jewish-American woman named Elsa Morgenthal, who, because of her affection for Luca's mother to who she owed money, sets up a trust for Luca's future. Among the Scorpioni, Lady Hester Random, the widow of the former ambassador to Italy, in particular and Elsa do not get along because of their fundamental outward differences. The life for the Scorpioni changes with the onset of WWII, more specifically when Italy declares war on Britain and France. Despite all of the Scorpioni taken into custody of sorts by the Italians, they are eventually housed in the comforts of a hotel. Lady Hester wrongly believes it is her association with Mussolini that has gotten them into their comfortable surroundings, but which in reality was arranged and paid for by Elsa. Luca, who has just returned to Italy after attending school in Austria, helps Elsa with her efforts to assist those persecuted in Italy. Luca, now a teenager, has fallen in love with Elsa. As such, Luca is jealous of Elsa's professional and personal relationship with Italian lawyer Vittorio Fanfanni. Elsa's own situation becomes more precarious with the United States' entrance into the war, the Nazis' increasing persecution of Jews, and Luca discovering that Fanfanni has ulterior motives in his relationship with Elsa. Through it all, Mary still tries to be the voice of what is right to Luca, who may be tainted by his own immature teenaged thoughts during these difficult times.",
         "Semi-autobiographical tale from the early life of director Franco Zeffirelli looks at the illegitimate son of an Italian businessman. The boy's mother has died, and he is raised by an Englishwoman in pre-WWII Fascist Italy. Living to each other in Florence, and presided over by an ambassador's widow, a group of Englishwomen live a sheltered existence which they believe is guaranteed personal protection in a tea reception given by Il Duce. However, as war breaks out, the women are interned. Occasionally in this English colony is a wealthy American, who visits among her travels and marriages to wealthy older men. She respects the \"Scorpioni\", as they are known, and secretly arranges for their stay in a hotel. The ambassador's widow finds her vulgar and tries to ignore her, but when the United States enters the war, the American too is taken into custody. Only then does she discover that her Italian lover has tricked her into signing over all her money and modern art collection to him, and is now arranging her execution. This obliges all to join forces. Lily Tomlin also appears as an American archaeologist working at a dig in the city.",
         "Semi-autobiographical tale from the early life of director Franco Zeffirelli. An illegitimate child is raised by an Englishwoman in pre-WWII Fascist Italy, part of an English community in Florence presided over by a diplomat's widow. Elsa Morganthal Strauss-Armistan is a wealthy American collector of modern art who visits these \"Scorpioni\" on occasion."
      ],
      "budget": 12000000
   },
   "movielensId": 2436,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Pусский"
      ],
      "releaseDate": "1999-03-25",
      "dvdReleaseDate": "1999-11-16",
      "directors": ["Franco Zeffirelli"],
      "runtime": 117,
      "movieId": 2436,
      "title": "Tea with Mussolini",
      "mpaa": "PG",
      "actors": [
         "Cher",
         "Judi Dench",
         "Joan Plowright",
         "Maggie Smith",
         "Lily Tomlin",
         "Baird Wallace",
         "Charlie Lucas",
         "Massimo Ghini",
         "Paolo Seganti",
         "Claudio Spadaro",
         "Paul Chequer",
         "Giacomo Gonnella",
         "Allan Caister Pearce",
         "Hermann Weiskopf",
         "Roberto Farnesi",
         "Chris Larkin"
      ],
      "imdbMovieId": "0120857",
      "originalTitle": "Tea with Mussolini",
      "genres": [
         "Comedy",
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["rSvRcd2QazA"],
      "plotSummary": "Semi-autobiographical film directed by Franco Zeffirelli, telling the story of young Italian boy Luca's upbringing by a circle of English and American women, before and during World War II.",
      "tmdbMovieId": 10368,
      "avgRating": 3.40805,
      "releaseYear": "1999",
      "numRatings": 1403,
      "posterPath": "/zdjO9Ji3Yqn6ZDe7VwtdQ4F9G8f.jpg"
   }
}