{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "circus",
            "id": 291
         },
         {
            "name": "radio station",
            "id": 1224
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "serial killer",
            "id": 10714
         }
      ],
      "imdb_id": "tt0144546",
      "video": false,
      "title": "Outside Ozona",
      "recommendations": [],
      "backdrop_path": "/twv63lFmfoyyEbhg5kDAJy5AQWy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Odell Parks",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d43",
               "name": "Robert Forster",
               "profile_path": "/3ulaOBmEqmGQ8ywo8wHAqGJ2odX.jpg",
               "id": 5694,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Wit Roy",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d47",
               "name": "Kevin Pollak",
               "profile_path": "/kwu2T8CDnThZTzE88uiSgJ5eHXf.jpg",
               "id": 7166,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marcy Duggan Rice",
               "gender": 1,
               "credit_id": "52fe4aa29251416c750e8d4b",
               "name": "Sherilyn Fenn",
               "profile_path": "/1AKZocU6gfD1udBPUxYH6Vez8Ll.jpg",
               "id": 6681,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Alan Defaux",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d4f",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Earlene Demers",
               "gender": 1,
               "credit_id": "52fe4aa29251416c750e8d53",
               "name": "Penelope Ann Miller",
               "profile_path": "/6wjG6NUBKc6Ca4KX6G6V4t6sU2.jpg",
               "id": 14698,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Rosalee",
               "gender": 1,
               "credit_id": "52fe4aa29251416c750e8d57",
               "name": "Swoosie Kurtz",
               "profile_path": "/sISOxpV6zn3EfC5uKVsX7s9xLBf.jpg",
               "id": 12967,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dix Mayal",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d5b",
               "name": "Taj Mahal",
               "profile_path": "/tEqFRK0vJFZsTgwMSLdUqnKKrRB.jpg",
               "id": 94511,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Floyd Bibbs",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d5f",
               "name": "Meat Loaf",
               "profile_path": "/43nyfW3TxD3PxDqYB8tyqaKpDBH.jpg",
               "id": 7470,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Agent Ellen Deene",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d63",
               "name": "Lucy Webb",
               "profile_path": null,
               "id": 1180882,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Effie Twosalt",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d67",
               "name": "Lois Red Elk",
               "profile_path": "/ekKiGuwtdG8Bz2UCzj7WsAPHci0.jpg",
               "id": 933686,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Reba Twosalt",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d6b",
               "name": "Kateri Walker",
               "profile_path": "/huGq0gtpU7N4LuPWtGNEmLel4Y1.jpg",
               "id": 62475,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Bonnie Mimms",
               "gender": 1,
               "credit_id": "52fe4aa29251416c750e8d6f",
               "name": "Beth Ann Styne",
               "profile_path": null,
               "id": 1028736,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Agent Tony Cole",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d73",
               "name": "Kirk Baily",
               "profile_path": null,
               "id": 176035,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Truck Stop Owner",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d77",
               "name": "Michael Holmes",
               "profile_path": null,
               "id": 592361,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Detective Krich",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d7b",
               "name": "Bert Emmett",
               "profile_path": null,
               "id": 1030755,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Convenience Store Clerk",
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d7f",
               "name": "Benjamin Lum",
               "profile_path": null,
               "id": 156850,
               "order": 15
            },
            {
               "cast_id": 18,
               "character": "Secretary",
               "gender": 1,
               "credit_id": "52fe4aa29251416c750e8d83",
               "name": "Heidi Jo Markel",
               "profile_path": "/3KhaRkTTN9r5dBgzNpl2wA953AB.jpg",
               "id": 65114,
               "order": 16
            },
            {
               "cast_id": 19,
               "character": "Strip Club D.J.",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d87",
               "name": "Dylan Tarason",
               "profile_path": null,
               "id": 52373,
               "order": 17
            },
            {
               "cast_id": 20,
               "character": "Radio Furniture Salesman",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d8b",
               "name": "Butch McCain",
               "profile_path": null,
               "id": 174798,
               "order": 18
            },
            {
               "cast_id": 21,
               "character": "Margaret Chanute",
               "gender": 0,
               "credit_id": "52fe4aa29251416c750e8d8f",
               "name": "Patti Duce",
               "profile_path": null,
               "id": 1214770,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d3f",
               "name": "J.S. Cardone",
               "profile_path": null,
               "id": 52371,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d95",
               "name": "J.S. Cardone",
               "profile_path": null,
               "id": 52371,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8d9b",
               "name": "Irek Hartowicz",
               "profile_path": null,
               "id": 21419,
               "department": "Camera",
               "job": "Camera Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8da1",
               "name": "Taj Mahal",
               "profile_path": "/tEqFRK0vJFZsTgwMSLdUqnKKrRB.jpg",
               "id": 94511,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4aa29251416c750e8da7",
               "name": "Johnny Lee Schell",
               "profile_path": null,
               "id": 72441,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.746775,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 140897,
      "vote_count": 3,
      "budget": 0,
      "overview": "A drama revolving around a group of strangers brought together by a common occurrence as well as listening to the same radio station.",
      "similar": [
         12521,
         274,
         2832,
         10285,
         948,
         12149,
         1359,
         11615,
         1949,
         273481,
         10781,
         984,
         1696,
         1991,
         4232,
         4638,
         238636,
         181283,
         10585,
         845
      ],
      "original_title": "Outside Ozona",
      "runtime": 100,
      "poster_path": "/rY9x2IuUyiup1o1sQXrIkEu76l0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nu Image Films",
            "id": 925,
            "origin_country": ""
         },
         {
            "logo_path": "/nLVD1WEr9ej0if7mIsonSOnUdaQ.png",
            "name": "Columbia TriStar Home Entertainment",
            "id": 10202,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Millennium Films",
            "id": 10254,
            "origin_country": ""
         }
      ],
      "release_date": "1998-12-18",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Somewhere down the road is the end of the line.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["J.S. Cardone"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["J.S. Cardone"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0144546/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMjAzOTM1NF5BMl5BanBnXkFtZTcwMjA1MzcxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Robert Forster, Kevin Pollak, Sherilyn Fenn | See full cast and crew »"],
      "reviews": [
         "'Outside Ozona', an off-beat dark comedy/thriller directed by J.S. Cardone, is a little gem, brightened by a cast of established Hollywood actors. The story involves a serial killer, pursued by agent Lucy Webb (in a role reminiscent of Frances McDormand, in 'Fargo'), but it is really a character study of a group of people whose lives will be changed forever by the killer, during one eventful night. Standouts in the large cast include Taj Mahal, as a burned-out deejay at a country music station, who switches the playlist to rhythm and blues, and ruminates about life; Robert Forster, portraying a good-hearted trucker dealing with loneliness following the death of his wife; Kevin Pollack and Penelope Ann Miller (who is EXCELLENT!), as an unemployed circus clown and his dancer/hooker girlfriend; and Sherilyn Fenn (cast WAY against type!), as a shrewish, materialistic woman travelling with her sister to visit their father. As each character's story unfolds, you are drawn into a rich, involving tale of humor, melancholy, and a touch of the macabre! The film is very well-paced, and will hold your attention, throughout, and the explosive climax is both exciting and emotionally satisfying! Take a drive down the highway 'Outside Ozona'...you'll enjoy the trip!",
         "This is one of the best films I've seen which I've never been able to turn other people on to. It doesn't seem to exist as a video or DVD rental. I think that's a travesty. It is definitely a sleeper but, unlike the other commenter, I don't see it as being anything like Pulp Fiction.. In fact, one of the reasons I like this film so much is that it deals with extraordinary things which happen to, and because of, ordinary people bumping up against circumstance and a serial killer. Somehow serendipity threads through everything in a way which I really liked. I'm a big Robert Forester fan and especially love the films he has made in the past 15 years or so. He plays the kind of person I like to meet in real life and that's pretty rare. One other thing I love about this film is the cinematography, especially fun being the first 15 or twenty minutes of the film. No spoilers! Just watch it if you get a chance. I keep hoping it'll come back on cable so I can see it another time.",
         "It is a truly offbeat dream-poem of a movie about the loneliness of the open prairie roads on the graveyard shift. The plot winds together several seemingly unrelated storylines united by the fact that all the characters listen to the same two-bit radio station, and seem headed for a common fate. The tension occurs because a serial killer is roaming the highways among the usual losers, misfits, daffodils and lonely hearts. It's not quite a great movie because it tried to dominate the entire experience with murky tone and forlorn bluesy dialogue, and that is a difficult meal to concoct without grinding it all to cornball mush. The movie is the cinematic equivalent of a sad saxophone wail, and while it had some great moments, that type of mood is sometimes best left to the sax, because expressing it in dialogue can ring false and corny (the Sherilyn Fenn character was an unrealisticly shallow and cardboard cliche, for example). On the other hand, if you have a taste for the offbeat, you may really enjoy this collection of anecdotes and vignettes. Because of a \"this is my song, and I'm going to sing it my way\" attitude, it's more interesting than a lot of big budget studio pictures. A very eclectic cast",
         "Outside Ozona is a creepy, quirky offbeat web of interesting characters woven into a tapestry of American life on the fringes, in the hinterlands. Numerous standout character performances spice up a slow building story- including Kevin Pollak as an acerbic, grouchy clown, Penelope Ann Miller as his stripper girlfriend . For the music fan we have the great Taj Mahal as a late night radio DJ as well as Meat Loaf as his boss- they could be their own \"cant stand each other\" buddy flick. The heart of the movie is in the performances of Kateri Walker and Robert Forster- he\"s a trucker and she's a school teacher out of gas in unfriendly territory. My reason for writing this review is to alert fans of Robert Forsters work to this great performance- he is everything he is in Jackie Brown in this one --ENJOY",
         "The Skokie Ripper has picked up killing women and stealing their cars along the Midwest and the film centers on various characters that he will affect in one way or another as their lives intersect in this interesting(I thought)character study.The thoughtful, existential screenplay was written by director Cardone and deals with topics such as regret, loneliness, fate, and death.Outside Ozona might make an interesting companion piece with Cardone's desert Midwestern vampire tale, The Forsaken.The film is filled with colorful, often profane dialogue. Could be Cardone's most ambitious script as a writer and he rarely has had such a competent cast to work with which included Robert Forster(as a gentle truck driver), Kevin Pollack(as an out-of-work circus clown), Penelope Ann Miller(..cast against type as Pollack's dim-bulb stripper-girlfriend), Taj Mahal(as a disgruntled and troubled radio jock whose voice is an important part of the film), Meat Loaf(as Mahal's radio manager who can not stop his employee from letting off steam on the air in a revolt against having to cover two shifts because another didn't come into work), Sherilyn Fenn(in a minor role as a possible victim of an unlikely serial killer), Swoosie Kurtz(as a diner waitress)& David Paymer(as a bible-quoting, fanatical sociopath murdering females on the road in his twisted, warped view of working for the Lord). Kateri Walker is a beautiful Navajo woman Forster befriends as she plans to take her dying mother, Effie(Lois Red Elk)to New Mexico before her death. The film basically follows the characters as they converse about their lives and what possibilities have passed them by.",
         "I liked this movie because of it's excellent character development. All except the serial killer were interesting people. However, the main protagonist was the least developed character, and that weakened the whole film. The converging story lines maintained interest for the most part, other than a couple overlong stories that were nothing more than padding. The last scene in the radio station was totally unnecessary. Acting was above average, and the desert locations felt right. When the characters eventually meet their destiny, it is handled far better than many mainstream movies. A little script tightening, and more development of the killer would have improved what is already an above average film. - MERK",
         "You just can't judge a book by its cover, ya'know? That nice, harmless looking geek stranded on the side of the road with a broken-down car could very well be a raving, ax murderer. This is a nicely done film dealing with several different people that are on a collision course outside of the little western town of Ozona. One is a homicidal lunatic and the rest are relatively innocent folks who may or may not have the misfortune of running into him. Meatloaf gives a nice performance as the manager of a radio station that realizes the nut calling in on the phone is the killer. Robert Forster is excellent as a sweet, but lonely truck driver. Casting David Paymer as the murderer was a stroke of genius, reminding one that people are not always as they seem. Making someone so harmless looking into a cold-blooded killer is exactly what makes him so frightening. Nice work all-around. A very good choice for a stay-at-home-night date.",
         "There's a killer on the road. But the movie would have been much better ,if this character had been ruled out.Because the killer who kills in the name of Jesus has become a cliché.Ditto for the \"radio vérité\". What remains is good indeed:best performance is given by Robert Forster who portrays a trucker with a golden heart;more than his sympathy for the young Indian ,it's his scene with the dog that will move you:as simple as it can be ,it goes straight to the heart.The clown and his wife are also endearing characters ,with their clumsiness.The writers have succeeded in giving their men and women some substance,which is quite a feat for a relatively short movie .And there are a lot of \"stories\" in the story ,like the tale of the elephant.The Indian girl,her grandma,the trucker,the two sisters and the circus people tell us a lot about us,and it becomes a good \"road movie by night\".But the thriller side,the killer,it was not so necessary ,and the last scene is too long and comes as an anticlimax. Better than its current low rating anyway",
         "This film is far from the best I've ever seen but its definitely the best B-movie I've ever seen. The structure is Tarantino like with some of the familiar gore. However, this film does not attempt to be funny. This is a gritty, down to earth film following the stories of several likable characters through conversations eventually leading to a huge climax bringing them all together. This is the type of film you should watch late at night on the couch for the simple reason that you don't expect too much so you get a lot more than you hoped for in a B movie. And now for some very weird reason i have to make up ten lines of text. That should do it.",
         "This is a nice, witty, emotional, film! It is a drama/comedy/action intertwining 4 stories into one, all wrapped around a radio program. This film is a nice surprise as it has nice characters who you want to see get ahead, and nice use of scenery. It is a film that will never bore you, but it will never draw you in, either. It is not as good as pulp fiction, but if you expected it to be, you must be silly. Watch it with an open mind and you will be pleasantly surprised! It is a treasure!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "Millennium Films",
         "Nu Image Films",
         "Sandstorm Films"
      ],
      "summaries": [
         "A serial killer is on the prowl in the badlands of Ozona, Oklahoma, and the travelers who intersect at a roadside cafeteria somewhere between Texas and New Mexico are destined to cross his path. They include a circus clown and his stripper girlfriend, grieving sisters, a trucker, and a woman who is taking her mother to see the ocean before she dies. Tying everything together even tighter is the presence of the local radio station, whose DJ and boss don't seem to be getting along too well.",
         "A serial killer is stalking the roads between New Mexico and Texas and the passengers that we meet are destined to become his victims. We meet our parties at a cafeteria where a trucker stops for coffee. In the restaurant are a woman who has run out of gas and is trying to get her grandmother to the coast one last time before she dies, a fired and broke circus clown trying to get to Vegas with his stripper girl friend, and sisters who are going to their father's funeral. The killer is easy to spot. While all of the mayhem is ongoing, all motorists are tuned into a local DJ who is feuding with his station manager.",
         "A drama revolving around a group of strangers brought together by a common occurrence as well as listening to the same radio station."
      ],
      "budget": 0
   },
   "movielensId": 2438,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-18",
      "dvdReleaseDate": null,
      "directors": ["J.S. Cardone"],
      "runtime": 100,
      "movieId": 2438,
      "title": "Outside Ozona",
      "mpaa": "R",
      "actors": [
         "Robert Forster",
         "Kevin Pollak",
         "Sherilyn Fenn",
         "David Paymer",
         "Penelope Ann Miller",
         "Swoosie Kurtz",
         "Taj Mahal",
         "Meat Loaf",
         "Lucy Webb",
         "Lois Red Elk",
         "Kateri Walker",
         "Beth Ann Styne",
         "Kirk Baily",
         "Michael Holmes",
         "Bert Emmett",
         "Benjamin Lum",
         "Heidi Jo Markel",
         "Dylan Tarason",
         "Butch McCain",
         "Patti Duce"
      ],
      "imdbMovieId": "0144546",
      "originalTitle": "Outside Ozona",
      "genres": [
         "Thriller",
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["O72PzUCBlMo"],
      "plotSummary": "A drama revolving around a group of strangers brought together by a common occurrence as well as listening to the same radio station.",
      "tmdbMovieId": 140897,
      "avgRating": 2.91667,
      "releaseYear": "1998",
      "numRatings": 18,
      "posterPath": "/rY9x2IuUyiup1o1sQXrIkEu76l0.jpg"
   }
}