{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "robbery",
            "id": 642
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "addict",
            "id": 164296
         }
      ],
      "imdb_id": "tt0127722",
      "video": false,
      "title": "Another Day in Paradise",
      "recommendations": [
         465,
         55584,
         31875,
         196625,
         147553,
         148547,
         131933,
         36832,
         205763,
         69851,
         67307,
         40506,
         25636,
         23312,
         41166,
         47692,
         42746,
         73134,
         58777,
         63437
      ],
      "backdrop_path": "/pteiLtpPy0mxURQ7FhRQpqkEGi3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sid",
               "gender": 1,
               "credit_id": "52fe45ce9251416c9103f1c5",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Mel",
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f1d5",
               "name": "James Woods",
               "profile_path": "/fl5Jx1WFvBcg1b9VZRfXTH6LPUE.jpg",
               "id": 4512,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bobbie",
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f1c9",
               "name": "Vincent Kartheiser",
               "profile_path": "/y2i2epgCOwfMyC5FclcF3IU8Iy3.jpg",
               "id": 52646,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Rosie",
               "gender": 1,
               "credit_id": "52fe45ce9251416c9103f1cd",
               "name": "Natasha Gregson Wagner",
               "profile_path": "/g4k8hwH33fbFbCJGzaV57YujCvV.jpg",
               "id": 3270,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Reverend",
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f1d1",
               "name": "James Otis",
               "profile_path": "/hrKWkZ9CdZxrlwvsRRVD0M1VR4g.jpg",
               "id": 58473,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Ty",
               "gender": 2,
               "credit_id": "57e1faea92514119530007a9",
               "name": "Peter Sarsgaard",
               "profile_path": "/dGoUlDEJumPY0CFlT7eM6KVdLUu.jpg",
               "id": 133,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Clem",
               "gender": 2,
               "credit_id": "57e1fb16c3a36808c300656e",
               "name": "Brent Briscoe",
               "profile_path": "/7ws22WEvxt6cvMDyijZOdf9AuiS.jpg",
               "id": 15011,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Richard Johnson",
               "gender": 2,
               "credit_id": "57e1fb27c3a36808c3006579",
               "name": "Paul Hipp",
               "profile_path": "/zQehaRjnln1PWKsU2f8n9pDbQrd.jpg",
               "id": 54041,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Bonnie Johnson",
               "gender": 1,
               "credit_id": "57e1fb34c3a3681a5000021c",
               "name": "Kim Flowers",
               "profile_path": "/tpKjKYNSFQ2AzDsEdAgN7Ejj3YY.jpg",
               "id": 170146,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Phil",
               "gender": 2,
               "credit_id": "57e1fb3d92514124630002c5",
               "name": "John Gatins",
               "profile_path": "/A2MqnSKVzOuBf8MVfNyve2h2LxJ.jpg",
               "id": 53176,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Barry",
               "gender": 0,
               "credit_id": "57e1fb45c3a3681a50000224",
               "name": "Ryan Donahue",
               "profile_path": null,
               "id": 1682742,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Conan",
               "gender": 2,
               "credit_id": "57e1fb5ec3a36808b9006d22",
               "name": "Christopher Doyle",
               "profile_path": "/8Im0vN3mF2aQJHROJBZpKX6RPps.jpg",
               "id": 1418031,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Guard at Reverend's Gate",
               "gender": 2,
               "credit_id": "590efb92c3a368651901bb6d",
               "name": "Leo Fitzpatrick",
               "profile_path": "/cy5AHjW6fRCtdqNfOPpmiXPhA46.jpg",
               "id": 57387,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Danny",
               "gender": 2,
               "credit_id": "597db5ba9251415daa0146b6",
               "name": "Branden Williams",
               "profile_path": "/8XDHpDtwfmE20UMAgcRUBCu0KJS.jpg",
               "id": 150109,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45ce9251416c9103f1c1",
               "name": "Larry Clark",
               "profile_path": "/7JfnrUqvXafhqACvMewBVA3Klb.jpg",
               "id": 51917,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54809288c3a36817a5002d39",
               "name": "Stephen Chin",
               "profile_path": null,
               "id": 1394533,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56768037c3a3681683005330",
               "name": "Christopher B. Landon",
               "profile_path": "/421KrcuMkPQnKbIvdp2yyFE4D0I.jpg",
               "id": 54248,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.334419,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 36136,
      "vote_count": 51,
      "budget": 0,
      "overview": "A vending machine robbery by small time thief and drug addict Bobbie (Vincent Kartheiser) goes badly awry, and his friends contact street-wise thief and part-time druggie Mel (James Woods) to patch him up.Recognizing a kindred spirit, Mel befriends Bobbie and his girlfriend Rosie (Natasha Gregson Wagner), inviting them to join him and his long-suffering girlfriend Sid (Melanie Griffith) on a drug robbery which should set them up for life. The seemingly simple robbery is a great success, but the sale of the drugs afterward fails badly, and Mel and Bobbie are shot.The four take refuge with the Reverend, who charges them half of their haul from the robbery to care for them. In a desperate attempt to recover their losses, Mel involves the crew in a disastrous, ill-advised jewellery robbery, and they become caught up in a web of violence that rapidly spirals out of control.",
      "similar": [
         4771,
         357096,
         15069,
         979,
         1572,
         281957,
         281,
         948,
         395990,
         445954,
         23587,
         984,
         8292,
         3134,
         45569,
         10651,
         11423,
         207270,
         12143,
         2749
      ],
      "original_title": "Another Day in Paradise",
      "runtime": 101,
      "poster_path": "/hDv9bepgQGSWoyhRUgegSzPL7tL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Chinese Bookie Pictures",
         "id": 40336,
         "origin_country": ""
      }],
      "release_date": "1998-12-30",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "We live at the abyss.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Larry Clark"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Eddie Little",
         "Christopher Landon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0127722/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMjA1MTU5OF5BMl5BanBnXkFtZTcwMTA0MTQyMQ@@._V1_SY287_CR1,0,214,287_AL_.jpg",
      "actors": ["Stars: James Woods, Melanie Griffith, Vincent Kartheiser | See full cast and crew »"],
      "reviews": [
         "This is one of the most disturbing, pessimistic, and overall depressing films I've ever seen -- naturally I loved it. It affected me powerfully. The camera work/artistic shot set-ups, along with the dark color quality set the tone for the whole movie. Not at all like the unappetizing \"Kids,\" director Larry Clark's first feature, this movie is constantly shocking, but not just for the sake of shock value. It's unashamedly graphic in a way that most contemporary films avoid, making it cuttingly real. It also stands apart from most big heist movies, because it is character- rather than plot-driven. James Woods is fantastic as always, and even Melanie Griffith (not one of my faves) is very well cast. The young Vincent Kartheiser, however, as a teen runaway turned junkie/petty criminal, steals the show. The camera loves him, and his adolescent volatility is painfully believable. I wasn't as much of a fan of Natasha Gregson Wagner, as Kartheiser's girlfriend, but even she surprised me with her dramatic final sequence. WARNING: this movie is not for the faint of heart. I am personally a fan of anything that breaks new ground, or that defies convention. This film does both. But it is extremely graphic.",
         "While vastly superior to Larry Clark's other films, \"Another Day in Paradise\" shares with them a brazen directness which makes it uneasy viewing, particular the many scenes picturing graphic violence. However it's a powerful and moving film with some exceptional acting talent on display. Clark's obsession with teenagers of the wilder variety is prevalent as always but is balanced by the older surrogate parent couple played by James Woods and Melanie Griffith. Woods once again brings his famed intensity in a well rounded portrayal in which he's not only called upon to play a hardened, ruthless criminal, but also to reveal the more human qualities albeit buried very deep within. Melanie Griffith is surprisingly effective as Wood's partner in crime. Clark's interest in them as people first and then as criminals, places this movie in a category well above the usual criminals on the run fare. The younger criminal counterparts are played excellently by Natasha Gregson Wagner and Vincent Kartheiser. There is an almost documentary sense of authenticity to their acting. Oddly enough neither seemed to have as yet progressed to roles of much importance. Kartheiser in particular is an actor to watch out for. (He was superb in the somewhat flawed \"The Unsaid\"). The complexity of the relationship between the older childless couple and the teenage couple, while not overtly examined, is explored with subtlety which allows the viewer to make his own evaluation. With large doses of drugs and violence this is clearly not a movie for all tastes. It is however a work of distinction.",
         "Another film of the drug/gangster sub-genre, ANOTHER DAY IN PARADISE is upper echelon material as far as these pictures go. It is also a sibling to DRUGSTORE COWBOY unintentionally. There are so many similarities because it is impossible to make this type of movie nowadays without being repetitive. No matter. Director Larry Clarke (KIDS, ew!) and main booster James Woods himself dive into that disgusting and sometimes frantically hilarious world of sex, drugs, and driving around. The film works because there are some good characterizations here and people who actually show some concern for each other throughout the haze of it all. Melanie Griffith plays \"Sid\", James Woods' girlfriend in the story and delivers some of the finest moments of her career. Not since WORKING GIRL have I seen such a likeable and ballsy portrayal from Griffith, who is a junkie with a knack for mothering the 2 teen runaways and a potent trigger finger when one is needed. The runaways are the children Woods and Griffith parent vicariously through in the most unusual of ways. The kids (Vincent Kartheiser, Natasha Wagner) are a version of Bonnie and Clyde, while the adults resemble a warped Ozzie and Harriett. It all adds up to a group of 4 remembering DRUGSTORE COWBOY. This crew needs drugs and they get them by stealing from pharmacists just as Matt Dillon's crew did. The setting is the early 1970's I guess, and the music reflects the period well. Funk and blues reign over the film's violent and illegal activities while adding a sense of romance to it. You get that feeling in your heart that it won't last (a la BONNIE AND CLYDE, DRUGSTORE COWBOY). Woods character starts out cynical and wise to the \"life\", but turns ugly as you figure him to do. The young kids who looked up to him throughout grow tired naturally, but his reluctance to grow old possesses him to keep them around. This is where Melanie Griffith is able to shine. She is a sweet, attractive woman who happens to stick needles in her neck. Nobody's perfect. James Woods was born to play the creep. He has some great lines in ANOTHER DAY IN PARADISE. His stories are funny, his trademarks are constant (booyah!), and his fits are worth the price of admission. He is so good at coming across initially confident, eventually desperate and evil. Woods must have had much faith in director Clarke's abilities and the casting of Natalie Wood's daughter, Natasha is a nice, offbeat touch. This is low-budget, nasty fare, a descendant of the countless druggie flicks of the 70's, 80's and PULP FICTION. It is sometimes amazing to see how low actors will go to capture this wild world of fun and drugs in the dark. RATING: ***",
         "I started watching this film rather late at night thinking I would unwind for a few minutes and then retire for the day. As I sat watching this film it's intensity began to build and draw me in. The story itself is nothing new. It was the performers that kept me involved. It was no surprise to me that James Woods would be his excellent self. The pleasant surprise was Melanie Griffith. She displayed some range I had'nt witnessed from her before. As the young street couple Vincent Kartheiser and Natasha Gregson Wagner show great promise as young actors.Kartheiser in particular. Execution is raw and at times it's hard to witness whats going on. Recommended. Give it a shot.",
         "Larry Clark's (KIDS) second film, ANOTHER DAY IN PARADISE features an explosive performance by James Woods as a \"professional\" thief/junkie, who along with his girlfriend (a well cast Melanie Griffith) adopt two young lovers (Vincent Kartheiser and Natasha Gregson Wagner) and hit the road in search of drugs and money. Mel (Woods) and Sid (Griffith), who see Rosie (Wagner) and Bobbie (Kartheiser) as younger versions of themselves, teach them the ropes of criminal life. It is a familiar story, and there is no doubt the characters' vision of paradise shown in the beginning of the film, with its endless supply of drugs and feeling of family, is quickly going to deteriorate into violence and death. I am reminded of the superior DRUGSTORE COWBOY, which also follows a \"family\" of junkies who rob to pay for their habits, but fine performances by the four leads, especially Woods, make PARADISE worth a look. Clark's cinema vérité style of direction (a la KIDS) supplies the feeling of uneasiness throughout the film and heightens the impact of the jarring violence. The soundtrack of great soul tunes effectively mirrors the contradictory feelings of despair and hope that plague the characters. The film is not without flaws but recommended to fans of the road/lovers on the lam movies like BADLANDS, TRUE ROMANCE etc.",
         "This one worked for me. The superb acting and fine camera work made this very believable. The scenes are some of the most realistic I've seen. Particularly noteworthy are the scenes involving extreme tension. Throughout the picture I felt an urging to like these characters, sensing that they were, deep down, decent people who somehow got wrapped up in this type of life. I'm not generally a fan of Griffith, but this role suits her well and her acting is top-notch. Woods is almost always exceptional, and his work here is no exception. The younger stars also perform quite well with this challenging, emotional material. And I thought the acting of the minor characters was excellent, suggesting the director had his act together on this one. You have to acclimate to the language and level of tension early on or the movie will drive you nuts. But if you do, it begins to involve you deeply in the characters' situations and lives.",
         "'Kids' director Larry Clark really comes up trumps with this fine story of crime, addiction and surrogate families. Relative unknown Vincent Kartheiser, and the up and coming Natasha Gregson Wagner ('Lost Highway', 'Two Girls and a Guy') are fine as the young wanna be thieves, but the real stars of the show are their mentors' played by James Woods and Melanie Griffith. Griffith is often ridiculed for her flakiness, but should be applauded for taking riskier, more challenging material such as this and John Waters' 'Cecil B. DeMented'. Woods is a ridiculously underrated actor, and along with the equally underestimated James Caan, is rivaling the much more celebrated De Niro and Pacino as best American actors of their generation in my opinion. Woods is simply sensational as the motor mouth Mel, a complex and unpredictable character. His performance here ranks with 'Videodrome', 'Cop' and 'The Boost' as one of his most memorable. Forget the spurious 'Kalifornia', 'Drugstore Cowboy' and 'True Romance' comparisons. They are all great movies, but this is no rehash or rip off. It's a fantastic movie in its own right. Don't miss this one!",
         "1st watched 12/26/2009 \u0096 8 out of 10(Dir-Larry Clark): Extremely well executed drama about a couple of older drug-using thieves who take a younger couple under their wings as they survive in this rough un-forgiving chaotic world. The movie begins as the younger couple is introduced and the male character(played by Vincent Kartheiser) robs a community college's snack room of it's vending machine change and gets ferociously beat up by a security guard but then kills him. Uncle Mel(played by James Woods) then invites the kids to tag along with him and his girl and they graduate to bigger thefts with bigger consequences. The older couple(who can't have kids) kind of take on a tutoring and parenting role to the younger couple and they start developing a good friendship as well. It's obvious there are needs being fulfilled both ways in a companionship perspective as they both have many losses in their personal lives. Mistakes start being made after it's determined the younger girl is pregnant and the younger couple start evaluating whether this life is for them. This causes friction in the characters in this no-holds barred insane lifestyle movie where the characters just want to make good for themselves and this vulnerability brings the audience to like the characters. Melanie Griffith is un-expectedly excellent as the older woman and the overall acting and direction is very well done. You believe this story and that keeps you interested and involved until the end. The movie itself is not for the faint-at-heart but it is a definite un-heralded gem in the independent film-making world and should be viewed.",
         "I read in a screenwriting book that the first thing a screenwriter should remind him/herself is don't think up an idea and then say to yourself, \"It's been done before.\" Because no matter how many times that idea was used before, there's always a different approach you can take towards it. This movie clarifies that statement. It takes your standard premise of drug-addicted hustlers on the lam and transforms it brilliantly into this moving, thought-provoking piece of work. Larry Clark made his debut with the thoroughly disappointing--at least to me--urban drama \"Kids.\" That was a film with no intention, characters you couldn't give a damn about and was just all over the map. Clark definitely showed he has an eye for gritty realism, but put it to bad use with that horrendous and profane motion picture. Now, \"Another Day in Paradise\" had its share of four-letter words, in fact I think it had more, but that didn't matter to me. Because the characters, no matter how much drugs they use and no matter how dishonest their lives are, were people you can care for and feel their every emotion and just know that they're really good human beings who happen to be geared in the wrong direction, from their upbringing and society they grew up in. The performances were groundbreaking. This is one of James Woods' best performances. This is the kind of role he was born to play. I can't imagine a single actor doing a better job. The supporting cast was great, too. This is the kind of film that catches your eye from start to finish. It starts out with a great shot, with Vincent Kartheiser waking up and lighting up a cigarette while 70's soul music fills the soundtrack. Speaking of great music, Clarence Carter performs his great hit \"I'm Looking For a Fox\" in one scene. The soundtrack is absolutely wonderful, with the kind of songs I love singing along to. I highly recommend this movie. However, it is a pretty disturbing film, so be careful what mood you're in when you decide to rent it.",
         "Almost everybody who wrote a review for this movie seem to say that the movie sucked, I disagree. Larry Clark has a real knack for showing society unflinching, raw and vital. The acting is superior and doesn't pull any punches. James Woods deserves some sort of award, he hasn't been better in any other movie. The music is perfect, the cinematography is lush, poetic. See the movie, you won't be disappointed, unless you're one of those wussies with a weak stomach. Look fast for Leo Fitzpatrick (Telly from KIDS) as the guard at the Reverend's house."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Chinese Bookie Pictures"],
      "summaries": [
         "Bobbie is an addict and small-time thief. When one of his jobs goes bad, Mel is called in to patch him up. Mel offers him a chance at a bigger score. Over time, Mel and his girlfriend Sid become almost like parents to Bobbie and his girlfriend Rosie, but this can't last.",
         "A vending machine robbery by small time thief and drug addict Bobbie goes badly awry and his friends contact street-wise thief and sometime drug user Mel to patch him up. Recognizing a kindred spirit Mel befriends Bobbie and his girlfriend Rosie and invites them to join him and his long-suffering girlfriend Sid on a drugs robbery which should set them up for life. The seemingly simple robbery is a great success but the sale of the drugs afterwords fails badly and Mel and Bobbie are shot. The four take refuge with the Reverend who charges them half of their haul from the drugs robbery to care for them. In a desperate attempt to recover their losses Mel involves the crew in an ill-advised jewelry robbery with Jewels which goes disastrously wrong and the crew become caught up in web of violence that rapidly spirals out of control.",
         "In the hope of a big score, two junkie couples team up to commit various drug robberies which go disastrously wrong leading to dissent, violence and murder."
      ],
      "budget": 4500000
   },
   "movielensId": 2440,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-30",
      "dvdReleaseDate": "1999-05-11",
      "directors": ["Larry Clark"],
      "runtime": 101,
      "movieId": 2440,
      "title": "Another Day in Paradise",
      "mpaa": "R",
      "actors": [
         "Melanie Griffith",
         "James Woods",
         "Vincent Kartheiser",
         "Natasha Gregson Wagner",
         "James Otis",
         "Peter Sarsgaard",
         "Brent Briscoe",
         "Paul Hipp",
         "Kim Flowers",
         "John Gatins",
         "Ryan Donahue",
         "Christopher Doyle",
         "Leo Fitzpatrick",
         "Branden Williams"
      ],
      "imdbMovieId": "0127722",
      "originalTitle": "Another Day in Paradise",
      "genres": [
         "Thriller",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["nitrKsiEzKQ"],
      "plotSummary": "A vending machine robbery by small time thief and drug addict Bobbie (Vincent Kartheiser) goes badly awry, and his friends contact street-wise thief and part-time druggie Mel (James Woods) to patch him up.Recognizing a kindred spirit, Mel befriends Bobbie and his girlfriend Rosie (Natasha Gregson Wagner), inviting them to join him and his long-suffering girlfriend Sid (Melanie Griffith) on a drug robbery which should set them up for life. The seemingly simple robbery is a great success, but the sale of the drugs afterward fails badly, and Mel and Bobbie are shot.The four take refuge with the Reverend, who charges them half of their haul from the robbery to care for them. In a desperate attempt to recover their losses, Mel involves the crew in a disastrous, ill-advised jewellery robbery, and they become caught up in a web of violence that rapidly spirals out of control.",
      "tmdbMovieId": 36136,
      "avgRating": 3.20361,
      "releaseYear": "1998",
      "numRatings": 388,
      "posterPath": "/hDv9bepgQGSWoyhRUgegSzPL7tL.jpg"
   }
}