{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "cellist",
            "id": 3457
         },
         {
            "name": "career",
            "id": 3658
         },
         {
            "name": "musician",
            "id": 4048
         },
         {
            "name": "concert",
            "id": 6029
         },
         {
            "name": "controversial",
            "id": 9859
         },
         {
            "name": "flautist",
            "id": 209077
         }
      ],
      "imdb_id": "tt0150915",
      "video": false,
      "title": "Hilary and Jackie",
      "recommendations": [
         177851,
         81220,
         123056,
         41166,
         77881,
         50035,
         53113,
         84278,
         82520,
         27609,
         21060,
         5332,
         39940,
         9523,
         24066,
         18273,
         54934,
         172390,
         181756,
         60158
      ],
      "backdrop_path": "/eIU3AlkoToP3XCTc136Oa4tFeCA.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jackie Du Pré",
               "gender": 0,
               "credit_id": "52fe4719c3a36847f812374f",
               "name": "Emily Watson",
               "profile_path": "/jyIC8axLoCrbQoKGGjGFRU7hfNI.jpg",
               "id": 1639,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hilary Du Pré",
               "gender": 1,
               "credit_id": "52fe4719c3a36847f8123753",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Daniel Barenboim",
               "gender": 2,
               "credit_id": "52fe4719c3a36847f8123757",
               "name": "James Frain",
               "profile_path": "/tQLuwlPodwk8CWd3ly067s1x1dh.jpg",
               "id": 22063,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Kiffer Finzi",
               "gender": 2,
               "credit_id": "52fe4719c3a36847f812375b",
               "name": "David Morrissey",
               "profile_path": "/y8L9zlrIzsAwu2Hufol6KqoDS4I.jpg",
               "id": 18616,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Derek Du Pré",
               "gender": 2,
               "credit_id": "52fe4719c3a36847f812375f",
               "name": "Charles Dance",
               "profile_path": "/bLT03rnI29YmbYWjA1JJCl4xVXw.jpg",
               "id": 4391,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Iris Du Pré",
               "gender": 1,
               "credit_id": "52fe4719c3a36847f8123763",
               "name": "Celia Imrie",
               "profile_path": "/tAEzs5PFVX5GsfD3KTWINnuTzMJ.jpg",
               "id": 9139,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Piers Du Pré",
               "gender": 2,
               "credit_id": "52fe4719c3a36847f8123767",
               "name": "Rupert Penry-Jones",
               "profile_path": "/8WoMM6UnqbZuSV46uCDBqJK3Hd7.jpg",
               "id": 42276,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Cello Teacher",
               "gender": 2,
               "credit_id": "52fe4719c3a36847f812376b",
               "name": "Bill Paterson",
               "profile_path": "/lLIPguoZJZeZ04niI4PaG1cv3Xf.jpg",
               "id": 104795,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Young Jackie",
               "gender": 0,
               "credit_id": "5481ce739251416e810061f8",
               "name": "Auriol Evans",
               "profile_path": null,
               "id": 1394980,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Young Hilary",
               "gender": 0,
               "credit_id": "5481ce819251416e7b005c7f",
               "name": "Keylee Jade Flanders",
               "profile_path": null,
               "id": 1394981,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4719c3a36847f812374b",
               "name": "Anand Tucker",
               "profile_path": "/sdtzoy0UEFOsu9ZWFT5N5matqn7.jpg",
               "id": 26481,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4719c3a36847f8123771",
               "name": "Sandy Powell",
               "profile_path": "/6J0JwsWmFv3vKEguRTV71aK5J.jpg",
               "id": 9027,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "5481ce609251414d2100627d",
               "name": "Frank Cottrell Boyce",
               "profile_path": null,
               "id": 26190,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "59486dacc3a368170f04af8b",
               "name": "Hilary du Pré",
               "profile_path": null,
               "id": 1836132,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "59486db49251413fb6048390",
               "name": "Piers du Pré",
               "profile_path": null,
               "id": 1836133,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "59486dbd9251413fb104b95f",
               "name": "Barrington Pheloung",
               "profile_path": null,
               "id": 27265,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "59486dd49251413fb104b971",
               "name": "David Johnson",
               "profile_path": null,
               "id": 5432,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59486deac3a36816f604a866",
               "name": "Martin Walsh",
               "profile_path": "/eFdV5n5GV01fwNRzrJn299aFUsq.jpg",
               "id": 9154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "59486df2c3a368171b04425b",
               "name": "Vanessa Pereira",
               "profile_path": null,
               "id": 29419,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "59486df99251413fb60483c0",
               "name": "Simone Pereira Hind",
               "profile_path": null,
               "id": 1464117,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "59486e019251417e4c02839e",
               "name": "Alice Normington",
               "profile_path": null,
               "id": 50952,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "59486e079251413fc2046415",
               "name": "Charmian Adams",
               "profile_path": null,
               "id": 22156,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "59486e0d925141400d048dce",
               "name": "Trisha Edwards",
               "profile_path": null,
               "id": 13008,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.930409,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 46992,
      "vote_count": 30,
      "budget": 0,
      "overview": "The tragic story of world-renowned cellist Jacqueline du Pré, as told from the point of view of her sister, flautist Hilary du Pré-Finzi.",
      "similar": [
         20575,
         17356,
         786,
         525,
         7972,
         27962,
         6477,
         22097,
         354912,
         333667,
         1791,
         3902,
         369557,
         6575,
         135,
         121826,
         11899,
         32823,
         2433,
         8873
      ],
      "original_title": "Hilary and Jackie",
      "runtime": 121,
      "poster_path": "/2a3ZmHS7IrOGG46hrbSS3qJJk6d.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Screen Productions",
            "id": 12745,
            "origin_country": "GB"
         }
      ],
      "release_date": "1998-12-30",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Two sisters. Two lives. One Love...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Anand Tucker"],
      "runtime": 121,
      "synopsis": null,
      "writers": [
         "Hilary du Pré",
         "Piers du Pré"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0150915/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMTQxNzIzOF5BMl5BanBnXkFtZTcwNzgzMzMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Emily Watson, Rachel Griffiths, James Frain | See full cast and crew »"],
      "reviews": [
         "Films as intelligent and well crafted as this are hard to come by. `Hilary and Jackie' is an exceptionally well done character study of two real life sisters. Jackie (Emily Watson) is a world-class cellist and Hilary (Rachel Griffiths) lives a normal middle class life. The story is rich in character development depicting the sisters starting from their childhood when both were musical prodigies. Now that they are adults, they envy each other's life. The story follows Jackie's career and explores the sisters' relationship, including the deep resentment and enduring love they have for one another. Director Anand Tucker does a wonderful job of presenting the story. He induces great feeling from each scene and lays the raw emotions on the screen without embellishment whether pure or turbulent. Emily Watson was superb in the lead role. Her's was an extremely complex character and her command of the range of emotions Jackie required was phenomenal. Lovers of classical music will appreciate the rich soundtrack and Watson's realistic cello renditions. Watson was nominated for best actress by the Academy in 1999 for this performance and I felt she was most deserving of the prize that ultimately went to Gwyneth Paltrow for `Shakespeare in Love'. Paltrow's performance was clever and charming, but had nowhere near the power Watson delivered in this film. Emily is such a talented actress, however, that I have little doubt eventually there will be some other envelope with her name inside. Rachel Griffiths also gave a career performance as Hilary and she was nominated for best supporting actress, an award I felt she won hands down. Griffiths' tortured performance was gut wrenching and inspired. She played Hilary with deep sensitivity and handled her emotional conflicts brilliantly. The Academy's choice of Judy Dench was again perplexing as the Shakespeare juggernaut rolled on. For those viewers who appreciate a powerful and disturbing drama, great acting, complex characters, terrific classical music and extraordinary character development, this film is a must. I rated it a 9/10. Don't miss it.",
         "I've read the 54 reviews here, and agree with most, both positive and negative, but I have a different perspective. Of all instruments, cello speaks to me most deeply. I do not play, I sing (deep bass, centered below the bottom of the bass staff, presently studying music in college after retirement), but still the cello resonates within my soul. I grieve that I never got the chance to see Jacqueline in her prime. But more so, that MS brought her down and killed her. My wife has MS, is about 2/3 the way through the course of the disease. Its pace for her is much slower than the 20 years it took to kill Jackie. Slower, but just as bitterly relentless. The devastation of the disease is portrayed effectively in the film even though it is compressed in the telling. Some critics challenged the portrayal of incontinence, of tremors, of puzzling mental behavior. Those portrayals were quite accurate and the challenges unwarranted. The one portrayal I would challenge is the final scene of Jackie being fed reclining. As I understand it, at least from current writings on the subject, the manner in which that was done would guarantee (aspiration) pneumonia and death because of the damage MS does to the swallowing reflex which uses the vocal cords to keep contaminants out of the lungs. I hope that portrayal was inaccurate. Other than this one glitch, I've found the movie haunting, invading my thoughts at quiet times and while drifting in and out of sleep. Sorry critics, I give it a 10, for the ballet of bond and competition between the sisters, for the portrayal of the musical genius of both of them, for the tragedy wrought by MS, for the powerful telling of the tale.....",
         "It is a pleasure to see a film that has believable characters and an engrossing story which both entertains and enlightens. \"Hilary and Jackie\" tells the story of two sisters, Hilary and Jacqueline Du Pre, from their early years as devoted sisters and fledgling musicians, through their divergent life choices as professional soloist and housewife. Jacqueline's career as cellist takes off just as Hilary decides to marry and raise a family on a rural farm. The music is integral to the development of the story. Director, Anand Tucker, uses it to comment on the action, much as the piano performances were used in \"Shine\". The digital stereo sound highlights the richness of the music combined with emotionally gripping sound effects. Emily Watson shines as Jacqueline in a varied and multi-faceted performance that may well earn her another Academy Award nomination. As the quieter more sensible Hilary, Rachel Griffiths is also effective in a less showy but subtle portrayal. The key dramatic sequence comes at the film's center where Jacqueline leaves her husband, pianist and conductor, Daniel Barenboim, to stay with Hilary and her family. The surprising favor and request she asks of her sister will not be revealed here. Suffice it to say, this is not a film for children. The powerful final scenes will remain long in memory. The fine music should encourage those not familiar with the careers of Du Pre and Barenboim to sample their recordings. Put this fine film on your must-see list.",
         "Hilary and Jackie is a biographical film about two contemporary English sisters, Hilary and Jacqueline du Pré. Both are musical prodigies as children, but as they mature into women, it is Jackie, the cellist, who moves on to international fame, while Hilary opts for husband and family on an English farm. The film covers the complex, and troubling relationship between the two sisters, and Emily Watson and Rachel Griffiths give brilliant performances in the title roles. What was the Academy thinking when they were both passed over? And the music! It's always in the forefront, and helps move the story as much as the actors and screenplay. Not to be missed, this is one of the more enjoyable (although not uplifting) movies of 1998. Well worth the cost of the rental.",
         "Jacqueline du Pre is remembered as the beautiful, genius cellist who tragically died of multiple sclerosis at a young age. But this film, though a biopic, avoids the easy conventions of the tear-jerker. Instead, it portrays a talented but capricious young woman who found her rise to fame as difficult to handle, in some ways, as her subsequent decline. Three things lift it out of the ordinary: fine acting from the entire cast; a concerted attempt, in the construction of both plot and soundtrack, to genuinely convey the importance of music in her life; and an intelligent screenplay that uses the viewpoint of her sister Hilary, along with that of Jackie herself, to show her behaviour in two different lights. The veracity of the events has been disputed; but this is a complex, and ultimately moving, film.",
         "This heavy subject matter is so well done, it left me wanting more! The acting is superb. I have always loved Rachel Griffiths and she doesn't let the viewer down in this one either. She pulls this one off fantastically and IS Hilary du Pré! Emily Watson's performance is unbelievable and should have been recognized with a multitude of awards. It is amazing how well she acts in this. One truly believes that SHE has Multiple Sclorosis. I was amazed at how well she played the scenes. I just can't say enough about this film. I highly recommend that if you want quality writing and acting and are prepared for some realistic yet somewhat disturbing subject matter about life, RENT this film!",
         "A superb film, on many levels. Any film that has won or was nominated for 21 awards must be worthwhile! BUT - BE SURE TO READ the IMDB external reviews, viz. 'The Australian' and 'James Berardinelli's ReelViews'. These articles point out the factual errors (as well as praise). I hope that this does not lessen the movie's greatness for you. It IS an excellent movie, sensitively done and a vehicle for health, family, sexual issues, etc. Just don't take it as the absolute truth about Jacqueline du Pré. By the way, neither was the film 'Shine', about pianist David Helfgott.",
         "Hilary and Jackie is a film that can be appreciated on many levels. The performances of Ms. Griffith and Ms. Watson as the title characters were superb, but so were the actors that played the parents and husbands, and the two young actresses playing them as girls were terrific. All the people in the film were interesting. The film gives insight into the life of a musical genius with its rewards and triumphs as well as conflicts and sacrifices. There is also a psychological aspect at the heart of this film. From the beginning the two sisters have a bond, almost a symbiotic relationship, yet there is also intense competition. To make the presentation even more interesting the relationship is presented in two \"acts\", the first told from Hilary's perspective and the second from Jackie's. Whose is more real? Does it make a difference? The final scenes as MS is taking its toll on Jackie are gripping. Both actresses were deserving of their nominations. This was great entertainment! Three and half stars!!!",
         "\"Hilary and Jackie\" tells of two sisters who share a love of classical music and each other but take contrasting paths through adult life. A much lauded film worthy of its critical acclaim, \"H&J\" does have a peculiar twice-told tale approach to its presentation which tends to make it interesting but so complex as to dilute its effectiveness. Nonetheless, this British film with a typically \"stiff upper lip\" approach to its sentimentality, is well shot, scripted, and acted. A good watch which will be a little \"over the top\" for many.",
         "As a child Hilary was the talented musician on the flute and the younger Jacqueline was encouraged to keep up if she wanted to accompany her sister on trips to musical events. So Jackie practiced hard on her cello to do so, gradually becoming better than her sister. As adults Hilary is now very much in the shadow of her brilliant sister Jackie, who is booked solid for shows. However where Hilary finds happiness and support from her partner and husband Kiffer, Jackie grows increasingly isolated from others. The pair's relationship drifts apart but comes together again to produce one traumatic moment in their relationship. I'm sure it has been done many times but I still found this film's structure to be pretty clever. The central traumatic act in the narrative occurs halfway through the film; up until then we follow things from Hilary's point of view and then in the second half we jump backwards and work up to it again (and beyond) from Jacqueline's (more or less). The effect is that the first half of the film is engaging as it develops along lines we don't know while the second film is engaging as it underpins the reasons for Jacqueline's character and where she goes from there. I put of watching the film because I had no knowledge of the characters and no real interest in their music, however now that I have watched it I am glad I did as it is well made and interesting. It is very character driven and evenly paced, which will annoy some viewers but for me it worked really well and produced a story that didn't require you to know the people involved because you felt you did by the end. Watson leads the cast really well, bringing out the innocent of her character as easily as she does the spite within Jackie. Griffiths yet again shows her talent in taking on yet another accent and strange character and pulling it off. They work well together although their best scenes are early on. Support is good from Frain, Morrissey, Dance, Imrie and others but the film is lead well by the main two actresses who work well with the material given them. Overall this is a well paced film that will annoy some but is heavy in quality. The character development in the script is strong and the cast respond well to it. Tucker controls it all well with a good eye for a scene and some imaginative visual touches and brings out a film that is well-structured and engaging even if it won't be to everyone's tastes."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "British Screen Productions",
         "Channel Four Films"
      ],
      "summaries": [
         "British sisters Hilary du Pré and Jacqueline du Pré are both talented musicians, Hilary a flautist, Jackie a cellist. With regard to their musical prowess, they have always had a friendly competitive nature with each other, fueled in large part by the want of their pianist mother, Iris, for them to achieve musical greatness. But underlying this friendliness is a deep desire to be truly better than the other. Despite or perhaps in part because of her flamboyant performance style, the younger Jackie emerges from the shadows of older Hilary's more triumphant childhood successes to become the renowned musician in the family. Although both continue with their music and both end up marrying (Hilary to Kiffer Finzi, and Jackie to pianist Daniel Barenboim), Hilary focuses on her home life, whereas Jackie focuses on her career. A seemingly odd request by Jackie to Hilary is later understood, but Hilary's agreement to that request demonstrates the true nature of their loving but unusual sisterly relationship.",
         "This movie tells the true story of the tragic life of the brilliant international concert cellist Jacqueline Du Pré and her sister, Hilary. Despite starting out in music together, Hilary chooses a more normal life in having a husband and children. Jacqueline gets married too but can never seem to quite achieve the happiness of the mundane life Hilary has and Hilary's devotion to her sister causes them to take some rather drastic measures in their lives. The irony of having a great musical ability fades away as Jacqueline transcends into a slow decline when struck with a deadly illness.",
         "The tragic story of world renowned classic cellist Jacqueline du Pré, as told from the point of view of her sister, flautist Hilary du Pré-Finzi."
      ],
      "budget": 7000000
   },
   "movielensId": 2442,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-12-30",
      "dvdReleaseDate": "1999-07-20",
      "directors": ["Anand Tucker"],
      "runtime": 121,
      "movieId": 2442,
      "title": "Hilary and Jackie",
      "mpaa": "",
      "actors": [
         "Emily Watson",
         "Rachel Griffiths",
         "James Frain",
         "David Morrissey",
         "Charles Dance",
         "Celia Imrie",
         "Rupert Penry-Jones",
         "Bill Paterson",
         "Auriol Evans",
         "Keylee Jade Flanders"
      ],
      "imdbMovieId": "0150915",
      "originalTitle": "Hilary and Jackie",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": ["JzVSq3dy1LM"],
      "plotSummary": "The tragic story of world-renowned cellist Jacqueline du Pré, as told from the point of view of her sister, flautist Hilary du Pré-Finzi.",
      "tmdbMovieId": 46992,
      "avgRating": 3.66562,
      "releaseYear": "1998",
      "numRatings": 1431,
      "posterPath": "/2a3ZmHS7IrOGG46hrbSS3qJJk6d.jpg"
   }
}