{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "transporter",
            "id": 396
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "nottingham",
            "id": 10587
         },
         {
            "name": "youth gang",
            "id": 10766
         },
         {
            "name": "boxing",
            "id": 209476
         }
      ],
      "imdb_id": "tt0120391",
      "video": false,
      "title": "24 7: Twenty Four Seven",
      "recommendations": [
         109157,
         50070,
         32684,
         30640,
         52362,
         42758,
         48274,
         28392,
         36871,
         4375,
         43779,
         42207,
         24909,
         11402,
         18929,
         27857,
         43346,
         25720,
         18394,
         1732
      ],
      "backdrop_path": "/rKFmx9MS0GHDHTGzihaXe8yqykr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Alan Darcy",
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d3f5",
               "name": "Bob Hoskins",
               "profile_path": "/mIgAC6q5HcHHxZUIiCOvE6mHLGs.jpg",
               "id": 382,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Tim",
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d3f9",
               "name": "Danny Nussbaum",
               "profile_path": null,
               "id": 89798,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Tim's Dad (Geoff)",
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d42b",
               "name": "Bruce Jones",
               "profile_path": "/9HnvGUB263MoWVYyA45c6f8cr92.jpg",
               "id": 235361,
               "order": 2
            },
            {
               "cast_id": 15,
               "character": "Tim's Mother (Pat)",
               "gender": 1,
               "credit_id": "52fe4455c3a368484e01d42f",
               "name": "Annette Badland",
               "profile_path": "/b8MbawOjWEEDDTd9IcA38bV0Ywg.jpg",
               "id": 30320,
               "order": 3
            },
            {
               "cast_id": 22,
               "character": "Ronnie Marsh",
               "gender": 2,
               "credit_id": "583742a7c3a368247d01128c",
               "name": "Frank Harper",
               "profile_path": "/6MaOt1Q6Js7jiA3qsHIcSGY1bbf.jpg",
               "id": 990,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Daz (as Darren Campbell)",
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d43b",
               "name": "Darren O. Campbell",
               "profile_path": null,
               "id": 148134,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Stuart",
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d443",
               "name": "Karl Collins",
               "profile_path": "/i94xBSK5zAPi6tjp90YpTZgnd8A.jpg",
               "id": 193356,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Gadget",
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d433",
               "name": "Justin Brady",
               "profile_path": null,
               "id": 220766,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Meggy",
               "gender": 0,
               "credit_id": "583742c0925141318f01695f",
               "name": "Jimmy Hynd",
               "profile_path": null,
               "id": 1099338,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Benny",
               "gender": 2,
               "credit_id": "583742d492514131a1014af6",
               "name": "Johann Myers",
               "profile_path": "/DGi7evbcyXo5P45yfJWO6SCP1l.jpg",
               "id": 148142,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Tonka",
               "gender": 2,
               "credit_id": "5837428ec3a36836a0013dfc",
               "name": "James Corden",
               "profile_path": "/xGB0gfZ48M27gQjjL7inJIh1Pqj.jpg",
               "id": 55466,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Wesley Fagash",
               "gender": 0,
               "credit_id": "583742e3c3a36836a60175af",
               "name": "Mat Hand",
               "profile_path": null,
               "id": 1099339,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "'Wolfman' Knighty",
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d437",
               "name": "James Hooton",
               "profile_path": "/u72wC1SVKdI2uj8j0Yjy75JGtmz.jpg",
               "id": 1066822,
               "order": 12
            },
            {
               "cast_id": 13,
               "character": "Woody (the Dog)",
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d427",
               "name": "Toby",
               "profile_path": null,
               "id": 1066821,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Young Darcy",
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d43f",
               "name": "Krishan Beresford",
               "profile_path": null,
               "id": 1066823,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d3e5",
               "name": "Shane Meadows",
               "profile_path": "/zQhdD413z4RFuo9LbYJ2DEmMuky.jpg",
               "id": 70520,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d3eb",
               "name": "Shane Meadows",
               "profile_path": "/zQhdD413z4RFuo9LbYJ2DEmMuky.jpg",
               "id": 70520,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d3f1",
               "name": "Paul Fraser",
               "profile_path": null,
               "id": 81773,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d3ff",
               "name": "Boo Hewerdine",
               "profile_path": null,
               "id": 34002,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4455c3a368484e01d405",
               "name": "Ashley Rowe",
               "profile_path": null,
               "id": 17791,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d40b",
               "name": "William Diver",
               "profile_path": null,
               "id": 28497,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d411",
               "name": "Abi Cohen",
               "profile_path": null,
               "id": 958007,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4455c3a368484e01d417",
               "name": "George Faber",
               "profile_path": null,
               "id": 66129,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4455c3a368484e01d41d",
               "name": "Sally French",
               "profile_path": null,
               "id": 1066819,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4455c3a368484e01d423",
               "name": "Imogen West",
               "profile_path": null,
               "id": 1066820,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.83737,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 22913,
      "vote_count": 10,
      "budget": 0,
      "overview": "In a typical English working-class town, the juveniles have nothing more to do than hang around in gangs. One day, Alan Darcy, a highly motivated man with the same kind of youth experience, starts trying to get the young people off the street and into doing something they can believe in: Boxing. Darcy opens a boxing club, aiming to bring the rival gangs together.",
      "similar": [
         10474,
         1578,
         2300,
         10637,
         1367,
         1374,
         22881,
         70,
         312221,
         307081,
         9291,
         489,
         323677,
         11287,
         1371,
         9563,
         1375,
         2323,
         86130,
         13416
      ],
      "original_title": "24 7: Twenty Four Seven",
      "runtime": 96,
      "poster_path": "/bRaQtgsKSXAL0ea8MZ26bIyJs1T.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Scala Films",
         "id": 4189,
         "origin_country": ""
      }],
      "release_date": "1997-08-31",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Shane Meadows"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Paul Fraser",
         "Shane Meadows"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120391/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODY1NTQzMDQ0M15BMl5BanBnXkFtZTcwMTg5OTUxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Bob Hoskins, Danny Nussbaum, Toby | See full cast and crew »"],
      "reviews": [
         "Shot in sumptuous black and white,this is one the most energetic films I've seen in a very long time.Bob Hoskins(in the kind of role Robin Williams can play in his sleep,and often does)is at times funny,at other times dead serious,but always real in this story that centers around the boxing club he has built to give the young men in his small town something to do instead of sitting around feeling sorry for themselves and throwing their lives away.All the performances are first-rate,but the family unit of Danny Nussbaum,Bruce Jones and Annette Badland are particularly strong.If this movie had been made in Hollywood it would have been over-produced,over-cast and overdone.The film never lowers itself into the cheap sentimentality that this genre of film often falls into.The way that Bob Hoskins brings these guys into his confidence one by one by convincing them they're the ones keeping the other guys in line is awe-inspiring.And there's a great soundtrack to boot.Mr Meadows,I know the money can be very tempting but resist the call of Hollywood as long as you can.The concessions you'll have to make to get your work produced just aren't worth it.Bravo,Shane,you're one helluva filmmaker.",
         "\"Twentyfourseven\" is not an easy movie to watch, actually I found it quite difficult, but well worth it. The story chronicles one man's attempt to bring meaning and purpose to a group of working-class youths in a grimy English city. Bob Hoskins plays Alan Darcy a sweet, well-meaning man trying to do good against insurmountable odds. Shot in black-and-white the visual despair of the public housing projects and the almost bombed-out urban landscape highlights the dark mood of the film. Why should these unemployed young men care about Darcy's dream? They're on the dole and have their alcohol, drugs and football. Why bother? This is Darcy's challenge. The excellent ensemble cast brings life to the rather loose, not-so-good script. But the actors pull it off admirably and provide us with a good, although disturbing film. Definitely not Saturday-night-lite, rent-a-video with the family stuff, but still very good. If you're in the mood.",
         "For my money this is the best film of the year. Best in that it didn't cost a fortune but packs as much of an emotional wallop as any blockbuster with 200 times the budget. Bob Hoskins plays Darcy, the burnt out soccer coach whose past history is told in flashback through his diary. It tells of how he trained up a team of no-hopers into becoming boxers with something to live for. Shot in luminous black and white, the feature debut of Shane Meadows is a remarkably sensitive, blisteringly funny portrait of hopelessness in Nottingham. The city has always had its problems but is also one of the most vibrant places on earth and Meadows captures the balance perfectly. The sulphurous black and white photography adds much class to the production and the team of largely unknown actors handle things admirably. The movie also features one of the most realistic fight scenes ever committed to celluloid when Hoskins and Coronation Street's Bruce Jones (Les Battersby) lay into one another. Both actors walked away with broken bones and this is jut one element of why 24/7 is a cut above the average movie. It's life captured on film with few romantic films. But the message is as powerful as one of Hoskins' punches in the ribs. Meadows will inevitably get more money for his next picture and will no doubt be sucked into the Hollywood mainstream which will probably be the death of him. If that happens, let's hope he doesn't lose sight of the genius which he embedded into every frame of 24/7.",
         "TwentyFourSeven is a pleasing film from director Shane Meadows who also acted and co-wrote the screenplay. Rather sensibly for a first-time endeavour, he's opted for a low-key work rather than the flashy fragmented works of other young debutantes (Guy Ritchie please take note). The story is alarmingly simple and is thus: Alan Darcy (Bob Hoskins, excellent) helps out wayward youths in a harsh Northern town by running a boxing club. And that, basically, is it. The film perhaps plays on too narrow a canvass and it's \"life is harsh\" rhetoric can be mildly overstated. Witness the habitual drug user who turns up to a bout with the largest spliff in history. This guy does drugs, and in case you don't get the point, here's a telescopic joint that would bankrupt Columbia. Bruce Jones' wife-beater can also be a little one-dimensional, saved only by the actors' charm. Yet the fact that the screenplay is so modest in it's ambitions helps it immensely. A lesser talent would have thrown everything at the screen for his first full-length work, yet Meadows tells his tale and tells it well. Dialogue that could veer towards slight pretention is saved by the wonderful Hoskins, while the real triumph is the black and white filming. This isn't the Schindler's List type of black and white; a dull grey that looks like a normal film with the colour control on your TV turned down. This is a dark, grimy black and white that takes away any contemporary restraints. Particularly notable are the scenes set against the woods and train car, and the pace they evoke. This is a film that doesn't drag but takes it's time with precision. It will entertain you and doesn't need to rush it. Impressive.",
         "This wonderful film ironises the feel-good 'Rocky' tradition to critique an ideology - Thatcherism - that poisoned a nation still searching for the antidote. Like all Meadows films, this is great fun, with authentic-seeming performances matched by remarkable style which mixes stylised naturalism and sketch-like sequences. But looming over the larks is a depressing framing story - we know the plot ends up here. The unbearable tension is wondering how. The answer is heartbreaking, showing how the thatcher years brought Britain to the brink of fascism, where an underclass are either bullied or ignored to a point where the only means of expression is self-destructive violence. The 'poetic' voiceover is a mistake, especially for a director of Meadow's visual intelligence, but he'll get there. A great feature debut.",
         "British character acting at its gritty and often ugly best. Ultimately a tale of redemption set against the palsied urban underbelly of post Thatcher Britain. Stark monochrome landscapes and 'facescapes' parallel a discarded social class, drained of its own colour. All set off by a notable soundtrack including stuff from The Charlatans, Sun House, Van Morrison and Paul Weller. The main criticism I would level at this film is the lack of story-flow. Too many set pieces strung together to get 'the point' across. It lost its heart somewhere in post production I would guess. On balance it's hardly a bundle of laughs BUT still worthy of a sound 8. (eight)",
         "A gritty black & white film from the 25 year old director, Shane Meadows. Darcy, (played by Bob Hoskins in one of his better roles since MONA LISA & THE LONG GOOD FRIDAY), decides to take a bunch of restless teenagers off the streets and into the boxing ring. Then we go through the process of the bonding and the struggle as the boys come good. It begins as a realistic social drama and ends that way. I was glad to see that it didn't sell out.",
         "This film was one I had heard of, thought I'd like to see, but simply missed. When it came on pay-tv I made a point of taping it and I'm glad I did. In an extremely simple but effective way this film transports the viewer to a seedy english working class neighbourhood with its local 'colour' and crushing gloom, hopelessness and misery. A fair short film, in some respects I felt the tale unfinished - little by way of background, the heart of the film was the training and first competition which doesn't run too long, then - almost before you know it - its all over. Still, definitely worth a watch for some fine acting, interesting (though not overly original) plot, and fine but simple film-making. (ps although I can understand the use of b/w I'm not really convinced it was all that necessary or effective). My vote 7/10",
         "After the short 'Where's The Money, Ronnie?' and the not-so-short 'Small Time', Lord Shane Meadows of Eldon's first feature film is this snappy black-and-white urban drama. Darcy (Bob Hoskins) is sick of seeing the local youths at each other's throats, so forms a boxing club to bring them together. It is a laudable plan; something to offer control and direction to a disaffected generation. Meadows' greatest talent is in presenting a truthful working class landscape sympathetically, but without being patronising. Our heroes are disadvantaged, often stricken by a fearsome domestic environment (none more so than Danny Nussbaum's Tim); and yet they are also kind, witty, hungry, and joyful. The scenes in which Darcy brings the boys to Wales, with Ashley Rowe's sumptuous cinematography and Hoskin's lyrical voice-over, are so vibrant it's as if they're filmed in colour. It's quite something to find drama in scenes of great happiness, when the conflict is left at home - but Meadows always seems to find it, and that's what makes his films vital and real.",
         "In one of many great British movies, a man (Bob Hoskins) helps working-class youths try to make something of themselves in an economically depressed town in England. It is the first time that they can ever be anything greater. But then tragedy strikes and the whole thing falls apart. The gritty \"24 7: Twenty Four Seven\" is no ordinary make-something-of-yourself story. The grainy black and white cinematography makes you feel like there's sandpaper rubbing against your face, and they certainly don't sugar-coat anything here. It's a movie that I recommend to everyone. Just don't expect anything \"nice\". A very good debut from Shane Meadows."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "British Broadcasting Corporation (BBC)",
         "Scala Films"
      ],
      "summaries": ["In a typical English working-class town, the juveniles have nothing more to do than hang around in gangs. One day, Alan Darcy, a highly motivated man with the same kind of youth experience, starts trying to get the young people off the street and into doing something they can believe in: Boxing. Soon he opens a training facility which is accepted gratefully by them and the gangs start to grow together into friends. Darcy manages to organize a public fight for them to prove what they have learned. A training camp with hiking tours into the mountains of Wales forge the group into a tight-knit club society. With the day of the fight drawing closer, the young boxers get more and more excited."],
      "budget": 0
   },
   "movielensId": 2444,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-08-31",
      "dvdReleaseDate": null,
      "directors": ["Shane Meadows"],
      "runtime": 96,
      "movieId": 2444,
      "title": "24 7: Twenty Four Seven",
      "mpaa": "",
      "actors": [
         "Bob Hoskins",
         "Danny Nussbaum",
         "Bruce Jones",
         "Annette Badland",
         "Frank Harper",
         "Darren O. Campbell",
         "Karl Collins",
         "Justin Brady",
         "Jimmy Hynd",
         "Johann Myers",
         "James Corden",
         "Mat Hand",
         "James Hooton",
         "Toby",
         "Krishan Beresford"
      ],
      "imdbMovieId": "0120391",
      "originalTitle": "24 7: Twenty Four Seven",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In a typical English working-class town, the juveniles have nothing more to do than hang around in gangs. One day, Alan Darcy, a highly motivated man with the same kind of youth experience, starts trying to get the young people off the street and into doing something they can believe in: Boxing. Darcy opens a boxing club, aiming to bring the rival gangs together.",
      "tmdbMovieId": 22913,
      "avgRating": 3.45455,
      "releaseYear": "1997",
      "numRatings": 88,
      "posterPath": "/bRaQtgsKSXAL0ea8MZ26bIyJs1T.jpg"
   }
}