{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "blind",
            "id": 33768
         },
         {
            "name": "massage therapist",
            "id": 209022
         }
      ],
      "imdb_id": "tt0132512",
      "video": false,
      "title": "At First Sight",
      "recommendations": [
         9409,
         20096,
         12661,
         20927,
         26180,
         24618,
         11777,
         24940,
         6472,
         83714,
         26789,
         49804,
         10449,
         2020,
         35645,
         38554,
         17362,
         36929,
         41590,
         427910
      ],
      "backdrop_path": "/usrP3BHrIfNRjW9PGeb1lXrY6rp.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Virgil Adamson",
               "gender": 2,
               "credit_id": "52fe46669251416c75077047",
               "name": "Val Kilmer",
               "profile_path": "/AlhPeiH8R4reMNGNQ9ag1FPbuW9.jpg",
               "id": 5576,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Amy Benic",
               "gender": 1,
               "credit_id": "52fe46669251416c7507704b",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jennie Adamson",
               "gender": 1,
               "credit_id": "52fe46669251416c7507704f",
               "name": "Kelly McGillis",
               "profile_path": "/ymfAoXUzi4GKGasA3AMES8b9E4h.jpg",
               "id": 11084,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Duncan Allanbrook",
               "gender": 2,
               "credit_id": "52fe46669251416c75077053",
               "name": "Steven Weber",
               "profile_path": "/ujINzDjLNtELBSUkRHQgExzP4Fb.jpg",
               "id": 6106,
               "order": 3
            },
            {
               "cast_id": 20,
               "character": "Dr. Charles Aaron",
               "gender": 2,
               "credit_id": "574f40d292514118560000ad",
               "name": "Bruce Davison",
               "profile_path": "/kYFBIffblcsbLMITDZYHhVf5c9f.jpg",
               "id": 52374,
               "order": 4
            },
            {
               "cast_id": 21,
               "character": "Phil Webster",
               "gender": 2,
               "credit_id": "574f40e2c3a36879e40000cc",
               "name": "Nathan Lane",
               "profile_path": "/2eB01W4VURqihttVdewfhfhhCwW.jpg",
               "id": 78729,
               "order": 5
            },
            {
               "cast_id": 22,
               "character": "Virgil's Father",
               "gender": 2,
               "credit_id": "574f40f4c3a36879e60000cb",
               "name": "Ken Howard",
               "profile_path": "/uS0ad3oElzhCBBseeY7i6lR0K1q.jpg",
               "id": 18328,
               "order": 6
            },
            {
               "cast_id": 27,
               "character": "Betsy Ernst",
               "gender": 1,
               "credit_id": "574f41a492514118610000e7",
               "name": "Laura Kirk",
               "profile_path": "/s8isCe7huZp1PR5SuSy5e4y8yGb.jpg",
               "id": 21881,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Caroline",
               "gender": 1,
               "credit_id": "574f411692514118650000b3",
               "name": "Drena De Niro",
               "profile_path": "/lTIcKFCZ7T1RllUKe2CwkqS1qzb.jpg",
               "id": 93015,
               "order": 8
            },
            {
               "cast_id": 24,
               "character": "Nancy Bender",
               "gender": 1,
               "credit_id": "574f413ec3a36879de0000ad",
               "name": "Margo Winkler",
               "profile_path": "/nzx1WMh7LxkSg2mFTd0MxWZNN5Q.jpg",
               "id": 1079544,
               "order": 9
            },
            {
               "cast_id": 25,
               "character": "Singer",
               "gender": 1,
               "credit_id": "574f416ac3a36879e00000e2",
               "name": "Diana Krall",
               "profile_path": "/4E0ms1i6ngSK5epO1IYLtiBuRFt.jpg",
               "id": 137386,
               "order": 10
            },
            {
               "cast_id": 26,
               "character": "Jack Falk",
               "gender": 0,
               "credit_id": "574f4185c3a36879e60000e3",
               "name": "Willie C. Carpenter",
               "profile_path": "/700iIf7ntH8ilYFustxOxzpASZv.jpg",
               "id": 20760,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46669251416c75077059",
               "name": "Irwin Winkler",
               "profile_path": "/chJjLXD7PlFhuyeverNCgemIAAC.jpg",
               "id": 11472,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46669251416c7507705f",
               "name": "Steve Levitt",
               "profile_path": null,
               "id": 78384,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5620bc98c3a3680e20007be3",
               "name": "Oliver Sacks",
               "profile_path": null,
               "id": 67760,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5620bcc892514171d4007607",
               "name": "Irwin Winkler",
               "profile_path": "/chJjLXD7PlFhuyeverNCgemIAAC.jpg",
               "id": 11472,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5620bcb2c3a3680e19007287",
               "name": "Rob Cowan",
               "profile_path": null,
               "id": 18330,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5620bcdcc3a3680e1900729a",
               "name": "Mark Isham",
               "profile_path": "/juP82LbS9chU3VXgelb7CICBN2Q.jpg",
               "id": 4140,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5620bcf2c3a3686868002259",
               "name": "John Seale",
               "profile_path": "/w4wp04pRMqJI2vt3gFTdIWLDDzp.jpg",
               "id": 2702,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5620bd0592514171cd0077af",
               "name": "Julie Monroe",
               "profile_path": null,
               "id": 53645,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5620bdb5c3a3680e0e007d9b",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5620bdcac3a3680e1d007a5f",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5620bdde92514171d000751b",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "5620bdf39251413a740022c9",
               "name": "Jane Musky",
               "profile_path": null,
               "id": 3429,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "5620be089251411e1f00279e",
               "name": "Robert Guerra",
               "profile_path": null,
               "id": 4187,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5620be1a92514171d4007674",
               "name": "Susan Bode",
               "profile_path": null,
               "id": 17221,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "5620be319251413a740022d6",
               "name": "John Dunn",
               "profile_path": null,
               "id": 52163,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 5.364448,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15556,
      "vote_count": 71,
      "budget": 0,
      "overview": "A blind man has an operation to regain his sight at the urging of his girlfriend and must deal with the changes to his life.",
      "similar": [
         345923,
         20504,
         300669,
         11321,
         209263,
         245844,
         54307,
         42601,
         11206,
         15856,
         254193,
         72660,
         54266,
         31977,
         54273,
         381040,
         13681,
         16692,
         476889,
         18510
      ],
      "original_title": "At First Sight",
      "runtime": 128,
      "poster_path": "/3noBOQroTjMWAYhlku95Y06v5C5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
         "name": "Metro-Goldwyn-Mayer",
         "id": 21,
         "origin_country": "US"
      }],
      "release_date": "1999-01-15",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Science gave him sight. She gave him vision.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Irwin Winkler"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "Oliver Sacks",
         "Steve Levitt"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0132512/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3NjIzMzk0MF5BMl5BanBnXkFtZTcwMjc2NjAyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Val Kilmer, Mira Sorvino, Kelly McGillis | See full cast and crew »"],
      "reviews": [
         "I've been a nurse for 20 years, and have been around many patients who must contend daily with what \"normal\" people would consider to be adversities and handicaps. I've always looked upon them with (1) great admiration for their personal strength and determination, and (2) a pervading sense of sorrow and an aching heart, for their \"misfortune\" in having been denied the opportunity to interact in the world with the benefit of an intact, healthy body. This movie really struck an emotional chord with me, and made me realize how my feelings for these `unfortunates' could be construed as condescending and insensitive. I've often wished that I had the power to \"heal\" the handicapped, or to make them whole and \"normal.\" The idea that they could feel totally satisfied, complete, and happy, despite their limitations -- and that it is presumptuous of us to think otherwise -- was intelligently brought to light in this screenplay. This film is based upon a true story of a man who had come to terms with his blindness, and who, instead of wallowing in bitterness and self-pity, had learned to use his remaining senses of hearing, touch, smell, and taste -- along with a delightful sense of humor -- to become a happy, positive, and resourceful human being, with a keen sensitivity toward -- and appreciation of -- the world and the people around him. This is very much like handicapped patients I have cared for through the years, who left me in wonder at their strikingly positive attitudes and warmth toward humanity, despite the obstacles they face on a daily basis. One of the reasons that I enjoy Val Kilmer's performances so much, is that he has the uncanny ability to capture the subtlest nuances of the characters he is portraying, whether it's Virgil, Doc Holliday, Jim Morrison, etc., and then is willing to bare his soul to bring the role to fruition for public enjoyment/critique. It's a risky, daring, thing to do -- and I applaud him for his courage! I appreciate the effort he makes to hone his performances by extensively researching the people and situations he is contracted to portray, instead of just showing up on the set, spewing his lines, picking up the paycheck, and moving on. His portrayal of a blind man was COMPLETELY believable, and I forgot for two hours that he was a sighted actor playing a part. One reviewer criticized him for smiling too much when his character interacted with people. I have to ask whether that person has ever watched Stevie Wonder, Ray Charles or Jose Feliciano, while they are interacting in social situations. Kilmer nailed this part, and beautifully expressed the gamut of emotions experienced by Virgil in the transformations that took place in his life. Other issues that have been mentioned by reviewers: (1) -- A supposed `lack of chemistry' between Kilmer and Sorvino \u0096 I have to wonder if we were watching the same film! (2) -- Yes -- as a warning to households with young children -- there is nudity, but their intimate scenes were enacted beautifully, with sensitivity and tenderness; there was nothing raunchy or sensationalistic about them. However, some might take offense at the scene in the strip club \u0096 it wasn't essential to the plot development, and could have been omitted. (3) -- The only `bad language' in the film were rare, scattered expletives, which conveyed the understandable frustration of the main character when he was confronted with overwhelming emotions and tribulations, and (4) \u0096 the scene of confrontation between Virgil and his father, which some people thought unnecessary, but which I felt was very appropriate, since their relationship and the father's abandonment of the family had been such traumatic, devastating events in Virgil's life. This film is an emotional roller-coaster ride, but WELL worth the trip \u0096 LOVED it! :o) P.S. \u0096 If you haven't seen Kilmer as Doc Holliday in `Tombstone,' RUN, don't walk, to your nearest video store, and grab the Vista Series DVD \u0096 it's absolutely one of the best performances EVER recorded on film! The Academy must have slept through 1993!!!!",
         "I went into the theater expecting the normal amount of mushiness one can assume will be present in a love story. However, I was pleasantly surprised. At First Sight contains little sappiness, or other such material that only takes up time. Instead, the film was an honest look at one man's attempt to adjust to the \"sight\" world. At First Sight offered a look into the struggles Virgil Adamson faced after having sight for the first since he was 1. The film also outlined the pain of his loved ones, as they tried to help him adjust to a new environment, while facing pain and confusion themselves. At First Sight is an emotional roller coaster. The film jumps around from rejoicing, sadness, frustration, confusion, and happiness. Yet because these are very real emotions for the characters, the audience sympathizes. The film uses these emotions artfully, without appearing to jam them down the audience's throat. As any good movie will, At First Sight opens the audience's eyes to the people who live through these experiences. Everyday things, like what a bird is, and what an expression means at a given moment, must be explained Virgil. The lessons Virgil must learn and the way he deals with them are both amusing and sad. This movie challenges traditional beliefs by stating that a \"handicap\" is a barrier. Often the real problem is trying to fix it. If you're in the market for an excellent movie, with a solid cast, and good effects, see At First Sight.",
         "\"At First Sight\" is an absolutely amazing movie. I had hesitated to watch this film in the theaters cause of all the bad reviews it got from the critics and from word of mouth from other people i knew. Well, now I've learned a valuable lesson: Don't listen to what other people say. I knew I should have watched it in the theater but it's okay. I have seen it on video and nevertheless I saw it. I went into it expecting a big disappointment. But, rather than that, I fell in love with the movie. It touched me in every way. The fact that it really happened also made me feel extra emotions. This movie is a good one. I don't know what the critics were thinking. I don't know what my friends were thinking, but I guess when I look at it, us romance/drama movie buffs are a small number compared to the action/adventure movie buffs. This movie is absolutely amazing and whatever you do go see it. If you're a romance/drama movie person I'm sure you'll love it!!!",
         "The only way I can really describe At First Sight is that it is a nice film. A feel good movie, something like that, and a very beauifully shot feel good movie. The cinematography is excellent, the story on the other hand could have used some tightening. Kilmer and Sorvino kind of walk through this film on cruise control, I really enjoyed Nathan Lane's small role as a vision therapist. This is a nice movie to watch on a rainy day or with someone you love.",
         "I happened to come across this movie one night on cable. I have to say I'm sorry I didn't see it in the cinema. Val Kilmer did an excellent job playing a blind man, and the struggles it entails as he adjusts from his dark world, to a seeing one, and having to adjust to loosing it all again. I could't help but get wrapped up in his struggles to adjust, the frustration he feels when he tries to adjust to the seeing world and what Amy (Mira S) expects of him as his eyes begin to fail him once again. I was surprised to see, at the end of the movie, that it was based on a true story. Hats off to Val Kilmer for job well done - he was very believable.",
         "I watched this film on late night TV and definitely enjoyed it. I think it will stay with me because it reminded me that sometimes I try to change people to make life better for them as I think it should be. I must be more conscious in finding out What they want before I start the process of changing. I think Virgil was much more intuitive and happy in his blindness. Although his life was a simple one, he was happy. Amy tried to make him part of her world and regaining his sight became very frightening and confusing for him, especially in New York City. He went from serenity and peace with his life to confusion and anger. Maybe it is good that he lost his sight again.",
         "I loved this movie. I adored it; I felt it was one of the more genuinely touching and real love stories that I had seen in a long, long time and even now, more than twenty-four hours since I saw it for the first, and I promise you, *not* last time, I am still haunted by its emotional power and how it drew me in with its passion. Inspired by a true story and starring a very real actor and a very real actress, \"At First Sight\" touched my heartstrings and yanked on them all the way through. It also contained a very humanistic touch apart from its romantic elements, one that I think everybody can appreciate in one way or another. As the movie opens, Amy Benic (Mira Sorvino) an overworked architect is essentially booted out of her office and sent to the winter land countryside resort on a vacation by her co-workers. During her stay there, she befriends a blind therapist (Val Kilmer) with whom she begins a slowly-developing romantic bond. Despite his condition, they grow closer to each other and become passionately devoted, up to and past a surgery that they hope can restore his eyesight. \"At First Sight\" is a fictionalized adaptation of Shirl and Barbara Jennings, a couple who passionately loved each other even though the former was completely blind. Their story was documented by Dr. Oliver Sacks. Adapted from his account by Steve Levitt and directed by Irwin Winkler, the movie becomes a powerfully dramatic love story that contains so much of that real-life passion from the people that inspired it. It is easy to criticize \"At First Sight\" for being too conventional, too derivative of other Hollywood love stories. But I don't think this picture falls under those categories and those type of films, such as \"Hope Floats.\" First of all, sometimes it's not about plot twists or breaking the mold. Sometimes, a movie can strike with just as much power (or more, as in this case) simply by utilizing those conventions and building upon them in a way that is fresh. And they do that here. The two central characters are very well-written, characterized as thinking, caring human beings who love and hunger for each other. A commendable move on the filmmakers' part was the casting. Instead of placing the typical romantic leads, who are more body than personality, they cast two very real performances. Gifted and good-looking as they are, Mr. Kilmer and Ms Sorvino, I've always felt, were very real. They aren't merely putting on a convincing act, they transition something very real into their performances and you can sense that. And as a defining example, I want to cite the scene in here that I usually gripe about: the sex scene. Whereas with most erotic scenes in movies, I tend to get the feeling that my time is being wasted, or that the director is losing faith in his own picture and using a cheap gimmick to stimulate my interest, I did not feel that here. There is a brief and very visceral erotic moment between Mr. Kilmer and Ms Sorvino - and I know people are going to start laughing at this point - and I did not get a negative reaction because this scene was not lustful. I wasn't thinking about the sex, I wasn't even thinking about Ms Sorvino's body. I was thinking about the passion and the love that was emanating from this scene. Here comes the one that I'm sure will get the biggest laugh yet. I was not turned on; I was moved. That's the core of what I loved this movie. Unlike so many of those contrived excuses of love stories that I see in so many movies, I *believed* in the love between these two characters. I was convinced they were two people who adored each other. I believed in their love, I cared for their love, I feared for their love. But what also makes the movie so good is the way the subject matter of blindness is treated. I imagine that for some, seeing or merely knowing about the subject matter of this movie can be a comforting reminder that lack of eyesight is not lack of humanity. For me, it was a reminder of just how thankful I am to not only have my eyesight, but my health. These two very authentic emotional elements stirred a great passion in me as I watched the film and kept me in play clear to the end. Can I criticize anything in the movie? Well, yes, two short moments. One was a super-fast zoom upon Val Kilmer's eyes accompanied by a whooshing sound effect. The other was a jump cut montage of Ms Sorvino imitating emotions. These two scenes were a little out of place and seemed to be from other movies. But it's a two hour and nine minute movie and these two bits add up to, what, less than a minute? You do the math. \"At First Sight\" is a wonderful movie with a strong emotional chord. Mr. Kilmer and Ms Sorvino are absolutely wonderful, as are the underrated Kelly McGillis as the jealous, troubled sister, Bruce Davison as the optimistic surgeon, Nathan Lane as the unorthodox and deliberately comical vision therapist, and Steven Weber as the lascivious fellow architect. It's an incredibly touching love story that I'm telling you, I cannot be satisfied with after just a first sight. I'm going to need at least two more before I could possibly even come close to being too familiar with this genuine little jewel of a motion picture.",
         "I saw this film on AMC and part way through it, I felt as if I had seen it before. Then I realized I was thinking of the 1990 Penny Marshall film \"Awakenings,\" starring Robin Williams and Robert De Niro. \"At First Sight\" is a true story about a blind man who temporarily regains his sight, then goes blind again. \"Awakenings\" was about a comatose man who woke up temporarily, then slid back into a comatose. Oh, and by the way, they're both written by the same guy. For what it's worth, \"Love At First Sight\" is actually a pretty likable and overall watchable film. It's not great or anything unpredictable (how convenient - the female love interest) but Kilmer gives a remarkable performance (all considered) and there are a few moments in hte film that are a BIT out of the ordinary. Worth watching, but don't go out of your way or anything.",
         "A very interesting subject, but not done as well as I'd hoped. I thought the beginning of the movie was quite well done, but then it seemed to suddenly jump. I felt like it skipped a step. All of a sudden Sorvino and Kilmer's characters are in love. The movie plodded along a bit more, and I felt like we'd NEVER see him have the operation to get his sight. During the operation there are boring scenes, which go on much too long between Sorvino and the sister. AFTER the operation, it begins to get interesting again. BUT, BUT, BUT... they don't spend enough time on the interesting stuff. The movie skims over everything. The romance is going stale, he's learning to see, and there's that absurd father story-line, but none of the story-lines are fully developed. And the ending was the slowest part of the movie. Peeve - Why did he get a new dog, and leave behind his beautiful yellow lab???? Quite disappointing.",
         "At First Sight was a film with two stories to tell. The first was a love story and the second about a blind young man who has a chance to regain his sight. For some reason the two stories both separately compelling did not seem to mesh well--or as well as I expected. I'm not sure whether it was the writing or the directing or just me. With that said I thought the per- formances were outstanding. Ms. Sorvino, as the love interest, and Ms. McGillis, as the older sister who helped and cared for him were both good, but this was Mr. Kilmer's movie. He was EXCELLENT. He made me realize that a handicap is often more that of others than the supposedly handicapped. I suppose I knew this but Mr. Kilmer's performance brought it to conscio usness. He also portrayed well the confusion and bewilderment of entering what most people would consider the \"normal\" easy world of sightedness. I truly enjoyed the scenes where he displayed genuine innocence of adjusting to his new world. I don't want to be specific here. He showed great dimension to make me realize that sighted or not he was a complete person. There is much to be appreciated about this movie and everyone can learn from it. On the basis that this is a true and important story and Mr. Kilmer's performance---three plus stars."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Metro-Goldwyn-Mayer (MGM)"],
      "summaries": [
         "A driven Manhattan architect, Amy, relaxes at a resort and falls for the masseur, Virgil, blind since age 3 and assisted by his spinster sister. He helps Amy hear and sense the world, giving her new spirit and a burst of creativity. Over the sister's objections, Amy takes Virgil to New York for new, radical surgery. He regains his sight. He's disoriented and must learn to process these new images. Finding his place in a seeing world strains his relation with Amy; his absent father wants to connect with him now that he can see; then, retinal disease threatens to undo the surgery. Can love survive, will he find his new place and his old tranquillity, can Amy accommodate limits?",
         "Amy is an architect who works for perfection. She takes a vacation at a small town health spa where she meets Virgil, a blind masseur. She falls in love with him for the senses he loves that she takes for granted. They listen to the rain, they make love, and then she does research on restoring sight he hasn't had since he was one year old. He joins her in New York and undergoes the treatment only to find that seeing doesn't mean comprehending what one sees. The difficult road to understanding the visual world tests their relationship. The strain is taken to the limits when Virgil begins to lose his sight once again.",
         "A blind man has an operation to regain his sight at the urging of his girlfriend and must deal with the changes to his life."
      ],
      "budget": 60000000
   },
   "movielensId": 2445,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-15",
      "dvdReleaseDate": "1999-04-27",
      "directors": ["Irwin Winkler"],
      "runtime": 128,
      "movieId": 2445,
      "title": "At First Sight",
      "mpaa": "PG-13",
      "actors": [
         "Val Kilmer",
         "Mira Sorvino",
         "Kelly McGillis",
         "Steven Weber",
         "Bruce Davison",
         "Nathan Lane",
         "Ken Howard",
         "Laura Kirk",
         "Drena De Niro",
         "Margo Winkler",
         "Diana Krall",
         "Willie C. Carpenter"
      ],
      "imdbMovieId": "0132512",
      "originalTitle": "At First Sight",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["os50D-aOZQo"],
      "plotSummary": "A blind man has an operation to regain his sight at the urging of his girlfriend and must deal with the changes to his life.",
      "tmdbMovieId": 15556,
      "avgRating": 2.85367,
      "releaseYear": "1999",
      "numRatings": 844,
      "posterPath": "/3noBOQroTjMWAYhlku95Y06v5C5.jpg"
   }
}