{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "american football",
            "id": 579
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "cheerleader",
            "id": 2920
         },
         {
            "name": "sport",
            "id": 6075
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "high school sports",
            "id": 8635
         },
         {
            "name": "police car",
            "id": 33352
         },
         {
            "name": "the big game",
            "id": 191222
         }
      ],
      "imdb_id": "tt0139699",
      "video": false,
      "title": "Varsity Blues",
      "recommendations": [
         10414,
         20697,
         11374,
         10878,
         15198,
         9536,
         13416,
         26602,
         10393,
         10956,
         13203,
         15037,
         13997,
         18133,
         10985,
         10478,
         11164,
         9942,
         13595,
         11067
      ],
      "backdrop_path": "/vQ6m3a4rdZyKJ7To2oCV3WSyVPE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jonathan 'Mox' Moxon",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c227",
               "name": "James Van Der Beek",
               "profile_path": "/gcytCvmikcg8BEVg7GyINmnsF7I.jpg",
               "id": 19210,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jules Harbor",
               "gender": 1,
               "credit_id": "52fe46129251416c7506c22b",
               "name": "Amy Smart",
               "profile_path": "/yTWkJVYq1wtn2NrnPIwXshTWqby.jpg",
               "id": 20189,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Coach Bud Kilmer",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c22f",
               "name": "Jon Voight",
               "profile_path": "/c7BvyqlvqDkfkFqSBUCiR21fvTh.jpg",
               "id": 10127,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lance Harbor",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c233",
               "name": "Paul Walker",
               "profile_path": "/iqvYezRoEY5k8wnlfHriHQfl5dX.jpg",
               "id": 8167,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Billy Bob",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c237",
               "name": "Ron Lester",
               "profile_path": "/fHqxHwpsP2yo7kMJJIisBR7VLk8.jpg",
               "id": 77174,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Charlie Tweeder",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c23b",
               "name": "Scott Caan",
               "profile_path": "/kvUKf9HCaqUtgj7XuKZOvN66MOT.jpg",
               "id": 1894,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Darcy Sears",
               "gender": 1,
               "credit_id": "52fe46129251416c7506c23f",
               "name": "Ali Larter",
               "profile_path": "/bREO6OEipl4y077K0mdBUXVuE3i.jpg",
               "id": 17303,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Joe Harbor",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c24f",
               "name": "Richard Lineback",
               "profile_path": "/xJCHIMBmigiTcs0wempCfO573yf.jpg",
               "id": 3205,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Sam Moxon",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c253",
               "name": "Thomas F. Duffy",
               "profile_path": "/jLANWUvY91SUNcBfB4z7PQUieE7.jpg",
               "id": 46919,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Kyle Moxon",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c257",
               "name": "Joe Pichler",
               "profile_path": null,
               "id": 94547,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sheriff Bigelow",
               "gender": 0,
               "credit_id": "52fe46129251416c7506c25b",
               "name": "Brady Coleman",
               "profile_path": "/lezl6XUlisuJiBr0ar48LsFthlv.jpg",
               "id": 111002,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Wendell Brown",
               "gender": 2,
               "credit_id": "52fe46129251416c7506c25f",
               "name": "Eliel Swinton",
               "profile_path": null,
               "id": 941625,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Miss Davis",
               "gender": 1,
               "credit_id": "52fe46129251416c7506c263",
               "name": "Tonie Perensky",
               "profile_path": "/l1AZvcoHFwAbqw9jlAdvJAoEBYX.jpg",
               "id": 975230,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Tommy Harbor",
               "gender": 2,
               "credit_id": "55694c08c3a368774e000ac8",
               "name": "Jesse Plemons",
               "profile_path": "/4fdE4D8e2DEtFL4QgdorQOAI9RT.jpg",
               "id": 88124,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46129251416c7506c245",
               "name": "Brian Robbins",
               "profile_path": "/l7UfY9nBeus8bHHXvf3mUmtagQJ.jpg",
               "id": 53177,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46129251416c7506c24b",
               "name": "W. Peter Iliff",
               "profile_path": null,
               "id": 15304,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "588be76d9251414395000c5d",
               "name": "David Gale",
               "profile_path": "/b4MJOQRqAk2rIpMJ4vL9QBbj3qA.jpg",
               "id": 1746321,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.521508,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14709,
      "vote_count": 149,
      "budget": 0,
      "overview": "In small-town Texas, high school football is a religion, 17-year-old schoolboys carry the hopes of an entire community onto the gridiron every Friday night. When star quarterback Lance Harbor suffers an injury, the Coyotes are forced to regroup under the questionable leadership of John Moxon, a second-string quarterback with a slightly irreverent approach to the game.",
      "similar": [
         13416,
         5693,
         26602,
         2300,
         10637,
         22881,
         9472,
         8456,
         9291,
         293767,
         323677,
         10474,
         11287,
         9563,
         2323,
         86130,
         17108,
         18172,
         444218,
         319888
      ],
      "original_title": "Varsity Blues",
      "runtime": 106,
      "poster_path": "/nnVA3Nmry9furen0NDmJa0QTn2F.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/kc7bdIVTBkJYy9aDK1QDDTAL463.png",
            "name": "MTV Films",
            "id": 746,
            "origin_country": "US"
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-01-15",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "It takes a hero to know what's worth winning.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian Robbins"],
      "runtime": 100,
      "synopsis": "Jonathan \"Mox\" Moxon (James Van Der Beek) is an academically gifted backup quarterback for the West Canaan High School football team. Despite his relative popularity at school, easy friendships with other players, and smart and sassy girlfriend, Jules Harbor (Amy Smart), Mox is dissatisfied with his life. He wants to leave Texas to go to school at Brown University. He also dislikes his football-obsessed father (Thomas F. Duffy) and dreads playing football under legendary coach Bud Kilmer (Jon Voight). Kilmer is a verbally abusive control freak whose philosophy can be summed up as \"win at all costs\". He has a strong track record as coach, remarking in a speech that \"in my thirty years of coaching football at West Caanan, I have brought two state titles, and 22 district championships!\" Kilmer's philosophy finally takes its toll on Coyotes' quarterback, Lance Harbor (Paul Walker). It is revealed that Lance, who is Mox's best friend, had been manipulated into taking cortisone shots into an injured knee that finally gave out on a huge sack. Lance is rushed to the hospital, where doctors are appalled at the massive amount of scar tissue found under his knee. Mox, who has accompanied Lance to the hospital, is shocked when Kilmer tells the doctor that he knew nothing at all about Lance's knee problems, when in fact Kilmer ordered the trainer to inject the shots. In need of a new quarterback, Kilmer reluctantly names Mox to replace Lance as captain and starting quarterback. The move brings unexpected dividends for Mox, one of them being Darcy Sears (Ali Larter), Lance's beautiful blonde cheerleader girlfriend, who is interested in marrying a football player in order to escape small-town life. Darcy even goes so far as to attempt to seduce Moxon, sporting a bikini made of whipped cream over her otherwise naked body, but he rebuffs her as gently as he can. Becoming fed up with Kilmer and not feeling a strong need to win, Mox starts calling his own plays on the field without Kilmer's approval. He also finally tells his football obsessed father off at one point screaming at him \"I don't want your life!\" Mox's father had been a football player at West Caanan, and although Kilmer dismissed him as a \"no talent pussy\" he did say that he at least listened (unlike Mox). Kilmer, who becomes aware that Mox has won a full scholarship to Brown, warns Mox that if he doesn't fall in line, he will alter his transcripts in order to reverse the decision on his scholarship. Another friend of Mox's, Wendell Brown, is injured on the field shortly thereafter. Kilmer manipulates Wendell into taking a shot of cortisone to deaden the pain from his injury, allowing him to continue even in the face of a permanent injury. Wendell, who is desperate to be recruited by a good college, grants his consent. At this moment, Mox tells Kilmer he'll quit the team if the needle enters Wendell's knee. Undaunted, Kilmer orders Charlie Tweeder (Scott Caan), a friend of both Mox and Wendell, to take the snaps. Tweeder refuses. Mox tells Kilmer that the only way they'll return to the field is without him. Realizing that he will be forced to forfeit the game, Kilmer loses control and attacks Mox. The other players break up the fight and then refuse to take to the field. Knowing his loss of control has cost him his credibility, Kilmer tries in vain to rally support and spark the team's spirit into trusting him, but not one player follows him out of the locker room. Kilmer continues down the locker room hall, and seeing no one following him, turns the other direction and into his office. The team goes on to win the game without his guidance. In a voice-over epilogue, Mox states that he \"never played football again. Lance went on to a successful coaching career (he did not work at Wal-Mart as feared by Darcy), Wendell received a scholarship to Grambling, Billy Bob cried because he's a bit of a crier, Tweeder drank beer because, well...Tweeder drinks beers. Kilmer retired, never to coach football again. However, his statue still stands only because it was too heavy to move. I took the scholarship and will graduate from Brown University.\"",
      "writers": ["W. Peter Iliff"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0139699/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2OTMxOTQzNV5BMl5BanBnXkFtZTgwMzAxNzQxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Van Der Beek, Jon Voight, Paul Walker | See full cast and crew »"],
      "reviews": [
         "Since this is a teen-oriented film, I must confess that I wasn't expecting this to be very entertaining. However, thanks to a generally intelligent script and a great job by Jon Voight, this turned out to be surprisingly good. As you would probably expect in a teen movie, there are some scenes that seem juvenile and pointless, but thankfully, this film manages to limit these needless diversions. The central story, although a familiar one, is well written and rather interesting. Definitely worth checking out.",
         "If someone checks out the trailer, one might think, \"Another MTV-produced teen flick. I think I'll pass on that.\" Well, I went into the theater not thinking it was going to be bad, but I expected more of an amusing film that isn't really high on ingenuity. True, \"Varsity Blues\" has those standard teen elements like wild drinking parties, the school slut, etc. But it never overuses those elements. It's more of a compelling comedy-drama about football that delivers a fine message about sportsmanship. You have a pretty good idea how it's going to end up, but it's the way it's executed that makes it special. Jon Voight is absolutely terrific as the no-nonsense coach. He's the kind of character you want to stab in the chest every minute he's on screen, and Voight was a perfect choice. The film dabbles with elements of the sport that probably hit home to some high school football players. Voight's character has only one goal: winning. And he doesn't care how he gets to that goal. If he has to shoot drugs into every one of his players, he's going to arrive at that goal. And I'm sure there are coaches out there who have that selfish goal. Then James Van Der Beek comes along, and his character is not really concerned with winning or playing football in the first place. But he likes football, has fun with it and simply wants to play a good, honest game. If the team wins, good. If it doesn't, so what. He has a good locker room speech at the end of the movie. \"Varsity Blues\" is funny, moving and wonderfully acted. It might appeal more to teens and young adults, more than the older ones, but I still suggest everyone check it out.",
         "Good kids vs evil football coach. The only thing that can make such a movie watchable is memorable characters created by good actors, and here is where Varsity Blues succeeds. I love it when I go into a movie expecting to hate it and then end up enjoying it. Give this one a try.",
         "Like a number of other reviewers, I though \"Varsity Blues\" wouldn't amount to much more than \"Dawson Plays Football\", MTV-style. Well, it's not -- it's actually quite good. It deals fairly realistically with the trials and tribulations of Dawson . . . sorry, Mox (James Van Der Beek), the backup quarterback more interested in \"Catcher in the Rye\" than in his own playbook, who is forced to become the starter for his team. The movie's filled with cliches: the town obsessed with the football team; the overweight, goofy lineman; the slutty cheerleader with the heart of gold; the arrogant coach; the teacher straight out of an early 80's Van Halen video; etc, etc. Surprisingly, there's enough twisted and wrinkles thrown into these cliches to make the story seem pretty fresh, if not entirely original. You know how the story's going to end, but you're not always sure how it's going to get there, and that's what keeps it interesting. Van Der Beek is very good, much better that I ever thought I'd give him credit for. Also good: Paul Walker as the original starting quarterback, and Amy Smart as Van Der Beek's smart girlfriend. They played real characters as opposed to stereotypes, and I thought their performances really made the movie. Surprisingly, I thought the weakest link was Jon Voight as the head coach. He was a cardboard villain, no substance to him whatsoever. I kept waiting for the film to explain why he wanted to win so bad, why he'd push his kids with such inhuman cruelty . . . and besides \"because he wants to win\", an answer was never given. Too bad, although I think this was more the fault of the script than of Mr. Voight. It's certainly not the best movie ever made -- for that matter, it's not even the best football movie ever made -- but it's still good. It has heart, and most of the performances make this film a cut above most of the \"Teen Films\" that are out there. A fun rental. B-",
         "From the previews, you would think that this movie is all fluff. But, there is actually a story involved here. Kids trying to be all that they can be despite a winning-obsessed coach (well played by Jon Voight) and pressures by parents and the town. Van Der Beek plays \"Mox\" very well, and there is a great soundtrack. It is better than most of the teen movies this year and deserves a watch.",
         "I'm sure we've all known of, or at least heard of places, where nothing is bigger than high school football. The starting quarterback runs the town, the coach is considered a God (as long as he's winning), and the parents all live vicariously through their children. And most of the time, the kids actually playing football love the game too. But in the small town of West Caanan, the kids are running rampant, and the coach (Jon Voight) doesn't care. James Van Der Beek stars as Jonathon Moxon (Mox), the backup quarterback of the high school football team. And he's happy with his situation. He gets to sit on the sidelines and read, hang out with the cool kids, and basically just wait until he can get out of this one horse town and head off to Brown University. But one day he sees the coach injecting pain killers into the knee of the starting quarterback. Then one of his best friends, Billy Bob, seems to have a concussion, but the coach makes him play. When the starting QB goes down, Mox is handed the team and is forced to decide whether to be the King of West Caanan, or to live his life the way he wants it to be lived. I guess it wasn't a bad movie. The football scenes were done extremely well, and I generally liked the people I was supposed to like, and didn't like the people I wasn't supposed to like. But the movie lacked a certain focus. There were too many other things going on that didn't seem to have anything to do with the movie. The whole stripper/teacher thing didn't do anything but make me think back to my high school years and realize I didn't want to see any of those teachers naked. Then there was the black running back who claimed that the coach was a racist. He said that whenever they got near the goal line, the coach would always give the ball to a white guy so he could soak up the glory. While that may have been true, there was nothing in the movie to show that the coach was a racist. The only thing in the movie that said he was a racist was the black player saying he was. The whole race issue seemed to be thrown in there just for the sake of having it, rather than serving any purpose. Some of the characters were too stereotypical. Mox's girlfriend for instance. As soon as Mox became the starting QB, his life started to change. In the town of West Caanan, starting QB was a position of popularity. But instead of letting Mox enjoy himself, even for a second, she started telling him he had changed. I figured that was going to happen, but don't you think a girlfriend would allow her boyfriend to enjoy his moment in the spotlight for just a few minutes before telling him he's not the man she fell in love with? Jon Voight's character was another one. I never played high school football, so maybe that's the way a coach is, but actually willing to ruin a kids life by making him play with a serious injury? And actually choking another player? I thought that his character went a little too far. It made him look extremely bad when that point had already been made. My last rant has to do with the character of Darcy. She was the cheerleader who was dating the starting QB. As soon as he got injured, she started hitting on Mox. When she finally got him to come over to her house, he resisted her. Then she broke down and cried, and Mox solved all her problems in a few seconds. Much too quick a resolution for her. But I must say, I'll never look at whipped cream the same way again. Overall I did enjoy Varsity Blues. It was fun to watch, even though it had a lot of script problems. The actors seemed to be having fun with their roles, and that made the movie better. So even though it had a lot of problems, overall it was enjoyable. And now, I'm off to find some whipped cream.",
         "May contain spoilers: Even though my experience differs in the type of sport, I can completely relate and appreciate what the core of this film is about. And that is the compulsive, hereditary, obsessive behavior that peers and parents have towards their kids playing sports. I have lived in Canada all my life in what would be considered somewhere in between a city like New York and a town like West Canaan. Take a look at Springfield Illinois (pop. about 300,000) and that is about the size of the cities that I have grown up in. And when I have been to and played hockey at local small rinks, parents become stupid. They yell at the refs, there is sometimes the threat of violence and really it is sheer luncacy that prevails at events like this one. Is it that they try to live vicariously through their kids? That they want to see their kids do something that they never could? Besides Kilmer being an idiot and a control freak in the film, I thought Varsity Blues' central issue was to show how obsessed we all are when it comes to sports and our kids achieving greatness, at any level. Varsity Blues is a great film. And what I enjoyed most about it was the acting and the football scenes. James VDB shows that he is capable of playing someone other than Dawson Leery. And his range in here is perfect. It also has to be mentioned that if this film was taken more seriously than it was, then I really think that John Voigt would be up for an Oscar nomination for his role as the control freak Bud Kilmer. He is the embodiment of an American football coach that seems to care only about his reputation and not his player's welfare. His southern, red neck twang, his pretencious gum chewing, his snarl when he barks orders and his domination of the entire town just by a simple comment made in a local diner shows how versatile and understanding of an actor that Voigt is. Coincidentally, I had just rented Anaconda two days before I saw this on Viewers Choice, and I was truly amazed at the range by Voigt. He really is terrific in this film. I also have to mention Ron Lester who plays Billy Bob, the guargantuanly over weight line backer with a heart of gold. At first when we meet him he is a caricature of every other over weight star athlete. He eats fatty foods like they were going out of style, he is the life of the party as he pukes and then comes back for more and he is one of the guys. But later in the film we see his character grow. There is more to his character than we initially see, and when he is given an opportunity to act, he is perfect as we see how he feels and how hurt he is. This really should be a breakout role for him. Varsity Blues has some of the best football action I've ever seen filmed. The plays are realistic looking, the hits are violent and the symmetry of the completed plays are awesome to watch. This is a film that makes you feel like you are really watching a high school football game. There is really nothing wrong with Varsity Blues and if you enjoy highschool themes like relationships and humour then you will probably love this film. And there is one more thing to love about this film, well two actually, if you are a guy that is. Ms. Davis and Darcy Sears. That whip cream bikini is something I'll never forget. What a dish.",
         "This is an unpretentious and entertaining movie about high school football in a small Texas community. OK, so we know who will win the Big Game, and that the Hero won't sell out to the mean and selfish 23-District-Championships-Coach (Jon Voigt). The movie is well paced and a pleasant diversion; (many in the audience actually applauded at the climactic scenes in the final moments). What I find most interesting about the fact that this film was produced in association with MTV, is that for a Network ostensibly dedicated to iconoclastic themes and attitudes (i.e., anti-establishment and counter-culture), this movie is remarkably \"old-fashioned\" in the adherence to values espoused by the hero. After he becomes the starting quarterback, he resists the come-ons of his predecessor's beautiful girlfriend, and he will sacrifice his own scholarship to Brown University (an Ivy League school in Rhode Island for those of you not familiar) rather than let another player be used and potentially physically damaged by the unscrupulous coach. Some of the scenes are reminiscent of other football films: The Longest Yard, All the Right Moves, North Dallas Forty, and so on, but I guess there are no real surprises these days after decades of the same essential stories in Hollywood. This is not just a \"football movie\" or a \"guy movie\" however, and it's well worth a look.",
         "Having played football in West Texas for a 3-A dynasty team, this movie brings back the memories and the nightmares that a dynasty town can give. The scene with the convience store clerk giving Mox the beer is a regular thing as far as the players getting \"special\" treatment. The attitude of the players and coaches seem real. For a glimpse inside the fame Texas football attitude, this is the movie to watch!",
         "Varsity Blues is a very predictable football drama that is very similar in tone and style to 2004's Friday Night Lights. While I like that film better, this is not a bad film at all. I was still able to root for and against some characters. This movie does a good job at holding my attention and bringing back some good high school memories. Brian Robbin's film is about a Texas football team in the town of West Canaan. After the star quarterback is injured, the back up guy, Moxon is forced to deal with his relentless coach Kilmer, his disapproving girlfriend, and his football-loving parents while starting in his new role that is all strange for him. The acting is pretty good. This is the first time I saw James Van Der Beek on film because I refuse to watch Dawson's Creek, but he does a pretty good job. Jon Voight gives a masterful performance as Kilmer and he just made me despise the character. Paul Walker does a good job and he does not even drive any cars! Overall, this may be a clichéd sports film, but there are some subtle differences such as scenes involving whipped cream, religious little brothers, and a health teacher who is much more than that. Despite some flaws, I couldn't help but root for the Moxon kid. I rate this film 9/10."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "Sport"
      ],
      "productionCompanies": [
         "MTV Films",
         "Marquee Tollin/Robins",
         "Paramount Pictures"
      ],
      "summaries": [
         "In small-town Texas, high school football is a religion. The head coach is deified, as long as the team is winning and 17-year-old schoolboys carry the hopes of an entire community onto the gridiron every Friday night. In his 35th year as head coach, Bud Kilmer (Jon Voight) is trying to lead his West Canaan Coyotes to their 23rd division title. When star quarterback Lance Harbor (Paul Walker) suffers an injury, the Coyotes are forced to regroup under the questionable leadership of John Moxon (James Van Der Beek), a second-string quarterback with a slightly irreverent approach to the game. \"Varsity Blues\" explores our obsession with sports and how teenage athletes respond to the extraordinary pressures places on them.",
         "In the town of West Canaan, Texas, football is a way of life but for Jonathan \"Mox\" Moxon(James Van Der Beek), he has just about enough of it. Pressured by his father to play since childhood, Mox has barely ever seen some football action being a second string quarterback. But after the first string quarterback Lance Harbor(Paul Walker), is seriously injured, Mox is brought in to finish the season and win Coach Bud Kilmer's(Jon Voight) district championship. Mox begins to realize the toughness and hardship of being a starter, but with tough things comes rewards and to Mox's suprise he finds out that him being starter brings more than he can handle, like popularity, women, etc."
      ],
      "budget": 16000000
   },
   "movielensId": 2447,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-15",
      "dvdReleaseDate": "1999-06-29",
      "directors": ["Brian Robbins"],
      "runtime": 106,
      "movieId": 2447,
      "title": "Varsity Blues",
      "mpaa": "R",
      "actors": [
         "James Van Der Beek",
         "Amy Smart",
         "Jon Voight",
         "Paul Walker",
         "Ron Lester",
         "Scott Caan",
         "Ali Larter",
         "Richard Lineback",
         "Thomas F. Duffy",
         "Joe Pichler",
         "Brady Coleman",
         "Eliel Swinton",
         "Tonie Perensky",
         "Jesse Plemons"
      ],
      "imdbMovieId": "0139699",
      "originalTitle": "Varsity Blues",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["eSnkWiacUW4"],
      "plotSummary": "In small-town Texas, high school football is a religion, 17-year-old schoolboys carry the hopes of an entire community onto the gridiron every Friday night. When star quarterback Lance Harbor suffers an injury, the Coyotes are forced to regroup under the questionable leadership of John Moxon, a second-string quarterback with a slightly irreverent approach to the game.",
      "tmdbMovieId": 14709,
      "avgRating": 3.09083,
      "releaseYear": "1999",
      "numRatings": 3380,
      "posterPath": "/nnVA3Nmry9furen0NDmJa0QTn2F.jpg"
   }
}