{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "teleportation",
            "id": 3822
         },
         {
            "name": "hybrid",
            "id": 9410
         },
         {
            "name": "fly the insect",
            "id": 181304
         }
      ],
      "imdb_id": "tt0051622",
      "video": false,
      "title": "The Fly",
      "recommendations": [
         38126,
         11071,
         10787,
         10785,
         18573,
         28501,
         17965,
         13666,
         11773,
         3079,
         25319,
         25508,
         29056,
         18990,
         229,
         26857,
         3019,
         29778,
         23439,
         15856
      ],
      "backdrop_path": "/xjZ3B2koYKziDJ6PilXvS3YTYKG.jpg",
      "revenue": 3000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andre Delambre",
               "gender": 2,
               "credit_id": "52fe448a9251416c750386d1",
               "name": "David Hedison",
               "profile_path": "/dt4b6bS4KPrvo7ez2z6zawVmWgj.jpg",
               "id": 10226,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Helene Delambre",
               "gender": 1,
               "credit_id": "52fe448a9251416c750386d5",
               "name": "Patricia Owens",
               "profile_path": "/nsCjG8tobJl0Giq0gL1PxRH6xUb.jpg",
               "id": 70564,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "François Delambre",
               "gender": 2,
               "credit_id": "52fe448a9251416c750386d9",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Insp. Charas",
               "gender": 2,
               "credit_id": "52fe448a9251416c750386dd",
               "name": "Herbert Marshall",
               "profile_path": "/jLi1edH2FEV3Hrmoa3j7QwYcaDx.jpg",
               "id": 2435,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Emma",
               "gender": 1,
               "credit_id": "52fe448b9251416c7503870b",
               "name": "Kathleen Freeman",
               "profile_path": "/wdNFoCWk58bgTRxoqPV8uN9UoGO.jpg",
               "id": 7210,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Nurse Andersone",
               "gender": 1,
               "credit_id": "52fe448b9251416c7503870f",
               "name": "Betty Lou Gerson",
               "profile_path": "/sqapDTfgfIy6j0KHJTjzPaPzMJ8.jpg",
               "id": 71779,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Philippe Delambre",
               "gender": 2,
               "credit_id": "52fe448b9251416c75038713",
               "name": "Charles Herbert",
               "profile_path": "/woclDa0yA6Lvts1iVx2U5dYG8ox.jpg",
               "id": 16764,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Lady at the Ballet (uncredited)",
               "gender": 1,
               "credit_id": "557fc2849251412f1d000fc0",
               "name": "Bess Flowers",
               "profile_path": "/akbW8jJl8GSXFpixFaobMOqvNv4.jpg",
               "id": 121323,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Gaston",
               "gender": 2,
               "credit_id": "56872cbb9251417e15008ad7",
               "name": "Torben Meyer",
               "profile_path": "/aEVmODp4Fv3TxaDiNpoIJC5ubx7.jpg",
               "id": 12153,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe448a9251416c750386e3",
               "name": "Kurt Neumann",
               "profile_path": "/3UasYzc5eQOpFZzzSHnwzSTjVRs.jpg",
               "id": 70565,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe448a9251416c750386e9",
               "name": "James Clavell",
               "profile_path": "/1Afyy3wKJ16fdMZgOm9PnWrlmJr.jpg",
               "id": 46611,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe448a9251416c750386ef",
               "name": "Robert L. Lippert",
               "profile_path": null,
               "id": 70567,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448a9251416c750386f5",
               "name": "Paul Sawtell",
               "profile_path": null,
               "id": 4681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe448a9251416c750386fb",
               "name": "Karl Struss",
               "profile_path": null,
               "id": 9081,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe448a9251416c75038701",
               "name": "Merrill G. White",
               "profile_path": null,
               "id": 70568,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe448b9251416c75038707",
               "name": "Kurt Neumann",
               "profile_path": "/3UasYzc5eQOpFZzzSHnwzSTjVRs.jpg",
               "id": 70565,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 10.106296,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11815,
      "vote_count": 157,
      "budget": 700000,
      "overview": "In Montreal, the industrial François Delambre is called late night by his sister-in-law Helene Delambre. She tells him that she has just killed her beloved husband Andre Delambre, using the press of their plant to press his head and left hand. François calls his acquaintance, Inspector Charas, and later the reluctant Helene is convinced to tell them what happened. She explains that Andre had invented a matter transportation apparatus, and while experimenting with himself, a fly entered the chamber, exchanging one hand and the head with him after the transference.",
      "similar": [
         1694,
         3034,
         9426,
         9738,
         52520,
         126889,
         399055,
         384521,
         336843,
         300668,
         9383,
         3079,
         22825,
         4961,
         18111,
         36647,
         2164,
         1487,
         196,
         1724
      ],
      "original_title": "The Fly",
      "runtime": 94,
      "poster_path": "/jA6GYQDuR0RV99sWcjCzz8gcbHB.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1958-07-16",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/1MMTGpmm0E9yXRTNyW0YebAs66S.jpg",
         "name": "The Fly (1958 series)",
         "id": 123213,
         "poster_path": "/if9PkF46yCeMp9WTYhUOjxnytAt.jpg"
      },
      "tagline": "If she looked upon the horror her husband had become... she would scream for the rest of her life!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kurt Neumann"],
      "runtime": 94,
      "synopsis": "The 1958 version of The Fly, written by James Clavell, based on a short story by George Langelaan, opens with title and credits shown over a screen with a small hole. We zoom in progressively until the hole fills the screen and a fly crawls into frame. The opening scene is at night, outside the factory of Delambre Freres Electronics in Montreal. A cat, Satan, is picked up by the night watchman, Gaston (an uncredited Torben Meyer). He starts his rounds. He hears the sound of a hydraulic press starting. Gaston sees a smartly dressed woman, who he later recognizes as Helene Delambre (Patricia Owens), stare at him in surprise. She runs away. He approaches the press and notices, in horror, that it is covered in blood. A body lays crumpled on the floor next to the press. He recoils in horror and screams. A phone rings in the home office of Francois Delambre (Vincent Price). His sister-in-law, Helene, is calling. She calmly tells him, \"Francois, I've killed Andre. I need your help.\" Francois thinks it is a cruel joke but changes his mind when Helene breaks down sobbing and implores him to, \"Call the police and come quickly.\" Before he can leave his office, there is another call, this time from Gaston at the factory. Gaston reports a murder. Francois calls an acquaintance at the Anthenium Club, a fellow member, Inspector Charas (Herbert Marshall). He reports the crime, then waits for Charas to collect him at his home. As Charas and the police examine the crime scene, an ambulance team collects Andre's body. Francois raises the press so what is left of the body can be removed. It is noted that the press was set to zero and single strokes. Francois positively identifies his brother based on a scar on his left leg--war wound. Francois is baffled by the crime. Francois and Charas go to see Helene at home. Emma (Kathleen Freeman), the housekeeper, meets them at the door. Dr. Ejoute (an uncredited Eugene Borden), the family doctor, reports that she is calm and admitted to the crime. They enter the living room to confront Helene Delambre. She is very calm and volunteers, \"I killed my husband, Andre Delambre, about half an hour ago in the hydraulic press shed.\" She admits to killing him, but when asked why she is adamant, \"I cannot answer that question.\" She provides specific details of the crime, then offers Charas coffee. She is polite and answers all questions except one--WHY. She hears the buzz of a fly in the room. She gets up and searches for it. She registers relief when she finds it on a lampshade and it is only an ordinary fly. She returns to the couch and more questions from Charas. Charas makes arrangements with the doctor to provide a police nurse to attend to Helene. Before he leaves, Charas asks Francois to show him the lab. Francois discovers the lab a shambles. Charas tells Francois that he is baffled and, \"There appears to be no motive, no reason except insanity.\" Charas suggests Francois take charge of his nephew for the time being. The police nurse, Andersone (Betty Lou Gerson) brings Helene her lunch, then takes her pulse. She sits and occupies her time with her reports and needlepoint. Helene makes a point to mention her son, but pretends she does not know him. The nurse registers mild surprise, then makes a note on the chart. Helen starts eating, then stops when she hears a fly buzzing in the room. The nurse bats at it, much to Helene's shock and concern. The nurse rolls up a newspaper and chases it around the room. She becomes hysterical when the nurse swats it by the window. Helene collapses and is helped back to bed sobbing. The nurse collects the dead insect and gives it to Charas. Charas asks Francois, \"Mr. Delambre, do you think shes mad?\" \"It's obvious, isn't it?\" is the reply, but Charas surprises Francois with his conclusion. \"In spite of what the doctors think. I believe Mrs. Delambre's mind is quite clear. Even when catching flies.\" Charas intends to charge Helene with murder, the warrant will be issued the next day. Francois is having dinner with his nephew, Philippe (Charles Herbert). When asked about the life expectancy of flies, Francois responds that he doesn't know. Philippe volunteers that he found the special fly his mother was looking for--one with a white head and leg. The discussion intrigues Francois, especially the mention of it being in his study. He calls Charas, but decides not to talk to him. He goes to his brother's house, and lies to the nurse to secure a visit with Helene. He convinces Helene he has the special fly and wants the whole story. He finally convinces her to come clean, but before she recounts the tale she insists Charas be present. She demands Francois promise to kill the fly he claims he has. Charas arrives and she tells her story. It started a few months earlier. She and her son are playing in the living room when her husband, Andre (David Hedison as Al Hedison) appears. While Philippe plays with the family cat, Dandelo, Andre and Helene go to the basement lab. Andre proudly shows her all the new equipment. He demands secrecy, then shows her his new line of research. He places an ugly green plate, a wedding present, in a glass and metal container. He fires up the machine. The room goes dark, and the container glows a bright blue, then a flash of light and the equipment powers down. Helene is surprised by an empty container. They walk to another room and the plate is now in an identical container. Andre explains the concept to his disbelieving wife. She chuckles, noticing that the matter transference device has one little flaw. Helene points out the \"Made in Japan\" stamp on the bottom of the plate is mirror-imaged. Andre returns to his desk and begins a review of his work. He recalculates, rechecks and retests. This time with a newspaper, the transfer is successful. Andre decides to run a test with the family cat, Dandelo. The saucer of milk transfers fine, but to his horror the cat fails to appear. He hears only the plaintive echo of the cat's cries in the room. Helene is preparing to go out for the evening. Andre appears. He has been busy in the lab for weeks and insists they go out to celebrate. They return to the lab very late and Andre shows his wife the improvements he has made to the equipment by transferring a bottle of champagne. The label is perfect and the wine is still cold. He then transfers a guinea pig, against his wife's objections. The animal appears fine after re-integration. Andre confesses that his first live animal experiment, Dandelo, was not successful. Helene expresses her concern about the technology, \"It's frightening. It's like playing God.\" It has been a month and the guinea pig is fine. Andre is relaxing out in the garden. Helene joins him. She tells Andre that Francois is coming to lunch. Andre is excited and tells his wife, \"Bring him down to the lab. We'll show him now.\" Francois and Helene go down stairs to the lab, but encounter a note on the locked door instead of a welcome inside. It says, \"I am working. Do not Disturb.\" Francois comments about the bad penmanship. Philippe enters the house. He excitedly tells his mom, \"I caught such a funny-looking fly. You want to see it? It has a funny white head and sort of white leg.\" His mother tells him to let it go at once. A report from Emma about Andre not touching his dinner does not alarm Helene. She walks down to the lab to check on her husband. She picks up a note that was slowly pushed under the locked door. She reads it aloud, \"Helene, I've had some trouble. I've had a serious accident. But I'm not in danger at the moment, although it's a matter of life or death. It's no good calling to me or saying anything. I can't answer. I can't speak.\" He asks for a bowl of milk laced with rum. She prepares the concoction and returns to the lab, knocking three times to gain entry. Andre lets her in. A note explains that he needs her to find a fly with a white head. She remembers Philippe's find from earlier that day. Andre has a black cloth covering his head and keeps his left arm hidden in his lab coat pocket. He slurps up his milk while Helene searches for a fly she knows is not there. She recounts the story her son told her. Andre gets up and his fly arm is revealed. Helene screams. Andre motions her out of the lab, then locks her out. He types the next set of instructions for his wife. The next morning Helene wakes. She thinks the whole episode was just a nightmare, but her morning meeting and typed note confirms the nightmare is real. Andre explains that his experiment by transmitting himself the first time was successful. A second try was not so. The note explains, \"But in the second experiment, a fly which I did not notice was in the disintegrator with me. When we integrated again, our atoms were mixed. Now my only hope is to find the fly. I've got to go through the machine once more and pray our atoms untangle. If you can't find it, I'll have to destroy myself.\" Helene asks to see her husband's face, but he refuses. Helene tells Emma that they must find a fly. She presses her son into service to find the special fly. Helene screeches at Emma, who misunderstood the request and killed a fly with a swatter, \"I said catch them! Dont kill them!\" After Philippe returns with no luck, he and his mother spot the fly on a lamp shade. The head and one leg are indeed white. They carefully approach it, but it flies over to the window. Helene puts out some sugar to attract their prey. Philippe catches it, but it escapes the net. It escapes outside through a broken section of the glass. It is now outside and Helene and Philippe search for it. Helene is exhausted and exasperated. She returns to the lab and tells her husband of their bad luck. While he attempts to eat, she reads his next note, \"If you had caught the fly, you would not be reading this. I know you will never catch it now. It's hopeless. There are things man should never experiment with. Now I must destroy everything, all evidence, even myself. No one must ever know what I discovered. It's too dangerous. I've thought of a way. It's not easy, but I need your help.\" She pleads with her husband not to destroy himself. She convinces him to transmit himself one more time, even without the fly. Transmission is successful, but without the fly, he is the same. She pulls the black cloth away, then shrieks with horror at the visage. Andre has the head of a fly. We see Helene as Andre now sees her through compound eyes. She backs away from Andre and faints. He picks her up and places her on the couch in the lab. He comforts her with his good arm and hand, but can't control his fly arm that means to harm his wife. He goes on a rampage and destroys the delicate electronic equipment. He burns all his notes. Helene wakes and approaches her husband. She recoils from Andre as he approaches her. He retrieves the black cloth and puts it back over his head. He erases the blackboard, then scribbles another note to Helene, \"No use now--help me--but don't come near me. Kill fly, please. Love you.\" She follows him to the factory next door. He starts the press and points to the red button. He places his head and arm under the press then motions for her to start the press. The press crushes Andres fly head, but his arm is still untouched. She resets the press, places his fly arm on the bed, then directs the press down a second time. The story is finished, and we are back in the present. Charas is told Andre destroyed his notes, but she erased his note on the blackboard. Charas thanks her for telling the story. Francois and Charas prepare to leave the house. Charas promises, \"I'll be back at 10:00 with a warrant for her arrest on the charge of murder. Nurse Andersone is under strict instructions not to leave her for any reason. I'm satisfied now. She's quite insane. She won't hang.\" Charas provides a glimmer of hope to Francois, \"Show me the fly.\" The next day Francois returns to the house and asks Emma about the fly. She tells Francois it was just a fly. Francois sits on a bench in the garden, oblivious to the fly caught in a spider's web. It cries out for help, but Francois cannot hear it. It is now 10:00 a.m. and Charas has returned, as promised, with his warrant and an ambulance to transport Helene. When told of her arrest, Helene reacts by asking Francois to show the inspector the fly. Francois admits he never had the fly. Francois takes Philippe outside so he can't witness his mother's arrest. He mentions he saw the fly again, \"It's in a web. A spiders going to get it. By the bench in the garden.\" Francois retrieves Charas. They walk out into the garden. Charas and Francois see the tiny arm and head on a fly's body and the spider ready to pounce. The tiny thing screams, \"Help Me!\" As the spider covers its tiny victim, Charas picks up a rock and crushes both. Francois accuses Charas that if Helene killed a man with a fly's head, then he is as guilty for killing a fly with a man's head. They collectively concoct and agree to a scenario for suicide. Sometime later, Philippe and Helene are playing croquet in the yard. Francois arrives to take his nephew to the zoo. In reply to his nephew's query about his father's death, Francois tells Philippe, \"He was searching for the truth. But for one instant, he was careless. The search for the truth is the most important work in the whole world and the most dangerous.\" We close with Helene escorting her son and Francois out of the yard.",
      "writers": [
         "George Langelaan",
         "James Clavell"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051622/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM2MzgyNTIzMV5BMl5BanBnXkFtZTgwNTg1Mjc1MDE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: David Hedison, Patricia Owens, Vincent Price | See full cast and crew »"],
      "reviews": [
         "1958 and 'The Fly'. Who could ever forget it. At the age of 9 or so, I was a horror movie veteran, or so I thought. I would attend the Saturday matinees of a local theater, armed with my THIRTY FIVE CENTS, which was good for an admission, a huge coke and a Butterfinger as long as my forearm. The theater was, as usual, very dark and of the 3,000 seats, 2996 we unoccupied, the norm on a Saturday afternoon. The sunset times had been carefully memorized as to not be foolishly caught in the dark walking home from a horror flick. In spite of the subtle warnings from a couple of neighborhood kids who had already seen 'The Fly', I remained confident, having survived several movies, including 'Them' and 'The Invisible Man'. The movie was terrifying enough, but nothing in my 9-year old brain prepared me for the absolutely numbing terror that assaulted my senses at the end of the movie. My 16 oz. cup, containing now only ice left my grasp and clattered noisily on the cold floor and the last vestige of the sticky Butterfinger froze in my open mouth as I was transfixed on the terrifying ending. I knew that I was in trouble. I walked the 3/4 mile home, BACKWARDS and in the middle of the street as to not encounter any bush or shrub, ALL of which I was sure contained the nightmarish image that was forever burned into my brain. Now I understood why none of the kids who had seen the movie boasted or talked about it, they were still too terrified. 10/10 for terror.",
         "The \"help me, help meeeee\" scene revolted and scared me so much as a young child that it was years before I could see this movie again. Even now I cringe when I witness that nightmarish scene. As good as Cronenberg's movie is (and it is very good), there is nothing that surpasses the delirious horror of the man-fly in the spider's grasp. Elsewhere, the movie is rather subdued. In some spots, almost too much so. Although the first revelation of The Fly's appearance is another classic spot...the multiple reflections was a great touch. Like all great monsters, the Fly has a very sympathetic edge to it. We are revolted by the horror of this monster but we feel overwhelming pity for him as well. Vincent Price does a workman-like job in a rather blasé part. Usually he adds a special touch to a film, but really, any number of actors could have played his part here. The scientific basis of this movie is pure rubbish, as there is no way that insect and human parts could biologically interact with each other. The result of such a mixture would be instantly dead in real life. But that doesn't matter here. A nightmare has its own logic. And \"The Fly\" is a nightmare.",
         "It's been said again and again that this is a good horror film. A Very Good film. But it is more than that. I can still hear with my mind's ear (is that right?) the sound of the hydraulic press \"WHUMP\" and the echo. Then again that \"WHUMP\" ... is there another sound experience that reverberates through a movie like that? Sure, surround sound, THX, all that tech stuff, but the sound as the manifestation of the crime that encircles this story, the horror as the mind tries to put together the images that (finally) is seen in a flashback as this scene bookends the start and \"finish\" of the plot. The inner struggle of the scientist as he fights with his human hand to control the spasms of his \"fly\" arm is both horrible and heart-wrenching. The shock as the cloth is torn away from the scientist's head... the fly's POV shot with facets and mirrors of the the screaming face of the scientist's poor wife! The scene at the spider's web as the shrill voice begs \"help me... help me\" The horror of murder of a man/thing and a thing/man being shown and even compared in sharp (but obvious) dialogue. You MUST see this and experience the earlier days of horror -when classics like this, like \"The Thing From Another World,\" like \"It, the Terror From Beyond Space\" (the original model of Alien) exhibit a freshness and a palpable terror that remakes cannot capture, whatever wonderful special effects are thrown in to add to the creepiness. Sure these later gorefest horror films are good. I buy them all the time. But they are a different genre. The Fly with Vincent Price is NOT the same story as The Fly with Jeff Goldblum. It's not really a remake as a retelling. See the original. It is rich with emotion and intelligence, not to mention some pretty fine acting for what was really a \"B\" movie.",
         "The Fly is a movie I have just been dying to see, I have heard a lot about this movie, mainly the infamous \"Help me! Help me!\" scene. But of course the number one reason being that this is the original to the remake with Jeff Goldblum which is an incredible movie in itself, but I was curious what the original would be about. Honestly I was thinking that it was going to be very cheesy, it's a 1950's horror movie that would probably be over the top, but honestly, from the very beginning you get gore, which was odd, but sickly enough I love it! I am also a huge Vincent Price fan, this is the man of the classic B horror movies and his voice and presence make these movies worth the watch. So I finally got to see this on netflix, I absolutely loved The Fly. Is this better than the remake? Honestly, the remake is more realistic on what would happen if this really did occur, but don't overlook the original, as cheesy as a fly in a giant trench coat can be, it's all good and this story is tons of fun and really scary. A woman named Helene Delembre phones her brother-in-law, Francois Delambre to tell him that she has just murdered her husband. Francois calls in the police and she admits killing him but refuses to say why. Later, Francois tricks her into telling the story to him and Police Inspector Charas. A scientist, Andre Delambre, has invented a teleportation device. After a few failed attempts, he succeeds with living organisms, deciding to go for the ultimate risk and transport himself. The first time works, but, unknown to him, a fly enters the cabin with him and the two are hopelessly scrambled together. The scientist emerges as a half-man, half-fly, a human with a fly's head, leg and arm/claw. His wife finds out something is wrong as she now sees him with a cloth over his head and a hidden arm. He eventually tells his wife what has happened and she first sees his claw and screams, then later sees his fly head and screams more. His wife, son and maid try to find the \"fly with a white head\" and fail. The son had caught it just after the accident but had been made to let it go, before any of them knew what it was. Andre attempts to reverse the process to return himself to normal, but fails and when he realizes that his mind is being overtaken by that of the fly he asks his wife to end his suffering by killing him with a heavy machine press. The Fly is a fantastic and thrilling movie. I know that the ending sequence of \"Help me! Help me!\" was cheesy and over the top to some, but to me it was just plain creepy, it really scared me. The whole atmosphere of the film just felt uncomfortable and disturbing. Granted, I know these were not top of the line make up effects with the fly, I do have to laugh juts a little bit with seeing a fly in a trench coat. But still it was effective and made for a great sci-fi story. I love these old movies for a specific reason, this was the time when film meant something to the cast and crew making it and The Fly was made to give people the chills. It's just rare now-a-days, if this was made in today's world, it would be all gore and just stupid. So I do recommend that you see this film if you are looking for a good scare. Both this and the remake are terrific films and are a ton of fun to watch. 8/10",
         "in terms of creepiness, this flick takes a back seat to no horror film. the goldblum et al remake is a gory over-the-top, special-effects show-off in comparison. instead this one grabs your psychological neck, shakes it about and forces you to answer serious questions regarding the scientific exploits of man. while doing so it hermetically seals you in a world of misguided, pitiless hubris. if that sounds like a bit too much, just give it your time and try to go to sleep without thinking, \"why the hell would anyone proceed so far\" and without thinking of ways to save the poor, doomed scientist. it is a tale of inevitability and loss that brings into stark contrast the foolish doings of man against a backdrop of an inhumane and unforgiving nature. view at your own risk... do not view at your own horror- enjoyment's peril!",
         "As a child in the theater I screamed and had bad dreams.... Then as a teenager I watched the \"Fly\" on TV and still Jumped back in fear at the sight of that horrible face! A few years later my friends and I watched it on TV again, but this time I turned down the sound at the scary scenes ( theorizing that the music was the cause of the fear) but even at low volume the haunting cries of \"Help me...Help me\" gave me the chills. A MUST SEE DF.",
         "Never thought that a movie involving people chasing a fly for half of the time could be so fascinating! \"The Fly\" is a genuine horror / sci-fi classic and fundamental viewing for everyone who was ever interested in either of these (or both, of course) genres. The whole premise of this milestone is silly and incredibly grotesque, yet very disturbing and it's brought to an even higher quality-level by the top-class performances of a devoted cast. Hedinson stars as the brilliant scientist Andre Delambre who discovered a method to transfer matter from one capsule to another and \u0096 convinced of his safety \u0096 he uses himself as a guinea pig to test if it works with humans, too. Terror begins when an ordinary housefly accidentally makes the transfer with him and the two beings exchange heads and a limb. Slowly going mad, Hedison has to beg his wife Helene to destroy what's left of him and his invention, because it's too dangerous for the world. One of the reasons why this film is so compelling is because of the ingenious structure. The story opens with Hedinson's brother (another great role for Vincent Price) receiving a call from a hysterical Helene who claims to have killed her husband and, for a long time, we're left in the dark whether she committed an act of madness\u0085or a favor to her husband. \"The Fly\" contains several classic scenes (in one way or another, everybody must know about the \"spider-web\" finale by now) and the special effects are more than satisfying. Great film! Terrific entertainment!!",
         "After killing her husband Helene Delambre recounts the story of why she done it. Her husband was a scientist who was deeply into his work and through those long days and weeks he makes a big breakthrough in science by inventing a teleportation machine that can transmit matter from one spot to another. After some glitches he fine tunes the device and decides to test it by using himself as a guinea pig. While, in the process of this test, a housefly gets caught inside with him and when he emerges from the other capsule he shares its genetic structure and physical attributes. \"The Fly\" is classic Sci-Fi / horror from the 50s and what a nice surprise this was! Unlike many of its kind in the 50s, this one didn't have a childish feel. The context may seem silly here, but its executed with enough skill and handled in a relax manner by director Kurt Neumann to set above the rest. Just don't be expecting a monster on the rampage tale. This one veers more towards a much more broaden and imaginative story with a certain eeriness contained in its psychological material rather than visuals. Even though it doesn't scare you witless, it still does provide a couple of memorable and ingenious shocks that are hard to put out of your mind. The film opens with the horrific outcome of Helene's husband Andre and then it goes into flashback mode where we learn the fate of Dr. Andre Delambre. What does make it surprisingly good is that we're treated with such passionately vivid characters and a interesting set-up that pulls you in by taking a more serious approach with a dabble of irony along the way. The talkative first hour slowly builds up to its taut last half-an-hour, where we get a smart and venomously bleak climax. Although, it could have done without that preachy conclusion. The rational script by James Clavell works by being incredibly dense with it thriving on some quick wit and sincerity. The story is more about a woman trying to save the man she loves as he slowly fights the genetic effects of the fly's DNA. He may seem hideous on the outside, but inside he is still more so human and he's trying his best to keep control of his dieing humanity. This is proved by how much he cares for his family's safety when he's willingly to take his own life for the best of everyone. It's practical story telling at its best. The look of the film is top shape with it being shot in vibrant Technicolor and the key is that the deformity is kept hidden, but when it's revealed it actually stands up rather well. It's ugly, that's for sure, but still it looks rather competent. They're also an inventive touch when we see the creature for the first time with multiple frames being used to represent the reflection from human fly's eyes. In Cronenberg's version we see the grotesque transformation, but because of the times and effects we don't see it here, but more so the aftermath of the mishap. All of the devices and gadgets in Andre's lab are well presented and the mounted score adds in a forceful touch with nice crisp sound effects. The performances are more than great by the likes of Al Edison, Patricia Owens, and Herbert Marshall and even though Vincent Price had a supporting role, you'll be in awe of his effortlessly suave performance. An excellent classic of its field that's more concern about telling a moving and fascinating story than just giving us pointless action and cheap thrills to spice up proceedings. The more you stick it out, the more compelling it does become.",
         "A slick, clever, engaging and unique (if a bit slow-paced at first) sci-fi story. Although the special effects leave something to be desired, especially if you've seen the incredible (and incredibly nauseating) images of the 1986 remake, the film's restrained approach to horror can be very pleasurable if you get used to it, and the script is stronger and more character-driven than the one of Cronenberg's version. A surprisingly good film. (***)",
         "No need to recap the plot. As I recall, this sci-fi epic played at our uptown theater, where prestige pictures normally played. Usually, we teenagers had to go to a drive-in to catch these 50's monster movies. But this one was produced by big-budget TCF and in Technicolor, unlike the usual Roger Corman low-budget b&w's. Plus, it got promoted more heavily than the usual under-the-radar sci-fi. I suspect big-budget MGM's success with Forbidden Planet (1956) had something to do with TCF's decision to join the swim. On the whole, it's a good entry from that period, more carefully thought out than most, with a name cast, well almost. Patricia Owens (the wife) may not be a household name, but she does do a heckuva job in putting the material over. She's the pivotal character, and it's her range of reactions that almost make the premise believable. Plus, it's a very cleverly structured screenplay, hooking us right away and then explaining the mystery through flashback. On the downside is the rather bland Hedison. Seeing him now, after so many years, he doesn't seem the driven-genius type, his casting likely a gesture to commercialism. A lot of folks find the climax amusing. And while the special effects are not very good, the idea itself is pretty effective as tragic outcome. On the whole, the movie may not reach the sustained intensity of the similar Incredible Shrinking Man (1957). Nonetheless, I still think my teenage fifty-cents was well spent. (In passing-- I'm still wondering how our scientist gets a fly's head, but not its brain. After all, he does continue to reason. Oh well, no one watches these epics for their logic, then or now.)"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "After her husband Andre Delambre is crushed to death in a mechanical press, his wife recounts to his brother Francois Delambre and police Inspector Charas the events of the previous few months. They were very much in love and with their little boy, a very happy family. Andre was experimenting with teleportation - transporting objects from one point to another by breaking the object down to the atomic level and then reassembling it in a receiver a distance away. The system had some glitches - it seemed to work with inanimate object but his cat disappeared when he tried teleporting it. He thinks he's solved all of the problems with his invention and decides to try and teleport himself. When a fly enters the teleportation device with him, disaster strikes.",
         "This is the original version of a scientist experimenting with matter transference accidentally exchanging one arm and his head with that of a fly which was in the transfer chamber.",
         "In Montreal, the industrial François Delambre is called late night by his sister-in-law Helene Delambre. She tells him that she has just killed her beloved husband Andre Delambre, using the press of their plant to press his head and left hand. François calls his acquaintance, Inspector Charas, and later the reluctant Helene is convinced to tell them what happened. She explains that Andre had invented a matter transportation apparatus, and while experimenting with himself, a fly entered the chamber, exchanging one hand and the head with him after the transference.",
         "Scientist Andre Delambre becomes obsessed with his latest creation, a matter transporter. He has varying degrees of success with it. He eventually decides to use a human subject, himself, with tragic consequences. During the transference, his atoms become merged with a fly, which was accidentally let into the machine. He winds up with the fly's head and one of it's arms and the fly winds up with Andre's head and arm. Eventually, Andre's wife, Helene discovers his secret and must make a decision whether to let him continue to live like that or to do the unthinkable and euthanize him to end his suffering.",
         "A scientist has a horrific accident when he tries to use his newly invented teleportation device."
      ],
      "budget": 700000
   },
   "movielensId": 2454,
   "movielens": {
      "languages": [
         "English",
         "Français"
      ],
      "releaseDate": "1958-07-16",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Kurt Neumann"],
      "runtime": 94,
      "movieId": 2454,
      "title": "The Fly",
      "mpaa": "NR",
      "actors": [
         "David Hedison",
         "Patricia Owens",
         "Vincent Price",
         "Herbert Marshall",
         "Kathleen Freeman",
         "Betty Lou Gerson",
         "Charles Herbert",
         "Bess Flowers",
         "Torben Meyer"
      ],
      "imdbMovieId": "0051622",
      "originalTitle": "The Fly",
      "genres": [
         "Drama",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["Hdv4QA-O1bg"],
      "plotSummary": "In Montreal, the industrial François Delambre is called late night by his sister-in-law Helene Delambre. She tells him that she has just killed her beloved husband Andre Delambre, using the press of their plant to press his head and left hand. François calls his acquaintance, Inspector Charas, and later the reluctant Helene is convinced to tell them what happened. She explains that Andre had invented a matter transportation apparatus, and while experimenting with himself, a fly entered the chamber, exchanging one hand and the head with him after the transference.",
      "tmdbMovieId": 11815,
      "avgRating": 3.31508,
      "releaseYear": "1958",
      "numRatings": 4091,
      "posterPath": "/jA6GYQDuR0RV99sWcjCzz8gcbHB.jpg"
   }
}