{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hammer",
            "id": 9366
         },
         {
            "name": "gore",
            "id": 10292
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "chainsaw",
            "id": 12394
         },
         {
            "name": "b horror",
            "id": 193575
         }
      ],
      "imdb_id": "tt0092076",
      "video": false,
      "title": "The Texas Chainsaw Massacre 2",
      "recommendations": [
         25018,
         16780,
         9728,
         10225,
         10283,
         11357,
         10281,
         10676,
         9725,
         11361,
         11281,
         27813,
         10987,
         16288,
         26515,
         13555,
         30497,
         9731,
         15762,
         9730
      ],
      "backdrop_path": "/ajdhwlImMWSWTu1sEMv72yu7IqK.jpg",
      "revenue": 8025872,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lieutenant 'Lefty' Enright",
               "gender": 2,
               "credit_id": "52fe46c79251416c750833b9",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Vanita 'Stretch' Brock",
               "gender": 1,
               "credit_id": "52fe46c79251416c750833cd",
               "name": "Caroline Williams",
               "profile_path": "/iOwBSdPQ1adtucfm3eyLjmlCVbt.jpg",
               "id": 86923,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Drayton Sawyer, the Cook",
               "gender": 2,
               "credit_id": "52fe46c79251416c750833bd",
               "name": "Jim Siedow",
               "profile_path": "/s6ILyhAwoUsZYyyslG5t9nlUjXc.jpg",
               "id": 104014,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "'Chop-Top' Sawyer",
               "gender": 2,
               "credit_id": "52fe46c79251416c750833c1",
               "name": "Bill Moseley",
               "profile_path": "/qUgvWEdmsLTzYzVFc71Asqxsjhi.jpg",
               "id": 27737,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Leatherface 'Bubba' Sawyer",
               "gender": 2,
               "credit_id": "52fe46c79251416c750833c5",
               "name": "Bill Johnson",
               "profile_path": null,
               "id": 422214,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Grandpa Sawyer",
               "gender": 0,
               "credit_id": "52fe46c79251416c750833c9",
               "name": "Ken Evert ",
               "profile_path": null,
               "id": 589733,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Patrolman",
               "gender": 0,
               "credit_id": "52fe46c79251416c750833d1",
               "name": "Harlan Jordan",
               "profile_path": null,
               "id": 194120,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Detective",
               "gender": 2,
               "credit_id": "52fe46c79251416c750833d5",
               "name": "Kirk Sisco",
               "profile_path": null,
               "id": 180566,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Cut-Rite Manager",
               "gender": 0,
               "credit_id": "52fe46c79251416c750833d9",
               "name": "James N. Harrell",
               "profile_path": null,
               "id": 236486,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "L.G. McPeters",
               "gender": 0,
               "credit_id": "52fe46c79251416c750833dd",
               "name": "Lou Perryman",
               "profile_path": null,
               "id": 2851,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Sports Anchorman",
               "gender": 0,
               "credit_id": "52fe46c79251416c750833e1",
               "name": "Kinky Friedman",
               "profile_path": null,
               "id": 218098,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Man in Hotel Corridor",
               "gender": 2,
               "credit_id": "598b1963925141329e02b4b3",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46c79251416c750833b5",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c79251416c750833e7",
               "name": "L.M. Kit Carson",
               "profile_path": null,
               "id": 15207,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46c79251416c750833ed",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "598b197a9251416b5002df4d",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598b19999251414bdd02fd99",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "598b19a5c3a3681f6e033b58",
               "name": "Tobe Hooper",
               "profile_path": "/rE5TqnAvgaKjWwWZ9AsoU9KcUGU.jpg",
               "id": 10051,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "598b19c6c3a3681f6e033b7c",
               "name": "Jerry Lambert",
               "profile_path": null,
               "id": 1414158,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "598b19d2c3a368786502d2fe",
               "name": "Richard Kooris",
               "profile_path": null,
               "id": 986265,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "598b19e2925141329e02b533",
               "name": "Alain Jakubowicz",
               "profile_path": null,
               "id": 58705,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "598b19fb92514137060245b2",
               "name": "Wayne Bell",
               "profile_path": null,
               "id": 75406,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "598b1a07c3a36874f2032f06",
               "name": "Oscar Mitt",
               "profile_path": null,
               "id": 1614193,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 8.511412,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16337,
      "vote_count": 193,
      "budget": 4700000,
      "overview": "A radio host is victimized by the cannibal family as a former Texas Marshall hunts them.",
      "similar": [
         10781,
         948,
         5486,
         341006,
         9792,
         9373,
         21407,
         1696,
         24124,
         4232,
         588,
         76617,
         381288,
         12521,
         13567,
         300665,
         12662,
         10185,
         294963,
         1991
      ],
      "original_title": "The Texas Chainsaw Massacre 2",
      "runtime": 101,
      "poster_path": "/1EI0Qs6AhtxdamRBsFC4zm2I6sj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1986-08-22",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/1zIwt7gUyxKhOKYXN5XNGdGxwHg.jpg",
         "name": "Texas Chainsaw Massacre Collection",
         "id": 111751,
         "poster_path": "/9qd7xPYvrJTK2bBPFsZAoMbx8px.jpg"
      },
      "tagline": "After a decade of silence... The buzzz is back!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tobe Hooper"],
      "runtime": 101,
      "synopsis": "In an opening distainer, when Sally Hardesty-Enright (the survivor from the original) escaped from the cannibal family, she reported it to the authorities. Since she was so terrorized and terrified over what happened, she fell into a catatonic state of mental health. As for the authorities, they issued a month-long manhunt for these wanted criminals, but when they arrived at the house, absolutly nothing was found. No suspects were taken into custody, no evidence was obtained. Nothing was found and on the records, it was concluded that the massacre Sally described did not happen. 13 years after 1973, after authorities came to the conclusion that there was no massacre in Muerto County, Texas, more brutal chainsaw murders occurred after remaining silent after over a decade of absence. Not only were the massacres of 1986 located in Austin like in 1973, but the \"Texas Chainsaw Massacre\" state-wide killing spree. It wasn't until 14 years after the massacre of 1973 the state-wide massacres occuring across Texas were finally investigated upon. In the opening scene, a year after the massacres began occuring in more parts of Texas, two rowdy high school seniors are seen driving around in a Cadillac and whom are looking for nothing but a good time in celebration of their school football team's victory, started calling up Vantia Brock (also known as Stretch), a DJ for a rock station in the Dallas-Fort Worth area. A little later as it gets dark, the two teenage kids call Stretch again from their car phone drunk and crazy, but they paused on the phone for a second as they were in a car chase with a large pickup truck across a rural bridge. While the unseen driver of the pickup truck chases them in reverse, another man called Bubba (the killer from the first movie, also known as Leatherface as his nickname, which is revealed in this sequel) jumps out and turns on his large six-foot long chainsaw and destroys their vehicle and chops off the top of the head of the teenager driving the car. The other teen, left in the car with out any control over the stearing wheel at the time dies on impact when the car collides off the bridge. Stretch listens on the other line in a pure state of shock along with her co-worker, L.G., are left to wonder after the call what happened out there that night. The next day, local police officers clean up the scene of the crime along with Lefty Enright, an ex-State Trooper or Texas Ranger (the name of Texas State Troopers) now a Lieutenant Detective of a local precinct after most possibly being an official of the Texas State Police for about 40 years. When his commanding officer arrives, Lefty, now affected very very deeply of the loss of his nephew and the condition of his niece (possibly because he is very lonely due to his mental health since he is seen as a nut by his peers) starts to consult with him about how there is very definitely a cannibal family residing in Texas killing people and that how he would make a mistake if not being able to take the case. His superior officer tells Lefty that he will not be included in the investigation as Lefty leaves the crime scene. However, Lefty didn't take his commanding officer's order seriously and put up an ad in a newspaper advertising where he lives in case anyone has any information about the cannibalistic serial killers. Stretch as affected by those people visits Lefty in his apartment telling him that when the kids called her that night, she recorded it on tape and what she could do. After visiting Lefty, Stretch goes to a Chili Cook-Off with L.G. and watched the judges determine the winner in their best-tasting chili contest segment of the festival who evidently turned out to be no one, but Drayton Sawyer (Leatherface's older brother, who was the former owner of the service station in the first one, but now owns a kind-off a meals on wheels or in this case meats-on-wheels kind of food processer who decided to abandon the service station during the manhunt of 1973). After speaking with Stretch, Lefty vowing revenge ever since his family hit the dust, goes to a small hardware store where he purchases three large chainsaws costing hundreds of dollars. Now looking like a soldier, Lefty believes that \"those people should know how it feels like to be cut up in to pieces!!!\" Meeting back up with Stretch, Lefty tells her that a great and effective tactic to use on these people would be to play the tape she recorded of their two last victums' grisly and gruesome murder over the radio luring the killers to the radio station for retaliation for \"screwing up their business\". Stretch took Lefty's advice and did so. Meanwhile, Drayton Sawyer, driving in his meals-on-wheels truck, hears the broadcast which angers him and he immediately makes a call from the phone in his truck to someone. Back at the radio station as night begins to fall, Strech is confronted by an obnoxious yet strange looking freak who is so-called Chop Top (another one of Leatherface's brothers who was in the Vietnam War during the first installment and is currently Leatherface's assistant in his killing spree and carries his brother, the Hitchiker, around who was ran over by a semi in the first movie who weared a metal plate in his head until his death that occurred 12 years before, giving him the nickname Plate-Head as well). Chop Top asks Strech at where she got the tape of the broadcast in which she refuses to answer him. Just then, Leatherface appears and attemps to kill her with his huge chainsaw with its six-foot long blade. Leatherface accidently hits Chop Top on his head with his chainsaw, exposing his large metal plate, but Chop Top is more or less uninjured. Stretch manages to briefly subdue Leatherface by spraying him with a fire exinquisher and then locks herself up in her office which has a steel door so that Leatherface cannot saw through the door. But instead Leatherface bursts through a wooden wall and confronts her. Stretch survives after Leatherface ends up looking at her at one point right before he was about to split her up and develops a crush on her and lets her live. Just then, L.G. arrives back at the station where Chop Top attacks him and beats him to death with a hammer. Leatherface then appears and lies by jesturing to Chop Top that he killed Stretch and destroyed the audio tape of their latest killing of the two teenagers on the bridge. The two insane killers then take L.G.'s dead body with them as they leave the radio station and drive away in Chop Top's pickup truck (the same truck involved in the two opening killings). Stretch follows them to their new home, the rundown and abandoned amusement park, called the Texas Battlelands Amusement Park, which is big enough to store the numerous remains of their many victims in as well. However, Lefty also is following Stretch as she pulled out of the radio station parking lot and followes her in his car to the deserted amuesment park. As he finally caught up with her, sort of, she falls through a hole in the middle of the ground filled with skulls and grisly remains of the family's previous victums. Lefty, absoulty furious and drowning in very very deep rage and emotions, takes a belt out of his car able to hold the two other chainsaws he purchased before in as he carries the biggest one he bought along with him as he cuts down the boundries around the park as he makes his way through the cave-like formations in the place where the family is residing and Stretch is trapped in as well. Meanwhile, Stretch is confronted by Leatherface in the slaughter room as he harrasses her and ties her up. Leatherface then tries to show his affection to her by gorily skinning L.G. and placing the skin of his face over hers. But then Leatherface is called out of the room by Drayton for some assistance. Just then L.G., who actually wasn't dead, revives and Stretch asks him to take the knife Leatherface used to skin him and set her free by cutting the ropes tying her together. After he does so, L.G. finally dies. Stretch takes off through the caves terrified and anxious to escape. In another section of the underground cave, the growing insane Lefty is freaked out just as well when he finds the skeleton of his wheelchair-bound departed nephew Franklin Hardesty-Enright who was murdered on August 18 1973 about 14 years ago and is now in display in his old wheelchair. Pure and filled completly with anger, hate, and maddness, Lefty makes his way through the caves in order to find destroy the Sawyer family. As Stretch makes her way out of the cave she ends up running back into Leatherface in which his brothers Drayton and Chop Top also appear to confront Stretch. When Chop Top tells Drayton that Leatherface earlier told him that she was dead, the now angry-than-ever Drayton goes crazy and for all seeing that \"Bubba\" was too much of a \"traitor\" to murder her. Unwilling to kill a person since he is only a cook, Drayton orders Leatherface to kill Stretch, but Leatherface refuses. Drayton angrily snatches the chainsaw away from Leatherface and walks away, ordering Leatherface to follow him back to the kitchen while he orders Chop Top to take care of Stretch for later which he responds by knocking her out with a hammer. Stretch wakes up a little later (with Lefty nowhere to be see) Sally-style, meaning that just like Sally Hardesty-Enright, she is bound to a chair in the family's new cavern-like dining room dinner table now surrounded the the entire Sawyer family which includes the 108-year-old Grandpa \"Grandad\" Sawyer, Bubba \"Leatherface\" Sawyer, Drayton Sawyer the cook, Edward \"Nubbins\" Sawyer's corpse (also known as the Hitchiker), and Robert \"Chop Top\" Sawyer\" all together for another family dinner. And like Sally, Stretch is presented to be the prize kill for Grandpa Sawyer and she almost gets killed by Grandpa with a blow to the head using a mallet. Suddenly, Lefty bursts through a wall in the dinning room and sees Stretch in their grasp. With Chop Top and Leatherface standing by to attack, Drayton has a conversation with Lefty who tells the cook that they took from him his niece Sally and his sanity and his poor deceased nephew Franklin. Drayton is unmoved and tells Lefty that he's just trying to run a business. Lefty then attacks wounds Drayton with his large chainsaw. Lefty then uses his chainsaw to free Stretch and tells to leave as he gives the cannibals exactly what they deserve (!) As the wounded Drayton crawls under the dinner table, he orders Leatherface to kill Lefty and orders Chop Top to go after Stretch to make sure she doesn't escape. Leatherface starts up his chainsaw and has a duel with Lefty in a Star Wars-like manner, but instead of lightsabers, with chainsaws (!) Chop Top chases after Stretch as she runs through the cave passageways trying to find an exit. Back in the dining room, the duel with chainsaws reaches the climax as Lefty finally gets the upper hand against Leatherface and impales him with his chainsaw as they stand up on top of the dinner table. But Leatherface still will not go down that easily and he still holds his chainsaw after being slammed onto the dinner table as Lefty starts up his two other smaller chainsaws. Drayton continues hiding under the dinner table with the muffified body of the Hitchhiker which Drayton takes out a hand grenade that the Hitchhiker always had on him. Just then, the elderly Grandpa Sawyer stands up out of his chair and throws his mallet at Lefty who ducks and it hits Leatherface instead who drops his chainsaw on the table which hits Drayton underneath who drops the grenade. Lefty then screams a victory call right before the grenade goes off, apparently killing him the Sawyer family and destroying everything in it's path. Lefty's anger and agony he had for a long period of rough times is over (!) Meanwhile, Stretch has escaped the blast and is still being chased by Chop Top which she finds a skylight and makes it outside into the light of day where she finds herself inside the closed amusement park and standing before a large artificial hill. Chop Top continues to chase after her, but she kicks him off a ledge on the hill and continues climbing up the hill. However, once close to freedom, she encounters the muffified remains of Grandma Sawyer in a santuary at the top of the amusement park hill (!) The remains of Grandma apparently has a small chainsaw lodged in her hands and Stretch desperately tries to remove it to defend herself against Chop Top who climbs back up the ledge he fell off of. But Stretch has difficulty starting up the old chainsaw in which Chop Top attacks her with a straight razor cutting her several times on her back, neck, sholders and back of her head (similar to what the Hitchhiker was doing to Sally just before he got run over by a semi-trailer in the first movie). Just as he is about to kill her, Stretch finally starts up the chainsaw and impails him with it. The fataly wounded Chop Top then falls back off the ledge, hits the ground and falls back into the hole leading back into the underground cave where he chased her out of. The eerieness continues as Stretch looses her sanity at that moment, swinging the chainsaw around in the manner in a victory dance atop the hill similar to what Leatherface did as well in the ending of the first movie. The final shots shows the insane Stretch swinging the chainsaw and screaming in reaction to the hell she had been through.",
      "writers": [
         "L.M. Kit Carson",
         "Tobe Hooper"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092076/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzc3NjEwNTM1MF5BMl5BanBnXkFtZTcwNDU2NzI5NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Dennis Hopper, Caroline Williams, Jim Siedow | See full cast and crew »"],
      "reviews": [
         "Texas Chainsaw Massacre 2 is one of the most misunderstood movies of all time. I saw Texas Chainsaw Massacre 2 when it was released in theaters back in 1986. I loved this horror flick then. But everyone else hated it. Critics trashed it. Even many horror fans, of the first Texas Chainsaw Massacre or slashers in general, hated it and dismissed it. Now after a decade or so after its release, TCM 2 is now a bona fide cult movie. There are so many things to point out why TCM 2 is a stand-out. The first and most important thing to point out is that back in the 1980s, horror films were reduced to simple slashers. TCM 2 is totally different than the plethora of slashers that many horror fans expected to see, which is one reason why many horror fans didn't get it. The body count is extremely low in TCM 2 compared to the Friday the 13th or Elm Street flicks. But that doesn't mean it's not violent. No, it's VERY violent. But the violence in TCM 2 is more engrossing, shocking and even at times funny, and in turn less acceptable than the unreal violence found in many slasher films. Because of the amount of violence and violent imagery, films critics trashed TCM 2, pointing out how the first film didn't rely on gore and violence to scare the audience. I love Texas Chainsaw Massacre as much as I love TCM 2. I understand what the critics were saying. Unfortunately, they didn't get the point of the violence in TCM 2. While TCM is a sweat inducing TERRIFYING horror film in the first order, TCM 2 is a \"GRAND GUIGNOL HORROR\" horror film in the first order. In TCM 2, Hooper creates a vast canvas of baroque imagery, where we watch the insane and gory story unfold before our incredulous eyes. I'm amazed that critics missed the whole difference between TCM and TCM 2. It's odd that critics will rave about Peter Greenaway's \"THE COOK, THE THIEF, HIS WIFE & HER LOVER\" which is a twisted drama in the the Grand Guignol style, but didn't see TCM 2 in the same way. It's probably due to the fact that TCM 2 is a sequel to a quasi-legendary horror film and everyone expected the sequel to be the same as the first movie. I give credit to everyone involved with TCM 2. They actually TRIED to do something different: different from the equally great TCM, different from the increasingly boring horror films of the 80s. And in my eye, they've succeeded. There are so many memorable scenes in TCM 2, some of which are the most amazing horror moments ever put on screen (when Leatherface tries to put the scalped face on Stretch, the scene when Stretch finds her friend sans face, etc). And there are so many quotable lines too. TCM 2 is also a very funny film (\"Rain, rain, rain, rain...\" Choptop says as he checks out records at the radio station). TCM 2 is not perfect. The ending is abrupt. And the chainsaw fight at the end is too short. Dennis Hopper is a bit hard to take as a \"hero.\" But he does play the \"twisted hero\" right. It's just difficult to see him fighting big and burly Leatherface. BTW, the very last image of TCM 2 is Strecth dancing with a chainsaw in her hands at the top of that amusement park structure. In the original film (and the original video release), we can see cars and trucks driving by on a highway in the distance. On the DVD, they cropped this shot and we don't see the traffic anymore. Personally, I thought it added a LOT to the whole surreal aspect of the film. Like the world was continuing on with its relentless pace, no matter what had just happened that night. I wished they didn't crop this shot on the DVD. Oh well... It's a shame few people \"got\" TCM 2 back then. After reading the reviews at IMDb and at Amazon, it's great to see that some are finally \"getting it.\" For anyone who's game, watch TCM 2. You'll be squealing in horror and laughing at the insanity of it all in equal amounts.",
         "The Texas Chainsaw Massacre 2 is criminally underrated. I've noticed a lot of comments trashing this movie. It's a HORROR movie! It's also a SEQUEL to a horror movie! Where were your expectations people? What did you think you were going to be watching? I remember watching The Texas Chainsaw Massacre 2 as a kid, and it scared the s**t out of me. That opening bridge scene is incredible. It's one of the scariest sequences I've ever seen. Tom Savini's effects are top notch, the humor is well placed, and the acting is perfect for the genre. Bill Moseley (Chop Top) is something else. He's the reason I love this movie so much. He portrays one of the most memorable characters in recent horror history and I can't get enough of him. I do agree that Bill Johnson is not nearly as menacing as Gunnar Hansen in the role of Leatherface. But what's wrong with Tobe Hooper's direction? It's his story, let him tell it the way he wants to. I think Tobe Hooper succeeds in continuing the tale of one of the great horror icons. TCM 2 has loads of gore, campy acting, and instills a healthy dose of fear into it's viewer. What more could you ask of a sequel? And remember, the saw is family.",
         "The Texas Chainsaw Massacre was a horrific realistic, and a genuinely terrifying film. This second is a strange (even stranger than the original) very sick ( a man forces a woman to wear her friends face??) and very budget blown (the appearance of Dennis Hopper). We have Leather Face, Drayton (from the original we new him as old man) and Chop Top who is a new addition to the family who is (although probably the most deranged) a kind of funny and lovable character, he is very similar to the hitchhiker from the original except a Vietnam steel plated and (oddly) pale white skin colour. A radio DJ (Stretch) gets prank called by two irritating gun ho kids in a car speeding down the motorway, but one of these prank calls just happen to be made at a wrong time as the two are chased by Leather Face in a opposite car and funnily enough kills them by chainsaw and its all been recorded on a live radio station. This makes Stretch closer to Lefty (dennis hopper) who is a family member of Franklyn (weelchair victim) in the original massacre wanting to hunt down the maniacs for revenge. The appearance of this recorded footage brings Lefty closer to catching the maniacs who is now out for Stretch for making the recording. The plot proceeds on to Stretch being held captive in the theme park style underground layer of the maniacs and Lefty roaring through chopping the place down with his chainsaw. This is higher budget, meaning its got loads more action and the set pieces are even creepier and outstandingly made. The acting is pretty good as this time they had the money to buy proper actors. Although its unrealistic (living in an underground theme park layer filled with over 100 bodies used as props, people being chased in their car by a guy standing on top of his truck with a chainsaw on a bridge, the final battle between Dennis Hopper and Leather Face using chainsaws)its still a cult classic and very well directed. The original is superior but the second instalment is by far not a disappointment, more of a higher budget fun thrill ride with jumps, scares and even some funny parts which are hard not to laugh. The bad parts are the rushed beginning which we don't really know a thing about Lefty or why he's so mad and the fact that Leather Face now has feelings and becomes a little bit puffy at times. Apart from that all this \"this is one of the stupidest films ever\" nonsense is, quite plainly nonsense. Better than the other instalments and the remake, not better than the original.",
         "Disclaimer: Do NOT try to remove your hemorrhoids with a chainsaw. It will NOT save you a trip to the hospital. (spoilers) OK, let me tell you why the Texas Chainsaw sequels don't work. The original film is slightly exempt from this, but when you have someone who is screaming and wiggling so much that you wish she would just get killed so she'll shut the hell up, you have lost your ability to scare. Doesn't matter how good the sets or costumes or actors are, if the audience is holding their ears, you have a problem. The first sequel in the Texas Chainsaw series is meant to be nothing other than a bigger version of the original, this time fictionalized, and beefed up with the star power of Dennis Hopper. Not that the original was non-fiction. As you know, it was really based, very loosely, as it were, on the inhuman antics of Ed Gein in the 1950s, the same demented nutcase that inspired Psycho and The Silence of the Lambs. Sounds like a fun guy. Unfortunately, as is all too often the case with horror movies, this one comes off more as a sick comedy than a scary movie. Granted, there are horror movies that purposely come out like that, such as most of the Nightmare on Elm Street movies, but the original Texas Chainsaw Massacre was a movie that caught people off guard because of its simplicity, its unknown cast, and its rough, documentary feel. In Texas Chainsaw 2, every single little bit of that is lost. The set, once we eventually get underground, looks like they rented the Indiana Jones set, festooned it with randomly placed naked light bulbs, furniture made out of human bones, and meat hooks, and had Leatherface run around swinging a chainsaw. The atmosphere of the movie has completely lost the claustrophobic feel of the original by vastly expanding the size of the set, much of which looks like a Christmas tree crossed with an esophagus, and there is just too much hooting and hollering for it to be scary. The only thing more irritating than the killers is their victim, 'Stretch.' The movie starts off with a couple of high school caricatures zooming down a desert highway, screaming at each other at the tops of their lungs about the sheer magnitude of the party that they are on their way to. They decide to swing into oncoming traffic to play chicken with someone driving a pickup truck, instantly making me eager to see them get killed. Doesn't matter that Leatherface is in that truck, anyone who plays chicken with a random driver because they're driving around drunk deserves to get killed. And if it takes place in a movie, they deserve to get killed with a chainsaw. So not only do we have to endure the hooting and hollering of these two jerks, but they call a radio station and we are asked to believe that this station's phones get completely tied up if someone calling in refuses to hang up. Sure, this is rural Texas and 1986, but are we to believe that even out there and back then, there were radio stations with a single phone line and without the ability to cut off the callers? At one point the clueless tech guy is frantically pushing buttons and pulling levers, trying to figure out how to clear the line. Given something so stupid, however, you know it was there for a reason, so that they could record the phone call as the kids get chainsawed on the other end. Speaking of which, the same kid that swerved into oncoming traffic at full speed finds himself stopped on a bridge as that same pickup truck sits blocking both lanes, and he frantically screams 'Are you crazy?!?' out the windshield while his idiot friend in the passenger seat offers such heroic tips as 'Just keep driving!' and 'Get outta here!' Good thinking'! Speaking of driving, not only can they not outrun a pickup truck traveling in reverse while supposedly holding the pedal to the floor in their Mercedes, but in the shots that show Leatherface standing and swinging his chainsaw, they are literally traveling all of 5mph. Dennis Hopper plays the uncle of the kids who were killed in the original movie, sort of a rogue detective out of his jurisdiction and showing up at the scene of the two kids' murder. The police refuse to jump to conclusions, but Lefty (Hopper) is sure that it's the same people who killed his nieces and nephews. Hopper makes a GREAT redneck. I generally am truly disappointed when actors take on fake accents, but Hopper does this one so well that you would swear he's lived in the south his entire life, it's just too bad that he's saddled with this idiot character. At one point, Stretch, the radio station DJ, shows up at his apartment, which, needless to say, is flooded with drunken rednecks wandering the halls with their arms around each other, and tells him that she has an audiotape of the murder because the kids called in just before they were attacked, and he sends her away! What the hell is that? Later he has a change of heart, but only wants to hear it if she'll play it on the air. The logic of the characters' actions in this movie is not starting off on the right foot. Then later, as Stretch hangs in a pit about to fall into the demons' lair, you might say, he tries to save her with a brittle, dried out arm bone. Clever. There is a lengthy horror scene inside the radio station, which looks like it doesn't know if it's supposed to be a radio station or a horror movie set, so better just be a little bit of both. It's got its vast storage of records stored safely behind an open door, with a heavy steel door guarding the cleaning supplies. A burglar's dream, you might say. We get a scene where Leatherface is assigned to kill Stretch, but when he finally gets through that steel door, he starts chainsawing a tub of soda cans sitting in ice, which have no reason for being there or for being chainsawed, until finally Stretch screams, 'Are you mad at me??' and my eyes glaze over for the remainder of the film. There's an effective scene where Leatherface puts Stretch's friend's freshly removed face over hers, supposedly to help her escape, but for the most part the underground portion of the film is a tired rehash of the original. Sure, it's bigger, there are more Christmas lights and more chainsaws, but essentially it's exactly the same thing, just without the surprise. They even replay exactly the same dinner scene from the end of the last movie, the most unpleasant scene in the entire movie. Lefty decides that he is so intent on delivering swift poetic justice that, rather than stock up on as many guns as he can carry, he buys three huge chainsaws and straps them to his body, and then runs screaming into the house, yelling and cutting down wooden supports as the family tortures Stretch. In Commando Arnold bulldozes into a weapons store and loads up on boatloads of guns and knives and explosives. In The Terminator he does the same thing, with the added bonus of killing off the proprietor before leaving. Lefty could have paid homage to both of those films, establishing Lefty as a good guy since he actually paid for his. But why saws and not guns? The grandparents, as is to be expected, are a hideous, hideous spectacle. Grandpa's 137 years old and still likes to hammer young girls on the head, and grandma spends her time in a wheelchair upstairs with a chainsaw on her lap. We are treated to a finale atop a huge rock outcropping that is so fake that it almost turns the movie into a comedy all by itself. There is at least one or two shots where the underlying chicken wire is nakedly visible. We get some sort of variation on the ending of the original, since the conclusion is almost a mirror image, in that the girl becomes the chainsaw wielding maniac rather than looking at him out the back window of a passing motorist, but I'm not sure what line of discussion led to the conclusion that this would be a cool way to end the film. Is this supposed to be the setup for a sequel? The family's dead, but now there's this girl who has caught chainsaw fever and will now carry on the legacy?",
         "Potential SPOILERS ahead. When I'd first heard of this movie, it was described to me by my cousins as the scariest and creepiest movie they'd ever seen. So it always had a place in my mind as a movie to avoid. However, when I finally did catch it, I have to say I disagree. This movie was incredibly stupid. Every scare is telegraphed, nothing is a surprise. Leatherface dances around more with the chainsaw then cutting anyone. It's really idiotic. The performances aren't much better than your local churches haunted house on Halloween. First, we're supposed to believe a radio station can't hang up on a caller unless the caller does first? I think the FCC would have something to say about that. It'd be impossible to censor any obscene calls that way. Also, what exactly does the tape reveal that Chop Top and Leatherface need to show up and silence the girl about? Some screams and a chainsaw noise. Yeah, that really points out their identities and existence. A damn autopsy would reveal the cause of death was power tool. Beyond that there's NOTHING linking them. Texas is a damn big state. And as the prologue indicates, after the first girl was found alive, the authorities found NOTHING to prove the events had happened. Plus, they could have just torched the place when they left the girl if they really wanted to be sure. I watched it a second time last night, and I have to say it's gotten dumber. Stupid movie, and not in an entertaining way.",
         "The answer to who the movie really centers on, is not as simple as could be sounded. This nice little sequel (thats right! a GOOD sequel), the attention could easily be said to circle around Williamss' Stretch, but Dennis Hopper gets the only billing. One \"normal\" day in Texas, two naughty little highschool brats decide to have fun, by calling in a radio station(hosted by an enthusiastic Williams) and play chicken with other texans, they think. Later, these angered Texans turn out to be, uh huh! Ya, we all know who, as they attack the little brats one dark night following the earlier prank. Williams \"Stretch\" catches all of this gore galore on tape, and exposes it on her show as a favor for Hopper. Hopper has underacted character who's revenge for the massacre and torture of his nephew and niece (Sally and Franklin from the first) is somewhat unconvincible to an extent, but he has better moments. Williams, on the other hand, is very into her character and obviously takes it to the next level, with some hammy moments resaulting. Still, after she exposes the missing Saw-yer family-she is next! Pretty scary stuff. Nice little set-up puts her in an awfully creepy confrontation with Moseleys' Chop-Top\". Then the real terror begins. This one could easily be said to have been just a little more expanded than the first, and I certainly say so. I do, however, put the first one on a higher stand, nothing will ever beat the original nightmare, which still scares to this day. Though Massacre 2 has its real moments of both horror and comedy, it drags in the last real, and won't give up! Tobe Hooper must have worked em all with this one, but its all the same a great fun movie. To say it is bad, would be too harsh, I definitely give this one a thumbs up, and ya know what? I'm not the only one!",
         "If you liked Dennis Hopper in Apocalypse Now, you'll love him as Lefty the chainsaw-slinging Texas cop hell-bent for revenge in this sweet sequel. Head chainsawed in the first five minutes: check. Wacky characterization of beloved horror characters: check. Automatic love from me: check. Plus, Bill Moseley comes back as the cousin of the original hitch-hiker character and steals scenes as a psychotic hippied-out Vietnam vet. The comedy doesn't fall flat here either as there's just too damn much of it. Skip the other stupid TCM sequels and go for the one that counts. That would be this one. The second one.",
         "Wow. I've never seen a sequel that spoofs its predecessor harder than this one does. 10 years after the original TCM, Leatherface is back, making a stunning entrance atop a speeding pick-up truck with his legendary chainsaw held high. After dispatching two incredibly annoying, cell-phone wielding yuppies, the cannibalistic Sawyer family is after Stretch, a DJ who was on the phone with the two idiotic victims and heard everything that happened. Simultaneously using Stretch as bait and protecting her from the Sawyers is bug-eyed weirdo Dennis Hopper, playing the demented, chainsaw packing sheriff and uncle to one of the previous films unfortunate victims. This movie is definitely played for comedy, black as it may be. It's almost a retelling of the first tale, as Stretch runs screaming through the Sawyers underground abode, only to end up bent over a washtub while Grandpa feebly whacks away at her head with a hammer. There's a great chainsaw-as-penis scene, where Leatherface suddenly discovers sex and orgasms and promptly loses interest in chainsawing Stretch to death. There's also a hideous hammer murder and a gruesome \"defacing\" scene, just so you don't forget that, no matter how hilarious, this movie is still about over-the-top gore, mutilations, cannibalism and fates worse than death. Just when your stomach starts lurching, along comes another sickening joke to relieve the tension. This is a brilliantly done film, made even better by its offbeat humor and oddly likable characters. In my humble opinion, it's the perfect sequel, done the way more sequels ought to be done.",
         "The Texas Chainsaw Massacre Part 2 is much gorier than the original, which has a reputation for being a big gore-fest. This one's even crazier and funnier than Chainsaw 1. Bill Moseley as Chop-Top is great, spitting out some remarkably memorable quotes like, \" Dog will hunt!\" Leatherface shows up alot in this film as he did in the original and the rest of the series. This one's filled with gore for sure, thanks to gore-wizard Tom Savini. Of course we can't forget Dennis Hopper's as the vengeful officer, searching for the killers of his brother's kids, Sallie and Franklin",
         "***Contains Spoilers*** After watching this sequel I was absolutely thrown back by miles! It was totally crap & also a massive spin off after the speech at the beginning of the film which gave somewhat of an indication that it was continuing the story line from the first Texas Chainsaw Massacre film. It was just terrible & I wouldn't recommend you see this as it literally just didn't look scary or even sinister. It wouldn't have bothered me so much if they didn't make it look stupid & more of a comedy. Even if it meant completely different characters it wouldn't have been so bad as long as it was done in the same style as the first. All in all terrible film."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Cannon Films"],
      "summaries": [
         "Young DJ Vantia Block is hosting a music show when two renegade hoodlums phone her and start making trouble. The situation changes rapidly as the kids drive to a passageway and get sawed to pieces by Leatherface while the shocked DJ listens the kids' screams. Local sheriff approaches Block and convinces her to play the recording made from the phone call on radio, hoping that the killers would show up.",
         "A radio host is victimized by the cannibal family as a former Texas Marshall hunts them."
      ],
      "budget": 4700000
   },
   "movielensId": 2460,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-08-22",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Tobe Hooper"],
      "runtime": 101,
      "movieId": 2460,
      "title": "The Texas Chainsaw Massacre 2",
      "mpaa": "R",
      "actors": [
         "Dennis Hopper",
         "Caroline Williams",
         "Jim Siedow",
         "Bill Moseley",
         "Bill Johnson",
         "Ken Evert ",
         "Harlan Jordan",
         "Kirk Sisco",
         "James N. Harrell",
         "Lou Perryman",
         "Kinky Friedman",
         "Tobe Hooper"
      ],
      "imdbMovieId": "0092076",
      "originalTitle": "The Texas Chainsaw Massacre 2",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["xUyEaYxTI2U"],
      "plotSummary": "A radio host is victimized by the cannibal family as a former Texas Marshall hunts them.",
      "tmdbMovieId": 16337,
      "avgRating": 2.33216,
      "releaseYear": "1986",
      "numRatings": 992,
      "posterPath": "/1EI0Qs6AhtxdamRBsFC4zm2I6sj.jpg"
   }
}