{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "artificial intelligence",
            "id": 310
         },
         {
            "name": "child abuse",
            "id": 516
         },
         {
            "name": "basketball",
            "id": 6496
         },
         {
            "name": "resurrection",
            "id": 6506
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "robot",
            "id": 14544
         },
         {
            "name": "alcoholic",
            "id": 33457
         },
         {
            "name": "brawl",
            "id": 174244
         },
         {
            "name": "circuit board",
            "id": 221226
         },
         {
            "name": "paranoiac",
            "id": 233133
         }
      ],
      "imdb_id": "tt0090917",
      "video": false,
      "title": "Deadly Friend",
      "recommendations": [
         37938,
         27390,
         28155,
         41235,
         27814,
         37936,
         32043,
         25756,
         28762,
         29095,
         33016,
         36599,
         13555,
         24274,
         57744,
         67740,
         18111,
         26675,
         33061,
         27816
      ],
      "backdrop_path": "/ibFcmlQOwzZzHq41etdasnb5zQs.jpg",
      "revenue": 8988731,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Conway",
               "gender": 2,
               "credit_id": "52fe45089251416c910253f7",
               "name": "Matthew Laborteaux",
               "profile_path": "/1AaC9e1AxDRrwjkgmax5J6Dfhwx.jpg",
               "id": 81516,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Samantha Pringle",
               "gender": 1,
               "credit_id": "52fe45089251416c910253fb",
               "name": "Kristy Swanson",
               "profile_path": "/wxLklfVHTuVg3O7XT4vBpgzc0Tm.jpg",
               "id": 56128,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Tom 'Slime' Toomey",
               "gender": 2,
               "credit_id": "52fe45089251416c910253ff",
               "name": "Michael Sharrett",
               "profile_path": "/bukOLjGwFXfu7zIrxYWyPD5dng9.jpg",
               "id": 101785,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jeannie Conway",
               "gender": 1,
               "credit_id": "52fe45089251416c91025403",
               "name": "Anne Twomey",
               "profile_path": "/moN4fyQfCGdPy1oG7GEBHTXUJOy.jpg",
               "id": 110434,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Elvira Parker",
               "gender": 1,
               "credit_id": "52fe45089251416c91025407",
               "name": "Anne Ramsey",
               "profile_path": "/24AFp6szxbyExOewAGrQIVJzlmN.jpg",
               "id": 49944,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Harry Pringle",
               "gender": 2,
               "credit_id": "52fe45089251416c9102540b",
               "name": "Richard Marcus",
               "profile_path": "/1GUEfd41kYQL20S84c8Z3wHeSGl.jpg",
               "id": 70782,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dr. Johanson",
               "gender": 2,
               "credit_id": "52fe45099251416c9102540f",
               "name": "Russ Marin",
               "profile_path": null,
               "id": 110435,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Sergeant Volchek",
               "gender": 2,
               "credit_id": "52fe45099251416c91025413",
               "name": "Lee Paul",
               "profile_path": null,
               "id": 110436,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Carl",
               "gender": 2,
               "credit_id": "52fe45099251416c91025417",
               "name": "Andrew Roperto",
               "profile_path": null,
               "id": 110437,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "BB",
               "gender": 2,
               "credit_id": "54b1af919251416fe10020c5",
               "name": "Charles Fleischer",
               "profile_path": "/vlF5j4y3lEKO6wXJ1R98ixUmebx.jpg",
               "id": 12826,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Thief",
               "gender": 0,
               "credit_id": "54b1af9d92514107e0001473",
               "name": "Robin Nuyen",
               "profile_path": null,
               "id": 1412007,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Angry Resident",
               "gender": 2,
               "credit_id": "54b1afad925141746c0027cf",
               "name": "Frank Cavestani",
               "profile_path": "/4IaXU3ZKDKOuXqDTTYSAhsbefrv.jpg",
               "id": 163254,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "CAT Scan Technician",
               "gender": 0,
               "credit_id": "54b1afbfc3a3680939002df9",
               "name": "Merritt Olsen",
               "profile_path": null,
               "id": 140346,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45099251416c91025429",
               "name": "Wes Craven",
               "profile_path": "/vffssPtgNn2ZwoMfLCCDJAxlXGI.jpg",
               "id": 5140,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54b1afe8c3a3680945002d9e",
               "name": "Robert M. Sherman",
               "profile_path": null,
               "id": 58076,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "541af50dc3a3684e8b001967",
               "name": "Diana Henstell",
               "profile_path": null,
               "id": 1365377,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "541af5180e0a26013e001b15",
               "name": "Bruce Joel Rubin",
               "profile_path": "/jgSFvY1hTFONlIkbfGHHnH6DW50.jpg",
               "id": 3431,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54b1afd3c3a368094e002dec",
               "name": "Robert Crawford Jr.",
               "profile_path": null,
               "id": 57139,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "54b1b015c3a368094a00251c",
               "name": "Patrick Kelley",
               "profile_path": null,
               "id": 1412008,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54b1b03292514114a2000235",
               "name": "Charles Bernstein",
               "profile_path": null,
               "id": 13669,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "54b1b0d5c3a3680940002b04",
               "name": "Philip H. Lathrop",
               "profile_path": null,
               "id": 1939,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54b1b0e1c3a368094e002dfe",
               "name": "Michael Eliot",
               "profile_path": null,
               "id": 1412009,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54b1b0ed9251412ae7001d83",
               "name": "John Loggia",
               "profile_path": null,
               "id": 1412010,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "54b1b1029251417472002a8c",
               "name": "Daniel A. Lomino",
               "profile_path": null,
               "id": 12436,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.127511,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 33278,
      "vote_count": 67,
      "budget": 0,
      "overview": "Paul is a new kid in town with a robot named \"BB\". He befriends Samantha and the three of them have a lot of good times together. That is, until Samantha's abusive father throws her down some stairs and kills her. In an effort to save her life, Paul implants BB's computer brain into Samantha's human brain.",
      "similar": [
         3597,
         133805,
         36599,
         2048,
         12619,
         4488,
         10131,
         9424,
         286987,
         19959,
         377,
         644,
         14869,
         264660,
         274855,
         262543,
         238636,
         157336,
         198184,
         315635
      ],
      "original_title": "Deadly Friend",
      "runtime": 91,
      "poster_path": "/cLuIQDB0SjvptANfLTpNxs9tXcP.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Pan Arts",
            "id": 8792,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Layton",
            "id": 43687,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1986-10-10",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "There's no one alive who'll play with the girl next door.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Wes Craven"],
      "runtime": 91,
      "synopsis": "In a parking lot, a thief tries to steal from a Volkswagen van but a robot named BB (voiced by Charles Fleischer) stops him. BB lets go of the thief, who is dazed. Paul Conway (Matthew Laborteaux) and his mother Jeannie (Anne Twomey) return from shopping and drive away in the van. Paul is the owner of BB, which he built. They arrive at their new house in the town of Welling Proper the next day. Paul soon become friends with newspaper delivery boy Tom Toomey (Michael Sharrett). Paul has a university scholarship due to his vast intelligence and interests in neurology and artificial intelligence. As they move in, BB's batteries run low. The robot, which occasionally shows signs of autonomy, plugs himself into an electrical socket to charge up. At the university, Paul, Jeannie, and BB meet Paul's professor, Dr. Johanson, who gives them a tour of Paul's new laboratory. A few days later, Paul and BB are cleaning the yard. Paul meets his next-door neighbor, Samantha Pringle (Kristy Swanson). Paul notices some bruises on her arm but Samantha tries to hide them. Sam's abusive, alcoholic father, Harry (Richard Marcus), soon comes outside and stares at her menacingly. Samantha is frightened and returns to her father. That night, Samantha visits Paul and Jeannie. Her father soon drags Samantha home and beats her. Tom helps Paul teach BB to deliver newspapers. They stop at the house of reclusive harridan Elvira Parker (Anne Ramsey), who threatens the boys with a loaded shotgun and expresses dislike for BB. The three walk away. Tom reveals that his father is a security guard at the university hospital. Walking further, they encounter a motorcycle gang. The gang insults Tom and they push Paul into a garbage bin. BB grabs the gang leader's crotch. The gang rides away, with the leader vowing revenge. Paul, Samantha, Tom, and BB develop a close friendship. One day, they play basketball in the neighborhood. BB accidentally tosses the ball onto Elvira's porch. She stomps out of her house and takes the ball, refusing to give it back. BB's eyes freeze on Elvira as if he will never forget the insult. On Halloween night, Samantha comes over with a bloody nose and asks for ice. Paul and Jeannie believe that her father is abusing her. Samantha goes out with Paul, Tom, and BB. Tom decides to pull a prank on Elvira. BB unlocks her gate and Samantha rings her doorbell. Alarms go off and they hide in the shrubbery. Elvira finds BB standing near her porch and shoots the robot. Paul is devastated by the loss of his friend, while Tom blames himself for suggesting the stunt. On Thanksgiving Day, Paul and Jeannie eat dinner with Samantha. Afterwards, Paul and Samantha share their first kiss. Samantha returns home late at night, outraging her father, who punches her in the face and pushes her down the stairs, causing her to be rushed to the hospital. Samantha is left brain-dead. Dr. Johanson tells Paul that she will be put on life support for 24 hours and then the plug will be pulled. Paul remembers how BB's microchip links artificial intelligence with the human brain, and runs to Tom's house. With an idea in mind, he asks him for his father's keys to the hospital to sneak into Samantha's room and bring her back to life when the plug is pulled. They get the keys, and enter the hospital as Tom deactivates hospital power from the basement, Dr. Johanson pulls the plug on Samantha. When the hospital goes dark, Paul enters Samantha's room and drags her to his lab. Paul's inserts the microchip into Samantha's brain and brandishes his remote control, attempting to activate Samantha. Samantha's foot moves, causing Tom to faint. Paul takes Samantha to the shed at his house and activates Samantha. She opens her eyes mechanically and starts to breathe, with her hands in the position of BB's pincers as Paul teaches her to sit up. The police arrive at Samantha's home and inform Harry that her body has disappeared. In the middle of the night, Paul finds Samantha staring at the window, looking at her father. Paul deactivates her. The next morning, Paul awakens and sees that Samantha is gone. He searches for her in the street, but there is no sign of her. Samantha is at her house, avenging herself on her father. Harry finds the cellar door open and goes downstairs. Samantha yanks her father off his feet and drags him to the furnace. She kills him by snapping his neck. Paul finds her in the cellar and sees her father's head burning. Horrified, he hides the corpse in a pile of coal. He goes home with Samantha and locks her in his bedroom. That night, Samantha breaks free again. This time, she avenges herself upon Elvira for shooting BB. Elvira calls the police, but they hang up on her. A basketball bounces ominously in her living room indicating that Samantha has broken in. Samantha, now developing super-strength, grabs the basketball and throws it at Elvira, causing her head to explode. Elvira's decapitated body rolls on the floor and runs in circles, spurting blood and gore until it bounces off the door and lays dead on the porch. At Elvira's house, police discover Elvira's corpse and Harry's body. When Tom learns that Samantha is killing people, Paul promises things will change. Tom refuses to budge, and the two fight. Samantha jumps out a window and attacks Tom, believing that he has injured Paul. Paul and Jeannie save Tom, but Samantha runs away. As Paul runs after her, the leader of the biker gang confronts him. As a police car arrives, Samantha throws the biker into the car's windshield. As she runs off, she is confronted by police. She makes her way back to Paul's shed. Paul meets her there and tries to comfort her. He is amazed as he realizes that Samantha is becoming more human, even saying his name tenderly. The police arrive and point at Paul. Samantha yells Paul's name and the police shoot. The bullet hits Samantha, who was defending Paul. She dies in his arms. Later, Paul visits Samantha in the morgue. A malevolent version of BB emerges from Samantha's head, grabbing Paul's neck. Samantha/BB says, \"Paul. Come with me, Paul\". Off-screen, Paul screams as Samantha/BB crushes his neck. The credits end with BB's name being said over and over again.",
      "writers": [
         "Diana Henstell",
         "Bruce Joel Rubin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090917/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA2NTU2MTAxM15BMl5BanBnXkFtZTcwNTkxMjAwMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Matthew Labyorteaux, Kristy Swanson, Michael Sharrett | See full cast and crew »"],
      "reviews": [
         "Deadly Friend should probably be good for fans of cult horror films, and this is nothing like some of Wes Craven's past and present films such as \"Nightmare on Elm Street\" or \"Scream\", but it does have a good combination of both the horror classics \"Frankenstein\" and \"Bride of Frankenstein\". However, the script is rather weak and seemed poorly adapted from Diana Henstall's more effect short novel \"Friend\". Deadly Friend does have some good scares and above all gore and a good solid cast from teen stars Matthew Laborteaux, Michael Sharrett and a young beautiful Kristy Swanson in the title role. Both Russ Marin and Anne Twomey provide a warm feeling to the younger cast and the audiences, while Richard Marcus and Anne Ramsey both, as usual, looking wickedly evil in their roles. Above all, Ramsey's classic decapitation by basketball scene is the highlight of the film. One year before she was seen in Steven Spielberg's \"The Goonies\", and a year after this she got an Oscar nomination for \"Throw Momma from the Train\", before dying in 1988. I whould say Deadly Friend gets 8/10, for a classic cult horror favorite.",
         "I love Wes Craven, and will watch anything he writes or directs even if everyone else says it's total crap. Well, DEADLY FRIEND is not total crap, but it might be if it wasn't so damn funny. Starring Kristy Swanson (the original BUFFY) as a girl brought back to life as an android, this film was obviously not meant to be taken too seriously. At least, I hope it wasn't. The acting and directing here are really not too bad, considering the material they have to work with. The premise is silly, of course, and suffers from the fact that the main character is a child. It's not that children in horror movies are always bad... it's just that if you don't get the mix just right, the movie is going to be either laughable (like DEADLY FRIEND) or really, truly awful. However, we can forgive the movie its faults for one reason: The Basketball Scene. This one is worth seeing just for that one scene, perhaps the single most creative use of a basketball ever captured on film. I applaud Wes Craven wildly for such an imaginative bit of cinematic violence. If you like cheesy horror movies, you really have to see this.",
         "A super intelligent teenage whiz revives the love of his life with a chip that used to belong to his robot pal BB. But things don't go all that smoothly as his creation proves to have homicidal tendencies. Is the film weird? You bet. Is it silly? Yeah, kind of. Is it hokey? Definitely. Is it entertaining? Surprisingly Yes. The film is probably as close as you can get to family oriented graphic horror. The characters are not only well acted but extremely likable and that takes the film a long way. Matthew L something brings warmth and charm to his role and his relationship with his mom is cute and wholly believable. Kristy Swanson is pure delight as his \"girl next door love\" and her robotic moves are surprisingly well executed. Like in A Nightmare on Elm Street, Wes Craven is able to create characters who you actually give a damn about and that's what makes this silly premise actually work. The film is pretty funny at times and the graphic horror is sure to delight gore hounds. The basketball scene alone is outstanding. For the most part Deadly Friend is more actual fun than suspenseful, although it does have a few well timed shocks. All in all; A nice effort from Craven. Pretty inventive and overcomes it's weaknesses by being just a plain old fun flick.",
         "Okay, one of my fellow reviewers here on this site described this film in one marvelous \u0096 rather sarcastic \u0096 sentence. In fact, it's so well stated that I'm going to steal it for my own review. The premise of Deadly Friend, ladies and gentlemen: `Boy meets girl, boy loses girl, boy creates lethal cyber-Barbie...'. Deadly Friend introduces Paul, an ultra-intelligent adolescent who build a robot that thinks and handles completely for itself. The robot \u0096 B.B \u0096 is the purest, most advanced piece of technology ever yet it talks with a peppy, blurry voice. Along with his mother, Paul moves to a new town where he continues his Pointdexter studies and falls in love with his sweet neighbor girl (the yummy Kristy Swanson). The girl is terrorized and eventually killed by her monstrous father, a crazy old woman blows B.B to pieces and Paul snaps. He steals her corpse from the hospital and implants her with B.B's artificial brain. Right from the start, this goes wrong as Kristy avenges her death (and how!). Although the undertone of Deadly Friend is downright comic, there are quite a lot gruesome moments and bloody sequences. The plot is highly unoriginal (actually, some sort of lame Frankenstein-variant), the characters are far from believable and the entire production is perfect to claim Wes Craven is an overrated director. Below average, silly film but with \u0096 it has to be said \u0096 one of the coolest killings ever! The basketball-decapitation alone is worth at least one viewing of this film.",
         "Deadly Friend is a largely unknown film from acclaimed director Wes Craven, who became famous for movies like The Hills Have Eyes and The Last House on the Left. But if you give a chance to this thriller you will find something very original and scary...very scary!Deadly Friend is a genuinely frightening experience, it has such a great story that catches you from the beginning to the end. First of all, the plot is original and interesting - Deadly Friend isn't just another horror film, it's in parts a love story and in others it works as an old-fashioned gripping thriller that would make Hitchcock or De Palma proud of. Paul is a new kid in town, and he is a genius in computers and robots. He falls in love with the kind, sweet and vulnerable girl next door, Samantha, but everything ends up bad when Samantha's abusive father kills her. The guy freaks out and steals Samantha's body. He uses all his knowledge in machines and computer chips, and achieves to bring her back...as a killer robot!he takes her to his attic but she soon starts to kill the persons who used to humiliate her. The Cast: the cast is great, terrific performances are delivered by the main actors. Kirsty Swanson is outstanding as Samantha, in the first hour of the film she is so sweet you may fall in love with her, in the last hour she is scary as hell. She is an excellent young star, and in certain ways, she reminds a lot another great young actress, Reese Witherspoon, she has that quality of delivering true-to-life, real performances, and like Reese she has an innocent beauty.Mathew Laborteaux makes a believable character, Paul is a guy who isn't a bad kid, he just is desperate to help the girl he loves but doesn't know how to deal with the consequences of his acts. The Director: Wes Craven once again hits big time!this is one of his greatest films, but it will be a surprise for his fans because, instead of what they saw in The Hills Have Eyes and in most of Craven's films, Deadly Friend isn't so violent. Of course, you get some blood and guts here, but the deaths are relative low. If you want to see a body count, go rent Hellbound Hellraiser 2. Craven's goal here is that he sustains some kind of genuine suspense during the whole film with mastery, something that just Alfred Hitchcok used to do well. The Story: in just one word - OUTSTANDING!this is a different, compelling story, it's a gripping tale that mixes such elements like love and horror, it's an appealing and charming material. If you want to watch something really good, rent this great movie!here you will find suspense, humor, horror and love. It's a great job from great professionals!",
         "\"Deadly Friend\" is one of those horror films that came and went without a trace; but for a die hard horror fanatic like myself, it certainly had it's share of scares, humor, and yes, a surprising human touch. Matthew Laborteaux (a \"Little House on the Prairie\" alum) plays Paul; an egghead teen with a robot pal named BB. In the course of the plot, he meets Samantha or \"Sam\" (Kristy Swanson), an abused, lonely girl who catches the eye of young Paul. Needlessly killed, by her drunk father, Paul vows to make wrongs right, by implanting BB's superchip into Sam's brain....and that my friends, is where the fun (or nightmares) begin. Sam is confused about her new identity, and is naturally seen as a freak. She proceeds to take it out on the locals (including Anne Ramsey, of \"Goonies\" fame, with above all things; a basketball!!), who want this abomination to cease from existing. Wes Craven didn't quite score with this outing, even after the phenomenal success of \"A Nightmare on Elm Street\", but even a flop has it's own merits. Find this little gem, and be sure the lights aren't off!! Grade: C+",
         "***SPOILERS*** Deadly Friend has received a lot of bad press over the years. It's far from accomplished I agree, but then so are a lot of todays contemporary offerings, which have budgets the size of Mars. Much was expected from Craven after the success of A Nightmare On Elm Street, it was by no means an easy time for Craven. When you're faced with a $30,000,000 law suit and a marriage on the verge of total disintegration I would imagine it's quite a task to commit yourself 100% to a film which had also adopted a dozen or so wannabe producers, all with their own 'unique' ideas of where Craven should take his next 'blockbuster'. *Sighs heavily* Despite these interferences Craven, and screenplay writer Bruce Joel Rubin, manage to inject a certain amount of genuine heart and humour in to an otherwise troubled project. Casting was spot on in my opinion, particularly Kristy Swanson, my first ever movie crush!!. Anne (Throw Momma From The Train) Ramsay makes an appearance doing what she does best, looking mean and evil! And Matthew Laborteaux is absolutely perfect as the boy genius. Michael Sharrat lends support as Tom, Pauls friend and partner in crime. Richard Marcus plays the part of Samanthas abusive alcoholic father. I won't go too much in to the plot but suffice to say DEADLY FRIEND is quite an emotional journey, particularly when Samantha appears as herself for a brief moment, we take her POV during the final moments of the film, where her vision returns to normal and the old Samantha appears to be alive and well, of course BB overrides her, and the final act was a bit of a tear jerker for me, well when I was a kid !!!! Bottom line; DEADLY FRIEND had it's moments good and bad, it just goes to show what happens when studio bosses think they're film makers, if you can get past these minor discrepancies you'll find a half decent tale of love trying to survive beyond the grave..... (Whatever happened to Matthew Laborteaux?, highly underrated actor!) 6/10",
         "Deadly Friend is not a bad movie. Looks like alot of critics did not like this movie. But why like a movie like scream? Those movies did not make any sense. Deadly friend had some great scenes. The best I would say is when Sam jumps out the window to attack Paul's friend. This movie had some scary moments. I feel it was overlooked by alot of people. Wes Craven makes good horror movies. He did a great job with this movie. It's really worth watching.",
         "My girlfriend told me of a movie she saw when she was little, about a robot who starts killing people. She couldn't remember much of it, but as I searched for it, she kept telling me how much it impressed her... Obviously this is, as with a lot of child's movie memories, a film which is over-romanticized but in actuality less good then you remember... Though after seeing it I was not really impressed, it left me with some mixed feelings.. GOOD FEELINGS: Positive aspects of the film are in my opinion the idea behind it, Kristy Swanson, Wes Craven and the sometimes eerie music score by Charles Bernstein. Not really knowing what to expect, the film's opening of a car thief being stopped by BB (the robot) made me laugh immediately. The movie made me sad in a way, especially when BB gets blown to bits and the scenes with Kristy Swanson in her zombie form, desperately longing for Matthew Laborteaux' love. Wes Craven's signature is all over the film. With some scary dream sequences (I WAS scared when the father squirted blood all over the place while laughing like a madman) and some sets which looked extremely familiar to me (the cellar in which the father dies for instance, did anyone else got flashbacks of A Nightmare on Elmstreet?) BAD FEELINGS: On the other hand, there were numerous things which I found annoying. A at times very laughable plot, a basketball as a murder weapon and most of all an extremely lousy ending... I've read that Wes Craven wasn't particularly happy with this, wanting another ending and less mindless gore for gore, but the President of Warner Bros. thought differently. Too bad, as it doesn't do ANY good to the movie, which could have been so much more... CONCLUDING: Mixed feelings... Deadly Friend could have been a real cult classic, but doesn't reach for it in my opinion. Though there are some memorable moments (though the basketball-murder is absolutely ridiculous, I'll probably remember it for the rest of my life) and some good emotional moments (how did I feel for poor Kristy Swanson.) The BB robot is cute and you really feel sorry for Matthew Laborteaux when it gets destroyed, but all this barely saves the movie. Though I do not blame Wes Craven, who probably did everything he could to make the best of it, Deadly Friend is JUST good enough... The ending is a real downer, as it left me with disbelief and almost made me forget all the positive aspects of the film and I think the added gore doesn't add much to it as well... 5,5/10!",
         "DEADLY FRIEND This Wes Craven effort may seem a little dated in these post-Scream days, but watching it for the first time in years I realised it may have been an overlooked slice of mid-eighties teen-horror cinema. It's stylistically similar with the lesser cherished of Craven's films, such as Summer of Fear, Deadly Blessing and Chiller, but, like these mentioned titles is worth revisiting. It has the usual Craven touches \u0096 kids in jeopardy, nightmares within-the-film that throw you off balance and dysfunctional relationships, but the film is basically about an intellectual who reanimates his girlfriend by placing the microchip brain of his home made android into her dead body leading murderous results. No one can deny the greatness, if extremely absurd, of that exploding head via basketball scene remains. Bride of Frankenstein and Short Circuit combined may not suite a lot of pallets, but as Wes Craven films go Deadly Friend is definitely not half as bad as the critics claimed at the time of it's initial release."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Pan Arts",
         "Layton"
      ],
      "summaries": [
         "Paul is a new kid in town with a robot named \"BB\". He befriends Samantha and the three of them have a lot of good times together. That is, until Samantha's abusive father throws her down some stairs and kills her. In an effort to save her life, Paul implants BB's computer brain into Samantha's human brain.",
         "A 15 year old scientific whiz kid named Paul Conway, just moved to a new town with his mother. He also has a yellow robot named Beebee which is his friend and protector. Paul befriends the girl next door named Samantha, and she lives with her abusive father who knocks her down some stairs one night and severely injures her. She was on life support in the local hospital, but after a certain amount of time, they pulled the plug on her and she was dead. Paul disguises himself as a hospital worker and takes Samantha's body from the hospital over to the local university. As an attempt to save her life, he implants Beebee's robot microchips into her brain, but discovers not too long after that she is out of control.",
         "Paul Conway is the new kid in town, who has his own invention, a robot named BeeBee. Paul becomes friends with Samantha, the girl next door, but his efforts to see her are frequently thwarted by her abusive and jealous father Harry. On Halloween, Paul plays a prank on his sinister neighbor, Elvira a mean evil old woman who lives across the street from him. However in a fury, Elvira destroys Paul's robot BeeBee. Several weeks later, Samantha is murdered by her father. In a desperate attempt to save his new love, Paul implants BeeBee's microchips into Samantha's corpse and successfully brings her to life, but he doesn't realize that his friend has become an unstoppable monster bent only on murder and destruction."
      ],
      "budget": 0
   },
   "movielensId": 2465,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1986-10-10",
      "dvdReleaseDate": "2007-09-25",
      "directors": ["Wes Craven"],
      "runtime": 91,
      "movieId": 2465,
      "title": "Deadly Friend",
      "mpaa": "R",
      "actors": [
         "Matthew Laborteaux",
         "Kristy Swanson",
         "Michael Sharrett",
         "Anne Twomey",
         "Anne Ramsey",
         "Richard Marcus",
         "Russ Marin",
         "Lee Paul",
         "Andrew Roperto",
         "Charles Fleischer",
         "Robin Nuyen",
         "Frank Cavestani",
         "Merritt Olsen"
      ],
      "imdbMovieId": "0090917",
      "originalTitle": "Deadly Friend",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "Qz9550Mw4mI",
         "N-jkDKr2eIg"
      ],
      "plotSummary": "Paul is a new kid in town with a robot named \"BB\". He befriends Samantha and the three of them have a lot of good times together. That is, until Samantha's abusive father throws her down some stairs and kills her. In an effort to save her life, Paul implants BB's computer brain into Samantha's human brain.",
      "tmdbMovieId": 33278,
      "avgRating": 2.28519,
      "releaseYear": "1986",
      "numRatings": 270,
      "posterPath": "/cLuIQDB0SjvptANfLTpNxs9tXcP.jpg"
   }
}