{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "louisiana",
            "id": 3134
         },
         {
            "name": "racism",
            "id": 12425
         },
         {
            "name": "cajun",
            "id": 155180
         },
         {
            "name": "whipping",
            "id": 170335
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0090710",
      "video": false,
      "title": "Belizaire the Cajun",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 1,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 0,
               "character": "Belizaire Breaux",
               "gender": 2,
               "credit_id": "5479228e9251412983000993",
               "name": "Armand Assante",
               "profile_path": "/m9DCpe9HkIXEAp3aq1wKpmN8mih.jpg",
               "id": 23346,
               "order": 1
            },
            {
               "cast_id": 1,
               "character": "Alida Thibodaux",
               "gender": 0,
               "credit_id": "547922ae925141297e000b04",
               "name": "Gail Youngs",
               "profile_path": "/p7LUAKrR7CfsVY6Fm1YHMORQRfn.jpg",
               "id": 169375,
               "order": 2
            },
            {
               "cast_id": 2,
               "character": "Hypolite Leger",
               "gender": 0,
               "credit_id": "547922ebc3a3685c560009fd",
               "name": "Michael Schoeffing",
               "profile_path": null,
               "id": 1390859,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "James Willoughby",
               "gender": 2,
               "credit_id": "5479230ec3a3685c51000a0f",
               "name": "Stephen McHattie",
               "profile_path": "/vSssg0R2VJLBUF0tb2rA4Vhsc4j.jpg",
               "id": 230,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Matthew Perry",
               "gender": 2,
               "credit_id": "5479232a925141297e000b26",
               "name": "Will Patton",
               "profile_path": "/qpycaaWP1oUx1Wd2lMBfQtR7qDO.jpg",
               "id": 883,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Rebecca",
               "gender": 1,
               "credit_id": "54792344c3a3685c53000ad7",
               "name": "Nancy Barrett",
               "profile_path": null,
               "id": 1217687,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "The Preacher",
               "gender": 2,
               "credit_id": "54792366c3a3685c56000a23",
               "name": "Robert Duvall",
               "profile_path": "/1aBC7NxPy10ofng6HsJBecJ1vMZ.jpg",
               "id": 3087,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "5479238ac3a3685c4e000aae",
               "name": "Glen Pitre",
               "profile_path": null,
               "id": 107181,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5479239ec3a3685c56000a30",
               "name": "Glen Pitre",
               "profile_path": null,
               "id": 107181,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.240129,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 274253,
      "vote_count": 2,
      "budget": 0,
      "overview": "In 19th-century Louisiana's Cajun country, Belizaire (Armand Assante) is the informal spokesman for his citizens, who don't see eye to eye with local racists who wish to eradicate all Cajuns. Complicating matters is the fact that Belizaire's former flame (Gail Youngs) is now married to his biggest rival (Will Patton), an affluent landowner's son. Before he knows it, Belizaire is caught up in a web of murder, lies and prejudice.",
      "similar": [
         581,
         68718,
         281957,
         381284,
         50014,
         10637,
         1640,
         10530,
         10198,
         600,
         1955,
         6114,
         82695,
         616,
         72976,
         76203,
         393457,
         147441,
         407448,
         205775
      ],
      "original_title": "Belizaire the Cajun",
      "runtime": 103,
      "poster_path": "/6Nm19lP4RfS8vmhaaqaBfqqicN8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Cote Blanche Productions",
         "id": 22490,
         "origin_country": ""
      }],
      "release_date": "1986-06-13",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Glen Pitre"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Glen Pitre"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090710/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTExOTAxNDQ0NzheQTJeQWpwZ15BbWU3MDgxNzI1NTE@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Armand Assante, Gail Youngs, Michael Schoeffling | See full cast and crew »"],
      "reviews": [
         "BELEZAIRE THE CAJUN is a film with a major problem. It tries to tell about a rather obscure part of American history (and THAT kills a mass market box office hook to get 'em into the theaters), and it tries to tell the story in an accurate, realistic way that doesn't whitewash some of the darker aspects of America's past. John Sayle's film MATEWAN did the same thing, and has exactly the same problems... and like MATEWAN, BELEZAIRE THE CAJUN is a deep, intense, and INTELLIGENT film which demands an intelligent audience. There's a big difference between the two films tho; BELEZAIRE tells it's story with a large dose of HUMOR along with the serious realities. In short... people either LOVE the film, or they HATE it. I'm on the LOVE side. Unless you lived in Cajun country, it's probable that you never learned anything about thier history or culture in school. To those of us who didn't, the film is a painless and interesting introduction... for me, it opened a door for further exploration. Up to BELEZAIRE THE CAJUN, the only exposure I'd had to this culture was an insane Cajun drill sergeant at Lackland Air Force Base... and suffice it to say that HE wasn't a strong inducement to further exploration of the subject! Just the same tho, BELEZAIRE had the effect of giving me a bit of understanding of where old Sergeant Cormier was coming from culturally, and long after the fact I understood him just a bit better. An awful lot of us don't realize that Cajuns were, and ARE, a discriminated against minority in America. Learning that alone is worth the time to see the film. Besides that lesson, we get a pretty good overview of Cajun life and culture in the period. We see a fiercely independent people who accepted thier isolation from the American society at large and did so proudly, building thier own society within the American one, deep in the Louisiana bayous. As I said... this is a film that you either hate or love, but I'd recommend it strongly.",
         "This is a very good film for those who only think that American History is only about American Independence, Civil War and Cowboy's and Indians. There are many more stories to be told about America like the Cajuns, the American/Mexican war, American Indians and not just slavery of African-Americans. I agree that this film is may not be very sophisticated, action packed and the story line is relatively easy to predict. But, all that aside, Asante does a very good job and shows his talent in attempting to play a cultural role that he is not. His attempt to act \"Cajun\" and attempt to speak the Cajun dialect underlines his acting ability. This film is very underrated only because it is not very well know. There are not enough films about our culture and this film is a good starting point. It is amazing that no other film attempts, since 1986, to tell the story of the persecution of the Cajuns/Creole culture in the South during this time period. I know that this does not compare to the persecution of the African-American slaves during the same period, but it does attempt to show the similarities. And, if you go to the real Cajun Country today(not New Orleans), you will enjoy the brotherhood, hospitality and friendliness that is comparable to none.",
         "This is a fine film-- not necessarily a great one, but one with some great content. Armand Assante, who like the late character actor, J. Carrol Naish, is able to place himself seamlessly in almost any ethnic role, from a Cuban to a Greek, is Belizaire, the Cajun. Little knowledge will be gained about these marvelous people who were expelled in early 19th century British ethnic cleansing from L'Acadie, a region near present-day Quebec, to the Dominican Republic, scattered along the eastern seaboard of the US and then making their way back to Francophone Louisiana. The term 'Cajun,' comes from a local pronunciation of Acadian. The Cajuns fiercely separate themselves ethnically from the other descendants of the French immigrants, the Creoles both culturally and linguistically and doggedly maintain their cultural traditions into the present time. This film, which is not at all badly done, touches little of that and gives only a tiny taste of Cajun culture...but in the brief spot using the music of Michael Doucet and his band, Beausoleil-- what a taste! The plot, Belizaire is an entrepreneur and pleasant con-man who's in a love competition with Will Patton (in an early role), leads to complications in which Belizaire is willing to sacrifice his life to bring peace with his non-Cajun neighbors. In the end, Belizaire uses his quick wits and con-man skills to make the situation right. I would have liked to have seen much more of the Cajun way of life brought in. But, there were some fine local scenes and the costumes and settings looked great. The Cajuns are a fascinating group of people with wonderful music and traditions. We get only occasional glances of this rapidly disappearing way of life and this film adds another glimpse which should not be passed up, no matter how imperfect it is. This film is available on video and is certainly worth the price of rental. If it crops up on the late show, I would certainly check it out.",
         "I am puzzled by the low rating for this film. It stands as one of my all-time favorite films. Every aspect of it shines, writing, directing, acting, soundtrack. It's a beautiful film about a little-known piece of American history, and it shows the underpinnings of a culture most of us know only as a reference to food. In particular, the soundtrack by Beausoleil is a masterpiece of fitting the cultural music to the mood. Cultural insights aside, the story is moving and the characters are fully realized individuals. Belizaire in particular is complex, funny, and touching -- a healer who gets by on his wits and truly cares for his people. Don't let the low-rating here dissuade you. If you get the chance to see the movie see it, and you may find a lifelong favorite, too.",
         "When I was a teenager in Baton Rouge, La. in 1986, I saw a large newspaper ad for this movie, Belizaire the Cajun, in my local paper, the Morning Advocate (now simply The Advocate). Among the critics that praised the movie in the ad was one David Foil who wrote his full-length reviews that appeared every Friday in the FUN section every week. I don't remember him having one of this in any FUN section but the fact that this got such a large ad in our paper obviously meant that this was a very important movie for Louisiana citizens based on the subject matter and the fact that the filmmaker, writer/director Glen Pitre, came from the state. Having now seen Belizaire the Cajun 21 years after its original release, I can now say what an awesome drama about the Cajuns and their struggles against the prejudice of certain white Americans who settled in The Pelican State, this is. Armand Assante plays the title character, who is a healer of various illnesses, with such a sense of humor and pride in his heritage that you're with him all the way with his attitudes on various peoples that upset him. Among them are Will Patton as the father of the children of Gail Youngs who has a history with Assante, and Stephen McHattie who is Patton's brother-in-law and seems to hate Assante and his people even more than Patton. Michael Schoeffling, best known as Molly Ringwald's crush Jake Ryan in Sixteen Candles, plays a cousin of Assante's who gets in trouble. And someone related to director Pitre named Loulan plays the sheriff. Plus there's a cameo by Robert Duvall, who helped get this film made, as a preacher. All of the performances I've just mentioned plus others are excellent as well as the Cajun music played by Michael Doucet and Beausoleil. Without giving anymore away, I'll just say the cliché, you'll laugh and cry and possibly think of how far we've come culturally a century or so since those times. And maybe hope to find someone to dance to the wonderful Cajun music that's presented here...",
         "This is a film that I was deeply interested in, as I had a sort of vested interest in it. Almost every horse in the film, except 3-4 horses that were brought in from I am guessing California, were from the stable where I boarded my horse and took lessons. I was in high school, so when the movie came out I dutifully saw it, but it did not hold great interest with the exception of figuring out which horse was which. I did get to watch many of the actors take riding lessons from my riding instructor( who was trained in Germany and Egypt) All of the cast was exceptionally nice, none of what you read about regarding how stars act etc.. of course, I was allowed into the stable, since I both owned a horse there, worked for the stable and helped each morning get the horses loaded into the line of trailers to head out to various locations. I also was present to tack up and get the horses warmed up and cooled down for the lessons that my instructor gave the stars.. so that helped but i was not treated like, a kid or like help.. not about the movie, but definitely about the stars in the movie. On to the movie, now that I am an adult and I have lived all over the country. I value this movie greatly. I am not Cajun, but I did grow up here. My family well, my grandmother's mother came directly from France and my grandfather's family descended from a tax collector sent over by the Spanish king when Spain was the owner of Louisiana. I love the movie now because,well it shows what I have always known, that Cajuns are a fiercely loyal, independent, determined people. Family is everything, God, family, community and then everything else.. there are very few places that i have lived where i have seen this.. you see it among the Amish and the Mennonite peoples.. you see it some in the small pioneer towns that have not been invaded by tourist and everything else in the mountains of Colorado, that fierce loyalty to God, to family and to the community, most everywhere else, it just doesn't show up nearly as much or it does not seem to. This movie is a little bit of everything, with a taste of the music, the history and so very much more.. unfortunately in 2006, the Cajun culture is quickly disappearing as we have so very many people from all over the world living in the heart of Cajun country.. and make no mistake, there is a huge difference between creole and Cajun.. between the acadiana region and new Orleans.. the food is different, the people are different and the culture is different. When i was growing up, it was not unusual to walk into small country stores and hear people speaking Cajun french, it is disappearing, it is rare to hear it now.. and it will soon be lost like so many other minority languages in this country, from Native American languages to other pockets of people.. anyway, the movie is good, it has some really wonderful actors in it, it is worth seeing, it does take some intelligence, it is not a mass market movie.. it has to be watched as a period piece..",
         "I rented this movie just because it was about Cajuns and I thought it might be somewhat interesting. Little did I know that it would become one of my all time favorite movies. I kept it for two weeks and watched it 5 times. (This is why I love renting DVDs online... no due date!!! ) This movie is educational, inspirational, adventurous, suspenseful, and very romantic!! I learned about the trials and tribulations the Cajuns had to endure. I was inspired by the loyalty and integrity of the characters. I was excited by the action and intrigued by the mystery. By the end of the movie, I was in love... with Belizaire and the Cajuns. The movie is actually a love story/ murder mystery; however, it is also about the discrimination and hatred the Cajuns had to endure. It is about their lifestyle, culture, and even gives you a delicious taste of Cajun music. I have a friend that is a Cajun from Houma, Louisiana and she says that it is very authentic and true to the Cajun's history. Last, but certainly not least, I must mention Belizaire himself. For all you ladies out there.... He is INCREDIBLE!! He is handsome, gentle, romantic, passionate, humorous and plays one heck of an accordion!! I would allow him to be my \"healer\" anytime!! *grin* I do not buy many movies because once I have seen them a time or two I usually lose interest. This is one that I will be adding to my collection though. It is not often that you come across a movie of this high quality. AND it is a movie the entire family can watch. My 11 year old daughter watched it with me and liked it too. (although not as much as I did) Let me finish by saying that I STRONGLY recommend this movie to anyone who appreciates an intelligent and entertaining storyline.",
         "BELIZAIRE THE CAJUN is a trickster's tale. Belizaire (Armand Assante) is a healer and community leader who is standing against a displacement of a small Cajun settlement in rural Louisiana that is being led by \"good white citizens\" like Old Perry (Ernie Vincent), his reluctant son Matthew (Will Patton), and his obnoxious gung-ho vigilante son-in-law, James Willoughby (Stephen McHattie). Matthew Perry is a torn personality, as he has \"gone native\" with a beautiful Cajun woman Alida Thibodeaux (Gail Youngs) and is the father of her son and a child she is pregnant with. Belizaire nurses an old love for Alida, and this is a source of tension between he and Matthew that the surrounding community is aware of. In addition to this conflict, there is an underlying problem between Matthew Perry and his brother-in-law Willoughby, who seeks to run the Perry plantation, but is distrusted by both Old Perry and his daughter Rebecca (Nancy Barrett). Beyond these issues, there are the problems engendered for the Cajun settlement by the mischief of petty raiders like Hypolite Leger (Michael Schoeffling), a man whose own family has been displaced by earlier seizures of Cajun land and livestock. Before the story is over, Matthew Perry is dead, Belizaire winds up charged with his murder, and a lot of wheeling and dealing is done under the auspice of a Machiavellian sheriff (Loulan Pitre) and the parish priest (Allan Durand), all of which is brought to closure during a most amusing hanging scene that marks the climax of the work. With BELIZAIRE THE CAJUN, film maker Glen Pitre gives us a trickster's tale that is steeped in a little known chapter of United States history. And that chapter, which is as \"all-American\" as the white-led anti-black riots in St. Louis during the First World War and the U.S. led massacre at My Lai in Vietnam, is a semi-fictional chronicle of the harassment of the Arcadian (or Cajun) peoples of Southwest Louisiana in the years before the Civil War. It's a story that bears telling, and Pitre and his cast pull it off with a lot of humor as well as a \"no foolin'\" tone. The beautiful soundtrack provided by Cajun musicians Beausoleil adds depth and atmosphere. BELIZAIRE THE CAJUN is a \"ringer\" to be sure.",
         "Absolutely brilliant! Why none of the cable networks haven't made it into a series is beyond me. Probably best enjoyed by those over 30 who like intelligent fare. The director's sense of humour and humanity remind me of Francois Truffaut's best work. Armand Assante turns in an excellent performance in the title role of Belizaire.",
         "Belizaire the Cajun sates my movie palate on every viewing, with a rich gumbo of music, smartly comic characters, romance, and social passions. The community's herbalist healer, Belizaire (Armand Assante), does all he can to defend his friends from vigilantes threatening to banish or hang them. Compromise is not in his nature, but bargaining is. The resulting passion play reveals the tangle of power in the community. Belizaire is as fun to watch as The Lion In Winter, and more uplifting, because its motivations include love and justice, in addition to power and intrigue. Relationships in movies are rarely as real as in Belizaire the Cajun, so I especially recommend it to reality TV fans."
      ],
      "genres": [
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": ["Cote Blanche Productions"],
      "summaries": ["A Cajun man attempts to save his town."],
      "budget": 0
   },
   "movielensId": 2466,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-06-13",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Glen Pitre"],
      "runtime": 103,
      "movieId": 2466,
      "title": "Belizaire the Cajun",
      "mpaa": "",
      "actors": [
         "Armand Assante",
         "Gail Youngs",
         "Michael Schoeffing",
         "Stephen McHattie",
         "Will Patton",
         "Nancy Barrett",
         "Robert Duvall"
      ],
      "imdbMovieId": "0090710",
      "originalTitle": "Belizaire the Cajun",
      "genres": [
         "Romance",
         "Drama",
         "History"
      ],
      "youtubeTrailerIds": ["6njbHjbb5CU"],
      "plotSummary": "In 19th-century Louisiana's Cajun country, Belizaire (Armand Assante) is the informal spokesman for his citizens, who don't see eye to eye with local racists who wish to eradicate all Cajuns. Complicating matters is the fact that Belizaire's former flame (Gail Youngs) is now married to his biggest rival (Will Patton), an affluent landowner's son. Before he knows it, Belizaire is caught up in a web of murder, lies and prejudice.",
      "tmdbMovieId": 274253,
      "avgRating": 3.4,
      "releaseYear": "1986",
      "numRatings": 85,
      "posterPath": "/6Nm19lP4RfS8vmhaaqaBfqqicN8.jpg"
   }
}