{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "crocodile",
            "id": 3185
         },
         {
            "name": "knife",
            "id": 4728
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "aftercreditsstinger",
            "id": 179430
         }
      ],
      "imdb_id": "tt0092493",
      "video": false,
      "title": "Crocodile Dundee II",
      "recommendations": [
         9671,
         9290,
         10303,
         10136,
         96,
         12118,
         150,
         10587,
         10157,
         9336,
         11595,
         10057,
         9604,
         951,
         8845,
         9493,
         306,
         11584,
         6951,
         12154
      ],
      "backdrop_path": "/rmFgu0cYwKiWB3rPlMztCUz6ACc.jpg",
      "revenue": 239606210,
      "reviews": [
         {
            "author": "John Chard",
            "id": "5424b0650e0a263b7a00455b",
            "content": "The Crocodile Who Walks Like a Man.\r\n\r\nAfter the coinage and all round good will generated by the first Crocodile Dundee movie, the sequel was inevitable. This time the formula is reversed as Mick Dundee (Paul Hogan) is forced to take his lady, Sue Charlton (Linda Kozlowski), back to the wilds of Australia in order to protect her from gangsters. There, Mick, with all his Outback skills, starts to pick the gangsters off one by one.\r\n\r\nNah. I don't need a gun. I got a Donk!\r\n\r\nWithin the plot structure there are numerous occasions for Dundee inspired jokes and scenarios, where although they are not as strong as in the first movie, they are amusing and not straining for the laugh factor. The genuine chemistry between real life couple Hogan and Kozlowski is evident and keeps the film grounded in warmth. Hogan is such a likable guy, he's a natural at playing the rugged adventurer type, and it's his charisma that rightly drives the picture forward. He throws a great punch as well, very believable.\r\n\r\nReturning characters like Wally and Donk are reassuring presences, while Charles Dutton as Leroy Brown provides solid comedy foil for Dundee during the New York part of the plot. The Northern Territory of Australia is once again the visual bonus (cinematography again by Russell Boyd), though we never really get the sweeping shots the setting deserves, and Peter Best once again provides an appropriate musical score for the two continent setting without pushing anything new on us. Problems elsewhere? There's a raft of stereotypes, particularly with the Ernie Dingo led villains, while the unoriginality of the story (a rehash of the first film) is a touch frustrating.\r\n\r\nNot exactly great and not deserving of the ill advised second sequel that followed 13 years later, part 2 of Mick and Sue's adventures is none the less still a fun way to spend an afternoon. 6.5/10",
            "url": "https://www.themoviedb.org/review/5424b0650e0a263b7a00455b"
         },
         {
            "author": "talisencrw",
            "id": "573783549251417b5e003d0f",
            "content": "I remember enjoying the film's star Paul Hogan's commercials for 'Foster's Lager', on television back in the day, when I was growing up. His identification with Australia, and the outback, made him original and gave him worldwide fame. Though I never bothered with the much-more esteemed original, which came from nowhere and captured the imagination of filmgoers worldwide, this was charming and likeable despite its unimportance and relative inanity. The small barrel of jokes wear thin after a while, and the magic ran out as it did for the 'Romancing the Stone' sequel, 'The Jewel of the Nile', not much earlier, or more recently, the insipid retread of 'My Big Fat Greek Wedding'. Their decent attempt to capture lightning in a bottle unfortunately fell short. One could envision that if this couple existed in real life, their entrenched philosophical differences would mount, and they would end up breaking up after a few years, at most. This is the sort of thing that only works 'in the movies'.",
            "url": "https://www.themoviedb.org/review/573783549251417b5e003d0f"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael J. 'Crocodile' Dundee",
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b368b",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sue Charlton",
               "gender": 1,
               "credit_id": "52fe44f2c3a36847f80b368f",
               "name": "Linda Kozlowski",
               "profile_path": "/9qgl8JSTVOLtVVPshXclSGxiP57.jpg",
               "id": 57166,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Walter Reilly",
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b3693",
               "name": "John Meillon",
               "profile_path": "/dKsqaE8GZ2YjdFREpe17QVVnsGJ.jpg",
               "id": 42841,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b3697",
               "name": "Ernie Dingo",
               "profile_path": "/1G11aiwavGIivegyLsh9QhKuSlH.jpg",
               "id": 57593,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Leroy Brown",
               "gender": 2,
               "credit_id": "54de23f4925141194b001bb6",
               "name": "Charles S. Dutton",
               "profile_path": "/ajXBoMz8xGgDDcn8xpRi8LmXKKa.jpg",
               "id": 17764,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Jose",
               "gender": 2,
               "credit_id": "54de2412925141195000197d",
               "name": "Luis Guzmán",
               "profile_path": "/e6mIeGBDkNFZwFDoskcetgkU5oH.jpg",
               "id": 40481,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "DEA Agent",
               "gender": 2,
               "credit_id": "54de24559251411956001a2a",
               "name": "Stephen Root",
               "profile_path": "/sceCvLiv8xe2jQzrVn39wvosVHG.jpg",
               "id": 17401,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Bob Tanner",
               "gender": 2,
               "credit_id": "54de2474925141194b001bce",
               "name": "Dennis Boutsikaris",
               "profile_path": "/2CzntEpJZ4azYIGS6rstIqhxfPT.jpg",
               "id": 118937,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Park Girl",
               "gender": 1,
               "credit_id": "54de24afc3a3684558001ab1",
               "name": "Tatyana Ali",
               "profile_path": "/7Mzcrk00fmLKS1VwQwouTHmwOXP.jpg",
               "id": 4996,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Onlooker at Mansion",
               "gender": 2,
               "credit_id": "54de24d7c3a3684558001abb",
               "name": "Colin Quinn",
               "profile_path": "/i1bEo7q7XJX6mYHA52Z7hhLyDg6.jpg",
               "id": 1219901,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b369d",
               "name": "John Cornell",
               "profile_path": null,
               "id": 57594,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36a3",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36a9",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f2c3a36847f80b36af",
               "name": "Brett Hogan",
               "profile_path": null,
               "id": 57595,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36b5",
               "name": "John Cornell",
               "profile_path": null,
               "id": 57594,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36bb",
               "name": "Paul Hogan",
               "profile_path": "/grSTZhz6ewU6LSTt3l8PbwGbw97.jpg",
               "id": 57147,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44f2c3a36847f80b36c1",
               "name": "Jane Scott",
               "profile_path": null,
               "id": 57596,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36c7",
               "name": "Peter Best",
               "profile_path": null,
               "id": 3048,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36cd",
               "name": "Russell Boyd",
               "profile_path": null,
               "id": 31027,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f2c3a36847f80b36d3",
               "name": "David Stiven",
               "profile_path": null,
               "id": 46952,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 11.569807,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 9396,
      "vote_count": 389,
      "budget": 0,
      "overview": "Australian outback expert protects his New York love from gangsters who've followed her down under.",
      "similar": [
         9555,
         9671,
         9659,
         8810,
         9355,
         253,
         2759,
         36040,
         639,
         928,
         1724,
         10096,
         2642,
         87,
         164,
         284,
         1771,
         772,
         274854,
         76341
      ],
      "original_title": "Crocodile Dundee II",
      "runtime": 110,
      "poster_path": "/m8DRsyNMD1pzWIgOb7X6XN7R3y0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1988-05-19",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/mDvp9Z5ho5BTIlY1mS9qdb7rnVR.jpg",
         "name": "Crocodile Dundee Collection",
         "id": 9332,
         "poster_path": "/yoA2hgb0PoArTAqjsJhFyzwVH0C.jpg"
      },
      "tagline": "The world's favourite adventurer is back for more! much more!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": ["John Cornell"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Paul Hogan",
         "Paul Hogan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092493/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxOTg3NTM3OF5BMl5BanBnXkFtZTcwNjgwODgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul Hogan, Linda Kozlowski, John Meillon | See full cast and crew »"],
      "reviews": [
         "I know I am in the minority here but I actually liked this sequel better than the original...and the original was very good and extremely popular. Maybe I was biased because I played this with some kids present and was pleasantly surprised to hear almost no profanity, which I couldn't say was the case in the first film. It was a \"cleaner\" movie, and still an equally entertaining one with a good mix of drama, action, comedy and even some good music thrown in. The film has no lulls and 110 minutes go by pretty quickly. The first half of this movie takes place in New York City, where we last saw \"Mick Dundee\" (Paul Hogan). The second half, the crocodile man takes his bride (Linda Kozlowski) back to the outback in Australia. Hogan was never more entertaining and, of course, feeling comfortable back in his home territory. This is just a fun ride all the way and, yes, to use a cliché, good family entertainment.",
         "If this movie is on TV, I will watch it all the way through. I don't know why exactly, but I do. It's got some strange hold over my psyche and it just won't let go. It's nice to know that there are 111 other people who give this movie a 10. If I remove myself from the addiction, I know it's more like a 7 or even a 6 but I have to acknowledge it's wonderous nature for an idle afternoon. Bravo, Mick. Bravo!",
         "When I saw the low rating this movie received, I was flabbergasted and knew I had to comment. What on earth does it take to entertain people these days? The Australian outback's Mick Dundee is surely one of the cinematic world's most charismatic characters and amusing adventurers. Here he's back in a sequel that's every bit as fun as the original tale. The previous movie begins in Australia and then moves to New York. By contrast, as this film opens, Mick is settled in New York with his beautiful journalistic girlfriend, Sue Charlton. However, Sue's ex husband is murdered in Colombia after taking pictures of a drug cartel's dealings. He has sent these photos to Sue, resulting in her being kidnapped by Rico and the other drug hoodlums. Mick must come to her rescue and the pair then head for safety to HIS terrain Down Under, naturally pursued by the gangsters. As in the original, there's plenty of fun in the sequel. Mick's assault on the drug kingpin Rico's house, assisted by a likable but very amateur young gang, makes for some pretty entertaining scenes. Once Down Under, it's non stop pranks cooked up by Mick as he & his 'sheila' traipse around his own bush 'estate', with the urban villains hot on their trail (and often vice versa!). Suffice it to say, some of Mick's crazy antics almost make you feel sorry for the bad guys! Sue Charlton (played by actress Linda Kozlowzki) always looks lovely and perfectly groomed, whatever the bush conditions! Once again, the chemistry between her and Mick sizzles throughout the tale. Mick's bumbling but totally endearing sidekick, Wally, is back and there's also a couple of amusing aboriginal characters. As for Mick himself (actor Paul Hogan), he still has the same charm and affability as in the original. This time he's really having the time of his life with the villains. Don't listen to the naysayers, it's a highly entertaining yarn. The next sequel, Crocodile Dundee in Los Angeles, is definitely watchable...I can never resist Mick...though not quite up to the same standard.",
         "As I have said on some of my other comments, it is rare for a sequel to be as good as it's predecessor but Crocodile Dundee II does that very thing. Paul Hogan is great as the naive Crocodile Dundee who goes to war against drug dealers in this film. I won't spoil any of the scenes for anyone but they are all great particularly the ones that take place during the last quarter hour. There's also a great scene where Dundee talks to a suicide jumper atop a building. Paul Hogan doesn't do as many films as most actors which I think is better because he only acts in movies that are good. Linda Koslowski is back as Sue Charlton and she does a great job again. She and Paul Hogan had great chemistry. This is a great sequel to a great film. Check it out.",
         "Paul Hogan is back as Mick 'Crocodile' Dundee and he still living in New York with his gorgeous girlfriend (Linda Kozlowski) and he's still having a little trouble adapting. That is until they become the target of some drug lords and Mick decides to lead them back to the Austrailian Outback to even up the chances a little. OK Crocodile Dundee II is not as fresh or as funny as the first film, but it still has plenty of laughs, plenty of action and once again some beautiful scenery. Its a good sequel to a great film 6/10",
         "\"Crocodile Dundee II\" opened a short year-and-a-half after the first movie, when the original film became a blockbuster hit all over the world. Paul Hogan and Linda Kozlowski return for a second go round of adventures as Australian adventurer Mick Dundee and New York reporter Sue Charlton. This time the movie reverses the original by opening in New York and concluding in Australia. Interesting idea. However, \"Crocodile Dundee II\" isn't quite as good as the original. The main problem with this movie is that it isn't as funny as the first film. The second installment has a more serious tone to it, thanks in part to a plot involving drug lords presuing our heroes. The laughs seem to come in few and far between, which wasn't the case with the original. Still, there's lots to like here. Hogan is fine as he was in the first film, as is Kozlowski. There are funny moments in the film, and it has dangerous adventure that keeps the movie entertaining. A good movie, but not a great one. **1/2 (out of four)",
         "Whilst not as smooth, slick or satisfying as the box-office storming original, Paul Hogan's sequel is still crowd-pleasing entertainment and for those who felt the first film could have done with a tweak in the plotting department, Hogan seems to have moved up a gear here. The plot is in fact reverse to the original with Aussie Mick Dundee running into trouble when his journalist girlfriend Sue (Linda Koslowski) is kidnapped by an evil drugs baron. \"I need to be someone where I can see them coming\", the hero exclaims and that can only mean one thing - a return to the bush! Indeed, the second half of the film in Australia is notably more successful and inventive. Hogan's screenplay again features a bunch of memorable and exciting moments, whilst the delightful Peter Best score is also retained.",
         "If you saw the original, this one will seem like a visit with an old friend, that being the likable Mick `Crocodile' Dundee. This time around there's not as much `whimsy' to it, though, and as things get a bit more heavy-handed, Mick finds himself in some rather murky waters as the story unfolds. Still, the appeal of the character and the easy, intrinsic humor at the heart of the film is enough to make `Crocodile Dundee II,' directed by John Cornell, a satisfying cinematic experience. As the film opens, Mick (Paul Hogan) is happily ensconced in New York City with his lady-friend, journalist Sue Charlton (Linda Kozlowski), and life is good. Mick, however, tired of just laying about has decided it's time to seek gainful employment, and sets out to do just that. His job search gets put on hold, though, when Sue's ex-husband, Bob Tanner (Dennis Boutsikaris), a journalist currently covering a story in South America, sends some photographs he's taken-- the subject of which is of a particularly serious and sensitive nature-- to Sue, and something else arrives along with the them: Trouble. Trouble, as in the man in the pictures is one `Rico' (Hechter Ubarry), a big time drug dealer who is more than a little concerned about the compromising position these particular photos will undoubtedly put him in. He will stop at nothing to get them, and he has the `muscle' to do it. But there's one small item Rico hasn't factored in to his agenda and his plan of attack. And his name is Mick Dundee. Written by Paul Hogan and his son, Brett Hogan, this film suffers the `Indiana Jones and the Temple of Doom' syndrome, in that-- like the `Indy' film-- it is a sequel to a hugely successful original, and takes that same `turn' toward the dark side. And in the case of this film, it's even more noticeable inasmuch as this is a comedy rather than a pure action/adventure movie, and-- let's face it-- it's tough to find a light, comedic touch in a film that deals with a kidnapping, killings and drug dealers. Still, just as Spielberg did with the `Indy' sequel, Hogan pulls it off; and he does it with a winning smile and bit of sleight-of-hand. As the great Steve Allen would say, `All seriousness aside, folks--' And in a nutshell, that's the trick Hogan, Hogan and Cornell use to make this offering a viable commodity. Taken out of context, the story alone is serious stuff, more conducive to a `Traffic,' `Blow' or `Scarface' than a `Crocodile Dundee' movie. But therein is the rub; the filmmakers here take a lighthearted approach to a serious issue, being careful, however, not to discount or be dismissive of it, but rather by toning down the `results' of the violence while infusing it with humor and some genuinely engaging characters, and presenting it all in a way that is palatable to a wide audience. Cornell, like Peter Faiman (who directed `Crocodile Dundee'), is destined to be the forgotten man of this project, and for the same reasons. Cornell takes the wheel of the ship here, takes his audience on a cruise then deposits them safely back on shore, where most will agree it was a trip worth taking. But in the end, there is nothing about it that identifies Cornell; nothing with his `signature' on it. And, like Faiman, he only directed one other film, `Almost an Angel' in 1990 (also starring Hogan and Kozlowski), which was mediocre at best. So there's simply nothing to reference him. He may have been the captain of the ship, and he did a good job, technically speaking, but he kept himself in the wheelhouse too long to be noticed. Hogan, meanwhile, was taking center stage in the lounge, successfully reprising his role as everyones favorite `Aussie.' Without question, no matter what Paul Hogan does for the rest of his career, this is the character moviegoers everywhere will forever associate him with, and for good reason. Quite simply, Mick Dundee is just such a likable bloke. And it's a theme that runs throughout the entire series-- everybody likes him; no matter where he goes or who he meets, he makes them feel as if they've known him all their lives. He's amiable, good looking, charismatic, and has an entirely non-judgmental, matter-of-fact way of dealing with people and situations that provides a refreshing perspective on the human condition. That's what makes this character so memorable, and there's no getting around it: Just as Leonard Nimoy will always be `Spock' regardless of whatever else he ever does, Hogan will always be Crocodile Dundee. Because he IS Mick Dundee. Also in fine form for this second go \u0091round is the beautiful Linda Kozlowski, returning to the role she created in the original, Sue Charlton. And-- as in the first one-- it's the on screen chemistry between Kozlowski and Hogan that really sells it; whether it's in the Australian outback or on the streets of New York City, they find the magic, and it comes through to the audience, loud and clear. This isn't, of course, the kind of stuff that wins Oscars, but her performance is honest and convincing, and Kozlowski has a screen presence that is altogether natural and real, all of which makes the relationship between Sue and Mick all the more believable. Also turning in noteworthy performances are John Meillon, returning as Mick's friend and business associate, Walter Reilly; Charles Dutton as the street wise Leroy; and Ubarry, who makes Rico the bad guy you love to hate. The supporting cast includes Juan Fernandez (Miguel), Kenneth Welsh (Brannigan), Ernie Dingo (Charlie), Luis Guzman (Jose), Jace Alexander (Rat) and Steve Rackman (Donk). An entertaining film, but not nearly as `fun' as the original (the `Indy' syndrome, again), `Crocodile Dundee II' is nevertheless a worthy addition to the series, as it puts you together with one of the screen's most unforgettable characters, `Crocodile' Dundee. 7/10.",
         "I have watched all the three Crocodile Dundee movies in the theater as well as their re-runs on cable TV at home: - Crocodile Dundee I; - Crocodile Dundee II; - Crocodile Dundee in Los Angeles: I am very impressed by the hilarious antics of Mick Dundee (Paul Hogan). I also like his charming, down-to-earth character. What I have enjoyed most in watching the three movies is that, I have learned that one can use sheer human ingenuity & creativity to overcome obstacles, no matter how intimidating they are...some life-threatening ones, too! Just watch how Mick Dundee (sometimes with his side-kick) out-thinking all the predators &/or bad guys in all three movies...in the treacherous hot outbacks of Australia & the mean streets of New York (When a mugger poked a small knife in front of his face, Mick took out his jungle knife & said: \"That's not a knife. This is a knife!)...& mercilessly cold concrete jungle of Los Angeles. On the whole, I have enjoyed watching again all the three movies, each with its own engaging story & romantic notion of adventure. As a strategy consultant/success coach on life (survival) skills, I have added these three movies to my resource repertoire.",
         "The fist film was really just a comedy about a man from Australia going to New York City with a reporter who he falls in love with. This film is more of an action comedy. This film is when gangsters are wanting to get Sue and they follow Sue and Mick to Australia where you can guess what sort of stuff happens. The action is very enjoyable and it is also ridiculous and hilarious - in a good way. The acting is very good. This is a good film if you want to sit down for lunch and eat soup in your living room and enjoy some laughs and nice action. I recommend this to anybody who likes Crocodile Dundee and North By Northwest put together. My take: 10/10"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Rimfire Films"
      ],
      "summaries": [
         "Mick and Sue continue where they left off in \"'Crocodile' Dundee\". New York drug lords are pursuing Sue for having solid evidence against them for murder, so for her safety, Mick takes her back to Australia. When the gangsters follow them, Mick demonstrates his outback skills once more.",
         "Living with Sue after she stopped him from leaving New York to go off and explore America, after she confessed that she loves him, Australian Crocodile Hunter Michael J. 'Crocodile' Dundee still trying to adapt to life in New York City and getting use to a different culture is about to use his hunting and survival skills yet again, when Sue is kidnapped by crime boss Rico and his associates, when Sue's Ex husband photographer Bob Tanner witnesses a brutal crime and takes snapshots of the crime and sends them to Sue. Mick rescues Sue from Rico and his associates. Mick decides to take Sue back home with him to Australia, as his best bet of protecting Sue. But when Rico and his associates arrive after tracking Sue and Mick down, Mick takes them on by doing what he does best.",
         "Australian outback expert protects his New York love from gangsters who've followed her down under."
      ],
      "budget": 15800000
   },
   "movielensId": 2471,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-05-19",
      "dvdReleaseDate": "2001-09-18",
      "directors": ["John Cornell"],
      "runtime": 110,
      "movieId": 2471,
      "title": "Crocodile Dundee II",
      "mpaa": "PG",
      "actors": [
         "Paul Hogan",
         "Linda Kozlowski",
         "John Meillon",
         "Ernie Dingo",
         "Charles S. Dutton",
         "Luis Guzmán",
         "Stephen Root",
         "Dennis Boutsikaris",
         "Tatyana Ali",
         "Colin Quinn"
      ],
      "imdbMovieId": "0092493",
      "originalTitle": "Crocodile Dundee II",
      "genres": [
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "oYaOhlHnuZw",
         "TasJkzP4BTY",
         "GncPCMj5lVU"
      ],
      "plotSummary": "Australian outback expert protects his New York love from gangsters who've followed her down under.",
      "tmdbMovieId": 9396,
      "avgRating": 2.59171,
      "releaseYear": "1988",
      "numRatings": 6215,
      "posterPath": "/m8DRsyNMD1pzWIgOb7X6XN7R3y0.jpg"
   }
}