{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "train robbery",
            "id": 156120
         }
      ],
      "imdb_id": "tt0092105",
      "video": false,
      "title": "Tough Guys",
      "recommendations": [
         53287,
         19382,
         11851,
         42176,
         19143,
         20681,
         13783,
         31643,
         19118,
         107934,
         31037,
         9967,
         35588,
         22023,
         12633,
         18061,
         12151,
         9699,
         10896,
         14621
      ],
      "backdrop_path": "/qRI9ASlh3msGXxzWoZ7oRmgGhsf.jpg",
      "revenue": 21458229,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Harry Doyle",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bad",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Archie Long",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bb1",
               "name": "Kirk Douglas",
               "profile_path": "/vIZgu07gJtS2j460jgBlI1IvkAO.jpg",
               "id": 2090,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Deke Yablonski",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bb5",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Belle",
               "gender": 1,
               "credit_id": "52fe43e99251416c75022bb9",
               "name": "Alexis Smith",
               "profile_path": "/ngXgviVg4Ysz1soyTYEUrBqC7Ki.jpg",
               "id": 65284,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Richie Evans",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bbd",
               "name": "Dana Carvey",
               "profile_path": "/1SyPT9N3J3NAycz89JmSmPd2xZ7.jpg",
               "id": 56159,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Leon B. Little",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bc1",
               "name": "Eli Wallach",
               "profile_path": "/nRoyZzUjzY7iGdnp2V2kOgrMMFi.jpg",
               "id": 3265,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Philly",
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bef",
               "name": "Billy Barty",
               "profile_path": "/h6Xf5csmdoIOUIFi8iRjtQMygQT.jpg",
               "id": 12659,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Skye",
               "gender": 1,
               "credit_id": "52fe43e99251416c75022bf3",
               "name": "Darlanne Fluegel",
               "profile_path": "/bhZdjbtZ71fsdYztrsq3KCC94F.jpg",
               "id": 4761,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "First Old Man Eating(uncredited)",
               "gender": 0,
               "credit_id": "575707a7c3a36859ab000291",
               "name": "Arthur Tovey",
               "profile_path": null,
               "id": 1208039,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bc7",
               "name": "Jeff Kanew",
               "profile_path": null,
               "id": 67897,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bcd",
               "name": "Jim Cruickshank",
               "profile_path": null,
               "id": 27445,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bd3",
               "name": "James Orr",
               "profile_path": null,
               "id": 27444,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bd9",
               "name": "Joe Wizan",
               "profile_path": null,
               "id": 21024,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43e99251416c75022bdf",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43e99251416c75022beb",
               "name": "Kaja Fehr",
               "profile_path": null,
               "id": 21281,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "534ade520e0a2640b600211e",
               "name": "King Baggot",
               "profile_path": null,
               "id": 67898,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 3.416377,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11038,
      "vote_count": 48,
      "budget": 10000000,
      "overview": "Harry Doyle (Lancaster) and Archie Lang (Douglas) are two old-time train robbers, who held up a train in 1956 and have been incarcerated for thirty years. After serving their time, they are released from jail and have to adjust to a new life of freedom. Harry and Archie realize that they still have the pizzazz when, picking up their prison checks at a bank, they foil a robbery attempt. Archie, who spent his prison time pumping himself up, easily picks up a 20-year-old aerobics instructor. Harry, on the other hand, has to waste away his days in a nursing home. They both have festering resentments -- Archie for having to endure a humiliating job as a busboy; Harry for having to endure patronizing attitudes toward senior citizens. The two old pals finally go back to what they know best. After successfully robbing an armored car, they decide to rob the same train that they robbed thirty years ago.",
      "similar": [
         10734,
         278,
         29381,
         10471,
         29259,
         107846,
         1701,
         9291,
         1429,
         76640,
         21575,
         38234,
         5925,
         1368,
         708,
         23629,
         5924,
         398175,
         5971,
         5503
      ],
      "original_title": "Tough Guys",
      "runtime": 104,
      "poster_path": "/zAXFmIRTSPkQbyTVSZa1GUtCQD9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1986-10-03",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "They're Out To Teach A New World Some Old Tricks.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Kanew"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "James Orr",
         "Jim Cruickshank"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092105/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMzMzYwNzkyM15BMl5BanBnXkFtZTcwNTIyNzUyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Burt Lancaster, Kirk Douglas, Charles Durning | See full cast and crew »"],
      "reviews": [
         "This is one of my favourite films. I've watched it many times and what's more my grand-daughters enjoy it too, and they don't even know the two stars like I do. It's funny, with a good pacey script. It has something to make you think about - getting older, not fitting in and being a geriatric rebel. It's got action, a bank robbery , a fist fight with some great dialogue. It's got comedy (see Kirk trying on \"hot\" clothes taking advice from a CCTV shop assistant) and also it has some touching scenes of Burt in the old people's home, where he's forced to live. The supporting cast has class - Eli Wallach, Dana Carvey, Charles Durning and Alexis Smith. And to top it all there's a terrific train chase finale. Besides which Burt and Kirk were made for this film. It brought back a lot of good memories for me and I can thoroughly recommend it. Enjoy, as they say....",
         "The 1980s was a period of transition as many great film legends died. Cary Grant, Bette Davis, Lawrence Olivier, Fred Astaire, Jimmy Cagney were just a few of those who left the scene. But there were attempts (before the end) to bring some of the great figures together. Bette Davis and Jimmy Steward made there only film together. Henry Fonda and Katherine Hepburn did ON GOLDEN POND. Cagney appeared with pal Pat O'Brien, as well as Donald O'Connor, in RAGTIME. Davis appeared with Lillian Gish, Anne Southern, and Vincent Price in THE WHALES OF AUGUST. And Burt Lancaster and Kirk Douglas appeared in this film. In the Oscar ceremonies of 1985, Lancaster and Douglas had come in together to deliver an award, and everyone noted how healthy both men still were. It was over two decades since they appeared in a film as co-stars (SEVEN DAYS IN MAY), and some of the news items in the wake of their appearance suggested it was too bad there was no property that they could develop together. Shortly afterward this comedy was produced. It had a great build-up, and I was fortunate to see it in a movie house. But it did not have a massive audience box-office, and was gone within six weeks. It was too bad, because it was a funny film, and would turn out to be the best comedy buddy film of the films that they did together. Harry and Archie (Lancaster and Douglas) pulled off one of the smoothest and most impressive railway train robberies in American history back in 1947. They almost got away with it, except for the persistence of a police officer (played by Charles Durning) who broke the case and managed to bring them to jail. They have served nearly forty years in jail, and when released they are in for time shocks. After all, they were used to the world of 1946/47. While both are physically fit, both can't get out of their mental views from their youth. On top of that, they have to deal with Durning, whose police career - after it's brilliant start - petered out leaving him embittered, and desperate to prove himself to the young pups who count the days until his enforced retirement. They have to deal with parole officer Dana Carvey, who has all the typical problems of a nice, naive parole officer. They have to deal with hostility around them from all peoples - mostly the young, but the middle aged are not much better. They resemble Reggie Kray, one time kingpin of London's largest criminal empire, who in his later years when interviewed pointed out to reporters that (while he did not dismiss his own use of violence against opponents in other gangs) he did dislike the lack of respect he observed towards older citizens. He and his brother Ronnie never stood for that kind of thing. Neither do Harry and Archie here. When threatened as easy, elderly targets by a gang of punks, they beat up the punks quite effectively. To add to their woes is the most ridiculous, but scrupulous, hit-man in modern cinema: Leon B. Little (Eli Wallach - who almost walks off with the picture). Hired on a contract against the boys back in their heyday, their being in prison prevented the ever ready Little from completing their executions. Even the death of the idiot who hired him means nothing - he was paid already, and he has a code of honor with his clients. That in the end, the battle of youth and old age unites Lancaster, Douglas, Wallach, and even Durning should not surprise anyone. All four manage to demonstrate that it is street smarts and brains, not youthful idealism (paging Carvey) that will win out in the end. The film has some nice moments, such as Douglas almost going in for dirty dancing with a young chippy, and Lancaster protesting the slop he has to eat in an old age home, and memorably showing his teeth to advantage for a purpose (for a change). It was a good conclusion to the long road of movies these two cinema giants made together - and a funny one too.",
         "I wasn't disappointed when in 1986, Burt Lancaster announced on BBC's Wogan show that his new movie was going to star himself and his long time friend and frequent co-star Kirk Douglas. Since their first pairing in the brilliant noir thriller 'I Walk Alone' (1947), Lancaster and Douglas had made several appearances together. Who can forget Lancaster's tough talking Wyatt Earp and Douglas's equally tough yet terminally ill Doc Holliday in 'Gunfight at the OK Corral'? So now it was the mid 80's, the age of the pepsi generation, I wondered how these two consistent stars would adapt to staring together again for the first time since the 60's. The answer is brilliant. Harry Doyle (Lancaster), and Archie Long (Douglas) are released from prison after a 30 years sentence after being caught dead bang robbing a train. Eager to make a clean sweep, the two senior citizens, are looking forward to starting their new legitimate lives. However, all is not as they had hoped on the outside, and Harry and Archie have problems coming to terms with the way the world has changed. Director Kanew gives us a new genre here. Instead of the 'fish out of water' scenario, we have the 'two fishes that have been put back in the water after a severely long time' genre. However, Kanew also gives the audience the inevitable Clichés that go with it, and is always ready to fall back on a youth versus experience incident just about everytime the movie gets enjoyable. After being humiliated, patronised, and generally treated like dirt for the better part of a week, The two ageing gangsters decide that a life of crime has to be better then honest work, and predictably they revert to their previous careers as train robbers. The film is enjoyable there's no escaping it, but there are more holes in the plot than there are in a grannies cardigan, and is also SOoooo predictable in fact the films outcome is more predictable than the outcome of a fight betwix elephant and duck. First of all to get 30 years simply for robbing a train, seems a bit excessive for the viewer to even find it believable. Co-incidentally the day the get out of prison is 1 week before the train they were caught robbing is making it's farewell run. This aside the film IS enjoyable, and Lancaster and Douglas play their parts wonderfully and you enjoy the film more for their presence. Other cast members also rate highly, Eli Wallach is by far the funniest character, and his wonderful performance in some ways steals the film from it's intended stars. and the devine Alexis Smith makes a small cameo as Lancaster's ex lover. Charles Durning is unfortunately once again typecast as the over-weight lazy flatfoot (ala Dog Day Afternoon/The Sting) and although his performances are always good, you get tired pretty quickly of his tough talking patronising character. and finally there is (Pre Wayne's World) Dana Carvey as the Youthful Idealistic Parole Officer, but it's a shame that Carvey is restricted to playing pretty much a straight character, especially considering he is probably one of the funniest men working in Hollywood today. Tough Guys should have been better, but I feel Kanew spent most of the budget on getting the perfect Sterling cast, rather than to hire a good script writer. Worth watching for the final appearance on-screen of this top notch duo. Since Lancaster's Death in 1994, I've warmed to this movie more knowing it could never happen again. It's just a shame it wasn't better as it could have been much better.",
         "Burt Lancaster and Kirk Douglas were inexorably linked not just by their co-starring films together, but by the fact that Hedda Hopper in one of her books did a chapter on both of them. She entitled the chapter, The Terrible Tempered Twins and she bemoaned the fact that these two instead of being good little captives of the studio system that kept her in business, had the audacity to chart their own careers. Go into the production end and take total responsibility for the work they did. It would never have worked had not Lancaster and Douglas not been good judges of the roles they were best suited for. Some stars never wanted that kind of responsibility or felt they were poor judges. William Holden said point blank after one picture where he was the producer, the responsibility was too much for him. Robert Taylor was widely quoted that he stayed with MGM as long as he did because he felt they knew best how to present him and what were good film properties. But Burt and Kirk knew their minds and made their own careers work. Fortunately before both of them in the Nineties were felled by illness and Lancaster left us, they gave us one more co-starring part. This one's a comedy though, something different for them. As Harry Doyle and Archie Long two elderly crooks released after a thirty year stretch for robbing the West Coast Flyer train, they find roles perfectly suited to their age and personality. Lancaster's old and he knows it, but he still wants to be treated with some dignity. Douglas hasn't quite figured it out yet, but in time he gets the fact that time's caught up with him. They just can't adjust to changing times so they try all kinds of things to fit in. And then they decide on one spectacular coda to their lives and careers in the wonderful world of crime. The two men are in great form and they get some able support from Alexis Smith, Charles Durning and Dana Carvey in the supporting cast. But special comment must be made for Eli Wallach's seeing eye hit-man. Good thing his part is not as long as the stars because he steals every scene he's in.",
         "Legends Douglas and Lancaster play two aging ex-train robbers who set out to prove they're not over the hill for one more heist. A fun film. It's nice to see two legends go head to head and have a few laughs...",
         "Watched it again on late night TV. Still funny after all these years. You could still see the occasional flashes of the old Kirk D, chilling look etc and Burt still has the movement of an athlete even at age 73, and his trade mark mirthless laugh but it was Eli Wallach who stole the film, absolutely brilliant. I think his character was stolen by the writers of a BBC TV comedy called \"Last of the Summer Wine\" which has a very short sighted character called Eli. So many scenes were so good that it makes it difficult to pick the best but I think the scene outside the old folks home is excellent when Leon B. Little picks himself up using the Zimmer frame, cruel but funny. The ending was a bit of an anticlimax (same comment applies to \"The Blues Brothers\".",
         "Kirk Douglas. Burt Lancaster. 'Nuff said! As two train robbers, released from prison after a 30 year stretch, this dynamic duo try to adjust to life in the '80's and all the changes that have taken place. Douglas looks great for a man in his 60's and eventually attracts the eye of a young aerobics instructor. Their scenes together are both funny and sincere, as the differences between them eventually dictate the direction of their relationship. Kirk is also forced to work in menial jobs that involve him dealing with rude customers and a boss who doesn't like ex-cons. These scenes provide the film's best humor. Lancaster's role however is far less interested, as he is relegated to an old-folks home, wherein he becomes somewhat of a revolutionary. Realizing that they just don't fit in with society anymore, the two return to train robbing and the film moves downhill from this point. Eli Wallach contributes some funny scenes as a near-sighted hit-man who has waited 30 years to fulfill a contract to kill the duo. Despite the thin script, this is a very enjoyable film that may best be viewed with a senior citizen family member who can both identify with the characters and who remembers Lancaster and Douglas when they were A-List actors. I recommend it.",
         "Two of my favorite icon bad boys, are 'on' for the last 'ride' of their lives. I'm sure that while this one won't bring any awards to these two gentlemen, it is one heck of a good time!! The theme song for the movie \"They Don't Make Them Like They Used To\" Performed by Kenny Rogers was Nominated for a Golden Globe, however. The aging train robbers, it's so old school that it's totally cool. They argue and challenge each other's decisions, they chase women, they make each other laugh and on-top of that those who appreciate these two fine actors laugh a lot more. I have to say as well, that I enjoyed Dana Carvey (Richie)in this, more than anything else I have ever seen him in. With the other classic actor crowd, you have a who's 'who' of talent that spanned decades before this movie was ever made. As a matter of fact when some of these people were in their hay day, the golden age of Hollywood, the director, \"Jeff Kanew\" was just a cute little baby then. But I must say, that this director did a terrific job with these professional old schoolers and I'm glad it was him. These 'Tough guys' got it all along with a few bad guys and one old near-sighted hit-man, (played by: Eli Wallach) that has had a contract on these two for over thirty years and he is itching to collect on it. Cause he never 'welches' on a contract. Even when the one who paid for the hit-contract, is dead...for three decades now. With an array of classic songs and some current in the mid-eighties rock and alternative stuff, the mix of style and generations colliding together make the communications and miss-understandings hilarious! The street punk-tough guys never knew what hit them, when these two 'classic' operators got-out-the-joint!! New ghetto, old rules. And if it weren't rough enough that these two 'grampa's' (the gang member referred to Archie and Harry as) knocked these guys confidence down and gave them a little pain to remember them by, leave and then the hit-man who's hot on their trail suddenly shows up and asks the gang members where the two old guys went? The members of the gang remember the 'two' tough guys and think, this one guy is looking for both of them!! They panic! Break and run! After they scattered into their holes, the old hit-man seeing their radio blaring on the fence, shouts \"Hey! You forgot your jukebox!!\" Then Blasts 'it' (The Boombox-Ghetto Blaster) to bits, with a double barrel Winchester shotgun. Pieces everywhere and then silence, the hit-man squints looking through his 'goggles' and complains about noise pollution. But hey! \"Don't let the goggles fool ya, he's a 'Sharp shooter!\" That scene is a modern day comedy, 'classic' that I loved from the moment the movie previews were showing the 'coming attractions'. This one really hits the satisfaction zone. I gave it an excellent rating because it is. The thing that offended me was Kirk (or Archie) 'dropped trow' showing his 'bum' when he was on top of the train making his get away, although it was funny and some of the women said, that was 'cute'. But that is just something I don't want to see. The two where sharp dressed men though! Seemingly I don't know too many of their generation that fully appreciate them in this 'role' because I believe that some think that they are lowering themselves by being common criminals. Or maybe it's all the cursing, but I say to those of the golden-age of Hollywood generation, they are not but common criminals, they are extraordinary-train robbers, looking for a final Heist. Charles Durning is a good ambitious detective on their trail, who comes of age to an 'understanding' in the final pursuit. They all (director and actors)'were right on the money' to coin an 'oldism' in putting together a well-aged action adventure hero/villain movie. I especially rolled in laughter at the end, when they crossed the Mexican Border. The 'Federallie's' Captain says: \"We got you now.\" And then immediately Archie starts to 'School' him and his band, in the rules of the game. Then, right afterward, the Federally asks \"Play by rules, what rules?\" And Archie looks at Harry and then \"BoOm!!\" right in the jewels.--Uggh! Gentlemen, you made a fan and a believer out of a younger generation guy. cheers!",
         "Tough Guys re-unites after a near 30 year gap the screen pairing of Kirk Douglas and Burt Lancaster and as such it's a wonderful piece of nostalgia. The premise suits the stars very well Archie Long and Harry Doyle after 30 years in prison for a train robbery are released into society and find things aren't want the used to be back in the old neighbourhood. The duo are soon mixed up with a short sighted hit-man (a scene stealing Eli Wallach), a hero worshipping parole officer (Dana Cavey), an old time cop convinced they'll rob again (Charles Durning) and some seriously 80's style thugs. Add to this just dealing with Archies day job and Harry's new life in a retirement home and their is a recipe for comedy and some surprisingly touching moments as the pair come to terms with old age. The film is fun and well paced although there are some big plot holes and inconsistencies you can overlook these as its not a serious film. Douglas and Lancaster are clearly having a blast making the movie and seeing them on screen again one last time is great. I'd recommend this film for a feel good comedy or a bit of nostalgia for older movie fans. 7/10",
         "Of course Kirk Douglas did quite a few more films after this but he didn't do em with this kind of fun in mind. Two former train robbers get parole after 30 years. Now they have to decide what to do when they get out. They're 65 and 72 years old and don't have a lot of skills. On top of that they don't fit in the 80's way of life. Their parole officer tells them they cant see each other for 3 years as per condition of their parole. They both have a heckuva time adjusting to this new existence and finally decide to go back to their old way of life. This is one of those 80's gems that I never forgot. Two great actors in their last good film doing what they do best... Acting tough and being guys....Tough Guys. Burt Lancaster is the straight man and Kirk Douglas has all the good lines. Keep a watch out for Eli Wallach...he steals almost the entire film with the small role he has. Yes you will see a very young Dana Carvey pre SNL. Grab this 80's flick and have a laugh cause I'll bet it won't be too hard to do."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Touchstone Pictures",
         "Silver Screen Partners II",
         "Bryna Productions"
      ],
      "summaries": [
         "Harry and Archie are released from prison ready to collect their Social Security. How could they get into trouble at their age? Let's count the ways; A parole officer who is a famous criminal groupie, Dead end where people don't know they are dealing with dangerous, though older, criminals, a hit man who can barely see, but who still has an outstanding contract on them. Does anyone still rob trains?",
         "Two elderly gangsters are released from prison only to find they have trouble fitting in as old men who still take no guff from anyone."
      ],
      "budget": 0
   },
   "movielensId": 2472,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-10-03",
      "dvdReleaseDate": null,
      "directors": ["Jeff Kanew"],
      "runtime": 104,
      "movieId": 2472,
      "title": "Tough Guys",
      "mpaa": "PG",
      "actors": [
         "Burt Lancaster",
         "Kirk Douglas",
         "Charles Durning",
         "Alexis Smith",
         "Dana Carvey",
         "Eli Wallach",
         "Billy Barty",
         "Darlanne Fluegel",
         "Arthur Tovey"
      ],
      "imdbMovieId": "0092105",
      "originalTitle": "Tough Guys",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["AqFsg6eLvLU"],
      "plotSummary": "Harry Doyle (Lancaster) and Archie Lang (Douglas) are two old-time train robbers, who held up a train in 1956 and have been incarcerated for thirty years. After serving their time, they are released from jail and have to adjust to a new life of freedom. Harry and Archie realize that they still have the pizzazz when, picking up their prison checks at a bank, they foil a robbery attempt. Archie, who spent his prison time pumping himself up, easily picks up a 20-year-old aerobics instructor. Harry, on the other hand, has to waste away his days in a nursing home. They both have festering resentments -- Archie for having to endure a humiliating job as a busboy; Harry for having to endure patronizing attitudes toward senior citizens. The two old pals finally go back to what they know best. After successfully robbing an armored car, they decide to rob the same train that they robbed thirty years ago.",
      "tmdbMovieId": 11038,
      "avgRating": 2.9292,
      "releaseYear": "1986",
      "numRatings": 565,
      "posterPath": "/zAXFmIRTSPkQbyTVSZa1GUtCQD9.jpg"
   }
}