{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "soul",
            "id": 634
         },
         {
            "name": "secret identity",
            "id": 1308
         },
         {
            "name": "harvard university",
            "id": 2463
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "scholarship",
            "id": 6278
         },
         {
            "name": "los angeles",
            "id": 12670
         }
      ],
      "imdb_id": "tt0091991",
      "video": false,
      "title": "Soul Man",
      "recommendations": [
         36914,
         222726,
         27307,
         11221,
         26603,
         14425,
         25010,
         18410,
         10804,
         10765,
         18509,
         11557,
         14671,
         13346,
         427910,
         21873,
         273610,
         21433,
         10001,
         9548
      ],
      "backdrop_path": "/drMBfevK1EagT81M5wV5szzeGgF.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Dan_Tebasco",
         "id": "58d066d7c3a368679b000808",
         "content": "**Soul Man**\r\n\r\nHad heard a bit about this movie before I saw it, many times refered to as being racist. In fact COMPLEX MAGAZINE listed it as number 4 on a 'most racist movies' list they made.\r\n\r\nWatching it, I must say it's a whole lot less racist than I expected it to be. In fact I wouldn't call it racist at all.\r\n\r\nIt's about a white guy who gets into Harvard but can't afford to go there so he looks for scholarships that he can take but the only one applicable to him is one designed for African Americans. So  he fakes being black (with full blackface makeover and a 80's jerrycurl to match) and gets it.\r\n\r\nThere is of course a stigma around blackfaces stemming from early 20th century films where white people would dress up as black people and make fun of them and make them look stupid etc.\r\n\r\nBut to say that this movie is racist for that reason alone is very simpleminded. Cause even though the guy does put on a blackface, there is not a malicious intent behind it. And he does learn a thing or two about racism himself as the movie progresses.\r\n\r\nI would probably argue that if anything it's more racist towards whites and perhaps a general white perception of blackness (at least of the time) than it is of blacks. But even that would be a bit of a stretch.\r\n\r\nAnyways slightly overthinking it here perhaps, as it is in fact not a too serious movie but a comedy. And as a comedy, albeit it has a bit of a rough start it works pretty good. It's no masterpiece or anything and it could have done with some editing cutting it down by 15-20 minutes or so. But overall a decent and fairly harmless watch that does manage to convey a pretty good message while also gathering up some big laughs ocassionally.",
         "url": "https://www.themoviedb.org/review/58d066d7c3a368679b000808"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mark Watson",
               "gender": 2,
               "credit_id": "52fe44d89251416c75042eb5",
               "name": "C. Thomas Howell",
               "profile_path": "/8PFMkxOnn1JEKwd0nlbBuZfS7Sf.jpg",
               "id": 2878,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah Walker",
               "gender": 1,
               "credit_id": "52fe44d89251416c75042eb9",
               "name": "Rae Dawn Chong",
               "profile_path": "/6mk5lSTIUav9T1M0VAdUP46FTSH.jpg",
               "id": 13312,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gordon Bloomfeld",
               "gender": 2,
               "credit_id": "52fe44d89251416c75042ebd",
               "name": "Arye Gross",
               "profile_path": "/ha4ziYlBSBBHs88ltnamOKLZ084.jpg",
               "id": 72028,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Professor Banks",
               "gender": 2,
               "credit_id": "52fe44d89251416c75042ec1",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Whitney Dunbar",
               "gender": 1,
               "credit_id": "52fe44d89251416c75042ec5",
               "name": "Melora Hardin",
               "profile_path": "/uecs9JKOqgYj3PrSGECaFzc3E2r.jpg",
               "id": 404,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mr. Dunbar",
               "gender": 2,
               "credit_id": "52fe44d89251416c75042ec9",
               "name": "Leslie Nielsen",
               "profile_path": "/cZpuTfE1j63tCEXoSL2A7KZjk5d.jpg",
               "id": 7633,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Lisa Stimson",
               "gender": 1,
               "credit_id": "52fe44d89251416c75042ecd",
               "name": "Julia Louis-Dreyfus",
               "profile_path": "/lK58eLbTUFReUyFD4ummcb3A0qS.jpg",
               "id": 15886,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Ernie (as Dave Reynolds)",
               "gender": 2,
               "credit_id": "5a820ee3c3a3684cf1005a74",
               "name": "David Reynolds",
               "profile_path": "/5iKtATPbLpv2lT7q9DPX2v2qPS1.jpg",
               "id": 11,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d89251416c75042ed3",
               "name": "Steve Miner",
               "profile_path": "/yk90jxBifKosxEyP8CITJk1BTtt.jpg",
               "id": 58712,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d89251416c75042ed9",
               "name": "Carol Black",
               "profile_path": null,
               "id": 72029,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d89251416c75042edf",
               "name": "Steve Tisch",
               "profile_path": null,
               "id": 29,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d89251416c75042ee5",
               "name": "Tom Scott",
               "profile_path": null,
               "id": 18663,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d89251416c75042eeb",
               "name": "Jeff Jur",
               "profile_path": null,
               "id": 720,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d89251416c75042ef1",
               "name": "David Finfer",
               "profile_path": null,
               "id": 18387,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 3.432635,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 12278,
      "vote_count": 55,
      "budget": 0,
      "overview": "Soul Man is a comedy film made in 1986 about a man who undergoes racial transformation with pills to qualify for an African-American-only scholarship at Harvard Law School. It stars C. Thomas Howell, Rae Dawn Chong, Arye Gross, James Earl Jones, Leslie Nielsen, and Julia Louis-Dreyfus.",
      "similar": [
         37247,
         114150,
         11137,
         8469,
         325133,
         8277,
         23483,
         8065,
         13183,
         440021,
         10760,
         10642,
         270302,
         13969,
         368031,
         12620,
         46127,
         308639,
         10680,
         266639
      ],
      "original_title": "Soul Man",
      "runtime": 104,
      "poster_path": "/gf8FmcNSKLXHxhsgSRnlRpPpnHj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1986-10-24",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "A comedy with heart and soul",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Miner"],
      "runtime": 104,
      "synopsis": "Mark Watson, a recent college graduate, plans to go to law school at Harvard. Mark feels secure that his tuition and other fees for law school will be paid for by his wealthy parents, who had saved money for him. However, during a conversation with his father, he finds out that his parents have reneged and spent the money on a timeshare condominium in the Tropics. In retaliation, Mark hangs his father in effigy, using a Cabbage Patch doll he's dressed up to look like his dad. Mark starts a frantic search for a scholarship program, however, his parent's wealth keeps him from qualifying. He finds one scholarship given to an academically exceptional student from the state of California each year. The only catch is that the student must be African-American to qualify. Mark talks to a friend of his who works as a pharmaceutical technician and obtains experimental tanning pills. Mark exceeds the suggested dosage and darkens his skin to appear black. The ruse works; Mark is able to fool his best friend, Gordon (who's also attending Harvard), and the scholarship committee. Mark and Gordon arrive in Boston and rent an apartment from an obviously bigoted man whose daughter, Whitney, will also be living in the same house. She quickly comes on to Mark, saying that she feels the pain of his slave ancestry. She also invites him to her parent's house for dinner which results in an uncomfortable evening for Mark; Whitney's father glares at him thinking he's only looking for a white girlfriend. The rest of the family has their prejudicial opinions of him as well. Mark and Gordon register for classes together, Mark breaking a minor oath with Gordon not to take criminal law - Mark sees that the professor, Banks, is also black and believes he can take advantage of the connection and will coast through the semester. However, Mark finds that Banks' class is much tougher than he thought and that Banks does not play favorites, no matter what race they are. Mark also meets a woman named Sarah, also a law student and is immediately attracted to her. Sarah comes from a much poorer background than Mark and is working her way through law school. She is also a single mother and sees right through his flirting. Mark gradually wins her over, proving to her that he has the potential to excel academically. One day, while driving through Cambridge, Mark is followed by a policeman, who has blatantly targeted him in a racist manner. Mark follows the traffic laws and controls very carefully until he's forced to swerve from someone opening a car door in front of him; he's immediately pulled over. When the officer asks to see his license, Mark remembers that the photo is of him as a white man and he tells the officer he lost it. He's arrested on the spot and thrown in jail where a group of disgruntled football fans beat him because their team lost to another team of mostly black players. Mark's incarceration prevents him from writing an important term paper for Banks' class. He races to see Banks who refuses to grant him an extension on the due date. Mark tries to reason with the stolid professor, who seems unmoved by Mark's story about being held without formal charges and being beat up in jail. Banks grants him a few days to turn in his paper, which finds Mark spending his Thanksgiving vacation completing it. When he reads it, Banks is actually quite impressed. Late in the semester, Mark, while studying with Sarah, finds out from her that she was the other applicant for the same scholarship he'd won in California. Mark is crushed, feeling guilty that he'd stolen her chance to attend Harvard with the grant. Gordon tells Mark to ignore his feelings; if he's exposed, he'll be ruined. Mark, en route to tell Sarah, is stopped by Banks who, seeing that Mark's classwork has shown exceptional improvement during the semester, offers him a seat on the university's student judiciary council when the council's only black student had fallen ill and stepped down. The conversation only makes Mark feel guiltier but he accepts. Mark returns to his apartment and meets Gordon. He tries to tell his roommate about his guilt, but is dismissed. Gordon tells Mark to go into his room where he finds Whitney, mostly undressed and wanting to have sex with him. Mark refuses, knowing that Whitney's father hates him and tries to get her to leave. At that moment, Mark's parents make a surprise visit and Sarah shows up shortly after. Mark frantically tries to juggle talking to all of them but eventually reveals his identity. Sarah storms off, Mark's parents are shocked and Whitney is led off by her father after the superintendent of the building calls him and rats Mark out. Whitney's father also hits Mark in the stomach and the super happily serves him eviction papers. After everyone leaves, Mark and Gordon work on a plan to resolve everything. The student judiciary convenes the next day. Gordon goes in ahead of Mark and offers an impassioned defense, saying that Mark feels great remorse for committing fraud and especially for cheating Sarah out of her rightful scholarship. Mark reveals himself to the council and to the astonishment of everyone in the room. He meets privately with Banks and tells him that he plans to apologize publicly and in writing to the university, allow his future wages to be garnished to pay back Sarah and also allow a future scholarship to be established in Sarah's name. He also asks that he be allowed to continue to attend law school. Banks tells Mark that he's learned something that other white students never could; what it feels like to be black and the subject of prejudice as a minority. Mark claims that he didn't learn such a thing because he could have bowed out at any time. Banks believes Mark has learned a great deal more than he thought. Mark takes up a job much like the one that Sarah had, working in the university's cafeteria. He overhears a couple of bigoted students telling a racial joke within earshot of Sarah and punches them both, sending them flying. The movie ends with the two of them striking up a friendship again.",
      "writers": ["Carol Black"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091991/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5NzgxODY2Nl5BMl5BanBnXkFtZTcwNzAyMjMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: C. Thomas Howell, Rae Dawn Chong, Arye Gross | See full cast and crew »"],
      "reviews": [
         "In this day of PC rubbish this film probably would cop a lot of flak if it was re released. People actually picketed this film in its day and it has been given the needle from Spike Lee and Eddie Murphy. Well, I am black and didnt find it offensive at all, in fact if people want to attack it and say it is they might want to look at more deserving features that are released nowadays . I personally find most of the stereotypes in the aforementioned directors films quite insulting but that doesnt mean I will hate their work. This movie, although a little awkward in its delievery is obviously made with good intention and should be commended for telling a story with very truthful elements to it. If you cannot see that then you are missing the point. The best and most significant scene is when Mark watson sits down with his rich white girlfriends family for dinner. the scenes they evision are absolutely hilarious and painfully real ...especially priceless is Leslie Nielsens thoughts. a very very funny but misunderstood film (by the wowsers anyhow). relax and enjoy a great teen flick with a real message underlying, if nothing else enjoy the scenery chewing by James Earl Jones, Rae Dawn Chong , Leslie Nielsen and a early Julia Louis-Dreyfus. excellent fun.",
         "Pills that can tan your entire body?! Huh. ;) C.Thomas Howell is so good in his role. His charm is so intoxicating and you always wanna laugh at him. He looks like a cuter version of steve-o from jackass, with discolored skin and a black curly 'fro! He looks so obviously NOT black. The best part of this film is the editing style. I recently discovered the importance of editing; it's good that this one was edited at a very quick and entertaining pace, otherwise it would've seemed outdated by today. I actually think a film like this would make it today, since there's a heavy backlash from the '90's 'political correctness' theme. There are some heavy themes here, (although it's a comedy) but C.Thomas Howell keeps you wanting more. Supporting roles from James Earl Jones, the character Sarah, and her son are all great, but C.Thomas Howell keeps this film timeless; he is perfect.",
         "I remember watching this in my early teens, and thinking it was one of the funniest films that I had seen. Watching it again over 10 years later, its still pretty funny. In the age of political correctness it probably has quite poor taste, but thats not its intention. Its a lightweight comedy, and thats the way it should be taken. There are a few moments where a message and moral does come through, especially in the later half of the film. This adds to the films charm, as well as giving people a fairly superficial albeit correct notion of the social struggle faced by some races. C Thomas Howell was very good in this film, and I feel that its a shame that he does not make that many feature films these days- he seems to appear a lot in direct to video films. It was also interesting to watch Julia Louis-Dreyfuss in her very pre-Seinfeld days, before she became Elaine. This really is a funny film, very unbelievable but heaps better than the lame comedies that the big studios are serving up these days.",
         "This is a potentially great idea for movie, and it does live up to its potential. And it's funny enough. But it doesn't deal with the reality of what a kid posing as a black person really could, should or would suffer through. The ending is especially formulaic and predictable, or to also describe it, unrealistic. I'm not saying it's a dislikeable movie on any level, but it is a questionable one. To a degree, anyway. One scene that comes into mind is when Matt is trying to hide his \"face\" from his parents who are visiting. Predictable, but funny stuff. But not really necessary. I know this is a comedy, but just because it is, doesn't mean it shouldn't deal with serious issues. *** out of ****",
         "You can't talk about a movie like \"Soul Man\" without feeling your feet inevitably hitting a soap box. So let's get the film's controversy out of the way: Is it wrong for a white person like Mark Watson (C. Thomas Howell) to disguise himself as a black person? In most cases, yes. Is it wrong to do so to obtain a scholarship? In all cases, double yes. Does it make a bad idea for a movie? Not necessarily. The problem with \"Soul Man\" is not so much its premise as much as its execution. You have a white college student, Mark, from L.A. who learns that he and his friend Gordon (Arye Gross) have been accepted into Harvard Law School. The only problem is that even though he comes from a well-to-do family, his father decides not to support him financially. Mark tries every way to pay for his tuition and living expenses, including applying for financial aid, for which he is immediately turned down. I'm not so sure if that would happen in real life, but then again, I haven't applied to law school. Plus, anyone can apply for student loans, right? Regardless, Mark eventually comes across Harvard's only viable full-ride scholarship he can find, which happens to be solely for African-American students. In a fraudulent and risky move, he decides to turn himself black. He does so by taking tanning pills that increase the melanin in his skin, and dons a Jheri curl. There are two problems with this transformation: 1.) Howell does not look African-American at all when he darkens his skin. In fact, I thought he looked like an Indian-American with a really bad hair stylist. Yet, in this movie, no character seems to think for a second that this guy isn't black, not even Harvard Professor Banks (James Earl Jones), who seems way too educated to be fooled. 2.) Most importantly, you never actually see Mark Watson come to the conclusion that posing as a black man is a good idea. The film just suddenly jump cuts from his vain attempts to seek financial support to his racial transformation, all with no explanation whatsoever. I wanted to see him take those pills and at least get an idea of what was going through his head. Also, why did he decide on a Jheri curl as a haircut? I would imagine that a Jheri curl, which already requires an ozone-killing amount of hair spray as it is, would be more difficult to maintain than simply shaving his head. John Howard Griffin employed the latter hairstyle choice while doing research for the novel \"Black Like Me\". I could go on about the character weaknesses of Mark Watson, such as the fact that he doesn't seem smart enough to mop the floors of Harvard Law School let alone be a student there, nor does he have the motivation. He made the dumb decision to attend Professor Banks' criminal law class simply because Professor Banks was \"a brother\". He doesn't seem to register how intimidating James Earl Jones is as a Harvard professor, whereas I got the impression immediately as Jones was taking attendance in his first scene. It's not C. Thomas Howell's fault that the Mark Watson character is the way he is, although his career suffered because of it. It's just that Mark should have been developed more, and not just be made a carbon copy of a member of the Delta Tau Chi frat in \"Animal House\" (1978). If Arye Gross's character was made that way, that's fine, but making both characters inept really ruins the base of the story. Otherwise, I actually liked the parts of the film where Mark begins to realize that racism is not something that just died after the 1960's. He does say at one point that, \"This (the 1980's) is the Cosby decade! America loves black people!\" Well, not so much. While racism is not as obvious as it was before the Civil Rights Movement, it's still alive and well even in liberal Massachusetts. I liked how Howell gets fazed little by little over two white classmates who like telling racists jokes to one another. I also thought his time in jail with unruly white disgruntled baseball players was stinging enough. The basketball montage (featuring Ronald Reagan's son, Ron Reagan) was also very funny. I thought most of the supporting actors were convincing. Rae Dawn Chong was charming as ever, although her career also fizzled after this movie for some reason. Leslie Nielsen was also good as Mr. Dunbar, a building superintendent who does not take kindly to his beautiful daughter's (Melora Hardin) attraction to black Mark. The scene when he envisions Mark as a watermelon-eating pimp who shouts \"Whatchu lookin' at!?!\" was biting, but funny. The fact that all these characters, black or white, were fooled by Mark being a black man is still what contributed to this movie's lack of credibility. Apparently also, not everyone was laughing at this movie either. Spike Lee and Eddie Murphy publicly denounced it. Then again, though, Richard Pryor reportedly found it funny. Films about characters who make bad choices are not necessarily bad choices for movie plots. This wasn't a bad idea for a movie, but it could have been stronger if vital pieces of exhibition were not skimmed over haphazardly. What results is a film that is not black or white, but too gray.",
         "When Soul Man first came out it got razzed terribly for joking about a sensitive topic. I think the critics didn't quite get the film, they thought it was a racist attack on minorities. Set aside scholarships are private and what C. Thomas Howell does is attempt to defraud the givers of said scholarship by passing himself off as black. Picture if you will somebody like Fred Phelps endowing a scholarship to Bob Jones University, the only place I'm aware that would take his money, on someone that Phelps feels reflects his proper and God inspired outlook on the American scene. But it would be legal because it's Phelps's money to do with as he wishes. Now the endowers of that scholarship to Harvard meant it for someone like Rae Dawn Chong. So when Howell grabs it because his parents decide to make him pay his own way and he's too lazy to do it or heaven forfend, go to another law school he is defrauding her. That's the sum and substance of Soul Man. Of course in passing himself off as black, Howell makes a few unpleasant discoveries about himself and a lot of people around him. And of course there's that old Cupid thing with him and Chong. James Earl Jones makes the most intimidating law professor this side of John Houseman. Arye Gross gets the role of best friend and confidante in Howell's scheme and Melora Hardin who now occasionally plays the ghost of Trudy Monk on Monk is the spoiled rich girl who gets back at her parents by sleeping with minorities. Soul Man gets silly and a bit forced at times. But it's not deserving of all the knocks it's been given over the years.",
         "I remember watching Soul Man about twelve years ago when it was first aired on TV. Crazy, hilarious, sarcastic, emotional; what the hell I could go on forever describing this film. This is the only film besides \"The Outsiders\" that C. Thomas Howell played a dual role of himself and a black student impersona. Okay I can agree with some comments that movie began to over step it's bounderies with the way African American culture was dealt with, but at the smae time I felt that it was stabalized with the humour adding that extra touch rather than people taking it more \"Politically correct\" way. James Earl Jones and Rae Dawn Chong both did fabulous jobs as there acting really help give their characters' some edge that made it somewhat convincing. Overall a brilliant film. If you can try to avoid the fact that it might be cliched of dealing with racial differences in a light hearted manner. Remember this is a comedy and not something to take \"SERIOUSLY\". Another quality film from the 80's to add to the hitlist.",
         "\"to what?\" \"frankly, your tone of voice.\" i watched soul man twice at the cinema when it came out; i loved it to bits. i thought the movie was warm and funny and dealt with a difficult subject in an imaginative and sincere way. i found c thomas very likeable and i thought his relationship with rae dawn chong and her young son was believable and natural. james earl jones was fantastic too. my fave thing about the movie is ayre gross. i loved him in coupe de ville and on ellen and he's excellent here as mark's smart-alec best friend gordo. the scene where he has to defend mark in court is so funny.",
         "When I started to watch this film I thought, not another teen movie. That's not to say it wasn't funny because it was hilarious but then something happened in the film as it began to give a message of racism in American society in particular(and the world by inference). The premise that a white student could become black just by using tanning pills is so ridiculous but if you get over that funny leap in belief and you give this film your time you will be rewarded with a sentimental love story with a anti-racist message and what's more, the movie makes you think- what if I were black? Would I be treated like that just on the basis of the colour(or color as you Americans spell it) of my skin? The main character Howell comes across as a bit of a j***k, pardon my language, at first but you see him mature with what he sees happening around him. His self importance disappears with every racist moment and we are left with not a broken man as maybe someone who had to put up with it all through their life (a Black person) but because he can go back to being seen as important in society (i.e. a white man) he is left enriched by the experience and an infinitely better person. The love angle is very well portrayed especially by two people who actually went on to get married after the movie in real life which just shows the chemistry between them on screen. The only thing after seeing this movie that I can see wrong with it is its competing ideas and themes- you are not sure what you have watched, was it a teen movie, love story, drama or anti-racist 'propaganda'. Personally as someone who likes all those types of movies I think it is the my greatest modern movie of all time. 10/10",
         "This movie gets a bad rap but it's actually quite interesting in its portrayal stereotypes and racism. It's sad that it was made because there shouldn't be such stereotypes and racism in society. But the movie goes about having a laugh with it all while still showing the ignorance in people. C. Thomas Howell used to be able to act back then and he does a great job. There is fine acting all around particularly from James Earl Jones and Rae Dawn Chong. On the unfortunate side, Leslie Nielson was terribly underused and so out of character as a racist piece of crap. In the end, right prevails over wrong, we have a few laughs, and ponder the idiocy of racism. 6.1 / 10 stars --Zoooma, a Kat Pirate Screener"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Balcor Film Investors",
         "Steve Tisch Company, The"
      ],
      "summaries": [
         "Mark doesn't expect any problems in going to college: he and his friend have reserved places in Harvard and his parents have the money to pay for his education there. But suddenly his father's neurotic psychiatrist advises him to go on vacation in Hawaii instead of spending more money on his son. Since Mark wants to keep his lifestyle, including a fancy car and a flat shared with his friend, he seeks financial support. The only foundation which still accepts applications is for blacks only -- no problem, with lots of bronzing pills and \"soul in his voice\" he sets out to Harvard. Soon he has to realize that being black will cause some people to handle him differently.",
         "To achieve his dream of attending Harvard, a pampered teen poses as a young black man to receive a full scholarship."
      ],
      "budget": 0
   },
   "movielensId": 2473,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-10-24",
      "dvdReleaseDate": "2002-03-19",
      "directors": ["Steve Miner"],
      "runtime": 104,
      "movieId": 2473,
      "title": "Soul Man",
      "mpaa": "PG-13",
      "actors": [
         "C. Thomas Howell",
         "Rae Dawn Chong",
         "Arye Gross",
         "James Earl Jones",
         "Melora Hardin",
         "Leslie Nielsen",
         "Julia Louis-Dreyfus",
         "David Reynolds"
      ],
      "imdbMovieId": "0091991",
      "originalTitle": "Soul Man",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["z2zMrjBLwn8"],
      "plotSummary": "Soul Man is a comedy film made in 1986 about a man who undergoes racial transformation with pills to qualify for an African-American-only scholarship at Harvard Law School. It stars C. Thomas Howell, Rae Dawn Chong, Arye Gross, James Earl Jones, Leslie Nielsen, and Julia Louis-Dreyfus.",
      "tmdbMovieId": 12278,
      "avgRating": 2.40083,
      "releaseYear": "1986",
      "numRatings": 1326,
      "posterPath": "/gf8FmcNSKLXHxhsgSRnlRpPpnHj.jpg"
   }
}