{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mexico",
            "id": 534
         },
         {
            "name": "hero",
            "id": 1701
         },
         {
            "name": "village",
            "id": 5331
         },
         {
            "name": "united states–mexico barrier",
            "id": 5616
         },
         {
            "name": "confusion",
            "id": 10705
         },
         {
            "name": "spoof",
            "id": 11931
         },
         {
            "name": "western hero",
            "id": 166527
         },
         {
            "name": "western band",
            "id": 181028
         },
         {
            "name": "actor",
            "id": 207716
         }
      ],
      "imdb_id": "tt0092086",
      "video": false,
      "title": "¡Three Amigos!",
      "recommendations": [
         9080,
         9749,
         1406,
         11584,
         11418,
         11977,
         11153,
         6471,
         14628,
         10141,
         11896,
         11967,
         11591,
         10890,
         10859,
         1552,
         2617,
         11310,
         13665,
         11064
      ],
      "backdrop_path": "/mWuHbFc7qVmVcpybx3ezhXLj5VO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dusty Bottoms",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d0b",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lucky Day",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d0f",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ned Nederlander",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d13",
               "name": "Martin Short",
               "profile_path": "/oZQorXBjTxrdkTJFpoDwOcQ91ji.jpg",
               "id": 519,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Carmen",
               "gender": 1,
               "credit_id": "52fe44a4c3a36847f80a1d17",
               "name": "Patrice Martinez",
               "profile_path": "/zKkA9GgAbXTZCJqwuPGr4fQBGrM.jpg",
               "id": 54813,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Rodrigo",
               "gender": 0,
               "credit_id": "52fe44a4c3a36847f80a1d1b",
               "name": "Philip Gordon",
               "profile_path": "/6mOvBZogB9XWjmxRrSiTkBCiyut.jpg",
               "id": 54814,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "El Guapo",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d49",
               "name": "Alfonso Aráu",
               "profile_path": "/Agw6LyoGlrfJaBvTOQYzdxwUWHh.jpg",
               "id": 22767,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Jefe",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d4d",
               "name": "Tony Plana",
               "profile_path": "/gEcsHeOyejSJr4Ua2xqGxnyjw1J.jpg",
               "id": 41737,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "German",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d51",
               "name": "Kai Wulff",
               "profile_path": "/pDcgW400PJ4qU9mw4LaY1hYKqKt.jpg",
               "id": 42146,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Morty",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d55",
               "name": "Jon Lovitz",
               "profile_path": "/3Sw3X69m19FHSiSpv9cs4doBBfI.jpg",
               "id": 16165,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Harry Flugleman",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d59",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d5d",
               "name": "Phil Hartman",
               "profile_path": "/rf62sAab9vOjm9x7ZA0VBWDkHvD.jpg",
               "id": 14104,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "German's Friend",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d61",
               "name": "Norbert Weisser",
               "profile_path": "/peOhXratQ7tp716MfQNjqUTruzr.jpg",
               "id": 6701,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "German's Other Friend",
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d65",
               "name": "Brian Thompson",
               "profile_path": "/jdO1kSZGTWQqoBIRsUbLWYSNDMR.jpg",
               "id": 2719,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Juanita",
               "gender": 1,
               "credit_id": "52fe44a4c3a36847f80a1d69",
               "name": "Dyana Ortelli",
               "profile_path": "/fRNvwWADALgp6vRJY73HXovtS3p.jpg",
               "id": 104382,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Hot Señorita",
               "gender": 0,
               "credit_id": "52fe44a4c3a36847f80a1d6d",
               "name": "Rebecca Ferratti",
               "profile_path": "/jkj9xVFHEftdPfuDTxqLF1WgoZr.jpg",
               "id": 928,
               "order": 14
            },
            {
               "cast_id": 23,
               "character": "Silent Movie Actress",
               "gender": 1,
               "credit_id": "52fe44a4c3a36847f80a1d71",
               "name": "Brinke Stevens",
               "profile_path": "/zTbesUkb0CKBnT29xRegVRUq4dg.jpg",
               "id": 97621,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d21",
               "name": "John Landis",
               "profile_path": "/4MVt3MDXZzW2TsiQNvZCGv1ivRx.jpg",
               "id": 4610,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d27",
               "name": "Lorne Michaels",
               "profile_path": "/cWJv05hztH5jbiIvWfzMfjMX5fo.jpg",
               "id": 56158,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d2d",
               "name": "Lorne Michaels",
               "profile_path": "/cWJv05hztH5jbiIvWfzMfjMX5fo.jpg",
               "id": 56158,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d33",
               "name": "Randy Newman",
               "profile_path": "/w0JzfoiM25nrnxYOzosPHRq6mlE.jpg",
               "id": 7885,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d39",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a4c3a36847f80a1d3f",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a4c3a36847f80a1d45",
               "name": "Ronald W. Browne",
               "profile_path": null,
               "id": 56223,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Western",
            "id": 37
         }
      ],
      "popularity": 11.115649,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8388,
      "vote_count": 327,
      "budget": 25000000,
      "overview": "Three unemployed actors accept an invitation to a Mexican village to replay their bandit fighter roles, unaware that it is the real thing.",
      "similar": [
         9486,
         36647,
         792,
         272,
         44943,
         16314,
         1656,
         18885,
         10694,
         42941,
         32302,
         40508,
         59883,
         43459,
         118003,
         55204,
         333828,
         338365,
         120300,
         333830
      ],
      "original_title": "¡Three Amigos!",
      "runtime": 102,
      "poster_path": "/zuTwahw966MoFwD7B2SFujaT5yp.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "L.A. Films",
            "id": 960,
            "origin_country": ""
         },
         {
            "logo_path": "/tuomPhY2UtuPTqqFnKMVHvSb724.png",
            "name": "HBO",
            "id": 3268,
            "origin_country": "US"
         }
      ],
      "release_date": "1986-12-12",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "They're Down On Their Luck And Up To Their Necks In Senoritas, Margaritas, Banditos And Bullets!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Landis"],
      "runtime": 104,
      "synopsis": null,
      "writers": [
         "Steve Martin",
         "Lorne Michaels"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092086/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTE5NDQ1NTMyNl5BMl5BanBnXkFtZTcwNjY5MDQ3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steve Martin, Chevy Chase, Martin Short | See full cast and crew »"],
      "reviews": [
         "I looked up this movie on IMDb fully expecting to find a lot of comments that reflected my opinion, that this is a great little film. I was quite surprised at how many people don't feel the same way I do. Some of the movies detractors seem to suggest the movie is a bit slow and that it misses opportunities for packing in lots of jokes. I can't agree, I think the pace is just right and that the movie's direction is more deftly handled than you might think. Some of the set ups in this film are developed meticulously over time allowing plenty of humorous moments along the way to the pay-off. And when they pay-off, they pay-off beautifully. For example I love the scene in which a German mercenary enters a really dangerous looking Mexican bar. The room is full of thugs and cut-throats who laugh at the German's prim appearance and so he kills a few of them. He then instructs the rest of the patrons to be more respectful of strangers and to expect some friends of his to drop in later. The mercenary leaves and soon the Three Amigos arrive wearing camp looking Mexican costumes. It's not long before they start to sing an extremely girly song to the patrons of the bar called \"My Little Buttercup\". The song is accompanied by the most effeminate dance routine committed to film. The mystified bandits all assume the Three Amigos are the German mercenary's friends and go along with the song and dance routine which after a while becomes so cute it makes you feel physically sick. And here is the pay off, the Amigos leave as the real mercenaries arrive, one of the bandits notices the pearl handled revolvers one of the strangers is wearing and yells \"Look at the sissy guns\". Carnage ensues, the German sharp shooters finish off the rest of the patrons in a bloody gun fight, the confused looks on the bandit's faces throughout this whole routine is hilarious. This film isn't desperate to pack gags into every available space, and because of this it feels more controlled and less try-hard, to me most of the jokes are of a high enough quality they don't need a lot of superfluous back up gags. I also enjoy the overall up beat tone of the film, even the bad guys are actually really nice to each other ( the sweater Scene is touching ). I think it's the warmth between the characters that really makes this film for me, I think if the gags kept coming at a breakneck speed we wouldn't have a chance to warm to the characters, the Mexican atmosphere and music the way that we do. I give this a ten out of ten even though it's not a perfect film, it makes me feel as good as a perfect film would.",
         "This is an homage to many old comedies: Old jokes, Silent movie plot lines. It's like a Laurel and Hardy film that was never made. The movie is the joke. Much like Blazing Saddles or Young Frankenstein. I don't know why more people don't get the joke and rate this movie higher. As it is, it is definitely underrated.",
         "5 reasons to love this film: 1. The sight of Ned Nederlander (Martin Short) telling the incomprehensible, self-indulgent story of when he met Dorothy Gish (\"you know, Lillian's sister\") to a bunch of patient, albeit bored Mexican kids. 2. Lucky Day (Steve Martin) trying to get his buddies' attention as they break into the studio--progressing from an owl's soft \"hoo\" to a crowing \"LOOKUPHERE...LOOKUPHERE\" 3. The opening song and Elmer Bernstein's great score (he also scored the classic comedies \"Animal House\" and \"Stripes\") 4. The Three Amigos singing \"My Little Buttercup\" in a Mexican cantina 5. The Amigos fighting back tears as Lucky Day informs his buddies that, in fact, they have been summoned not to perform, but actually to fight the evil El Guapo--Martin Short's tearful line, \"Why am I in Mexico?\" is hilarious, almost as funny as Steve Martin's follow-up, \"I've been shot already!\" This is an intelligent comedy, one that pokes fun not only at the mythology of the Hollywood western, but at Hollywood itself. The three Amigos is a delight to watch, and a great addition to any family's film collection.",
         "Love it. Love it. Love it. This movie is jam-packed with hilarity. The story is good for an 80s comedy as well. Chase, Martin and Short are a power house as the 3 Amigos. And El Guapo has so many good lines I'm laughing just thinking about them, \"Do you even know what a plethora is???\" Every time I hear that word I think of him, which is pretty sad I guess. The scene with Dusty Bottoms (Chase), singing at the celebrations as if he has a frog in his throat makes me laugh every time, My little buttercup scene in the tavern with Ned (Short) with the hankerchief on his head, the calls they have to make to summon the invisible swordsman, the part in the desert...\"lip balm?\" I'm embarrassed to say how many times I have seen this movie, I'm just going to say a lot...and would recommend to everyone!",
         "Before comedic artists came into Hollywood demanding they attempt a role in a very serious film, there were films like Three Amigos. Riddled with laughs, upon laugh, upon laughs, this wildly enjoyable romp through the open desert could only have been accomplished by three of our favorite comedians. Those are Steve Martin, Chevy Chase, and Martin Short. To say that anyone in today's cinema can come close to the genius of these three powerhouses would be a lie. While I do believe that Ryan Reynolds is a very close to becoming the next Chase, nobody else can match their style, humor, and elegance. Comedy was not just a job for these three, it was an art. Three Amigos places us in a small town that is searching for some heroes that will help them get rid of some local hoodlums. Mistaking the opportunity as work, our three protagonists rush into the town prepared for the show of a lifetime. Little do they know, they are soon going to be fighting life and death. Thankfully, seriousness is in low amounts in this film, and comic hijinks ensure. Our three stumble through bars, the desert, and the final hide-a-way before their creative finale. I remember watching this film with my family when I was really young. I remember laughing at everything these three bumbling idiots did, and how impressed I was by the grace they did it with. As I grew older, this film remained with me. These three actors represent some of the funniest moments in cinematic history, and here they are gathered together to make a film. I loved this movie. I loved the absurdity, the randomness, and the sheer fun of these types of films. I miss this type of physical, pseudo-intellectual humor. I miss laughing as much as I did when I first watched this film, and when I watch it over and over again. The simplistic nature of this film allows it to be enjoyed at any time during your life. Martin, Short, and Chase are at the top of their game and never let go. It is sad to see these actors getting less and less work today. Overall, this film impressed me. It is funny, enjoyable, and so silly that you don't need to wade through the bathroom humor to get to the good stuff. It is all right there. I suggest this film to anyone that is looking to laugh and be entertained! Grade: ***** out of *****",
         "This is the level of humour you'll find throughout the movie. It's an ironic twist on the Western cliché with a story based on The Magnificent Seven. The recently out-of-work 3 Movie-Stars are unwittingly employed as bona-fide gun-slingers. They find themselves out-numbered 5:1 by the infamous (\"More than Famous, He's In-Famous!\"), El Guapo (Alfonso Arau) and his Banditos. This impossible situation is soon turned around by quick thinking (Girl A:\"I like the one who is not so clever\". Girl B:\"Which one is that?\") and lots of sewing... yes, I said \"sewing\"! If you listen to this movie closely, you'll pick-up on a lot of humour that would otherwise be lost.",
         "I was shocked when I discovered I hadn't reviewed this despite writing many reviews, since it is one of my favorite comedies of all time. It may even rank as the funniest movie I've ever seen. It just has a ton of laughs, start-to-finish, and without all the raunch and profanity of today's comedy films - although it's no \"Bambi,\" that's for sure. Not only does the dialog produce numerous laugh-out-loud scenes but so do all the sight gags, nd there are plenty of those. The funniest characters in the film are the villains, led by \"El Guapo,\" played by Alfonso Arau. He is almost indescribable. All he has to do is open his mouth and show his bad teeth and then give his huge smile and I crack up every time. The three leads - played by Steve Martin, Matin Short and Chevy Chase - are all excellent and in the primes of their careers. The film also is directed by John Landis, who has a knack for directing extremely entertaining movies. Just look at his resume on the IMDb. This film was written by Martin, Lorne Michales of \"Saturday Night Live,\" and songwriter Randy Newman. Kudos to all of them for a job well done. In addition to the great comedy, decent language and color characters both good guys and bad guys, was the beautiful cinematography. There is a very colorful-looking film and looks outstanding on DVD. Overall: this is what entertainment is all about.",
         "I can't believe what a low rating this movie has on here! This is one of the most classic comedies of all time. If for some reason you haven't seen this movie, go rent it and watch it! Me and my friends use quotes from this movie all the time. This movie is definitely on my top ten for comedies. 5 out of 5.",
         "This is a funny movie and has some of the funniest actors in it. Chevy Chase, Martin Short and Steve Martin are brilliant in a movie that relies completely on their given talent - comedy. It's sad that not many movies were made, having different comedians in them, like Spies like us, also starring chevy chase opposite to Dan Aykroyd. A nice attempt to make a movie without a real story, but instead have the actors make up for it. 7/10",
         "The Three Amigos is one of those movies that can be hugely entertaining and amusing but only if you keep in mind that it is not a serious film. Chevy Chase, Martin Short, and Steve Martin, some of the funniest men ever to work in comedy, all team up here as The Three Amigos, a group of out of work actors in early Hollywood cinema. The unfortunate thing is that this is not a movie that is greater than the sum of its parts, since I would expect more from actors with the caliber of Martin, Chase, and Short, even working individually, but even the fact that they are all not used to their full potential is not enough to bring down the rest of the comedy here. The story involves the three out of work silent film actors, who suddenly find themselves unemployed and broke when they receive a telegram from a small village in Mexico desperately asking their assistance. I liked how clever the ploy was where the woman who sent the message was so poor that she could not afford enough words to make her desires clear, so the Amigos read the message and think that they are about to be paid a fortune just to make an appearance in this village. Naturally they jump at the chance since they have nothing better to do. Most of the rest of the film deals with their adventures in this village, which they are supposed to be protecting from an evil villain but do not realize that this is real life until one of them gets shot. You would think that they would have caught on sooner, but on the other hand, they DID happen to stumble into the only tiny village in Mexico where no one speaks Spanish, so it's not hard to understand why they thought the whole thing was a set up. If I went to Mexico and was walking around a dusty village with nothing but endless desert on every side and every single person was speaking only English, I would also wonder what movie set I had just wandered onto. There is some interesting biblical content, which is made interesting really only because of the great satire. As the Amigos are walking through the valley in the shadow of death, they come upon not the talking bush or the burning bush, but the SINGING bush, and can't seem to get it to stop singing long enough to answer their question. `Will you please stop singing and tell us if you are the singing bush!' There's a hilarious sequence right after this about the invisible horseman, and just before was one of my favorite moments in the entire film, when Chase attempts to get off his horse but only succeeds in getting onto the horse next to him facing backwards and seems to be unsure about what just happened. A lot of this movie is made up of funny skits which are strung along a thin and less than convincing clothesline of a plot, but even though the plot itself is not very believable the movie is still very entertaining. There are a lot of scenes that seem to go too far or just don't really seem to fit with the rest of the film (such as the campfire scene where all the animals join in to the campfire singing), but for the most part the comedy is very good and there are a lot of memorable scenes (the canteen scene in the desert for example, is one to remember!). Not a film that was meant to win any Oscars, but there is definitely some great comic entertainment to be had with The Three Amigos."
      ],
      "genres": [
         "Comedy",
         "Western"
      ],
      "productionCompanies": [
         "L.A. Films",
         "Home Box Office (HBO)"
      ],
      "summaries": [
         "Three out of work silent movie actors are accidentally drawn to a Mexican village that is being harassed by a gang of outlaws. The three, 'Ned', 'Lucky Day' and 'Dusty Bottoms' play 'Lone Ranger' types in their movies, but must play their parts for real now.",
         "When silent film stars Lucky Day, Dusty Bottoms and Ned Nederlander get fired, they take a job offer from Mexico: Doing a show with El Guapo, supposedly the most famous actor there. Traveling there in hope of getting good money, they arrive only to learn soon that El Guapo is not an actor, but a cruel gang leader suppressing people. He abducts the mayor's beautiful daughter Carmen (to be his wife) in revenge for the people's cry for help. Now, all hopes of the village folks rest on the weak shoulders of three minor-talented actors, who can't just walk off the set this time.",
         "Three unemployed actors accept an invitation to a Mexican village to replay their bandit fighter roles, unaware that it is the real thing."
      ],
      "budget": 25000000
   },
   "movielensId": 2478,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "1986-12-12",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["John Landis"],
      "runtime": 102,
      "movieId": 2478,
      "title": "¡Three Amigos!",
      "mpaa": "PG",
      "actors": [
         "Chevy Chase",
         "Steve Martin",
         "Martin Short",
         "Patrice Martinez",
         "Philip Gordon",
         "Alfonso Aráu",
         "Tony Plana",
         "Kai Wulff",
         "Jon Lovitz",
         "Joe Mantegna",
         "Phil Hartman",
         "Norbert Weisser",
         "Brian Thompson",
         "Dyana Ortelli",
         "Rebecca Ferratti",
         "Brinke Stevens"
      ],
      "imdbMovieId": "0092086",
      "originalTitle": "¡Three Amigos!",
      "genres": [
         "Comedy",
         "Western"
      ],
      "youtubeTrailerIds": [
         "WUTl8DSYUQA",
         "_d4QbEknbbM",
         "3tFFFUw4D5I"
      ],
      "plotSummary": "Three unemployed actors accept an invitation to a Mexican village to replay their bandit fighter roles, unaware that it is the real thing.",
      "tmdbMovieId": 8388,
      "avgRating": 3.11434,
      "releaseYear": "1986",
      "numRatings": 7740,
      "posterPath": "/zuTwahw966MoFwD7B2SFujaT5yp.jpg"
   }
}