{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "on the run",
            "id": 10562
         },
         {
            "name": "streetwise",
            "id": 170089
         },
         {
            "name": "cigarette smoke",
            "id": 180148
         },
         {
            "name": "moll",
            "id": 207746
         }
      ],
      "imdb_id": "tt0120683",
      "video": false,
      "title": "Gloria",
      "recommendations": [
         33657,
         83489,
         50116,
         25697,
         73249,
         118430,
         46027,
         161495,
         49478,
         51036,
         32872,
         41779,
         41590,
         32316,
         106143,
         136727,
         56085,
         70180,
         46283,
         41670
      ],
      "backdrop_path": "/6rlOgCIxCuJj1cmlPcaBekgQuRb.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Gloria",
               "gender": 1,
               "credit_id": "52fe46d0c3a36847f8113911",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Kevin",
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113915",
               "name": "Jeremy Northam",
               "profile_path": "/8NkPuXeJ8nXXIhgrmS8g7kcaTOS.jpg",
               "id": 18325,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Diane",
               "gender": 1,
               "credit_id": "52fe46d0c3a36847f8113919",
               "name": "Cathy Moriarty",
               "profile_path": "/sxSwB6uVUMjmeCw3XZzZytbqgRp.jpg",
               "id": 14702,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Nicky",
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f811391d",
               "name": "Jean-Luke Figueroa",
               "profile_path": null,
               "id": 133517,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Sean",
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113921",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Ruby",
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113925",
               "name": "George C. Scott",
               "profile_path": "/wFC6K5wv6r4DgZI09JGaAsb1eCR.jpg",
               "id": 862,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Jack",
               "gender": 2,
               "credit_id": "55aa372f9251411e180051d9",
               "name": "Bobby Cannavale",
               "profile_path": "/o3xnmePoOUCw7sjoZ4xM4W5DL26.jpg",
               "id": 21127,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "561829b5c3a3682448000420",
               "name": "Bonnie Bedelia",
               "profile_path": "/10JhoIaKHQGG0DNbQECTI4gHNn9.jpg",
               "id": 7673,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Terry",
               "gender": 2,
               "credit_id": "561829cc9251413760000413",
               "name": "Barry McEvoy",
               "profile_path": null,
               "id": 102977,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Angela",
               "gender": 1,
               "credit_id": "56182a069251413750000402",
               "name": "Sarita Choudhury",
               "profile_path": "/2YNa0h5lCq5lMYyGFLJmSe09ZeW.jpg",
               "id": 20275,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Maria",
               "gender": 1,
               "credit_id": "56182a33925141375d0003dc",
               "name": "Miriam Colón",
               "profile_path": "/vNKUyJKVIvAmXT6pv0vWrZXazlS.jpg",
               "id": 1163,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Luz",
               "gender": 1,
               "credit_id": "56182a48c3a368245a00048a",
               "name": "Desiree Casado",
               "profile_path": "/5CthHo7asJPuBUTqAwfGmuIMqCN.jpg",
               "id": 91034,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113901",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f8113907",
               "name": "John Cassavetes",
               "profile_path": "/dvW9LHWNcgvRLqCom5jhx2T3aIG.jpg",
               "id": 11147,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d0c3a36847f811390d",
               "name": "Steve Antin",
               "profile_path": "/3GVyNtFWsPz2nCxSgCo6WN6H0UN.jpg",
               "id": 42745,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 2.880512,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 45712,
      "vote_count": 25,
      "budget": 30000000,
      "overview": "Sharon Stone plays a street-wise, middle-aged moll standing up against the mobs, all of which is complicated by a 6 year old urchin with a will of his own who she reluctantly takes under her wing after his family has been gunned down.",
      "similar": [
         5503,
         201088,
         260346,
         11702,
         1724,
         213,
         97614,
         3133,
         2502,
         27576,
         78,
         16320,
         76341,
         642,
         294254,
         291805,
         136400,
         241554,
         49530,
         11859
      ],
      "original_title": "Gloria",
      "runtime": 108,
      "poster_path": "/1AKAfnT3nm7asU9qyNT6gtS1vbe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mandalay Entertainment",
            "id": 1236,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-01-22",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Gloria. Big mouth. Big attitude. But who knew she had a big heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sidney Lumet"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "John Cassavetes",
         "Steve Antin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120683/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcyMzg4NDEyOV5BMl5BanBnXkFtZTcwMzA2MzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sharon Stone, Jean-Luke Figueroa, Jeremy Northam | See full cast and crew »"],
      "reviews": [
         "The veteran Sidney Lumet wastes his talent here by presenting us with a well told but banal story of a woman involved with the leader of a criminal gang who accidentally becomes aware that the gang is willing to kill a little boy in order to eliminate a possible undesirable witness and decides then to save the boy at the risk of her own life, initiating a course of hide and run well shown in a sequence of scenes thrilling enough to rivet our attention. However neither Sharon Stone in the role of the woman who develops maternal love for the boy nor Jean-Luke Figueroa in the role of the little boy suddenly orphaned and becoming sentimentally attached to her, are very convincing indeed and that's the weakest part of the movie. The best part of the movie is the acting of George C. Scott another veteran, here in a minor role but showing his great talent every time he appears on screen. A fair movie after all.",
         "The 1999 remake of \"Gloria\", is an insult to the great John Cassavettes, who wrote and directed the original in 1980. Sidney Lumet proves that he is not even in the same league as Cassavettes. This new version completely lacks the energy and the intensity of the original. Ridiculous melodrama and overblown sentimentality is the only thing Sidney Lumet has to offer. And Sharon Stone's acting ability seems laughable when compared to Gena Rowlands, who originated the role in 1980. Rent the original and skip the remake. Make Cassavettes proud.",
         "Even though I was a kid when I saw the original, I can remember it being much more endearing and convincing than this Sharon Stone remake. It's not great, it's not bad, but Sharon does not ever convince me that she is a \"mother-figure\" to the orphaned boy she wants to help. She's always just a little too abrasive, too tough, and trying too hard to be sexy in this role. The boy who plays one of the lead characters comes off better than Sharon. I'm wondering what kind of recruiting they needed to get George C. Scott and Jeremy Northam in this movie. My advice is to stick to watching Sharon Stone in her usual glamorous, sex-pot type roles. They are much more suited to her style.",
         "Gloria is released from prison having done her time the right way and never mentioning anything about her mobster boyfriend Kevin or his boss Ruby. She returns to find that he has not kept his end of the bargain. Also in Kevin's custody is Nicky Nuñez, a 6 year old boy whose family was killed for a disk of incriminating information. Gloria feels that the murder of a child is a step further than she can deal with and takes him and the disk. As the mob hunt them down Gloria realises her chances of survival are slim and tries to work out how to save Nicky. I expected nothing from this when I sat to watch it \u0096 in fact I was genuinely surprised when I saw that Sidney Lumet had directed it, as I had expected a trashy thriller-come-comedy of some sort. However the mood of the piece is set out early on when Nicky's family is murdered by Sean. This is a powerful and unpleasant scene in the film \u0096 not overly gory but moving. The main thread of the film is the old `hooker with a heart of gold' type of thing and I must admit that this element is often it's weakest part. It's here that I felt old ground was being treaded and that the sentimentality was allowed to get a little out of hand. This is particularly evident in the final 10 minutes (awful ending by the way) but it raises it's head several times during the film where `Gloria learns valuable life lessons about herself' etc. Happily for the most part this is offset by a some good thrills \u0096 such as some good car chases, moments of violence and a good sense of menace from the mobsters. Stone has a difficult role. It is one that could be swimming in it's sentimentality. She doesn't totally succeed (her accent is a little forced at times) but she carries it reasonably well. Figueroa has an even harder role in being the cute kid. Sadly for the most part he is the `cute kid' and is a little irritating but he does have a few strong scenes that show there is more to him and he is good considering his age. Northam is OK, Starr brings real menace, Scott and Moriarty have clearly both been cast to add some class to the film but only have small roles. Overall this is a reasonable film. To some extent we've seen it before and the sentimentality really threatens to sink it at times. However a real sense of menace and some strong scenes make this a better film and the thriller scenes, although not great, are solid enough when combined with these to make the film watchable \u0096 just don't expect this to be without big areas of weakness though.",
         "I looked this movie up on IMDb, because it had only 1-1/2 star rating on our UVerse movie guide, and I thought this must have been a mistake. (After all, they didn't even have Sharon Stone listed in the cast. But the IMDb reviews are low as well. I'm flummoxed! It's far from the miserable film described in some of the other reviews. If you listen to them, you might miss an enjoyable film experience. Sharon Stone is excellent, the child actor is excellent. The other characters are incidental and don't matter much, but they are generally good as well. The story is engaging enough... .and even if slightly contrived, in places, who cares? I recommend you give it a try.",
         "Sharon Stone with a Bronx accent? British actor, Jeremy Northam, copping same accent to sound like a mafioso? Ridiculous. Sharon must have agreed to do this movie to make a statement about her maternal side, wanting a baby, who knows! She plays a gangster moll who rescues a 7 yr old from being rubbed out (truly!), after which the entire movie shows the pair bonding in coffee shops an running from armed henchman. Will she leave the kid in an upstate Catholic school where he will get good care, education and A LIFE? Or will she be forced by the tug of her heartstrings to raise him herself in spite of having nothing but a criminal record to offer? What do you think? Ugh. Might be a good rental for those playing Spot-A-Movie-Cliche-Take-A-Drink game.",
         "The feeling of nostalgia one experiences watching the original \"Gloria\" with Gena Rowlands, is sadly not present in this modern remake. Noticeably gone is that sweeping, dramatic score for the original, which added a sense of sadness and later, a sense of hope for Gloria and her young companion. \"Gloria\" first and foremost, is a New York story, and the city plays the largest part. Face it, the gritty, diverse and savage NYC that existed in 1980, is sadly no more. And that is why this 1999 effort lacks the heart, the quality that made the original a classic. Sharon Stone is quite good here, but she is too young here to play the middle-aged, world-weary Gloria; she simply does not look all that much like a woman who has had a truly rough life. And the young actor Jean-Luke Figueroa, while being very adorable, and a fine child actor, isn't always convincing as the streetwise, Spanish kid from the Bronx. Sometimes he reveals himself as a spoiled, very Americanized kid who has never seen the inside of a ghetto in his life. Remember John Adames, the kid from the original? Now that little guy was the real thing, seemed like he had lived all his life in the barrio. I believe his acting was weak because he wasn't an actor, just a real kid cast as a character like himself. The realism that made the first so great is lost here, in a remake that is too slick, and too stylish to have any real heart. Another thing that is missing is the grittiness, such as the hotels they are hiding in when the mob is chasing them. In the original the sleazy flophouses and shady hotels Gloria and Phil were staying in really added to the level of danger and desperation. This time around, Sharon Stone and 'Nicky' (they changed the boys name for some reason?) are staying in 4 star hotels! Generic and a bit boring. Of course the weakest thing about the remake, is the total lack of connection between Gloria and the boy. They don't seem believable here. In the original the little boy actually falls in love with Gloria, almost in a romantic way, and that was the sweetest, and most endearing thing about their relationship. Maybe in this day and age it was thought inappropriate to go that route. And the ending for the remake does not really work. For the audience to believe that the mafia would simply release a boy who witnessed them murder his family, they would have to be pretty gullible. No, the boy was 11, and all would assume that in a few years, he would return to avenge his family. notice in the original, Gloria and Phil planned an elaborate escape, where the mob would assume they were both dead, which added an extra level of suspense. For the average viewer, 1999's Gloria is a fun, enjoyable movie, but was a pointless remake. seeing this I can only pray that some idiot doesn't try to remake \"Taxi driver.\" What a disaster that would be, for the same reasons that this one failed...",
         "I never really believed a second of this movie -- it feels like contrived Hollywood schlock. But I enjoyed it anyway. Sharon Stone's performance is fun, and her wardrobe alone is worth the price of admission. There's also one of the best car chases I've seen in recent years.",
         "Yeah, I realize what it says under the director's credit. But there is no way in hell that I'm gonna believe that the man that gave us \"Network\", \"Dog Day Afternoon\", \"Running On Empty\", and his own quartet of NYPD dramas (\"Serpico\", \"Prince of the City\", \"Q&A\", and \"Night Falls on Manhattan\") is even associated with this. This is quite possibly the worst mainstream film of '99, in the cozy company of \"Bats\", \"Virus\", \"She's All That\", and (gasp!) \"The Haunting\", just to name a few. Where to begin? The script for starters. How the writer managed to completely foul up the original source material is beyond me. Much of everything that comes out of Sharon Stone's mouth is unintentionally funny, especially in one scene where she tells her young companion, \"I'm trying to teach you a philosophy of life here!\" after telling him opportunities in his future (these include going to a race track, lovemaking, and \"chasing a skinny blonde girl with big boobs.\") And while on the subject of Stone, it's roles like this that manage to solidify the claim that maybe, just maybe, her brilliant turn in \"Casino\" was a fluke. Please Sharon, say it ain't so! Like other users have mentioned, the film's only saving grace is the car chase. But there's a lot of tedium to get through until the chase scene comes. Then again, why bother? Avoid. I can't stress this enough.",
         "\"Gloria\" Having not seen the original Gena Rowlands version, I was very surprised to feel entertained and satisfied with this remake. Not much happens in this film, so therefore no marketing angles to work. It all depends on your tolerance for Sharon Stone. I have no problem with her. She has had some very fine performances in the past, and she is more capable then most actresses. Yet, her sheer ego and the \"glamour\" she sweats daily gets in the way of her natural charisma. In \"Gloria\" she is given full opportunity to own the frame with a detailed and rich performance. Her interaction with the child of the film is funny, and at one point - achingly heartbreaking. She works overtime to make the film connect. Working in the same old NY/LA vortex that has absorbed modern movies, the film is not really ground-breaking in any way, just simply enjoyable. Lately, that's all I ask from a movie. The Brooklyn mob hitmen that are the nemesis of Gloria are boring and cliched, but director Sidney Lumet does a fine job making the violence in the film pleasingly bloody and memorable. This version - I would bet - does not compare favorably to the 1980 Cassavetes's film, but for now I'm amazed how well it works.--------------- 7"
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Eagle Point Production",
         "Mandalay Entertainment"
      ],
      "summaries": ["Sharon Stone plays a street-wise, middle-aged moll standing up against the mobs, all of which is complicated by a 6 year old urchin with a will of his own who she reluctantly takes under her wing after his family has been gunned down."],
      "budget": 30000000
   },
   "movielensId": 2479,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-22",
      "dvdReleaseDate": "1999-05-25",
      "directors": ["Sidney Lumet"],
      "runtime": 108,
      "movieId": 2479,
      "title": "Gloria",
      "mpaa": "R",
      "actors": [
         "Sharon Stone",
         "Jeremy Northam",
         "Cathy Moriarty",
         "Jean-Luke Figueroa",
         "Mike Starr",
         "George C. Scott",
         "Bobby Cannavale",
         "Bonnie Bedelia",
         "Barry McEvoy",
         "Sarita Choudhury",
         "Miriam Colón",
         "Desiree Casado"
      ],
      "imdbMovieId": "0120683",
      "originalTitle": "Gloria",
      "genres": [
         "Drama",
         "Action",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["hld5iJyUJ4s"],
      "plotSummary": "Sharon Stone plays a street-wise, middle-aged moll standing up against the mobs, all of which is complicated by a 6 year old urchin with a will of his own who she reluctantly takes under her wing after his family has been gunned down.",
      "tmdbMovieId": 45712,
      "avgRating": 2.41349,
      "releaseYear": "1999",
      "numRatings": 341,
      "posterPath": "/j7aJcmRm9bkSFhRHN0mIOleixOn.jpg"
   }
}