{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110066",
      "video": false,
      "title": "Houseguest",
      "recommendations": [
         26258,
         19033,
         161495,
         61418,
         35225,
         17770,
         22792,
         42807,
         99581,
         25576,
         55336,
         157036,
         47939,
         33657,
         273610,
         46924,
         117553,
         17133,
         25969,
         40490
      ],
      "backdrop_path": "/n0CsQ1ntOSai2RACkrlLXkuL3zQ.jpg",
      "revenue": 26325256,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kevin Franklin",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c931",
               "name": "Sinbad",
               "profile_path": "/lQ6VVIxpZuwgXJuBX87YwQkXUoq.jpg",
               "id": 57119,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Gary Young",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c92d",
               "name": "Phil Hartman",
               "profile_path": "/rf62sAab9vOjm9x7ZA0VBWDkHvD.jpg",
               "id": 14104,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ron Timmerman",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c93f",
               "name": "Jeffrey Jones",
               "profile_path": "/96J47E34mbjqnhiW9dbLuBqyqmD.jpg",
               "id": 4004,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Emily Young",
               "gender": 1,
               "credit_id": "54fd17b5925141237d003791",
               "name": "Kim Greist",
               "profile_path": "/u857tppmsyDcYuzqXyj83G70mq0.jpg",
               "id": 387,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Pike",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c943",
               "name": "Mason Adams",
               "profile_path": "/ty5wmpiFUWgKgPapYT6exGsS6vf.jpg",
               "id": 59945,
               "order": 4
            },
            {
               "cast_id": 4,
               "character": "Jason Young",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c93b",
               "name": "Chauncey Leopardi",
               "profile_path": "/hA6TSw8Bh9hWTNu7EEc2TydBANu.jpg",
               "id": 88599,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Brooke Young",
               "gender": 1,
               "credit_id": "54fd17d6c3a3681638002cdd",
               "name": "Kim Murphy",
               "profile_path": null,
               "id": 42059,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Joey Gasperini",
               "gender": 2,
               "credit_id": "52fe47109251416c7508c947",
               "name": "Tony Longo",
               "profile_path": "/1kRcEeiz6cFAX41xz9ttCDE2MfG.jpg",
               "id": 13644,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47109251416c7508c937",
               "name": "Randall Miller",
               "profile_path": null,
               "id": 77121,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a43f4edc3a368586c054f8a",
               "name": "Michael J. Di Gaetano",
               "profile_path": null,
               "id": 1522741,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a43f5010e0a264f39058b78",
               "name": "Lawrence Gay",
               "profile_path": null,
               "id": 131650,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.594978,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17207,
      "vote_count": 21,
      "budget": 10500000,
      "overview": "In hot water with the mob over an unpaid debt, a con man poses as a family friend in an affluent Pennsylvania suburb.",
      "similar": [],
      "original_title": "Houseguest",
      "runtime": 113,
      "poster_path": "/hJ1t3dz51ZirOZVzse9LpmW5Mnw.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         },
         {
            "logo_path": "/xXojkyRWFZ0JTJyjiu13ThKeFbz.png",
            "name": "Hollywood Pictures",
            "id": 915,
            "origin_country": ""
         }
      ],
      "release_date": "1995-01-06",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Randall Miller"],
      "runtime": 113,
      "synopsis": "Kevin Franklin (Sinbad) is an inner-city Pittsburgh native; raised in an orphanage, he has delusions of grandeur and talks about one day getting rich and driving a Porsche. 25 years later, Kevin drives a rusted MG Midget and all his ambitions revolve around a series of ill-fated get-rich-quick schemes. A handshake loan of $5,000 from the mob grows to $50,000 through interest and penalties, resulting in his trying to skip town at Pittsburgh International Airport. Kevin overhears a conversation between lawyer Gary Young (Phil Hartman) and his wife Emily (Kim Greist), who are waiting to pick up Young's childhood friend Derek Bond, who is now a successful, straight-laced and vegetarian dentist. Upon hearing Young say that he hasn't seen Bond in 25 years and doesn't know what he looks like, Franklin gives his ball cap to the real Bond to throw off the two dim-witted mobsters chasing him and poses as Bond to the Youngs, who take him to their posh home in Sewickley. Although he knows nothing about dentistry, Franklin still manages to convince those around him that he is in fact Derek Bond, and his affable personality makes him popular with Young's otherwise stuffy and rich neighbors and associates. Young has little time for his children and his wife's new frozen yogurt business, which gradually builds a gap between them, largely due to the demands of his bigoted, arrogant boss (Mason Adams) at the law firm where he works; this leads to Franklin developing a bond with Young's Goth daughter, helping her stand up to her cheating boyfriend, and his young son, who has aspirations of playing pro basketball. Young eventually stands up to his boss with Kevin's support and quits the firm to be with his family. Meanwhile, the mob thugs threaten Kevin's best friend Larry (Stan Shaw) into revealing his whereabouts, and Franklin asks Larry to pick him up when tensions in the house run high. After Larry does so reluctantly, he sparks an argument with Kevin over his lack of appreciation of friendship, causing Kevin to realize that Young has been his friend all along. He returns to the family only to find that the mobsters have taken them hostage, and Kevin's true identity is revealed when the real Derek Bond finally shows up. After the mobsters take Kevin away, he manages to escape, and loses them in a charity marathon, where he meets up with Young, who graciously decides to help Kevin despite his charade, in return for helping bring Young's family closer together. Kevin reveals that he has an instant lottery ticket he purchased the previous day for a chance at a $1,000,000 cash prize spin on a Saturday night TV show, which he reluctantly gives up to the mobsters in exchange for the forgiveness of his debt. Some time later, Kevin parallel parks a shiny new red Porsche in front of the Young household, appearing for a promotional party for his new best-seller book \"Handbook for Houseguests\", based on his experiences with the family. The partygoers gather in front of the TV to watch the mobsters spin the wheel for the jackpot. The wheel initially lands on the million dollar jackpot, but then falls and lands on $5000, much to the mafia don's dismay. During the closing credits, Hartman and Sinbad sing a medley of food-based parodies of Christmas songs.",
      "writers": [
         "Michael J. Di Gaetano",
         "Lawrence Gay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110066/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5MDQ1NTY1Ml5BMl5BanBnXkFtZTYwODgxODQ5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Sinbad, Phil Hartman, Kim Greist | See full cast and crew »"],
      "reviews": [
         "The comic genius and timing of stars Sinbad and Phil Hartman take what could have been a run-of-the-mill dumb comedy film and turn it into a wonderfully likeable tour-de-force. The premise has been done time and time again, it's basically a \"fish out of water\" story. Yes, the gangsters are dumb almost to the point where they're annoying. Sure, we see the message coming from a mile away. But there are a few things that separate this film from other comedies, and elevate to the status of excellence. First of all, it's hilarious. There are few jokes that don't work and they are immediately forgotten as this fast-paced romp wastes no time. The speed-up of scenes and the quick editing (several shots seem to last for no longer than a few seconds) do get a slight bit irritating, but it serves its purpose by catering to the fast-paced story and Sinbad's style of comedy. Take for instance, the party scene in which Sinbad is explaining what the \"GFH\" on his suit jacket stands for. Slow down the scene, and it loses the humor. Since the McDonald's issue has been cited again and again in reviews with varying degrees of criticism, let me address it briefly. First of all, there are a lot of people who love to eat McDonald's food. It's not healthy for you, but you'd be lying if you say that it tastes awful. Now, Sinbad's character is established as the lazy, unhealthy, always-eating slacker from the very beginning as he comes home to his apartment and enjoys his McDonald's and 2 liter bottle of soda. The real Derek Bond is completely contrasted with the impostor Derek Bond's lifestyle. Hence the fish out of water comedy. Sinbad's character is put in a desperate situation where he assumes this other man's life and the man he is pretending to be is the complete opposite of him. He's got a successful career as a dentist and he maintains a strict diet of vegetables and muescli cereal. So, when Sinbad's Kevin Franklin character, in this awkward and unfamiliar situation of staying with a suburban family's house and pretending to be someone who everyone expects to be a health-conscious stuffy professional, manages to escape for a moment and sees the familiar golden arches, he's so happy that he feels like he's in a commercial. He knows McDonald's and in many places, McDonald's seems to be an unchanging, constant source of familiar greasy food. McDonald's works in the context of the film because it's a real fast-food place that we can relate to, because we've all eaten there at one time or another. To me, if there was some fictional place like \"Lou's Hamburgers\", it wouldn't work. The character design might come through, but there could be no jingle resounding in our heads, and it'd take you out of the reality of the story (which I discuss in next paragraph). Yes, McDonald's is a real fast-food joint, and Kevin Franklin loves to eat there. Does that make \"Houseguest\" a McDonald's commercial? I don't think that it does, I think it maintains an element of reality that we as viewers can relate to. Perhaps we needn't always be so cynical as some professional film critics are. Now, I mention the 'reality' of \"Houseguest\" and you must think I'm absolutely crazy. Houseguest is an unrealistic film that requires you to throw logic out the door entirely if you wish to enjoy it, right? Well, not necessarily. I think looking back at this film, eight years after it was made, we can look at the family suburban life depicted, and notice the real-ness of the characters. Phil Hartman's character Gary Young is a hard-working businessman at a law firm. He sucks up to his boss and the boss's wife and spends more time with his job than his family. Gary's wife tries to be there for her family, but she's taken on a career with frozen yogurt stores and it's turning out to be far more time-consuming than she imagined. Then, there are the three children. The oldest girl is distancing herself from her family, trying to find comfort in a \"Goth\" phase, taking pleasure from sad poetry and a boyfriend who seems to think that he's a tough kid from the hood. The middle child is the only son, Jason. He tries to win his father's approval by playing basketball and hoping to be good. The youngest daughter seems not to be getting any attention, either. Her busy parents don't have time for her, and she's been getting lessons from television programs instead. The dysfunctional middle-class family serves as a foil for Kevin Franklin, pretending to be someone he is not, who will ultimately find the desire to help these people, who have unknowingly opened up their home to him, a complete stranger. Kevin Franklin doesn't have a job, a family, or kids, and yet it his interactions with the Young family that allow both them and he to better themselves. Now, if you've seen the movie, you're probably reading this and thinking, \"This guy's nuts. He's completely overanalyzing some stupid comedy.\" Well, perhaps I am. \"Houseguest\" is indeed a silly, hectic fish-out-of-water comedy; somewhat formulaic, but very much successful. However, to dismiss the film as 'bad' or a 'stupid comedy' is a superficial assessment of a film that really has a lot going for it. Sure, the film is glossy and not without faults, but then, so is life and the people that we interact with. \"Houseguest\" is a winning comedy, and one of my favorite films of the 1990s. It presents laughs but also provides a realistic look at individual and family life in the '90s, even if this comes out of an unrealistic set-up of a man assuming another identity to avoid the mob. Much-maligned and underappreciated, \"Houseguest\" is a gem of a family comedy that I certainly hope you will give a chance. Or if you initially didn't like it, some more thought on these matters and maybe a second chance.",
         "I thought for sure I was going to run kicking and screaming from my television... a film with Sinbad? Unwatchable! But this gem proved me wrong, as I not only watched it but loved almost every second of it (and Sinbad is always on the screen, so surely it must be his doing!). The story is a common Hollywood theme: a guy (Sinbad) passes himself off on a group or family as someone he's not: in this case, a childhood friend of a father (Phil Hartman). A little variety exists in how to play this out, but the same old stuff happens: stranger teaches family a lesson and learns one himself along the way. What made this film great was the cast. Sinbad was surprisingly insightful and was able to make even average activities seem far-fetched and outrageous. Phil Hartman had a relatively minor role and didn't really get to provide us with a full performance, but his physical facial comedy of biting into a piece of turkey was extremely amusing (facial comedy plays a large part in this film, later coming back when a wine taster is testing a glass). Jeffrey Jones has too small a part (this man is so under-rated in Hollywood), but does well with what he's been given. And most of all I think Kim Murphy's career should have ignited from this film, but I guess producers didn't watch it. Murphy is obviously beautiful (which seems to be enough to make it in Hollywood), but more so she played her Gothic character perfectly. I was amused with her delivery of the lines concerning Edgar Allan Poe's last meal, her Smiths t-shirt (perfect choice) and the really wacky line about evil rats. The writers did their homework when writing in Murphy's character and she repaid them in spades. (Can I use the word \"spades\" when talking about a Sinbad movie?) The soundtrack was amusing. Best feature: the fact that some scenes were so obviously McDonald's commercials, with one really extended scene including a McDonald's theme song. Heck, after that moment I would have cut off my own leg for a double quarter pounder with cheese. I love this movie, and would not be against displaying it proudly on my movie shelf for all my relatives, friends and guests to see. I do not know why this film has gone underground and has been long forgotten my many people, but it shouldn't have been. This is comedy gold, people.",
         "Kevin Frankin (Sinbad) is a guy who dreams of starting his own business. However, getting it off the ground is another matter altogether, and soon Kevin discovers that the two loan sharks who fronted him money want to be paid, and paid promptly, otherwise Kevin will be spending some time in the hospital. On the run through an airport, Kevin is trying to find a way out when he overhears Gary Young (Phil Hartman) wondering where his friend is. It seems that Gary has arranged a reunion with an old friend from childhood, but since he hasn't seen him in 25 years, he has no idea what he looks like today, beyond the fact that he's black. Kevin fits the bill that far and claims to be Gary's long lost buddy, which Gary buys hook, line, and sinker. Gary seems to enjoy bonding with his old friend, and Kevin likes staying at Gary's fine home and raiding his icebox, but Kevin discovers that impersonating a stranger is a lot more complicated than he expected after he's forced to perform oral surgery and give a speech at a grade school \"Career Day\" presentation. However, this is all small potatoes on the \"oh, no\" scale when the loan sharks track Kevin back to Gary's home in the suburbs. Houseguest was funny, it is underrated if you ask me, Phil Hartman and Sinbad made a great team. I recommend Houseguest if you want to see some classic Phil Hartman, he was great.",
         "Most family movies seem hastily thrown together but HOUSEGUEST is an exception. The dialogue sparkles, the direction isn't just 2-takes-and-go, the cinematography is whackily speeded up in some places and the editing is rapid fire. And unlike most family movies, it lasts for 110 minutes. That's about half an hour longer than is usual. I know this hardly seems like a valid point but I reckon it proves the movie's got more content than fart jokes etc. My only gripe is the obvious McDonalds plugging about 40 minutes in. If you can just turn away for these 10 seconds then it's not so bad. It's a shame that it's there tho because it tarnishes the credibility of the movie. Sinbad is always good and the late, great Phil Hartman can make any film watchable so they really add to this brilliantly entertaining comedy. Do yourself a favour and watch it. It's not just for kids. I watched my VHS a zillion times and I was so impatient for this DVD to be released. So it's barebones, but who cares? I'm just glad to have it. The 1.78:1 anamorphic picture is super and the Dolby 2.0 surround track is decent enough. After all this is a dialogue driven comedy but some sound effects and music are presented pretty well. My subwoofer even go a big kick from a gunshot near the end. Pick this one up whenever you see it. No matter what age you are, you and your kids will enjoy.",
         "Houseguest. One of Sinbad's funniest movies and Phil Hartman's funniest movies. Sinbad plays a 35-year old, never want go get a job, con man, who is in to the mob for $50,000 dollars. After trying to escape from the con man, he impersonates a dentist and that's when the fun begins. Right off the back, Sinbad brings the laughs. All of of lines about the great white shark biting his friends head off and the GFH off of his suit jacket. This is a wonderful movie and I would recommend it to anyone, because Sinbad is a comedian that doesn't need profanity to be funny. Funny 10/10!",
         "This movie surprisingly works and is very funny and enjoyable and it's also, what I think to be the litmus test of a good movie, always good for repeated viewing without losing its charm. I pass by the film on cable and find myself watching it again and still laughing. I know this seems hard to believe especially since the story is ridiculous and the script is pretty banal. I've come to the conclusion that it's the genuine talent of Sinbad, an exceedingly funny man who unfortunately seems to have disappeared from show business as of late. Phil Hartman adds a great deal to the film with his always impeccable delivery but I can't help but think of his horrible tragedy and kind of fall out of the movie's whimsy at times. I always liked this movie. It manages to rise above most Hollywood comedies that are inevitably annoying and dispensable. This movie is fun and has great acting which makes up for the fact that it is, by nature, just a screwball comedy. It's a total guilty pleasure but I say go for it.",
         "Since today is Sinbad's 50th birthday, I wanted to talk about one of his movies. \"Houseguest\" is probably the sort of movie that can only appeal to eleven-year-old boys, but it has its moments. Portraying a debt-ridden man (Sinbad) posing as the friend of a suburban man (Phil Hartman) and moving into his house to avoid some gangsters, it's pretty silly, but not harming anything. A particularly goofy scene is the whole \"washing balls\" sketch. So, it's the sort of movie that you watch with best buds. Don't expect a religious experience, just expect to laugh (I'm sure that you will). Among other things, it goes to show what we lost when Phil Hartman was murdered. Also starring Kim Greist and Jeffrey Jones.",
         "What a great movie this is. Humorous, well acted, dramatic, and well written. A Pittsburgh get rich-quick man, Kevin Franklin (Sinbad) is in big trouble! He borrowed money from the bad guys, and now they want it back, or Franklin is history! In attempt to skip town at the airport, Franklin runs into Gary Young (poor old Phil Hartman) who is waiting for his old friend Derek Bond who he hasn't seen in 25 years. Franklin becomes Bond, and lives with Gary for a few days. What an adventure he has, not knowing who Derek Bond is, and trying to be him! A lot of excitement and humor happens now! Kevin learns a lot, but also teaches Gary's family things they needed to help them from falling apart. Kevin really improves the Youngs, and they improve him. Now if only the bad guys weren't still after Franklin. Can Kevin get the Youngs to help him with the bad guys, and will they all make it?! If you like Sinbad and poor old Phil Hartman, check this movie out. It's also great for you if you like adventures and comedies. On a scale of 1-10, I give this movie a nine (9), and a letter grade of A! Check it out for yourself. You'll have a ball, and you might even learn some important stuff!",
         "The plot is formulaic, the characters are trite. Even worse, the characters are all negative stereotypes without any parody with which to lampoon them. As such, the movie is nearer to a Saturday morning cartoon than to National Lampoon. It is not smart. Still, much of Sinbad's comic delivery is fun, I'll admit! His \"award-acceptance\" monologue near the beginning I find hilarious. I can picture a golden age icon like young Mickey Rooney or Jimmy Stewart doing the same scene with a zany innocence... but Sinbad is a comic for our times and because of the edginess of his character (who was set up to look like a petty criminal) that scene couldn't have been more funny. I also enjoy the tooth-removal sequence. It's comedy worthy of Jerry Lewis or Lucille Ball, and that the entire film is really a build up to that scene makes it forgivable. I watched it because mistaken/hidden identity stories are often funny... and I watch any and every movie with Jeffrey Jones.",
         "Kevin Franklin has a dream, but he's having trouble finding the fast lane to his first million. Borrowing from loan sharks to finance a new business, Kevin finds himself in debt to the Gasperini Brothers. Seizing an opportunity to escape, Kevin passes himself off as a prominent Baltimore dentist to an unsuspecting family, The Youngs, becoming their house-guest for a weekend....... Sinbad was never a big star here in the UK, the movie he will be remembered for here is Jingle All The Way, as the one who was annoying Schwarzenegger for the duration of the film. But as always in the US, the nineties always seemed to give popular TV stars a three picture deal, David Caruso was one, but he sank big time, despite some big films, and there was this guy, who was given some safer projects. And this is one of them, a film where the family are not getting along, a supposed family friend arrives,who is a little different from before, and before you can say 'it's a wonderful life' everyone loves each other, and the bad guys are given their just desserts. Sinbad is watchable, and the rest of the cast are stereotypical to this genre, but in the end, its harmless, slightly diverting stuff. And that would make a wonderful poster quote 'slightly diverting' Wonderfully endorsed by McDonalds...."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Hollywood Pictures",
         "Caravan Pictures"
      ],
      "summaries": [
         "Kevin Franklin is a con man whose mouth is bigger than him, but it doesn't help him much when he's in with the mob for $50,000. Trying to avoid a gambling addict boss, and his two stupid henchmen, Kevin poses as a childhood friend to Gary Young, a workaholic father whose own life is in turmoil in an affluent Pennsylvania suburb.",
         "Kevin Franklin (Sinbad) has a dream, but he's having trouble finding the on- ramp to the fast lane of his first million. Borrowing from loan sharks to finance a new business, Kevin finds himself in debt to the Gasperini Brothers. Seizing an opportunity to escape, Kevin passes himself off as a prominent Baltimore dentist to an unsuspecting Pittsburgh family, The Youngs, becoming their houseguest for a weekend. He has to shake the mobsters as well as make sure he does not blow his cover.",
         "In hot water with the mob over an unpaid debt, a con man poses as a family friend in an affluent Pennsylvania suburb."
      ],
      "budget": 10500000
   },
   "movielensId": 248,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "1995-01-06",
      "dvdReleaseDate": "2002-10-08",
      "directors": ["Randall Miller"],
      "runtime": 113,
      "movieId": 248,
      "title": "Houseguest",
      "mpaa": "PG",
      "actors": [
         "Sinbad",
         "Phil Hartman",
         "Jeffrey Jones",
         "Kim Greist",
         "Mason Adams",
         "Chauncey Leopardi",
         "Kim Murphy",
         "Tony Longo"
      ],
      "imdbMovieId": "0110066",
      "originalTitle": "Houseguest",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In hot water with the mob over an unpaid debt, a con man poses as a family friend in an affluent Pennsylvania suburb.",
      "tmdbMovieId": 17207,
      "avgRating": 3.01275,
      "releaseYear": "1995",
      "numRatings": 3255,
      "posterPath": "/hJ1t3dz51ZirOZVzse9LpmW5Mnw.jpg"
   }
}