{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "province",
            "id": 2065
         },
         {
            "name": "ladykiller",
            "id": 2336
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "bisexuality",
            "id": 3183
         },
         {
            "name": "menage a trois",
            "id": 3190
         },
         {
            "name": "young man seduces old man",
            "id": 7625
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0119773",
      "video": false,
      "title": "Dry Cleaning",
      "recommendations": [],
      "backdrop_path": "/1QbGPPMl8emAuZRZgcNoHVdyl5T.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nicole Kunstler",
               "gender": 1,
               "credit_id": "52fe4445c3a36847f808c467",
               "name": "Miou-Miou",
               "profile_path": "/oqTRzZm0h7KDTQEy5K4DSskaBrm.jpg",
               "id": 4274,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jean-Marie Kunstler",
               "gender": 2,
               "credit_id": "52fe4445c3a36847f808c46b",
               "name": "Charles Berling",
               "profile_path": "/5W9uDe33eFYFNOW5lqJVvlzHkzb.jpg",
               "id": 48576,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Loïc",
               "gender": 2,
               "credit_id": "52fe4445c3a36847f808c46f",
               "name": "Stanislas Merhar",
               "profile_path": "/xwCDqg9mCVqxfAwZqK6Npm4WiqD.jpg",
               "id": 37919,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Marilyn",
               "gender": 1,
               "credit_id": "52fe4445c3a36847f808c473",
               "name": "Mathilde Seigner",
               "profile_path": "/2aH71AKpo9qbkjOU1XQFv97r4Fj.jpg",
               "id": 48577,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Yvette",
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c477",
               "name": "Nanou Meister",
               "profile_path": null,
               "id": 48578,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Pierre",
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c47b",
               "name": "Noé Pflieger",
               "profile_path": null,
               "id": 48579,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Robert",
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c47f",
               "name": "Michel Bompoil",
               "profile_path": "/5jHItiaE41smKtuIyPfZiSlRKxa.jpg",
               "id": 19383,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Steve",
               "gender": 2,
               "credit_id": "52fe4445c3a36847f808c483",
               "name": "Christopher King",
               "profile_path": null,
               "id": 48580,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Bertrand",
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c487",
               "name": "Gérard Blanc",
               "profile_path": null,
               "id": 48581,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mme Bertrand",
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c48b",
               "name": "Betty Petristy",
               "profile_path": null,
               "id": 48582,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4445c3a36847f808c491",
               "name": "Anne Fontaine",
               "profile_path": "/wtl2OPo3IydskWY3cMXInBba1w.jpg",
               "id": 48583,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c497",
               "name": "Gilles Taurand",
               "profile_path": null,
               "id": 50538,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4445c3a36847f808c49d",
               "name": "Anne Fontaine",
               "profile_path": "/wtl2OPo3IydskWY3cMXInBba1w.jpg",
               "id": 48583,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4445c3a36847f808c4a3",
               "name": "Philippe Carcassonne",
               "profile_path": null,
               "id": 50516,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4445c3a36847f808c4a9",
               "name": "Caroline Champetier",
               "profile_path": "/tkHJncN5hO0RXkWGKDSoek67fng.jpg",
               "id": 50539,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4445c3a36847f808c4af",
               "name": "Luc Barnier",
               "profile_path": null,
               "id": 23397,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.936571,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 6187,
      "vote_count": 6,
      "budget": 0,
      "overview": "A bored couple takes in a young man who turns their lives inside out",
      "similar": [
         2255,
         3134,
         112160,
         43923,
         297762,
         617,
         859,
         27586,
         2771,
         11236,
         314385,
         1919,
         1631,
         197082,
         26890,
         1382,
         340487,
         248774,
         326359,
         9787
      ],
      "original_title": "Nettoyage à sec",
      "runtime": 97,
      "poster_path": "/37TQCdHs8QeDkNuNqHXaQtxtJQs.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1997-09-24",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anne Fontaine"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Anne Fontaine",
         "Gilles Taurand"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0119773/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNjg5MDg5MV5BMl5BanBnXkFtZTYwNTU4NTk4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Miou-Miou, Charles Berling, Stanislas Merhar | See full cast and crew »"],
      "reviews": [
         "Nettoyage a sec (Dry Cleaning) : a good choice of film title for starters. The initial image created by such a title is one of cleanliness, order and routine. In light of the closing scene though, a double-entendre can be detected : Nicole and Jean-Marie will certainly have their work cut out for them cleaning blood from their clothes and from their hands ... The well-paced plot allows for good character development, and Berhing, Miou-Miou and Merhar do it fantastically. The middle-aged couple, who have reached a stagnated period in their relationship, seek new direction. Nicole is bored and uninspired, she wants a change from the monotony of running the shop. Jean-Marie is \"a very uptight man\" according to Marilyn, Loic's sister. His homosexual awakening is a great personal struggle for him, his self-doubt beginning in the hotel scene when Loic is so rude to him. The couple's major flaw is an inability for their own introspection and thus for the damage they can cause. The repercussions of their ignorance become dangerous because they allow themselves \"to be driven, not necessarily by a fault of their own, to a point of no return\" (-Anne Fontaine, director). From the moment that Loic and Marilyn meet Nicole and Jean-Marie, they take full advantage of the latter's uncertainty, both materially and sexually. Loic is not an evil spirit who planned all along to sew disorder. He is an intuitive and laid-back character whose pitiful situation - no family background and therefore no direction in his life - lead him to great negativity, and on the surface he presents a cold and uncaring personality. He is independent and self-centred because, apart from his sister, whom he protects aggressively, he has never had to look after anyone but himself. In terms of the film's characterisation, the only real fault i noticed was an absence of relationship between Nicole and her son Pierre. They share only one affectionate exchange throughout the whole film; the boy's role has little (if any) importance at all. The final shot of the film : having disposed of Loic in the laundry shoot, we see the couple walking together into the dusk. For the first time, Jean-Marie has an apparent expression of liberation on his face. If their relationship with Loic has brought them closer as a couple, we could conclude that their uncontrolled downward slide into such a dark, frightening world was not altogether futile.",
         "This story of a French couple, middle class business people leading a life that they only find boring when they encounter a young, free spirited and unisexual man, takes some weird turns but does it with excellent performances and direction. Though the ending was a bit abrupt, as well as shocking, getting there was the fun - well, pleasure, maybe. The young man has an affair with the woman, and is clearly drawn toward the man as while. The husband's reaction is the key to the drama, and the actor's subtle signs of being tempted, against his nature and resisting all the way , are truly fine acting. The whole cast is excellent, and the sensual , open tone of the movie, mixing the fairly straight-laced couple, their young child, middle class friends and family, and the worldly young man and depicting them, ultimately, as not really all that different, is almost comforting...until that ending, which came rather fast and furious after a more slow moving development, shattering the mood. Still, this is a really fine job of direction, and development of characters who all seem far more common than we would think if merely being told about them.",
         "In a small town in France, Nicole Kunstler (Miou-Miou) and her husband Jean-Marie Kunstler is a traditional French middle-class couple, bored with their years of marriage and running a small business of cleaning and ironing clothes with some financial difficulties. When they meet the bisexual Loic (Stanislas Merhar) working as drag in a night-club with his sister Marylin (Mathilde Seigner), the sexually dissatisfied Nicole feels a great sexual attraction for him. The couple brings the young man to live and work with them, in a weird relationship, and Nicole has an affair with Loic and becomes a happy person. This intriguing triangle of love has a tragic end. \"Nettoyage à Sec\" is almost an excellent romance. The screenplay begins very daring, but the solution for the love situation is very moralist and resolved in a tragic, but easy way. The cast has a great performance and the direction is very good, but the story deserved a better conclusion. My vote is seven. Title (Brazil): \"Lavagem a Seco\" (\"Dry Cleaning\")",
         "It's a cinematic tradition: the handsome young man who insinuates himself into a household of boring bourgeois types and stirs things up. Terence Stamp did it in Teorema, Robert Forster in Reflections in a Golden Eye, Peter McEnery in Entertaining Mr. Sloane, Will Smith in Six Degrees of Separation. Here, the young man is a bisexual who quickly wins the heart of a frustrated Miou-Miou and disturbs the dull, penny-pinching boss of a dry cleaners, Berling. The script and direction by Anne Fontaine are assured, but the ending may leave some viewers perplexed (it did me), as it seems to come out of nowhere. Stanislas Merhar deserved the Most Promising Actor Cesar that he won as the pretty boy; you can readily see why the wife can't get enough of his caresses. Charles Berling often plays men who suffer in silence; he has a wonderful way of tightening his mouth that speaks volumes, and here he's very good as the husband.",
         "The mellow, mesmerising tune of the theme music by Edouard Dubois made me watch this movie twice while on a transcontinental flight. The music was only one reason among others that made me watch the film twice in four hours. I am a French film enthusiast and the contents of the film (latent homosexuality, guilt, cross dressing, etc.)were not out of the ordinary. What was striking in the film was the deliberate, structured screenplay that made me recall early works of Marcel Carne. I was not surprised to learn that the screenplay won an award at the prestigious Venice Film Festival and nominated for a Cesar in France. The film's beginning and end revolve around affirmation of marital bonds, while the bulk of the film (to me only the sub-plot) ventures into transgression of those bonds followed by redemption. There is sadness at the end but it also accompanied by a silent studied reaffirmation of faith between man and wife. The final walk of the duo is an ordinary event yet captured powerfully in this film. I recommend this film to those who have not seen it not as a film that is extraordinary, but one which encourages viewers to introspect and look at ordinary lives, not of superheroes but of less than perfect men and women. The film succeeds because of low-keyed acting (Merhar and Miou-Miou), the sombre yet mesmerising music and good mise-en-scene. The film discusses \"drycleaning\" of two individuals' marital life, but the script and the director elevate the wife as strong personality with a level-headed strength developed quite unobtrusively as the film progresses. Anne Fontaine, the director, is someone to watch out for in the future as is Edouard Dubois. In more ways than one (direction, cinematography, the script) the film gives a woman's perspective of the story, though a wee bit sombre.",
         "Spoilers... \"Dry cleaning\", that's what the title of this Anne Fontaine's effort means in English and it's a well-appropriated one to qualify the contents of the story she tells the audience. Its bulk essentially occurs in a dry-cleaner whose purpose is to clean the customers' clothes but the director prefers to soil her couple's clear conscience as well as their moral, sexual conventions. Could this film be a crossing between Claude Chabrol's universe and Pier Paolo Pasolini's film \"Theorema\" (1968)? It's highly possible and they're respectable credentials for this novel, idiosyncratic film. The first one for the provincial backdrop and a dash of gastronomy. The author of \"le Boucher\" (1970) and \"les Noces Rouges\" (1973) excelled when it came to depict vignettes of provincial life, in the Kunstler's shop and apartment but also in the town itself. Anne Fontaine just has to describe with just a few features, the gloomy aura which reigns in Belfort. And the second reference for of course the story of the film which bears a strong resemblance with Pasolini's opus: both introduced a young man who subverted a comfortable universe and caused damage in them. \"Nettoyage à Sec\" could be an updated version of \"Theorema\". Loïc is the disruptive element in the Kunstler's \"petit bourgeois\" world. More than this, he's the catalyst of their buried desires and passions. Before making their dreary universe with its constricting etiquette falter in the dry-cleaner's, he will at first indirectly galvanize them to accomplish their desires. The week-end in Bâle, unusual in the couple' life is a proof of it. Before this, one of the key sequences is the one when the four protagonists are together in the hotel room because in this moment, the persona of Jean Marie and especially Nicole is well construed and defined. It's necessary to steer well the evolution and crucial steps of the story. Nicole makes love with Loïc and it's a sign that she's tired of her life and is ready to go in a new direction. Later, Fontaine will intersperse her film with conspicuous signs which don't fool anyone. See the scene in the restaurant: she confesses to her husband that she doesn't feel courageous enough to carry on her nine-to-five life in the dry-cleaner's. She's on the verge of packing in. Jean-Marie's answer is meaningful: \"however when we started, you wanted to be the first one to help me to settle here...\". So, it seems perfectly logical that later she accepts Loïc's advances. As for Jean-Marie, he appears hesitant and undetermined but maybe would he like (unconsciously or not) change his life in spite of an eloquent sequence: when he takes Loïc downstairs to show him concrete memories of his first years spent in the shop. Memories to which he is deeply attached... Loïc's demeanor is rather elusive and it's hard to decipher his mainspring. Is it because he lost his closest human being in the world (Marilyn) that he settles to Nicole and Jean-Marie? Is he sick of his nomad life despite what he says to the couple? By enticing the couple, does he try to fulfill an affective gap in his life? It was shrewd from Fontaine to make opaque his motivations. Thus, he keeps all his mystery. It was also clever from the director to have chosen evocative colors for her film and she's got a sense of light. The white of the dry-cleaner's sharply contrasts with the half-murky, dimly light rooms in the apartment, especially when Loïc is in these rooms. This to underscore that the life of the couple with Loïc's intrusion goes bit by bit unravel. She also has the gift to build her film on a relentless crescendo and to shroud it with an increasingly latent, ominous tension. A tension caused by several factors: disquieting moments or lines pronounced by Loïc, by the contrast between the appearance the couple gives to the customers and employees and what lies beneath this when they are in the apartment with Loïc, especially when the latter finds himself with Nicole. And it won't take long for Jean Marie to discover their love affair. But also with Jean-Marie's tantrums he has to try to resist to the strange attraction he feels for Loïc. His short wild mood swings are the result of a sexual repression he vainly wants to conceal. Loïc will feel it very well in the inevitable sequence in which he will try to sodomize him (a violent one which packs a real wallop). After this scene, one could argue that the couple came back to where they started but in worse: Nicole and Jean-Marie are destroyed. The acting is uniformly good and largely lives up to the demands of the scenario. The type of character of each actor of the quartet complements one another. Although the film really put Mathilde Seigner on the map, it's her coy, brazen partner Stanislas Mehrer who gets the lion's share. I don't put Charles Berling and Miou-Miou in my straitjacket of favorite French actors but here, I was very taken with their acting. \"Nettoyage à Sec\" has a taut, well-constructed scenario in which every step of the story rings true. It's an unsettling piece of work which leaves indelible stains. It may also walk a fine line with works like \"Harry: Un Ami Qui Vous Veut Du Bien\" (2000) by Dominik Moll which could be his little brother. I would like to discover Anne Fontaine's anterior and subsequent works to her 1997 film.",
         "Sad, melancholic, nostalgic and soft. A film about illusions and impossibility of escape. Description of failure and ambiguous expectation. French flavor and marks from Pasolini, empty universes and slices of love, game without innocence and failure of dreams. A world, a small world where the work is only real refuge. Where the memories or the projects are shadows of a lost time and a bovaric certitude. Delicate and tender, subtle and innocent, this film is a pledge for discover the sense of existence. The image of war with the other or with yourself, the fear like basic answer to the movement of time, the questions like skin of interior fog, the presence of temptation in the person of an androgynous teenager, the looks, deceptions or infidelity are elements of ordinary life. For everyone, \"The Queens of Night\" are key to a second chance, to a form of happiness. But always, the happiness is puzzle of illusions and the old rules are more strong that any form of seduction. In final, the corpse of a gorgeous dream like only \"souvenir\" of a perverse form of normality.",
         "To me, a romantically inclined gay man, this was a fascinating but ultimately unfulfilling tale of a `normal' French couple, Nicole and Jean-Marie Kunstler, who have grown unsatisfied with their settled, routine lives. The couple runs a dry cleaning business in an unexciting small French town. Their lives change when they go to a bar with some business associates and encounter Loïc and Marylin, a cross dressing brother/sister act. From the first, the couple is fascinated with the pair but particularly with Loïc, the sexually ambiguous brother, (played to perfection by Stanislas Merhar). The couple is so enchanted with the pair that they take a weekend to the city where the performers are appearing next. When the sister decides to end the act and run away with her lover, the brother insinuates himself into the couples lives. The young man claims to be, and is by all indications, straight and soon takes the wife as a lover. The husband is also aroused by the boy but denies his attraction. Soon the boy is living in the couple's home and working in the Dry Cleaning shop and is showing a talent for that type of work. He even befriends the couple's child and helps him with homework and takes him skating. Whether his good work arises from Loïc's desire to repay Jean-Marie or from some innate talent for dry cleaning is unclear. I think that Loïc feels guilty about cuckolding this man who has shown him nothing but kindness, genuinely likes the guy, and is aware of the man's attraction to him. He wants to make amends in any way that he can. Ultimately Loïc offers himself to Jean-Marie physically but is rebuffed. Whether it's the husband's `homosexual panic' or his actually seeing his wife with Loïc during one of their trysts, Jean-Marie decides that Loïc must go. This leads to the final and I think dissatisfying concluding scenes.",
         "Saw a humongously uninspired French movie, Dry Cleaning (Nettoyage a Sec), that the advertisers swear won Cesar awards all over the place, but is just a hodgepodge of every foreign movie cliche that might strike an upscale audience as profound: a sexually ambiguous stranger insinuates himself into the lives of a married couple, engaging them in sexual games that bring them to the brink of self-destruction. She's desolate without the young man; the husband wrestles with his denial that he's also turned on by the stranger. Of course this is \"art theatre,\" so we are to suppose that every straight man is really a gay man who hasn't found out yet. On the other hand the homosexual aspect of the story becomes the vehicle that carries the husband into his own corner of hell, an idea that seemed arty thirty-odd years ago (The Sergeant; The Children's Hour) but now is just insulting to gays. And of course the story is dotted with major and minor sexual interludes and taunts, but relationships are left to angry, dissatisfying silences between not-particularly-interesting characters. Story elements are offered that suggest the plot could go somewhere else but instead lead nowhere (the young man's sister leaves and conceivably might return looking for him; the young man has genuine talent as a dry-cleaner and might make a life for himself beyond his \"drifter\" existence; the married couple thinks about moving to Canada). I think the filmmaker has a long way to go in justifying why he wanted to make this movie -- what he thought would make this film extraordinary compared to some other story about dissolving marriage or sexual curiosity. Imagine La Strada if Anthony Quinn just sat around and brooded. If Thomas Mann had written Dry Cleaning it would be called Death in Suburbia: except that, speaking strictly for myself, I think it's the audience that dies.",
         "An interesting and somewhat mysterious tale of a middle aged couple who grow disillusioned with their dry cleaning business and find outlet with a cross dressing brother-sister-lover couple of performers. Their mutual obsession naturally leads to the demise of their relationships, businesses and ultimately their lives. The script is a bit dry, and lacks the punch that the subject matter is capable of delivering. Near the final act it tries to catch up as the homosexual attraction between the young man and the older husband comes zooming out of nowhere. A good editor would've suggested they drop some kind of hint earlier on. The abrupt and troubling ending leaves you satisfied."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cinéa",
         "Les Films Alain Sarde",
         "Maestranza Films"
      ],
      "summaries": [
         "Nicole and Jean-Marie Kunstler are a nice, hard working couple who have been married for 15 years. They operate a dry cleaning business that keeps them both too busy to take a vacation, or to change their routine. A fateful trip to a drag club leads them to encounter Loic and Marilyn, a brother-sister drag queen performing team. Their shows fascinate the couple, as both Nicole and Jean-Marie find themselves growing more and more attached to Loic. Loic brings to the surface all of their suppressed desires and emotions - willingly and unwillingly. A psychological examination into the effects one attractive young man's entrance into the lives of an ordinarily seeming couple could have.",
         "In a provincial town, not very far from the train station, not too far away from the big city of Paris, exists a night club where small town tastes are challenged by sexually ambiguous performers who tease and agitate conservative thinkers. One evening, a group of friends, all of whom are merchants with stores on the same block venture into the netherworld of a nightclub known as \"La nuit des Temps\", where a brother and sister perform a provocative strip-tease drag number that hypnotizes Jean-Marie and his wife Nicole who run a dry cleaning shop in the town. After fifteen years of love and faithfulness, working at the dry cleaning has cemented their relationship into a routine, but consistent lifestyle. They are slaves dedicated to eliminating the minute stains on the community's clothing. Never a day of rest, never a vacation for this beleaguered couple. Then one day the brother of the strip tease act stumbles into the dry cleaners to remove a stain from his dress. Now, Nicole and Jean-Marie begin a new life, dry cleaning during the day and spinning out of control at night. At first, they let themselves be taken in by the excitement of the game, which later has dire consequences for the couple's sanity. The strong excitement of a new sexual partner ignites feelings in both Nicole and Jean - Marie and makes them see themselves in ways they cannot understand.",
         "A bored couple takes in a young man who turns their lives inside out"
      ],
      "budget": 0
   },
   "movielensId": 2480,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1997-09-24",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Anne Fontaine"],
      "runtime": 97,
      "movieId": 2480,
      "title": "Dry Cleaning",
      "mpaa": "",
      "actors": [
         "Miou-Miou",
         "Charles Berling",
         "Stanislas Merhar",
         "Mathilde Seigner",
         "Nanou Meister",
         "Noé Pflieger",
         "Michel Bompoil",
         "Christopher King",
         "Gérard Blanc",
         "Betty Petristy"
      ],
      "imdbMovieId": "0119773",
      "originalTitle": "Nettoyage à sec",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["G72Kbdkwx_M"],
      "plotSummary": "A bored couple takes in a young man who turns their lives inside out",
      "tmdbMovieId": 6187,
      "avgRating": 2.95,
      "releaseYear": "1997",
      "numRatings": 40,
      "posterPath": "/37TQCdHs8QeDkNuNqHXaQtxtJQs.jpg"
   }
}