{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "glasgow",
            "id": 892
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "american football coach",
            "id": 5621
         },
         {
            "name": "professional soccer player",
            "id": 8130
         },
         {
            "name": "debt",
            "id": 11061
         },
         {
            "name": "soccer",
            "id": 13042
         }
      ],
      "imdb_id": "tt0151691",
      "video": false,
      "title": "My Name Is Joe",
      "recommendations": [
         37691,
         48709,
         198537,
         157974,
         1404,
         31344,
         78504,
         47715,
         241432,
         59231,
         49980,
         59058,
         35030,
         110771,
         102514,
         4702,
         105584,
         107035,
         169780,
         117478
      ],
      "backdrop_path": "/lSs2ABl1GsN3vzatKOojusQl3S5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Joe",
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfd9",
               "name": "Peter Mullan",
               "profile_path": "/g344UcfsoYtz3Lt148mDtuQ9CQ0.jpg",
               "id": 3064,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sarah",
               "gender": 1,
               "credit_id": "52fe4493c3a36847f809dfdd",
               "name": "Louise Goodall",
               "profile_path": null,
               "id": 21978,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Liam",
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfe1",
               "name": "David McKay",
               "profile_path": null,
               "id": 16908,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "McGowan",
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfe5",
               "name": "David Hayman",
               "profile_path": "/tXhC9zlniU4SYpjOcMKxDIHdQBB.jpg",
               "id": 54014,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Shanks",
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfe9",
               "name": "Gary Lewis",
               "profile_path": "/3pfclDPaKmgSpmxIo8bMXNAgLdE.jpg",
               "id": 480,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Maggie",
               "gender": 0,
               "credit_id": "52fe4493c3a36847f809dfed",
               "name": "Lorraine McIntosh",
               "profile_path": "/gRIf21kW7oZnyHZyNcEZnmGTUBG.jpg",
               "id": 1839,
               "order": 5
            },
            {
               "cast_id": 20,
               "character": "Mojo",
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809e009",
               "name": "Stephen McCole",
               "profile_path": "/lS0Em0b2kaEJ5hXIYMU10iN9Fdf.jpg",
               "id": 71770,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfcf",
               "name": "Ken Loach",
               "profile_path": "/vGtkrPgNeK3xkbbKTQ4vWD1VsEm.jpg",
               "id": 15488,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfd5",
               "name": "Paul Laverty",
               "profile_path": null,
               "id": 15490,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4493c3a36847f809dff3",
               "name": "Rebecca O'Brien",
               "profile_path": null,
               "id": 15491,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dff9",
               "name": "George Fenton",
               "profile_path": "/23V03rGdkvNgeiBwLodJzNKdhJC.jpg",
               "id": 1528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809dfff",
               "name": "Barry Ackroyd",
               "profile_path": "/mpdR2TB4gS5E3qzSuQ9p6eMxgYD.jpg",
               "id": 15493,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4493c3a36847f809e005",
               "name": "Jonathan Morris",
               "profile_path": null,
               "id": 15495,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.232422,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 8129,
      "vote_count": 37,
      "budget": 0,
      "overview": "Two thirtysomethings, unemployed former alcoholic Joe and community health worker Sarah, start a romantic relationship in the one of the toughest Glasgow neighbourhoods.",
      "similar": [
         21641,
         1611,
         457917,
         12229,
         382475,
         19087,
         25432,
         302324,
         203574,
         1881,
         8344,
         8421,
         8908,
         53818,
         5286,
         218837,
         289229,
         255714,
         203568,
         168771
      ],
      "original_title": "My Name Is Joe",
      "runtime": 105,
      "poster_path": "/2sVJSEZRczNiz9YIbnE5OVIkaHo.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Westdeutscher Rundfunk (WDR)",
            "id": 7025,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alta Films",
            "id": 8369,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arte",
            "id": 201,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Degeto Film",
            "id": 986,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Diaphana Films",
            "id": 744,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Parallax Pictures",
            "id": 983,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Road Movies Vierte Produktionen",
            "id": 27013,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Scottish Arts Council Lottery Fund",
            "id": 27014,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "The Glasgow Film Fund",
            "id": 980,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Tornasol Films",
            "id": 7680,
            "origin_country": ""
         }
      ],
      "release_date": "1998-05-15",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Ken Loach"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Paul Laverty"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0151691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyODAzNjM3OF5BMl5BanBnXkFtZTcwMjMxODI5MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Mullan, Louise Goodall, Gary Lewis | See full cast and crew »"],
      "reviews": [
         "Ken Loach has been making films about working class families for many years and My Name is Joe is one of his most powerful. Peter Mullan is instantly likable as Joe Kavanagh, a recovering alcoholic from Ruchill, a decaying suburb of Glasgow, who has a lot at stake. He has fallen in love with Sarah (Louis Goodall), a health worker, and wants to go straight but circumstances conspire against him. He is determined to help his friend Liam (David McKay) when he gets behind on his payments to a drug dealer but his options are limited and he is forced to make a choice that threatens the stability of his fragile relationship. Mullan won the Best Actor award at the 1998 Cannes Film Festival and it is fully deserved. We know that Joe's problems are overwhelming but we root for him to make it in spite of the odds because of his warmth and humor and generosity towards others. Joe has been sober for a year and attends sessions of Alcoholics Anonymous. He also coaches the local soccer team composed of unemployed workers who have won only one game the entire year. When he meets Sarah, a social worker for the Health Department who is visiting Liam and his wife Sabine (Anne-Marie Kennedy) and young child, things start to look up. We do not learn much about Sarah's past but it is obvious that the two have discovered each other at a crucial point in their life. In a powerful scene, Sarah asks Joe why he stopped drinking and he tells her how he had beaten a woman he was dating and has never forgiven himself. Both are very tentative about getting involved but they are also drawn to each other and can think about the future for the first time. Sadly, the world has other plans. Sabine is a heroin addict who used the drugs she was supposed to sell and is in serious debt to a local drug dealer McGowan (David Hayman), an old friend of Joe's. When the mobster boss demands that Liam cover his wife's debt or they will break his legs, Joe tries to moderate and ends up striking a deal with the mob, leading to a series of unfortunate events. In one of the most emotionally gripping scenes, Sarah berates Joe for lying to her and he responds \"Some of us don't have a choice. Some of us don't have a f***ing choice.\" The mean streets of Ruchill are strewn with the results of urban decay and Loach does not spare us the details. He even mocks the image of bonnie Scotland with a scene involving a kilt-clad bagpiper playing the same three songs over and over for a group of tourists. Combining gritty realism with humor, My Name is Joe has an outstanding script by Paul Laverty and fully dimensional characters that transcend clichés. Loach does not pass judgment on his characters or directly condemn society for their failings. It is a work of compassion and humanity.",
         "The awesome realism of \"Once Were Warriors\" (New Zealand, 1994), successfully transposed to Glasgow, Scotland. Solid, decent human beings use alcohol and drugs to \"cope\" with life. But, life only gets worse, loyalties are brutally tested, and one poor unfortunate will not survive. But, don't think this to be another flaccid piece of cliched, anti-drug drivel. No, this film speaks powerfully to the perverse, and often vicious, arbitrariness of life. Darwinians, of course, will be unmoved. The rest of us, however, will be chilled by the scale of our impotence in making this world a better place. Prepare yourself to feel humbled.",
         "In Glasgow, Joe Kavanagh (Peter Mullan, in a superb performance) is an ex-alcoholic and unemployed simple, but good man. He is the couch of a soccer team, formed by poor players. Joe meets Sarah Downie (Louise Goodall), a community health worker and they start a romance. Liam (David McKay) is a player in Joe's team and ex-addicted in drugs. He has a beautiful son, but his wife Sabine (Anne-Marie Kennedy) is still using drugs and raises a huge debt together with the local drug dealer McGowan (David Hayman). Joe becomes aware of the problem and McGowan offers four options: the debt of 2.000 pounds be paid, Sabine becomes a prostitute, Liam becomes a drug dealer or Joe makes two delivers of drugs for him. Joe accepts the last option, jeopardizing the love of Sarah for him. This very touching low budget movie is an authentic lesson to Hollywood personnel of `How to make an excellent movie having an outstanding director, a wonderful screenplay and marvelous cast'. The story is simple, very credible and with no concessions. The focus is part of the Scottish population that lives in poverty conditions and without many options in life, and it is painful. The end of the story will break the heart of the viewer: it is impossible not to be with wet eyes. The soundtrack suits perfectly to this film. My vote is nine.",
         "Believe me as soon this movie has ended it will be damned difficult not to reach for your handkerchief and not to dry your eyes as this movie really touches you, and director Ken Loach doesn't even need no Titanic-script as according to his style he just picks out some stories of life. We are in Glasgow, Scotland at where we meet Joe (Peter Mullan), an ex-alcoholic who is on the dole and whose sole surviving point is the footballteam (that always loose) he manages. It's more friendship then football but out of a sudden he meets a nurse Sarah (Louise Goodall) and he falls in love. For Sarah it is quite difficult, she loves him but she can't get used to the world Joe lives in, a world that is dominated by poverty. Everything goes badly wrong when Joe decides to help one of his footballplayers Liam (David McKay) who is a junk and who is in the hands of the mob that are awaiting 2000 pounds from him. Little by little Joe is witnessing that he looses everything that he build up the day he said the bottle farewell. This is not Loach's most known film (I guess that is Raining Stones) but this movie really had its impact on the festival of Cannes and it made a sort of indiestar from actor Peter Mullan who recently made his debut as director making \"The Magdalene Sisters\". Along with Mike Leigh is Loach one of the best British directors ever, a film you absolutely must see!!!!",
         "Joe (Peter Mullan) is a guy who has seen it all before. A former alcoholic, he kicked his habit. Now he is unemployed but is paradoxically very active since he trains a little football team and interests himself in young Liam who has a brush with the local underground for a story of unpaid drugs with his young spouse Sabine. He falls in love with Sarah, a social worker who brings them help and support. The two people fall in love whereas to help Liam, Joe is ready to break the law and to do shady jobs for the mobsters. Will his relationship with Sarah be affected by this? When he places his camera in the popular neighborhoods of a big city eaten away by unemployment, Ken Loach is the defender of the outcasts who are very strongly linked by friendship and mutual support, like Joe here with his tiny football team. Loach refuses to feel pity for them and shots the outset of his film with energy and generosity. Where he also grabs the audience and impresses her is his master at supple cinematographic writing. \"My Name is Joe\" starts up first time with a humorist perspective that the filmmaker will try to keep to the maximum. You have to see Joe and his sidekick who pretend to be professional house painters to Sarah's. Then, as Liam and Sabine's trouble grow and with Joe's decision to help them, the tone becomes darker, blacker and is here to remind us that we are in Loach's universe. His characters in spite of their big efforts are caught up in a sad fate. In the end, Loach runs the whole gamut of tones with ability in a quite gloomy plot. The arresting performance of Peter Mullan helps to make Loach's 1998 film more appealing and it's one to discover or rediscover.",
         "Ken Loach is a truly exceptional film-maker. Like Bunuel, he has seemingly risen from the dead (during Thatcher's reign) and re-emerged as an international force. I found his latest film \"My name is Joe\" to be a hugely enjoyable affair, perhaps a little less abrasive and direct than his earlier efforts, like \"Poor cow\" and \"Family life\". Even so, he depicts \"working class\"- people with the same warmth and insight as before. The main character is Joe, a jobless reformed alcoholic in Glasgow with a heart of gold. In the attempt to better the lot of those around him, (and forget his self-loathing) Joe organizes a football team and makes house-calls on those in need of support, especially Liam and Sabine, a young couple in dire straits. Liam owes 500 pounds to the local drug-dealer, and Sabine has likewise racked up a debt. Joe tries his best to offer help, but when he is forced to perform a criminal act, he runs the risk of losing his law-abiding girl-friend into the bargain. Joe is a character whom you instantly like. Even his transgressions won't make you think the worse of him, as he quite obviously suffers from what he's done. Joe wants to lead a \"normal\" life, stay on the right side of the law, get a girlfriend and what have you. But he just can't juggle off his past as a drunkard, he can't get off the dole and so hasn't the means to move away from his run-down apartment, his rotten little suburb. His only hope is to get someone to love him, someone to lift him out of the rut, to boost his self-esteem. It is, for sure, a touching, humane story, beautifully scripted, shot in a simple style, and with a wonderful central performance by Peter Mullan. My question is, is it more? Is MNIJ a valid comment on deprived communities in Britain today? Do there still exist working class ethics like the ones Loach depicts in this movie? And are they still as relevant as when Britain was poor back in the 60' ies, the decade of Loach's first movies? Granted, there are still poor, neglected people aplenty, but do they behave like this? This movie seems a little on the soft side compared to say Gillian MacKinnon's \"Small faces\", and even \"Trainspotting\". \"MNIJ, I feel, is more of a self-contained Chekhovian drama than an attack on our bourgeois sensibilities. (The soundtrack, by the way, consists mostly of dangerously out-dated glam-rock material from the 70' ies. Painful stuff!) Call me flippant, but I didn't feel like hitting a drug dealer, or tearing the social fabric after watching this movie. Perhaps it should have hurt more. Even so, it's a fabulous film by a unique director.",
         "A review of this film in the Telegraph asks, \"Why do people go to see Ken Loach films?\" I would suggest that people go to see Ken Loach films because they're interested in society, interested in how people live, and keen to see films about REAL people i.e. people who aren't rich and beautiful and don't live in charming pieds a terre in Chelsea ... My Name is Joe is at the same time heartwarming and heartbreaking, making you feel good about the characters whilst thanking your lucky stars that you don't live the lives they do. Go and see it with an open mind and a thirst for realism.",
         "First this movie seems to be much lighter than previous Loach realisations (remember LadyBird, LadyBird ?). Joe is a hell of a good guy and the other characters are as true as possible. And it is truly funny (the football matches of the \"German\" team are hilarious). But then, like in many of the best Loach movies, the social reality, with all its dramatic aspects, turns the end of the movie into a real tragedy. A must, in my opinion.",
         "I finally got the DVD today in the mail, so I could watch this film. Now I'm from the Netherlands and my English is pretty good, but my Scottisch is not so good (thank god for the subtitles lol). But, I did get the general message, which is pretty global. What Joe is dealing with, trying to stay sober and creating a good life for himself and his \"family\". Its very recognizable. The acting was brilliant, and very very honest and realistic. There just aren't enough films like these. One's with REAL stories to tell, real life stories. What is so wrong with watching reality? Normal life is hard enough, and its OK to show that. We don't always have to see all the glitter and glamour of Hollywood. People go see this film, if I had ten thumbs, I would give him ten thumbs UP. Thank you Mr. Mullan and all the others working on this film for this beautiful honest film.",
         "\"My Name is Joe\" is a film in which the complexities of social issues are explored to reveal unpalatable truths. It seems some people can find themselves in situations in which all their choices are wrong ones! This film pulls no punches and is totally believable. Perceptively cast this is a film full of poignancy and depth. \"My Name is Joe\" is Ken Loach at his very best."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Alta Films",
         "Arte",
         "Channel Four Films"
      ],
      "summaries": ["Two thirtysomethings, unemployed former alcoholic Joe and community health worker Sarah, start a romantic relationship in the one of the toughest Glasgow neighbourhoods."],
      "budget": 0
   },
   "movielensId": 2481,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-15",
      "dvdReleaseDate": null,
      "directors": ["Ken Loach"],
      "runtime": 105,
      "movieId": 2481,
      "title": "My Name Is Joe",
      "mpaa": "",
      "actors": [
         "Peter Mullan",
         "Louise Goodall",
         "David McKay",
         "David Hayman",
         "Gary Lewis",
         "Lorraine McIntosh",
         "Stephen McCole"
      ],
      "imdbMovieId": "0151691",
      "originalTitle": "My Name Is Joe",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Vog33PwornI"],
      "plotSummary": "Two thirtysomethings, unemployed former alcoholic Joe and community health worker Sarah, start a romantic relationship in the one of the toughest Glasgow neighbourhoods.",
      "tmdbMovieId": 8129,
      "avgRating": 3.62845,
      "releaseYear": "1998",
      "numRatings": 471,
      "posterPath": "/2sVJSEZRczNiz9YIbnE5OVIkaHo.jpg"
   }
}