{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120095",
      "video": false,
      "title": "Tinseltown",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": []
      },
      "genres": [],
      "popularity": 0.072146,
      "production_countries": [],
      "id": 296543,
      "vote_count": 1,
      "budget": 0,
      "overview": "In Hollywood it's all about who you know, and the only person two friends know is a serial killer.",
      "similar": [],
      "original_title": "Tinseltown",
      "runtime": null,
      "poster_path": null,
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-01-01",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tony Spiridakis"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Tony Spiridakis",
         "Shem Bitterman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120095/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMjU0MzYwN15BMl5BanBnXkFtZTcwMzU5MTgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Arye Gross, Joe Pantoliano, Ron Perlman | See full cast and crew »"],
      "reviews": [
         "This very dark comedy is an audacious failure. Some of its movie references are clever, Ron Perlman has a blast with his role as a mock serial killer and Joe Pantoliano is extremely well-cast as a sleazy, penniless \"producer\". But when all is said and done, it's hard to determine why exactly the picture was made or what it was trying to say (apart, of course, from the obvious \"filmmakers are willing to sell their souls for a box-office hit\", which we knew already). Still, \"Tinseltown\" IS recommended to fans of the offbeat; the last 10 minutes in particular come as quite a surprising change of tone. (**)",
         "A broke would be screenwriter and his would be agent (Tom Wood and Arye Gross) are forced to live in a self storage facility run by an eccentric and intimidating manager (Ron Perlman) whom they come to believe is the serial murderer that is terrorizing the city, the \"Costume Killer\" (so named because, after injecting his victims with Windex, he dresses them in silly costumes). They convince him his life story would make a great film and gather together a group of misfit wannabe film makers (John Considine, Joe Pantoliano, Kristy Swanson) and discover that the art of movie making can be murder. There is more to this movie but it was unfortunately left on the editing room floor and it shows (rumor is the studio wanted a \"lighter\" dark comedy). Our loss (and the actors, who all do fine jobs and deserve better) as this has the makings of an exceptional black comedy but only rises to mediocre cute. If you're a Ron Perlman fan this is absolutely worth getting just for his performance. His comedic timing is excellent and he has the chance to do some really great impressions (he wasn't kidding when he said on the Hellboy movie commentary that he needed an intervention when he gets into Jerry Lewis mode). He's just simply fun to watch in this one. David Dukes also shines in a two-scener (but pivotal) role.",
         "The first 30 minutes of Tinseltown had my finger teetering on the remote, poised to flick around to watch something else. The premise of two writers, down on their luck, living in a self-storage-space \"bin\" was mildly amusing, but, painfully bland. The introduction of the character, played by Joe Pantoliano - the big deal movie guy, that lives in the park and sleeps in a lavatory, offered hope and I decided to give it a few more minutes. And then a few more until Kristy Swansons introduction as a budding film director & borderline nymphomaniac, added a bit of spice. Her solid acting performance raised her presence above and beyond just a very welcome eye-candy inclusion. Ultimately, the obvious low-budget impacts on the film with poorly shot scenes, stuttured pace and slapstick handling of certain moments. Some of my favourite movies of all time have been low budget, Whithnail & I being one that also deals with 2 guys with a dream, but down on their luck. However, for my money, the actors save Tinseltown from the \"Terrible movie\" archives and just about nudges it into the \"could have been a cult movie\" archives. I laughed out loud at some of the scenes involving Joe Pantoliano's character. In particular, the penultimate scenes in the terribly clichéd, but still funny, rich-but-screwed-up characters house, where the story unravels towards it's final moments. I can see how Tinseltown was a great stage play and while the film-makers did their best to translate this to celluloid, it simply didn't work and while I laughed out loud at some of scenes and one liners, I think the first 30 minutes dulled my senses and expectations to such a degree I would have laughed at anything. Unless you're stuck for a novelty coffee coaster, don't pick this up if you see it in a bargain bucket.",
         "Not one for the faint hearted this is a stand alone film which refuses to fit into any category. It manages to switch constantly between humour, drama, pathos and sheer silliness. It is to the credit of the two main actors,Arye Gross and Tom Wood (alive again after being killed off in US Marshalls) that the film does not descend into complete banality. Woods endearing innocence contrasts well with Gross' futile attempts at bravado, and Joe Pantoliano is good as the seedy producer on the make. If you want something different, buy this one.",
         "A HILARIOUS PITCH-BLACK comedy with twist after twist; I cannot believe it's selling for $0.75! I saw that and was going to tape over my $2.50 copy, but decided to watch it first; what a treat! I WON'T be taping over it and I sure won't be selling it for $0.75! Grab it while you can; it's practically free! Cheaper than a blank tape! Why wasn't this a hit?",
         "I went into this hoping for a dark comedy. What I got was a very unfunny, unfocused, mess of a movie. \"Tinseltown\" was originally written as a play, and unfortunately it shows. The film is very claustrophobic, with long boring dialogs throughout. The bickering in front of the police station was squirm inducing. Ron Perlman does the best job early on, as the menacing pseudo manager of a storage facility that is home to a bunch of quirky \"street people\". The movie never takes off, and fails to impress as \"black comedy\". The idea of featuring a serial kill in your film sounds a lot better in print, than it translates to the screen. A disappointment. - MERK",
         "\"I just viewed this movie last night and I don't think I will ever think the same about any of the actors involved, because this movie will stick in the back of my mind.\" The above statement can be thought of as a good or a bad thing. I mean every time I see Tom Cruise or Demi Moore in a movie, I think of \"A Few Good Men\" which is a good thing. Now, every time I see Ron Perlman or Kristy Swanson, I will think of \"Tinseltown\" which is a VERY bad thing. I picked this up thinking that it might be something intelligent or at least make me chuckle and with Arye Gross and the aforementioned Swanson and Perlman, I thought that it at least wouldn't be bad. You could tell the movie was made on a budget the size of Wheeling, Indiana (Where? Exactly.), but maybe they used every dollar to make a good movie. WRONG. This movie is NOT funny or entertaining in any sense of either word. It is just there and lasts for 84 excruciating slow minutes. The characters are paper-thin. You almost care about NONE of the characters, and since the leads are two struggling Hollywood writers with a dream that is all the two struggling writers with a dream who wrote this need you to know about them. Okay, the two REAL writers know all about there onscreen versions of themselves, so they figure so does the audience. They don't even think about character development, except for trying to tie there story back to \"Gilligan's Island\". The plot is unoriginal. Two guys live in a storage center, where one of them stores a bed, and there are about twenty other people living there, too. The rest of the story is contrived and stupid. Have you seen \"National Lampoon's Favorite Deadly Sins\"? The second story with Joe Mantegna is about a television writer who can't find a good story to make a TV movie about, so he creates one. Now substitute the television writer for a screenwriter, morph Mantegna into to annoying actors half his age, and take away the comedy and you have this movie. The actors try. Kristy Swanson is in the movie for maybe 10 minutes and still gives the best performance in the movie. She is still hot, but it would help if she would actually STAR in a movie instead of constantly making CAMEOS. As for everyone else, I don't think it was the actors fault because they have BAD material Go watch the National Lampoon's movie, but stay away from this movie."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Tonik Productions"],
      "summaries": [
         "Two down-and-out Hollywood screenwriters living together in a self-storage facility suspect that the man who rents space next to them is the infamous Costume Killer--a serial murderer who stalks the streets of Los Angeles decked out in ridiculous rented outfits. Using their neighbor's misdeeds for inspiration, the two friends desperately try to write a hit screenplay... at any cost.",
         "In Hollywood it's all about who you know, and the only person two friends know is a serial killer."
      ],
      "budget": 0
   },
   "movielensId": 2484,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-01-01",
      "dvdReleaseDate": null,
      "directors": [""],
      "runtime": 0,
      "movieId": 2484,
      "title": "Tinseltown",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0120095",
      "originalTitle": "Tinseltown",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "In Hollywood it's all about who you know, and the only person two friends know is a serial killer.",
      "tmdbMovieId": 296543,
      "avgRating": 2.2,
      "releaseYear": "1997",
      "numRatings": 15,
      "posterPath": null
   }
}