{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "television producer",
            "id": 10582
         },
         {
            "name": "nervous breakdown",
            "id": 15274
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0138279",
      "video": false,
      "title": "The 24 Hour Woman",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Grace Santos",
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166c63",
               "name": "Rosie Perez",
               "profile_path": "/zz7D8Wnxw91bddp481fYxYKMeuO.jpg",
               "id": 4810,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Madeline Labelle",
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166c67",
               "name": "Marianne Jean-Baptiste",
               "profile_path": "/7C1Ubphw4o1Gv200pAwlgohdxcV.jpg",
               "id": 17352,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Joan Marshall",
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166c6b",
               "name": "Patti LuPone",
               "profile_path": "/qggvgKBEGSHooopJvP5HlnBlUDT.jpg",
               "id": 5699,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dr. Suzanne Pincus",
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166c6f",
               "name": "Melissa Leo",
               "profile_path": "/fcDdsUAyp7DZEi4UEzGXZEjXlUC.jpg",
               "id": 6832,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Roy Labelle",
               "gender": 2,
               "credit_id": "52fe4ac9c3a368484e166c73",
               "name": "Wendell Pierce",
               "profile_path": "/uOsldo9Pkl0E79UbIXX5tZZmC8F.jpg",
               "id": 17859,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Margo Lynn",
               "gender": 1,
               "credit_id": "52fe4ac9c3a368484e166c77",
               "name": "Karen Duffy",
               "profile_path": "/c3G9gFCbBf6zHRQTqUZjXYgZUh4.jpg",
               "id": 76131,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Eddie Diaz",
               "gender": 2,
               "credit_id": "52fe4ac9c3a368484e166c7b",
               "name": "Diego Serrano",
               "profile_path": "/gN6F91YCv3aGqRgVZauhHRFjeRt.jpg",
               "id": 80376,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Brenda",
               "gender": 0,
               "credit_id": "52fe4ac9c3a368484e166c7f",
               "name": "Aida Turturro",
               "profile_path": "/hvQKy8ZdeWWVBgLbeczkm0kyAgU.jpg",
               "id": 106791,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Linda",
               "gender": 1,
               "credit_id": "58b3382c92514177f600ad59",
               "name": "Rosanna DeSoto",
               "profile_path": "/ppAz1PLGnuxTgXYDVWblLgXKkqp.jpg",
               "id": 2111,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Suzanne Pincus' Publicist",
               "gender": 2,
               "credit_id": "58b337d2c3a368522000a9ac",
               "name": "Michael Cumpsty",
               "profile_path": "/gwldSJBtljCxKVc0tTBPm60uCYS.jpg",
               "id": 171652,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Patty",
               "gender": 0,
               "credit_id": "58b3385c92514177a400ac3f",
               "name": "Alicia Renee Washington",
               "profile_path": null,
               "id": 1765922,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Crystal",
               "gender": 0,
               "credit_id": "58b338ffc3a3685297009aba",
               "name": "Reno",
               "profile_path": "/rn6sC1V3xcieRUkvQMitvxWdadx.jpg",
               "id": 1765924,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4ac8c3a368484e166c5f",
               "name": "Nancy Savoca",
               "profile_path": "/7BkuX3MtvbX5jmKbYl3HZrHRxCp.jpg",
               "id": 93025,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "548880c19251415202001a68",
               "name": "Nancy Savoca",
               "profile_path": "/7BkuX3MtvbX5jmKbYl3HZrHRxCp.jpg",
               "id": 93025,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "548880cc925141520d001807",
               "name": "Richard Guay",
               "profile_path": null,
               "id": 39595,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.462811,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 125548,
      "vote_count": 1,
      "budget": 0,
      "overview": "Grace tries to be the perfect mother and TV producer but finds trouble in juggling both.",
      "similar": [
         258480,
         10735,
         858,
         112160,
         634,
         401898,
         437557,
         370663,
         43923,
         250124,
         141,
         297762,
         244772,
         242224,
         27586,
         376660,
         129139,
         2255,
         9762,
         4011
      ],
      "original_title": "The 24 Hour Woman",
      "runtime": 93,
      "poster_path": "/AmUR4UDDuY2t1EhENw5iB46JaNg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Redeemable Features",
            "id": 1483,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dirt Road Productions",
            "id": 40966,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "King City",
            "id": 40967,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Exile Films",
            "id": 40968,
            "origin_country": ""
         }
      ],
      "release_date": "1999-01-29",
      "vote_average": 2,
      "belongs_to_collection": null,
      "tagline": "A story about getting everything you want and what comes next",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Nancy Savoca"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Nancy Savoca",
         "Richard Guay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138279/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE5NjY2Njg0NV5BMl5BanBnXkFtZTcwMjg3OTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rosie Perez, Marianne Jean-Baptiste, Patti LuPone | See full cast and crew »"],
      "reviews": [
         "Yes, this is a \"woman's film.\" One of the other male reviewers condescendingly said that this is woman's film that women should watch. Excuse me, but I don't think women, especially working moms, or anyone raised by a working mom, would need to watch it, except for vindication. This IS their life. On the other hand, I think men would benefit from watching this film. It might generate some empathy for the demands put on working mothers that are never put on men, no matter how enlightened we may regard ourselves. Rosie Perez is perfectly cast, and she is marvelous.",
         "The 24 HOUR WOMAN is great. Too bad many people didn't see it. Rent or buy the video. The much maligned Rosie Perez gives a knockout performance in the title role, enhanced by her character's assistant, an unrecognizable Marianne Jean-Baptiste (\"Secrets and Lies\") with an impeccable American accent, a 24 hour woman herself. Patti Lupone as the wicked boss is at her most ferociously evil. Only Glenn Close may have been able to vilify this character as the superb Patti LuPone does (We see too little of her on the screen, so take advantage of this film to see this terrific actress in a deliciously despicable role). A good script addressing contemporary issues, and creative cinematography in real New York settings further contribute to this film's appeal.",
         "I found THE 24 HOUR WOMAN to be very funny. The lack of structure was deliberate. I have a feeling that the author of the above review was a man; certainly he/she has no children. The movie is about the total chaos that the baby brings into the lives of extremely controlled and stressed people who actually think they can 'manage' the situation while not changing their lives in the least. Nancy Savoca mentioned in an interview that 'when others went to the right, we went to the left' she deliberately avoided cliches like the 'contrast between the working class black woman and middle class Latina.' The ethnicities are there, but are never shoved in your face, and the situations apply to all races. This was not a movie about 'class differences' but about the troubles one has in trying to 'have it all', whether by choice or necessity. The problem applies to the male characters as well as the women. This movie is very entertaining and far more honest than the Hollywood versions of the 'working mom/dad/take care of baby' that I have seen. Recommended.",
         "I agree that there was excessive profanity, but that wouldn't bother me so much. What I don't like is that she waved a gun at her husband and everybody else, and yet he didn't leave her. Many people like her are under pressure and don't wave a loaded gun around. I think we're supposed to sympathize with her for this, but I don't. She gets arrested for trying to jump the turnstile and arguing with a cop, but not for waving the gun. If your spouse waves a gun at you, even if she doesn't fire it, you should get out now, because the next time she may fire it. People have to try to deal with their anger in other ways. What her husband said right before she got angry and said he was a liar, I repeated it several times and still don't understand what he said that got her so mad.",
         "I was actually disappointed in Nancy Savoca's \"24-Hour Woman\" starring the ever wonderful Rosie Perez, though I didn't tell local movie reviewer/ex-Mayor Ed Koch that when he walked in for the next showing with a sour face as if he already expected it to be bad. I told him it was enjoyable, which it was. I avoided seeing \"Parenthood\" and \"Baby Boom\" so I don't know if this in fact raises different, more authentic issues. Certainly tossed off lines are quite accurate and very funny, and are reflective of the thank you at the end of the credits to the many people who shared their \"war stories\" with the writers. (I guess I'm not the only one who felt like a POW at home with a baby who wouldn't sleep.) But Savoca didn't reach far enough. While the secondary character does have school-age kids, hardly any attention is paid to the child care etc. problems of that age, as opposed to the baby woes of the lead, which in fact have been dealt with much more in popular entertainment, such as \"Mad About You\" (I always remind people that they are not just having a baby but having a person; babyhood is a very small percentage of the lifetime you're responsible for 24-7.) Perez unrealistically working in a glamorous job is used for funny effect in the climax and also is the opportunity for deft jabs at talk shows and the media, but she's also working surrounded by women, mostly mothers in fact, so other issues aren't dealt with as well. So it seems to be the intent to just deal with a few issues, amusingly enough, but with no new insights, but at least some clichés are avoided (I thought all such movies had to include infidelity, but I think they wanted to challenge the Latin lover macho cliché, and there's also a very positive black father). It just feels a few years old. And this is certainly the kind of movie where it's hopeless to expect a quiet audience as everyone talks back to what's happening on screen. This movie is less for parents to whom it will be like being back home than for those contemplating parenthood in the future. Ah but will there be a run on birth control pills after this? (originally written 2/15/1999)",
         "Rosie Perez has been in great films: \"Fearless\" (Oscar nominations), \"It Could Happen to You,\" and \"The Twenty-Four Hour Woman.\" In this film, Perez is wonderful as a producer who juggles a man, a job, and pregnancy in her 30s. With a competent supporting cast including Marianne Jean-Baptiste, Karen Duffy, and Aida Turturro, this film, with a delightful screenplay and a highly-overlooked and exceptional leading lady, is one not to miss. (7/10)",
         "Somehow I missed this when it came out at the movies, I don't think it was publicized enough! This was a fast-paced, funny and uplifting story. I found the behind the scenes world of television production reminiscent of Broadcast News, with the hectic pace and career-driven personalities. Patti Lupone's \"do anything for ratings\" character was outrageous! Rosie Perez was excellent as a television producer juggling career and a new baby, set in the NY media market. The movie's pace was quick and it was over before I knew it. If you liked Baby Boom, Working Girl or Broadcast News this is a good movie for you.",
         "We thought this movie was excellent. Rosie Perez and Marianne Jean-Baptiste went through similar but different problems as working mothers. Marianne had problems getting her out-of-work husband to take care of the kids, Rosie had problems dealing with a brand new baby that cried constantly! The plot, the acting and the characters were believable and compelling. We loved it!",
         "I usually like Rosie Perez, and I have kids, so the premise of the movie sounded interesting. But it isn't. A producer for a highly annoying show called \"24 Hour Woman\" finds out she's pregnant and she and her husband Eddie, a co-host for the show, make the show all about her pregnancy. *Yawn* The show is like a bad flashback of Regis & Kathie Lee and smacks of a Saturday Night Live script. The movie is barely better. It's not that the acting is bad - it's nothing special - but the script is really dull. The only interesting aspect are the glimpses of the worries Grace has: gaining too much weight, dealing with in-laws and pushy moms, babies who cry all of the time, and not being able to be devoted to work and devoted to baby. Eddie is barely involved except when he comes up with brilliant ideas like wake the baby during the day. Like that ever works. The side story of the stay-at-home dad whose wife becomes Grace's assistant is more interesting than the main plot. The relationships between spouses is just sad - and frustrating. Unrealistic, annoying, hyper. Do yourself a favor and watch Baby Boom which at least handles motherhood in a charming and funny manner.",
         "This is a predictable parable about juggling a career and a family. There really is nothing original in it and the frenetic pace is sometimes unnerving. But the film lost me with its excessive and needless profanity. This is ultimately a picture about family. But here, although the F word is used relentlessly, it doesn't stand for \"family.\""
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Dirt Road Productions, King City",
         "Exile Films",
         "Redeemable Features"
      ],
      "summaries": ["Grace tries to be the perfect mother and TV producer but finds trouble in juggling both."],
      "budget": 2500000
   },
   "movielensId": 2486,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-29",
      "dvdReleaseDate": null,
      "directors": ["Nancy Savoca"],
      "runtime": 93,
      "movieId": 2486,
      "title": "The 24 Hour Woman",
      "mpaa": "",
      "actors": [
         "Rosie Perez",
         "Marianne Jean-Baptiste",
         "Patti LuPone",
         "Melissa Leo",
         "Wendell Pierce",
         "Karen Duffy",
         "Diego Serrano",
         "Aida Turturro",
         "Rosanna DeSoto",
         "Michael Cumpsty",
         "Alicia Renee Washington",
         "Reno"
      ],
      "imdbMovieId": "0138279",
      "originalTitle": "The 24 Hour Woman",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["rpDFEFXQE7M"],
      "plotSummary": "Grace tries to be the perfect mother and TV producer but finds trouble in juggling both.",
      "tmdbMovieId": 125548,
      "avgRating": 2.47333,
      "releaseYear": "1999",
      "numRatings": 75,
      "posterPath": "/AmUR4UDDuY2t1EhENw5iB46JaNg.jpg"
   }
}