{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0163984",
      "video": false,
      "title": "Blood, Guts, Bullets and Octane",
      "recommendations": [],
      "backdrop_path": "/fpPu79FneMgwkMT4ftdmh4PF10Q.jpg",
      "revenue": 13674,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Victor Drub / Dumpster Bum",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d25",
               "name": "Mike Maas",
               "profile_path": "/xCjJOLGNujAKGQi4IZBo4NvpqHc.jpg",
               "id": 44464,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mechanic",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d29",
               "name": "Nick Fenske",
               "profile_path": null,
               "id": 571123,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Frank Priolo",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d2d",
               "name": "Mark Priolo",
               "profile_path": null,
               "id": 571124,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Mike Carbuyer",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d31",
               "name": "Andrew Fowler",
               "profile_path": null,
               "id": 571128,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Julie Carbuyer",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d35",
               "name": "Gloria Gómez",
               "profile_path": null,
               "id": 571129,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Bob Melba",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d39",
               "name": "Dan Leis",
               "profile_path": null,
               "id": 261500,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Elda",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d3d",
               "name": "Josephine Arreola",
               "profile_path": null,
               "id": 571130,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Jerry",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d41",
               "name": "Dave Booth",
               "profile_path": null,
               "id": 571131,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Pinto Guy",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d45",
               "name": "Kevin Hale",
               "profile_path": null,
               "id": 415719,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Frank Manzano",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d49",
               "name": "Max Ancar",
               "profile_path": null,
               "id": 571132,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Ginger",
               "gender": 1,
               "credit_id": "52fe4720c3a36847f8124d4d",
               "name": "Leah Carnahan",
               "profile_path": "/dkYIZHEj4nch4sxKJhQXpGMZjSU.jpg",
               "id": 571133,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Dick Dupree Sr.",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d51",
               "name": "Scott Taylor",
               "profile_path": null,
               "id": 500707,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Dick Dupree Jr.",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d55",
               "name": "Eric Lutes",
               "profile_path": "/dWSKOCf5x6fGZBIh1HiSPAQpL0B.jpg",
               "id": 134083,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Diaz Carbajal",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d59",
               "name": "Carlos V. Hernandez",
               "profile_path": null,
               "id": 571134,
               "order": 13
            },
            {
               "cast_id": 31,
               "character": "Sid French",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d93",
               "name": "Joe Carnahan",
               "profile_path": "/5YPrZ1JprLwtU4tn5DG0wqLjsAT.jpg",
               "id": 40223,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d5f",
               "name": "Leon Corcos",
               "profile_path": null,
               "id": 329597,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d65",
               "name": "Dan Leis",
               "profile_path": null,
               "id": 261500,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d6b",
               "name": "Martin Birke",
               "profile_path": null,
               "id": 571135,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d71",
               "name": "Mark Priolo",
               "profile_path": null,
               "id": 571124,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124d77",
               "name": "John Alexander Jimenez",
               "profile_path": null,
               "id": 571136,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d7d",
               "name": "Joe Carnahan",
               "profile_path": "/5YPrZ1JprLwtU4tn5DG0wqLjsAT.jpg",
               "id": 40223,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d83",
               "name": "Joe Carnahan",
               "profile_path": "/5YPrZ1JprLwtU4tn5DG0wqLjsAT.jpg",
               "id": 40223,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d89",
               "name": "Joe Carnahan",
               "profile_path": "/5YPrZ1JprLwtU4tn5DG0wqLjsAT.jpg",
               "id": 40223,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124d8f",
               "name": "Joe Carnahan",
               "profile_path": "/5YPrZ1JprLwtU4tn5DG0wqLjsAT.jpg",
               "id": 40223,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.564295,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47139,
      "vote_count": 4,
      "budget": 7300,
      "overview": "A Cherry Pontiac Lemans Convertible...Two Days...Two-Hundred &amp; Fifty Grand. When your lemon lot hits the skids you glom the gig no matter what the smell. For Bob and Sid, two slicked-back burnouts, bum luck runs in spades. With a goose-egg for cash flow and a fore-closure falling fast, they take the gig. The Upside: Fat Cash...The Flipside...Every Thug, Crook, Punk and Mercenary on the planet looking to get rich.",
      "similar": [],
      "original_title": "Blood, Guts, Bullets and Octane",
      "runtime": 87,
      "poster_path": "/gyIyZOKJ1y80p74GjZuqpfhFy93.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-10-16",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Joe Carnahan"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Joe Carnahan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0163984/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1Mzg1NzA0M15BMl5BanBnXkFtZTcwNTQ1NTc0MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Mike Maas, Nick Fenske, Mark Priolo | See full cast and crew »"],
      "reviews": [
         "Everything that can be bad about a movie is here. First off, if you're directing a very low budget movie, don't cast yourself in the lead. As clearly evident here, the lead flubs lines and ad-libs a lot to the already awful dialog, but since he's also the director/editor/craft service and everything, he can do what he wants. This is another one of those \"I think I'm just like Tarantino but I'm not actually even in the ballpark\" movies. There are long scenes of bad dialog where a point is made, then repeated over and over and over and over for ten minutes. Some of it is so contrived and poorly written, it'll literally make you cringe (the Johnny Cash thing was amazingly bad). It's one of the problems with amateurs making movies these days: everything thinks by making pop culture references, you're the next Tarantino and it doesn't work that way. Editing in dialog was a huge necessity here but I'm guessing the writer/director/editor/grip didn't think so. I'm betting this script was done in one draft, that's it, let's shoot. And editing and directing of the actual movie was pretty bad. Apparently the director has never heard of the words \"establishing shot.\" 95% of the movie is done in extreme close up, much of the time the actor's faces aren't even fully in screen. There are lots of quick, useless cuts (a lot in black in white which does nothing other than remind you you're watching a poorly made movie). I realize this is a low budget film, so when we see the crime scene and it's two \"FBI\" guys, a guy digging in the garbage who is apparently unfamiliar with the term \"contanimating evidence\" and an ambulance (which serves no purpose at all, the director must have known someone who works at an ambulance service), it's clearly evident there was no budget. If you can't make a realistic looking crime scene (at least have SOME POLICE and police tape is cheap), then don't have it at all. I had fast forwarded through a lot of the movie because it was pretty hard to watch. By the time I got to this scene, it was all I could stand. Another amazingly annoying thing is the title cards that introduce EVERY SCENE. Because we're all too stupid to just get the scene without being introduced to it, we have to these annoying title cards that tell us what we're about to watch. Three or four times during a movie; that's okay. But every two minutes? I do not refer to this as a \"film\" since it was shot on video and run through the \"film look\" software (like Magic Bullet) which only makes your video look like grainy video (although some of the cinematography on the outside stuff is done really well - I'll give them that). What's move baffling to me is this guy actually got real directing work after (Narc and Smokin' Aces). What has the world come to? There's no doubt this guy has a huge ego (I don't know why). In his bio, he's actually got a bit about, and I quote: \"...where his journey to greatness began.\" Someone shoot me.",
         "I can't believe so many people are calling this a \"great\" movie, and I really have to suspect that someone paid the reviewer quoted on the box to say that this was \"better than The Usual Suspects\" (it isn't). Yes, it was made for less than eight thousand bucks, and it shows. Folks, it's a BAD movie! The characters are terrible, the acting is terrible, the story, far from being quick, is a bore. Some people will praise anything independent and low budget just for being that, but not me. Independent or studio, it still has to be good, and this isn't. Yes, I'll give Carnahan all the credit in the world for taking a cheap, awful flick and getting enough juice behind it to market the thing to where it is today, but that's all. This did not belong on the video store shelf, nor did it belong on a channel that viewers have to pay for. It's marketed as a regular film; it should carry a warning that notes what it really is: something just below \"demo tape for rejected artist\". Do not waste your time.",
         "Two used car lot owners, who we know nothing about, get involved with numerous shady characters, who we know nothing about, while being paid to watch a Pontiac convertible, which we know nothing about. Why would anyone be interested in a movie that explains nothing, and has zero character development? The obvious answer is you wouldn't. Throw in unending closeups of meaningless dialog, a \"surprise\" ending that is so ridiculous, it will leave you wondering if it didn't come from a different film, and other trivial nonsense that does nothing to explain this confused mess. Forget even considering seeing B.G.B. & O, instead seek out \"Suckers\", another low budget crime drama centering around a used car operation, that is absolutely brilliant. - MERK",
         "A firm proposition instills opposition with skeptical minds on the make. And the two with the few become one with the many with merciless souls on the take. Intriguing conviction in characters' diction had preset the pathway to yearn. Ladened with larynx and leaded with bullets as bodies end up in the urn. I have to admit I fell in love with the script at first sight. Dialogue Dueling with intellectual fueling had left me with pleasant delight.",
         "Check this one out if you like corny, campy action movies. I'm not ashamed to say that I do, and enjoyed it. The acting is wooden, but come on, the movie had a miniscule budget. The story is pretty good, and the dialogue is (unintentionally?) hilarious.",
         "This movie reminded me of the early Tarantino work. I like the camera movement, I like the actors, I like the end. A quite entertaining and refreshing movie. It's too bad we always have to go the independent way to see a good movie these days (PI...) My favorite part is the plot build up on the 2 car dealers. Great !!",
         "Have you ever watched a VHS (remember those?) that was copied from a tape that was already a copy? If you did, you'd know the quality was really bad by that point. That's how copies work...the more generations you make, the worse it gets. That's pretty much how I'd sum up this film. It feels like a Tarantino rip off, and all but Tarantino's first couple movies are rip offs themselves (you can call it an \"homage\" all you want...the dude steals stuff and makes a few minor changes). The plot is pretty basic at best. A couple of friends decide to save their failing used car dealership by taking on more than they can handle with a random assortment of bad guys. Of course by the time that happened I was already bored to tears. The writers try to make up for a tired story with some snappy dialog and succeed once or twice, but overall the whole thing is just one big failure. They should really remove the \"blood\" and \"guts\" part of the title...there's not much of the former and none of the latter. The \"bullets\" part is up for debate as well since there's not much in the way of gun play going on. Sadly, there's not much of anything going onat all. Period. It's just bad...even for a low budget rip off.",
         "When Robert Rodriguez's El Mariachi came out in 1992, everyone was so dazzled by what Rodriguez could do for $7,500. Blood Guts Bullets & Octane was released in 1999, and everyone found it to be a simple Tarantino rip-off. Well, frankly, Blood Guts Bullets & Octane is at least three times the film El Mariachi is, because not only was Joe Carnahan able to make a feature-length film with choreographed violence and creative freedom like Rodriguez did, but he also wrote a very tight, extremely smart, creative script. Rodriguez wrote a laughable little direct-to-video fluff where the dialogue is stilted in the worst way and the story hardly works. Why when someone detects even the slightest acknowledgment of Tarantino in a film do they decide to fire criticism at it when maybe it could be more than a simple clone? I don't believe Quentin Tarantino had any influence on this film. Yes, you could say he did, because the story flashes back and the dialogue is earthy and clever. But is he the only filmmaker to have ever told a nonlinear story with earthy, clever dialogue? No. Far from it. In fact, I think it's extremely injust and unfair to protect so ardently from imitation a filmmaker like Tarantino, who admittedly steals from every other filmmaker in existence, even ones that came after him. And those who criticize this film for being a Tarantino clone may not be as well-versed in film as Tarantino or Carnahan himself to the point where you would realize that the dialogue is not at all like Tarantino's. QT writes dialogue with the intention of sounding realistic. He acts as recorder while his characters segue into natural conversations irrelevant to the plot. Carnahan's characters speak like satirizations of car dealers and people you would only find in movies. His dialogue is written to be quick, jazzy, clever, and even a little poetic, because sometimes lines will be alliterative, contain similes and metaphors, and other such things. If you would like to zero in on Carnahan's influence---and every writer, filmmaker, or any other artist has their influences---then perhaps David Mamet is a better candidate. Even so, who cares? Carnahan's script is loaded with razor-sharp wit and his own knack for the pace and rhythm of a film. I think for a film made for $8,000 and bags of Doritos the cast is quite convincing. Whether they are professional or trained actors I don't know, but whoever they are, they have natural penchants for acting. Carnahan himself is excellent, and perhaps the best of the performances comes from Dan Leis, who plays opposite him. The cinematography and editing get a bit gimmicky and overexerted, especially in terms of the unpatterned switching off between color and black-and-white and title cards for each scene. It seems corny and gratuitous, and considering it as a movie despite its budget and circumstances, it definitely is, but Carnahan is a smart and practical director, and he made this film to pack a shattering punch of all that he can do and more with just that much money (and Doritos).",
         "If you begin to watch this movie knowing that it's a extremely low-budget independent with non-actors, you'll be quite surprised. It has a better story-line, acting and editing than many of the multi-million dollar Hollywood productions that are foisted on us. BGBO is definitely an edgy, sarcastic, dark comedy. It isn't meant to be true-to-life or a Hitchcock thriller with every loose end tied up and fraught with subtleties and nuances. Accept it for what it is -- I loved it and never saw the plot twist towards the end coming (the reason for the GTO). Gave it a 9 out of 10. If only the networks could come up with movies-of-the-week as original as this instead of the endless retreads with former models and sitcom stars.",
         "The teaser on the front of the movie box said, \"better than The Usual Suspects!\" I couldn't disagree more. This movie solely lacked any character development, was poorly acted, and had a dumb storyline. Don't waste your time."
      ],
      "genres": [
         "Action",
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Short Fuse Films",
         "Next Wave Films"
      ],
      "summaries": [
         "A Cherry Pontiac Lemans Convertible...Two Days...Two-Hundred & Fifty Grand. When your lemon lot hits the skids you glom the gig no matter what the smell. For Bob and Sid, two slicked-back burnouts, bum luck runs in spades. With a goose-egg for cash flow and a fore-closure falling fast, they take the gig. The Upside: Fat Cash...The Flipside...Every Thug, Crook, Punk and Mercenary on the planet looking to get rich.",
         "Slick-talking Bob and Sid run a bankrupt used-car lot. They used to work for Danny Woo, whose lot next door is the most successful one in Needles. Danny's still their friend, and what with his sick wife, Bob and Sid agree to cover for him during an IRS investigation into his finances. Meanwhile, a series of murders and an FBI investigation focus on a Pontiac convertible with a mysterious cargo originating in the Andes. Bob and Sid's shady supplier offers them $250,000 to stash the car on their lot for a couple days; Bob's reluctant, but Sid sees this as their ticket out. They say yes, then try to run a double cross on the Pontiac's mysterious and ruthless owner."
      ],
      "budget": 7300
   },
   "movielensId": 2487,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-10-16",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Joe Carnahan"],
      "runtime": 87,
      "movieId": 2487,
      "title": "Blood, Guts, Bullets and Octane",
      "mpaa": "R",
      "actors": [
         "Mike Maas",
         "Nick Fenske",
         "Mark Priolo",
         "Andrew Fowler",
         "Gloria Gómez",
         "Dan Leis",
         "Josephine Arreola",
         "Dave Booth",
         "Kevin Hale",
         "Max Ancar",
         "Leah Carnahan",
         "Scott Taylor",
         "Eric Lutes",
         "Carlos V. Hernandez",
         "Joe Carnahan"
      ],
      "imdbMovieId": "0163984",
      "originalTitle": "Blood, Guts, Bullets and Octane",
      "genres": [
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["263lRPYsejs"],
      "plotSummary": "A Cherry Pontiac Lemans Convertible...Two Days...Two-Hundred &amp; Fifty Grand. When your lemon lot hits the skids you glom the gig no matter what the smell. For Bob and Sid, two slicked-back burnouts, bum luck runs in spades. With a goose-egg for cash flow and a fore-closure falling fast, they take the gig. The Upside: Fat Cash...The Flipside...Every Thug, Crook, Punk and Mercenary on the planet looking to get rich.",
      "tmdbMovieId": 47139,
      "avgRating": 2.34746,
      "releaseYear": "1998",
      "numRatings": 118,
      "posterPath": "/gyIyZOKJ1y80p74GjZuqpfhFy93.jpg"
   }
}