{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0152548",
      "video": false,
      "title": "Spanish Fly",
      "recommendations": [],
      "backdrop_path": "/ee1EvhqffsFJQOkUlsas73aIAHa.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Antonio's Date #2",
               "gender": 1,
               "credit_id": "52fe4cf2c3a36847f82463bd",
               "name": "Giannina Facio",
               "profile_path": "/1S5raNCzDtTLERUftxr4Zgg80Bv.jpg",
               "id": 58787,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "zoe",
               "gender": 1,
               "credit_id": "55c034cec3a368238c000b21",
               "name": "Daphna Kastner",
               "profile_path": null,
               "id": 1021557,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Rossy",
               "gender": 1,
               "credit_id": "55c035099251410ee7000b6f",
               "name": "Maria de Medeiros",
               "profile_path": "/q1DKWoG16njgoku7MIK38VDHjjf.jpg",
               "id": 2319,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Zoe's Mother",
               "gender": 1,
               "credit_id": "55c03546c3a3682253000b23",
               "name": "Mary McDonnell",
               "profile_path": "/4NcE9BcnLB3oWns51r9peH8GhN8.jpg",
               "id": 1581,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "55c0244dc3a368238c0008c5",
            "name": "Daphna Kastner",
            "profile_path": null,
            "id": 1021557,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.004194,
      "production_countries": [],
      "id": 170187,
      "vote_count": 0,
      "budget": 0,
      "overview": "A woman journalist, Zoe, knows better than to go into a story with her mind already made up. But that's exactly what she does when she heads off to Spain to write about its men and their macho take (as she sees it) on relationships. As she tries to prove her thesis, she soon realizes that she doesn't know as much about the male sex as she thought.  She also finds herself involved in relationships with the wrong men.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         394117,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Spanish Fly",
      "runtime": null,
      "poster_path": "/boDTUyMS6lIMsXimpY5BOx4kxjM.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-09-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Daphna Kastner"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Daphna Kastner"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0152548/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk4OTk4Njk5M15BMl5BanBnXkFtZTcwOTI0ODYyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Daphna Kastner, Toni Cantó, Martin Donovan | See full cast and crew »"],
      "reviews": [
         "The author (Kastner), director (Kastner), and starring actor (also Kastner), and her character in the film, all show an equal dearth of imagination, depth, feel for dialogue, and understanding of people. Basically the idea is this: an unattractive frumpish American girl goes to Madrid with an advance from some publishing company to write a book about \"macho\" Spanish men. However, she knows no Spanish, nothing about men, and her attempts to organise a few half-baked ideas about her subject come to nothing, as does the half-baked premise of the film. The protagonist is totally unegaging to the point of being irritating, all the male characters are one-dimensional props to support the film's fragile premise, and the caricature of Madrid as a steamy hothouse of hormone-filled men clutching submissive women in every nook and cranny is at best blinkered and at worst insulting. An embarrassingly ill-conceived film which becomes more and more banal as it goes on. How Ms Kastner ever got to make the thing is beyond me.",
         "This is a very amateurish effort. There aren't that many auteurs out there who have the skills to take on writing, directing, and acting the lead role in a film. Daphne Kastner is NOT one of them. If you're looking for a spirited, fun, Spanish film, rent something joyously offbeat like Volver or Women On The Verge Of A Nervous Breakdown by Pedro Almodovar. Steer clear of this drab, lifeless, and can I say it, borderline racist film. It just traffics in bad ethnic stereotypes. And just as an aside, if you're renting it for the lurid cover or the provocative title, you're going to be disappointed.It's smarmy, not erotic. Martin Donovan, an actor I loved in \"The Opposite Of Sex\" and many Hal Hartley films, is utterly wasted here. Then again, maybe ANYONE needs to be wasted to be submitted to this 91 minute waste of time.",
         "When I started to see this film I thought \"o no another B movie brought out here to attract 'sex craving men\". And initially it was very bad indeed. Dapna as proper and prim lady was totally unbelievable. Only when she loosened up she became more believable. The men in the movie were all horrible and one dimensional, but there needed be men in the movie so.... Bad casting!! I don't think Madrid is really a place where couples are making out on every corner. The filmmaker merely tried to show us the state of Dapna's mind. When I was pregnant it was just like I only met women who where pregnant also. In other words she very much wanted a relationship but was haunted by the history of her parents, who she imagined to be like those couples. It was only much later that she found out that her father was not a holiday flirt but had cared about her mother. The scenes relating to the unraveling of this with her mother were great I thought.It was a journey of finding out who she was making the usual human mistakes, but ultimately the truth set her free!",
         "American woman Zoe (Daphna Kastner, who also wrote and directed the film) is in Madrid to write a book about Spanish machismo. As the daughter of a Spaniard's brief fling with her mother, she is somewhat obsessed with the topic of the swagger displayed by Spain's male population. But, due to language barriers, she hires a translator, Antonio, to help her interview her subjects. Antonio, invariably late to appointments, takes a definite shine to Zoe and wants to help. But, he becomes so exasperated by her candid questions to those males who have been chosen to be part of the book that he, Antonio, often makes up the answers himself and/or tells the subjects to take a hike. Zoe is not pleased and believes Antonio is displaying his own macho inclinations. Yet, after a brief affair with a dastardly, American-born Madrid bookseller, she is ready to look at continental men in a different light. Will Zoe learn something about the universal ways of men and women? This is a very interesting film with a provocative nature. What does cause men, in Spain and elsewhere, to exert their dominance over the females they lay claim to? Are they only showing off or is it something deeper? And, are women to be regarded as fellow human beings or merely objects of beauty and passion? Kastner succeeds in laying the groundwork for a heated discussion on these topics, and more importantly, displays a veritable tour de force by writing, directing, and starring in this interesting movie. The rest of the cast is also fine, with Martin Donovan delivering a worthy performance as the loathsome bookseller. Costumes and production values are nice as well. In addition to the storyline, it is the Madrid setting that is most admirable, however, for it is utterly beautiful, in every way. Do you want only movies that go down easy or are you looking for something with more meat on its bones? If you can answer yes to the latter, get this one at your earliest convenience. It would be a great catalyst for a heated debate in any mixed-gender setting."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Banfilm",
         "Portman Productions",
         "Pynacle Pictures, London, UK"
      ],
      "summaries": ["A woman reporter in over her head in trying to write a book on the male machismo in Spain finds the men don't match her story's expectations. She also finds herself involved in relationships with the wrong men."],
      "budget": 0
   },
   "movielensId": 2489,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-09-10",
      "dvdReleaseDate": "2004-11-09",
      "directors": ["Daphna Kastner"],
      "runtime": 0,
      "movieId": 2489,
      "title": "Spanish Fly",
      "mpaa": null,
      "actors": [
         "Giannina Facio",
         "Daphna Kastner",
         "Maria de Medeiros",
         "Mary McDonnell"
      ],
      "imdbMovieId": "0152548",
      "originalTitle": "Spanish Fly",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A woman journalist, Zoe, knows better than to go into a story with her mind already made up. But that's exactly what she does when she heads off to Spain to write about its men and their macho take (as she sees it) on relationships. As she tries to prove her thesis, she soon realizes that she doesn't know as much about the male sex as she thought.  She also finds herself involved in relationships with the wrong men.",
      "tmdbMovieId": 170187,
      "avgRating": 3.08,
      "releaseYear": "1998",
      "numRatings": 25,
      "posterPath": "/boDTUyMS6lIMsXimpY5BOx4kxjM.jpg"
   }
}