{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "deafness",
            "id": 1643
         },
         {
            "name": "sister-in-law",
            "id": 164181
         },
         {
            "name": "character study",
            "id": 164186
         },
         {
            "name": "uncle nephew relationship",
            "id": 164193
         },
         {
            "name": "für elise",
            "id": 164199
         }
      ],
      "imdb_id": "tt0110116",
      "video": false,
      "title": "Immortal Beloved",
      "recommendations": [
         10337,
         22267,
         45225,
         1770,
         10445,
         37345,
         9465,
         11521,
         12772,
         2107,
         8293,
         10436,
         37718,
         83489,
         15170,
         31052,
         19200,
         9440,
         32855,
         10905
      ],
      "backdrop_path": "/pioyUlyhf9V4AX4F8flty0mxxpo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ludwig van Beethoven",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8a5",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Anton Felix Schindler",
               "gender": 0,
               "credit_id": "52fe458e9251416c7505a8a9",
               "name": "Jeroen Krabbé",
               "profile_path": "/A5Mks6zi6Xzt9A8fxBWc3wdlvhx.jpg",
               "id": 1924,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Anna Marie Erdödy",
               "gender": 1,
               "credit_id": "52fe458e9251416c7505a8ad",
               "name": "Isabella Rossellini",
               "profile_path": "/yKnom6aUaP17Z49mypVZmq1jdjH.jpg",
               "id": 6588,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Johanna Reiss",
               "gender": 0,
               "credit_id": "52fe458e9251416c7505a8b1",
               "name": "Johanna ter Steege",
               "profile_path": "/fWY2HuHSORn5EnPqFJ8sSJia2ME.jpg",
               "id": 55851,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Karl van Beethoven",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8b5",
               "name": "Marco Hofschneider",
               "profile_path": "/n1gUzpoikh4Fc8FVA9LEgVpLWM3.jpg",
               "id": 23797,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Nanette Streicherová",
               "gender": 1,
               "credit_id": "52fe458e9251416c7505a8b9",
               "name": "Miriam Margolyes",
               "profile_path": "/7Fijg5sZ7gKbooq6tId3MUS5sDY.jpg",
               "id": 6199,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Clemens Metternich",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8bd",
               "name": "Barry Humphries",
               "profile_path": "/ccJHmzU8wzOe4sAmeVeScu5mygl.jpg",
               "id": 22,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Giulietta Guicciardi",
               "gender": 1,
               "credit_id": "52fe458e9251416c7505a8c5",
               "name": "Valeria Golino",
               "profile_path": "/6UmnZGoZkmqMrkTY1roIkCzB4rn.jpg",
               "id": 3124,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Nikolaus Johann van Beethoven",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8c9",
               "name": "Gerard Horan",
               "profile_path": "/fsF6Ruuf9DrTllqMaDx5aJpFiaX.jpg",
               "id": 56101,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Kaspar Anton Carl van Beethoven",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8cd",
               "name": "Christopher Fulford",
               "profile_path": "/cwIbWnN0npv00ysuReNXyXxhGKR.jpg",
               "id": 6970,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Franz Josef Guicciardi",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8d1",
               "name": "Luigi Diberti",
               "profile_path": "/cNcIyygeUnmLxyeuiGH8yuO7eoz.jpg",
               "id": 27432,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Jakob Hotscevar",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8d5",
               "name": "Michael Culkin",
               "profile_path": "/ROLw9EhtO44DPwdRrmX6RyFPZN.jpg",
               "id": 8445,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Marie Fröhlich",
               "gender": 1,
               "credit_id": "52fe458e9251416c7505a8d9",
               "name": "Sandra Voe",
               "profile_path": "/pIHuQOcK7FjepXNGM4Ze49yuPAr.jpg",
               "id": 1645,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Elector Max Friedrich",
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8dd",
               "name": "Bernard Rose",
               "profile_path": "/pq8tgkUyoW36YoczEemKmCgwrYc.jpg",
               "id": 57851,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Therese Obermeyer",
               "gender": 1,
               "credit_id": "58ff176492514107ba006f90",
               "name": "Alexandra Pigg",
               "profile_path": "/n26RTDPFgCocFIzfYTFFilYCqql.jpg",
               "id": 230909,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Jacob Hotscever",
               "gender": 2,
               "credit_id": "58ff17a6925141081d0068fc",
               "name": "Michael Culkin",
               "profile_path": "/ROLw9EhtO44DPwdRrmX6RyFPZN.jpg",
               "id": 8445,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Karl Holz",
               "gender": 2,
               "credit_id": "58ff17b492514107d0006e69",
               "name": "Donal Gibson",
               "profile_path": "/4MKTSwTpl1BaXD554MsrwK7uJqg.jpg",
               "id": 110315,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8e3",
               "name": "Bruce Davey",
               "profile_path": null,
               "id": 2487,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8e9",
               "name": "Stephen McEveety",
               "profile_path": null,
               "id": 8747,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8ef",
               "name": "Peter Suschitzky",
               "profile_path": null,
               "id": 307,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8f5",
               "name": "Bernard Rose",
               "profile_path": "/pq8tgkUyoW36YoczEemKmCgwrYc.jpg",
               "id": 57851,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe458e9251416c7505a8fb",
               "name": "Bernard Rose",
               "profile_path": "/pq8tgkUyoW36YoczEemKmCgwrYc.jpg",
               "id": 57851,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.869255,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13701,
      "vote_count": 114,
      "budget": 120,
      "overview": "The life and death of the legendary Ludwig van Beethoven. Beside all the work he is known for, the composer once wrote a famous love letter to a nameless beloved and the movie tries to find out who this beloved was. Not easy as Beethoven has had many women in his life.",
      "similar": [
         304410,
         447332,
         399055,
         713,
         378064,
         339397,
         7445,
         1444,
         271397,
         11185,
         16328,
         312,
         29723,
         30618,
         33806,
         1627,
         1890,
         36536,
         23606,
         153795
      ],
      "original_title": "Immortal Beloved",
      "runtime": 121,
      "poster_path": "/meRFVzGpBJiObWfdtOoNr0UPsP4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Majestic Films International",
            "id": 2630,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Icon Entertainment International",
            "id": 4564,
            "origin_country": ""
         }
      ],
      "release_date": "1994-12-16",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bernard Rose"],
      "runtime": 121,
      "synopsis": "Warning: This movie is extraordinarily susceptible to being spoiled. It is very similar to Citizen Kane in this regard. Please consider not reading past the 15th paragraph (there will be a warning) until you have seen the movie. Immortal Beloved is a biographical account of Ludwig van Beethoven's ( Gary Oldman) life and loves, in the form of a fictionalized treatment of an enigmatic letter to his \"immortal beloved\" that was found after his death. (The letter, the mystery about the addressee's identity, and a great many other aspects of Beethoven's life, are treated reasonably authentically in the movie. But the identity of the \"immortal beloved\" indicated in the movie should be regarded as fictional.) The movie is structured like Citizen Kane---a mystery is revealed upon Beethoven's death, and the movie is a long series of flashbacks through Beethoven's life as his secretary and confidant Anton Schindler ( Jeroen Krabbé) scours the countryside attempting to solve the matter. The mystery is the discovery of an unofficial will found among Beethoven's papers upon his death, bequeathing all his property to an unnamed \"immortal beloved\", along with a passionate love letter to her. Schindler vows to find out who she was, and thus carry out Beethoven's last wish, keenly aware of how society had failed Beethoven throughout his life. He is opposed in this by Beethoven's surviving brother Johann ( Gerard Horan) and Johann's wife Therese ( Alexandra Pigg), who feel that the estate should be theirs, based on an earlier official will, and as compensation for the abuse they endured from Ludwig. Schindler (Anton Schindler really was Beethoven's secretary and assistant, and apparently really was as sycophantic in real life as his depiction in the movie) sets out for the hotel in Karlsbad where the letter was sent. During this journey, a voice-over recites part of the letter, while the slow 2nd movement of Beethoven's 5th (\"Emperor\") piano concerto plays. The letter explains his ardent love for this woman, while explaining that he has been delayed, by a serious coach breakdown, from seeing her. The proprietress, Frau Streicher ( Miriam Margolyes), tells him that Beethoven had indeed come there many years before to stay with a woman who had checked in earlier. This woman did not give her name, and covered herself in a veil at all times. A letter from Beethoven arrived, and she took it to the room, along with a meal, after opening it to find out what room it should go to---\"Immortal beloved\" was not an adequate address. The woman apparently did not like the letter, because she checked out shortly thereafter. Then Beethoven arrived, saw that the woman had left, and went on a rampage, destroying furniture and breaking a window. An extensive search of the hotel's past registry books yields the page on which the woman signed in, but the name is illegible. Frau Streicher lets Schindler tear out the page and take it with him. Schindler then goes to see various women who were known to have been personally involved with Beethoven, beginning with Giulietta Guicciardi ( Valeria Golino). She tells Schindler of her fascination with Beethoven, her desire to marry him, and his rather eccentric and boorish behavior. Because Beethoven was rumored to be extremely shy about performing on the piano (the real reason was his approaching deafness) she arranges to have a very new and expensive piano brought to the house, and she tells Beethoven that everyone will be away and he can try it out. He does so, playing the Moonlight Sonata while his head is pressed against the top of the piano so that he can hear it as well as possible. Giulietta, along with her father ( Luigi Diberti), have been hiding an an adjacent room. She is so moved by his playing that she comes out of hiding, walks up to Beethoven without his seeing her, and touches him. Beethoven recoils in horror, shouting \"It is terrible to rob me in this way of my most treasured feelings\". It soon becomes clear to Giulietta and her father that Beethoven is deaf. Shortly afterwards, Giulietta married Count Gallenburg, another composer. Schindler returns to Vienna and runs into Ludwig's brother Johann, who reminds him that Ludwig cared only for himself, and wanted to control other people to keep them serving him. As a case in point, when the third brother Caspar ( Christopher Fulford) (who had died earlier) was to marry Johanna Reiss ( Johanna ter Steege), Ludwig expressed his strong disdain for the union, making extremely crude statements: \"By all means, copulate with her. But marriage? Every farmhand in the region has enjoyed her for free. Why should you pay more?\" Just after the marriage, Ludwig sends the police to their apartment, confronting them in bed and commanding the police to \"Arrest that whore\". Caspar shows the marriage license, and also explains that Johanna is pregnant. Ludwig becomes bitterly estranged from Caspar and Johanna for years after that. Johann explains to Schindler that Ludwig was just as strongly opposed to his own marriage to Therese, and just as abusive to them. Schindler's travels then take him to Hungary for a meeting with Countess Anna Marie Erdody ( Isabella Rossellini), who fills in a lot more of the history. She had been present during the disastrous premiere of the Emperor Concerto, in which Beethoven's deafness made him unable to keep the orchestra together, and hence the world first truly learned of his malady. Anna took him in at her palace, and they lived together for a few years. She said that those were probably the happiest years of both of their lives, that she loved him, but that Beethoven did not seem to truly love her. These years included the horrifying siege of Vienna by Napoleon's troops, during which one of Anna's three children was killed. Schindler himself takes up the flashback narrative at this point, continuing his conversation with Countess Erdody. He describes how he, as a budding violinist, first met Beethoven at a rehearsal of the \"Kreutzer\" sonata. And how Beethoven explained his ideas of the meaning of music, and that this particular piece is about a person trying to reach his lover by coach, but the coach broke down in bad weather, causing great despair. Schindler did not realize at the time that this was what would be described in the \"immortal beloved\" letter. During this period, Beethoven became convinced that his brother Caspar had taken some of his manuscripts, and went to confront him. They hadn't spoken in 8 years, and things started off well, until Ludwig started forcibly going through Caspar's papers, and also referring to Johanna as \"this foul slut you call a wife.\" A violent fight ensues, to the horror of Schindler, Johanna, and their 8-year-old son Karl ( Matthew North). When Ludwig leaves, Caspar is profusely coughing up blood, and in fact dies a few months later. At the interment, Ludwig remarks to Shindler that Johanna seems to be seeing another man already. \"My brother's bed is not yet cold and he is climbing in.\" Ludwig then takes legal action against Johanna, to take custody of Karl, on the grounds that she is of low moral character. Just before the police take Karl away, Johanna tells Karl not to believe anything that Ludwig says about her; it is all lies. Karl stays with Ludwig, who plans to make Karl into a great pianist. Ludwig relates to Karl that his own father had tried, unssuccessfully, to do the same with him, to make him the new Mozart. After Ludwig had failed at this, the flashback shows his father administering a brutal thrashing, and strongly suggesting that Ludwig's hearing loss had been caused by this. A further legal battle ensues because Ludwig suspects that Johanna is bribing people to allow her to visit Karl in secret. There is a highly public trial, and Beethoven even bribes Metternich ( Barry Humphries), by promising to write an oratorio for him, a promise that he never kept. Metternich intercedes on Beethoven's behalf, and he wins the case. Beethoven's squalid living style and generally disagreeable character are depicted at length. Karl, a young adult at this point ( Marco Hofschneider), had been scheduled by Ludwig to give a public piano recital, and he tells Schindler that he is \"at the end of his tether.\" He knows that he is a very mediocre pianist, but Ludwig, due to his deafness, can not, or will not, accept that. He also relates Ludwig's increasingly bizarre behavior, including incessantly singing some tune, claiming that is the motif of a grand symphony. Karl sings it (badly)---it's the main choral theme (Ode to Joy) of the 9th symphony. Schindler and Karl both go to Ludwig to talk him out of his plan. Beethoven verbally abuses Schindler, telling him to get out. Karl, truly at the end of his tether at this point, takes a dueling pistol and attempts to kill himself. He is a very bad shot, and injures himself but does not die. He is taken to his mother's upholstery shop. Beethoven and Schindler both go there. Karl writes to Beethoven (everyone was communicating with him by writing in notebooks or on small slates) \"Never show your face to me again\". Ludwig's desolation is complete. He is universally despised for what he had driven Karl to. He is shown being physically abused on the street by young hooligans, who beat him senseless. The scene ends with him lying unconscious in the street. WARNING: SPOILER COMING UP. The biographical flashbacks end. Schindler explains to Countess Erdody his reason for the visit; he needs to know who was the \"immortal beloved\" in the letter. The Countess says \"The letter was not written to me.\" \"Then who?\" \"It was she who came between us. He could not forget her.\" \"Who is she?\" \"The answer was always in front of you.\" She tells him, off camera, who she was. He gets into his coach, not knowing what to do. She says \"Go to her\". Schindler is then seen entering Johanna Reiss's upholstery shop. He asks to speak to her in private. She is quite cold to him, but he implores her. They go upstairs. He asks to see a sample of her handwriting. She continues to be hostile, but he persuades her. He then brings out the page from the hotel register and sees that the handwriting matches. She demands to know what that page is. \"A page from a hotel registry in Karlsbad, signed by you. Did you ever meet Ludwig in Karlsbad?\" \"You can hardly be unaware of the manner in which I suffered at his hands. I find the question as insulting as it is impudent. What are you implying?\" Her hostility eventually subsides, and she explains that she had made peace with him, in her own mind, because of the Ode to Joy (9th Symphony.) \"I could not hate the man who could write such music.\" The final three flashbacks follow. The first is the premiere performance of the 9th Symphony. Beethoven walks up on stage at some point (another conductor was at the podium), and stares blankly at the musicians, being unable to hear the performance. He becomes lost in a personal reverie. He is hearing the Ode to Joy in is mind during this. He recalls an incident as a child when he ran away from his violently abusive father. He runs through the woods while the 9th Symphony plays. (This scene solves the problem of depicting Beethoven's deafness while treating the audience to his music. He can't hear the concert, but the Symphony is played as he runs through the woods in his fantasy.) He finally reaches a small pond, and, just at the big crescendo of the Ode to Joy, lies down in the water and is shown in a cosmic oneness with the heavens. At the end of the cosmic scene, we are brought back to the concert hall. The Symphony has ended, though Beethoven doesn't realize it. The sound track has been turned off to depict his deafness. The audience is silently applauding, but Beethoven doesn't see them. Then the conductor turns Beethoven around, so he can see the audience, who leap to their feet with load and thunderous applause. In the second of the final flashbacks, Johanna visits Beethoven on his deathbed, and he writes out a document transferring guardianship of Karl back to her. They hold hands briefly in apparent awareness of their lost love. Finally, Johanna tells Schindler \"Yes, I once loved him. But he turned his back on me. I never heard a word from him. I was a fool. I never meant anything to him.\" \"But, the letter.\" \"What letter?\" After a long pause, Schindler realizes that she never saw the letter. He gives it to her. Schindler leaves, and we see her sobbing in the window as she reads Beethoven's letter to his immortal beloved. The slow movement of the Emperor Concerto is played one last time, with one last narration of the letter. The final flashback shows what had happened. My angel, my all, my other self ... If we could be united, we would feel this pain no longer ... Soon, we shall live together, and what a life it will be. All the time that Caspar was courting her, she was actually sleeping with Ludwig. He comes to visit Johanna at her upholstery shop. She is afraid that Caspar will catch them. He says that he can no longer skulk around like a guilty schoolboy. They agree to meet at a hotel in Karlsbad. She tells him that she is carrying his child. (That would be Karl!) She arrives at the hotel, but, because of a terrible storm, Beethoven is delayed. It is at this point that he writes the letter, and sends it on ahead of him. The journey was dreadful ... The coach had to go and break down on such a terrible road for no reason ... and now I am held up completely. The letter arrives, and Frau Streicher places it on a food tray, but nearly hidden under a plate of pastry. I have to see you ... However much you love me, I love you more. Johanna takes the lid off a tureen of not-very-appetizing stew, and becomes nauseous. (She is presumably experiencing morning sickness.) Because of that, the terrible storm, and the belief that Beethoven has stood her up, she despairs of the situation and checks out. She never sees the letter. I must go to sleep now. Be calm, love. Today, yesterday. What longing with tears for you. Beethoven arrives, sees that she has left, and goes on a destructive rampage. He then picks up the letter from the floor, not knowing that it had been nearly hidden. Since it had been opened, he assumes that she had read it and spurned him. While still in my bed, my thoughts turn to you, my immortal beloved ... I can live only completely with you, or not at all ... You're my life, my everything ... Go on loving me. Ever yours, ever mine, forever. In the final scene, Johanna visits Beethoven's grave, and the music turns from the pathos of the 2nd movement to the triumph of the 3rd.",
      "writers": ["Bernard Rose"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110116/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzE3NjQ4MTQyNV5BMl5BanBnXkFtZTYwOTU1MDg4._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gary Oldman, Jeroen Krabbé, Isabella Rossellini | See full cast and crew »"],
      "reviews": [
         "Ludwig van Beethoven was one of the greatest composers-- some would say THE greatest-- in the history of the world. But what of the man himself? His passions, his loves? The humanness behind the genius? `Immortal Beloved,' written and directed by Bernard Rose, examines the man behind the music in a dramatization focusing on the mystery behind a letter-- written by Beethoven-- found among his effects after his death in 1827. The letter bears no name or address, but was written to a woman to whom he refers as his `immortal beloved,' with nary a clue as to her identity. But in his final will, it is she to whom he bequeaths his estate, and it therefore falls to Beethoven's secretary, Anton Schindler (Jeroen Krabbe), to unravel the mystery and discover her identity. And as Schindler pursues his quest, a portrait of Beethoven, in his most human aspect, emerges. Reminiscent of the approach taken by Orson Welles with `Citizen Kane,' Rose presents a riveting study of the enigmatic genius that was Beethoven. He suggests a man driven by passion and ego, who was under appreciated during his lifetime (as great artists often are), and who grew bitter in the wake of the slings and arrows fate so surreptitiously hurled at him. The great irony of his life, of course, was the deafness that deprived him of the aural beauty of his own creation, an affliction Rose implies was brought about through the brutality of a drunken father who would beat his son about the head and ears (And in retrospect, what a testimony to his genius, that he could write such music in his head without ever hearing an actual note). As Beethoven, Gary Oldman gives an outstanding performance, one for which he should have received acclaim that somehow was never forthcoming. His ability to create a total character, with such incredible emotional depth as he does here, is astounding. It's puzzling as to why so many of his performances are overlooked, especially at Oscar time. Besides this film, consider his work in `Sid and Nancy,' or more recently in `The Contender.' He is simply a tremendous actor who has yet to have his day in the sun. As Beethoven, he so completely immerses himself in the character that his soul is veritably reflected in his eyes. You feel the silent world in which he was confined for most of his life, and it allows you to identify with the inner turmoil with which he had to cope and endure without respite. Most importantly, Oldman makes you feel that unabashed passion that motivated and drove Beethoven on. It's quite simply a remarkable performance. Turning in notable performances as well are Isabella Rossellini, as Anna Marie Erdody, one of the women in Beethoven's life who may or may not have been the one to whom the letter was intended, and Johanna ter Steege, as Johanna, Beethoven's sister-in-law and the mother of his beloved nephew, Karl (Marco Hofschneider). The supporting cast includes Miriam Margolyes (Nanette), Barry Humphries (Clemens), Valeria Golino (Giulietta), Gerard Horan (Nikolaus), Christopher Fulford (Casper), Alexandra Pigg (Therese) and Luigi Diberti (Franz). Beethoven's renown today, of course, exceeds even mythological proportions, which often facilitates the blending of fiction with fact. But with `Immortal Beloved,' whether or not the finer points are historically accurate or not is of little consequence, for at it's heart this is a love story that is engrossing drama that is altogether transporting. It's a memorable film, highlighted by Oldman's performance and, of course, the music. And there are a number of scenes, as well, that are unforgettable and demand mention. One depicting the debut performance of the `Ode to Joy,' and another in which the young Beethoven (played by Leo Faulkner) runs at night through the streets of the city to escape his drunken father (Fintan McKeown), coming at last to a lake, into which he wades to float on his back; and with the camera positioned directly above, looking down upon him, a billion stars are reflected in the water around him. Then slowly the camera pulls back until the young Ludwig blends with the reflected stars to seemingly take his place among all the brightest lights of the firmament. It's a scene that will leave you breathless and remain etched in your memory forever. And it's but one of the more astounding moments from an astounding motion picture that absolutely must not be missed. I rate this one 10/10.",
         "Once again, a film of such glory fell on deaf ears - no pun intended - in this country. I have spent hours reading reviews on this film, stating how awful it was, because it was not true to the real Beethoven's life.... Well, I believe that early on in my life, I learned about some- thing called \"Poetic License\"....and, in fact, this film IS, basically, a poem. The movie is BASED on a letter that Beethoven actually DID write, to his mystery lover. No one knows, for sure, who the woman really was. And, this is simply a beautiful interpretation of someone's dream of who she COULD'VE been. This was regarded as an AWFUL thing to do, by many Beethoven authorities - and by people who simply DOUBTED. Yet, what went overlooked because of these critics' lack of open-mindedness - was an exquisite blend of glorious music, and SUPREME acting. Once again, Mr. Oldman gave a performance like no other actor in the world can quite match. His style, sensitivity, and genius as the Tragic Beethoven, was magnificent. Jeroen Krabbe's portrayal of Anton Schindler, Beethoven's friend and champion - was marvelous. Johanna ter Steege - who portrayed Johanna, Beethoven's sister- in-law - was exquisite. Why did they ignore HER? It would've been nice to have her stay here, rather than return to her Dutch homeland - to become a major motion picture star, as well. She had one special attribute - she could ACT. The sets, costuming, sound, and editing were all BEAUTIFUL. But the film was ignored. Above all, however, Gary Oldman's performance ranked among the best in the world - but it, too, was ignored. Give the film another chance. It deserves FAR more than it GOT. It was, simply, beautiful...",
         "IMMORTAL BELOVED Aspect ratio: 2.39:1 (Panavision) Sound formats: Dolby Digital / SDDS-8 Following Beethoven's death, his closest friend (Jeroen Krabbé) goes in search of the composer's sole heir, an unnamed woman described as his 'immortal beloved' in a letter which betrays their secret love affair. Comparisons with AMADEUS (1984) are inevitable, but Bernard Rose's sumptuous biopic is in a veritable league of its own. The director's episodic screenplay relays events in flashback, as Beethoven - played with multilayered conviction by Gary Oldman - is inspired to new heights of artistic endeavor by the three women who dominate his life (Isabella Rosselini, Valeria Golino and Johanna ter Steege), and rendered increasingly bitter by encroaching deafness. Just as tellingly, Rose's handsome film details Beethoven's stormy relationship with a favored nephew (Marco Hofschneider), who was driven to extreme rebellion by the composer's overreaching ambitions. The music is arranged with exquisite grace by Georg Solti, conducting the London Symphony Orchestra: Standout episodes include the moment when Beethoven first plays the 'Moonlight Sonata', and the breathtaking 'Ode to Joy' sequence, framed against an unhappy memory from Beethoven's youth, which culminates in a moment of supreme cinematic glory, one of the most beautiful images this reviewer has ever seen. Vivid production design by Jirí Hlupý, expansive scope photography by Peter Suschitzky; filmed on location in Prague.",
         "This is one of my all-time favorite movies! I thought the music was well done, and I don't understand the criticisms I've read in this forum at all. The central idea of the movie is just one man's theory of who the \"immortal beloved\" was. No one knows who it actually was, and most theories I've read disagree with the film. No matter! I thought the premise was interesting, whether or not is was true. What was factual is that Beethoven WAS grouchy (wouldn't you be if you couldn't hear but music was your passion, your life??), and that he had digestive problems. Also factual was that he won custody of his nephew, Karl, and that his relationship with his brother's wife was antagonistic. The other people (countess Erdody, Schindler, etc) were factual people...of course any script written would have to put words in their mouths...big deal. I guess some people just are passionate about what their idea of the truth is (even though NO ONE KNOWS in this case) that they are blinded to the rest. The director is a Beethoven fanatic, and I found this movie to be a loving portrayal. Gary Oldman was absolutely fantastic! He learned to play the piano (spent months doing it) in order to be authentic. Thumbs WAY up on this one.",
         "'Immortal Beloved' opens with Beethoven's death, followed by his funeral attended by the mourning masses... Beethoven's final will and testament are found by the composer's mentor, Anton Felix Schindler (Jeroen Krabbé) who reads that all of Beethoven's music and fortune shall go to his sole heir, his secret passion, his immortal beloved... No one then, or now, knows who the 'immortal beloved' is... Director Bernard Rose decided it might be interesting to take a guess... So he framed his film in a puzzled story with Beethoven's confidante searching across Europe for clues... Determined not to rest until he discovers the maestro's greatest love, Schindler travels to see several ladies in an attempt to learn the identity of the woman who meant so much to Ludwig van Beethoven... Along the way, he meets with three candidates: Giulietta Guicciardi, Beethoven's attractive piano pupil, to whom Ludwig dedicated his 'Moonlight' sonata; Johanna Reiss, Beethoven's immoral sister-in-law, who 'could not hate the man who could write such music;' and Anna Marie Erdödy, the beautiful Hungarian Countess, who opened her heart to the German composer... All of the mentioned women loved Beethoven, and one of them could certainly be his angel, his all, his other self... With the use of the Ninth Symphony's \"Ode to Joy,\" there is a beautiful shot of young Ludwig floating in the firmament, lost thereafter between the luminous celestial bodies... Another scene is quite poignant of Beethoven, unaware even that the music had ceased, is also unaware of the tremendous burst of applause that greeted it... 'Immortal Beloved' is a love story which not only captures the ideas of early 19th century romanticism, but ultimately attempts to fasten the emotional state of the music to the events that Beethoven lived through... We are given a look into the composer's personality... Beethoven is seen impatient, impulsive, unreasonable and intolerant; deafness adds suspicion and paranoia to these attributes... We are invited to watch his treasured feelings... We are even touched by an artist who yearns to express himself creatively through music... He is an hostile, obstinate lover who would fly into a rage at the slightest provocation, but a sensible human being who carries the music in his heart, and whom the thorns of life had wounded so deeply... Like all pianists of the late 18th century, Beethoven is raised on the sonatas of expressive music at a time when music was regarded as the art of pleasing sounds... The dramatic scene of his 'Moonlight Sonata' communicated to a deafened ear, expresses all his emotional pain: We listen beautifully what he cannot... He reveals, through his delightful piece, his soul and the inner torment he is suffering... We perceive what the music is evoking in his mind... we also find that he is a temperamental lover who seeks to reach the perfect love... With finesse and style Gary Oldman stars as the first composer, always stubborn, unyielding and struggling against destiny... Oldman seems to feel the brave, the commanding, and the impetuous of the virtuoso pianist more than what is reassuring or gentle... The muscles of his face swell, and its veins start out... His wild eye rolls doubly wild... His mouth trembles as he looks overpowered with the character's deafness, strengthened by a stubborn nature... Set in Vienna, but exquisitely shot in and around Prague, 'Immortal Beloved' concentrates on Beethoven's women, his cruel battle for custody and control of his little nephew, his constant fight with himself, with the sound of agitation... 'Immortal Beloved' is a film enriched by a passion, drama and turbulence of an era... The scenery of the aristocratic palaces, elegant middle class town houses, churches and chapels, monuments and fountains are beautiful and exquisite... Beethoven's compositions (wonderfully performed by the London Symphony Orchestra) are splendid and voluptuous...",
         "Bernard Rose's superior film about the life of Ludwig van Beethoven takes as its central premise a mention in the composer's will of an 'immortal beloved', identity unknown. So far, so intriguing. With the casting of versatile British actor Gary Oldman as Beethoven, there was potential for a lot of depth of character (which we get, as the passage of time convinces throughout as Beethoven moves from skirt-chasing youth to crabby and deaf old age). Also impressive within the cast are Jeroen Krabbé as Schindler, Johanna ter Steege as Johanna Reiss, and Isabella Rossellini as Anna Marie Erdody. What could have been a stodgy film is buoyed up greatly by their presence, but it is the central performance of Oldman which counts (he really is a peerless performer of real-life characters - Sid Vicious, Joe Orton, Lee Harvey Oswald ...). My only gripe would be that the music is sometimes given short shrift, but when it is there, it is wonderful. You get the emotional impact in the snatches of sonatas, symphonies and concertos you hear - but it would have been nice to acknowledge that the film was about a creative artist and musician and let us hear a bit more of his work!",
         "Not quite as dramatic as AMADEUS, to which there are obvious comparisons, it is a powerful film in its own right. Taking the mysterious letter which Beethoven wrote to his \"Immortal beloved\" as the starting point, we follow his secretary's attempt to identify the person to whom the letter is addressed. No one knows, to this day, who that person really is, but the film offers an interesting theory. The letter, however, is just a device to tell the story of the wild genius who personifies the Romantic movement in art. The letter serves much the same purpose as does Rosebud in CITIZEN KANE -- a method of stringing together a series of flashbacks that reveal the personality of the central figure. The acting is wonderful and the music is powerful.",
         "I loved this in the theatre and recently purchased it on video. Gary Oldman portrays Beethoven with all the warts, near-madness, rage and passion intact. Unlovable almost, except for the sympathy and compassion engendered by his deafness which humanizes him. The music is wonderful here and tries to explain the emotions behind the man. The McGuffin of the plot hinges on a letter that was never received by his \"immortal beloved\". I may have missed something along the way, but how did the narrator of the story get the letter ? That point aside, this is a well done story and captures the era perfectly. I believe Prague was used for the setting and it is beautiful. This movie could be a matched set to \"Beethoven Lives Upstairs\" another film which captures his turbulence and frustration and the triumph of his composition of his 9th. An 8 out of 10 for a very enjoyable movie.",
         "On his deathbed, Beethoven, the greatest of all composers, leaves a note to his \"Immortal Beloved.\" Like Citizen Kane's \"Rosebud,\" this becomes a device to see the life of Beethoven through flashbacks. This interesting mixture of fact and fiction provides a portrait of the composer's social life but sheds little light on his genius for writing music. The soundtrack is all Beethoven (except for a little Rossini), as we get to hear bits and pieces of many of his works. The \"Ode to Joy\" sequence is well done, juxtaposing the premier of the 9th Symphony with flashbacks to Ludwig's childhood. However, the disjointed structure makes for a somewhat unsatisfying experience. Oldman certainly looks like Beethoven and manages to convey the anguish of a man who never heard most of his greatest works due to deafness, the most cruel fate for a composer.",
         "The life of Beethoven was a fascinating one and while Immortal Beloved is not entirely accurate at times, it matters not. The movie merely portrays the music. Its sole purpose, seemingly, is to show the passion of this man via his music. This is the only instance that I can think of where the screenplay and plot were manipulated to fit with the music and not the other way around. Oldman gives an outstanding performance. He evokes passions similar to those conjured by Beethoven's music. He was the perfect choice for the role. I cannot praise this movie enough without sounding like an executive from Columbia Tristar. Watch the movie. Some scenes are simply inspirational."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "Icon Entertainment International",
         "Majestic Films International"
      ],
      "summaries": [
         "The life and death of the legendary Ludwig van Beethoven. Beside all the work he is known for, the composer once wrote a famous love letter to a nameless beloved and the movie tries to find out who this beloved was. Not easy as Beethoven has had many women in his life.",
         "Ludwig van Beethoven dies and his assistant/friend Schindler proceeds to deal with his affairs (last will and testament). There is a question as to who really is his \"immortal beloved\", and so tries to find out who this might be."
      ],
      "budget": 0
   },
   "movielensId": 249,
   "movielens": {
      "languages": [
         "Italiano",
         "English",
         "Deutsch"
      ],
      "releaseDate": "1994-12-16",
      "dvdReleaseDate": "1999-10-05",
      "directors": ["Bernard Rose"],
      "runtime": 121,
      "movieId": 249,
      "title": "Immortal Beloved",
      "mpaa": "R",
      "actors": [
         "Gary Oldman",
         "Jeroen Krabbé",
         "Isabella Rossellini",
         "Johanna ter Steege",
         "Marco Hofschneider",
         "Miriam Margolyes",
         "Barry Humphries",
         "Valeria Golino",
         "Gerard Horan",
         "Christopher Fulford",
         "Luigi Diberti",
         "Michael Culkin",
         "Sandra Voe",
         "Bernard Rose",
         "Alexandra Pigg",
         "Michael Culkin",
         "Donal Gibson"
      ],
      "imdbMovieId": "0110116",
      "originalTitle": "Immortal Beloved",
      "genres": [
         "Drama",
         "Music",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "d2e5Siu8E1k",
         "vwEwAKfkWe8"
      ],
      "plotSummary": "The life and death of the legendary Ludwig van Beethoven. Beside all the work he is known for, the composer once wrote a famous love letter to a nameless beloved and the movie tries to find out who this beloved was. Not easy as Beethoven has had many women in his life.",
      "tmdbMovieId": 13701,
      "avgRating": 3.67037,
      "releaseYear": "1994",
      "numRatings": 5218,
      "posterPath": "/meRFVzGpBJiObWfdtOoNr0UPsP4.jpg"
   }
}