{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "hidden camera",
            "id": 3979
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "reality show",
            "id": 10328
         },
         {
            "name": "mockumentary",
            "id": 11800
         }
      ],
      "imdb_id": "tt0138987",
      "video": false,
      "title": "20 Dates",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Myles",
               "gender": 0,
               "credit_id": "52fe4b02c3a36847f81ed6e9",
               "name": "Myles Berkowitz",
               "profile_path": null,
               "id": 162102,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4b02c3a36847f81ed6ed",
               "name": "Tia Carrere",
               "profile_path": "/s2y4Hj7ZIuEMyE0W3o8WCVcHwiL.jpg",
               "id": 13445,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Elisabeth",
               "gender": 0,
               "credit_id": "5485e76f9251416a6c003602",
               "name": "Elisabeth Wagner",
               "profile_path": null,
               "id": 1396573,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "The Agent",
               "gender": 0,
               "credit_id": "5485e77c9251416a6c003607",
               "name": "Richard Arlook",
               "profile_path": null,
               "id": 1371374,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "5485e789c3a3686767001a35",
               "name": "Robert McKee",
               "profile_path": null,
               "id": 27204,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Voice of the Producer (voice)",
               "gender": 2,
               "credit_id": "5485e7979251416a7200328e",
               "name": "Elie Samaha",
               "profile_path": null,
               "id": 18691,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4b02c3a36847f81ed6f3",
               "name": "Myles Berkowitz",
               "profile_path": null,
               "id": 162102,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b02c3a36847f81ed6f9",
               "name": "Elie Samaha",
               "profile_path": null,
               "id": 18691,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe4b02c3a36847f81ed6ff",
               "name": "Tia Carrere",
               "profile_path": "/s2y4Hj7ZIuEMyE0W3o8WCVcHwiL.jpg",
               "id": 13445,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b03c3a36847f81ed705",
               "name": "Mark McGarry",
               "profile_path": null,
               "id": 977559,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b03c3a36847f81ed70b",
               "name": "Jason Villard",
               "profile_path": null,
               "id": 1052873,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4b03c3a36847f81ed711",
               "name": "Myles Berkowitz",
               "profile_path": null,
               "id": 176253,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.436095,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 111794,
      "vote_count": 3,
      "budget": 0,
      "overview": "Myles is divorced in L.A. He wants a love life and a film career. So he decides to go on 20 dates and find true love in front of a camera, making his first feature. His patient agent, Richard, finds a $60,000 investor, the shadowy Elie. Myles starts his search, sometimes telling his date she's being filmed, sometimes not. Elie wants sex and titillation, Myles wants it \"real.\" Myles regularly talks with his old film teacher, Robert McKee, who wonders if love is possible in modern life. Half-way through the 20 dates, Myles meets Elisabeth; she's everything he desires and she likes him. Can he finish the 20 dates, satisfy Elie, and complete his film without losing Elisabeth?",
      "similar": [
         37165,
         318846,
         371638,
         274479,
         11202,
         45317,
         276907,
         462,
         640,
         769,
         5915,
         324786,
         389015,
         407445,
         363676,
         396371,
         323677,
         228970,
         328589,
         11216
      ],
      "original_title": "20 Dates",
      "runtime": 87,
      "poster_path": "/9VpMRZCUtfdCg47I2uI8EgYorLg.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Phoenician Films",
            "id": 3901,
            "origin_country": ""
         },
         {
            "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
            "name": "Fox Searchlight Pictures",
            "id": 43,
            "origin_country": "US"
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-01-01",
      "vote_average": 3.3,
      "belongs_to_collection": null,
      "tagline": "A comedy so real you'll think it's fiction.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Myles Berkowitz"],
      "runtime": 87,
      "synopsis": null,
      "writers": ["Myles Berkowitz"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138987/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MTIyMzI1Ml5BMl5BanBnXkFtZTYwNzg1Mzk5._V1_SY313_CR1,0,214,313_AL_.jpg",
      "actors": ["Stars: Myles Berkowitz, Elisabeth Wagner, Richard Arlook | See full cast and crew »"],
      "reviews": [
         "I guess I'm the oddball here since the average rating for this movie on Imdb is 5.6. But, I found it difficult to lose interest. I was sincerely interested in the next date. I was sincerely interested in whether the movie would get completed. And, I cared whether or not he would get his girl. I'm not sure why the average viewer didn't like the movie any better except that most people don't like documentaries - which this was. However, it was a personal story that had a lot of true drama. No recreations. No embellishments. Actual events and actual persons. The fact that it had a convenient place to start - Date #1 and a convenient place to end - Date #20, made it all the more appealing. I've always believed that a camera following a real person around documenting a particular achievement from beginning to end would make interesting video - and this is proof from my perspective. You need to realize it isn't like a \"normal\" movie, but I found it very entertaining and well worth the time.",
         "The summary is a bit redundant: Mockumentaries, as a genre, are fairly quirky. In this case, recently divorced Myles, also a wannabe filmmaker, decides to make a documentary about trying to find true love in L.A. He commits to going on 20 dates and recording the results. Unfortunately, halfway through, he falls in love with one of his dates and now has to figure out how to complete the project without alienating his new love. What makes this different from standard mockumentaries -- and what some of the other IMDB reviewers seem to be missing -- is that, while it's clear that the final film isn't a true account of the events (some of the dates are obviously faked, and Elie the villainous producer can't really be THAT evil), it isn't so clear whether Myles Berkowitz (credited as writer and director, as well as star) started out with a serious intent to make a documentary, or whether it was meant to be fiction from the outset. Most of the evidence points to Berkowitz' initial sincerity. This *is* his only film (except for a bit part in \"No Small Affair,\" 16 years before this movie), and Elie *is* listed as Executive Producer. The official budget *is* the stated $60K. Most of the early dates seem real -- it's only the later ones that start to feel scripted, especially the feminist ballerina. One thing that gives this movie its charm, then, is that while Myles (the character) fumes about the way in which his original vision for the movie is eroding away from pressure from Elie, Berkowitz (the filmmaker) seems to be going through the same genuine quandary for a different reason -- it didn't take his full 20 dates to find love, and NOW what's he supposed to do? The cover job is both charming and disorienting: He goes back over the old footage and edits it so it looks like it could have been a mockumentary from the start, but plays it from the hip so it looks like a mockumentary pretending to be a documentary. Wouldn't Robert McKee be proud? Others might not have the same sense of pride. The film will come off as either a clever if ham-fisted attempt to make lemon footage into lemonade, or a pretentious and annoying trip into the avenues of Independent Film by a blind drunkard. Viewer's choice, and it seems to depend on what the viewer thinks of Myles: Is he annoying, or is he cute? I thought he was cute, and while the film is hardly a classic, it's worth a try. Look for it on cable (that's where I found it), and if you're sick of it after half an hour, turn it off and not much lost.",
         "One thing i dont like about film like these , Mokumenteries, if you like is the fact that i so wanted it to be real yet i knew that it was all acted and wasn't real at all. 20 dates is a good little film that does have a real feel about it without it ever hitting the comedy documentary heights of ,lets say,The Ruttles or Spinal Tap. Myles Berkowits makes this film watchable with his narration of the so called dates even though it does get a little monotinous and the last 15 minutes are a bit of a cop out. The interaction with the funder of the movie are funny as is the most of the diologue but the thing that does let this film down are the dates themselves! They just arent that interesting.Perhaps that is because they all involve people from L.A they are very shallow people in my eyes. Not all bad though. 6 out of 10.",
         "I saw this movie tonight on the Fox Channel and immediately had to find more info on it here at IMDB. I was shocked to find comments like \"an irresponsible failure of a mockumentary.\" What was the reviewer thinking? Has this person ever been on a date? Has he had his funny bone surgically removed? Undeniably a very funny film in a mix of comedy and real life. I had heard about this movie the first time when it had won the award at the Slamdance Film Festival, and thought it would be an interesting movie to see, and... I was right! I loved this movie! The style is definitely independent in nature as it takes a new look at the style of documentaries and entertainment. \"20 Dates\" is a very adept look at dating in LA... honest, raw, and true. To make it entertaining, Myles Berkowitz even pokes fun at sleazy film makers via an underlying 'Mafia style' producer who you never see on film, but you definitely hear him with his threats of broken body parts and an accent straight out of Brooklyn. This movie should be on your list of must see.",
         "Malarkey is the best word to describe this trashy film. Presenting itself as a documentary on one man's search for love in LA (yawn), the film is even more about the trials of trying to get this movie finished. Myles Berkowitz in the man in charge here. He wrote it, stars in it, and directs the film. To say that his presence is unpleasant is being nice. I cannot imagine anyone finding this guy attractive, and yet the film never shows that either. Knowing beforehand that most of this picture was staged doesn't help the matter any better. Berkowitz never mentions that part of his film is faked. Although I usually don't care about cursing in films, I couldn't help but be very sickened that such a light-hearted movie would have such a plethora of F-words. Most of the people on-screen are dreadful human beings, and I question Berkowitz to why he must follow a dream that he so obviously isn't cut out for. It's like being nail-gunned to a wall at a party you cannot bear. The best moments are suspiciously off camera, which might be accounted for in the \"I made this up\" part of the documentary. Loathsome to say the least, I hope Berkowitz never gets behind a camera again.-------- 1",
         "Filmed in a documentary style, but you can pretty well tell participants had been coached. A recently divorced wannabe film maker(Myles Berkowitz)sees a chance to liven up his love life and step into the movie biz at the same time. He intends to make a documentary piece about finding love by filming twenty dates including ramifications. The comedy is spotty at best; the rest is mishap after mishap. Also taking part are Richard Arlook, Robert McKee and the enticing Elisabeth Wagner. Trying for credibility the fetching Tia Carrere is talked into a cameo. This will suffice as a handbook on how NOT to get a satisfactory date.",
         "Myles Berkowitz is newly divorced after his 10-month marriage ended badly. He also is keen to make his debut film that will launch his movie career. He decides to combine the two biggest failures of his life - his film `career' and his love life to make a film about the real search for love in LA. He sets out to film 20 dates to capture the moment where two people fall in love. However he is in for a rocky road - not only does he have trouble with his dates but the guy funding his film wants it to be something other than what Myles envisages it to be. This film was made on the cheap and is a mix of documentary and mockumentary; there is no way that all the stuff in this film is real - certainly I never accepted that Elie the producer was the character that the film painted him to be. However, the majority of it seems to be relatively real and the majority of it is funny - which is the important thing here. Forget Myles arty pretensions about filming true love as it happens, the point here is wit and fun. The film is a very particular type of wit and if you're not into it then it is likely that you will hate the film; for me I really enjoyed the light humour of the whole piece and found it amusing even if I wouldn't call it hilarious. I really liked the invention of some parts of it: the comparisons of the budget in military terms (his film would be the equivalent of one French soldier surrendering to whoever it happens to be at war with), the stuff around Elie, the `meetings' with his agent etc. In fact most of the funny stuff is staged - and it is for the best. If I was being cynical I would question whether or not 95% of the film was scripted and acted as natural. But it didn't bother me because I found it funny. Myles himself is a strange guy; he is quite abrasive and pretty unpleasant at times and is a bit of a jerk. He definitely doesn't deserve Elisabeth but it is easy to be amused by his cruel humour at times. He holds the attention pretty well when he is on dates, but as an actor I didn't think much of him: at one point we learn he refused an offer for a script on the basis that he would only sell it if he could star - he really needs to focus on writing as neither directing or acting appears to be his thing on the basis of this. The support crew are hilarious. Myles sound guy and cameraman are funny when they have the chance, while both Richard the agent and Elie are hilarious and don't mind sending themselves up! Overall, treat this film as a comedy rather than a documentary - large chunks of it are staged, but it actually helps the film. It is very rough but it is different and quite enjoyable; it is funny in witty ways and it is funny in inventive ways and both styles work really well. It is not a perfect film (Myles' comes across like a daytime tv presenter at times) but it is fun; and that's all I was really looking for.",
         "this is one movie that i wasn't sure i'd be interested, but i ended up watching it and laughing out loud. its a sweet change from the norm. i highly recommend this movie to anyone that enjoys comedies, independant movies, and/or romance. it's a great laugh, definatley worth watching more than once. i enjoyed it immensely, and so have everyone i have referred it to.",
         "OK, instead of reviewing the film, I'd rather review three of the ladies dated in this film. (1.) The pretty blonde who 'graded up' from the 1.5 to the 3-pound lobster might want to learn the concept of the 'Dutch treat' (2.) I might have stopped production my own film if it was going to jeopardize present and future dates with the lass who contacted federal authorities and got a 'restraining order' once it was revealed that the date was being filmed. I think the two of them were actually 'clicking', something that wasn't occuring often. Therefore Myles should have opted for a great end to the date with this classy gal over what actually did occur. (3.) I have to admit I got myself smitten over Elisabeth over the course of the movie. I'd have had to call it '17 Dates' and keep my relationship strong, sorry Myles. I also can't believe that his 'pushing it' tendencies have kept her in his clutches to 2003 and beyond, so, Lizzie, if you're reading this... Maybe you'd like a (free) charcoal portrait of yourself ? I draw professionally in Nebraska. -David.",
         "If you are going to make a mockumentary (and sorry, folks, but that is exactly what this movie is), then make it obvious. Spinal Tap. Don't fake something and then shoot it as if it is real. It goes against the old adage \"truth is stranger than fiction\". If you are going to write fiction, then don't try to make it 100% believable. What is the point? Again, it has been shown that this is not a true documentary. There are things that would be easily verifiable had all this really occurred. Things (marriage licenses, hospital records, restraining orders, etc) would be public record. None of these records exist."
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Phoenician Films"],
      "summaries": [
         "Myles is divorced in L.A. He wants a love life and a film career. So he decides to go on 20 dates and find true love in front of a camera, making his first feature. His patient agent, Richard, finds a $60,000 investor, the shadowy Elie. Myles starts his search, sometimes telling his date she's being filmed, sometimes not. Elie wants sex and titillation, Myles wants it \"real.\" Myles regularly talks with his old film teacher, Robert McKee, who wonders if love is possible in modern life. Half-way through the 20 dates, Myles meets Elisabeth; she's everything he desires and she likes him. Can he finish the 20 dates, satisfy Elie, and complete his film without losing Elisabeth?",
         "A documentary type film about the dates Myles has gone on as he tries to find out how to find love in the future."
      ],
      "budget": 60000
   },
   "movielensId": 2492,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": null,
      "directors": ["Myles Berkowitz"],
      "runtime": 87,
      "movieId": 2492,
      "title": "20 Dates",
      "mpaa": "",
      "actors": [
         "Myles Berkowitz",
         "Tia Carrere",
         "Elisabeth Wagner",
         "Richard Arlook",
         "Robert McKee",
         "Elie Samaha"
      ],
      "imdbMovieId": "0138987",
      "originalTitle": "20 Dates",
      "genres": [
         "Romance",
         "Comedy"
      ],
      "youtubeTrailerIds": ["mSYRStcl1uo"],
      "plotSummary": "Myles is divorced in L.A. He wants a love life and a film career. So he decides to go on 20 dates and find true love in front of a camera, making his first feature. His patient agent, Richard, finds a $60,000 investor, the shadowy Elie. Myles starts his search, sometimes telling his date she's being filmed, sometimes not. Elie wants sex and titillation, Myles wants it \"real.\" Myles regularly talks with his old film teacher, Robert McKee, who wonders if love is possible in modern life. Half-way through the 20 dates, Myles meets Elisabeth; she's everything he desires and she likes him. Can he finish the 20 dates, satisfy Elie, and complete his film without losing Elisabeth?",
      "tmdbMovieId": 111794,
      "avgRating": 2.80094,
      "releaseYear": "1998",
      "numRatings": 849,
      "posterPath": "/9VpMRZCUtfdCg47I2uI8EgYorLg.jpg"
   }
}