{
   "tmdb": {
      "original_language": "de",
      "keywords": [
         {
            "name": "berlin",
            "id": 220
         },
         {
            "name": "jew",
            "id": 2606
         },
         {
            "name": "nazi",
            "id": 2652
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "anti semitism",
            "id": 10144
         }
      ],
      "imdb_id": "tt0128133",
      "video": false,
      "title": "Comedian Harmonists",
      "recommendations": [
         159,
         9690,
         852,
         9565,
         9628,
         63065,
         11691,
         9601,
         2241,
         6547,
         10626,
         1661,
         4326,
         2265,
         3539,
         9375,
         1964
      ],
      "backdrop_path": "/omvONkpRzqxhO8r3NMiewdUJ4Gk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Biberti",
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b7653",
               "name": "Ben Becker",
               "profile_path": "/qmJjjvIpNJQs0Gvd4RPPQod2ymv.jpg",
               "id": 14633,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Roman Cycowski",
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b7657",
               "name": "Heino Ferch",
               "profile_path": "/g8NRSFfRxGXutPCmgfjf4ouTpDn.jpg",
               "id": 1086,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Harry Frommermann",
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b765b",
               "name": "Ulrich Noethen",
               "profile_path": "/9csrG13luF7el71hBcpnCBDFojl.jpg",
               "id": 8799,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Erich A. Collin",
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b765f",
               "name": "Heinrich Schafmeister",
               "profile_path": "/xytLnIYUodtW3i4Enj2X7V0wnnI.jpg",
               "id": 3742,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Ari Leschnikoff",
               "gender": 0,
               "credit_id": "52fe4504c3a36847f80b7663",
               "name": "Max Tidof",
               "profile_path": "/yj5bNsyCtdV8ASLbOuJhgcVw1i6.jpg",
               "id": 52103,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Erwin Bootz",
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b7667",
               "name": "Kai Wiesinger",
               "profile_path": "/3hN0WXbst1HbVnO0YAmoo68fuYC.jpg",
               "id": 1876,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Erna Eggstein",
               "gender": 1,
               "credit_id": "52fe4504c3a36847f80b766b",
               "name": "Meret Becker",
               "profile_path": "/104ahKJHYJtZAPZHHJFAoJQkuuv.jpg",
               "id": 8790,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mary Cycowski",
               "gender": 1,
               "credit_id": "52fe4504c3a36847f80b766f",
               "name": "Katja Riemann",
               "profile_path": "/sPvCj1IxlhjI61BVlIuwsXuXEl7.jpg",
               "id": 1874,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Julius Streicher",
               "gender": 2,
               "credit_id": "53467353c3a3682f0400105b",
               "name": "Rolf Hoppe",
               "profile_path": "/uTNYbd1ibnDwrmnb6LTv8aozkt4.jpg",
               "id": 6270,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Ursula Bootz",
               "gender": 1,
               "credit_id": "5346736ec3a3682f1200113f",
               "name": "Dana Vávrová",
               "profile_path": "/tpAR19LzoIG8UAPowcTmfoVP9kq.jpg",
               "id": 14632,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b7675",
               "name": "Joseph Vilsmaier",
               "profile_path": "/wODSEku2wnqYiDfMKiANzX5bE2K.jpg",
               "id": 14614,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4504c3a36847f80b767b",
               "name": "Jürgen Egger",
               "profile_path": null,
               "id": 57826,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 0,
               "credit_id": "52fe4504c3a36847f80b7681",
               "name": "Klaus Richter",
               "profile_path": null,
               "id": 57828,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b7687",
               "name": "Reinhard Klooss",
               "profile_path": null,
               "id": 57035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b768d",
               "name": "Danny Krausz",
               "profile_path": null,
               "id": 14616,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4504c3a36847f80b7693",
               "name": "Peter Sterr",
               "profile_path": null,
               "id": 11942,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b7699",
               "name": "Joseph Vilsmaier",
               "profile_path": "/wODSEku2wnqYiDfMKiANzX5bE2K.jpg",
               "id": 14614,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b769f",
               "name": "Harald Kloser",
               "profile_path": null,
               "id": 5430,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b76a5",
               "name": "Joseph Vilsmaier",
               "profile_path": "/wODSEku2wnqYiDfMKiANzX5bE2K.jpg",
               "id": 14614,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b76ab",
               "name": "Peter R. Adam",
               "profile_path": null,
               "id": 703,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe4504c3a36847f80b76b1",
               "name": "Hanno Huth",
               "profile_path": null,
               "id": 17732,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.976664,
      "production_countries": [
         {
            "iso_3166_1": "AT",
            "name": "Austria"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 9524,
      "vote_count": 16,
      "budget": 0,
      "overview": "Comedian Harmonists tells the story of a famous, German male sextet, five vocals and piano, the \"Comedian Harmonists\", from the day they meet first in 1927 to the day in 1934, when they become banned by the upcoming Nazis, because three of them are Jewish.",
      "similar": [
         424,
         16869,
         613,
         423,
         2253,
         11202,
         227306,
         228150,
         289222,
         323677,
         31900,
         1771,
         15121,
         5925,
         203833,
         14574,
         637,
         324786,
         205596,
         399404
      ],
      "original_title": "Comedian Harmonists",
      "runtime": 126,
      "poster_path": "/2NgC92vmBbf7BXIB0ZRUHywZV0v.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Beta Film",
         "id": 1080,
         "origin_country": ""
      }],
      "release_date": "1997-12-25",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Germany",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Joseph Vilsmaier"],
      "runtime": 126,
      "synopsis": null,
      "writers": [
         "Jürgen Büscher",
         "Klaus Richter"
      ],
      "originalLanguage": "German",
      "imdbLink": "http://www.imdb.com/title/tt0128133/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzk0NTc4NDU0M15BMl5BanBnXkFtZTcwNjg4NjYxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Becker, Heino Ferch, Ulrich Noethen | See full cast and crew »"],
      "reviews": [
         "Taken at face value, one would think that a film about a singing group called the \"Comedian Harmonists\" in the Berlin of the nineteen twenties, would be dull indeed. Not so.At two and a half hours, not once did my attention wander.The director, Joseph Vilsmaier, does such a magnificent job of telling the story of this very popular, German singing group, that I would have liked to have been there to hear them in person.The hedonism of Berlin in the twenties. The rise of the 'Brown Shirts', the vilification of the Jews, Vilsmaier captures it perfectly, without stooping to mawkish sentiment.Of course, this film is more than just a film about a very popular singing group. It's also about the evils of national-socialism, allowing men like Streicher (one of Hitler's most vicious jew-baiters - even the top Nazis didn't like the man), to grow and flourish. The look of the period is excellent. Each character is deftly drawn, while still not losing sight that primarily,it was a group. There's a wonderful scene towards the end where the 'Harmonists' sing in front of thousands of sailors. Tremendously stirring! One quibble: the Algonquin Hotel in New York, where the Harmonists stay, was not, as far as I know, located down near the Brooklyn Bridge.But that shouldn't detract anybody from going to see this wonderful film.",
         "Comedian Harmonists The Comedian Harmonists was a wonderful film that I would recommend to anyone who doesn't mind watching a foreign film. This is a true story about a German musical group of six men. They are a comical group that based their style on a popular American group, the Revelers. The Comedian Harmonists gained their fame and popularity during the time when Hitler came into power. These men were loved by all even the Nazi soldiers, but ironically three of the six men happened to be Jewish. And just like the rest of the Jewish of people during Hitler's rule, they were not able to continue to lead their normal lives, celebrities or not. You see spectacular scenes in this film were the group performs and you get good examples of the harsh treatment of the Jews by the Nazi. There is a love triangle with in the group that brings out a steady stream of character development. This with the racial segregation makes all of the character come to term with their futures. There was a wonderful performance by the entire cast; I could not imagine any other actors or actress for the roles. The lighting and sound of the movie was good, with great shots to go with them. Overall this is a wonderful film.",
         "One of the finest German films I've had the pleasure of seeing, 'Comedian Harmonists' tells the true story of a sextet of male singers who form a very famous group in Berlin when Hitler's Socialist party is just starting to get powerful. Of the six, three of them happen to be Jewish, which puts a dampener on their future when it's decreed that only Aryan entertainers will be allowed to perform in Germany. With a love triangle thrown in the mix, as well as the confusion of this almost sudden racial division, the members struggle to really come to terms with their future together. There are some chilling moments involving the hypocritical Nazis, indulging in some ironic entertainment care of the Comedian Harmonists, as well as some great musical segments. With some great performances from the entire cast - the stand outs are Ulrich Noethen as Harry Frommermann and Meret Becker as Erna - the film is a joy to watch, especially the wonderful musical sections, which at first I found to be tedious but then seemed to lift the film. Go figure. Joseph Vilsmaier, director of the excellent 'Stalingrad', has crafted a very entertaining film in this at times funny, joyous and very moving picture. (Watch for the ending - sentimental it may be, but it's very sad, IMO.) Recommended.",
         "Throughout the 30s and 40s, everyone in Germany loved the Comedian Harmonists when they came over the radio, although it must have been the follow-up group rather than the original one. It is interesting and moving to see that original group and hear their songs again; and it illuminates once more the idiocy of the Nazis to silence and drive away such worthwhile people who felt as, and wanted to be, good Germans. However, their confrontation with the Storm Troopers as shown in the movie, and presumably taking place in 1933, is an unfortunate exaggeration, because window smashing and physical abuse did not occur that early during the Nazi regime. Also, railway stations were not adorned with giant swastika flags - they would have turned black quickly from the soot of the steam engines. There was no need by the producers to deviate on these points from the historical accuracy - a deviation that throws a somewhat questionable light on the rest of the story. Yet these producers did manage to find five men who sing beautifully, with the same perfection and tonal range of the Comedian Harmonists, which makes this film eminently enjoyable after all.",
         "Excellent example of how politics should stay out of art (e.g. Shostakovich in Stalin's time and blacklisting of artists in US in McCarthy era). This movie draws the viewer in - what will happen to the members of the group? Will they survive Hitler's Germany? Realistic portrayals of both squabbling and camaraderie that exists inside creative groups. Well-photographed in proper time period fashions and decor, music pleasing to the ear. A real treat!",
         "I love this movie, it is a wonderful movie. I cried when the Comedian Harmonists had to make their last show and they sang \"Auf Wiedersehen, my dear\". A fantastic movie with many beautiful songs, \"Mein kleiner grüner Kaktus\" or \"Irgendwo auf der Welt\", just to mention two. See this movie!!!!",
         "Comedian Harmonists is truly a masterpiece! It shows that many Germans suffered under Hitler and the nazi regime too! But I can't understand why this great movie is rated R in US? The German rating is 6(!)! In my opinion especially young children should watch \"Comedian Harmonists\" to learn more about humanity and the hard life in hard times.",
         "I had never heard of the group The Comedian Harmonists before seeing this film, but they were truly awesome musicians. This film seamlessly blends the actual recordings of the group with wonderful acting and directing to create a true classic. The R rating is a bit too strong, in my opinion, and should be closer to PG-13. The film features mature themes but would be suitable for viewing by most audience members aged 11 and above, with parental guidance of course. Anything of a mature nature in the film is strictly secondary to its real story and was not presented lewdly in any way. You will want to talk about the subject matter with the kids, ie: the effects of prejudice and how Hitler, seemingly on a quest to create perfection and beauty, by trying to play God (which none of us have the right to do), actually destroyed so many beautiful things which were meant to be here to enrich all life. I won't use any plot spoilers but I can tell you there were no dry eyes left in the room at the end. Truly worth seeing and the soundtrack is one of the best I've heard in a long time. Bravo!",
         "The film, Comedian Harmonists, give us a different and evolving look at the effects of the racist policies of national socialism. It showed, better than I've seen, the slow, subtle changes in behavior and attitudes of both the oppressor and the oppressed --- the denial, then realization, that this could and is happening. This evolution made even more believable because this a true story about six very talented people, three of which who are Jewish, who form a musical group in 1927 in Berlin. As national socialism cements its hold on Germany, external pressure is brought on the group for containing Jewish members resulting in internal pressures within the group. The interpersonal relationships made for a compelling story. Add to this a great love story, good acting, fantastic musical score, and interesting people you come to care for, and you have a great movie. Since the film \"finishes\" in 1934, I particularly enjoyed the follow up at the end telling what happened to each of them. For a fascinating look at anecdotal history, I highly recommend that you see this film. Three and a half stars!!!",
         "This beautiful set movie shows the interesting and problematic situation of (musical) artists in Germany and later on of most European states between the world wars. Best actors (Heino Ferch, Ben Becker, Kai Wiesinger and premiere of Ulrich Noethen) guarantee fun between the songs. The actresses (Katja Riemann, Meret Becker (sister of Ben, here lover) and Dana Vavrova (director's wife)) could show more of their capabilitis if the movie would have been longer. The True history makes it very interesting and the director Joseph Vilsmaier is on same level as the other germans: W. Petersen and R. Emmerich. The music cannot be better: It is the original (technically repaired)."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Bavaria Film",
         "Beta Film",
         "Parathon"
      ],
      "summaries": [
         "Comedian Harmonists tells the story of a famous, German male sextet, five vocals and piano, the \"Comedian Harmonists\", from the day they meet first in 1927 to the day in 1934, when they become banned by the upcoming Nazis, because three of them are Jewish.",
         "Berlin, Germany, 1927. Harry Frommermann is a poor, but talented musician writing his own pieces and dreaming of the big success. When he goes to the store nearby and listens to new records he is so deeply fascinated by the tunes that he doesn't even realize that Erna, the young employee, adores him. When the day comes where he can barely afford the food for his parrot, it is time to do something about his situation. He launches a newspaper ad looking for company to found a singing group. He gets to know Robert Biberti and both seem to be on the same level. Soon four other fellows are found. A concept evolves and rehearsal begins.",
         "Berlin in 1928: Young actor and musician Harry Frommermann has the idea of creating a German version of the American a-cappella band \"The Revellers\". He then publishes an advertisement in a newspaper and soon has formed a group out of singers Robert Biberti, Erich Collin, Ari Leschnikoff and Roman Cyckowski as well as pianist Erwin Bootz. After a long time of rehearsing and failures \"The Comedian Harmonists\", as the group calls her, achieve a huge popularity, success and wealth in Germany as well as Europe and even the United States. The group's trademark are not only brilliant singing performances, it's mostly their talent to imitate music instruments so that the audience gets the impression of listening to a whole orchestra playing while indeed the only real instrument is the piano. However, after years of immense success first problems appear with the beginning of the Nazi period, because three of the group's members are Jews and so soon are forbidden to perform in public. The movie portrays the rising of stars, the sparkling side but also the shadows of their success and finally their fall, being destroyed by politics and a mad government. Very entertaining, very moving and brilliantly acted."
      ],
      "budget": 0
   },
   "movielensId": 2493,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1997-12-25",
      "dvdReleaseDate": "2002-07-02",
      "directors": ["Joseph Vilsmaier"],
      "runtime": 126,
      "movieId": 2493,
      "title": "Comedian Harmonists",
      "mpaa": "",
      "actors": [
         "Ben Becker",
         "Heino Ferch",
         "Ulrich Noethen",
         "Heinrich Schafmeister",
         "Max Tidof",
         "Kai Wiesinger",
         "Meret Becker",
         "Katja Riemann",
         "Rolf Hoppe",
         "Dana Vávrová"
      ],
      "imdbMovieId": "0128133",
      "originalTitle": "Comedian Harmonists",
      "genres": [
         "Music",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Comedian Harmonists tells the story of a famous, German male sextet, five vocals and piano, the \"Comedian Harmonists\", from the day they meet first in 1927 to the day in 1934, when they become banned by the upcoming Nazis, because three of them are Jewish.",
      "tmdbMovieId": 9524,
      "avgRating": 3.7491,
      "releaseYear": "1997",
      "numRatings": 277,
      "posterPath": "/2NgC92vmBbf7BXIB0ZRUHywZV0v.jpg"
   }
}