{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prisoner",
            "id": 1563
         },
         {
            "name": "u.s. soldier",
            "id": 33564
         },
         {
            "name": "banana",
            "id": 33573
         },
         {
            "name": "childhood home",
            "id": 33574
         },
         {
            "name": "buchenwald",
            "id": 33575
         },
         {
            "name": "menorah ",
            "id": 33576
         }
      ],
      "imdb_id": "tt0174852",
      "video": false,
      "title": "The Last Days",
      "recommendations": [
         80269,
         60428,
         59930,
         75404,
         18713,
         34615,
         8417,
         1363,
         39185,
         26408,
         38749,
         2095,
         80919,
         19362,
         27052,
         54254
      ],
      "backdrop_path": "/55qhDpVgezvdfD9hmmGR6Vx9ixJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43eec3a368484e00693b",
               "name": "Bill Basch",
               "profile_path": null,
               "id": 937574,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43eec3a368484e00693f",
               "name": "Martin Basch",
               "profile_path": null,
               "id": 937575,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 0,
               "credit_id": "52fe43eec3a368484e006943",
               "name": "Randolph Braham",
               "profile_path": null,
               "id": 937576,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43eec3a368484e006937",
               "name": "James Moll",
               "profile_path": null,
               "id": 127027,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "550dc41ac3a368487d0068d2",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Documentary",
            "id": 99
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 1.809376,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 20595,
      "vote_count": 10,
      "budget": 0,
      "overview": "Five Jewish Hungarians, now U.S. citizens, tell their stories: before March, 1944, when Nazis began to exterminate Hungarian Jews, months in concentration camps, and visiting childhood homes more than 50 years later. An historian, a Sonderkommando, a doctor who experimented on Auschwitz prisoners, and US soldiers who were part of the liberation in April, 1945.",
      "similar": [
         5925,
         1369,
         38234,
         9291,
         278,
         1429,
         107846,
         1883,
         5971,
         10360,
         336,
         638,
         29381,
         10447,
         687,
         575,
         2749,
         33273,
         760,
         245706
      ],
      "original_title": "The Last Days",
      "runtime": 87,
      "poster_path": "/yAjtrBR42qz6QmSCoPa7TKEId8o.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ken Lipper/June Beallor Production",
            "id": 3805,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Shoah Foundation",
            "id": 3806,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Survivors of the Shoah Visual History Foundation",
            "id": 3807,
            "origin_country": ""
         }
      ],
      "release_date": "1998-10-23",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "Everything you're about to see is true.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["James Moll"],
      "runtime": 87,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0174852/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODgzOTM1NzIzOF5BMl5BanBnXkFtZTcwMTI1MDk3MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Bill Basch, Martin Basch, Randolph Braham | See full cast and crew »"],
      "reviews": [
         "I had the opportunity to see \"The Last Days\" on HBO one night and I will never be the same again. My Family is German, in fact my grandparents were born in Germany, and I have always heard the horrible stories of the concentration camps and How my family was so ashamed to be German. I have seen many pictures and movies concerning the holocaust but nothing could have prepared me for the images shown in this movie. The videos taken of the concentration camp prisoners was so unbelievable. When the first survivor began talking I felt tears begin to rush down my face. The way the Nazi's treated these people was so unbelievable and horrible. Towards the end of the film we see the deceased prisoners of the camps being thrown into large pits of fire to destroy their bodies. At this point in the movie I literally began to gag from the horror of how these people was treated. This movie is life changing- I don't think I will ever be able to read a book about World War II or the holocaust with out feeling my own heartbreak. In my opinion the most touching moment is when we hear the story of how a woman keeps the diamonds her mother gave her secret from the Nazis, and how she still has them and what she has done with them. Another moment that broke my heart is the story of a woman who wears a bathing suit that her father gave her under her clothes to the concentration camp and how she was scared to take it off because she feared she would forget all the good times that she had had before the war. I hope everyone sees this movie so they can understand what hate does, and so that nothing like this ever happens again.",
         "\"The Last Days\" is an exceptional film where five Hungarian Holocaust survivors tell their stories of their lives under the Nazis. Unlike other documentaries, these Jews did not experience any of this persecution until their country was annexed by the Germans in 1944. Their stories begin in 1944 and they recount the horrors of the Nazi concentration camps. Additionally, corroborating accounts from American soldiers and a German doctor working at Auschwitz were included as well as lots of archival photos and film. In many ways, this film is like going to a Holocaust center and listening to accounts of the survivors. Despite this film being very well made and quite moving, it's a case of preaching to the choir. In other words, those who are not insane or stupid and acknowledge that the Germans slaughtered millions will watch this film and appreciate it. Others probably won't watch it or else they'll dismiss the film as propaganda or an exaggeration or a conspiracy. Frankly, there isn't much you can do with this group. In the future, after successive generations have come and gone, this film will prove invaluable as a record of the Nazi horrors. But, since it only consists of five subjects, the film is naturally incomplete. Other films, such as \"Shoah\" and \"Night and Fog\" help to provide a more thorough story and are all worth seeing--but are also very draining. These are all exceptional films--just be sure you have some Kleenex handy as you watch.",
         "There have been a number of Holocaust films, dramatic and documentary, and all have some measure of success in conveying the immense horror of Nazi psychosis. This film is one of the best I've seen. It sticks to personal stories and that makes the difference. Dry written narration removes the vastness of the evil perpetrated. It took decades for the real horror of the Nazi extermination to be adequately shown to the public. We should use this film as an example of the mindset that drives current holocausts being perpetrated right now or being openly planned by international leaders. It doesn't matter who is being persecuted, the open hated and psychosis of the perpetrators is on display here, you can easily see the same aberrant thought processes in action right now in Africa and the Middle East. If only the world could show the courage that was clearly lacking in the 1930's.",
         "i saw this film on the independent film channel today, since i was off. I basically prepared myself for the typical sob story holocaust testimonies made simply to draw out the sympathy of our generation. this film goes beyond any expectations or boundaries a typical viewer like myself would imply. the film is based on the hungarian-jewish victims of the major death camps in late ww2 europe. the stories of each of the 5 main survivors progress from being forced to wear the star of david in the early days of the hungarian nazi occupation to being forced onto cattle trains going to aushwitz and bergen-belzen death camps to being pushed into gas chambers and crematoriums and finally pushed to mass extermination with hitler's desperate final solution in 1945, realizing that he would indeed lose his war. the survivors revisit the camps and specific sites where they were held along side loved ones, recounting horrific tales of suffering which could only be truly understood by those who survived them. the scene which impacted me the most was one where a jewish woman returns to the aushwitz latrines, which are still visible. she tells the tale of her and her friend singing a hebrew song of praise and how the other jews in the latrine, despite language or culture joined her in the song. i recommend this film to any human. since this is an unrealistic request, i would recommend it to anyone with a remote interest in ww2 or the holocaust. i've seen numerous films, read numerous books, and done extensive research and this film is w/o a doubt the closest you can get to any sympathetical understanding of the holocaust.",
         "The Last Days (1998) *** 1/2 (out of 4) Haunting, depressing and hard to watch documentary from director James Moll has five Hungarian Jews talking about their time before, during and after being placed in concentration camps at the end of WWII as Hitler was in the last days of murdering as many people as he could. THE LAST DAYS picked up the Best Documentary Oscar and there's no question that it's a very powerful movie, perfectly put together to show the horrors of these camps. Through the interviews and archival footage, most people will probably want to avoid this film simply because of how graphic the photos are and there's no question that it's incredibly depressing. Yes, there's a bit a hope thrown in for the inspiration to survive but this really doesn't take away the haunting images that we're shown. There are several times throughout the film that the five people break down crying while telling their stories and it really makes you wonder what it would be like having to go through life with these graphic images constantly in your head. Seeing people shot, burned to death, melt down into skeletons and worse is just something that no one should have to go through life witnessing and then having to live with. Another interesting segment deals with the eventual rescue by the American troops. We get to see some interviews with those troops and hearing their stories of being shocked were also very heartbreaking. I thought director Moll did a terrific job at taking all the stories and editing them together just as if the story was being told by one person. THE LAST DAYS isn't an easy film to watch as some of the images are just horrible but for history buffs it's a must see.",
         "This is the perfect companion to Schindler's list. Produced by Spielberg, this documentary tells about five Hungarian survivors of the death camps of Hungary and Auschwitz. There are also interviews with a Nazi doctor who used to perform experiments on Jewish children, like trying to change the color of their eyes. The scenes are unforgettable. Many new atrocities of the Nazis are brought to light. There are many tear inducing scenes in the documentary. This got the Academy Award for the best documentary of 1998. I highly recommend this for those who are eager to know more about the Holocaust and for those who want to see the extent of evil which man inflicts on another man. 4 out of 5 for this spellbinder.",
         "An absolutely unforgettable documentary and one that should be seen by everyone. The Holocaust images and portrayals that are put forward on screen will remain with you forever and are at times equally emotionally devastating and inspiring. Truly a life-altering film experience. Recommended. 9/10",
         "As far as documentaries go this one was informative and fast paced enough to keep you interested. I felt that the selection of vintage footage was right on the mark, along with *most* of the people they interviewed (it seemed kind of pointless to make the old lady go back to the refugee camp*brick factory* and cry, i don't feel it added anything to the story, plus she was not a very good interview). I think it gives us a good look into what things were like at that time, although the viewpoint is obviously biased. That is not to say i wish to trivialize the experience of the survivors, but it seemed odd that they sat the doctor, who had helped the Jews survive the holocaust by enlisting them in harmless tests, next to the old woman and practically let her attack him (an eye for an eye leaves the whole world blind). The directing in the movie was nothing spectacular, as no great symbolism existed in many of the key shots, such as the survivors going back to visit the camps, but the work was solid although not artistic (which is par for most all documentaries). In the end this documentary relies upon the fact that it has a subject matter that sells, just as if i were to plunk down 30 million dollars and make a documentary about 9/11 a bunch of people would be on here saying it was the \"best movie ever\". no offense but subject matter does not a movie make. In conclusion i say if your looking for a documentary on the holocaust from a perspective of (polish?) Jews then this is your man, if you want to see a better story from the holocaust see schindlers list and if you want the whole story read a lot and goto the Museum of tolerance in either LA or NYC.",
         "This documentary is by far THE best documentary I have ever seen. I am an American born Hungarian Jew and felt a direct connection to the survivors in the film. The film was very informative and explicit. The images were real...the photographs, the Nazi film clips and so on. You can not help but cry the entire movie. Not because I am a Hungarian Jew who lost family during that Era, but because these are human beings being treated in the worst possible way. If these people would have been rounded up and killed on arrival, that would have been better than what they had to endure before there eventual deaths. This is a movie for ALL people to see...Young and old. I will never forget the stories of these 5 people and the images I witnessed. A true masterpiece!",
         "What can I say that hasn't been said by others who have come across this essential document of the survivors of the holocaust? It goes beyond any kind of rating; watching the people on screen tell their stories, and re-connect with their haunted roots, is about as captivating as it can get, genuinely so, enough to not want to look away. The stories from the five survivors is just enough to make it a crucial piece of history, of something that will survive past their years as their own talked-of memories of what they saw, the people they saw murdered including their families, of being stripped of humanity and more deeply for their souls. The actual footage of almost ten years ago of inside camps of Auschwitz and Bergen-Belsen is equally powerful to see. But it's another that other interviews are included with the likes of an ex-Auschwitz Nazi doctor who didn't go along with his other sadistic colleagues; the American soldiers who were appalled to discover what they thought contained German prisoners of war to be thousands of Jews; the one US Congressman (at the time) to survive the holocaust. The history of this period of the early to mid 40's has become abstracted in the view of society, something so enormous it's even more staggering that similar practices go on in other countries today. The notes of what Hitler did is given notice in the film, but the facts are more as a back-drop for what the Last Days focus is. By director James Moll going in for these women's stories, of what they lost and tried to regain, is just as important to see in its own light as Schindler's List as a dramatization of the facts. It's not too much a wonder it got the best documentary prize at the Oscars. Executive produced by Steven Spielberg (speaking of 'Schindler') and the Shoa foundation."
      ],
      "genres": [
         "Documentary",
         "War"
      ],
      "productionCompanies": [
         "Ken Lipper/June Beallor production",
         "Shoah Foundation",
         "Survivors of the Shoah Visual History Foundation"
      ],
      "summaries": ["Five Jewish Hungarians, now U.S. citizens, tell their stories: before March, 1944, when Nazis began to exterminate Hungarian Jews, months in concentration camps, and visiting childhood homes more than 50 years later. An historian, a Sonderkommando, a doctor who experimented on Auschwitz prisoners, and US soldiers who were part of the liberation in April, 1945, also comment. Most telling are details: Renée packing her bathing suit, Irene swallowing the diamonds her mother gave her to buy bread, Alice's memorial for her sister Klara, Bill escaping police by jumping into a line of Jews going to Buchenwald, and Tom told by a US soldier to have \"all the damn bananas and oranges you can eat.\""],
      "budget": 0
   },
   "movielensId": 2494,
   "movielens": {
      "languages": [
         "English",
         "Deutsch",
         "Magyar"
      ],
      "releaseDate": "1998-10-23",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["James Moll"],
      "runtime": 87,
      "movieId": 2494,
      "title": "The Last Days",
      "mpaa": "",
      "actors": [
         "Bill Basch",
         "Martin Basch",
         "Randolph Braham"
      ],
      "imdbMovieId": "0174852",
      "originalTitle": "The Last Days",
      "genres": [
         "Documentary",
         "Drama",
         "History",
         "War"
      ],
      "youtubeTrailerIds": ["9UlBo3GFgWY"],
      "plotSummary": "Five Jewish Hungarians, now U.S. citizens, tell their stories: before March, 1944, when Nazis began to exterminate Hungarian Jews, months in concentration camps, and visiting childhood homes more than 50 years later. An historian, a Sonderkommando, a doctor who experimented on Auschwitz prisoners, and US soldiers who were part of the liberation in April, 1945.",
      "tmdbMovieId": 20595,
      "avgRating": 3.6327,
      "releaseYear": "1998",
      "numRatings": 211,
      "posterPath": "/yAjtrBR42qz6QmSCoPa7TKEId8o.jpg"
   }
}