{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alien",
            "id": 9951
         },
         {
            "name": "martian",
            "id": 10539
         },
         {
            "name": "based on tv series",
            "id": 10988
         },
         {
            "name": "fish out of water",
            "id": 11860
         }
      ],
      "imdb_id": "tt0120764",
      "video": false,
      "title": "My Favorite Martian",
      "recommendations": [
         9438,
         12312,
         32685,
         12277,
         26042,
         34170,
         27281,
         10402,
         26261,
         8970,
         15644,
         10496,
         12120,
         47881,
         10710,
         9822,
         17709,
         26603,
         17832,
         17708
      ],
      "backdrop_path": "/yta89cZqunYxf2vWHcX6qpVApaD.jpg",
      "revenue": 36850101,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tim O'Hara",
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c325b",
               "name": "Jeff Daniels",
               "profile_path": "/gai03gCu3DxMYxFympt7hUObpI5.jpg",
               "id": 8447,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Brace Channing",
               "gender": 1,
               "credit_id": "52fe453ac3a36847f80c325f",
               "name": "Elizabeth Hurley",
               "profile_path": "/fVcP55KQlaIcOrlHoBGf671kmZb.jpg",
               "id": 13918,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lizzie",
               "gender": 1,
               "credit_id": "52fe453ac3a36847f80c3263",
               "name": "Daryl Hannah",
               "profile_path": "/4LLmp6AQdlj6ueGCRbVRSGvvFSt.jpg",
               "id": 589,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Oncle Martin (le Martien)",
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c327f",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Dr. Elliott Coleye",
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c3283",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Loralie Brown",
               "gender": 1,
               "credit_id": "52fe453ac3a36847f80c3287",
               "name": "Christine Ebersole",
               "profile_path": "/dl8uNpIyYeGpjA90C0W1SGSsfla.jpg",
               "id": 4003,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mr. Channing",
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c328b",
               "name": "Michael Lerner",
               "profile_path": "/7VlkzO1z5wh96UCXpPZ0rUFx8aN.jpg",
               "id": 4250,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Lenny",
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c328f",
               "name": "T. K. Carter",
               "profile_path": "/qoeRT7O8ORQ36Hd18mmN4WfP9ZP.jpg",
               "id": 15411,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c3269",
               "name": "Donald Petrie",
               "profile_path": "/skokYnTDYIKogfeH7DU49dfhRsj.jpg",
               "id": 18281,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe453ac3a36847f80c326f",
               "name": "Sherri Stoner",
               "profile_path": null,
               "id": 56054,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe453ac3a36847f80c3275",
               "name": "Deanna Oliver",
               "profile_path": null,
               "id": 56055,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe453ac3a36847f80c327b",
               "name": "Jerry Leider",
               "profile_path": null,
               "id": 63999,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "588fd9399251412f39000088",
               "name": "Phil Tippett",
               "profile_path": "/2uQ0B7fN5cDQk17J1X3pxDSf9y.jpg",
               "id": 7727,
               "department": "Visual Effects",
               "job": "Visual Effects Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "5910c8d69251414e80037053",
               "name": "Thomas E. Ackerman",
               "profile_path": "/xFDbxk53icM1ofL4iCIwB4GkUxN.jpg",
               "id": 11371,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 7.390593,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9849,
      "vote_count": 101,
      "budget": 65000000,
      "overview": "News producer, Tim O'Hara gets himself fired for unwillingly compromising his bosses' daughter during a live transmission. A little later, he witnesses the crashing of a small Martian spacecraft, realizing his one-time chance of delivering a story that will rock the earth. Since Tim took the original but scaled-down spaceship with him, the Martian follows him to retrieve it.",
      "similar": [
         840,
         601,
         10200,
         228161,
         16866,
         10122,
         20424,
         348,
         49849,
         126889,
         602,
         607,
         608,
         8836,
         644,
         2675,
         9982,
         7453,
         68179,
         10679
      ],
      "original_title": "My Favorite Martian",
      "runtime": 94,
      "poster_path": "/k1wWEHxXLTHXjiBghhPqDYRBuDn.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1999-02-11",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "The martian has landed. There goes the neighborhood.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Donald Petrie"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "John L. Greene",
         "Sherri Stoner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120764/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMTk0MjYyMF5BMl5BanBnXkFtZTcwNDQ0MjcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Lloyd, Jeff Daniels, Elizabeth Hurley | See full cast and crew »"],
      "reviews": [
         "They totally ruined the concept for this story. The second the talking space suit appeared, I knew this was going to be very bad. Too often what happens is that the makers of some films get seduced with the ability of special effects and forget the story. At that point, it was no longer a movie of the beloved My Favorite Martian we have enjoyed from the TV series but a cartoon. I highly recommend people watch the old TV series when it is on in syndication or if its available on DVD, because those shows focused on story and what little special effects that were done in the TV series were strongly carried by the acting, writing and direction.",
         "When I was a kid in the 50's and 60's anything connected with Disney was by definition great. What happened? They are able to get any actors and actresses they want, the best of their time. But somehow Disney manages to screw things up in spite of their abundant resources. Disney can afford the best writers, the best producers and directors, but still...they screw things up! This movie is crap. The sad thing is that I suspect Disney in their arrogance does not even know when a movie is good or bad. It is only due to the talent of the actors that I can even give it a 3 of 10.",
         "Boy, I can hear those producers right now: \"That's great, a movie-version of My Favorite Martian... That calls for computer FX! Get me those CGI-people!\" The writers: \"Well, we were hoping that the story...\" The Producers: \"Yes, yes, yes! But enough with the story, GET ME COMPUTER FX!!! GOTTA HAVE LOTS AND LOTS OF FX!!! KIDS WILL LOVE IT!!!\" And thus yet another charming 60's TV-show was mutilated by Hollywood. This movie version is so loaded with pointless F/X they left no room for a story, not to mention comedy! All though Jeff Daniels and Christopher Lloyd try their best the story just ISN'T FUNNY. Not to mention that dreadful ZOOT-character voiced by Wayne Knight: it ranks as one of the most annoying film characters off all time, alongside the infamous Jar Jar Binks. One plus worth mentioning: the star of the original show, Ray Walston, turns up and he is in surprisingly good form.",
         "Shazbot, is this embarrassing. In fact, here's a list of 100 that makes up the embarrassment: 1.) a failed comeback for Christopher Lloyd. 2.) Jeff Daniels basically playing the same role he played in the live 101 Dalmatians remake which wasn't too juicy to begin with. He sure has a funny way of promoting his Purple Rose Theatre... 3.) Disnefluff. 4.) another disappointing reminder that Wallace Shawn is to Disney what Jet Li was to Bob Hoskins in Unleashed. 5.) Ray Walston, the original martian from the TV series, played a bit part (read \"cameo\") in this flick and died two years later of lupus. Coincidence? 6.) awful special effects. Seriously - awful. 7.-100.) that damn talking, farting suit voiced to an annoying degree by Wayne Knight (\"Newman!\"). My favorite scene? HA! HA ha, ha! Ha ha ha ha ha... Whew!... Good one. You - You're a joker. Okay, let's wrap up this review with a moment of silence for this franchise's agonizing death, and if you would like, you can say a quick prayer that Disney doesn't forget this travesty and do something silly like a movie adaptation of \"Mork and Mindy\" starring Tim Allen.........................................................",
         "This was yet another big screen outing for a US TV show from the sixties It is amusing enough but was very much to formula. Intelligent Martian lands on Earth and meets the not too bright humans, in his view. The usual wackiness ensues with the human, Bridges, eventually bonds with him and helps him to get home. Along the way he also gets the girl, Hannah. This is a nice outing for some pleasant Hollywood stars who I had not seen for a while. Pleasant enough to pass some spare time if you have not got anything better to view.",
         "We went into this movie because my husband had enjoyed the original version of `My favourite Martian'. We had our 6 year old daughter with us. She wanted to leave halfway through the movie which was fine with both her parents! The parts we did see were only occasionally humorous, mostly either too silly or gross. I would expect that this movie might appeal to kids between 9-12, if that. It's definitely not suited for younger children. From what I've heard the original series was by far superior and if you are going to \"relive the past\" you'll probably be disappointed.",
         "Tim (Gary Daniels) wants desperately to break into serious television reporting. When a job he begged for goes awry, he is fired. His beautiful but empty girlfriend (Elizabeth Hurley) says sayonara, too. Coming home, Tim is startled to discover his house has an uninvited visitor (Christopher Lloyd) from the planet Mars! Calling him Uncle Martin, Tim soon tries to help his new friend navigate life on earth. But, Martin gets in trouble wherever he goes, from the bathroom to the laundry room and more. Lovely Lizzie (Daryl Hannah) finally sees an opportunity to make time with Tim but the course of true love does not run smooth in this case, either. Soon everyone in television is stalking Tim, hoping for a story about a true alien. What's a man to do? For those who loved the old television show of the same name, with Bill Bixby and Ray Walston, this film is not worthy to tie the proverbial boots. Its truly, undeniably awful, with no plot and a reliance on supposed special effects which fall flat, too. Daniels is okay as the earthling but Lloyd is simply terrible as the alien, overacting up a storm. The rest of the cast is adequate, as are the costumes, set, and production details. Even if your children see the cover and beg for this film, convince them to pick out another flick at the video store. Be assured, kids and adults will find this movie a colossal bore, so opt for A Night at the Museum or Around the World in 80 Days instead.",
         "All I can say is I'm glad I didn't pay good money to see this, I watched it on T.V the other night. It lacked a decent script and had none of the charm of the original series. The studio sacrificed plot and character development for special effects and an attempt at slapstick. Was very disappointed in the end.",
         "There is no possible reason I can fathom why this movie was ever made. Why must Hollywood continue to crank out one horrible update of a classic after another? ( Cases in point: Mister Magoo, The Avengers - awful! ) Christopher Lloyd, whom I normally enjoy, was so miserably miscast in this role. His manic portrayal of our beloved \"Uncle Martin\" is so unspeakably unenjoyable to be almost criminal. His ranting, groaning, grimacing and histrionics provide us with no reason to care for his character except as some 1 dimensional cartoon character. The director must have thought that fast movements, screaming dialogue and \"one-take\" slapstick had some similarity to comedy. Apparently he told EVERY ACTOR to act as if they had red ants in their pants. Fault must lie with the irresponsibly wrought script. I think the writer used \"It's a Mad, Mad, Mad, Mad World\" as an example of a fine comedy script. As manic as that 1963 classic is, it is far superior to this claptrap - in fact - suddenly it looks pretty good in comparison. What is most sad about this movie is that it must have apparently been written to appeal to young children. I just am not sure whose children it was made for. Certainly no self-respecting, card-carrying child I know! If they HAD to remake \"My Favorite Martian\", why didn't they add some of the timeless charm of the original classic? Unfortunately, IMDB.com cannot factor in \"zero\" as a rating for its readers, that is the only rating that comes to mind in describing this travesty. One good thing did come from this movie, the actors and crew were paid - I think.",
         "I grew up watching the original TV series in the sixties and one thing that I can tell you right away, there is NO comparison. This film was totally ridiculous with a flying suit that was alive. A martian that took different shapes. Special effects that looked like something that a little child would create. In contrast, in the original, characters were developed and the viewers developed a feeling for Tim and Uncle Martin. The only highlight in this film, yes, actually there was one, occurred when Ray Walston finally made an appearance at the end. He wore dark glasses and made references to living on this planet for 30 years as a sort of homage to the TV series. But even the real Uncle Martin could not save this turkey."
      ],
      "genres": [
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": ["Walt Disney Pictures"],
      "summaries": [
         "Life couldn't get much worse for News Producer Tim O'Hara. He humiliates the one he loves, Brace Channing and ends up getting fired by her father. Then, a Martian from Mars arrives in his home. The Martian adopts the name 'Uncle Martin' and becomes friends with Tim, whilst he fixes his ship. Unaware to Martin, Tim actually wants to reveal him to the world, but can he actually do that to his new friend and 'Uncle'?",
         "News producer Tim O'Hara gets himself fired for unwillingly compromising his bosses' daughter Brace Channing during a live transmission. A little later, he witnesses the crashing of a small martian spacecraft, realizing his one-time chance of delivering a story that will rock the earth. Since Tim took the original, but scaled down spaceship with him, the martian follows him to retrieve it. Unfortunately, the electron accelerator is broken and the martian seeks Tim's help. Tim and \"uncle Martin\" now stay together, but Tim tapes the Alien with hidden cameras for his story of a lifetime. Ruthless Brace acquires the cassettes after Tim has become a friend with Martin and decided otherwise. Not only do they now have to hinder the publication of the material, but also will the (rental) spaceship self-destruct, if not back in space in a few hours.",
         "A martian lands on Earth and makes friends with a reporter."
      ],
      "budget": 65000000
   },
   "movielensId": 2498,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1999-02-11",
      "dvdReleaseDate": "1999-09-21",
      "directors": ["Donald Petrie"],
      "runtime": 94,
      "movieId": 2498,
      "title": "My Favorite Martian",
      "mpaa": "PG",
      "actors": [
         "Jeff Daniels",
         "Elizabeth Hurley",
         "Daryl Hannah",
         "Christopher Lloyd",
         "Wallace Shawn",
         "Christine Ebersole",
         "Michael Lerner",
         "T. K. Carter"
      ],
      "imdbMovieId": "0120764",
      "originalTitle": "My Favorite Martian",
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["VXZ-b-ZB7Rw"],
      "plotSummary": "News producer, Tim O'Hara gets himself fired for unwillingly compromising his bosses' daughter during a live transmission. A little later, he witnesses the crashing of a small Martian spacecraft, realizing his one-time chance of delivering a story that will rock the earth. Since Tim took the original but scaled-down spaceship with him, the Martian follows him to retrieve it.",
      "tmdbMovieId": 9849,
      "avgRating": 2.35721,
      "releaseYear": "1999",
      "numRatings": 1012,
      "posterPath": "/k1wWEHxXLTHXjiBghhPqDYRBuDn.jpg"
   }
}