{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0119207",
      "video": false,
      "title": "God Said, 'Ha!'",
      "recommendations": [],
      "backdrop_path": "/jjrqOb9uAS897P0Kot2AFeXBn2s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 3,
            "character": "Herself",
            "gender": 1,
            "credit_id": "52fe48799251416c9108db89",
            "name": "Julia Sweeney",
            "profile_path": "/mOl6ecUZ1F6XIh1jvPnxzkrRMXn.jpg",
            "id": 11806,
            "order": 0
         }],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe48799251416c9108db7f",
               "name": "Julia Sweeney",
               "profile_path": "/mOl6ecUZ1F6XIh1jvPnxzkrRMXn.jpg",
               "id": 11806,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe48799251416c9108db85",
               "name": "Julia Sweeney",
               "profile_path": "/mOl6ecUZ1F6XIh1jvPnxzkrRMXn.jpg",
               "id": 11806,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "595e4ea4c3a36825e80807af",
               "name": "Dawn Todd Curfman",
               "profile_path": null,
               "id": 1402054,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 2,
               "credit_id": "595e4ead925141225106c585",
               "name": "Mark Friedman",
               "profile_path": null,
               "id": 87364,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "595e4eb59251415a40059d52",
               "name": "Rana Joy Glickman",
               "profile_path": null,
               "id": 61845,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "595e4ebbc3a368265d0860e8",
               "name": "Greg Kachel",
               "profile_path": null,
               "id": 1846052,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "595e4ec4c3a368265d0860fb",
               "name": "Quentin Tarantino",
               "profile_path": "/9ci4NBvHXJktxjALdJsrtasqgtV.jpg",
               "id": 138,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.295005,
      "production_countries": [],
      "id": 82865,
      "vote_count": 3,
      "budget": 0,
      "overview": "Julia Sweeney tells the viewers the monologue about the hard time in her life when her brother fought with cancer and she was also diagnosed with a rare form of cancer.",
      "similar": [
         258480,
         10735,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         634,
         437557,
         17130,
         43923,
         11634,
         141,
         297762,
         376867,
         394117,
         242224,
         370663,
         376660
      ],
      "original_title": "God Said, 'Ha!'",
      "runtime": 85,
      "poster_path": "/nEcwFwKCsABvsvF2dOwNBs9IS1F.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-05-14",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julia Sweeney"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Julia Sweeney"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119207/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MjQ4NzA4NV5BMl5BanBnXkFtZTcwMDkwMTIyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Julia Sweeney, Quentin Tarantino | See full cast and crew »"],
      "reviews": [
         "Julia Sweeney's filmed version of her one-woman show is absolutely wonderful. I first saw it with my husband when he was ill with Stage 4 cancer. I re-viewed it last night, over a year after my husband passed away. Both my husband I loved it when we first saw it (and continued to use the line, \"I love my shunt!\" until he died), and I loved it just as much, but for different reasons, upon seeing it again. I found Ms. Sweeney's material to be truly amazing; she managed to capture the horror of the nightmarish \"cancer experience\" while keeping in touch with the parallel (and often surreal) experience that life does, in fact, go on: Cats still need to be fed, garbage still needs to be taken out, and small incidents do not become less irritating or hilarious just because there's terminal illness in the house. The fact that Ms. Sweeney is able to find, articulate and share the humor inherent in a horrible, emotionally draining experience is a gift to everyone who sees the show. Her great intelligence and sensitivity toward the subject matter prevents her from descending into sentiment (or worse) -- there are no banal observations or advice about how to deal with terminal illness, no facile, semi-spiritual conclusions about life and death. I think she understands that this kind of bunk (all too common in books and film these days) is at best insulting to anyone who has lived through this kind of experience. Instead, her emphasis on the small, human aspects of living with someone who is terminally ill makes the experience all the more real, and all the more valuable. I know that every time my husband and I had to face a particularly difficult medical procedure, we'd swap lines from Ms. Sweeney's show, and somehow it made it easier to get through it. And setting aside the subject matter, there's the simple fact that Ms. Sweeney's timing is terrific -- she really knows how to set up a joke and deliver it. These are not bust-your-gut guffaw jokes and anecdotes; these are the kind that manage to get you crying and laughing at the same time. What could be better?",
         "This is a beautiful, honest and funny show. It breaks new ground in the way that artists treat the major events of life. I understand that the Greeks wore masks because they felt that the human face was incapable of expressing the tragedies and dramas that we all must face. Dylan Thomas wrote \"Do not go gentle into that good night,\\Old age should burn and rave at close of day; \\Rage, rage against the dying of the light.\" Julia has dared to face tragedy and drama without a mask. She is a humorist and that is the face she shows death. You won't find anything like it anyplace else in any of the arts. She brings a new honesty to the arts and I hope others follow her lead. And she IS funny",
         "This is the filmed version of Julia Sweeney's intimate one-woman stage play about her family and how they coped when cancer struck two members within a year. It takes a humorous and very brave look at a very serious situation. \"God said Ha!\" is an intelligent, entertaining and involving film. The title is taken from a Get Well card a friend sent Sweeney. . One warning. If \"Porky's\" is your idea of sophisticated humour, this is not the film for you. A modicum of intelligence and sensitivity is required. . Executive producer Quentin Tarantino, makes a brief cameo appearance at the end.",
         "This is a very cathartic film allowing someone who lost a loved one (her brother, Mike, who passed away from brain cancer), as well as her own Uterine Cancer that occurred as her brother was dying. She filmed four hours of film, and just let out all of her feelings with real heart and humor, and it was edited down to this loving tribute to her brother. I am not a Julia Sweeney fan, but when I first saw this film when it first came out it really meant a lot to me and it also helped me with losses in my life. This is a film in the same vein as Paul Linke's (Officer Arthur Grossman, from the TV Series \"CHiPS\"), tribute to his late wife, Francesca Draper, in his similar film \"Time Flies When You're Alive\" that appeared on HBO. Both films are very warm and loving reflections on loss of a dear loved one, both reflect the pain, the loss, and tasteful humor in dealing with such pain and loss. Both of these films I have recommended for years for those who are dealing with the dying or loss of a loved one. Even as a Chaplain, it is hard to deal with such loss myself... and both of these films have helped me personally.",
         "This is one of the most life-affirming movies I've ever seen, even though it's not really a movie. It's actually a filmed version of Julia Sweeney's heartbreaking and heartwarming one-woman show about the worst year of her life. What's wonderful about her is her point of view. She never whines about why has this happened--about why her brother is dying from cancer at 31, or why her family must all live in her tiny bungalow and rob her of her privacy and sanity, or why she's dealt another massive blow (I won't mention it). She knows her brother Mike is in stage 4 of cancer (\"stage 5 is death\"), and there's no room for selfishness. It's her complete selflessness and plucky humor that pulled her through this terrible time and helped her see the silver lining of getting to understand her parents better. It's to her credit that she was able to create a show from her pain that can teach every one of us a lesson or two about life without being the tiniest bit pedantic, and it's even more to her credit how incredibly funny and deeply moving it is. I laughed one huge gut-laugh after another, and, yes, I had some tears. Sometimes I cried for her because she refused to.",
         "I never heard of this actress before happening to see the show listed on the guide. Sounded interesting so I popped in for a look; what an eye and earful I got. I would have to dig down deep to find an amusing story to bring out of something as awful as the things this family had to go through. But then the entire tale wasn't funny: at times it was very painful to listen to. I suppose Sweeney is the type to find silver in a cloud rather than moan continually over the unfairness of her existence. Commendable, I say. I appreciated the way the stage was set up and the methods employed in it's use. Sweeney would walk from area to area using different lighting procedures and layouts, many of which went along with the narrative. Sometimes, with the curtains just behind her, she even appeared to be on the verge of going backstage. Often Sweeney would be looking away from the camera and then turn slowly to face it. That and other uses of the camera and expression added greatly to the production. Bittersweet, effective, excellently done.",
         "This is not really a \"movie\" but a monologue or stand-up semi-comedy (as far as you can make cancer funny). I've seen Julia in LA, and she is a fabulous comedienne and story-teller, no matter what the topic. Her imitation of various people and sense of the ridiculous make her charming. Unlike most comics, she's not trying to score points for being crude and shocking with profanity. A humorous recounting of everyday life and dysfunctionality and turning-points, elevating such things above the mundane for further reflection... you can't help but love her. My only question is why Quentin Tarantino is listed as \"cast.\" ?",
         "This movie is so much better than that junk that is coming out of Hollywood these days. I loved Julia Sweeney in this movie because it touched my heart with her tragic story of the loss of her beloved brother, and the unfortunate circumstance of having her parents as her house guests.",
         "I too found this film while channel surfing. I laughed, I cried and I thought it was wonderful that Julia took time out from her celebrity to tell us about a year in her life - something that makes us all human. I felt for her - for I knew exactly what she had gone through in a year with one devastation after the other and then....here comes mom and dad! But then you learn from Julia so much about the human spirit, family and friends - and the mom and dad who you KNEW drove you nuts and to therapy are not as horrible as you really imagined. This is truly a life affirming film, a film of love and sadness - of joy and life. Those of us who are and have gone through cancer and other fatal illnesses with those that are close to us can identify, and those who have not will get a greater understanding due to Julia's telling and how deeply from the heart it comes.",
         "When my father died in 1995, I thought I'd never laugh again. This movie is one that I'll always remember as my grief turned into laughter. Grief has it's own way of sneaking up on us, making the world seem surreal when reality is too hard to deal with. When a tragic illness, terminal diagnosis, or chronic injury enter a person's life, things just aren't what they used to be. That's pretty much what this film is about. How things just aren't as they used to be, and interwoven, complex, and often piquant trips down memory lane. This film gives a wonderfully extraordinary, titillatingly sarcastic look at medicine, a brother-sister relationship, and the way an independent, single woman finds herself back in her immediate family fold. I say 'hurrah' for the making of this film, and 'thank God' for \"God Said, 'Ha!'\""
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Oh, Brother Productions Inc."],
      "summaries": ["Julia Sweeney tells the viewers the monologue about the hard time in her life when her brother fought with cancer and she was also diagnosed with a rare form of cancer."],
      "budget": 0
   },
   "movielensId": 2499,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-05-14",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Julia Sweeney"],
      "runtime": 85,
      "movieId": 2499,
      "title": "God Said, 'Ha!'",
      "mpaa": "PG-13",
      "actors": ["Julia Sweeney"],
      "imdbMovieId": "0119207",
      "originalTitle": "God Said, 'Ha!'",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Julia Sweeney tells the viewers the monologue about the hard time in her life when her brother fought with cancer and she was also diagnosed with a rare form of cancer.",
      "tmdbMovieId": 82865,
      "avgRating": 3.45761,
      "releaseYear": "1998",
      "numRatings": 401,
      "posterPath": "/nEcwFwKCsABvsvF2dOwNBs9IS1F.jpg"
   }
}