{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "overweight",
            "id": 2064
         },
         {
            "name": "summer camp",
            "id": 5767
         }
      ],
      "imdb_id": "tt0110006",
      "video": false,
      "title": "Heavyweights",
      "recommendations": [
         21845,
         13962,
         11164,
         26441,
         10680,
         40490,
         14817,
         24795,
         17207,
         10414,
         11528,
         13203,
         9446,
         20726,
         26386,
         32685,
         12475,
         13997,
         11017,
         6878
      ],
      "backdrop_path": "/v7EWaru1m8bNxwsVPDUSc4WfWJ8.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Tony Perkis",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d8ff",
               "name": "Ben Stiller",
               "profile_path": "/o9M2PyoF7QDSMq1OwW0D892fIkV.jpg",
               "id": 7399,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Gerald \"Gerry\" Garner",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d90f",
               "name": "Aaron Schwartz",
               "profile_path": "/miOMFJPGtoTJe85LK9XOmP09VBH.jpg",
               "id": 77337,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Roy",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d903",
               "name": "Kenan Thompson",
               "profile_path": "/As3n7ZdAoUnaB39Jl19eJBZOPbl.jpg",
               "id": 77330,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Harvey Bushkin",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d907",
               "name": "Jerry Stiller",
               "profile_path": "/wyleNpBLMLZ9CNjl13hNB8zoFIa.jpg",
               "id": 26042,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Alice Bushkin",
               "gender": 1,
               "credit_id": "52fe461d9251416c7506d90b",
               "name": "Anne Meara",
               "profile_path": "/oNZszKpUZHfbT1mk2cD53uuZsnp.jpg",
               "id": 32394,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Pat Finlay",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d913",
               "name": "Tom McGowan",
               "profile_path": "/oTdaSf7FmERQOthVelyKjiIxQoz.jpg",
               "id": 77338,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Tim",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d929",
               "name": "Paul Feig",
               "profile_path": "/68XiL9p5KAKtWK9F6q435ChzpBL.jpg",
               "id": 116805,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Josh Burnbalm",
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d92d",
               "name": "Shaun Weiss",
               "profile_path": "/asBOiROZPLezU9YYjvp9qsaA0LK.jpg",
               "id": 147499,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Roger Johnson",
               "gender": 2,
               "credit_id": "58d34ac39251411f8900a8f9",
               "name": "Tim Blake Nelson",
               "profile_path": "/tWHHEnnoEU6aNaiFRvl1WLfNTvB.jpg",
               "id": 1462,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Maury Garner",
               "gender": 2,
               "credit_id": "58d34adc9251411faa00a482",
               "name": "Jeffrey Tambor",
               "profile_path": "/csB350am07xyRL5Ik1BWuSY12tH.jpg",
               "id": 4175,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Chef (Uncredited)",
               "gender": 2,
               "credit_id": "58d34b0a9251411fdc00abc9",
               "name": "Peter Berg",
               "profile_path": "/1pR16H0zqRG49ns8cYykYpodgGF.jpg",
               "id": 36602,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Kenny",
               "gender": 2,
               "credit_id": "58d34b63c3a368124f00aa39",
               "name": "Allen Covert",
               "profile_path": "/7A7pGOFmHZ4eCFm3cDtgxwxOu4e.jpg",
               "id": 20818,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d919",
               "name": "Steven Brill",
               "profile_path": "/9CpoLVxDKV2XRF3rigTNSVimJK1.jpg",
               "id": 32593,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d91f",
               "name": "Steven Brill",
               "profile_path": "/9CpoLVxDKV2XRF3rigTNSVimJK1.jpg",
               "id": 32593,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe461d9251416c7506d925",
               "name": "Judd Apatow",
               "profile_path": "/iXlnv4NvZkmhB7bJBXea5T21gBT.jpg",
               "id": 41039,
               "department": "Writing",
               "job": "Author"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.675029,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14819,
      "vote_count": 120,
      "budget": 10000000,
      "overview": "Camp Hope is a summer retreat for overweight boys run by a kindly couple who make the campers feel comfortable with their extra pounds. But when tyrannical fitness guru Tony buys the camp, he puts the kids on a cruel regimen that goes too far. Sick of the endless weeks of \"all work and no play,\" the kids stage a coup and reclaim their summer of fun.",
      "similar": [
         293970,
         88,
         2758,
         38365,
         13207,
         9889,
         9327,
         802,
         2171,
         9725,
         44244,
         24124,
         9728,
         426338,
         236,
         13655,
         15417,
         14035,
         14144,
         13567
      ],
      "original_title": "Heavyweights",
      "runtime": 100,
      "poster_path": "/j6bhaWGuhL5nyRK0FdpnRIBDlp3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         }
      ],
      "release_date": "1995-02-17",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "They don't run the fastest. They don't jump the highest. But they sure are getting the last laugh. Heavyweights. They never met a hot dog they didn't like ... until now.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steven Brill"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Judd Apatow",
         "Steven Brill"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110006/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4MDMyODQwM15BMl5BanBnXkFtZTYwNTY5Mzk5._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Tom McGowan, Aaron Schwartz, Ben Stiller | See full cast and crew »"],
      "reviews": [
         "Continuing in the tradition of classic films such as 'The Godfather' and 'Apocalypse Now', director Steven Brill has added his name to the short list of truly great directors with his sweeping masterpiece 'Heavy Weights'. In arguably his finest performance to date, Aaron Schwartz plays Jerry Garner, a young man who is forced to attend a summer camp against his will. Upon arriving at the camp, Jerry is befriended by Roy (Kenan Thompson) and Josh (Shaun Weiss). Together they challenge the the tyrannic rule of manic camp counselor Tony Perkis (Ben Stiller) while overcoming their own personal insecurities to have the best summer of their lives. Thompson and Weiss both deliver Oscar-worthy performances, and Ben Still is at his best as the fitness-crazed camp counselor who must whip the campers into shape. Brill is truly at his best here, weaving an intricate tale full of mystery, suspense and deception, while capturing the essence of the human spirit and the hope and perseverance of children. This is a must have for any true fan of film.",
         "This is the best movie ever. I have watched it 1192 times. Ben Stiller's performance is excellent and the kids, although amateur, provide many, many, many laughs. This is a great movie to sit back and watch when you feel like using no brain power. The comedy is completely mindless and hilarious. Watching a group of obese children being \"torchered\" by a diet-obsessed ex-heavyweight is a great premise for a movie. it has all the elements of a good movie: you laugh, you celebrate, and maybe, (if you're extremely sensitive) cry. I don't know how you can't absolutely love this movie. My praises for this movie know almost no bounds. This is just a great movie. Well, I'm going to go achieve 1193!",
         "Heavyweights is the story of a group of kids who with the help of their counselor go on a mission to take back their fat camp from a crazy man who has never interacted with kids before (played by Ben Stiller) who is intend on making it into a money making informercial. I first saw this as a child, and absolutely loved it. I must have watched it again on at least 5 other occassions. Recently I was in the video store and came across a copy of it for sale. After convincing my friend to buy it , we went back to his house and popped it into the VCR. I wondered if the film would hold up after all these years. Did it? Absolutely! In fact I may have gotten bigger laughs this time around. I do not understand why this film has a 5.1 rating, after reminding this movie to my friends they all recalled loving it, and everyone I recently watched it with loved it. Ben Stiller's character is hillarious, and the rest of the cast is great. Besides Ben, Kenan Thompson is the only other actor in this who went on to become somewhat of a star, which is suprising because all the kids give great performances. Tom Mcgowan, the man who plays Pat, seemed to be chosen for the role because Chris Farley passed on it, and John Candy died, but he gives a great performance. I know it sounds cliche, but Heavyweights is truly one of the few movies that people of all ages will love. 9/10",
         "This is one of the funniest movies I've seen. And fat people will not be offended, I have friends that have really been to \"fat camp\" and they were laughing harder than I was, and I really don't see what's so gross about it. This is a great film go out and rent it. 9.5 out of 10.",
         "It's really too bad that summer camps aren't as prevalent in today's society as they used to be. It was a way for kids to get away for a few months every summer. It was a chance to be on your own (away from parents anyway), visit a place that you would otherwise never see, have what may be the most important experiences of your childhood, and make friends that you would truly never forget. Kids just do not get that today. The only way they can really experience the magic of summer camp is in the movies. Unfortunately there are not many movies that really show that experience. Meatballs (1979, with Bill Murray) may very well be the best example, and Indian Summer (1996) shows how those friendships last when a group of 30 year old former campers reunite at the summer camp of their youth. But here with Heavyweights, we have another great, if not to realistic portrayal of the summer camp experience. Camp Hope is a camp that caters strictly to fat kids. It's where they go to lose weight, and make friends with other kids that may also be considered outcasts back home because of their weight. But in fat camp, all kids are equal. At least until the kind owners of the camp, The Pushkins, are forced to sell the camp to a villainous fitness guru wannabe, played with demonic zeal by Ben Stiller. It is, in fact, a performance Stiller would virtually copy for the movie Dodgeball. He attempts to force the kids to lose weight through, shall we say, questionable methods in order to create a weight loss infomercial. But the kids, rebel, take over the camp, and have summer their way. There are many classic moments, such as the kids \"downloading\" their stash of candies and snacks in various hiding places, Ben Stiller's interrogation of kids that are actually gaining weight, a competition with the jocks from Camp MVP across the lake, and many more. There's also scenes showing that the kids can be anything they want if they just apply themselves. Such as a dance with the girls from across the lake. At first everyone just stands around. But when the boys start dancing, the girls join in, and success is in the air, until Stiller shows up to degrade the boys again. Sure this movie is by the numbers, but it's a fun ride, with great characters, beautiful scenery, and a villain who couldn't be more over the top. Epitomized by the scene where Stiller somersaults from a second story window, hits the floor, quietly says to himself \"Ouch\", and whips his head into a full villain \"Nobody's gonna stop me\" speech. Great family movie.",
         "The film is great, I don't need to write another review of the synopsis as there are so many below, but if you have any sense of humour at all you'll like this movie. If you're a dried up 60 year old prune reminiscing about the good old days of black and white cinema when you could see a film + popcorn for a shilling and sixpence, you'll hate it. Great for kids, enough stupid stuff to keep them entertained, Fantastic for teenagers/people in their 20s, enough sick/dry humour to satisfy and make you think 'holy crap can they say that in a DISNEY film????', and older middle aged people with a sense of humour will see its quirky side too. I just have one question, at one point with the seymour butts joke, does anyone know what josh actually says, as his joke is totally out of sync with his lip movements.",
         "Despite being a child of the '90s, somehow I missed \"Heavyweights\" entirely. Considering the similarities it shares with \"The Mighty Ducks\" movies such as actors Kenan Thompson and Shaun Weiss, I'm almost embarrassed. Regardless, there's still plenty to appreciate about \"Heavyweights\" 15 years later in spite of its silliness -- and it's more than just a joke about the ineptitude of the Buffalo Bills. For one, it was written and directed by Judd Apatow, who has a majority hold on the comedies of the last decade and for two, it marks one of Ben Stiller's first prominent roles as fitness wack-job Tony Perkis, who takes over a once-adored fat camp and harasses the kids. Good thing \"Heavyweights\" was made then or it may never have surfaced, seeing as the age of political correctness and weight sensitivity has befallen us. The film is not cruel at all in its depiction of overweight campers, so parents surfing around for slightly older kid films and coming across this one shouldn't be concerned about that factor, but there's no doubt that such a concept would be hard to get off the ground, especially at Disney, in the 21st Century. Co-written by Apatow and Steven Brill, writer of \"The Mighty Ducks\" films, it was as if the two conspired to plant a seed for a type of humor that kids my age at the time would come to identify as their own as they entered the PG-13 and R-rated age. Tony Perkis, for example, is the spitting character image of Stiller's White Goodman from \"Dodgeball\" and yet to me he is just as amusing doing his patented whispery intimidating voice now despite my countless repeated viewings of \"Dodgeball.\" There's also a classic overnight camp comedy sense of humor in \"Heavyweights\" like the kids getting beat in sports by their rival camp, an awkward dance mixer with a normal girls camp and when the kids unload the candy stashes they've snuck in camp into secret compartments -- as well as the run-of-the-mill fart jokes. Characters such as Tony's hysterical right-hand European man Lars, however, were way ahead of their time. \"Heavyweights\" is pretty immature and excludes girls (because fat girls would be too taboo for the '90s). Its typical camp movie plot as well as its \"overthrow-the-bad-guy\" story arch - - which ruled the '90s -- come off as stale. But ignore those distractions and \"Heavyweights\" is a funny, quotable movie with some classic scenes, which is all a kid (or someone trying to go back and grab some nostalgia) really wants. ~Steven C Visit my site at http://moviemusereviews.com",
         "Camp Hope is a summer camp for fat kids, all of the kids at Camp Hope have a weight problem. It is the one place they can go without feeling different. But when the previous owners declare bankruptcy, the camp is purchased by an obnoxious fitness freak Tony Perkis (Ben Stiller) who becomes obsessed with changing his chubby charges into budding body builders. He immediately begins serving them low calorie foods and subjecting them to rigorous exercises (ex. 20 mile hike). Part of his motivation is greed and he is in the process of writing a book, and filming an infomercial on weight loss. The boys at camp rebel the \"Perkis System\" and mayhem ensues. I liked Heavyweights it was pretty funny for a Disney film. Ben Stiller is hilarious as the freak Tony Perkis one of his better roles in my opinion.",
         "With Lines like \"I'm Feeling Skinny Tony!\", and \"Kiss the ground jokerboy!\"...you just cant go wrong with this film. Ben Stiller steals the show with probably his best comedy ever as a physco entrepenuer taking over a fat camp. This film was made in the mid 90's where terrible fashion and mullets were still around. Such as humongous t-shirts and t-shirts that says \"mean people suck\" This movies' humour is beyond that of 12 year old kids with references that they wouldnt understand. SMALL SCENE SPOILER For example, Tony Perkis goes to give this one fat black kid a hug, then he pats him down and finds a pez dispenser in his sock. Tony goes on to say \"Hey, It looks like my mans PACKIN!, then he proceeds to unload that \"clip\" of pez and as it hits the floor it sounds like bullets hitting the floor. ITs in a class totally of its own. Rent the Movie. Who cares about the actual story and the moral message it brings. Just watch Tony Perkis and his sidekick Lars. Truly good humour....9/10",
         "This is truly the best movie that has ever gushed from the loins of Disney. I have 7 copies in constant rotation, each dedicated to a particular weekday for viewing. I quit my job and collect social security to support my habit,as well as stuffing envelopes during the rewind phase. On the weekends when my grandma comes over to clean, she usually plays Lars or Tony, and I get to be Gerry Garner. Once I asked some Jehovah's witnesses to be Nicholas and Simms, but one talked too much and the other had a crappy English accent. I used a microwave box to make my own go-kart in the living room for me to sit in when I get to part the wild horse's mane. I'm doggen 'em, Pat! I'm doggen 'em!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Family",
         "Sport"
      ],
      "productionCompanies": [
         "Caravan Pictures",
         "Walt Disney Pictures"
      ],
      "summaries": [
         "11-year-old Gerald \"Gerry\" Garner lives in Long Island, New York, and he's overweight. Gerry's parents Maury and Mrs. Garner decide to send Gerry to Camp Hope, a camp for overweight boys. The camp is owned by kindly Harvey Bushkin and his equally kind wife Alice Bushkin. When the Bushkins file for bankruptcy the camp has to be sold, it is bought by a wacko named Tony Perkis. Tony plans to force the campers to lose as much weight as they can, and he also intends to document the marathon shedding of weight and use it for an infomercial for his slenderizing program. In the eyes of the campers, Tony has made Camp Hope a living hell. As Gerry and counselor Pat Finley lead the efforts to overthrow Tony, the campers prepare for the Apache Relay against arch rival Camp MVP. The Apache Relay is a kind of race in which Camp Hope has never defeated Camp MVP before.",
         "Jerry, an overweight pre-teen, is sent to a \"fat farm\" for the summer, lured by the promise of go-karts and swimming fun. When he arrives, however, he finds that the camp has been bought out by an exercise/fitness guru whose mental stability quickly deteriorates. Jerry and his friends--including a counselor whose been there 18 years--finally make a stand.",
         "School's out for the summer, and Gerry Garner eagerly forecasts weeks of lazing around the house. That is, until his parents inform him that they have signed him up for a holiday at Camp Hope, a \"fat camp\" that, unbeknownst to Gerry, is about to be bought out by mentally unhinged exercise guru Tony Perkis, and turned into a rigorous fitness facility for youths. Tony pumps the fun out of the whole summer, and, with his assistant Lars, punishes anybody who tries to break his totalitarian grip on the camp. Together with his new friends and the camp's original staff, Gerry must stop Tony's brutal regime, and take back the camp at all costs.",
         "Plump kids are lured into joining a posh fat camp with the promise of quick weight loss and good times, only to find that the facility is a woodland hellhole run by a psycho ex-fitness instructor."
      ],
      "budget": 0
   },
   "movielensId": 250,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-02-17",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Steven Brill"],
      "runtime": 100,
      "movieId": 250,
      "title": "Heavyweights",
      "mpaa": "PG",
      "actors": [
         "Ben Stiller",
         "Aaron Schwartz",
         "Kenan Thompson",
         "Jerry Stiller",
         "Anne Meara",
         "Tom McGowan",
         "Paul Feig",
         "Shaun Weiss",
         "Tim Blake Nelson",
         "Jeffrey Tambor",
         "Peter Berg",
         "Allen Covert"
      ],
      "imdbMovieId": "0110006",
      "originalTitle": "Heavyweights",
      "genres": [
         "Comedy",
         "Family",
         "Drama"
      ],
      "youtubeTrailerIds": ["AHXmxeu0avQ"],
      "plotSummary": "Camp Hope is a summer retreat for overweight boys run by a kindly couple who make the campers feel comfortable with their extra pounds. But when tyrannical fitness guru Tony buys the camp, he puts the kids on a cruel regimen that goes too far. Sick of the endless weeks of \"all work and no play,\" the kids stage a coup and reclaim their summer of fun.",
      "tmdbMovieId": 14819,
      "avgRating": 3.04051,
      "releaseYear": "1995",
      "numRatings": 1049,
      "posterPath": "/j6bhaWGuhL5nyRK0FdpnRIBDlp3.jpg"
   }
}