{
   "tmdb": {
      "original_language": "fa",
      "keywords": [
         {
            "name": "apple",
            "id": 33673
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0156901",
      "video": false,
      "title": "The Apple",
      "recommendations": [
         91067,
         86282,
         53016,
         213592,
         29972,
         33802,
         8846,
         49559,
         149156,
         12130,
         106230,
         64441,
         64310,
         214775,
         410,
         222071,
         61385,
         89065,
         132364,
         83994
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Massoumeh",
               "gender": 0,
               "credit_id": "59bf8fd5c3a3683075012211",
               "name": "Massoumeh Naderi",
               "profile_path": null,
               "id": 1890326,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Zahra",
               "gender": 0,
               "credit_id": "59bf8fdec3a3682feb0118f4",
               "name": "Zahra Naderi",
               "profile_path": null,
               "id": 1890327,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Father",
               "gender": 0,
               "credit_id": "59bf8fe8c3a368307501223b",
               "name": "Ghorban Ali Naderi",
               "profile_path": null,
               "id": 1890328,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Azizeh",
               "gender": 0,
               "credit_id": "59bf8ff1c3a3682fb80118f8",
               "name": "Azizeh Mohamadi",
               "profile_path": null,
               "id": 1890329,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "",
               "gender": 0,
               "credit_id": "59bf8ff992514147500110d1",
               "name": "Zahra Saghrisaz",
               "profile_path": null,
               "id": 1890330,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe466fc3a36847f80fecc3",
               "name": "Samira Makhmalbaf",
               "profile_path": null,
               "id": 20026,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58044a969251412657002205",
               "name": "Samira Makhmalbaf",
               "profile_path": null,
               "id": 20026,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58044aa59251412655002221",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58044ab9c3a3686ea9001eef",
               "name": "Mohsen Makhmalbaf",
               "profile_path": "/pkPhuxSyPBmiVKcPZgrUXc9i41H.jpg",
               "id": 120226,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58044af8c3a3686eb80021ad",
               "name": "Iraj Sarbaz",
               "profile_path": null,
               "id": 1695754,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58044b50c3a3686e9a002435",
               "name": "Mohamad Ahmadi",
               "profile_path": null,
               "id": 1538012,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "58044b7492514126640022f5",
               "name": "Ebrahim Ghafori",
               "profile_path": null,
               "id": 20033,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "58044be4925141266800237b",
               "name": "Behroz Shahamat",
               "profile_path": null,
               "id": 100011,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "58044c0b925141265f002252",
               "name": "Hana Makhmalbaf",
               "profile_path": null,
               "id": 234408,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "58044c22c3a3686ea9001fd7",
               "name": "Marzieh Makhmalbaf",
               "profile_path": null,
               "id": 1020732,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "58044c3fc3a3686e9a0024d4",
               "name": "Akbar Meshkini",
               "profile_path": null,
               "id": 100015,
               "department": "Directing",
               "job": "Assistant Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.572532,
      "production_countries": [
         {
            "iso_3166_1": "IR",
            "name": "Iran"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 43978,
      "vote_count": 16,
      "budget": 0,
      "overview": "After twelve years of imprisonment by their own parents, two sisters are finally released by social workers to face the outside world for the first time.",
      "similar": [
         258480,
         370663,
         401898,
         244772,
         12793,
         27586,
         858,
         112160,
         141,
         634,
         376867,
         242224,
         10818,
         11421,
         43923,
         340485,
         250124,
         513,
         11634,
         297762
      ],
      "original_title": "سیب",
      "runtime": 86,
      "poster_path": "/5QC5xzyWIkGK2NcnpZUXThZYK66.jpg",
      "spoken_languages": [{
         "name": "فارسی",
         "iso_639_1": "fa"
      }],
      "production_companies": [],
      "release_date": "1998-01-01",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Iran",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Samira Makhmalbaf"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Mohsen Makhmalbaf",
         "Samira Makhmalbaf"
      ],
      "originalLanguage": "Persian",
      "imdbLink": "http://www.imdb.com/title/tt0156901/",
      "coverLink": null,
      "actors": ["Stars: Massoumeh Naderi, Zahra Naderi, Ghorban Ali Naderi | See full cast and crew »"],
      "reviews": [
         "After twelve years, the neighbours of the Naderi family in Tehran write to Social Services to raise awareness and seek help with the family. The family is made up of an old man, his blind wife and his twin daughters, who he keeps locked in the house and has done for the twelve years of their lives. The parents claim they were only protecting their children but the papers tell stories of children chained up and kept like animals. The film crew watch on as the parents and children come to terms with this new, enforced freedom. Whenever director Samira Makhmalbaf heard about the story of the Naderi family she decided to make a film about it \u0096 two or three days later this film began, using film stock left over from her father's most recent film. Several weeks later the film was complete and the final product is a startingly assured product that is engaging, impressive and very balanced. I'm not sure what specifically attracted Makhmalbaf to the story but she has managed to bring so much out of it that I imagine she saw a lot of themes worth exploring in the original article she read. The film follows the real people as they all try to come to terms with this new world \u0096 the blind wife who fears for her girls; the father who is only following teaching on raising girl and wants to protect them; and of course the girls who quickly go from barely being able to communicate to running and playing outside. On this very human level it is a compelling film that mixes documentary and drama to good effect and you easily care for the people. A scan of the plot may see your mind made up about the cruel Iranian father and the poor oppressed wife and girls, however to do this is a mistake because the film never does this, not once. The film looks at the people but it also looks at the view of society on women and the attitudes involved; it would be easy to just slate the religious, comparatively oppressive approach of such religious states but the film is too good for that. Instead it takes a balanced view that weighs up both views and doesn't judge anyone. By doing this the film is only stronger and more interesting because it comes over as a debate that engaged my brain in that aspect just as much as it engaged me with the people in the story. The cast are almost all the real people \"playing\" their roles in front of the camera as they really happen; I'm sure some of it were staged reconstructions but mostly it convinces as the real deal \u0096 happening as we watch. The father is compelling and the film's balance is evident in that it allows him to be confused and bewildered about the accusations against him. The wife is well presented as well \u0096 confounding those who will have tuned in to see a cruel man oppressing the women in his life. The twin girls are easy to like and they are the human aspect of the story come (literally) to life \u0096 their development is touching and engaging. Overall this is an excellent mix of documentary and drama that works on many levels. It is a human story that is touching but also works on other levels, being a thoughtful and balanced look at Iranian society, the restraints on people and on women generally. Without judging, it builds an interesting debate that produces a strong film that is well worth seeking out.",
         "Like many recent films from Iran this one has a simple plot line, light humor, and a humanitarian streak that is rarely seen in American films. Yet it too has a resonance due to its use of metaphor and to a rather complex theme. The film starts with concerned neighbors signing a petition for social workers to investigate a home where their blind mother and out-of-work father have locked up two girls for eleven years. Social workers \"rescue\" the (now slightly autistic) girls then give them back to their parents. What follows is an initiation period in which a social worker and the father have a seriocomic encounter in which he gets a kind of comeuppance and the girls go out into the neighborhood and begin to make friends despite their lack of social skills. What's most harrowing about the film is that it's based on a real life event and the principal characters play themselves. What's more it's directed by an 18 year-old Iranian woman. Highly recommended.",
         "I can't add much to the review by Bob the Moo from Birmingham, who pretty much sums up the strengths of this film. However, as an illustration of the skill of the film-maker I would like to mention one scene that stands out in my memory, not in detail so as not to 'spoil', where a sense of incipient menace is subtly hinted at - one is almost expecting something horrible to go wrong to prove that it was right to keep the girls imprisoned for their own safety and this looks like being the moment when it happens; one hardly dares hope that it will have a happy and positive outcome - but it doesn't. It turns out there is nothing to worry about at all. This sounds like a non-event, but I found the subtlety with which this point was made quite outstanding. The film is a pure delight, more powerful than any heavy diatribe against repressive regimes. The compassion with which all participants are presented in their own contexts, particularly the father who could have been demonised but isn't, is also outstanding. No judgements are made, and the lessons are all the more clear and convincing for that. This is a film that stands out in my mind, both visually and symbolically, as clearly today as when I saw it several years ago.",
         "One of the great pleasures I get out of watching foreign films is that I get see a real culture, not tainted by the political or mythical stereotypes that we have put upon them. The Apple (a.k.a. Sib) is perfect example, as it is an Iranian made production that speaks nothing of terrorism, but only of the people. The Apple walks a thin line between documentary and drama as it tells the story of two young girls who have never walked outside their home in all the 11 years they have been alive. As the film opens, neighbors have written a letter to the Child Welfare department, and a case worker comes to the home to take the children away. Their father, a fundamentalist muslim, and their blind mother protest this and are allowed to take them back only if they promise to treat them properly. What is truly amazing about this film is that is was filmed by Massoumeh Naderi, a seventeen year old actress and director, and that it stars the actual children and their father. As I watched this film I wasn't aware of this fact and I recall thinking about the amateur acting, yet how these characters seemed so believable. All of this makes me want to see the film again. The Apple is one of the few films that has left thinking long after the credits have rolled and I am sure I will be disecting it for weeks to come. A review I read after the film questioned how the American media might cover a story of two children being locked away. I, on the other hand, am pondering the films intent, (I gather it is about women's rights) and the state of affairs for the real people who live in Iran. Wow!",
         "\"The Apple\" (Sib) is a one-of-a-kind movie. It is a semi-documentary, with some recreated footage and some (apparently) real footage. The bare-bones plot describes an extremely poor Iranian family. They have raised their twin daughters in isolation--the children have never been outside their home, and have apparently never spoken to anyone other than the parents. It is obvious that the two girls have significant developmental delays. We will probably never know what percentage of their delays is due to nurture and what percentage is due to nature. (There is a passing reference to malnutrition. Perhaps this also has played a role both prenatally and postnatally.) A dedicated and resourceful social worker takes the children under her wing. The interaction between the children, their parents, their new friends, and the social worker is fascinating. This movie works as drama, as documentary, and as an insight into problems and solutions in a culture very different from my own. I consider \"The Apple\" a must-see.",
         "The star-spangled night sky is accompanied by an unimaginable cold. Despite the twenty degrees below freezing I step outside, urged by an irresistible impulse. And I'm already crossing the mountains, driving on a hardened surface of snow. The next cinema is twenty miles away, and tonight it offers a special alternative program. I go inside and suddenly something magic happens: The cold outside world is forgotten, and instead I feel inundated by the warmth and the inspiration of the recent Iranian cinema. I watch \"Sib\" (\"The Apple\"), the first movie of 18-year-old Samira Makhmalbaf. It's a semi-documentary, a film about an authentic social case, in which the protagonists portray themselves: A father, a 65-year-old beggar, and a blind mother keep their twin daughters shut in their house for more than eleven years. They are denounced by their neighbors, and a social worker steps in to tell the parents what they have to do. But she has to combat the stubbornness of the father who claims that his daughters are like flowers, and if you let them go out into the sun they will fade and eventually perish. Precisely the opposite happens: Once liberated, the girls, who at the beginning are unable to coordinate their movements and whose rare attempts of speech are mostly inaudible or incomprehensible, not only start to discover the world but also slowly begin to blossom out. Beams of light are illuminating their eyes as they find new friends and learn how to communicate. In the end they even succeed in sweeping away the barriers of ignorance of their father and lead him on the way to a brighter future. It is stunning to watch an almost complete transformation like this taking place. The change is both physical and spiritual, and it is a step towards a better world. This movie is a weapon against the void, a remedy for all kinds of hopelessness: it fills you, it enlightens you, it dispels the dark shadows of your life.",
         "_Sib_ offers a glimpse inside Iranian society that is rarely available to Western audiences. It looks and feels like a documentary, and apparently contains actual footage of the freeing of the twin girls who had been confined to the family home for their entire lives. The blossoming of the two girls, which begins almost the moment that they are chased from the yard by a well-meaning but rather overbearing social worker, is a joy to behold. The scene in which the recently-freed twins steal ice creams from a young street vendor stands out as an example of the comedy that lightens a film that could, given a different treatment, have been relentlessly depressing. As the narrative develops, the father may be seen as a prisoner in his own right, trapped by his traditionalist religious beliefs, his fears for his daughters' safety and by the surprisingly domineering influence of his blind wife. Ultimately, _Sib_ shows that the forced release of the twins is also a release for their father, the nominal villain of the piece.",
         "Based on a true story and starring the very same people involved in it, this movie (by first time director Samira Makhmalbaf) tells the story of Zahra and Massoumef, twelve year old twins living on a very humble neighborhood in Tehran. Virtually imprisoned in their own home by their impoverished, ignorant, fundamentalist father and blind mother, they were freed by Iran social services after neighbors complained that the children had not bathed and could not speak. Makhmalbaf shows the twins attempting to function beyond their parents' wall after the social workers have intervened. They lack social skills to the extent of being unaware that they have to pay for food. Made when she was just 17 years old (probably with some help from her father, the acclaimed Iranian director Mohsen Makhmalbaf) this film stands very well in the Iranian tradition of social realist, humanist cinema that came out beginning in the mid 1980s. It's so moving, it will be hard for you not to cry while watching it.",
         "From the beginning I was enchanted by this movie. I was worried over the story line as I'm rather sensitive to films about kids being abused so I was getting ready to be upset by it but the assured directing, the wonderful naturalness of the acting - not to mention the balanced story telling settled me down. The fact that the Father and Mother weren't monsters but ignorant with misguided principles based around fear of the outside world helped me to get over my initial worries and I ended up thoroughly enjoy it. It's rare I give a movie over 7.5 but this one absolutely deserves the 8. In fact I would like to give it 8.5 but the IMDb system doesn't allow it.",
         "I am a huge fan of Persian cinema. What I find most striking and pleasantly surprising is the lack of melodrama of any sort- a rarity in Asian cinema which is known for its over-the-top expressions and loud performances. Like most other Iranian films, the performances are strikingly natural, right from the protagonist to the flower-girl who appears for less than ten seconds. The storyline is fairly predictable- within the first 20 minutes, you'll know what to expect from the rest of the movie. There are no twists, nothing that will catch you by surprise. Then again, it isn't a movie that tries to do so either. It is a bland story of the highs and lows of life in Iran, with a few laughs thrown in for good measure. The Apple is not the greatest Iranian movie ever made- it does not possess the thought-provoking subtlety of The Circle or the heart-wrenching innocence of The Children of Heaven, but for a movie directed by an 18year old (and a woman at that), it is a fine effort."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Hubert Bals Fund",
         "MK2 Productions",
         "Makhmalbaf Productions"
      ],
      "summaries": ["After twelve years of imprisonment by their own parents, two sisters are finally released by social workers to face the outside world for the first time."],
      "budget": 0
   },
   "movielensId": 2503,
   "movielens": {
      "languages": ["فارسی"],
      "releaseDate": "1998-01-01",
      "dvdReleaseDate": "2004-08-23",
      "directors": ["Samira Makhmalbaf"],
      "runtime": 86,
      "movieId": 2503,
      "title": "The Apple",
      "mpaa": "",
      "actors": [
         "Massoumeh Naderi",
         "Zahra Naderi",
         "Ghorban Ali Naderi",
         "Azizeh Mohamadi",
         "Zahra Saghrisaz"
      ],
      "imdbMovieId": "0156901",
      "originalTitle": "سیب",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "After twelve years of imprisonment by their own parents, two sisters are finally released by social workers to face the outside world for the first time.",
      "tmdbMovieId": 43978,
      "avgRating": 3.60853,
      "releaseYear": "1998",
      "numRatings": 129,
      "posterPath": "/5QC5xzyWIkGK2NcnpZUXThZYK66.jpg"
   }
}