{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0181322",
      "video": false,
      "title": "The Breaks",
      "recommendations": [
         74395,
         29463,
         19033,
         30023,
         18803,
         16433
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [{
            "cast_id": 1,
            "character": "Derrick King",
            "gender": 2,
            "credit_id": "52fe46329251416c750705af",
            "name": "Mitch Mullany",
            "profile_path": null,
            "id": 77732,
            "order": 0
         }],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe46329251416c750705b5",
            "name": "Eric Meza",
            "profile_path": null,
            "id": 77733,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.2613,
      "production_countries": [],
      "id": 15031,
      "vote_count": 4,
      "budget": 0,
      "overview": "Derrick, a racially-confused Irishman raised in the hood by a black family is having the worst day ever. Determined to prove to his fed-up mother and would-be girlfriend that he's not a screw-up, he sets out to do one thing right (get some milk) and even that proves to be a challenge! Hilarious encounters with racist red-neck cops, local gangsters and 'flamboyant' pawn shop owners ensue, and along the way Derek shows that he can actually do things for others and maybe even get his own life together.",
      "similar": [],
      "original_title": "The Breaks",
      "runtime": 86,
      "poster_path": "/cgouTGUxzF7mKJng7apEpDOEyXR.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-02-26",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Meza"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Mitch Mullany"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181322/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTUxNjEwNzU1OV5BMl5BanBnXkFtZTcwMDk1MjQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Anthony Anderson, Isaiah Barnes, Max Becker | See full cast and crew »"],
      "reviews": [
         "All he has to do is come home with a carton of milk. \"The Breaks\" was one of the funniest movies that I've seen in a long time. It's the story of Derrick King (Mitch Mullany). Derrick , is an Irish immagrant who is raised by a black family in Compton. Derricks' mother finally gets fed up with his behavior as a brainless, thoughtless ,sex-crazed slacker that she kicks him out of the house unless he can successfully come home with a quart of milk. His holy quest for calcium, he runs into every kind of obstacle imaginable in the south central projects. This film is laugh a minute. Done in the true spirit of films like \"Friday\" \"CB-4\" and \"Don't Be a Menace to Society While Drinking Your Juice in the Hood\" it keeps the lauphs comming. The film spoofs scenes from \"Pulp Fiction\" \"Good Will Hunting\" and \"Good Times\" This is not a film for the squemish. Those who cringe at crude humor my not enjoy this film. For everyone else, rent it today, you wont be disappointed.",
         "I despise the 5.5 that this movie got. I totally loved this movie, it had everything that makes a ghetto movie funny and it was done very well. Mitch Mullany plays Derrick who is a white boy who keeps having bad luck with his \"fathers\" at an early age and finally ends up with a loving black family. The story follows Derrick through a typical day in the hood: Gangs, Police, Mama, Girls, Job and his friends. This movie is very entertaining in my opinion but you might need to be able to relate to the material or just be open minded. If you find swimming in a yellow pool to escape a coming out of the closet gang leader with your friend who nearly gets sodomized by an Eastern African artifact pulp fiction style while a screaming homosexual smears butter on your back then you would love this movie. I was looking forward to Mitch writing another funny story like this but haven't seen him do anything except have a short cameo in the beginning of \"The Sweetest Thing\". I give this movie a 3 out of 4 stars for what it is.",
         "A funny, funny, funny movie... It's ALMOST a typical \"day in the hood\" comedy, except it revolves around a White Irishman, raised by a Black family in Compton... Derrick (\"White Mike\" from \"Martin\"), accompanied by his best friend Chris (\"Cole\" from \"Martin\") adventure around the neighborhood, chased by Cops and Thugs, in search of a carton of milk... There are not only several side-stories to enjoy here, developing snippets of ideas from other movies (\"I'm Gonna Get You Sucka\", \"Friday\", \"Pulp Fiction\"), but there are countless guest stars from other \"day in the hood\" type movies, as well as from the rap, funk, and basketball worlds... If you like Friday, CB4, Fear Of A Black Hat, Don't Be A Menace To Society, Who's The Man, etc...You owe it to yourself to check out \"The Breaks\". I give it an 8/10 (with only Fear Of A Black Hat getting a higher score from me in this genre)",
         "After waiting weeks to locate the movie, I was not disappointed in finally getting to see it. I was laughing from the beginning to the end of that movie. I would definitely recommend this one to all of my friends who like this brand of comedy.",
         "This is full of laughs. It's about a white guy who's in a black family and lives in a primarily black neighborhood. One would expect this guy to have a hard time in this situation, but he fits right in. I wouldn't have found this movie if I hadn't been watching cable late one night. This should be more popular than it is. It's hilarious.",
         "A bag full of dead kittens? Sorry, no... while this movie is pretty stupid,crass and vulgar its also funny as hell.....If your into that sort of thing. Which i am. The story is about 1 guys day and a chain of events that i found to be hysterical...crass,tasteless and vulgar yes...but hysterical none the less. If you like ironic humor, if you like what i call tough luck comedy's (like \"theres something about Mary, or \"the mask\" or \"innerspace\")then you should like this movie. I think its good and that you should watch it if you can find it.....just so you know cable edits the movie for content so you might want to check out the real version of the movie from a video store",
         "I had a feeling that \"The Breaks\" would have some bad reviews on IMDb, but it is good to see that it had some very high ones too because it is not a bad movie. I think what turns people off is the opening sequence. The opening sequence in this movie is poorly acted and has some bad gags that could of turned out better if it was acted better. But don't have a negative attitude towards this movie forever after that. After the movie gets going it becomes funnier and the actors that did poorly in the beginning suddenly start doing well. And it is great for rest of the movie. The jokes in this movie (bar the opening sequence) are very funny and sometimes very original. There are some good laugh out loud moments. Acting wise it is pretty good (once again, bar the opening sequence). Some good cameos throughout too. Overall it is not the funniest movie ever but it is very entertaining. It may be enjoyed more if you are a fan of hip hop and/or hood movies but I'm pretty sure someone not familiar with that whole scene will still enjoy this movie. A funny, original comedy.",
         "From the same sub-genre as the Friday Trilogy (Ice Cube, Mike Epps), comes this story of a railroaded Irish boy who ends up being part of a black family living in the hood. Directed by Eric Meza (Director of House Party 3, and the hit TV series Smart Guy), The Breaks is up there with the best of its genre and should be better known than it is. Overall, the plot and the acting is a top notch quality and this film should not be dismissed lightly. Mitch Mullany (The Sweetest Thing) makes his leading role debut and totally nails it. I found this film for only £3.99 at my local HMV. BARGAIN!",
         "This is another of those gems that gets no attention or box office at the theaters. Don't ask me why; it's funnier and more original than most of the junk out in wide release. If you like wacky comedies in the style of \"Office Space\" and \"Kicked in the Head,\" check this one out. Not since \"Friday\" has there been as unique an interpretation of life in the> 'hood. Mitch Mullany gives a nice performance as an Irish kid adopted and raised by a black family in L.A. He also wrote the script, and did a good job there too. This movie has a style all its own. Rent it and have a good time.",
         "The Breaks Is A Hilarious Movie, I mean it depends on your sense of humor, the great thing is that it's funny for both blacks and whites. and it's not racist like some other movies...though at some times it is very stereotypical. Derrick Is the perfect character in the perfect setting. what more can i say i loved this movie if you haven't seen it, watch it. I showed it to 4 of my friends who had never even heard about it and they loved it. two thumbs up, five stars, should have won some kind of an award...joking but yes its worth watching i mean everything but the part in jail when Derrick \"has to have some funk\",\"we got to have some funk\" that part was just like huh?"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [],
      "summaries": ["A Sunday in the life of Derrick King, an Irish kid raised in South Central L.A. by a Black family. He talks Black, dresses Black, and thinks of himself as Black. It's a day of disasters: his mom kicks him out of the house, his uncle fires him, the woman he loves dismisses him as childish, the LAPD (wearing Confederate-flag shoulder patches) impounds his car and tosses him in the drunk tank, a mean dude is after him for money, he's imprisoned in a store basement by gay sadists, and he's shot at. Along the way, however, he shows kindness to a near-sighted kid, and those random acts may prove to be his salvation."],
      "budget": 0
   },
   "movielensId": 2508,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-02-26",
      "dvdReleaseDate": "2001-06-19",
      "directors": ["Eric Meza"],
      "runtime": 86,
      "movieId": 2508,
      "title": "The Breaks",
      "mpaa": "",
      "actors": ["Mitch Mullany"],
      "imdbMovieId": "0181322",
      "originalTitle": "The Breaks",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Derrick, a racially-confused Irishman raised in the hood by a black family is having the worst day ever. Determined to prove to his fed-up mother and would-be girlfriend that he's not a screw-up, he sets out to do one thing right (get some milk) and even that proves to be a challenge! Hilarious encounters with racist red-neck cops, local gangsters and 'flamboyant' pawn shop owners ensue, and along the way Derek shows that he can actually do things for others and maybe even get his own life together.",
      "tmdbMovieId": 15031,
      "avgRating": 2.43182,
      "releaseYear": "1999",
      "numRatings": 22,
      "posterPath": "/cgouTGUxzF7mKJng7apEpDOEyXR.jpg"
   }
}