{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "romantic rivalry",
            "id": 4516
         },
         {
            "name": "crush",
            "id": 9986
         },
         {
            "name": "unrequited love",
            "id": 10048
         },
         {
            "name": "neighbor",
            "id": 10226
         },
         {
            "name": "religion",
            "id": 11001
         },
         {
            "name": "summer",
            "id": 13088
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "first love",
            "id": 157303
         },
         {
            "name": "girl next door",
            "id": 222174
         }
      ],
      "imdb_id": "tt0119054",
      "video": false,
      "title": "Eight Days a Week",
      "recommendations": [
         82432,
         44593,
         42371,
         63447,
         202176,
         59293,
         78309,
         19381,
         17168,
         36447,
         28026,
         51177,
         20224,
         40562,
         24081,
         23855,
         20564,
         13169,
         45261,
         71394
      ],
      "backdrop_path": "/x8PqOgIdE6o4o7sCcQvjLzKhwrZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Peter",
               "gender": 0,
               "credit_id": "52fe46449251416c75072c87",
               "name": "Joshua Schaefer",
               "profile_path": null,
               "id": 78002,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Erica",
               "gender": 1,
               "credit_id": "52fe46449251416c75072c83",
               "name": "Keri Russell",
               "profile_path": "/6fZ5ceRvZtRkRm06HgaV4qCpJNY.jpg",
               "id": 41292,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Matt",
               "gender": 0,
               "credit_id": "52fe46449251416c75072c8b",
               "name": "R.D. Robb",
               "profile_path": "/j5xBAzZSS0VHj5kaKCbmc4XROPK.jpg",
               "id": 12711,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Peter's Father",
               "gender": 0,
               "credit_id": "52fe46449251416c75072c8f",
               "name": "Mark L. Taylor",
               "profile_path": "/uvqfJeuIQEHvbEDJWDZJcTBlzNy.jpg",
               "id": 78003,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Nick",
               "gender": 2,
               "credit_id": "5744abaec3a3685889000209",
               "name": "Johnny Green",
               "profile_path": "/wjx2eWoZ3GVuu4Po2gXGIdXbICn.jpg",
               "id": 21065,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Nonno, Marge's Dad",
               "gender": 2,
               "credit_id": "5744abe3c3a368587000022d",
               "name": "Buck Kartalian",
               "profile_path": "/4zIBbRsrjuZvu9jTFoJbu1L0u1F.jpg",
               "id": 111489,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Marge, Peter's Mother",
               "gender": 0,
               "credit_id": "5744ab799251414f9b0001e7",
               "name": "Marcia Moran",
               "profile_path": null,
               "id": 1311897,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "The Sad Man",
               "gender": 2,
               "credit_id": "5744ac849251414f86000231",
               "name": "Biff Manard",
               "profile_path": null,
               "id": 44790,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Sad Man's Wife",
               "gender": 1,
               "credit_id": "5744ac9fc3a368587000023b",
               "name": "Annie O'Donnell",
               "profile_path": "/A5Xg5Z9kKYHamBAFHhOZepUru18.jpg",
               "id": 61079,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Erica's Father",
               "gender": 2,
               "credit_id": "5744ac3ac3a3685889000217",
               "name": "Patrick Thomas O'Brien",
               "profile_path": "/4Gib9KkkKOHuqdVj5AItUJlY4xi.jpg",
               "id": 75325,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Erica's mother",
               "gender": 1,
               "credit_id": "5744ac5e9251414f9b0001fa",
               "name": "Darleen Carr",
               "profile_path": "/gTpAqx0G2gkpab7TpbgGpFcBUIJ.jpg",
               "id": 102860,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Crazy Lady",
               "gender": 1,
               "credit_id": "5744acc99251414f9b00020f",
               "name": "Ernestine Mercer",
               "profile_path": null,
               "id": 77581,
               "order": 11
            },
            {
               "cast_id": 26,
               "character": "Phil",
               "gender": 2,
               "credit_id": "577c6e11c3a368402500135c",
               "name": "Van Epperson",
               "profile_path": "/2l4N2WTYen9cz5HJKeDvIEtzsB1.jpg",
               "id": 158782,
               "order": 12
            },
            {
               "cast_id": 10,
               "character": "Ms. Lewis",
               "gender": 1,
               "credit_id": "5744ac06c3a368586d00024c",
               "name": "Catherine Hicks",
               "profile_path": "/b1UONnn9lsxqsxJYXnp3DWpUwpm.jpg",
               "id": 2022,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "Mary, Erica's Sister",
               "gender": 1,
               "credit_id": "5a46ff7c0e0a261724003996",
               "name": "Gabrielle Boni",
               "profile_path": "/dMHsoHqIwIlZdKaYLtr2wnC6LDB.jpg",
               "id": 1231029,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46449251416c75072c79",
               "name": "Michael Davis",
               "profile_path": "/s4u26Oo2fUqFc1ZwFqo4y8Hmh67.jpg",
               "id": 24949,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5744ad55c3a36868f6000156",
               "name": "Martin Cutler",
               "profile_path": null,
               "id": 1625443,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5744ad96c3a368586d000287",
               "name": "Michael Davis",
               "profile_path": "/s4u26Oo2fUqFc1ZwFqo4y8Hmh67.jpg",
               "id": 24949,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5744add1c3a36868f6000163",
               "name": "Gary Preisler",
               "profile_path": null,
               "id": 130405,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5744ae299251414f9100028e",
               "name": "Dale Rosenbloom",
               "profile_path": null,
               "id": 79983,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5744ae9c9251414f86000273",
               "name": "Kevin Bassinson",
               "profile_path": null,
               "id": 62272,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "5744aebac3a368587000027e",
               "name": "James Lawrence Spencer",
               "profile_path": null,
               "id": 62273,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5744aed1c3a3685878000282",
               "name": "David Carkhuff",
               "profile_path": null,
               "id": 1625446,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5744af04c3a3685874000295",
               "name": "Perry Bullington",
               "profile_path": null,
               "id": 31631,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5744af1b9251414f8f0002c2",
               "name": "Robert MacDonald",
               "profile_path": null,
               "id": 33144,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "5744af33c3a3685881000238",
               "name": "Chase Harlan",
               "profile_path": null,
               "id": 1475626,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "577c6eb29251411114002671",
               "name": "Michael Davis",
               "profile_path": "/s4u26Oo2fUqFc1ZwFqo4y8Hmh67.jpg",
               "id": 24949,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.032011,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15209,
      "vote_count": 15,
      "budget": 10000000,
      "overview": "Peter loves his next door neighbour Erica and, on the advice of his grandfather, decides to camp out on her front lawn for the entire summer, or until she agrees to go out with him. His father is none too happy about the idea and refuses to let his son back in the house, even to get a change of clothes.",
      "similar": [
         147773,
         2108,
         10229,
         8363,
         8193,
         112160,
         272693,
         315635,
         398818,
         449176,
         10625,
         9880,
         37725,
         26123,
         15144,
         308369,
         11397,
         286565,
         10545,
         1813
      ],
      "original_title": "Eight Days a Week",
      "runtime": 92,
      "poster_path": "/jMK6jJB8eoY0OsH2M75X32ZlxRi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Underdog Productions",
         "id": 44460,
         "origin_country": ""
      }],
      "release_date": "1997-01-17",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "He Came. He Sat. He Conquered.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Michael Davis"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["Michael Davis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119054/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwNjc4NjgzOV5BMl5BanBnXkFtZTcwNzI4NzIzMQ@@._V1_SY317_CR26,0,214,317_AL_.jpg",
      "actors": ["Stars: Joshua Schaefer, Keri Russell, R.D. Robb | See full cast and crew »"],
      "reviews": [
         "A film that I'd never heard of and chanced upon by accident, Eight Days a Week deserves to be a mainstay of teen cinema in the same way that John Hughes' eighties work is. Joshua Schaeffer has just the right balance of geek and cool individualism to pull off a character that could very easily fall into stalker territory and R.D. Robb is excellent as his sex-obsessed sidekick; keeping what could very easily become a caricature grounded in reality. The supporting cast of oddballs never overshadow the main story, but equally don't feel like padding as we learn more about their slightly kooky lives. It's a shame that films like this go unnoticed in a world where much more crass attempts at summing up teenage life (complete with thirty year old actors) can become box office hits.",
         "Michael Davis hits the nail right on the head when it comes to the complexities of the teen mind, mainly focusing on lust (on the lighter side), sexual frustration and determination. It takes place during the last free summer of a likable teen (a great Josh Schaffer). Inspired from a tale his grandpa Nono tells him, he sets out to win the affection of his life-long crush Erica (Keri Russell)by spending every minute of his summer on her front lawn. His task is not easy, as he must confront her bully boyfriend Nick (Johnny Green) and earn some respect from his father. There is rather brilliant writing and direction by Michael Davis with characters who are all complex in their own way and great acting to match them (R.D. Robb steals the show in an ingenious performance). There are some misfired jokes such as scenes involving an overly religious girl who plays with nun dolls (not offensive, just not very funny). Nonetheless, 8 DAYS A WEEK is a little gem from Davis who unfortunately didn't match success with 2000's 100 GIRLS.",
         "this is a very good movie, i thought it would be so pathetic and stupid though for the longest time, so i never rented it. but peter is an adorable, \"real-life\" character, and erica is okay too. i love that matt is devoted to his friend, but it would have been better if matt had been gay, with peter as his love intrest. the music is sub-par, and nothing special, but not detestingly bad or anything. a great coming of age movie for anyone. this movie is truly 6 or 7 seven years before its time. i don't know how this movie did in the box office or anything since i was merely 10 when it came into theaters but if it were to come out now it would be an enormous success. sad thing is that that is the last thing, tv or movie that josh schaeffer (peter) ever did, i wonder why? but anyway i whole-hearted suggest and recommend this movie to anyone not sure to rent it or buy or what-not. VERY-VERY GOOD! and i thought that it would be bad because it had keri russell in it, how wrong i was... you won't regret it, watch it!",
         "I wouldn't read the rest of this if you did not see the movie. I am much closer to the parents' ages in this movie. Not that that in itself means I am the wrong audience for this movie, but let's say I am not the target demographic either. Nevertheless, the movie was very funny, very touching and I ended up loving it, despite some missteps along the way. Peter is a self-proclaimed 'spaz' who is pining away for the beauty across the street, Erica. He vows to spend all his time under her bedroom window in order to win her love. The neighborhood is filled with colorful characters, beginning in Peter's house with his Grandfather who gives Peter the inspiration to follow his dream. His best friend lives nearby, too, but he is mostly consumed with his fantasies of sex. One of the neighbors works for the FBI and circles the block several times before parking. There is the stereotyped 'crazy' neighborhood lady, who eats in the car, mows the lawn at night and does gardening in her scuba mask and mouthpiece. There are neighborhood kids and enough to keep Peter occupied until Erica dumps the jerk (he is needlessly disgusting) she is currently dating. As the movie progresses, there are many hysterically funny scenes (Peter talks at length about Erica's body, down to the smallest detail), some touching ones (when Peter tells the crazy lady what the neighbors say about her, she has a good reason for the things she does - eats in the car because the radio reception is better, mows the lawn at night due to the humidity) and some stupid ones (his Grandfather passes away & Peter is suspicious of another neighbors' habit of dragging heavy bags in and out of his house). It all comes together in the end, Peter grows up and gets the girl. To say this was better than I was expecting is a huge understatement. I was happy to spend 90 minutes on Peter's block with him & the neighbors.",
         "This is a wonderful yet obscure teen romantic comedy. If you can even call it that. I do not remember how I came across it, but ever since I have looked everywhere to find it. Finally I did, and I have watched it WAY to many times, and I laugh hard every time.",
         "I saw this movie for the first time on Comedy Central while I awoke from being passed out on my bed one night, and I didn't exactly know what to expect... that's especially good if you haven't seen a movie. Anyway, I've heard a lot of reviews about this movie. Some ranging from good reviews saying that this is \"The thinking-man's American Pie,\" to bad reviews stating that this has already been done. Say what you will about this movie. Unlike that other movie, however, there is dialog in the right places, likable characters, and most important of all, an actual plot... Keri Russell as the female lead didn't hurt matters either. This movie is an underrated classic that I think everyone should see just once. 10/10",
         "i saw Eight Days a Week one night late on HBO, and I thought it was really funny. I liked the way jokes were presented and narrated by the main character Peter who has sort of a dry sense of humor. I recommend this to any teenager, also if you like this movie you must see 100 Girls, which in my opinion is almost a rip off,(although also good) of Eight Days a week with a few more twists in it. See this movie.",
         "I stumbled upon this film on HBO about a month ago thinking it would be a dull movie, but through about thirty minutes through the film I realized it wasn't and that it was one of the funniest films in the world. Most adults could find this humour angering and dense, but teenagers would find this movie funny, good plotted with a good storyline. And what about Keri Russell who is so hot in this film. I give this movie ten out of ten. Please watch this movie because it is good, funny, and ABSOLUTELY GREAT!!",
         "This movie is about a guy that is in love with a gal and decides to impress her by standing outside her house until she decides to give him a chance. This leads to him observing different aspects of the neighborhood and it does lead to him and the girl talking more. His friend, unfortunately, ends up feeling neglected because this is their last summer together and his friend is just standing on a lawn. He even watches kids to pass the time. For the most part this movie was pretty funny and there were some interesting characters to watch. The main problem I had with the movie was the ending. Spoilers ahead***The ending to me just played out a bit to happily. In the end it wasn't very realistic as the girl nine times out of ten usually never goes with the guy that really cares about them, but rather the dumb jerk, especially at that age...so a better ending might be the guy finding a gal that was more in tune with him.",
         "i saw Eight Days a Week one night late on HBO, and I thought it was really funny. I liked the way jokes were presented and narrated by the main character Peter who has sort of a dry sense of humor. I recommend this to any teenager, also if you like this movie you must see 100 Girls, which in my opinion is almost a rip off,(although also good) of Eight Days a week with a few more twists in it. See this movie."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": ["Underdog Productions"],
      "summaries": ["Peter loves his next door neighbour Erica and, on the advice of his grandfather, decides to camp out on her front lawn for the entire summer, or until she agrees to go out with him. His father is none too happy about the idea and refuses to let his son back in the house, even to get a change of clothes. Peter's friend, Matt, thinks Peter should give up on women (like he has) and just have sex with fruit, and have a total devotion to masterbation."],
      "budget": 0
   },
   "movielensId": 2509,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-01-17",
      "dvdReleaseDate": "2006-05-02",
      "directors": ["Michael Davis"],
      "runtime": 92,
      "movieId": 2509,
      "title": "Eight Days a Week",
      "mpaa": "R",
      "actors": [
         "Joshua Schaefer",
         "Keri Russell",
         "R.D. Robb",
         "Mark L. Taylor",
         "Johnny Green",
         "Buck Kartalian",
         "Marcia Moran",
         "Biff Manard",
         "Annie O'Donnell",
         "Patrick Thomas O'Brien",
         "Darleen Carr",
         "Ernestine Mercer",
         "Van Epperson",
         "Catherine Hicks",
         "Gabrielle Boni"
      ],
      "imdbMovieId": "0119054",
      "originalTitle": "Eight Days a Week",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Peter loves his next door neighbour Erica and, on the advice of his grandfather, decides to camp out on her front lawn for the entire summer, or until she agrees to go out with him. His father is none too happy about the idea and refuses to let his son back in the house, even to get a change of clothes.",
      "tmdbMovieId": 15209,
      "avgRating": 2.92614,
      "releaseYear": "1997",
      "numRatings": 176,
      "posterPath": "/jMK6jJB8eoY0OsH2M75X32ZlxRi.jpg"
   }
}