{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113360",
      "video": false,
      "title": "The Hunted",
      "recommendations": [
         102059,
         71456,
         40480,
         102947,
         9458,
         63988,
         47364,
         19002,
         11955,
         70180,
         26261,
         11119,
         2038,
         48781,
         46943,
         38940,
         18998,
         34309,
         76171,
         61016
      ],
      "backdrop_path": "/q5hX1QyhlQbJnolPLOVhjc7Pk0A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Paul Racine",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc45",
               "name": "Christopher Lambert",
               "profile_path": "/sIl2F9LDTjfnAVBxEG5CTtZGuJU.jpg",
               "id": 38559,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Kinjo",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc49",
               "name": "John Lone",
               "profile_path": "/qlzum4vK8Snzp65jiUVpZGYPzFE.jpg",
               "id": 11389,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Kirina",
               "gender": 1,
               "credit_id": "52fe44df9251416c9101fc4d",
               "name": "Joan Chen",
               "profile_path": "/ekWS5bAB0kv4RColHqYaUAoXz0I.jpg",
               "id": 6720,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Takeda Sensei",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc51",
               "name": "Yoshio Harada",
               "profile_path": "/1kLX739e1FkvMheOsyXIR6vP5r4.jpg",
               "id": 81108,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mieko Takeda",
               "gender": 1,
               "credit_id": "52fe44df9251416c9101fc55",
               "name": "Yoko Shimada",
               "profile_path": "/AcTCFeldQvS1gfbaPWXJ0WEOcxG.jpg",
               "id": 80607,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Junko",
               "gender": 1,
               "credit_id": "52fe44df9251416c9101fc59",
               "name": "Mari Natsuki",
               "profile_path": "/oPCV2XYAJ4D1tK0OdJ2PPQbug5I.jpg",
               "id": 19589,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Oshima",
               "gender": 0,
               "credit_id": "52fe44df9251416c9101fc5d",
               "name": "Tak Kubota",
               "profile_path": "/f2H9rvA1dbax5vpRcQAVwCildtA.jpg",
               "id": 84656,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Lt. Wadakura",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc61",
               "name": "Masumi Okada",
               "profile_path": "/ur60NjAiEol6HHaCDbMbu9YLI9N.jpg",
               "id": 305332,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Ryuma",
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc65",
               "name": "Toshishiro Obata",
               "profile_path": "/fgHL5HDrxD4zelKQrzQdARy0WSL.jpg",
               "id": 953728,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc3b",
               "name": "J. F. Lawton",
               "profile_path": "/b3EoYJqYlYwNjmBX4Be0iByMoPD.jpg",
               "id": 1203,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44df9251416c9101fc41",
               "name": "J. F. Lawton",
               "profile_path": "/b3EoYJqYlYwNjmBX4Be0iByMoPD.jpg",
               "id": 1203,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.156224,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 32631,
      "vote_count": 30,
      "budget": 0,
      "overview": "A businessman on a trip to Tokyo ends up in the middle of a centuries old feud between a criminal Ninja cult and a Samurai when he witnesses a assassination performed by the Ninja-cult leader.",
      "similar": [],
      "original_title": "The Hunted",
      "runtime": 106,
      "poster_path": "/llu5wgQGYyMVDnz4p8ds8Um3lUa.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bregman/Baer Productions",
            "id": 11393,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-02-24",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "He's trapped in a world where killing is an art and revenge is an obsession",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["J.F. Lawton"],
      "runtime": 106,
      "synopsis": "Paul Racine (Christopher Lambert), a computer-chip executive from New York, is on one of his many business trips to Nagoya. He meets a beautiful woman named Kirina (Joan Chen) in the hotel lounge, and ends up having a one-night-stand with her. When he attempts to further the relationship, Kirina implies that she has no future and thanks him for a wonderful night of pleasure and love. Dejected and somewhat confused, Paul reluctantly leaves her to be alone as she requests. Soon after the gaijin leaves her suite, however, she is approached by Kinjo (John Lone) and two other men dressed as ninja. Kirina shows no fear and explains that she has accepted her fate. Kinjo, the leader of a cult of ninja assassins, is impressed by the woman's courage and grants her final wish by showing her his face. Paul, who had left with the wrong room key, returns and, upon seeing the situation, hides in the foyer while calling the police. When Kinjo decapitates Kirina (after telling her that she's the first person outside of the cult ever to see his face), Paul first tries to come to her defense, alerting the three ninjas to his presence and then tries to flee. Enraged that someone else has seen his face, Kinjo's men stab Paul, hit him with a poisoned shurkien, and slash his throat, leaving him for dead. Paul awakes in a hospital room, where he is told that the wound will heal, but his claims of seeing Kinjo are met with disbelief by the police. He is soon approached by a man named Takeda (Yoshio Harada), who is an expert on the cult, and Kinjo in particular. Paul later discovers that Takeda is the last in a long line of samurai and has his own score to settle with Kinjo. After the ninja attempt to murder Paul at the hospital, killing six police officers in the process. Takeda and his wife Mieko (Yoko Shimada) decide to take Paul to their family's stronghold, located on an island several hundred miles away. In leaving the city, however, Takeda uses Paul as bait to draw Kinjo out. This leads to a battle on a bullet train in which several passenger cars worth of innocent people are slaughtered by the ninja. Takeda and Mieko defeat the attackers, only to learn that Kinjo was not among them. The ninja leading the attack was Junko, Kinjo's lover, giving the ninja master personal motivation to kill Paul and Takeda. While on the island, Paul spends much time with the drunken blacksmith Oshima, who is constructing a new sword for Takeda (he had furiously broken his own sword following the train fight when police confiscated it as evidence), and the old man teaches him about both smithing and swordsmanship. Mieko explains to him the history of the two clans' conflict as well as the samurai concepts of courage and honor. Mieko is sympathetic toward the gentle and compassionate Paul, the polar opposite of her moody and somewhat-deranged husband, although she remains fiercely loyal to Takeda. Meanwhile, Kinjo decides to find out who hired his clan to murder Kirina. The man he finds (James Saito) is a powerful Yakuza figure who bought Kirina from her father, then ordered her death when she left him after years of servitude. Kinjo, disgusted that he killed an innocent woman over such a petty grievance, kills the man. Three weeks later, Takeda's new sword is ready, and Paul's injuries have healed considerably. When Paul announces that he wants to leave the island and return home to New York, Takeda has him imprisoned and sends a message to Kinjo telling him Paul's whereabouts. Takeda's inexperienced samurai are overwhelmed by the hordes of ninja who arrive on the island, but Takeda finally gets the duel with Kinjo that he has wanted all along. Kinjo stabs Takeda through the torso; Takeda in turn manages to stab Kinjo in the leg, but soon dies. As Kinjo is about to kill a helpless Mieko he is caught off-guard by Paul, whom Oshima had released on Mieko's instructions. Paul stabs Kinjo in the arm, but now finds himself face-to-face with his would-be killer, armed with only a sword he barely knows how to use. With his new-found skills, a lot of luck (the injuries to Kinjo's leg and especially to his arm), and the assistance of a wounded Mieko, Paul manages to decapitate Kinjo, as he had done to Kirina. The film ends with Paul, Mieko, and Oshima starting to head up the hill toward the castle in the distance.",
      "writers": ["J.F. Lawton"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113360/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MjA5Nzg1M15BMl5BanBnXkFtZTcwOTU5ODEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Lambert, John Lone, Joan Chen | See full cast and crew »"],
      "reviews": [
         "Most of Christopher Lambert's filmography reads like a guide to B-movie hell. I got conned into watching this by a friend years ago, and will be forever grateful. The story is solid, Lambert turns in an almost-acceptable performance, and most of the rest of the cast does well. My favorite thing about the movie is the (by martial arts flick standards) realism. The gaijin does not miraculously learn to swing a sword like a samurai in a matter of weeks, months, or ever. The action sequences are exciting and fairly well-executed (by 1990's b-movie standards, at least), particularly a ninjas vs samuri scene on a Japanese bullet train. Some of the characters have a bit of complexity, there are a few little plot twists, and the character interaction is often believable. They also answer that age-old question \"who'd win a fight between a middle-aged ex-athlete with a few months of kendo training and a ninja who's just lost an arm and leg\"? (Lamberts's character is a former fencer turned businessman, but that bit's cut out of the home video/DVD version, as is the monologue by Kinjo the ninja, which helps to serve---in part, at least, as an explanation as to why this movie, set in Japan, has almost an entirely Chinese cast). If you're in the mood for an fun, entertaining, semi-intelligent B-action flick, I whole-heartedly recommend this one. Oddly enough, the writer of \"Pretty Woman\" wrote and directed this flick, which may explain why my wife liked it, too. Of course, the same guy did a flick called \"Cannibal Women in the Avocado Jungle of Death\".",
         "\"The Hunted\" is one of those movies that tries to give you an insight in the Japanese code of honor. So when a western business-man, a witness in the murder of a call-girl, becomes the hunted, the question arise \"How far can a code of honor go?\". What struck me in this movie is the excellent use of the Japanese scenery i.c. Tokyo, the bullit-trains, the temples, the ninja way of life...The score is by the heart beat drummers Kodo. A great action packed movie with a lot of tension in a very beautiful package! Don't lose your head!",
         "The Hunted is surprisingly high in production values, acting and story. It also provides a nice inside look into Japanese culture and society. Blood and Gore of course, are a plenty. Christopher Lambert played his role very well and kept his naiveté and innocence very well portrayed, while finding himself in the middle of a war. The sword-fight choreography is decent and very realistic. The Japanese actors put on a splendid show. This a gripping, colorful and highly satisfying film that will never have you bored at any point. I find it quite under-rated because it is quite well developed despite its obscurity. This is something I would recommend to any viewer.",
         "Samurai flicks may be considered a guilty pleasure, but this one is well worth watching. It is not a Toshiro Mifune classic, but it features plenty of Samurai action and lots of blood is spilled. Christopher Lambert (Highlander I, II, and III; Mortal Kombat) plays an American businessman who picks up an extremely lovely Joan Chen (Lust, Caution; Xiu Xiu: The Sent-Down Girl) in a bar and they have a pleasurable time before ninjas arrive to kill her for a transgression. The leader, John Lone (The Last Emperor, Year of the Dragon) is identified and the hunt begins. The businessman enlists the help of super Japanese actor Yoshio Harada and Yôko Shimada (Shogun and \"Shogun\"). What he doesn't realize ifs the Samurai isn't really interested in helping, he just wants to do battle with the Ninja. It's fast paced and exciting with enough exploitation to make it special.",
         "Businessman Paul Racine is in Japan for work when he is picked up by an attractive young woman. He goes back to her flat but leaves early. Going back after second thoughts Racine witnesses her being killed by the mysterious ninja assassin Kinjo. He survives Kinjo's ninjas but is badly hurt. In hospital he is approached by Takeda and his wife, who offer him protection as everyone else who has seen Kinjo face has been killed. After a ninja attack on his hospital Racine goes with them and they prepare for a final showdown. I've seen this film twice now. This second time I watched it because I wanted to review it but couldn't remember it clearly enough to be fair on it. The second viewing reminded why it had faded in my mind \u0096 it is trashy yet enjoyable fun. The plot is poor (laughable parts and inconsistencies) but it is short, has energy and requires no thought. The idea that this businessman would survive several ninja attacks when training samurai are easily killed is silly. Worse still is the idea (no matter how justified) that Racine could even temporarily match any of these men after only a few basic lessons in how to hold a sword! However it is quite exciting if you're in the mood. The high point is probably a train journey that is exciting simply because it is shockingly violent in it's intent. The addition of some comic relief in the final third (the old swordmaker) helps the film along to the conclusion. Although it is not great, it is slightly refreshing to see a film of this genre without tonnes of flashy wire work or moves (having just suffered Bulletproof Monk and Cradle 2 The Grave I was glad of the basic fights). Little inconsistencies spoil it slightly \u0096 in one scene Racine is saved when a samurai sword jams in a wooden door, however later the same swords easily cuts though thick wooden pillars. Those looking for something trashy and slightly exciting should be pleased I think. Lambert is not great in the lead and the film suffers form his character being the focal point. He mumbles his way through his lines (I think he thinks it makes him tough and mysterious) and his transformation from green businessman to ninja warrior is of no value. On the flip side of this is Yoshio Harada. Harada gives a really cool performance \u0096 he is strong and driven with an air of mystery, the script even makes him a little dark and complex too! The film would have been better if it had gradually swung the films focus from Racine to Harada's Takeda. Lone is OK as Kinjo but is not as meaty a role as Takeda. Considering the quality of the film I was watching I thought Harada did very well. Overall I was ready for a trashy ninja movie with low value but reasonably entertaining \u0096 and that's what I got. Anyone looking for more than that should look elsewhere, but if you're in the mood this forgettable ninja movie will pass 90 minutes without being disappointing.",
         "Christopher Lambert stars as a businessman who witnesses the slaying of a woman (Joan Chen) who he had just slept with, when the ninja (John Lone) is spotted face and all, the ninja stops at nothing to kill Lambert and it's only a rival ninja clan which teaches Lambert how to defend himself and win in a sword fight, Sean Connery of course is nowhere to be found this time. Lambert has a weird charisma about him, he really isn't that strong of an actor but for some reason he is able to get us to watch him and his screen presence almost always makes his hero generally more interesting than a musclebound action star who projects little sympathy. Lambert comes off rather vulnerable and the villains he's up against are no slouches either. They are ruthless SOBs, for instance they actually slaughter a train of innocent by standers all because they don't want any witnesses. This includes old people, children, mothers you name it they bit the big one. In theaters this was an experience which shocked a lot of us and the crowd I was with, were prepared for brutal action. The Hunted works as a Ninja actioner and is generally better polished than almost anything made in the 80's. It's slick, brutal and overall a fast paced actioner which in the end, is all we ask for. * * * out of 4-(Good)",
         "This film, The Hunted, is written and directed by the guy (J. F. Lawton) who wrote us the first Under Siege movie with Steven Seagal, directed by Andrew Davis. The Hunted stars Christopher Lambert who was OK in Highlander by Russell Mulcahy and who is not too bad action star. The Hunted is not a great movie but it should satisfy action fans, especially mainstream action fans. Chris is an American businessman visiting Japan and he sees the secret face of a masterful assassin, somekind of a yakuza cult member/leader. Soon Christopher finds himself in the middle of bloody and fastly edited swordfights and understands that his life is what they want. He gets some help from a rival \"gang\" and now they must destroy the evil clan that is on their tail.. There is one extremely suspenceful sequence in a train, which is filled with evil ninjas and so no passenger is safe. The train goes fast and there's no way to escape. That sequence is a highlight of this film and proves that the director can direct great action scenes if he wants to. The film runs pretty long, approximately 1h 50 min in NTSC speed, but there are no significantly irritating boring moments and the film is easy to sit through. We are not talking about a classic picture but it is nice to see that these kinds of films were still made by big studios in USA as \"recently\" as 1995. The fights are often bloody but not too bloody. If one is bored with PG13 crap and stupid films which try to make money as much as possible, then I suggest trying this film for example. And fans on Seagal, Damme and other action kickers/fighters should also like the often nihilistic attitude of The Hunted. 6/10 and I recommend this to action film fanatics especially!",
         "People should realize there is a difference between ninja movies and action movies. They aren't necessarily one and the same. And this, my friends, is a ninja movie. Sure, there are fights and violence to be found, but they don't give a 'Hollywood' feel to it. Especially the train scene comes to mind, where the ninja's decide to kill everybody in order to leave no witnesses. It's calculated, and it gives a sense of murder and terrorism to it instead of action. The victims aren't generic enemies, they're real people. A lot of care is put into the realism. Cops show up after a murder scene to investigate. How often have we seen a ninja movie where ninja's or people are killed, without that ever happening? The whole movie involves ploy and strategy, leading to the fight scenes. Christopher Lambert receives sword training and his enemy is wounded before the final fight, to give Lambert a realistic underdog chance to win. There's nothing 'romantic' about his training like, say, Van Damme in kickboxer. Lambert is scared and clinging to every edge he can find to live, whilst most of the samurai consider him worthless. I first went into this movie expecting an action flick, and was disappointed. Then, I watched it again, and realized it was great. The movie deserves credit for staying true to the formula.",
         "At first, I refused to watch this film, only because Christophe Lambert; this french gifted actor who literally wasted his skill in garbage grade Z stuff over the Atlantic. So, because of him, I did not see this film in theatre, at its release time, but afterwards, on TV. and I admit that it was a good surprise, as were nearly all the American Japanese movies I have seen in my life. When I watch this one, I of course think of THE CHALLENGE, YAKUZA, BLACK RAIN, BLUE TIGER all features speaking of the these two cultures - Japanese and US - colliding. Yes, a great little flick, with tremendous scenes, but don't compare it to the other ones I talked about just above. It is a little worst, although a pretty good time waster. And one of the best post GREYSTOKE and HIGHLANDER Christophe Lambert's films. But, I insist, certainly not because of him.",
         "Samurai movie with well staged scenes , colorful ambient , professionally directed and Japan set . The story starts with a quote by Daidoh Yuzan , 16th Century : ¨One who is a Samurai must before all things keep constantly in mind . By day by night..the fact that he has to die¨. It deals with Paul (Christopher Lambert) a computer-chip executive from New York travels to Tokyo , there he finds a gorgeous Japanese girl (Joan Chen) . After that , he inadvertently interrupting his meeting by a killing . As he is now the only man to have seen the figure of the cult's warrior-chief (John Lone) named Makato and nobody has survived after seeing his face , as he soon realizes that he is taking on a markedly foreshortened life-expectancy . Then , he joins forces with a friendly samurai couple (Harada and Shimada) who helps him . Later on , at a speed train takes place a violent face off between Ninja-sect hoodlums and Sensei , his wife along with Paul ; the result is an astonishing massacre . Ultimately , Paul recuperating on an island-fortress and learning about life and sword-play . Finally , there occurs the definitive final duel between Ninjas from Makato clan and Takeda faction . This Ninja film packs bloody swordplay , spectacular martial-arts and noisy action sequences . This is a colourful , mostly filmed in Japan and medium budget movie ; leave no cliché untouched , though the rife fighting is magnificently staged . Amid the glamour of the scenarios is developed an intrigue about feud among Japanese factions , a two-centuries-old blood-confrontation with the Ninja and Takeda clan , including betrayal , crime and exploring the dark side of vengeance . Overwhelming and rousing fights with deadly use of Katanas , feet and palms , along with such weapons as swords , sticks , lances and ¨Shuriken¨. It contains usual learning period in which the naive businessman learns a little about courage, honor, love, swordsmanship and loyalty . The picture is full of tumultuous sequences with frenetic action , surprises , climatic combats and groundbreaking struggles . Passable acting by Christopher Lambert as a businessman who finds himself struggling to survive in the wrong place at the wrong time , and John Lone is good as a feared Ninja chief . And enjoyable couple formed by Yoshio Harada as Takeda Sensei and Yôko Shimada as Mieko Takeda . Nice production design with exterior shots of the train were filmed on location on Japan, however, the interior shots were filmed on a set at Bridge Studios in Vancouver, B.C. ; the scenery rushing by outside the windows was simulated using large rotating drums with \"blurred\" scenery painted on it . Colorful cinematography by Jack Conroy , full of red shades and bright images . Monotonous and syncopated musical score by means of continuous drum sounds . The motion picture produced in moderated budget was well directed by J.F. Lawton, though with no originally . He wrote a number of feature film scripts including one called \"Three Thousand\", which was selected by the Sundance Institute , Touchstone Pictures purchased the script and later he changed the title to Pretty Woman (1990). He also wrote a script for Blankman (1994) , Chain reaction (1996) and DOA: Dead or Alive (2006), a film based on the huge video game series success of the same name . After that , he then wrote and directed Jackson (2008), a failed comedy-drama-musical . ¨The hunted¨ turns out to be one an acceptable film , including exciting attacks and groundbreaking fighting perfectly staged , the result is a strong entry for action buffs"
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Davis Entertainment",
         "Bregman/Baer Productions"
      ],
      "summaries": [
         "Paul is on one of his many business trips to Tokyo, as a computer-chip executive from New York, when he meets a beautiful and mysterious woman. Later, he finds himself in the wrong place at the wrong time, inadvertently interrupting an assassination by a feared Ninja-cult. As he is now the only man to have seen the face of the cult's warrior-leader and lived, he soon realizes that he is facing a markedly foreshortened life-expectancy. Teaming up with a friendly samurai couple, on a two-centuries-old blood-feud with the Ninja, he struggles to survive. Finally, recuperating on an island-fortress, he learns swordsmanship, and perhaps, a little about courage, honor, love, and loyalty. The requisite final confrontation is rife with bloody swordplay and spectacular martial-arts action sequences.",
         "A man visiting Japan picks a local woman. He then takes her to his hotel room. That's when he is attacked and the woman killed. He is brought to the hospital. The doctor tells him that the one who nearly killed is Kinjo, a ninja assassin, and that he is marked for death. The policeman who talks to him tells him that Kinjo is an urban legend. Later someone tries to kill him but a couple saves him. They go on the run. The woman tells him that her husband's cult and Kinjo's have been at war for centuries. They hope that he will make Kinjo come to him so that he could kill him."
      ],
      "budget": 0
   },
   "movielensId": 251,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch"
      ],
      "releaseDate": "1995-02-24",
      "dvdReleaseDate": "1998-12-15",
      "directors": ["J. F. Lawton"],
      "runtime": 106,
      "movieId": 251,
      "title": "The Hunted",
      "mpaa": "R",
      "actors": [
         "Christopher Lambert",
         "John Lone",
         "Joan Chen",
         "Yoshio Harada",
         "Yoko Shimada",
         "Mari Natsuki",
         "Tak Kubota",
         "Masumi Okada",
         "Toshishiro Obata"
      ],
      "imdbMovieId": "0113360",
      "originalTitle": "The Hunted",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["-SVsKN8F5Jw"],
      "plotSummary": "A businessman on a trip to Tokyo ends up in the middle of a centuries old feud between a criminal Ninja cult and a Samurai when he witnesses a assassination performed by the Ninja-cult leader.",
      "tmdbMovieId": 32631,
      "avgRating": 3.0396,
      "releaseYear": "1995",
      "numRatings": 404,
      "posterPath": "/llu5wgQGYyMVDnz4p8ds8Um3lUa.jpg"
   }
}