{
   "tmdb": {
      "original_language": "ja",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0084390",
      "video": false,
      "title": "The Ballad of Narayama",
      "recommendations": [
         185987,
         31104,
         42112,
         29933,
         33319,
         4781,
         115647,
         20506,
         49571,
         42984,
         43339,
         4962,
         44190,
         35124,
         27523,
         101929,
         83234,
         17905,
         4286,
         45694
      ],
      "backdrop_path": "/k4xTdpybiySXdA43KdskW1Plh3S.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tatsuhei",
               "gender": 2,
               "credit_id": "52fe45eec3a36847f80e2ad1",
               "name": "Ken Ogata",
               "profile_path": "/3Lv1AarZoHxBkUCHVA0s3vDN9iQ.jpg",
               "id": 95345,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Orin",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2ad5",
               "name": "Sumiko Sakamoto",
               "profile_path": null,
               "id": 142451,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Risuke",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2ad9",
               "name": "Tonpei Hidari",
               "profile_path": null,
               "id": 142452,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Tamayan (as Aki Takejô)",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2add",
               "name": "Aki Takejo",
               "profile_path": null,
               "id": 142453,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Katsuzô (as Shôichi Ozawa)",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2ae1",
               "name": "Shoichi Ozawa",
               "profile_path": "/ht4yEUx9l4P9ckxu9zJPTjCDqvH.jpg",
               "id": 142454,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jinsaku",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2ae5",
               "name": "Fujio Tokita",
               "profile_path": "/qB7mFr6AbUZl0zFJcWMydySa25F.jpg",
               "id": 142455,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Zeniya no Tadayan",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2ae9",
               "name": "Sanshô Shinsui",
               "profile_path": null,
               "id": 142456,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Kesakichi",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2aed",
               "name": "Seiji Kurasaki",
               "profile_path": null,
               "id": 142457,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Matsuyan",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2af1",
               "name": "Junko Takada",
               "profile_path": null,
               "id": 142458,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Teruyan",
               "gender": 2,
               "credit_id": "52fe45eec3a36847f80e2af5",
               "name": "Taiji Tonoyama",
               "profile_path": "/o3YTph69XZqKeZOerzUpTTAYirW.jpg",
               "id": 33732,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Arayashiki (as Kêshi Takamine)",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2af9",
               "name": "Casey Takamine",
               "profile_path": null,
               "id": 142459,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Tsune",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2afd",
               "name": "Nenji Kobayashi",
               "profile_path": "/gEBO5Wv31F2XlLjZ0G5RwhiRqnt.jpg",
               "id": 72495,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Okane",
               "gender": 1,
               "credit_id": "52fe45eec3a36847f80e2b01",
               "name": "Nijiko Kiyokawa",
               "profile_path": null,
               "id": 86859,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Amaya",
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2b05",
               "name": "Akio Yokoyama",
               "profile_path": null,
               "id": 142460,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Oei",
               "gender": 1,
               "credit_id": "52fe45eec3a36847f80e2b15",
               "name": "Mitsuko Baisho",
               "profile_path": "/5DGRshdcWGz2QHOxWJm6LYXqc8T.jpg",
               "id": 72605,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2acd",
               "name": "Shōhei Imamura",
               "profile_path": "/4sULUAZvllOvsWLT0ngtBFRbXBT.jpg",
               "id": 20025,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2b0b",
               "name": "Shōhei Imamura",
               "profile_path": "/4sULUAZvllOvsWLT0ngtBFRbXBT.jpg",
               "id": 20025,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45eec3a36847f80e2b11",
               "name": "Shichirô Fukazawa",
               "profile_path": null,
               "id": 142461,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "583265f692514162cb032885",
               "name": "Gorô Kusakabe",
               "profile_path": null,
               "id": 1517984,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "583265eec3a3685bad02e954",
               "name": "Shinichirô Ikebe",
               "profile_path": null,
               "id": 71029,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "583265fd92514162cb03288d",
               "name": "Jirô Tomoda",
               "profile_path": null,
               "id": 1391878,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58326603c3a3685bad02e965",
               "name": "Hiroshi Kanazawa",
               "profile_path": null,
               "id": 1439858,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5832660ac3a3685b9d033336",
               "name": "Shigeru Komatsubara\t",
               "profile_path": null,
               "id": 551489,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5832661092514162c903256e",
               "name": "Masao Tochizawa",
               "profile_path": null,
               "id": 550543,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5832661892514162c9032577",
               "name": "Gorô Kusakabe",
               "profile_path": null,
               "id": 1517984,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5832661e92514162c003140b",
               "name": "Hisao Inagaki",
               "profile_path": null,
               "id": 548022,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58326630c3a3685ba80317a2",
               "name": "Tadataka Yoshino",
               "profile_path": null,
               "id": 1600708,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58326664c3a3685ba1036e82",
               "name": "Kyoto Isho",
               "profile_path": null,
               "id": 1711824,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.749029,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 42113,
      "vote_count": 39,
      "budget": 0,
      "overview": "In a small village in a valley everyone who reaches the age of 70 must leave the village and go to a certain mountain top to die. If anyone should refuse he/she would disgrace their family. Old Orin is 69. This winter it is her turn to go to the mountain. But first she must make sure that her eldest son Tatsuhei finds a wife.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "楢山節考",
      "runtime": 130,
      "poster_path": "/ewYZmeoqzE5XsL0Jlcorlu9iwGe.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Toei Company",
         "id": 9255,
         "origin_country": ""
      }],
      "release_date": "1983-04-09",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "Only Time Could Change the Cruelty of Tradition… Only Their Love Could Survive It…",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Shôhei Imamura"],
      "runtime": 130,
      "synopsis": null,
      "writers": [
         "Shôhei Imamura",
         "Shichirô Fukazawa"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0084390/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcwNjMzODE4Nl5BMl5BanBnXkFtZTcwMDM4ODE3MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ken Ogata, Sumiko Sakamoto, Tonpei Hidari | See full cast and crew »"],
      "reviews": [
         "Death and what it means is the theme of the haunting and sensuous Ballad of Narayama, a Cannes Film Festival Grand prize winner from 1982 by Shohei Imamaura (Black Rain, The Eel, Dr. Akagi). Based on a novel by Shichiro Fukazawa, this spellbinding film takes place in a rural mountainous area in northern Japan about one hundred years ago. Because the villager's rice crop is meager and starvation is a chronic threat, according to village custom, the elderly must go to die on the summit of Mount Narayama when they reach the age of 70. Group survival depends on it and death is accepted as a fact of life in the village. I must admit I had a hard time during the first hour being engaged with this film and sorting out all the characters. I found the graphic depiction of the cruel realities of village life to be ugly and often vulgar. For example, one character has sex with a village dog, an entire family is buried alive because they have been accused of stealing, and two snakes copulate next to a couple's sexual encounter in the woods. As the film progressed, however, I found it easier to accept how the brutal struggle for survival ensures continuance and self-preservation. The story concerns Orin (Sumiko Sakamota) who, in her seventieth year, must complete all the loose ends in her life before she goes to die. One widowed son must find a new wife, another has to sleep with a woman for the first time, and the third needs to be taught manners. When Orin realizes it is her time to be taken to Narayama, her son Tatsuhei (Ken Ogata) carries his mother to the mountain on his back in scenes of ethereal beauty reminiscent of Sokurov's Mother and Son. The resistance of Tatsuhei to his mother's death is familiar, yet nonetheless deeply moving. At the end of the journey, Orin clings to her resolve with tenacity and reconciliation to the inevitable. Sitting on the mountain close to her God, she is rewarded by the sudden grace of the silent snow. Watching Ballad of Narayama I was forced to confront my own feelings about the morality of suicide. Both during and since viewing the film, I have been haunted by the idea of a loved one slowly freezing to death on a mountain--for my benefit. Although I do not approve of taking one's life as a general ethic, I found Imamura's conception to be so deeply human that it became both tragic and immensely moving. The film functions on a level well beyond pat moralizing, showing the extremes that people will go to out of love for each other, and the grace that can be bestowed on such acts of sacrifice. It is truly unforgettable.",
         "With beautiful photography and sensitive, elegant acting, this is perhaps the best exploration of what it means to be human. As usual, Shohei Imamura draws direct parallels between the basic drives & instincts (hunger, greed, lust, anger, envy) of people and other animals. I have friends who have walked out of this movie because they found these comparisons so depressing when shown in the desperately poor rural Japan during the late 19th century. What they missed was the core intelligence, caring, self sacrifice, clear thinking and love that enabled that community, and by extension the human race, to survive such difficult times. This sympathetic portrayal of a family in a rural village is the best of ten films I have seen from Imamura, with an epic scale of Akira Kurosawa and all of the subtlety of Ozu.",
         "This is a film about a culture that has evolved to deal with food scarcity. The people of the village have taken their choices to the extreme. Food is so hard to get (and keep) that the very old and very young must leave. Babiy boys are left to die in the snow, baby girls are raised only to be sold, and the old are brought to the mountain to die. The only thing there is plenty of is sex, for all but one man called Stinker by his peers. The villagers are intent to secure life for themselves and their family and will do anything necessary. In the middle of this all lives an old lady, almost 70 (the dying age) but healthy and strong. She does not want to burden the family, so she gives up her place in order for the young ones to live. Imamura registers all this without judgment. This is a lesson to most people, filmmakers in particular. See, feel, but don't judge right away. See, feel, think, and then try to understand.",
         "This is actually an extraordinarily beautiful film, if one has even the remotest understanding of Japanese culture around that time period. The harshness of life in Japan made the sort of society in which people went to \"be with their loved-ones\" and \"be with the God of the Mountain\" at age 70 completely necessary. The focus of the film is the struggle for survival, and more than that, prospering, in the harsh environment of c. XIX Tohoku. The exploration of this topic takes the viewer into a study of survival through strict rules, and prospering through sexual relationships. The scenes of sexual intercourse serve to portray that even in sexual situations, the Japanese as a people have never viewed nature and animals as separate from ourselves.",
         "I was a little surprised by a few of the negative comments below since I don't consider this film to be at all slow or dull. Many foreign and Asian films (Tsai Ming-Liang, Apitchatpong Weerasethakul, Hou Hsiao-Hsien for example)are far more grueling and slow whereas this film is loaded with narrative events, humor, eroticism (of various sorts, not all involving contact between humans and other humans)and a profound meditation on community, responsibility and mortality. If one finds this slow then I'd imagine most foreign films besides Amelie would be off-limits. I have rarely seen a film that forces one to confront such disturbing yet important subjects. In this village where scarcity forces all over 70 to be taken to Narayama mountain to die, a 69 year old woman who is still energetic and capable must settle her son's affairs before taking her final journey. Pondering how one would live in a place where for years one would know that at 70 this would happen is one key question. Further, what are the final things one must do before dying. Finally, the film makes us confront the literal truth of bodily decay and corruption in the scenes at Narayama Mountain.",
         "This is one of the most beautiful and moving motion pictures I have ever seen. The extreme hardships faced by the people in this story are presented frankly and unsentimentally. The cinematography is absolutely exquisite, particularly the last 10-15 minutes. Although the film never gives in to or panders to sentimentality (sentimentality, Imamura?), the end is really a tear-jerker. As much as I hate to make lists of my \"favorite things\", this movie would definitely rate among my top ten of all times. Do yourself a favor and see this movie!",
         "On numerous occasions Japanese filmmaker Shohei Imamura has confessed that he is more interested in filming tales of despicable low lives than narrating stories of hypocrite Japanese middle class.This is precisely what makes his film special.It must be mentioned that an earlier version of this film was made in 1958 by veteran Japanese film maker Kinoshita Keisuke.Imamura has often stated that his film is more sensual than that of Kinoshita as it featured a Kabuki style narration of events.Ballad of Narayama is a film about ancient traditions which are hard to follow.It takes place in a Japanese village where a majority of inhabitants are low lives who lead a not so decent life.As traditions are to be respected there is a lot of respect for elders. The highlight of the film is the existential dilemma of a Japanese man whose task consists of leaving his old mother in the mountains of Narayama to be eaten alive by vultures.It is believed that forthcoming generations will live when sacrifices are made by old people.It is amazing how Imamura has managed to recreate a vivid life of ancient Japanese village.Ken Ogata is a joy to watch as an obedient son who hesitates to see his old mother die.A truly great film to learn about the eccentricities of human mind especially of the oriental kind.",
         "It's not difficult to understand why Ballad of Narayama won the Palme d'Or in 1983. Beautifully filmed and probably just about having a little something for everyone, I felt that this was without a doubt the best of the Shohei Imamura movies shown today to commemorate his passing last year, and on what would have been a celebration of his birthday should he still be alive today. Like the timeless setting in The Profound Desire of the Gods, Imamura's story, a reinterpretation of the book Men of Tohoku by Fukuzawa Shichiro, takes place ambiguously \"100 years ago\" within a self-supporting nomad group of villagers atop a mountain, where tribal life, ritualistic and tightly knit, involves a peculiar practice when one reaches the age of 70. There's forceful retirement, where the elderly has to ascend Narayama and live out the rest of the days there. The mountain top is the senior citizen's home, and everyone dutifully follows this without question. And I'd like to reflect on this particular point before dwelling on the others. Watching Ballad brings to mind the thought of death, and how would one decide how to go meet the maker. There's absolutely nothing worse than anticipating the coming of death, or to the point of sadism, to actually add a catalyst to it. The final 30 minutes is nothing short of powerful, where son Tatsuhei (Ken Ogata) journeys with mother Orin (Sumiko Sakamota) up the incline. It balances the stoic, unspoken bonds (one of the conditions in the ascent is to maintain silence) of love with the coming of the reaper with every step inching closer to the summit where the gods are, set against beautiful mountainous scenery. My words fall short of describing this awesome moment, and it's something you just have to see for yourself. And with that, comes the point of dying with dignity. If I choose to go, that's the way I would prefer too, rather than screaming, kicking up a fuss, and cursing everyone else. The movie follows through this anticipation of the journey with preparation, and showcases the life of Orin and her family, which is nothing short of entertaining with the many facets thrown in. It's drama, comedy and loads of sex in the veins of the 40 Year Old Virgin, but these are basically there as Orin tries her best to tie up loose ends and puts in place some continuity within her family members before her time is up. Things like taking an involvement to ensure one of her sons doesn't stay a virgin (this bit is just plain hilarious with the way it was developed), and with lots of love, teaching her daughter-in-law how to provide for the family. It's curious to note that Imamura has plenty of National Geographic like shots of various animals, like snakes, toads, owls and crows, and more often than not, showing them in various stages of copulation, or worse, devouring one another. These shots are used as fillers, as if to either remind you before or after a scene, that when boiled down to basics, we are still animals with our primal instincts still very much intact. And if we're left to our own community devices, mob justice, just like the one in Profound, is often very brutal with emotions running high, and this particular thread, including the cunning involvement of Orin, was one that I found quite hard to sit through - the motivation for a daughter-in-law (one that she didn't approve of) was basically to provide for her own kin, but the stark punishment met out, in my opinion, unforgettable, unforgivable, and very excessive. Ballad of Naray ama deserves every accolade bestowed upon it, and amongst the Imamura movies seen to date, this is something that I would recommend without hesitation. Forget the synopsis which made it sound boring, the real deal is within the film itself.",
         "\"Ballad of Narayama\" is ultimately a film about survival. Set during the Meiji Period, the inhabitants of a tiny Japanese farming village are forced to embrace extreme tactics to ensure that they stay alive. Male babies are instantly killed with hardly any remorse, while females are usually sold. Stealing food is punishable by death, which we see in a very disturbing scene where an entire family are buried alive due their father's crime. And, ultimately, the elderly are sent to die at the base of a mountain called Narayama when they reach the age of 70. Despite the depressing tone, there is a lot of humor in this film, as well. The songs that the villagers sing about each other are pretty funny, and it's difficult not to laugh at Old Orin trying to knock her own teeth out with a rock. Speaking of Old Orin, the actress who player her (Sumiko Sakamoto) gives a wonderful performance in this film. She had her teeth surgically removed for this role, and gives a realistic depiction of a 70-year-old woman even though she was in her 40s when the film was made. \"Ballad of Narayama\" is indeed a depressing film in many aspects, but it's also filled with humor and offers a better understanding of what life must be like in these types of situations.",
         "One of the best films I have ever seen. Teaches you how to love your parents and kids. The cast and photography are amazing. A must see movie. As for the previous comment from US on this film - isn't USA a country where the elderly are sent to nursing homes to die, often stripped off their dignity? So, go visit your granny or mommy..."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Toei Company"],
      "summaries": [
         "In a small village in a valley everyone who reaches the age of 70 must leave the village and go to a certain mountain top to die. If anyone should refuse he or she would disgrace their family. Old Orin is 69. This winter it is her turn to go to the mountain. But first she must make sure that her eldest son Tatsuhei finds a wife.",
         "In a poor 19th century rural Japanese village, everyone who reaches the age of 70 has to climb a nearby mountain to die. An old woman is getting close to the cut-off age, and we follow her last days with her family."
      ],
      "budget": 0
   },
   "movielensId": 2512,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1983-04-09",
      "dvdReleaseDate": "2008-06-10",
      "directors": ["Shôhei Imamura"],
      "runtime": 130,
      "movieId": 2512,
      "title": "The Ballad of Narayama",
      "mpaa": "",
      "actors": [
         "Ken Ogata",
         "Sumiko Sakamoto",
         "Tonpei Hidari",
         "Aki Takejo",
         "Shoichi Ozawa",
         "Fujio Tokita",
         "Sanshô Shinsui",
         "Seiji Kurasaki",
         "Junko Takada",
         "Taiji Tonoyama",
         "Casey Takamine",
         "Nenji Kobayashi",
         "Nijiko Kiyokawa",
         "Akio Yokoyama",
         "Mitsuko Baisho"
      ],
      "imdbMovieId": "0084390",
      "originalTitle": "楢山節考",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "In a small village in a valley everyone who reaches the age of 70 must leave the village and go to a certain mountain top to die. If anyone should refuse he/she would disgrace their family. Old Orin is 69. This winter it is her turn to go to the mountain. But first she must make sure that her eldest son Tatsuhei finds a wife.",
      "tmdbMovieId": 42113,
      "avgRating": 3.56771,
      "releaseYear": "1983",
      "numRatings": 192,
      "posterPath": "/ewYZmeoqzE5XsL0Jlcorlu9iwGe.jpg"
   }
}