{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "coffin",
            "id": 1909
         },
         {
            "name": "pet",
            "id": 2551
         },
         {
            "name": "funeral",
            "id": 3739
         },
         {
            "name": "head injury",
            "id": 6350
         },
         {
            "name": "grief",
            "id": 9872
         },
         {
            "name": "violence",
            "id": 14819
         },
         {
            "name": "new neighbor",
            "id": 18127
         },
         {
            "name": "pet cemetery",
            "id": 157488
         },
         {
            "name": "dead cat",
            "id": 157490
         },
         {
            "name": "death of patient",
            "id": 157492
         },
         {
            "name": "loss of pet",
            "id": 157495
         },
         {
            "name": "dead lover",
            "id": 157496
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "grave robbing",
            "id": 171247
         },
         {
            "name": "indian burial ground",
            "id": 173099
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0098084",
      "video": false,
      "title": "Pet Sematary",
      "recommendations": [
         10906,
         10823,
         9529,
         11797,
         8769,
         10489,
         794,
         1547,
         16281,
         11298,
         9003,
         10925,
         10072,
         11133,
         609,
         11415,
         11495,
         4488,
         9725,
         10585
      ],
      "backdrop_path": "/cmzp7nnHQzj5etaTmpKXvowQdOZ.jpg",
      "revenue": 57469467,
      "reviews": [{
         "author": "John Chard",
         "id": "54a0c265925141313200ba73",
         "content": "And the night when the cold wind blows, No one cares, nobody knows.\r\n\r\nThe Stephen King novel from which the screenplay was adapted very nearly didn’t see the light of day. It was actually written by King based on a real place and instances during a stay at a rented house. He was never quite happy with the tone of the book and only submitted it as a contractual obligation. Glad he did because it provides a very solid grounding for horror and deals with the very real horrors of overwhelming grief.\r\n\r\nThe film gets the tonal flows right, the family dynamic is neatly pitched in readiness for what is to come later, the house and the titular Pet Sematary of the title are eerie personified, and Fred Gwynne is on hand for a sage old characterisation. The potential for shattering horror is not fully realised, yet the makers deliver a good quota of scares and unease to make this a better than average King adaptation to screen. The use of the Ramones in the soundtrack is a good one, King loved them, they loved him, so much so they wrote the title track and named an album after it. 6.5/10",
         "url": "https://www.themoviedb.org/review/54a0c265925141313200ba73"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Louis Creed",
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98c3",
               "name": "Dale Midkiff",
               "profile_path": "/pouqDASy9JUPlL46aKFUZBPs7ZL.jpg",
               "id": 56265,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Jud Crandall",
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98c7",
               "name": "Fred Gwynne",
               "profile_path": "/xwDhOItVPzmBDfPqNMPHSSdXOMj.jpg",
               "id": 56266,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Rachel Creed",
               "gender": 1,
               "credit_id": "52fe44c7c3a36847f80a98cb",
               "name": "Denise Crosby",
               "profile_path": "/swsAGvviqh4PfDzjKpnR8sd3rx2.jpg",
               "id": 1743,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Victor Pascow",
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98cf",
               "name": "Brad Greenquist",
               "profile_path": "/8rclBoyMrNwWRnUs5iPLTengKAk.jpg",
               "id": 56267,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Irwin Goldman",
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98d3",
               "name": "Michael Lombard",
               "profile_path": "/p1F2ZLOxeRHx6JJYYAfrpbwfFx6.jpg",
               "id": 13938,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Gage Creed",
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98d7",
               "name": "Miko Hughes",
               "profile_path": "/hpteoojNUAomlQVbiL4eSjUeJ4K.jpg",
               "id": 8186,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Ellie Creed",
               "gender": 0,
               "credit_id": "52fe44c7c3a36847f80a98db",
               "name": "Blaze Berdahl",
               "profile_path": null,
               "id": 175553,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Missy Dandridge",
               "gender": 1,
               "credit_id": "52fe44c7c3a36847f80a98df",
               "name": "Susan Blommaert",
               "profile_path": "/pAzu79y0zHGaPfZNsT6t2ywTfzs.jpg",
               "id": 1913,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Marcy Charlton",
               "gender": 0,
               "credit_id": "52fe44c7c3a36847f80a98e3",
               "name": "Mara Clark",
               "profile_path": null,
               "id": 1117928,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Steve Masterton",
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98e7",
               "name": "Kavi Raz",
               "profile_path": null,
               "id": 111710,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Dory Goldman",
               "gender": 1,
               "credit_id": "52fe44c7c3a36847f80a98eb",
               "name": "Mary Louise Wilson",
               "profile_path": "/tsvPhvPSlKrhcincuq8FMH2PAUq.jpg",
               "id": 115767,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Zelda",
               "gender": 0,
               "credit_id": "52fe44c7c3a36847f80a98ef",
               "name": "Andrew Hubatsek",
               "profile_path": null,
               "id": 1117929,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Girl at Infirmary",
               "gender": 0,
               "credit_id": "52fe44c7c3a36847f80a98f3",
               "name": "Liz Davies",
               "profile_path": null,
               "id": 1117930,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Candystriper",
               "gender": 0,
               "credit_id": "52fe44c7c3a36847f80a98f7",
               "name": "Kara Dalke",
               "profile_path": null,
               "id": 1117931,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe44c7c3a36847f80a988f",
               "name": "Mary Lambert",
               "profile_path": "/oFgE0UQeeQqFhwsVaD5l26PH5kr.jpg",
               "id": 56263,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a9895",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a989b",
               "name": "Stephen King",
               "profile_path": "/z8cHPoqTslxRR7oWQ5wsh0fNLt2.jpg",
               "id": 3027,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98a1",
               "name": "Richard P. Rubinstein",
               "profile_path": null,
               "id": 15000,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98a7",
               "name": "Tim Zinnemann",
               "profile_path": null,
               "id": 12993,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98ad",
               "name": "Elliot Goldenthal",
               "profile_path": "/mr1rr5bQySCwp564E1Ag363SgLH.jpg",
               "id": 5581,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98b3",
               "name": "Peter Stein",
               "profile_path": null,
               "id": 56264,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98b9",
               "name": "Mike Hill",
               "profile_path": null,
               "id": 6190,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44c7c3a36847f80a98bf",
               "name": "Daniel P. Hanley",
               "profile_path": null,
               "id": 6189,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5ab1be7ac3a3686fc2000e08",
               "name": "Mark Ulano",
               "profile_path": null,
               "id": 1547309,
               "department": "Sound",
               "job": "Production Sound Mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 7.476301,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8913,
      "vote_count": 530,
      "budget": 11500000,
      "overview": "Dr. Louis Creed's family moves into the country house of their dreams and discover a pet cemetery at the back of their property. The cursed burial ground deep in the woods brings the dead back to life -- with \"minor\" problems. At first, only the family's cat makes the return trip, but an accident forces a heartbroken father to contemplate the unthinkable.",
      "similar": [
         400,
         3134,
         24124,
         205,
         298312,
         281957,
         281,
         238636,
         334541,
         806,
         133805,
         2142,
         2196,
         527,
         12162,
         4771,
         8923,
         10285,
         97630,
         110415
      ],
      "original_title": "Pet Sematary",
      "runtime": 103,
      "poster_path": "/9zUax4pjRgoPIJla9CQejqNJofB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1989-04-21",
      "vote_average": 6.4,
      "belongs_to_collection": {
         "backdrop_path": "/vK18Xz065I4BvRB8r9IrH98ebVp.jpg",
         "name": "Pet Sematary Collection",
         "id": 10789,
         "poster_path": "/iySOPKFg4DgtjY9ySsJZoccMcIB.jpg"
      },
      "tagline": "Sometimes dead is better.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mary Lambert"],
      "runtime": 103,
      "synopsis": "The Creed family moves from Chicago to the small town of Ludlow, Maine. They end up befriending their elderly neighbor, Jud Crandell, who takes them to the isolated pet cemetery (misspelled \"Sematary\") behind the Creeds' new home. Later, Louis Creed is working at the University of Maine when a young student named Victor Pascow is brought in with severe injuries from a car accident. The young man dies, but not before warning Louis (by name) of the pet cemetery. That night, in what is seemingly a dream, Victor visits Louis, warning him about the burial ground beyond the pet cemetery. Louis wakes up to find his feet covered in dirt. Church, a cat owned by Louis' daughter Ellie, is killed by a truck on the road in front of their house while Rachel, Ellie and Gage are in Chicago. Jud takes Louis to an ancient Micmac Indian burial ground, the \"real cemetery\", to bury the cat. Louis asks if a person was ever buried in the grounds. Jud replies, \"Christ on His throne, no. And whoever would?\" Church comes back that night, but an evil shell of himself, attacking Louis and smelling of death. Sometime later, Louis' young son Gage is killed by a truck on the same road. Louis considers burying Gage in the burial grounds. Jud tries to dissuade him from doing so, telling him about a young man from town, Timmy Baterman, who died in service during World War II. Timmy's father, Bill, placed his son's corpse into the Micmac burial ground, only to have it reanimate and terrify the townsfolk. Jud and three of his friends tried burning down the house with the son in it, but Bill was attacked by Timmy and they both perished in the fire. Rachel begs Louis to go with her and Ellie to Chicago, but he declines. Louis heads to the cemetery Gage is buried in, intending to exhume his son's body. He is met at the graveyard by Pascow, who warns him not to proceed. On the flight, Ellie has a nightmare, stating that \"Paxcow\" warned her that Louis is going to do something really bad, and that he is trying to help because Louis tried to save his life. Rachel realizes who her daughter is talking about and calls Jud after Louis does not answer the phone. She asks if he has seen Louis, and then tells him she is returning. Jud warns her not to, but she has already hung up. Louis takes his son's corpse to the Micmac burial ground. Pascow's spirit unsuccessfully tries to stop Louis. Louis returns home, exhausted from his activities. Gage later arrives and enters his father's room, removing a scalpel from one of his bags. Gage enters Jud's house and kills Jud while Church watches. Rachel arrives home, hearing something that sounds like her late sister, Zelda, calling her name, then Gage's laughter. Rachel enters Jud's house and finds Gage in an upstairs bedroom. Gage tells her he brought her something and shows her Louis' scalpel. Rachel hugs her son in disbelief and is murdered. Louis wakes up to find Gage's muddy footprints on the floor, his doctor's bag open and his scalpel gone. He receives a call from Gage saying, \"Come play with me daddy! First I played with Jud, and then I played with mommy. We had an awful good time. Now I want to play wiff yewww.\" Preparing shots of morphine, Louis heads to Jud's house, running into Church once more. He distracts the cat with a raw steak, then kills him with a shot of morphine. He heads into the house, once more taunted by Gage. Louis searches the house only to have Rachel's corpse fall from the attic, hanged by her neck. Gage attacks his father, but Louis injects the boy with a morphine shot, killing him. Louis soaks the house in kerosene and sets it on fire, carrying his wife's body out. Pascow watches, and tells Louis he is sorry, and not to bury Rachel in the same place. Louis replies that he waited too long with Gage, and that it will work with his wife because she just died. Louis walks through Pascow, who vanishes screaming. At home, Louis plays solitaire while he waits. At midnight, Rachel comes through the kitchen door. She coos \"Darling...\" and the two embrace kissing as it is revealed that her face is ravaged and oozing cranial fluid. Rachel reaches for a steak knife on the kitchen table. The screen blacks out as Rachel stabs him while Louis screams.",
      "writers": [
         "Stephen King",
         "Stephen King"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0098084/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1Mzk4OTAyOV5BMl5BanBnXkFtZTcwNzQ1NjcxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Dale Midkiff, Denise Crosby, Fred Gwynne | See full cast and crew »"],
      "reviews": [
         "This scary and rather gory adaptation of Stephen King's great novel features outstanding central performances by Dale Midkiff,Fred Gwynne(who sadly died few years ago)and Denise Crosby and some really gruesome gore effects.Director Mary Lambert has a wonderful sense of visual style,and manages to make this one of the few versions of King's work that is not only worth seeing,but genuinely unnerving.The depiction of the zombie child Gage(Miko Hughes-later in \"New Nightmare\")is equally noteworthy,as what could easily have been a laughable character is made menacing and spooky.As for the people,who think that this one isn't scary-watch it alone in the dark(eventually with your squeamish girlfriend)and I guarantee you that \"Pet Sematary\" will creep you out.Some horror movies like this one or \"The Texas Chain Saw Massacre\" shouldn't be watched in group.Recommended for horror fans!",
         "I am a big fan of Stephen King's work, and this film has made me an even greater fan of King. Pet Sematary is about the Creed family. They have just moved into a new house, and they seem happy. But there is a pet cemetery behind their house. The Creed's new neighbor Jud (played by Fred Gwyne) explains the burial ground behind the pet cemetery. That burial ground is pure evil. Jud tells Louis Creed that when you bury a human being (or any kind of pet) up in the burial ground, they would come back to life. The only problem, is that when they come back, they are NOT the same person, they're evil. Soon after Jud explains everything about the Pet Sematary, everything starts to go to hell. I wont explain anymore because I don't want to give away some of the main parts in the film. The acting that Pet Sematary had was pretty good, but needed a little bit of work. The story was one of the main parts of this movie, mainly because it was so original and gripping. This film features lots of make-up effects that make the movie way more eerie, and frightening. One of the most basic reasons why this movie sent chills up my back, was in fact the make-up effects. There is one character in this film that is truly freaky. That character is \"Zelda.\" This particular character pops up in the film about three times to be precise. Zelda is Rachel Creed's sister who passed away years before, but Rachel is still haunted by her. The first time Zelda appears in the movie isn't generally scary because she isn't talking or anything, but the second time is the worst, and to be honest, the second time scares the living **** out of me. There is absolutely nothing wrong with this movie, it is almost perfect. Pet Sematary delivers great scares, some pretty good acting, first rate plot, and mesmerizing make-up. This is truly one of most favorite horror films of all time. 10 out of 10.",
         "Pet Sematary is a very good horror film and believe it or not somebody can make a good horror film out of a Stephen King novel. Mary Lambert does a great job with this film and manages to bring across King's creepy story pretty well. Most people may avoid this, but they should check it out.",
         "The underlying idea in \"Pet Sematary\" seems to be that when people are brought back from the dead, they have all their brains, but no souls. Definitely a cool idea, but for some reason it is never expanded, explained, or even mentioned. Theology aside, even the science of what's going on is unclear. How come Timmy, when raised from the dead, staggers around like your run-of-the-mill zombie, while little Gage actually seems smarter and suddenly knows how to operate a telephone? It's all very sloppily done. In fact, the only explanation at all for why the cemetery does what it does is that the ground is \"sour.\" Sorry, but that doesn't really cut it for me. If the movie had focused more on the mystery of the cemetery, it would have been a fantastic thriller. Unfortunately, it ditches the interesting stuff, and instead turns into a \"Tales of the Crypt\" episode about a crazy toddler with a knife. Of course, there's still a lot to like about this movie. If it's main intention is to scare you, it certainly does it's job. The scene with Zelda is one of the scariest things I've ever seen, and the death of Gage is very upsetting and hard to watch. The mysterious Judd is arguably one of the coolest movie characters of all time (and to be honest, I was so upset when he died, I completely lost interest in the rest). And while at first it seems a bit odd for a zombie with half his head missing to be the comic relief, somehow it works. But even though it has its good parts, not nearly enough attention is given to the intriguing premise, and it ultimately turns into a cheesy spook story. Too bad, because it could have been a lot more.",
         "One of the best (if not the best) Stephen King's screenings. Dark as dark can be, surprising non-hollywood ending, terrifying atmosphere, amazing book adaptation, outstanding cast, educational (don't play with afterlife), in short - everything an excellent horror should be... My favorite horror movie, straight 10+.",
         "In the trivia section for Pet Sematary, it mentions that George Romero (director of two Stephen King stories, Creepshow and The Dark Half) was set to direct and then pulled out. One wonders what he would've brought to the film, as the director Mary Lambert, while not really a bad director, doesn't really bring that much imagination to this adaptation of King's novel, of which he wrote the screenplay. There are of course some very effective, grotesquely surreal scenes (mainly involving the sister Zelda, likely more of a creep-out for kids if they see the film), and the casting in some of the roles is dead-perfect. But something feels missing at times, some sort of style that could correspond with the unmistakably King-like atmosphere, which is in this case about as morbid as you're going to get without incestuous cannibals rising from the graves being thrown in (who knows if he'll save that for his final novel...) As mentioned though, some of the casting is terrific, notably Miko Hughes as Gage Creed, the little boy who goes from being one of the cutest little kids this side of an 80's horror movie, to being a little monster (I say that as a compliment, of course, especially in scenes brandishing a certain scalpel). And there is also a juicy supporting role for Fred Gwynne of the Munsters, who plays this old, secretive man with the right notes of under-playing and doom in tone. And applause goes to whomever did the make-up on Andrew Hubatsek. But there are some other flaws though in the other casting; Dale Midkiff is good, not great, as the conflicted, disturbed father figure Creed, and his daughter Ellie is played by an actress that just didn't work for me at all. In terms of setting up some chilling set-pieces, only a couple really stand-out: a certain plot-thickening moment (not to spoil, it does involve a cool Ramones song), and the first visit to the pet sematary (the bigger one), including the sort of mystical overtones King had in the Shining. For the most part it's a very polished directing job, though it could've been made even darker to correspond with the script. If thought out in logical terms (albeit in King terms) it is really one of his more effective works of the period. But it doesn't add up like it could, or should. Still, it makes for a nifty little midnight movie.",
         "As this happens to be one of most favorite novels , I was very excited to see the move. I was not disappointed! Yes of course there are a few things that I could pick on , but I think that the movie stuck true to the book, and was a really good movie. It seems that Stephen King films mostly get a bad review , but this is one of the good ones. It is such a dark story , which I guess is why I like it .. and what is better than the dead coming to life.. and something about animals returning from the grave is quite creepy too. If you have seen the movie do yourself a huge favor and now read the book!! It is a well written screen play , the actors could have done a better job ( I only say this for Rachel , and Ellie .. she was so whinny ) I liked everyone else a lot.. and most important to me .. it stuck true with the novel.",
         "Pet Semetary (1989) 9/10 The Creed family have just moved into the small town of Ludlow. The family consists of a father, Louis, a mother, Rachel, a brother Gage, and a daughter, Ellen. They are greeted with kindness by Jud Crandall. Jud is 89, and could basically tell you about the entire history of Ludlow. Behind the Creed's new house, there is a path leading to a pet cemetery (spelled pet sematary). When Ellen wants to go up to see it, Jud willfully takes the family on a trip. That is the start of hell for the Creed family. When Rachel and the kids are gone, Ellen's cat Church dies. Jud feels that Ellen isn't ready for the death of her cat, so he suggests Louis follow him further up the path, past the pet cemetery. Jud tells Louis of this burial ground, once used by Micmac Indians. Louis buries Church, without Jud's help. A couple of days later, Church returns, alive, but from hell. This movie was one of two horror movies that could actually scare me, aside from \"The Exorcist.\" The greatest performance would ever be Zelda, Rachel's sister with spinal meningitis, or Victor Pascow, a ghost who tries to help the Creeds from making the mistake of bringing back things from the dead. The music in this movie plays an extravagant part. It is at the same time sad and mysterious. It goes along with the movie wonderfully. 9/10",
         "Dale Midkiff and Denise Crosby move to Maine with their two small children and cat in a big house on a highway with lots of truck traffic. Close at hand...is a pet cemetery where all the dogs and cats killed on the road are buried. Neighbor Fred Gwynne shows another cemetery with incredible powers just beyond...the power to reanimate the dead. Trouble is the dead are nothing like they once were. Although I have not read the book by Stephen King, he did write the screenplay and must have remained relatively faithful to his own work. The film has many flaws but is also worthwhile. Coincidence and some muddled flashbacks from the past help make the script somewhat erratic and implausible. The acting in the leads is OK, but in the second half really deteriorates. Fred Gwynne is literally and figuratively a cut above the rest. He gives a heartfelt performance as a man run down with time and over-burdened with knowledge he should or would not have. Brad Greenquist is also good in his role as a ghost. His character also causes some believability factors. Director Mary Lambert does do some things rather nicely. There are some well-shot scenes of the cemeteries. The peril of the trucks is made very real, and she also relies heavily on human emotion that is universal. At its heart, Pet Semetary is about loss, coping with loss, and grief, and what are some of the effects of not coping with those things well. The film has many suspenseful moments, and although the ending became a bit tiresome - still manages to keeps its mood and message throughout. Author Stephen King has an interesting cameo as a preacher!",
         "Louis Creed, a doctor from Chicago, moves to a large house near a small town, since he is going to be giving classes in the University of Maine's. Along with him, is his wife Rachel and their two kids, Ellie and Gage,as well as Ellie's cat, Church. Soon, they met their new neighbor,and old man named Judd Crandall.Judd not only warns Louis and Rachel about the danger that is the highway that runs past their house(that is constantly a way used by big trucks) but also show to the family a pet cemetery that is located near their house. Judd starts to talk about the importance of the pet cemetery, but Rachel is against to talk about death and spirituality with her children, since she has traumas from her sister Zelda's death. During the first week of the family in the new house, Louis already has dead people to deal with: Victor Pascow, a student who has been fatally injured in an automobile accident, addresses his dying words to Louis personally, even though the two men are strangers. On the night following Pascow's death, Louis experiences what he believes is a very vivid dream in which he meets Pascow, who leads him to the pet cemetery and warns Louis to not \"go beyond, no matter how much you feel you need to.\" Louis wakes up in bed the next morning convinced it was only a dream, until he discovers his feet and the bedsheets covered with dirt and pine needles. Anyway, he dismisses the dream. Many strange things starts to happen and Church, Ellie's cat, dies while walking on the highway. Louis stays worried in how he is going to talk about Church's death with Ellie, but Judd, sympathizing with him, Jud takes Louis to the pet cemetery, supposedly to bury Church. But instead of stopping there, Jud leads Louis farther on a frightening journey to \"the real cemetery\": an ancient burial ground that was once used by the Micmac ('...Indians...'). There Louis buries the cat on Jud's instruction, with Jud saying that animals buried there have come back to life. And that is where the real horror story begins... I personally find this movie very good. It's not THE most horrifying of all, but it is one of the best horror movies I watched. The way Gage dies, is almost impossible to not stay in your memory, specially being a toddler. It's cool to see Stephen King's cameo as the minister of the funeral. Of course, there are some script errors: How can a rich doctor with two small kids, goes to live in a place where there is a dangerous highway near his house? How Gage has no scratches or anything after being hit by a truck? Why Louis continues to resurrect every member of his family knowing they are all going to stay like monsters? Things like that doesn't make any sense, but I can understand that all horror's scripts needs to have some surreal ideas to work. A good thing I saw in this movie, is the necessity to talk about death with the children, no matter what is your religion or if you are an atheist, and also that avoiding important subjects doesn't help anything. Because of Louis being afraid to be honest with Ellie, confronting her and saying that her cat wouldn't be back again, all the nightmare began."
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Paramount Pictures",
         "Laurel Productions"
      ],
      "summaries": [
         "The Creeds have just moved to a new house in the countryside. Their house is perfect, except for two things: the semi-trailers that roar past on the narrow road, and the mysterious cemetery in the woods behind the house. The Creed's neighbours are reluctant to talk about the cemetery, and for good reason too.",
         "The Creed family has moved to a nice little community, but shortly after the move, their son is killed. Grief-stricken, the father fins out that there is a cemetery where you can bury your loved ones, and they can come back to life. He takes his son to this place, and he is brought back. It seems all is well again, until the son kills a person. That is where the father learns , \"Not everything that comes back is the same.\" Now, he has to find a way to stop his son before he kills the whole town.",
         "Pet Sematary (PS) is a 1989 horror flick based on Stephen King's novel of the same name. After moving into their new home the Creed family's cat is killed after wondering onto the highway. Jud an elderly neighbor shows Louis, the father, to an isolated hill behind the local Pet Cemetery and instructs him to bury the deceased feline there. Not long after the cat reappears at the Creed home, only he is not the same. The docile cat is now vicious and destructive. When their youngest son meets with a fatal accident, the distraught Louis buries him in the same location hoping to revive him. Unfortunately he unleashes far more than he had bargained for.",
         "Behind a young family's home in Maine is a terrible secret that holds the power of life after death. When tragedy strikes, the threat of that power soon becomes undeniable."
      ],
      "budget": 11500000
   },
   "movielensId": 2513,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1989-04-21",
      "dvdReleaseDate": "2000-09-19",
      "directors": ["Mary Lambert"],
      "runtime": 103,
      "movieId": 2513,
      "title": "Pet Sematary",
      "mpaa": "R",
      "actors": [
         "Dale Midkiff",
         "Fred Gwynne",
         "Denise Crosby",
         "Brad Greenquist",
         "Michael Lombard",
         "Miko Hughes",
         "Blaze Berdahl",
         "Susan Blommaert",
         "Mara Clark",
         "Kavi Raz",
         "Mary Louise Wilson",
         "Andrew Hubatsek",
         "Liz Davies",
         "Kara Dalke"
      ],
      "imdbMovieId": "0098084",
      "originalTitle": "Pet Sematary",
      "genres": [
         "Drama",
         "Horror"
      ],
      "youtubeTrailerIds": ["jpjpUOXQZac"],
      "plotSummary": "Dr. Louis Creed's family moves into the country house of their dreams and discover a pet cemetery at the back of their property. The cursed burial ground deep in the woods brings the dead back to life -- with \"minor\" problems. At first, only the family's cat makes the return trip, but an accident forces a heartbroken father to contemplate the unthinkable.",
      "tmdbMovieId": 8913,
      "avgRating": 3.024,
      "releaseYear": "1989",
      "numRatings": 4208,
      "posterPath": "/9zUax4pjRgoPIJla9CQejqNJofB.jpg"
   }
}