{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wine cellar",
            "id": 1811
         },
         {
            "name": "skeleton",
            "id": 4062
         },
         {
            "name": "cigarette smoking",
            "id": 11732
         },
         {
            "name": "blind",
            "id": 33768
         },
         {
            "name": "horror movie remade",
            "id": 41667
         },
         {
            "name": "chandelier",
            "id": 183750
         }
      ],
      "imdb_id": "tt0051744",
      "video": false,
      "title": "House on Haunted Hill",
      "recommendations": [
         18573,
         28501,
         25319,
         3079,
         17965,
         23439,
         16093,
         11772,
         24106,
         30137,
         10787,
         10973,
         11868,
         229,
         11815,
         21159,
         11071,
         13666,
         27632,
         28752
      ],
      "backdrop_path": "/5Wi2IrO0787hhYjsBVzXUFHN1KJ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Frederick Loren",
               "gender": 2,
               "credit_id": "52fe46859251416c7507af83",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nora Manning",
               "gender": 1,
               "credit_id": "52fe46859251416c7507af87",
               "name": "Carolyn Craig",
               "profile_path": "/uso6gUwfzkMjbexsBWiMZfVZz3A.jpg",
               "id": 78851,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lance Schroeder",
               "gender": 2,
               "credit_id": "52fe46859251416c7507af8b",
               "name": "Richard Long",
               "profile_path": "/8DDSKe894Otlz2HiTvhlhA5Xqir.jpg",
               "id": 78852,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Watson Pritchard",
               "gender": 2,
               "credit_id": "52fe46859251416c7507af8f",
               "name": "Elisha Cook Jr.",
               "profile_path": "/ntXqHlpeaXTM7WqIsGDlYtlG7hk.jpg",
               "id": 3339,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Annabelle Loren",
               "gender": 1,
               "credit_id": "52fe46859251416c7507af93",
               "name": "Carol Ohmart",
               "profile_path": "/6X39eQO3YJjDkdoEOifGPL2Cx2Q.jpg",
               "id": 78853,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Dr. David Trent",
               "gender": 2,
               "credit_id": "52fe46859251416c7507af97",
               "name": "Alan Marshal",
               "profile_path": "/qX4fon82yP8aDJOE4fI0qR0bDvN.jpg",
               "id": 78854,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Ruth Bridgers",
               "gender": 1,
               "credit_id": "52fe46859251416c7507af9b",
               "name": "Julie Mitchum",
               "profile_path": "/8MEYoXf4Ru4GKc2J8cM6SpWlvz7.jpg",
               "id": 78855,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Mrs. Slydes",
               "gender": 1,
               "credit_id": "52fe46859251416c7507af9f",
               "name": "Leona Anderson",
               "profile_path": null,
               "id": 78856,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Jonas Slydes",
               "gender": 0,
               "credit_id": "52fe46859251416c7507afa3",
               "name": "Howard Hoffman",
               "profile_path": null,
               "id": 78857,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46859251416c7507afa9",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe46859251416c7507afaf",
               "name": "Robb White",
               "profile_path": null,
               "id": 57522,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a21e09c0e0a264cc10aaa71",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5a21e0bb92514103260b181a",
               "name": "Carl E. Guthrie",
               "profile_path": null,
               "id": 30970,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5a21e0d8c3a3680b9a0b5953",
               "name": "Roy V. Livingston",
               "profile_path": null,
               "id": 139174,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5a21e0e992514103300a8681",
               "name": "Von Dexter",
               "profile_path": null,
               "id": 1176692,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 6.380795,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15856,
      "vote_count": 141,
      "budget": 200000,
      "overview": "Frederick Loren has invited five strangers to a party of a lifetime. He is offering each of them $10,000 if they can stay the night in a house. But the house is no ordinary house. This house has a reputation for murder. Frederick offers them each a gun for protection. They all arrived in a hearse and will either leave in it $10,000 richer or leave in it dead!",
      "similar": [],
      "original_title": "House on Haunted Hill",
      "runtime": 75,
      "poster_path": "/fnlPkYlVXrWUkQsVa8Y2tkFoPQq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "William Castle Productions",
         "id": 10324,
         "origin_country": ""
      }],
      "release_date": "1959-02-17",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "Consult your doctor! Bring your seat belts!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["William Castle"],
      "runtime": 75,
      "synopsis": "An eccentric millionaire, Fredrick Loren, who is throwing the \"party\" for his fourth wife, Annabelle, invites five people to a secluded masion with the offer to spend one night in his house which is haunted, with the stipulation that the power will be out and all doors will be locked at midnight, allowing no accessible escape. Anyone who stays in the house for the entire night, given that they are still alive, will each receive $10,000. The five guests all arrive in separate funeral cars with a hearse leading, which he explains may be empty now, but they may be in need of it later. He explains the rules of the party and gives each of the guests a .45 caliber pistol for protection. Loren's wife tries to warn the guests that her husband is psychotic, causing them to be very suspicious of him, especially Nora Manning, who becomes convinced that he's trying to kill her when she keeps seeing mysterious ghouls, including the ghost of Annabelle, who had hanged herself after being forced to attend the party. After being driven into a fit of hysteria by the ghosts haunting her, Nora shoots Mr. Loren, assuming he is going to kill her. Dr. Trent, another guest, tries to get rid of the body by pushing it into acid, but the lights go out, and when they come back on, both of the men are gone. Annabelle emerges, having faked her death with the help of Dr. Trent, and having apparently tricked Nora into killing Loren. Suddenly, a skeleton emerges from the acid accompanied by the voice of Loren. The spectre approaches Annabelle as she recoils in terror. In this panic, the screaming Annabelle accidentally backs into the acid herself. The real Mr. Loren walks out of the shadow, holding the contraption that he was using to control the skeleton of Dr. Trent. In his triumph, he watches Annabelle disintegrate. Nora tells the other guests that she's shot Loren in the cellar, and they all rush down there. When they arrive, they see that he's actually alive, and he explains to them that his wife and Dr. Trent were having an affair, and that the \"haunting\" was just a joke planned by him with the help of the caretakers. He also tells them that they'd planned to trick Nora into murdering him so that they could get away with his money. He had not loaded Nora's guns with bullets, but blanks. Just when everyone thinks the trauma is finally over, Mr. Pritchard, the house owner, looks up, a terrified expression on his face, and announces that the ghosts of the house are finally coming for them.",
      "writers": ["Robb White"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0051744/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2MjU4ODc3OV5BMl5BanBnXkFtZTgwNjUyNTM3MjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Price, Carol Ohmart, Richard Long | See full cast and crew »"],
      "reviews": [
         "This classic version of \"House on Haunted Hill\" is one of the most entertaining examples of the low-budget, black-and-white horror films that used to be such a mainstay for movie fans. It has few frills, but it does have some thrills, and in particular it has a cleverly written story that is told at a brisk pace, with a good deal of interesting and pleasingly macabre detail. Horror legend Vincent Price is in his element as the mysterious millionaire who invites a houseful of guests to spend the night in a supposedly haunted mansion, and his performance will give his fans everything that they expect. The supporting cast is solid, led by Elisha Cook, who is very good as a nervous, tipsy character whose rambling proclamations of doom add the right touch of offbeat suspense. The settings are given plenty of detail that makes the characters' explorations of the house even more interesting. The story is nicely written for the genre, making very good use of the possibilities in the setup, throwing in some good turns, and resolving everything in a resourceful fashion. And it's not without some real suspense - even those who normally watch low-budget horror features solely for the camp factor might get an actual start once or twice as everything plays out. And even if you don't find anything scary, there is plenty here that makes it enjoyable to watch.",
         "Vincent Price plays Frederick Loren, an eccentric millionaire that invites five very different people to a haunted house for a party, and offers them $10,000 if they can stay the night... This film benefits emphatically from the presence of the legendary Vincent Price. As usual, Price gives a commanding performance and completely steals every scene he's in. Price is undoubtedly the star of the show, but he's not the only star in the show; Elisha Cook in particular gives excellent support playing the wimpy owner of the house; much the same character that he played in the Kubrick masterpiece; 'The Killing'. The rest of the cast is largely made up of unknowns and b-grade actors, but they also all perform to relatively high standards in their respective roles. House on Haunted Hill's best feature other than the legendary Vincent Price, is undoubtedly the atmosphere of the house. Throughout the movie, there is an abundant sense of dread that is perpetually present and it serves the film well in that it brings the house to life; at every point in the movie, the audience is made to believe that there is something unseen in the house that will cause bad things to happen; and this is obviously exactly what a haunted house film needs. The film is very creepy in that way. That's not to say that this film is without its flaws; at times, the plot meanders and as the film only has a 75 minute running time, that's not good. It can also become a little dull at times as there isn't always a lot going on. This is, however, somewhat combated by the acting performances and defined characters as they usually manage to keep it at least interesting, if not enthralling throughout. House on Haunted Hill is topped off by a brilliant double twist, and it is also given certain originality by that also, although the twists do beg the question of whether or not the film has an appropriate title. The walking skeleton is hilarious, though and worth watching film for alone. Overall, House on Haunted Hill is a lovely little b movie; it's creative, it's atmospheric and it stars Vincent Price. Highly recommended viewing, especially for horror fans. Definitely not recommended for anyone though, is the dire 1999 remake of this film, and the equally appalling remake of William Castle's other ghost story; '13 Ghosts'.",
         "Forget the awful, senseless remake, the original 'The House On Haunted Hill' is one of the most entertaining and enjoyable chillers of all time. William Castle's over the top camp style is an acquired taste for many, but once you enter into the spirit of things you're in for a wild, fun ride. The legendary Vincent Price is in his element here as the cynical millionaire trapped in a loveless sham of a marriage, and Carol Ohmart, who I have only ever seen in the cult classic 'Spiderbaby', is a knockout as his tough as nails \"better half\". Their haunted house party guests, led by the much loved character actor Elisha Cook, Jr ('The Maltese Falcon' ,The Killing',etc.etc.), are well cast and amusing, and the whole thing is a hoot! I recommend this movie to all horror fans. It is quite possibly the single most entertaining horror thriller of the 50s. Supremely silly but still scary at the same time. Great stuff!",
         "I have watched my share of horror movies, altho I am not an expert on the genre, and I have seen different settings. Of course, there can be mixed settings: a film about Dracula may take you to the Transylvanian outdoors, to streets or graveyards, as well as into the castle or mansion or whatever. But one way horror movies can be categorized is by whether most or all of the film is within a residence, or not. Bearing this in mind, I think something special about horror films is having the victim(s) enclosed inside a mansion or home, with escape difficult or impossible, and terrorized by anything one can imagine -- moving furniture, metamorphosing paintings, spooks in the attic, odd remnants, lights on and off -- as part of the buildup for a real or expected attack, by a person or whatever. The terror, suspense, is believing someone or something is or may be there, but where, and when, will it strike? \"The Shining,\" \"Die! Die! My Darling,\" \"Beyond the Door,\" Behind Locked Doors,\" \"The Haunting.\" Although claustrophobia might generally be a negative for me in a movie, such as \"Rear Window\" (unlike most people, I do not really like it), in horror movies it is great, it makes the day. If one looks at things this way, \"House on Haunted Hill\" can be seen as the quintessential horror film. Start with having Vincent Price in it, hopefully no arguments there. He plays Frederick Loren, the affluent host of a \"party\" in which he invites five people, not including himself and his wife, to a haunted mansion on a hill in a challenge for each person to win $10,000 (at today's value, about $100,000) if that person stays in the mansion all night. Among the five are Watson Pritchard (Elisha Cook Jr.), an alcoholic, whose endemically spooked countenance sets the tone for what everyone is getting into. Frightface or not, he bears an (eerie?) resemblance to evangelist Pat Robertson, whether or not he is actually as scary. Altho Pritchard owns the house, he has spent little time in it, but he is nevertheless the expert on the circumstances surrounding seven deaths, including that of his brother, on the premises over many years. Quickly, the other four get the message: they may be facing trouble. And trouble begins quickly. Part of the idea is that there is no escape out of the mansion after midnight, when the caretakers leave, and barricades ensure this. Price's wife, Annabelle, is played by Carol Ohmart. She is striking blond, gorgeous, with very fair skin. In several scenes that I will not specify, her lightness is artfully contrasted against surrounding darkness by Director William Castle -- very beautiful, no special effects needed. Price has a jealous rage toward her and she in turn wants to get rid of him, as she has tried to do in the past. What will happen tonight? Of the other four characters, the two with the stronger presences in the first half are Lance Schroeder (Richard Long), a handsome pilot, and Nora Manning (Carolyn Craig), a pretty typist for one of Loren's companies and the early lead screamer. The other two are newspaper writer Ruth Bridgers (Julie Mitchum), who has a gambling problem, and Dr. David Trent (Alan Marshal), a psychiatrist interested in the subject of scared people. A plot twist brings one of these latter two to greater prominence in the second half. The creaky doors, the body parts, the unexplained incidents all do their part in a movie in which black & white is such an essential. The black & white cements the atmosphere we need for the \"house\" (mansion): from a distance, from a close-up at the start of the movie, and then inside the mansion, everywhere. For those who profess love for \"Casablanca\" and cry \"sacrilege\" when they see the colored version, I say, OK, the true version to me is the original, but the colorized version is just the colorized version, what's wrong with watching it too? The movie still works in color, doesn't it, even if it is preferable in black & white? To me, anyway. But as to \"House on Haunted Hill\" -- even if I similarly would not cry \"sacrilege\" to a colorized version, I ask, can you think of any other movie in which black & while is so essential, in which a colorized version would lose so much? Maybe you can, but I can't. Loren, with his ulterior motives, has a smug, rather commanding aura, knowing that each of the five needs the $10,000. There can be skeletons in people's closets, yes. And as Loren's plans are threatened with derailment, keep this in mind.",
         "Vincent Price asks five strangers to spend an evening in a haunted house for ten thousand dollars a piece. With his estranged wife in tow, the seven house guests begin a nocturnal odyssey of mayhem, murder, and the macabre. This film is a great vehicle for Price's unique talents as an actor, and is also a very atmospheric film due in large part to the direction of William Castle. Castle gives us all kinds of horror in the traditional vein...a severed head, a skeleton, the screaming-without-end hysterical young woman, the plot twists and turns, and the firmly planted tongue-in-cheek. The cast is very good, with Carol Omhart, as Price's elegant and gorgeous wife, and Elisha Cook, as a drunken sot who continually rants about all the evil that has happened in the house, as standouts. This is a great Halloween film, or one that you turn off the lights to watch.",
         "William Castle has made several wonderful horror films; some obviously better than others, but at the top of the list are \"Thirteen Ghosts\" and \"House on Haunted Hill.\" This movie might though have been all but forgotten if not one plucky guy recently remade this movie in to a much more gory movie. That movie is a remake in name only, but this one is obviously more superior because it has the incredibly creepy presence of Vincent Price and the nervous tick of Elisha Cook. The ghosts aren't very scary, nor do we see anything really supernatural, but the atmosphere and uneasiness of this film makes for an incredible who done it story as you wonder who will get it. The set is intoxicating inasmuch as you never really see all of it, nor is it really explained what such a dangerous pit is doing in such a precarious spot in the basement. Such a matter isn't important. On the other side of the coin, the music and the special effects are rather hokey, but then when this was in the theaters, a lot of the teenagers would have been making out to have really bothered to pick this movie apart. It is only in recent years that movies have turned away from gore and back to movies with style and substance that we appreciate films like this.",
         "William Castle liked to promote his films with gimmicks, and the gimmick for THE HOUSE ON HAUNTED HILL was Emerg-O: at the peak of the action, a glowing skeleton \"emerged from the screen\" and flew out over the audience on a wire. By most accounts Emerg-O caused more laughter than chills, but fortunately Castle never relied on gimmicks alone: he also liked bona fide stars, and for HAUNTED HILL his star of choice was none other than the legendary horror star Vincent Price. Like most Castle films, HAUNTED HILL's plot reworks a well-worn theme. Millionaire Price and his wife Carol Ohmart give a \"haunted house party\" for five strangers chosen at random and promised ten thousand dollars if they last the night. The catch: the doors lock at midnight, after which there is no escape until the caretakers return in the morning. While the story itself doesn't hold many surprises, the script is unexpectedly witty, and Price plays it in a slightly prissy, very high-camp manner with a tremendous dose of the black humor for which he was so famous--and the little-known Carol Ohmart is every bit his match, snapping out memorable lines (\"Darling, the only ghoul in the house is you!\") in every scene. Together they elevate the film well above what you might otherwise expect, and when combined with the largely wooden supporting cast and some of the silliest this-is-supposed-to-scare-you effects imaginable the result is a cult classic with plenty of camp appeal. In addition to Price and Ohmart, the film is also surprisingly atmospheric. Shot in and around one of Frank Lloyd Wright's more famous structures, the grainy \"late show\" look of the film (due more to accident and age than deliberate intent) is very entertaining, the cinematic devices (everything from disembodied heads, irises, and jump-cuts) are very appealing, and the sound track (which sounds like a mix of piano bass keyes, synthesizer, and soprano vocals) is exactly what you'd want for this obvious but extremely entertaining flick. Of all the Castle films, THE HOUSE ON HAUNTED HILL is my personal favorite, and it should rate very high with fans of cult, camp, and Vincent Price. And I'll go further than that: of all his memorable appearances, I do believe this was among Price's best. A great choice for both family movie night or a sophisticated Halloween howl--very recommended! Gary F. Taylor, aka GFT, Amazon Reviewer",
         "This movie is a very good tale of a house that may or may not be haunted. This version is better than the newer one, mainly because Vincent Price is so good here, much better than anyone in the new version made in 1999. It is also relatively short and goes by quickly. This movie has some of the same plot elements of the one from 1999, but thankfully the ending to this one is a lot better. I really enjoyed it, as I was hoping the one character would come out on top. This one is about a party being held in an old house that is supposed to be haunted. The people were invited by Price's character and offered $10,000 dollars if they were to stay the entire night. There is tension between Price's character and his wife, there is a girl who is very nervous and wants to leave immediately, and then there is the doctor who does not believe in ghosts. There are three others as well who are invited to stay the night. During the night strange things happen as one of the guests is murdered and there seems to be supernatural things happening. A very well done movie that for me ended perfectly.",
         "Of the many William Castle directed shockers of the '50's and '60's, this one is probably the most traditional in terms of being a \"ghost story\". The set up is irresistible (derivative of \"Ten Little Indians\" in a way.) Five unrelated people are chosen to spend the night in what is purported to be a haunted house. Several murders have taken place in the house in the past. If the participants stay the night, their host (Price) will give them each $10,000 (a nice chunk of change in 1958!) The house is surprisingly non-Gothic on the outside. It more closely resembles a piece of the 1937 \"Lost Horizon\" set. Inside, it has the more expected old woodwork, creaky doors, curtained alcoves, etc... Price is wonderful, as always, as the sardonic, mysterious host. His wife is played by a former beauty queen (Ohmart) who is attractive, if a bit frosty. They have some interesting repartee which reveals their mistrust and hatred for one another. The guests include leading man-type Long, ingenue Craig, nervous Cook, crusty Mitchum and debonair Marshal. Macabre Price gives the guests loaded guns as party favors! It doesn't take long for the unusual occurrences and minor creeps to begin. Soon, the inhabitants are locked in and couldn't leave even if they wanted to! Long and Craig play Fred and Daphne as they try to unravel the goings-on. Cook drinks and gets more paranoid. Marshal tends to the wounded, getting more involved as the story progresses. Mitchum (Robert's sister!) is given little to do and doesn't appear to be a very significant actress. The film is hokey, campy and illogical...full of contrivances and inanities. Yet, it is undeniably entertaining. All of the hallmarks of an old-fashioned scary movie are in place....the eerie music, the undependable lights, swinging doors, secret passages and without question the most hilarious, terrifyingly ugly housekeeper ever put on film! Price is right at home in these surroundings and does much to make the film palatable. There are a couple of fun plot twists to keep it from being too stale and the running time is a very comfortable hour and fifteen minutes. It's just a fun, entertaining way to waste an hour or so. Sadly, Craig (who had a real set of lungs on her...one of the greatest screamers ever!) was felled by a gunshot in real life about twelve years after this film was made at age 36. In fact, Marshal was dead within three years of heart ailments at 56 and Long died 16 years after from a heart attack at 47! And they say \"Poltergeist\" was cursed!",
         "William Castle, the Master Promoter of Low Budget Horror films of the 50's and60's , takes a step closer to immortality with this tasty little thriller starring Vincent Price and Elijah Cook Jr. Not a great movie by any means, but the performances and screen presence of the top two are well worth your time. Price, a ritzy wealthy bon vivant , suspects his unfaithful wife ? might be attempting an early demise for him. He invites 5 people to spend the night at his house,to flesh out the possible killer. (The Historic Ennis Brown Mansion), now in disrepair, irony. The character Watson Pritchard(Elijah Cook Jr.)is the catalyst that helps promote the spookiness of the film. The subplots provided by Richard Long and Carolyn Craig , are just filler. As fate would have it, there are ironic twists , and lessons to be learned about having vats of acids in your cellar. Newer generations may be bored by lack of violence or gore, or the fact there isn't much action, but this is just an innocent date movies from the 50,s. Something to occupy a few hours on a Fri.nite in the dark. Most people in the audience provided their own entertainment. William Castle graduated to bigger and better films such as \"Rosemary's Baby\" later in the 60's. So, in the context of the film world, this will never make the top 1000, but if you need a film to watch in the dark with your significant other, then you might look at this one...Enjoy...Even the Skeleton gets Credit...Ha..Ha...Haaaaaa.........."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["William Castle Productions"],
      "summaries": [
         "Eccentric millionaire Fredrick Loren and his 4th wife, Annabelle, have invited 5 people to the house on Haunted Hill for a \"haunted House\" party. Whoever will stay in the house for one night will earn ten thousand dollars each. As the night progresses, all the guests are trapped inside the house with ghosts, murderers, and other terrors.",
         "Millionaire playboy Fredrick Loren hosts a party for his 4th wife Annabelle Loren at the \"House On Haunted Hill,\" a house that has seen seven murders, Fredrick invites 5 guests: Lance Schroeder,a pilot, Ruth Bridges, a journalist, Watson Prichard, the owner of The House On Haunted Hill, Nora Manning, a worker for one of Fredrick Loren's companies, and David Trent, a psychiatrist. Fredrick will offer each of them $10,000 to spend a night in The House On Haunted Hill. They all want the money. At midnight, the caretakers lock to doors, and the terror begins!",
         "A millionaire Fredrick Loren invites five strangers to a party in the House On Haunted Hill. The house has a past of brutal murders. Mr. Loren's fourth wife, Annabelle, warns the guests that her husband is insane and plans something that night. That's when everyone begins to suspect something's going on with Mr. Loren. At midnight the doors are locked and there's no way to get out. Then when a game of murder begins and no one knows who's doing what there's no way to call for help because there's no electricity, phones, and no way to get out.",
         "Frederick Loren has invited five strangers to a party of a lifetime. He is offering each of them $10,000 if they can stay the night in a house. But the house is no ordinary house. This house has reputation for murder. Frederick offers them each a gun for protection. They will all arrived in a hearse and will either leave in it $10,000 richer or leave in it dead!",
         "Five people are invited by Frederick and Annabelle Loren to spend 12 hours in the house on Haunted Hill. All who manage to do so will receive $10,000. The house is presumably haunted - one of the guests, Mr. Pritchard, who seems to know a great deal about the history of the place and says there are seven in all - but greed drives most of the victims who immediately face various threats to their lives. A chandelier almost kills one; another is haunted by the ghostly apparition of an old crone; while yet another gets a bump on the head in a mysterious room. As the guests continue to be frightened and threatened, two have their own very specific reason for being there and not everyone will live through the night.",
         "A millionaire offers ten thousand dollars to five people who agree to be locked in a large, spooky, rented house overnight with he and his wife."
      ],
      "budget": 200000
   },
   "movielensId": 2519,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-02-17",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["William Castle"],
      "runtime": 75,
      "movieId": 2519,
      "title": "House on Haunted Hill",
      "mpaa": "",
      "actors": [
         "Vincent Price",
         "Carolyn Craig",
         "Richard Long",
         "Elisha Cook Jr.",
         "Carol Ohmart",
         "Alan Marshal",
         "Julie Mitchum",
         "Leona Anderson",
         "Howard Hoffman"
      ],
      "imdbMovieId": "0051744",
      "originalTitle": "House on Haunted Hill",
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "F1wVvWL0pJU",
         "Bsa9ymSDoJ0"
      ],
      "plotSummary": "Frederick Loren has invited five strangers to a party of a lifetime. He is offering each of them $10,000 if they can stay the night in a house. But the house is no ordinary house. This house has a reputation for murder. Frederick offers them each a gun for protection. They all arrived in a hearse and will either leave in it $10,000 richer or leave in it dead!",
      "tmdbMovieId": 15856,
      "avgRating": 3.28662,
      "releaseYear": "1959",
      "numRatings": 949,
      "posterPath": "/fnlPkYlVXrWUkQsVa8Y2tkFoPQq.jpg"
   }
}