{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "wedding vows",
            "id": 1334
         },
         {
            "name": "mathematician",
            "id": 2303
         },
         {
            "name": "car mechanic",
            "id": 3296
         },
         {
            "name": "comet",
            "id": 4803
         },
         {
            "name": "albert einstein",
            "id": 8689
         },
         {
            "name": "halley's comet",
            "id": 155585
         }
      ],
      "imdb_id": "tt0110099",
      "video": false,
      "title": "I.Q.",
      "recommendations": [
         397,
         2058,
         10660,
         10449,
         11566,
         15556,
         20096,
         15602,
         8986,
         9409,
         918,
         10804,
         11821,
         10478,
         12280,
         11521,
         2565,
         12596,
         42580,
         2107
      ],
      "backdrop_path": "/onKEZMoUIFoDCgbn7HGqR3sQBgI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Ed Walters",
               "gender": 2,
               "credit_id": "52fe44849251416c75037835",
               "name": "Tim Robbins",
               "profile_path": "/7pirFsBQe93TSfzu404Hgcj1YWj.jpg",
               "id": 504,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Catherine Boyd",
               "gender": 1,
               "credit_id": "52fe44849251416c75037839",
               "name": "Meg Ryan",
               "profile_path": "/3WMxDdHAtgtSqHjiMyf3liErY3.jpg",
               "id": 5344,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Albert Einstein",
               "gender": 2,
               "credit_id": "52fe44849251416c7503783d",
               "name": "Walter Matthau",
               "profile_path": "/xJVkvprOnzP5Zdh5y63y8HHniDZ.jpg",
               "id": 6837,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Kurt Gödel",
               "gender": 2,
               "credit_id": "52fe44849251416c75037841",
               "name": "Lou Jacobi",
               "profile_path": "/3mZd7AemcMf57gKeINMj0wPs6V5.jpg",
               "id": 23708,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "James Moreland",
               "gender": 2,
               "credit_id": "52fe44849251416c75037845",
               "name": "Stephen Fry",
               "profile_path": "/uaRoTAS2D15vdlpHm122UEUg5ck.jpg",
               "id": 11275,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Nathan Liebknecht",
               "gender": 2,
               "credit_id": "52fe44849251416c75037849",
               "name": "Joseph Maher",
               "profile_path": "/hgq8vDtBsk0ovVxRJHkAyXzTVth.jpg",
               "id": 20626,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Boris Podolsky",
               "gender": 2,
               "credit_id": "52fe44849251416c7503784d",
               "name": "Gene Saks",
               "profile_path": "/svPlh0Jj0yvKJA2Tvqsogci0M85.jpg",
               "id": 69300,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Bob Rosetti",
               "gender": 2,
               "credit_id": "52fe44849251416c75037851",
               "name": "Tony Shalhoub",
               "profile_path": "/jXzlVxS8u64XEZUoNPiuhGcQXDW.jpg",
               "id": 4252,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Frank",
               "gender": 2,
               "credit_id": "579c6ccdc3a3685b59005676",
               "name": "Frank Whaley",
               "profile_path": "/ma1lgPwUHUlgdt9BIcIbEPjdx0h.jpg",
               "id": 11805,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Louis Bamberger",
               "gender": 2,
               "credit_id": "579c6cdf92514164a80065fe",
               "name": "Charles Durning",
               "profile_path": "/cDbNCqLStv13MW8W6DZ504xsbrz.jpg",
               "id": 1466,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "58ffdcb7c3a3680fa70037c2",
               "name": "Danny Zorn",
               "profile_path": "/jGvuaukRRv1VL1yH0ROn7cxasXn.jpg",
               "id": 108098,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44839251416c750377fb",
               "name": "Fred Schepisi",
               "profile_path": "/gN30W0bFd4p55fiCT3oeBFVJqs9.jpg",
               "id": 64061,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c75037801",
               "name": "Andy Breckman",
               "profile_path": null,
               "id": 55373,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c75037807",
               "name": "Michael J. Leeson",
               "profile_path": null,
               "id": 3389,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44839251416c7503780d",
               "name": "Carol Baum",
               "profile_path": null,
               "id": 36131,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c75037813",
               "name": "Sandy Gallin",
               "profile_path": "/prj2OAmJksX9K5xXPSCj1bMU2Jg.jpg",
               "id": 70458,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c75037819",
               "name": "Scott Rudin",
               "profile_path": "/zR8sdlGblto6dneAr2mckTowwEl.jpg",
               "id": 2997,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c7503781f",
               "name": "Fred Schepisi",
               "profile_path": "/gN30W0bFd4p55fiCT3oeBFVJqs9.jpg",
               "id": 64061,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44839251416c7503782b",
               "name": "Ian Baker",
               "profile_path": null,
               "id": 27099,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44849251416c75037831",
               "name": "Jill Bilcock",
               "profile_path": null,
               "id": 3050,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "571fb8da925141280100165b",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.315201,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11777,
      "vote_count": 147,
      "budget": 25000000,
      "overview": "Albert Einstein helps a young man who's in love with Einstein's niece to catch her attention by pretending temporarily to be a great physicist.",
      "similar": [
         11954,
         19947
      ],
      "original_title": "I.Q.",
      "runtime": 100,
      "poster_path": "/kAYymfWcktoHSjQJEtfEIeByZR9.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1994-12-24",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Think Love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Schepisi"],
      "runtime": 100,
      "synopsis": "During the film opening, we see a man, presumably Einstein (Walter Mathau) playing a violin, as another man walks past a poster advertising Boyd's comet. We then see Catherine Boyd (Meg Ryan) with her fiance James Moreland (Stephen Fry). She's working on some math referring to the comet. He comments that she's babbling when she tries to tell him a story. The scene cuts back and forth with a group of elderly men arguing about whether time exists. Meg and James are in his convertible when it develops engine trouble. We see Einstein discussing with his friends (the elderly men), whether there are 'accidents' and he says, \"I do not believe God plays dice with the universe.\" Catherine and James pull into a garage, where Ed Walters (Tim Robbins) is arguing with his boss, Bob (Tony Shalhoub of the TV series \"Monk\"), about the car they hear coming into the shop, what make and model it is and what the trouble with it is, based on what they can hear. Bob sends out Ed to check because he sees the couple and assumes they're \"college people\" meaning they come from Princeton College. As soon as Ed sees Catherine, he falls for her. James, obnoxiously asks if someone there can work on a British engine, and Ed says, \"May I look under the bonnet?\" James, reassured by the use of the word 'bonnet' consents. Ed looks at it, looks at Meg Ryan and pronounces, \"You have no spark.\" There's clearly a double meaning here, referring to her relationship with James. James insists, \"But what's wrong with it?\" and Ed adds, \"My guess is that you have a short stroke and premature ignition.\" He turns to Meg Ryan and says, \"Does it ever feel that way?\" She replies, \"I'm sure I don't know what you mean\" but it's clear that she gets the double entendre. Ed says he'll go check with his boss about fixing it, and goes in to tell his boss that he's in love, that time and space stopped, that he could see himself kissing Catherine in the future. Ed tells Catherine that fixing the car will take days, and she uses his phone to call a cab, giving the cab company and Ed her address for the invoice. In the process, she leaves behind a pocket watch. There's a brief moment where you see a hand move the watch under some magazines, but whose hand? And is it an accident? Or deliberate? The theme of accident versus deliberate intervention occurs repeatedly in the film. Ed goes to return the pocket watch and discovers that the address is the home of Albert Einstein, who is Catherine's uncle. Ed helps Einstein and his friends retrieve a badmitton racket and in the process befriends them. It's clear to them that Ed likes Catherine. Einstein sees that his niece is unhappy with her fiance and wonders how to help Ed date her. She will only date a very intelligent man, and Ed is an auto mechanic. Ed says, \"That's easy, lend me your brain for a couple of days.\" Einstein gets an idea. Einstein and his three friends hatch a plot to make Catherine think that Ed has developed cold fusion as a way to power a rocket to reach the stars so she'll desire him. They help Ed appear hyper-intelligent, helping him present a paper on cold fusion at a symposium and then helping him pass an IQ test administered by Catherine's fiance. Catherine, as a mathematician, is trying to figure out \"Ed's\" theory on cold fusion, but she struggles with it. Ed wants to tell Catherine he's a fake, but he can't quite seem to. Einstein and his buddies interfere with Catherine's relationship with James, and encourage Ed. James is presented as a sadistic, sexually cold man who puts Catherine down subtly. Of course, there's always a happily-ever-after ending, even though it takes President Eisenhower's appearance in the film, a convertible, a motorcycle, waltz music, engineered automotive troubles and a comet, to make it all come about.",
      "writers": [
         "Andy Breckman",
         "Andy Breckman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110099/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMTc2ODg3NV5BMl5BanBnXkFtZTcwNjEyNTUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Tim Robbins, Meg Ryan, Walter Matthau | See full cast and crew »"],
      "reviews": [
         "Maybe I'm being too generous with the rating...but I just love this movie! I've seen it so many times, but every time I see it I fall in love with it all over again. It's just a simple romantic comedy, with nothing huge or monumentous that happens. But I'm a big romantic and this movie *is* romantic. I love Meg Ryan and Tim Robbins, and Walter Mathau is so funny. The scientists make me laugh so much...I definitely recommend this movie to anyone who hasn't seen it. It's such a clean, good movie - and those are so rare now! My 20-year-old brother likes this movie, too, so it's not just a chick-flick. ;-) I recommend it if you need to laugh, or if you're just lonely and need to *watch* a romance, if you yourself can't participate in one. It's a good 'un!",
         "I recently saw I.Q. and even though I'm not a romantic comedy type of gal, I think that it was just a nice and sweet movie to watch. So many movies in my opinion lack honesty. You know that feeling when you're watching a movie and you just feel robbed because it's taking something from the story and it was like the director just threw it together like it was trash? The story between the scientists is a sweet and funny one. How they stuck together and they tried to help Tim Robbins character become smart. I liked the love story between Tim and Meg because it was simple and brought up a good point when it comes to love, \"nothing is what it seems\". I would recommend this for a Sunday morning. 7/10",
         "I just watched I. Q. again tonight and had forgotten how much I love this movie. It is wonderfully entertaining and leaves you feeling that all is right with the world. I love the allusions to Mozart all throughout from the opening with \"Einstein\" playing \"Twinkle, Twinkle Little Star\" on the violin to him humming Eine Kleine Nachtmusik during the IQ testing of the Ed Walters. I love that a woman is portrayed as intelligent and encouraged to have a career, an especially unique situation for the 1950's, the time in which this movie is set. (I myself have been a teacher but stayed at home to raise my children, so please don't think I am some staunch women's libber.) It's wonderful how a man who is \"only a grease monkey\" is finally seen to be just as important and worthy as Catherine's fiance, a clinical behavioral researcher. The message to me is that we are not what we do, but who we are is defined by so much more - no labels. There are so many little gags and one-liners that are almost throwaways if you don't watch and listen carefully. I did catch a few things in the movie that are not listed on the goofs page. In the scene when Ed Walters is to speak at symposium, there are 3 instruments (protractor, ruler, etc.) hanging on the right from the chalk ledge. In the next camera shot, there only 2. In the credits on our video, it lists Tony Shaloub's character as Bob Watters, not Bob Rosetti as he introduces himself in the movie and is listed here on Imdb. I highly recommend this movie. It may be a piece of fluff in some estimations, but has lots more substance than many give it credit for. Not only that, what a great cast is assembled here. Watch it and enjoy!",
         "Silly as silly can be, and yet funny and heartwarming at the same time. Meg Ryan was at her peak in this frothy throwback to the golden slapstick days of Hollywood. The \"seven dwarves\" concept (actually four elderly university professors, one of whom just happens to be Albert Einstein) works just as well here as it did in the two old Hollywood movies this film liberally lifts from. You know the films I mean: a gang moll moves in with a bunch of bachelor professors and falls in love with one of them while the others do everything they can to advance the romance. The first version starred Gary Cooper, if I am not mistaken, and the second, a musical remake, starred Danny Kaye. The climax of I.Q. features some hilarous pratfalls by Ryan and Tim Robbins(later copied in a Minnie Driver comedy), and is not to be missed.",
         "Australian Fred Schepisi (A Cry in the Dark) directs this comedy/ romance that is fun, relaxing, and set in the spring. You will laugh while watching this movie. Tim Robbins (Shawshank Redemption, Dead Man Walking) is an auto mechanic, Ed Walters, with a high IQ, which gets higher with the help of Albert Einstein, Walter Matthau (Grumpy Old Men) and his academic friends Nathan, Kurt and Boris. You can tell them by their preppie shoes. Meg Ryan (Sleepless in Seattle, You've Got Mail) is Catherine Boyd, Einstein's niece who is a competent, but not so confident mathematician. Perhaps it is because she is surrounded by all that genius. She thinks that if she marries someone with a high I.Q. her kids will have a high I.Q. as well, but she does not knows what she wants. Between Tim Robbins cute smile and Meg's cuteness this is a refreshing movie. I love sweet stories. People all ages should enjoy this movie. Catherine is engaged to the jerk James Moreland, who works in animal behavior, but is very stuffy. This is a love a first sight type situation, between the mechanic and the mathematician. Witty lines and subliminal lines! The cinematography is nice. Princeton, New Jersey is beautiful in the Spring. With much help from all those brilliant men Catherine falls for Ed, without knowing that he is an automobile mechanic. Favorite Scenes: Ed taking a multiple choice test in front of a crowd with the help of Einstein, Nathan, Kurt, and Boris. Ed and Einstein riding on the motorcycle. Nathan, Kurt and Boris letting all the research animals free! Favorite Quotes: Albert Einstein: \"Don't let your brain interfere with your heart\". Ed Walters: \"When was the last time he said \"Wahoo\"\"? Catherine Boyd: \"Well I'm sure I don't know\". This is a refreshing movie, I recommend it. I have the tape and every once and awhile I will watch it again.",
         "This is one of my all time favorites. It is so simple and sweet - definitely a chick flick romantic comedy. I really like a film full of good quotes and this has it... one of my favorites is when Albert Einstein says to Ed Walters \"Are you thinking what I'm thinking\" and Ed says \"Now what are the odds of that happening!\" In my opinion, a film is fabulous if you can watch it again and again and get the same amount of enjoyment out of it, and with this one, you can!! I also really enjoyed Walter M.s way of portraying Einstein. I think all the characters fit together really well and the story flows nicely. There are so many times that I find myself smiling right along with the film and quoting my favorite lines as I watch it! I would recommend this movie to anyone who has a heart and enjoys a feel-good romantic comedy now and then!",
         "Bottom line - best romantic comedy ever. This movie accomplishes what all great movies strive for: the creation of a world and time that we want to re-visit and makes us glad to be part of the human race. When I am blue, this movie lifts my spirit and makes me laugh (and that is still true after many viewings - always fresh). All of the actors are in top form. The characterizations are so dead on and the characters mesh so well together that you forget the actor (usually difficult to do with Matthau, Robbins and Ryan). The supporting cast is consistently brilliant: Fry (\"agae\", \"a total pygmy package\"!), Jacoby & Saks & Maher (the three theoretical physicists as \"Greek chorus\" - \"but time doesn't exist\"), Durning (\"something we can launch from NJ\"), Shalhoub & Whaley (Robbins' boss and co-worker at the service station), and Curits (Eisenhower - how many comedies have Eisenhower??). Don't miss this overlooked treasure.",
         "A genial romantic comedy, \"I.Q\" is a flirtatious piece of fluff in which an auto mechanic woos the educated daughter of ol' E=MC2 himself, Albert Einstein. No guffaw inducer, but very pleasant fare given a considerable boost by its cast, most notably Matthau who is very good indeed as Mr. Einstein.",
         "I believe this will ultimately be regarded as one of Ryan's best, no matter where it stands today or no matter how badly it might have bombed at the box office. Why? Because it's unabashedly everything her other 'cute' movies play at doing; because Tim Robbins is simply brilliant; because Einstein's friends are so good; because Tony S is nothing short of brilliant; and because Walter Matthau is perhaps the real star. There are memorable quotes you will read about in this section, but they don't really work unless you see them being delivered. This is only a romp, and it's only for fun, but it has a strong underlying message delivered by Matthau towards the end. It's very well acted; and if you think Ryan's character is a bit unreal, fine: it is. But that's what you get for the price of admission.",
         "Fairly good romantic comedy in which I don't think I've ever seen Meg looking any cuter. All the players did a good job at keeping this a lively romp. Of course, in the real world no genius mathematician would even glance at some grease monkey, but that is why I love romantic comedies....one can just totally forget reality and have a good time. Nice film. Damn, Meg is a babe, eh?"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Sandollar"
      ],
      "summaries": [
         "Edward Walters, an auto mechanic, falls for the intelligent and beautiful Catherine Boyd. It is love at first sight. There is however a problem, she's engaged to jerk James Moreland. Fortunately, Catherine's uncle likes Ed, and with his friends they scheme to make Catherine fall for Ed. The comedy in this movie stems from the fact that Catherine's uncle is none other than Albert Einstein, who's portrayed as a fun loving genius, as are his mischievous colleagues, Nathan, Kurt and Boris.",
         "Albert Einstein helps a young man who's in love with Einstein's niece to catch her attention by pretending temporarily to be a great physicist."
      ],
      "budget": 25000000
   },
   "movielensId": 252,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1994-12-24",
      "dvdReleaseDate": "2003-09-23",
      "directors": ["Fred Schepisi"],
      "runtime": 100,
      "movieId": 252,
      "title": "I.Q.",
      "mpaa": "PG",
      "actors": [
         "Tim Robbins",
         "Meg Ryan",
         "Walter Matthau",
         "Lou Jacobi",
         "Stephen Fry",
         "Joseph Maher",
         "Gene Saks",
         "Tony Shalhoub",
         "Frank Whaley",
         "Charles Durning",
         "Danny Zorn"
      ],
      "imdbMovieId": "0110099",
      "originalTitle": "I.Q.",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "AzwMZVRxTE0",
         "1lF2BkLl0yQ"
      ],
      "plotSummary": "Albert Einstein helps a young man who's in love with Einstein's niece to catch her attention by pretending temporarily to be a great physicist.",
      "tmdbMovieId": 11777,
      "avgRating": 3.21029,
      "releaseYear": "1994",
      "numRatings": 10968,
      "posterPath": "/kAYymfWcktoHSjQJEtfEIeByZR9.jpg"
   }
}