{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spacecraft",
            "id": 1612
         },
         {
            "name": "pacifism",
            "id": 2821
         },
         {
            "name": "human being",
            "id": 3714
         },
         {
            "name": "cage",
            "id": 4392
         },
         {
            "name": "dystopia",
            "id": 4565
         },
         {
            "name": "politician",
            "id": 6083
         },
         {
            "name": "chimpanzee",
            "id": 157972
         },
         {
            "name": "tease",
            "id": 157974
         },
         {
            "name": "caving",
            "id": 158018
         }
      ],
      "imdb_id": "tt0067065",
      "video": false,
      "title": "Escape from the Planet of the Apes",
      "recommendations": [
         1688,
         1685,
         1705,
         871,
         172,
         9531,
         152,
         9610,
         168,
         157,
         2157,
         8536,
         682,
         174,
         3604,
         11935,
         11411,
         2614,
         11285,
         699
      ],
      "backdrop_path": "/ky9wlRARSDYgHVWU39iXCappHLx.jpg",
      "revenue": 12348905,
      "reviews": [{
         "author": "Potential Kermode",
         "id": "58cd2148c3a36850e90094bb",
         "content": "**A picture of the artist painting a picture of the artist painting a picture of the artist painting a picture of the artist painting a landscape.**\r\n\r\nIndeed.\r\n\r\nTalk, talk and some more talk. Then they all decide to talk some more - taking a break for a little more talking - before finally deciding on talking just a little while longer. These actors must have had sore tongues after the film was completed. Some of them hospitalised with repetitive strain on the jawbone.\r\n\r\nA very talky film which could indeed lose the interest of younger viewers. Younger viewers don't want to see  old men blabbering for 90 minutes - they want gorillas with machine guns.\r\n\r\nLots of scenes of people with tobacco stained grey hair talking around 1970's tables and not much action here. \r\n\r\nNot enough psycho gorilla action. The three chimps should have brought at least one maniac gorilla with them for security reasons. If there weren't enough seats in the ship then I am certain he wouldn't mind standing.\r\nPerhaps they feared that once they arrived and they opened the ships hatch on the beach - everything from turtles, whelks and Brian Wilson's surf board would have been riddled with bullets.\r\n\r\n- Potential Kermode",
         "url": "https://www.themoviedb.org/review/58cd2148c3a36850e90094bb"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cornelius",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036841",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Dr. Zira",
               "gender": 1,
               "credit_id": "52fe430cc3a36847f8036845",
               "name": "Kim Hunter",
               "profile_path": "/nB44EysedphcIWftSqyyG2qBYk8.jpg",
               "id": 10539,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. Lewis Dixon",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036849",
               "name": "Bradford Dillman",
               "profile_path": "/zmoOkQTh6c7VwQlEl86r73pYFFw.jpg",
               "id": 18647,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dr. Stephanie 'Stevie' Branton",
               "gender": 1,
               "credit_id": "52fe430cc3a36847f803684d",
               "name": "Natalie Trundy",
               "profile_path": "/50ljrtCFeFQRFURoSgf1hrgdCPw.jpg",
               "id": 18648,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Dr. Otto Hasslein",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036851",
               "name": "Eric Braeden",
               "profile_path": "/6dEqM2zylkopoZtr6quXW5i7W0V.jpg",
               "id": 8544,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "The President",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036855",
               "name": "William Windom",
               "profile_path": "/nTqbMx3o9rk6Q5PfS3fwh5LEbGw.jpg",
               "id": 8499,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dr. Milo",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036859",
               "name": "Sal Mineo",
               "profile_path": "/Ahb40hYos0eGAPpb7oeRRPpOKrG.jpg",
               "id": 2770,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "E-1",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f803685d",
               "name": "Albert Salmi",
               "profile_path": "/z7dpRaZTt3ETMx48cvMBgcQAN97.jpg",
               "id": 12692,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "E-2",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036861",
               "name": "Jason Evers",
               "profile_path": "/18UezS7VTmEd3WQ4R7kizPKgeNd.jpg",
               "id": 16089,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Committee Chairman",
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036865",
               "name": "John Randolph",
               "profile_path": "/r3HirIBplq3hjYYvO7JtyGP4SrF.jpg",
               "id": 18649,
               "order": 9
            },
            {
               "cast_id": 30,
               "character": "Aide",
               "gender": 2,
               "credit_id": "54a1fba19251414e28008db2",
               "name": "M. Emmet Walsh",
               "profile_path": "/dLf79xlsmE40rog0gryjxsZJzml.jpg",
               "id": 588,
               "order": 10
            },
            {
               "cast_id": 31,
               "character": "Armando",
               "gender": 2,
               "credit_id": "54a202209251414e28008ed4",
               "name": "Ricardo Montalban",
               "profile_path": "/cjVYY35mjqZsno1qECjTr4lzqbS.jpg",
               "id": 1793,
               "order": 11
            },
            {
               "cast_id": 32,
               "character": "Official at Briefing",
               "gender": 0,
               "credit_id": "55d2a97f92514134070009fe",
               "name": "Arthur Tovey",
               "profile_path": null,
               "id": 1208039,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f803686b",
               "name": "Don Taylor",
               "profile_path": "/ozLWbvtjxMhthQZQpGwpJ5UgZf5.jpg",
               "id": 9108,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036871",
               "name": "Paul Dehn",
               "profile_path": null,
               "id": 9916,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe430cc3a36847f8036877",
               "name": "Marion Rothman",
               "profile_path": null,
               "id": 18651,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe430cc3a36847f803687d",
               "name": "Howard A. Anderson III",
               "profile_path": null,
               "id": 18652,
               "department": "Crew",
               "job": "Special Effects Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036883",
               "name": "Jack Martin Smith",
               "profile_path": null,
               "id": 9061,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f8036889",
               "name": "William J. Creber",
               "profile_path": null,
               "id": 7512,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f803689b",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f80368a1",
               "name": "Joseph F. Biroc",
               "profile_path": null,
               "id": 14431,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f80368a7",
               "name": "Pierre Boulle",
               "profile_path": null,
               "id": 12240,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f80368ad",
               "name": "Stuart A. Reiss",
               "profile_path": null,
               "id": 9799,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f80368b3",
               "name": "Walter M. Scott",
               "profile_path": null,
               "id": 9587,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe430cc3a36847f80368b9",
               "name": "Arthur P. Jacobs",
               "profile_path": null,
               "id": 13269,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "569d46b4c3a36858ce003f5b",
               "name": "Dean Vernon",
               "profile_path": null,
               "id": 18655,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "569d46c69251415e6a003f28",
               "name": "Theodore Soderberg",
               "profile_path": null,
               "id": 18656,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.072317,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 1687,
      "vote_count": 332,
      "budget": 2500000,
      "overview": "The world is shocked by the appearance of two talking chimpanzees, who arrived mysteriously in a U.S. spacecraft. They become the toast of society; but one man believes them to be a threat to the human race.",
      "similar": [
         198663,
         76341,
         157350,
         281,
         604,
         605,
         335984,
         9482,
         7512,
         9739,
         9381,
         12244,
         2048,
         9659,
         9693,
         17431,
         87101,
         110415,
         61791,
         83542
      ],
      "original_title": "Escape from the Planet of the Apes",
      "runtime": 98,
      "poster_path": "/yOnN43HdxvV5h5U4qsGIfeUL0Zv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "APJAC Productions",
            "id": 12943,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1971-05-20",
      "vote_average": 6.3,
      "belongs_to_collection": {
         "backdrop_path": "/eYf3GRnuVCgeFQfEo0qK7ua5rCR.jpg",
         "name": "Planet of the Apes Original Collection",
         "id": 1709,
         "poster_path": "/r7TBDEcpBAuFoqdtUz7z2nSeFej.jpg"
      },
      "tagline": "Meet baby Milo who has Washington terrified.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Taylor"],
      "runtime": 98,
      "synopsis": "The preceding film, 'Beneath the Planet of the Apes', ends with a nuclear weapon's destruction of the apes' future Earth itself and everything on it. 'Escape from the Planet of the Apes' begins by establishing that three chimpanzee apes, Cornelius (Roddy McDowall), Zira (Kim Hunter), and Dr. Milo (Sal Mineo) escaped the Earth's destruction by salvaging and repairing the astronaut Taylor's spaceship (which sank in the Dead Lake in the desert Forbidden Zone in the first movie) and piloting it through the nuclear shock wave of Earth's destruction, sending the ship into space and through a time warp wormhole back to present day 1973. The salvage, repair and launch of Taylor's spaceship apparently all happened (off-camera) within the brief period during the final act of the previous film. The three apes arrive on Earth, splashing down on the Pacific coast near Los Angeles. They are found by the surprised local authorities and are transported to a secluded area of the Los Angeles Zoo, under the observation of two scientists, Stephanie Branton (Natalie Trundy) and Lewis Dixon (Bradford Dillman), who administer a series of intelligence tests, which Zira performs unerringly, but she finally loses her patience at the end of the last one and answers Stephanie's question to Lewis with an angry retort. Stephanie and Lewis step outside, completely astonished. Milo argues with Zira and Cornelius about their agreement to hide their ability to speak until they felt the time was right. The argument agitates a wild gorilla on the opposite side of a set of bars in the cages. Milo steps too close to these bars and the wild gorilla reaches through them and strangles Milo to death. Meanwhile, a Presidential Commission has been formed to investigate the return of Taylor's spaceship which was launched the previous year and how the apes, which they already are aware are atypically intelligent, came to be aboard it. Cornelius and Zira are brought before the Presidential Commission, where they publicly reveal their ability to speak, and are welcomed as guests. They tell the commission about their planet in the future which is future Earth, about the apes way of life, but they deny knowing Taylor or anyone else that crash landed on their world. Over the next several weeks, the two apes become celebrities, being lavished with presents and media attention as well as staying in a fancy hotel suite. They come to the attention of the President's Science Advisor Dr. Otto Hasslein (Eric Braeden), who discovers Zira is pregnant and fears for the future of the human race after Zira had earlier told the commission about the growing dominance of apes to be set in the near future. Determined to force the issue, he gets her drunk on champagne (which he assures her is harmless, calling it \"grape juice plus\"). The resulting interrogation enables him to convince the Commission that Cornelius and Zira must be subjected to more rigorous questioning. Both chips are brought to a top secret military base are questioned using various means of interrogation; during this time, one of Hasslein's assistants refers to the apes as \"monkeys\", stirring Cornelius' anger. Hasslein defuses it, saying they simply want to know how apes rose in dominance over men. Under interrogation, Cornelius reveals that according to the historic archive books and scrolls in their ape society of the future, the human race will eventually meet its downfall in the late 20th Century after a plague wiped out all domestic cats and dogs of humans and that humanity adopted apes as household pets which they turned into slaves and that a militant ape, known only as 'Aldo', led a slave revolt and the world was soon dominated by the simians, which will, many centuries later, lead to the surface of Earth's destruction through nuclear war and anarchy in the year 3955. However, there are still suspicions about how humans are treated by the future apes when Cornelius and Zira continue to deny knowing Taylor or talk about how humans are treated in their world. Suspicion had already been aroused by Zira letting it slip, during her drunken interrogation by Dr. Hasslein, that she had dissected humans in the course of her scientific work. Hasslein orders Lewis to administer a truth serum to her, while Cornelius is taken to confinement quarters. Lewis warns Zira that the serum will have the same effect as the champagne Hasslein convinced her to drink earlier. As a result of the serum, Hasslein learns for himself that Zira examined and operated on humans in the future and indeed knew Taylor as well as Barnes who also arrived on their planet. Zira is taken to join Cornelius in confinement while the paranoid Hasslein takes his findings to the U.S. President (William Windom) who insists to the President that the apes are a danger to the human race. A little later, an orderly bringing food refers to the unborn child as a \"little monkey\"; Cornelius has heard enough of the epithet and knocks the tray out of the orderly's hands and bashes him on the head with the tray, and uses this advantage to escape from the military base. At first, Cornelius thinks that he has only knocked the orderly unconscious, but he is later stunned to overhear that the man died. Hasslein uses the orderly's death and of Cornelius and Zira's escape as an illustration of the future danger the apes present and calls for the apes' execution. The president reluctantly orders that the unborn child's birth be terminated and that both chimpanzees be sterilized or killed. Running for their lives, Cornelius and Zira (assisted by Stephanie and Lewis) find shelter in a circus run by a Mexican national named Señor Armando (Ricardo Montalbán), where an ape named Heloise has just had a baby. There Zira gives birth to a son, whom she names Milo (later known as Caesar). Hasslein, knowing Zira will imminently give birth, orders a search of all circuses and zoos. As a result, Armando must send the apes away. Armando, Lewis and Stephanie provide them with maps and help them plan to hide until such time as they can escape into the Florida Everglades to live the rest of their lives in peace. In case they are discovered, Lewis gives Cornelius a pistol to use as a last resort. Zira asks to say goodbye to Heloise before they leave. Hasslein tracks the apes down to an abandoned ship in Long Beach harbor, and finds Zira resting with her infant. Hasslein shoots Zira in cold blood after she refuses to hand over her infant and then proceeds to fire several shots into the infant. Hasslein is immediately shot to death by Cornelius, and falls overboard. After Cornelius kills Hasslein, he is shot by several Marine Corps snipers and, as Stephanie and Lewis watch helplessly from the shore, falls to his death onto the poop deck of the ship. Zira tosses her dead baby over the side of the ship before crawling to lie with her husband and dying by his side. But in the final scene in a surprising plot twist, Stephanie, Lewis and the other humans are unaware of the real fate of the infant ape. Earlier, Cornelius, Zira, and Armando switched babies with Heloise before their escape from the circus. Armando now watches over the infant Milo as the circus is being moved to a new location. Armando remarks how intelligent that the baby chimp is who will now survive with him at his circus. The final shot shows the baby ape Milo sitting in a cage, plaintively speaking the words \"Mama? Mama?\" with the voice of a human child.",
      "writers": [
         "Paul Dehn",
         "Pierre Boulle"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0067065/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjg2MjY0NDMwM15BMl5BanBnXkFtZTcwNjQ0NzA0MQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Roddy McDowall, Kim Hunter, Bradford Dillman | See full cast and crew »"],
      "reviews": [
         "After \"Planet of the Apes\" was completed, its star, Charlton Heston, argued strongly that there should not be a sequel. The original film was complete in itself, and any sequel would only dilute its impact and tarnish its reputation. In the event, a sequel was made and Heston was reluctantly persuaded to appear in it. He suggested, however, that it should end with the destruction of the Earth, a denouement that, he hoped, would put paid to any attempt to extend the series beyond two films. In one respect Heston was to be proved right. \"Planet of the Apes\" is a classic, one of the best science-fiction movies ever made and one that combines an exciting plot with philosophical depth. It is frequently said that sequels are generally inferior to the original films, but seldom is this is as true as in the case of \"Beneath the Planet of the Apes\", a hopeless mess of a film. Neither its lack of artistic merit, however, nor its explosive ending dissuaded the filmmakers from making a third \"Apes\" film. An ingenious device was found to avoid the problems posed by planetary destruction; it is explained that shortly before the Earth was destroyed three of the apes found the wreckage of Taylor's spacecraft, repaired it and used it to travel back in time to 1970s America. Although one of the apes is killed in an unfortunate incident shortly after arrival, the American public take to the two survivors, Cornelius and his wife Zira (both of whom played important parts in the first two films). The two intelligent, talking chimpanzees become media celebrities, and the early scenes are much lighter in tone than the two earlier films, at times even comic, as the two apes become after-dinner speakers and discover the joys of alcohol. The tone, however, gradually darkens. Figures in the government become alarmed by talk of a future in which men are dominated by apes, and Dr Hasslein, the President's sinister Germanic adviser, (based on Henry Kissinger?) is convinced that Zira and Cornelius represent a threat to the human race, especially after it is discovered that Zira is pregnant. My disappointment with \"Beneath....\" had hitherto dissuaded me from watching any more of the later episodes in the \"Apes\" canon, so I was pleasantly surprised by \"Escape.......\". Although it lacks the depth and brilliance of \"Planet of the Apes\", it is considerably better than its immediate predecessor. The reason for its relative success lies with the fine contributions of its two stars, Roddy McDowell and Kim Hunter. Their characters played important supporting roles on the original film; here they take centre stage. The original had Heston's character Taylor at its centre, a human in danger from the apes. In \"Escape......\" the roles are reversed, with two lovable, and deeply human, apes in danger from humans. There is, however, a difference between the two films. The danger to Taylor came largely from ignorance; the apes, particularly Dr Zaius, saw him as a brute beast, like the other humans of their planet, and refused to listen to the evidence that suggested that he was, in fact, an intelligent being like themselves. Cornelius and Zira are in danger because of both their human and their non-human characteristics. Hasslein knows that they are intelligent beings who seem human and yet are not, and hates and fears them for precisely that reason. Just as they pitied and befriended Taylor, so they are in their turn befriended by two human scientists who try and save them from Hasslein. There are a couple of inconsistencies between this and the earlier films, where the apes' society is shown as being technologically less advanced than ours, on a par with sixteenth or seventeenth century Europe. It is not explained how individuals from such a society could have succeeded in repairing and operating a spacecraft. Another inconsistency is that Cornelius and Zira know how the apes came to seize control of the Earth from humans and even state that this story is told in the Sacred Scrolls, the holy books of the apes' religion. In \"Planet of the Apes\" we are to understand that the Scrolls explicitly deny that humans ever had the powers of speech and reason, which is why Zaius is so reluctant to admit that Taylor can speak. These inconsistencies, however, are not really plot-holes as such and are unlikely to worry those who come to \"Escape.......\" without having seen its predecessors. \"Escape.......\" can be seen as a film in its own right rather than as a mere sequel, a film which starts out as a comedy and then turns into a serious thriller as the apes try to escape from their human enemies. Although it is less philosophical than the first film, it can perhaps be seen as an allegory of racism as Hasslein's paranoia leads him to treat as enemies those who bear no ill-will to him and his kind and whose only crime is to be different from him. It is significant that his name is derived from the German for \"hate\". 6/10",
         "MORD39 RATING: *** out of **** This third APES film ingeniously manages to keep the franchise alive and produces what is arguably the second best film of the five originals. After the ultimate ending in BENEATH, who could have believed a new story was possible? Here the tables are turned from the original film with a remarkable twist: now three of our chimpanzee characters take off in Charlton Heston's spaceship and wind up going BACK in time, to \"present Day\" Earth (1973 A.D.) Once it is learned that Zira (Kim Hunter in her best performance in the series) is pregnant with the child that could possibly turn our future into the PLANET OF THE APES, she and her husband Cornelius (Roddy McDowall) go from becoming honored celebrities to dangerous threats to humanity! It's a brilliant idea, and now it is possible to start the series anew (chronologically, this movie comes first) and see whether or not Taylor's nightmare from the first film can be prevented or will rear its ugly head for mankind. A little defending is in order here. Many people get hung up on the story's notion that the chimpanzees can actually manage to fix Taylor's ship from the first film and actually launch it. Well, I say that if you can suspend disbelief long enough to accept the idea of a society of talking apes, why can't you accept that one of them (Dr. Milo) is a super-intelligent ape, sort of the \"Albert Einstein\" or \"Thomas Edison\" of his time? Besides, when folks get stuck on a point like that it becomes impossible for them to have a good time with a film. As Cornelius said in the movie: \"Dr. Milo was a genius well in advance of his time.\" He was able to fly the ship. Case Closed. Next case: the \"TV Movie\" look of the film. SO WHAT? People have become so accustomed to garbage like 1999's THE MUMMY that unless all films are over-swamped with spectacular sets and numbing effects, they can't enjoy them. Well, ESCAPE needs none of these to tell its simple story. It's got something that sci-fi stories today have lost...\"heart\".",
         "In a brilliant solution for continuing the storyline after the ending of BENEATH THE PLANET OF THE APES, three intelligent chimpanzees from Earth's future take off in Charlton Heston's salvaged spacecraft just prior to Earth's destruction; they wind up hurled backward in time to 1973 California and - in an interesting twist on the original theme - now find themselves the strange visitors in a strange world ruled by bombastic human beings. Lovable simians Zira and Cornelius (expertly played by Kim Hunter and Roddy McDowall) lose their friend Dr. Milo (Sal Mineo!) early on in a tragic accident, and find themselves in a strange situation when mankind first welcomes them as celebrities and garnishes them with gifts, but ultimately begins to fear when it is learned that Zira is pregnant with an ape offspring that could grow to overtake humanity. We really grow to sympathize with the plight of the chimpanzee couple, and we fear along with them and the safety of their child when they become hunted fugitives later in the story. Eric Braeden is very good as the quintessential villain out to kill the ape family at any cost. Some people enjoy picking on the APES sequels as they continued, but I've always felt this series consistently remained very intelligent and had something powerful to say about race relations and prejudice. People want to know how apes could ever manage to send Taylor's ship into orbit; I say that if you can suspend disbelief long enough to accept the notion of intelligent apes, then it shouldn't be that far a reach to accept that Dr. Milo was the genius of his time who just could pull it off; the Thomas Edision of his type, if you will. The timeline in the five apes films is often admittedly contradictory, but there are ways that fans of the Apes movies have been able to make them work. For example, in this film Cornelius seems to talk about Ape History and Evolution in a way that actually doesn't follow suit during the next two installments. That's because the very arrival of Zira and Cornelius onto present-day Earth of 1973, and the subsequent birth of their baby, will accelerate the procedure from how Cornelius remembered it, as we'll see in the next two chapters. The circumstances for the future will be sped up and changed, and the apes will evolve at a much quicker rate. Some of the other dubious complaints are aimed at the \"lesser budgets,\" or supposed \"TV Movie Look\" of the sequels from this point on -- but this story in ESCAPE does not require mind-numbing special effects or hordes of CGI-rendered ape figures swarming Los Angeles to make it effective. It's got a lot of heart and good writing with characters we care about, and that's all it needs.",
         "'Escape' is my favorite of the Apes series. What can I say about it? It's just heartbreaking! These movies.. the endings are incredible! And especially in this one. You NEVER see these kind of endings now! I actually found myself crying! Though, the movie at the beginning, is just FUN! Ricardo Montalban was great in this, as was Roddy and Kim. What more to say? EXCELLENT WONDERFUL movie!",
         "Following the cataclysmic finale of Beneath the Planet of the Apes, there was only one logical direction for the series to go---> back to the future. The result is an illogically conceived and satirical prequel that will amuse and delight and ultimately devastate with its bleak Shakesperean tragedy. When Taylor's spacecraft unexpectedly splashes down in 1973 and is retrieved by a military envoy, the three astronauts that emerge from the capsule are not revealed to be Taylor, Landon and Dodge, but rather the astonishing simian ape-chimps Cornelius, Zira and Milo... the third of which is a completely disposable character who is appropriately killed off very early by a caged zoo gorilla who was probably jealous that the talking simian chimpanzees were getting all of the attention. With Milo out of the picture, the story focuses on the relationship between Cornelius and Zira in ways that were not afforded the opportunity in the two previous films and is filled with tongue-in-cheek episodes inspired by Pierre Boulle's original novel as Cornelius and Zira go around \"aping\" 20th century human culture (a subtle and clever mockery of our own) in an attempt to make themselves fit in to our society. While Cornelius and Zira make themselves at home as cultural \"celebrities\" they are being carefully monitored under the watchful auspices of the nefarious Dr. Otto Hasslein played by recognizable character actor Eric Braeden (of Young and the Restless fame) who listens with great interest to what the talking chimps have to say about where they came from during a Presidential Inquiry and how they managed to arrive in Taylor's spacecraft as Cornelius explains that the capsule was found when it washed ashore and was repaired by Milo -- an implausibility which is the film's glaring continuity error since Taylor's spacecraft sunk into the depths of the Forbidden Zone it is a far fetched conclusion that they somehow managed to not only find, retrieve and repair it (even if they had repaired Astronaut Brent's crashed spacecraft from Beneath which was overlooked as well) with engineering far in advance of their own intellectual ape intelligence (which Milo only \"half-understood\" as Cornelius describes it) but managed to do so and escape within a very small window of time before the planet was obliterated by the shock-wave of destruction catapulting them backwards in time and arriving at roughly the same destination and era as Taylor's original point of departure (it could be argued that these narrative inconsistencies support evidence of \"Hasslein's Observed Time Curve\" which suggest that a predestination paradox created alternate intersecting timelines as illustrated by the incongruent timeline of events between Conquest and Battle). Nevertheless, once you get past the major plot hole and just go with it, Escape is a fun and dramatically intense film but is my least favorite second only to the weakest link in the evolutionary Apes chain; Battle For The Planet of the Apes. When Zira announces that she is pregnant, the film takes a dark and conspiratorial turn when the government realizes the consequence a race of intelligent talking apes will have on the future of our human society. In an effort to protect their newborn, Cornelius and Zira find refuge with Armando, a sideshow circus entertainer played by the extravagant Ricardo Montalban who gladly welcomes the simian family with open arms, but it isn't long before Dr. Otto Hasslein picks up the fugitives' trail and hunts them down in a tragic and inevitable climax that sets up the paradox of the entire Planet of the Apes chronology.",
         "No, this film is not as awe-inspiring as the original but it still maintains the viewer's interest despite the scaled down approach which was due to budget constraints. For much of the film the there is a humorous tone. Good performances were turned in by familiar faces (Braeden, Montalban, Mineo). The story, despite some holes, was quite riveting. I'm looking forward to the fourth installment. The sense of adventure and exploration (this time by the apes) and the continued presentation of parallels between this fictional world and our world still make for worthwhile viewing. 7/10.",
         "You have Ricardo Montalbon, you have Soap star Eric 'mustache' Breaden, and you have Sal 'Rebel without a Cause' Mineo. How can you go wrong? You have guys in Chimp suits. You have Roddy. You have Kim Hunter from the first flick. It's great. My chief memory/image of the flick is seeing them, the trio of apes, being given the Star treatment, getting outta a limousine in front of a crowded city street, etc. That is very much a part of the flick. It was made in '71, and yeah it really, really looks it-but ya gotta like it. William Windom as da Prez is pretty cool too, def. a knockoff of hostile Nixon in places I would say. This sets up the next two fine, though its both better than them and better than #2 in the run also. I think you can do worse than to sit through this....... **1/2 outta ****",
         "ESCAPE FROM THE PLANET OF THE APES is a tale set in the madness of a paranoid 1970's in which zira and cornelius must fight for their lives and the life of their unborn baby. Using taylors ship zira and cornelius time warp to 1970's earth and are embraced by mankind. They soon become the target of a government think tank who fears their unborn child. In a era that listened to HAL LINDSEY scream the anti christ is coming this film taps into that paranoid vein with the \"john birchish\" character of Hessline who fears ziras baby. The film deals with the two apes dealing with 20th century earth and attempting to survive the scrutiny of the government. One of the best and most original films in the series the story told in this film makes it stand out. A fine film.",
         "\"Escape from the Planet of the Apes\" came out in 1971 in the midst of very controversy times. The film is directed by Don Taylor, and stars Roddy McDowall, Kim Hunter, Sal Mineo, Bradford Dillman, Ricardo Montalban, Natalie Trundy, Eric Braeden, William Windom, John Randolph, and M. Emmet Walsh. It is part III of the Ape Series, however, the film doesn't require the viewer to see the previous other Ape films to understand what's going on, but I think it helps to see the other two so you can fully understand the character's motives and thoughts. THE PLOT - Three highly intelligent humanoid Chimpanzees from outer space land on planet Earth in the Pacific coast in 1973 via their space ship. They are taken by the authorities to the Los Angeles Zoo. At first, the Apes are seen as a novelty and become famous and loved through out the world, but soon, they are perceived as a threat to all of mankind and planet Earth. The film starts off as being a light family comedy, but takes a very dark turn. MY THOUGHTS - Like the previous Ape films, \"Escape\" has parables that address social issues that were going on in the world at that time. The year was 1971 when the film was released, right when racial segregation was ending, and Black and White people were starting to live and work amongst each other as equals. I believe the film is suggesting to the audience that accepting those who are different from you and giving them a chance might not be a bad idea, and that you shouldn't believe everything you hear about people. The film is anti-racist, and also has an anti-abortion theme to it, and has somewhat of an anti-government theme to it as well, and addresses the issue of government intrusion. Some of the other topics include scientific experimentation on animals, and nuclear war. One of the many reasons why I like this film because it makes me appreciate what I have. The chimps come to 1973 and our just amazed at the technology. It makes me not take for granted what we have. I sometimes think how someone from the 1860's would react to the things we have in 2015, and they'd most likely be highly impressed, and their reaction makes me realize how lucky we have it, and that we shouldn't take what we have for granted, and enjoy it to the fullest. We really have no excuse for ever being bored. In this film, Cornelius and Zira take center stage, and become the stars, which I enjoyed because I liked both characters a lot in the first two Ape films. The film is a bit of a love story as well, because what Cornelius and Zira are going through in this film is not easy, and only their love for each other is what keeps them going strong. Another cool thing about this film is the reverse it took - In the first two Ape films, we see human beings land on a Planet of Apes where Apes rule, and humans are treated like animals, and we see how those men respond to it. In this film, we see Apes from that same planet land in the U.S.A. in 1973 where humans rule, and Apes are kept in cages, and we see their responses to it. I think the film and the whole Ape series is making a point that any corrupt system - whether run by White or Black people or anyone else of any color is wrong. That no group is superior to the other, and that we are all equal, and if peace is really desired, we should learn to accept one another, and not abuse any power we are given, and that only suffering will lead to any abuse of power. FINAL THOUGHTS - This is one of those films that get different responses from different people. It presents hard questions of morals such as \"If you could go back in time and kill Adolf Hitler's mother while she was pregnant with him, would you?\"",
         "The 3rd film in the Apes series (after \"Beneath...\"), this one is easily the most whimsical, at least in the first half. The writers had to stretch believability in getting the two primary apes of the 1st 2 films into our present times from the future, when Earth is destroyed by a doomsday bomb, but the first few scenes are almost classic farce disguised as science fiction storytelling. We view our central characters first as 'ape-onauts' and then stuck in a zoo, followed by a brief turn at celebrity when our populace becomes enamored of the two as the latest fad. The best and most clever thing about this sequel is that it utilizes the already well-known captivating characteristics of the chimps, delightfully performed again by McDowall and Hunter. They're kind of like old friends by this time and seeing them get acquainted with our modern-day culture is just good times. It's also a neat reversal on the ape society of the first two films, which was visited by aberrant intelligent humans. Things turn grim in the 2nd half, as the fad wears off and our leadership begins to take the threat of possible future ape domination rather seriously. The most interesting character becomes the chief human scientist, played by Braeden, who starts out typically dispassionate but soon reveals an intense personal desire to preserve the human race and society, to the point of fanaticism. In his coldly intelligent eyes, only he sees the truly apocalyptic threat presented by the chimps' pregnancy. He's the nominal villain, but he sees himself as the only one who gives a damn. Some of the sf plot lines regarding time travel are very clever, while others are a bit clumsy. It's clever that the two evolved time-traveling chimps may now be the cause of the future time-line ruled by an ape society. But they reveal to have a knowledge of their history that did not exist in the previous two films. Also, rather than letting events evolve over a century or more following what happens here, the next film accelerates everything to change the world in the next 20 years - see \"Conquest of the Planet of the Apes.\""
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "APJAC Productions"
      ],
      "summaries": [
         "Following the events in \"Beneath the Planet of the Apes\", Cornelius and Zira flee back through time to 20th Century Los Angeles, where they face fear and persecution similar to what Taylor and Brent suffered in the future, and discover the origins of the stream of events that will shape their world.",
         "Cornelius and Zira, the simian ape couple from the first two ape films, flee from their doomed planet (after the events in Beneath...) in the same spaceship used by Taylor in the first film, and travel back through the same space/time porthole and land on late 20th Century Earth where they are received with fascination and fear from the people they meet.",
         "The third chapter of the Apes saga. Two intelligent simians from the future, Cornelius and Zira, travel to present-day Earth. They become instant sensations, wined and dined and treated like celebrities -- until a high-level plot forces them to run for their lives.",
         "The world is shocked by the appearance of two talking chimpanzees, who arrived mysteriously in a U.S. spacecraft. They become the toast of society; but one man believes them to be a threat to the human race."
      ],
      "budget": 2500000
   },
   "movielensId": 2533,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1971-05-20",
      "dvdReleaseDate": "2000-08-15",
      "directors": ["Don Taylor"],
      "runtime": 98,
      "movieId": 2533,
      "title": "Escape from the Planet of the Apes",
      "mpaa": "G",
      "actors": [
         "Roddy McDowall",
         "Kim Hunter",
         "Bradford Dillman",
         "Natalie Trundy",
         "Eric Braeden",
         "William Windom",
         "Sal Mineo",
         "Albert Salmi",
         "Jason Evers",
         "John Randolph",
         "M. Emmet Walsh",
         "Ricardo Montalban",
         "Arthur Tovey"
      ],
      "imdbMovieId": "0067065",
      "originalTitle": "Escape from the Planet of the Apes",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["t4OQqg-oL2M"],
      "plotSummary": "The world is shocked by the appearance of two talking chimpanzees, who arrived mysteriously in a U.S. spacecraft. They become the toast of society; but one man believes them to be a threat to the human race.",
      "tmdbMovieId": 1687,
      "avgRating": 3.03098,
      "releaseYear": "1971",
      "numRatings": 4083,
      "posterPath": "/yOnN43HdxvV5h5U4qsGIfeUL0Zv.jpg"
   }
}