{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "capsized ship",
         "id": 155530
      }],
      "imdb_id": "tt0078856",
      "video": false,
      "title": "Beyond the Poseidon Adventure",
      "recommendations": [
         11123,
         29723,
         1608,
         26114,
         7227,
         17276,
         40160,
         26327,
         66775,
         24571,
         30347,
         69787,
         48747,
         22555,
         31047,
         33055,
         42661,
         59238,
         22937,
         32029
      ],
      "backdrop_path": "/ufWflfOKIk1KbMrXXVrV7ZJLbVC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Captain Mike Turner",
               "gender": 2,
               "credit_id": "52fe44919251416c91015487",
               "name": "Michael Caine",
               "profile_path": "/vvj0JMSFpOajXCE46Hy4dyqSP2U.jpg",
               "id": 3895,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Celeste Whitman",
               "gender": 1,
               "credit_id": "52fe44919251416c9101548b",
               "name": "Sally Field",
               "profile_path": "/ymhpsxujOO3a9qaGYSpkenCt9Le.jpg",
               "id": 35,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Captain Stefan Svevo",
               "gender": 2,
               "credit_id": "52fe44919251416c9101548f",
               "name": "Telly Savalas",
               "profile_path": "/pN5jiLdHKzDXn8GZHPnJHwdax1H.jpg",
               "id": 10169,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frank Mazzetti",
               "gender": 2,
               "credit_id": "52fe44919251416c91015493",
               "name": "Peter Boyle",
               "profile_path": "/hAZw6rJlAemlqND09Km7qGvpZ6D.jpg",
               "id": 1039,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Harold Meredith",
               "gender": 2,
               "credit_id": "52fe44919251416c91015497",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Hannah Meredith",
               "gender": 1,
               "credit_id": "52fe44919251416c9101549b",
               "name": "Shirley Knight",
               "profile_path": "/ehtTPcvqq91Dxl7mtlzi0xJI6KP.jpg",
               "id": 28778,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Nurse Gina Rowe",
               "gender": 1,
               "credit_id": "52fe44919251416c9101549f",
               "name": "Shirley Jones",
               "profile_path": "/jZbS3ej52FOUCBSJCQKQS0MtD87.jpg",
               "id": 60158,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Wilbur Hubbard",
               "gender": 2,
               "credit_id": "52fe44919251416c910154a3",
               "name": "Karl Malden",
               "profile_path": "/mszc66eJmCKzOD2vwl8qJrVSz1W.jpg",
               "id": 9857,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Tex",
               "gender": 2,
               "credit_id": "52fe44919251416c910154a7",
               "name": "Slim Pickens",
               "profile_path": "/pNIO3A9WmjyjVSIJ7jALoXGzpQJ.jpg",
               "id": 14253,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Suzanne Constantine",
               "gender": 1,
               "credit_id": "52fe44919251416c910154ab",
               "name": "Veronica Hamel",
               "profile_path": "/o7WAjL9p3hh1taGzGFoSHNv30oW.jpg",
               "id": 42176,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Theresa Mazzetti",
               "gender": 1,
               "credit_id": "52fe44919251416c910154af",
               "name": "Angela Cartwright",
               "profile_path": "/f6w7mkJuAQ5o9aq6Du2iQYKhgN4.jpg",
               "id": 121640,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Larry Simpson",
               "gender": 2,
               "credit_id": "52fe44919251416c910154b3",
               "name": "Mark Harmon",
               "profile_path": "/vzthrZ2QidVi1iMMOYFzAohhVpj.jpg",
               "id": 19728,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Kurt",
               "gender": 2,
               "credit_id": "52fe44919251416c910154b7",
               "name": "Paul Picerni",
               "profile_path": "/gKafN24wJ5zfdmxhud0fe9GVcTI.jpg",
               "id": 78309,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Doyle",
               "gender": 2,
               "credit_id": "52fe44919251416c910154bb",
               "name": "Patrick Culliton",
               "profile_path": null,
               "id": 146897,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Castorp",
               "gender": 0,
               "credit_id": "52fe44919251416c910154bf",
               "name": "Dean Raphael Ferrandini",
               "profile_path": null,
               "id": 136514,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44919251416c910154c5",
               "name": "Irwin Allen",
               "profile_path": "/asiQpPmMcbKt92AyNxSmEZD3HF9.jpg",
               "id": 7506,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c910154cb",
               "name": "Nelson Gidding",
               "profile_path": null,
               "id": 19459,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c910154d1",
               "name": "Paul Gallico",
               "profile_path": null,
               "id": 6855,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44919251416c910154d7",
               "name": "Irwin Allen",
               "profile_path": "/asiQpPmMcbKt92AyNxSmEZD3HF9.jpg",
               "id": 7506,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44919251416c910154dd",
               "name": "Joseph F. Biroc",
               "profile_path": null,
               "id": 14431,
               "department": "Camera",
               "job": "Camera Department Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.418363,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31638,
      "vote_count": 32,
      "budget": 0,
      "overview": "After \"The Poseidon Adventure\", in which the ship got flipped over by a tidal wave, the ship drifts bottom-up in the sea. While the passengers are still on board waiting to be rescued, two rivaling salvage parties enter the ship on search for money, gold and a small amount of plutonium.",
      "similar": [
         503,
         551,
         178,
         28512
      ],
      "original_title": "Beyond the Poseidon Adventure",
      "runtime": 114,
      "poster_path": "/tzqtaIk0OuO47eUV2d6xO8kGmm8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1979-05-18",
      "vote_average": 5.2,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "The Poseidon Adventure Collection",
         "id": 372257,
         "poster_path": null
      },
      "tagline": "Before her fate is sealed by the deep, the superliner Poseidon will reveal one last secret.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Irwin Allen"],
      "runtime": 114,
      "synopsis": "The film continues the story from the original movie's conclusion. The Poseidon is still afloat, and the six survivors of Reverend Scott's team have been rescued. After sailing through rough seas, a tugboat captain, Mike Turner (Michael Caine), discovers the capsized wreck of the ship. Accompanied by second mate Wilbur (Karl Malden) and passenger Celeste Whitman (Sally Field), he heads out to claim salvage rights on it, as the tugboat 'S.S. Jenny' lost her cargo in the same storm that capsized it. They are soon followed by Dr. Stefan Svevo (Telly Savalas) and his crew; Kurt (Paul Picerni), Doyle (Patrick Culliton), and Castrop (Dean Raphael Ferrandini) who claim to be Greek Orthodox medics who received the ship's SOS. The seven of them board the doomed vessel and soon become trapped after the corridor entrance to the cut-out hole collapses. The group with Turner also encounters more survivors; the ship's nurse, Gina Rowe (Shirley Jones), a wealthy passenger named Suzanne Constantine (Veronica Hamel), and war veteran Frank Mezzetti (Peter Boyle) who is searching for his missing teenage daughter Theresa (Angela Cartwright), which they soon find along with the elevator operator Larry Simpson (Mark Harmon) and as well as a brash \"billionaire\" named \"Tex\" (Slim Pickens). Later they find two more surviving passengers; the blind retiree Harold Meredith (Jack Warden) and his wife Hannah (Shirley Knight), who were waiting for rescue. Water continues to submerge more decks and more explosions occur. Turner and his group find the purser's office, where Svevo decides that he and his men will continue their search for other survivors. Turner agrees and Svevo and his men leave in another direction. Another explosion causes the safe in the purser's office to fall through the floor and open, revealing gold coins (each one worth 100 times its weight in gold) as well as cash and diamonds. Turner and Wilbur excitedly gather it and start looking for another way out of the ship. Unknown to Turner and the survivors, Suzanne was actually working with Svevo and sneaked a list containing information about a cargo of crates from the purser's office. She gives it to Svevo, but decides that she doesn't want to go through with his plan anymore. Svevo apologizes and orders Doyle to kill Suzanne. He shoots her, but she strikes him with an axe before she dies. After climbing up a few decks, Turner and his group find Svevo and his men gathering a cargo of plutonium. Svevo reveals that his real intention of boarding the Poseidon was to retrieve his lost shipment of plutonium to sell on the black market, adding that he can't let Turner and his group go now. However, before they can kill Turner and his group, another explosion occurs, allowing them to escape through another cargo room full of cars, where Frank and another one of Svevo's men is killed during the shootout. Water floods the deck as Turner's group proceed to up to the next deck through a flooding elevator shaft, but Hannah falls into the rising water and drowns, while Turner loses his salvaged diamonds. Svevo and his one remaining henchman head back up to the ship's stern and make it out, where the rest of Svevo's team aboard his salvage boat cut another hole in the Poseidon's hull and attempt raise the plutonium crates from the cargo hold using a crane up to the hull of the ship, which is still above water but is slowly sinking. In another section of the ship, Turner and the survivors exit the ship through an underwater side door, but due to shortage of scuba tanks, Wilbur (unknown to Turner and his group) sacrifices himself by swimming underwater and disappearing. Turner and Celeste swim to the tugboat Jenny and move it closer to the Poseidon as the remaining survivors swim towards it. Svevo's men see them and open fire and kill Tex, who willingly holds onto a bottle of champagne as he goes down. Turner's group makes it to his boat and they sail away. Water continues to flood the Poseidon and cause the on-board boilers to explode, which causes the cargo of plutonium to also do so. The Poseidon completely explodes, killing Svevo and his men. On board Turner's boat, Turner accepts that his tugboat S.S. Jenny will be taken from him when they get to port, but Celeste reveals a diamond that she salvaged from the Poseidon. Celeste asks Turner, \"Are you going to kiss me now?\" and Turner replies, \"I was going to kiss you anyway.\" They kiss and the tugboat Jenny sails away into the sunset with the survivors Gina, Theresa, Larry, and Harold.",
      "writers": [
         "Paul Gallico",
         "Nelson Gidding"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0078856/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4ODA4OTIyM15BMl5BanBnXkFtZTcwOTA5NTUzMQ@@._V1_SY317_CR22,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Caine, Sally Field, Telly Savalas | See full cast and crew »"],
      "reviews": [
         "A lot of people don't like this picture, but, I think it works. It is helmed by a strong cast of principle performers and carried off by a unique twist on the sequel impetus. The idea is fairly original, as opposed to the usual: for this story, one would normally expect they'd just focus on another group of survivors and how they get out. Instead of dealing with people wanting to get out, the plot is spurred on by people wanting to get IN. Then, ironically, they become trapped and become the people who have to get out, along with some of those aforementioned survivors to keep with tradition. I also have to give the film credit for that little bits of continuity, like Linda's body is still lying near the entrance of the ship the crew uses, the same hole the original movie's survivors escaped from. In the end, the movie isn't as bad as it is often called.",
         "Since the original Poseidon Adventure raked in so much dough, Irwin Allen wanted to get a sequel off the ground right away. It would eventually take him 7 years to get it made and in that space of time it would go through many changes. To begin with, Beyond the Poseidon Adventure was to star Borgnine, Buttons and the rest of the survivors. After being rescued by the French Coast Guard they were to be transported to safety by train through the French Alps. A tunnel cave-in was to trap them all over again amid other, more sinister, drama. That idea was soon squashed. Hackman didn't want to return (as Reverend Scott's brother!) and even though poster art was created (you can still find the train/gun image out there), that's about as far as production got. Allen focused on making other movies for the time being. Then, in 1978 he asked Paul Gallico to write a sequel. Gallico obliged but died before Beyond was published. His novel had Rogo, Martin and Manny Rosen being forced at gunpoint to return to the ship to plunder its secret cargo. Bandits, pirates, double-crosses and macabre plot developments followed. Unable to convince Borgnine and the others to return at this point, Allen changed the story to accommodate a bunch of new characters. This Mike Rogo became Mike Turner (Michael Caine) and Bandits and Pirates became Stefan Svevo (Television Savalas) and his group of terrorists. Beginning just before the storm in which the Poseidon capsized, Turner and his crew (Sally Field and Karl Malden) are out in Jenny the Tugboat. Turner loses his cargo and worries about the bank taking his precious boat away. New Years Day arrives and the sea is calm once again. Turner sees the French Coast Guard chopper buzzing overhead and figures there must be something interesting over the horizon. Interesting indeed. An abandoned 5-star, world-class super-liner designed to carry hundreds of wealthy passengers. There's sure to be riches to plunder and a quick trip down to the Purser's Office (the idiot who chose to die in the first) might save Jenny from the banks greedy hands. 'Doctor' Stefan Svevo (trying saying that while drunk) and his group of suspicious men dressed in impeccably white clothes follow Turner inside, hoping to save some remaining survivors. Yeah right! Svevo just happens to be after a secret cargo of guns and plutonium and has an agent still stuck on-board. Turner and his crew find the Purser's safe quite easy and load up on the loot. But they also find a bunch of stranded passengers including a very young-looking Peter Boyle, Slim Pickens, Mark Harmon and Jack Warden as a blind writer. His quick trip to pinch the riches turns into the much more noble task of leading the rest to safety. But once they discover Svevo's plot a fight breaks out. I think that BTPA has had an unfair amount of criticism. Until the 2006 DVD release the film suffered 27 years of pan and scan TV screenings and videos, which completely screws up the scope photography. Seeing the film in widescreen, as intended, gives it a much slicker look. But I wasn't too impressed with the set-decoration and lighting. The Poseidon was already trashed and unstable before the first survivors escaped. By now it should be seriously threatening to sink or explode and the sets should reflect how much stress the ship is under. But they do look too spotless and the lighting is too bright and un-atmospheric. And, just so you know, a ship of this size would have more than one kitchen. So moans about it 'already being flooded' are invalid. And I do think that the ending is kind of abrupt and rushed. It was a bit of a let-down having finish with such a lame, flippant finale. And, despite, previous criticisms, I do think that the characters are just as good as before. I felt sorry for Jack Warden when his wife died, or when Michael Caine realised that he lost the gold. Wilbur (Karl Malden) was a good character too and I think that his exit from the film was less than what he deserved. There is also more continuity with the original than the negative reviews proclaim. So don't let that put you off. It's had a bad reputation, but BTPA isn't as bad as pretentious movie zealots would have you think. If you are a fan of the original then it is at least worth a rental.",
         "Beyond the Poseidon Adventure is the follow -up to The Poseidon Adventure and I enjoyed watching this, despite reading bad reviews. Two rival parties board the upturned wreck of the Poseidon and rescue more people and also go looting after some gold and plutonium. They go their own ways and a motley collection of people are found including a blind man and his wife, the ship's nurse, a drunk and a father, daughter and her boyfriend. After several deaths, they manage to escape just before Poseidon explodes and sinks, taking with it the party who went for the plutonium. Although not as good as The Poseidon Adventure, this sequel isn't too bad with decent special effects. A good cast too: Michael Caine (Zulu, The Italian Job), Telly Savalas (Kojak), Karl Malden (The Streets Of San Francisco), Sally Field (Mrs Doubtfire), Anglea Cartwright (Lost In Space, reuniting her with director Irwin Allen), Peter Boyle and Slim Pickens. If you like 1970's disaster movies and Michael Caine like myself, I recommend this. Rating: 3 stars out of 5.",
         "This horrifyingly bad and automatically inferior sequel to \"The Poseidon Adventure\" came and went in theaters so quickly that one could be forgiven for not even realizing that it ever existed! The real victim here was Paul Gallico, the author of the original story. When \"PA\" was made into a film, the writers changed several things around (as often happens). When plans of a sequel came about, Gallico wrote the sequel to the novel based NOT on his own great little book, but on the FILM's storyline. Then the filmmakers discarded his novel \"Beyond the Poseidon Adventure\" and went with the version found here. So he adjusted his characters and story to fit Hollywood's version, only to have it abandoned in favor of this rehash. In it, two disparate groups join up to either salvage loot from the overturned vessel or rescue any leftover survivors. Instantly they are trapped as the boat belches and rocks continuously, yet they stay inside to find salvage, linger over conversations with newly discovered passengers and finally run around shooting at each other! The inexplicable cleanliness of the sets and utter illogic of the storyline pale in comparison to the hilariously bad dialogue and the banal music score. Previous, greater disaster movies had majestic scores done by excellent composers. This music has no memorable opening theme and features inappropriate and discordant music during scenes (often a whimsical \"Flight of the Bumblebee\" type of thing is heard.) Some of the dialogue has to be heard to be believed. One classic scene is when Knight dislocates her shoulder after grappling to save her blind husband Warden. Award-magnet Knight does a terrific job of displaying her injury and is carried over to a corner and revived realistically with smelling salts. Then purportedly-kind nurse Jones reveals an utter lack of bedside manner. Does she resort to the standard \"You'll only feel a slight prick\" or \"This won't hurt a bit\"??? Nooooo She grabs Ms. Knight's arm and goes, \"This is going to hurt a great deal Mrs. Meredith, I'm so sorry!\" Apparently, the violence of this scene was so intense that it had to be filmed through debris (fully obscuring Jones' face!) so as not to shock the audience! The characters are unwaveringly pathetic and annoying (and in many cases, just thinly disguised versions of folks from the original film.) Boyle is mercilessly loud and obnoxious, taking Ernest Borgnine's \"type\" to a new level of irritation. Cartwright is a little old to be playing the little girl sort of role that Pamela Sue Martin already did. Her costume makes her look like a frump. Pickens is hilarious, drawling out lines like, \"Who's Svevo? As a matter of fact, who's Suzanne?\" in a thick Texas accent. Jones' character is a drippy nurse and has to dredge up her own long-ago award just like Shelley Winters' swimming medal, to no good effect. Warden and Malden vie for audience sympathy with their afflictions, but don't get any. Field rubs immediate tarnish on her Oscar for \"Norma Rae\" with her over-the-top, \"Three's Company\" - level comedic attempts and Caine should have known better, but this was his period of making bomb after bomb. Still, it's fun on a camp level to watch once and future Oscar-winners slumming badly. Hamel, for the brief time she is on screen, is both alluring and amusing. Sadly, this and \"When Time Ran Out\" would slam the lid on any hopes of a film career, but she rebounded on television. Knight adds some much needed class, desperately trying to underact and say her lines with dignity amidst all the squalid overacting and preposterous situations. She is done no favors for this. Sadly, the old VHS and now the newly released DVD shear 8 minutes off the film's running time, cutting a lot of Warden, Knight and Jones' scenes, even removing the fact that Warden and Knight are authors! These were sentimental moments between all three and must have been spliced out in order to keep the action, such as it is, moving. It's a pointless, grave-robbing hack job intended to wring more money out of the classic original, but which sank like a stone at the box office. At least now it can be enjoyed for the audacious mess that it is!",
         "This film ranks up there with Psycho II as being one of the greatest sequel ever made! Irwin Allen returns to the setting of his first major picture to create one of his last. Irwin Allen ignored all the aspects of the novel that was written for him, and comes up with a storyline that far surpasses the novel. Watching an all-American film from a British Citizen's point of view is always exiting, normally i would laugh at a character like Tex but in this, it works surprisingly well! Micheal Caine is an inspired choice as a salvage captain. I was a bit unsure of Sally Field's character at first but as the film went on her character added so mush to the story. Telly Savalas, what can i say? This man is a legend! Ever since i first saw him as Blofeld in On Her Majesty's Secret Service he was the ultimate villain and in this he doesn't disappoint. A lot of the supporting cast are quite memorable too..Slim Pickens as Tex, Peter Boyle who i did get a bit bored of all we seemed to hear was \"where's my daughter?\" which got a bit annoying after a while. This film does have it's faults, why is still afloat with a hole in the bottom, and most of all WHY THE HELL DOES THE DAMN BOAT EXPLODE AT THE END?? Overall Fantastic effort, no way would this ever surpass the original but it's racing in at its heels.",
         "How many movies get the chance of being made by the extraordinary,proficient,astonishing Allen and/or having Caine,Mrs. Field,Savallas,Shirley Jones in the cast? Caine's role,in itself,is a jewel;he just fits in.He is energetic, lucid,sharp, intelligent,manly,as fit as a fiddle.Caine knows how to make a super-action flick,without needing to be Willis or Ford.He should be very proud of his role in \"Beyond ...\".For me,this is one of the most cherished Caine shows.(Caine is himself a cinema,he did an incredible number of good flicks.)Mrs. Field is enchanting,natural, inventive, fresh, luminous, spontaneous,funny,resourceful.(How do I miss an actress like her when I see that imbecile girls in so many cheap-looking shows!With few exceptions,such as Miss Rachel Luttrell,Miss Torri Higginson,or Mrs. Blalock,did you notice how many imbecile-looking girls crowd to fill the sets of the shows?) The action does not stagnate for a moment. Savallas got his bigger/better roles elsewhere;but the villain he does here is,as such,memorable and a landmark for the genre.He coins a comic strip villain.(I mean,Nero in Die Hard 2 ,Alan Rickman in Die Hard ,are zero compared to Savallas in \"Beyond ...\".) The colors of this movie are delightful. And how many shows offer so much fun?For me,only the first two episodes of Stargate Atlantis (Rising (Part 1)&Rising (Part 2)). Many people,who commented \"Beyond ...\",have expressed a lot of reserves and reticence,about various things;I think they were unjust,and way too exacting. Between 56 and 64 years,Allen made (i.e,directed and/or produced) several disaster movies:the diptych The Poseidon Adventure ,1972,and The Towering Inferno ,1974\u0097for the movie theaters;then, another diptych\u0097for TV this time: Flood! ,1976,and Fire! ,1977;then a trilogy,for the big screen again: The Swarm ,1978, Beyond the Poseidon Adventure ,1979, When Time Ran Out... ,1980\u0097an activity that was ambitious and often successful.In '80,Allen was 64 years old.In his disaster movies that he made during the '70s,Allen uses the entire palette of the genre.His main merit is,of course,that of creating a very pure form of adventure movies.During '72-'80, The Master of Disaster also found time for some important TV work.So,he was for disaster,he was for Sci-Fi,sometimes he was for both of them\u0097and always for fancy,adventure and fun. Fortunately ,he had the opportunity to develop fully his thoughts and to express himself plenary. Some fans complain that The Master of Disaster's work was uneven,unequal;anyway,his best films are matchless in their genre.The man made at least 9 remarkable feature movies (of which some 6 are very good\u0097the 5 feature films made between '72 and '80,and also Five Weeks in a Balloon ,1962;but the movies from '59-'61 are worth watching as well \u0085),several interesting TV movies (in the '70s and '80s),and also several TV series and/or miniseries.I do not know any other director to be able of such a continuity in a couple of genres (the disaster/adventures,and Sci-Fi).",
         "Wow. I must be the only person who loves this movie. Maybe it is the context. I saw both the original Poseiden Adventure and Beyond Poseiden when I was a kid in the 70s. They were on TV so I was maybe 7...9? Anyway, perhaps the people who do not like Beyond Poseiden took the first movie too seriously. Illogical plot? Well.... Inconsistent with the first movie? Well why do a preacher and a retired cop know more about there being no more survivors than the salvage guy who comes by a few hours later? I just figured the conclusions the first gang came up to were just wrong. Meanwhile Beyond Poseiden has just as many, if not more stars, shows us more cool areas of the ship, and is more adventurous!",
         "While there was so much that is awful about this, I did still enjoy it. The Poseidon Adventure was one of the best films ever made, but you're better off, watching this never having seen it, as much of the original plot is ignored here, like certain areas that flooded are now clear. Why did the original escapees not stumble across anyone at all in the final third while escaping? Granted, almost every character is annoying at some (most) parts and also incredibly cliched, with every tipe of person being portrayed. Why can't people in these situations ever just all get on with each other? The idea of a sequel could've been excellent. You can't help but wonder what happens after people escape these disasters and the concept of a boat stumbling across the ship & salvaging what they can is not an unrealistic one, so this could have been better. It was ruined for me by having 'guns' as any part of the plot at all. It's ridiculous really to have escaped a sinking liner only to be shot by a villain moments from safety. By all means have 2 groups competing over the salvage, but shooting each other? Telly Savalas escaped a little too easily for me too. Otherwise, still enjoyable, if you don't get too involved in the characters. A low 6/10",
         "Every Single Cast Member Is Outstanding. How often can one say that about a Disaster movie, or any movie? The original Poseidon Adventure and Beyond/Poseidon are both four star movies that both just miss out on being five star movies because of one little problem. The original pushed The Church too much and Beyond/Poseidon has a feeling of being just a bit pointless. I have watched the 1979 film about 25 times on video. The way the characters/actors react to each other and the very memorable lines they come out with are all wonderful. Sally Field brings incredible humour to simple every day terms like, \"Oh brother\", or \"are you going to kiss me now?\", and despite her public comments on how much she hated the movie and disliked Irwin Allen, this stands out as the best of Sally Field, to me. Michael Caine recently said on a British talk show that, \"Irwin Allen's The Swarm was the worst movie I have done\". So I guess Beyond/Poseidon is not too high on his list. I don't care. The way his character takes command of this disaster movie and his encounters with Telly Savalas (this was also my favourite Savalas show) and Sally Field are nothing short of great entertainment. You can tell that Irwin Allen directed this film, why? The endless explosions. Since the 1965-1966 TV season of Voyage to the Bottom of the Sea, Irwin has made it clear to his staff that explosions are needed in his shows. The Poseidon explosions, both inside and outside the ship, look great on film, as always. When Irwin told the media about this film he said \"it is time to go back to the sea\", maybe this film was another Voyage/Sea to Irwin? I could do another 20 quotes from the other players. This movie had an okay musical score which picked up as the end credits started. Those end credits were important to me. After this movie, Irwin Allen produced some very average television, but this was the last great Irwin Allen feature film (When Time Ran Out was average), so that closing music was almost saying Goodbye to Irwin. Irwin left this world in 1991 but his work lives on.",
         "All the other opinions are correct on this one. I still have 'Beyond the P.A.' on tape, too! I can't believe someone else noticed the ludicrous music. 'Beyond' suffered from Shelly Winters sacrifice in the first one. Shirley Knight, Karl Malden, Peter Boyle all had to die heroically, so to speak, but I still don't know what Malden did to die. He just...swam away? shirley Knight stood as the one true bright spot, doing the best she could with what she had. She is probably the one seen least of all as well, as she died first. I have always considered Caine in this one and his work in 'Swarm' and 'Jaws 4' to be the Bermuda Triangle of his bad performances. His screaming at Veronica Hamel to remove her dress to make a dangerous jump is laughable, as was other attempts at over-seriousness, such as Shirley JOnes getting Jack Warden to want to live after Knight's death, Caine weeps over Ms. Knight (like Hackman did over Winters in the first one). You can bank on when Caine is onscreen, he will be unbearable. I especially liked the change from hotpants in the first movie to hip-huggers in the second. And Veronica Hamel taking the henchman out with the axe after she had been shot was cool also. Pity she didn't make it. We did laugh, however, at Slim Pickens line \"Who the devil is Suevo (Savalas' character)? For that matter, who the devil is Suzanne (Hamel)?\" Note of Interest, to anyone who does watch this: observe when Knight's arm is hurt trying to help the blind Jack Warden. Watch what the others are doing. Malden, Mark Harmon, they are playing with the cane? Later, when she drowns, watch everyone else go up the ladder ahead of the injured woman who must hold on with one hand and is in alot of pain. There is an explosion scene where we see everyone scramble like rats that I have always noticed, namely for the way once again, the women like Angela Cartwright and Shirley Knight must fend for themselves. Haven't watched it in a while."
      ],
      "genres": [
         "Action",
         "Adventure"
      ],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "After \"The Poseidon Adventure\", in which the ship got flipped over by a tidal wave, the ship drifts bottom-up in the sea. While the passengers are still on board waiting to be rescued, two rivaling salvage parties enter the ship on search for money, gold and a small amount of plutonium.",
         "Adventurers return to the overturned ship, seeking a fortune."
      ],
      "budget": 0
   },
   "movielensId": 2537,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-05-18",
      "dvdReleaseDate": "2006-08-22",
      "directors": ["Irwin Allen"],
      "runtime": 114,
      "movieId": 2537,
      "title": "Beyond the Poseidon Adventure",
      "mpaa": "",
      "actors": [
         "Michael Caine",
         "Sally Field",
         "Telly Savalas",
         "Peter Boyle",
         "Jack Warden",
         "Shirley Knight",
         "Shirley Jones",
         "Karl Malden",
         "Slim Pickens",
         "Veronica Hamel",
         "Angela Cartwright",
         "Mark Harmon",
         "Paul Picerni",
         "Patrick Culliton",
         "Dean Raphael Ferrandini"
      ],
      "imdbMovieId": "0078856",
      "originalTitle": "Beyond the Poseidon Adventure",
      "genres": [
         "Action",
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["ELYBQJyGzHk"],
      "plotSummary": "After \"The Poseidon Adventure\", in which the ship got flipped over by a tidal wave, the ship drifts bottom-up in the sea. While the passengers are still on board waiting to be rescued, two rivaling salvage parties enter the ship on search for money, gold and a small amount of plutonium.",
      "tmdbMovieId": 31638,
      "avgRating": 2.01307,
      "releaseYear": "1979",
      "numRatings": 306,
      "posterPath": "/tzqtaIk0OuO47eUV2d6xO8kGmm8.jpg"
   }
}