{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "revolution",
            "id": 2020
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "president",
            "id": 8570
         },
         {
            "name": "history",
            "id": 9682
         }
      ],
      "imdb_id": "tt0113463",
      "video": false,
      "title": "Jefferson in Paris",
      "recommendations": [
         90949,
         41661,
         17128,
         40258,
         17099,
         27328,
         67822,
         71825,
         21666,
         122930
      ],
      "backdrop_path": "/upTcAufKRa8cgB8m3uyU5z6Qczc.jpg",
      "revenue": 2474000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Thomas Jefferson",
               "gender": 2,
               "credit_id": "52fe49d49251416c910ba1f9",
               "name": "Nick Nolte",
               "profile_path": "/o6O7WP3vokKstxJFMiiyRMNyPsH.jpg",
               "id": 1733,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Maria Cosway",
               "gender": 1,
               "credit_id": "52fe49d49251416c910ba201",
               "name": "Greta Scacchi",
               "profile_path": "/uHPHNwBnhBIs1z2sJcKQODtaY2n.jpg",
               "id": 21245,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sally Hemings",
               "gender": 1,
               "credit_id": "545575990e0a263863002fe4",
               "name": "Thandie Newton",
               "profile_path": "/sW6XsnM2DkX6ujOXZ38aIQAMIWi.jpg",
               "id": 9030,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Patsy Jefferson",
               "gender": 1,
               "credit_id": "52fe49d49251416c910ba1fd",
               "name": "Gwyneth Paltrow",
               "profile_path": "/8x3jpWD7DEvyMXO1FOjwNdd1UZT.jpg",
               "id": 12052,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "D'Hancarville",
               "gender": 2,
               "credit_id": "545576190e0a2648cf0055c8",
               "name": "Jean-Pierre Aumont",
               "profile_path": "/zmH3P6Wr5hkiRo8Rx060nhvAEdX.jpg",
               "id": 18766,
               "order": 4
            },
            {
               "cast_id": 20,
               "character": "Richard Cosway",
               "gender": 2,
               "credit_id": "545576980e0a2635de002ef2",
               "name": "Simon Callow",
               "profile_path": "/pOABmGHa7h1CQ1oG4Q6PyuCbwqL.jpg",
               "id": 4001,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "James Hemings",
               "gender": 2,
               "credit_id": "5455768c0e0a2648d60053b7",
               "name": "Seth Gilliam",
               "profile_path": "/5XL7Nuzt58wXijlFbDJKDWYoLFQ.jpg",
               "id": 41688,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Madison Hemings",
               "gender": 2,
               "credit_id": "545576750e0a2648c5005687",
               "name": "James Earl Jones",
               "profile_path": "/2ZuBf3ip2RXhkiQqGUjbUzAf4Nx.jpg",
               "id": 15152,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Louis XVI",
               "gender": 2,
               "credit_id": "5455766fc3a368146f00515c",
               "name": "Michael Lonsdale",
               "profile_path": "/pEF7YiXY9yMKUVX5n2Ly7OYH5Op.jpg",
               "id": 2369,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Madame Abbesse",
               "gender": 1,
               "credit_id": "54557651c3a368148d00547f",
               "name": "Nancy Marchand",
               "profile_path": "/d9DASq3XmUsyfzSrATbAAOY7yn1.jpg",
               "id": 12957,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Marie Antoinette",
               "gender": 1,
               "credit_id": "5455762f0e0a2648cb005436",
               "name": "Charlotte de Turckheim",
               "profile_path": "/he3y0MpYNo6RRjylYfTlUGzSVgg.jpg",
               "id": 258942,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Marquis de Lafayette",
               "gender": 2,
               "credit_id": "54557626c3a368148d005477",
               "name": "Lambert Wilson",
               "profile_path": "/jFkr2kuFfpzS1plfOlNJ6kURV6O.jpg",
               "id": 2192,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Camille Desmoulins",
               "gender": 2,
               "credit_id": "593197389251417064000894",
               "name": "Vincent Cassel",
               "profile_path": "/yTTyX7xziiMibm0nzcH5z6xxLLv.jpg",
               "id": 1925,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Dr. Guillotin",
               "gender": 0,
               "credit_id": "597e06ba9251415d8d0199d3",
               "name": "Steve Kalfa",
               "profile_path": "/znsiuNnb2jxdWEYBRhSE66W0JJ1.jpg",
               "id": 70166,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49d49251416c910ba1f5",
               "name": "James Ivory",
               "profile_path": "/vj4PY2KciRCZWzT4eCdOoQfzoJs.jpg",
               "id": 54441,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54557733c3a368147c005324",
               "name": "Ismail Merchant",
               "profile_path": null,
               "id": 54448,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "5455773dc3a3680b76000b06",
               "name": "Ruth Prawer Jhabvala",
               "profile_path": null,
               "id": 54443,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "56e4aebbc3a3685aa80045d7",
               "name": "Donald Rosenfeld",
               "profile_path": null,
               "id": 1043954,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.348066,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 87729,
      "vote_count": 13,
      "budget": 14000000,
      "overview": "His wife having recently died, Thomas Jefferson accepts the post of United States ambassador to pre-revolutionary France, though he finds it difficult to adjust to life in a country where the aristocracy subjugates an increasingly restless peasantry. In Paris, he becomes smitten with cultured artist Maria Cosway, but, when his daughter visits from Virginia accompanied by her attractive slave, Sally Hemings, Jefferson's attentions are diverted.",
      "similar": [
         462,
         640,
         769,
         5915,
         11202,
         45317,
         68734,
         371638,
         324786,
         363676,
         389015,
         396371,
         407445,
         318846,
         446354,
         323677,
         228970,
         274479,
         152532,
         300671
      ],
      "original_title": "Jefferson in Paris",
      "runtime": 139,
      "poster_path": "/qKr3Mgo1HB3HkGTAVoVEpOSWlp2.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Merchant Ivory Productions",
            "id": 2370,
            "origin_country": ""
         },
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         }
      ],
      "release_date": "1995-03-31",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "A powerful man torn between his love for one woman and his secret desire for another.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James Ivory"],
      "runtime": 139,
      "synopsis": "An understated chronicle of events with a brilliant cast. American actor Nick Nolte portrays Thomas Jefferson during the five year period from 1784 to 1789 when Jefferson served as a diplomat stationed in Paris. In 1785, Thomas Jefferson became the United States Minister to France, at the dawn of the French Revolution. The story begins decades later in the Midwestern United States where a journalist has traveled considerable distance to interview Jefferson's wayward son Madison Hemings (James Earl Jones). Hemings reveals many details, primarily that Jefferson died bankrupt. His mother Sally and his uncle James were actually the half siblings of Jefferson's late spouse Martha. Although not depicted in film, Jefferson's father-in-law John Wales was a Virginia slave trader, attorney and statesman. Wales had bequeathed his estate and his slaves to Jefferson upon his death in 1773. Also not depicted, Martha and Thomas Jefferson had six children of which only two daughters survived to adulthood. Jefferson arrives in Paris with his eldest surviving daughter, Martha \"Patsy\" Jefferson (Gwyneth Paltrow) and enrolls her into the care of an academy for girls. The academy is part of the Catholic Church and as a Protestant, Jefferson's daughter Patsy is regarded among other Non-Catholic girls to remain of her own beliefs and free will. Jefferson's presence in Europe finds him representing the United States with an insolvent Congress and significant debt to the French military for their support and alliance during the American Revolution. He is introduced in time to many dignitaries including the adversarial Ambassador to Britain (Anthony Valentine), and the Monarchs of France, King Louis XVI (Michael Lonsdale) and Queen Marie Antoinette (Charlotte de Turckheim). Jefferson also appeals to Dutch bankers and requests substantial loans to keep the American Government viable. The costumes and pageantry of the French elite seem to be rather parody at times but the film supports the pivotal moments, of the one individual who achieved most of America's success in world history. This film would be superb viewing for high school and college students. A challenge of maturity to look beyond the prissy male aristocrats and search for the more important political victories and failures. The pageantry emphasizes stark contrast between the French elite and the common people. Most of the subjects of the French Empire are starving and frustrated peasants. The king and queen appear frequently at intervals, but appear to remain alive in France during Jefferson's tenure as a U.S. Ambassador. The common people also appear often while the French Revolution progressively gains momentum. James Hemings (Seth Gilliam) is an educated slave and manservant. He is assigned to work among scholar chefs in Jefferson's kitchen and home. His young French colleagues introduce him to distilled spirits which he rejects at first claiming to have no money, but is offered anyhow. As there are no slaves in France. James approaches Jefferson about being compensated and Jefferson agrees. James continues to indulge and soon has a reputation for spending all of his money. United States laws prohibit the education of slaves but James proves already to be highly learned. James follows his ears as his duties to and from the presence of Jefferson and other statesmen increase his knowledge that he is not a slave in France. Patsy becomes homesick and depressed like her father. She pleas for Jefferson to send for his younger daughter Polly. Patsy vows to care for Polly as would a sister and a mother. Polly (Estelle Eonnet) arrives in Paris with Jefferson's teenage slave and maidservant Sally Hemings (Thandy Newton). Nick Nolte performs a superb portrayal of Thomas Jefferson as a vibrant statesman and a passionate human being. He is attracted to and pursued by Maria Cosway (Greta Scacchi), the wife of nobleman Richard Cosway (Simon Callow). Jefferson's flights of fancy with Maria result in his sustaining injury (broken wrist) while horseback riding. Director James Ivory brings the audience intimately into Jefferson's dreams, nightmares and human nature. Jefferson is a widower battling with depression who's physical and emotional pain are dynamically illustrated in cinema. Sally's loyal servitude and tenderness build an undeniable love and affection between these two human beings. Time and circumstance arise up toward confrontation among all the women in Jefferson's complicated life. As a motion picture, \"Jefferson in Paris\" is a strong, meaningful and amazing visual experience. Many viewers of this film may jump to the obvious conclusions of slavery, polygamy and children born out of wedlock, particularly the multi-racial children of American slaves. But Thomas Jefferson confronts everything from family to politics with courage and charisma. Jefferson's stature is invincible. When he is confronted with Sally's pregnancy by her brother James, he calls in the presence of his eldest daughter Patsy to hold the Holy Bible while Jefferson swears a solemn oath to eventually emancipate James and Sally in due time, after they return to Virginia. The film ends with printed credits about Jefferson's political future and his controversial relationship with Sally Hemings. The remainder of this synopsis is not depicted in film but is important to consider... Jefferson returned to Virginia in 1789 with his two daughters: Patsy and Pollly; and his two slaves Sally and James. Immediately upon his return, President Washington wrote to him asking him to accept a seat in his Cabinet as Secretary of State. Jefferson accepted the appointment serving from 1790 - 1793. Jefferson ran for President in 1796. As the Democratic-Republican presidential candidate, Jefferson lost to John Adams, but had enough electoral votes to become Vice President (1797-1801). A new revolution in 1800, Thomas Jefferson and Arron Burr were elected in a tied number of electoral votes. In February of 1801, after thirty-six ballots, the House elected Jefferson President and Burr Vice President. Jefferson owed his election victory to the South's inflated number of Electors, which counted slaves under the three-fifths compromise. Jefferson was sworn in by Chief Justice John Marshall at the new Capitol in Washington DC. Unlike Washington, who arrived at his inauguration in a stagecoach drawn by six cream colored horses, Jefferson arrived alone on horseback without guard or escort. He was dressed in plain attire and, after dismounting, retired his own horse to the nearby stable. As president, Jefferson used his influence to bring Ohio into the Union in 1802, the first state under the Northwest Ordinance prohibiting slavery. In Congress, Jefferson had authored the Ordinance of 1787 in Congressional committee under the Articles of Confederation. He was therefore instrumental in prohibiting slavery not only to new territories, but in the new states to come beginning with Ohio. In 1803, Jefferson authorized the Louisiana Purchase, a major land acquisition from France that doubled the size of the United States. His diplomatic and missionary duties to the United States of America while serving five years in Europe created a catalyst that solidified the new world. President for two four year terms. Jefferson was a peaceful leader, but as Commander in Chief he responded swiftly against the Ottoman Empire. He refused to pay the high tributes demanded by the Barbary states while they were seizing American merchant ships and enslaving the crews for high ransoms. It was the first declared war the United States fought on foreign land and seas. The United States Marine Corps conquest on the shores of Tripoli were under the command of President Thomas Jefferson. Jefferson rose up to many challenges for which he struggled financially both in government and in person. Standing nearly 6 foot 3 inches, Jefferson was a big, tall and compelling man who's physical presence and academic genius made him a powerful and respected acquaintance, friend and ally in the enlightened free world. Biographer James Parton said Thomas Jefferson could \"calculate an eclipse, survey an estate, tie an artery, plan an edifice, try a cause, break a horse, dance a minuet, and play the violin (which he does repeatedly in this film).\" Actor Nick Nolte's cinematic image sustains well in everything ever wrote about Thomas Jefferson, the most incredible man of his time. Thomas Jefferson epitomized revolutionary ideals. The film \"Jefferson in Paris\" presents Thomas Jefferson as a very elegant yet simple man who's diplomacy and rhetoric, prevailed masterfully above and beyond his character imperfections. Thomas Jefferson was the most talented copywriter and calligrapher of his time... maybe of all time, considering his eloquently beautiful compositions. He was the principal author of The Declaration of Independence. One of the most amazing visualizations of the film \"Jefferson in Paris\" is his use of an ingenious linkage of hinged wood armatures, which accurately follows his writing on a second page, with a second pen and inkwell.",
      "writers": ["Ruth Prawer Jhabvala"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113463/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MjA3MDQ3Nl5BMl5BanBnXkFtZTcwNTkyNTUyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Nick Nolte, Greta Scacchi, Gwyneth Paltrow | See full cast and crew »"],
      "reviews": [
         "I wouldn't have been too surprised if Merchant and Ivory had attempted to suit up Anthony Hopkins as Thomas Jefferson or perhaps even fitted Hugh Grant with shoe lifts and an ersatz Viriginia accent for the role. Instead they went with Nick Nolte - who at first glance seems an almost equally unlikely choice. However the casting proved to be inspired for Nolte does a remarkable job of capturing Jefferson during his stint as U.S. ambassador to France on the the eve of the French Revolution. Nolte effectively projects Jefferson's pride, intelligence and intellectual curiosity............ and human frailties. Most of what I read and heard about this movie led me to believe that it was chiefly concerned with Jefferson's relationship with Sally Hemmings (Thandie Newton) - However, there are other threads running through that take up as much time and attention in this film. If there is a central theme here it seems to be an examination of some of the failures of Jefferson as a man of principle. Both Jefferson's public and private ideals are put to the test during his stay in Paris. And he, arguably fails on every count. However, somehow (at least for me) he remains a sympathetic character-even with his many faults. Early on in the film Jefferson is called to account by the liberal French aristocrats that he associates with regarding the failure of the American Revolution to address the issue of slavery. Jefferson admits that slavery is evil (he even tried to have an anti-slavery clause inserted in the Declaration of Independence) -but he has no answer when the Frenchmen assert that the American Revolution was \"incomplete\". The question of slavery also figures into Jefferson's rather ethereal romance with the wife of an English painter (Mrs Cosway played by Greta Scacci). When questioned about the matter he is only able to put her off by simply saying that it would be impossible for a foreigner to understand slavery as practiced in the American south. Gwyenth Paltrow gives perhaps the best performance in the film as Jefferson's troubled oldest daughter (Patsy). She sees her close relationship with her father threatened by both Mrs Cosway and then later by Sally Hemmings' appearance on the scene as the nursemaid to Jefferson's younger daughter. Jefferson puts Patsy into a convent but is later taken aback when she evidences an interest in converting to Catholcism. The Mother Superior (Nancy Marchand) of the convent taunts Jefferson, when he comes to retrieve his daughter. by pointing out that freedom of religion is an idea (after all) championed in the U.S. Constituion. The idea here, of course, is that Jefferson is being a hypocrite once again by denying his daughter her own choice in the matter. I must say though that the Mother Superior's jibes ring rather hollow to me in as much as an 18th century Catholic nun would not be my first choice to represent the voice of conscience regarding the promotion of human liberty. Thandie Newton may have the most difficult job here in so much as so little is known about Sally Hemmings (We do get a couple scenes of ineffective exposition in the guise of Sally's son (James Earl Jones) being interviewed seventy years later). Newton chooses to play the character very broadly and she comes across as quite believable in both reflecting the speech and manners of a 15 year old slave girl fresh off a Virginia Plantation (all the more remarkable since she is a 22 year old Englishwoman---her accent only fails her in one scene I think). The character of Sally Hemmings stands in sharp contrast to the almost painful sophistication exhibited by the French nobility that Jefferson associates with. I note that some posters on IMDb criticize Newton's portrayal as lacking depth and even sinking at points to the \"stepanfetchit\" level. I disagree. Newton- is showing us a confused girl-far from home--and certainly a girl at times who has her own agenda--however naive. It is obvious here that Merchant and Ivory are attempting to get us, at every point in the picture, to question the character of Jefferson--However,- the way the affair between he and Hemmings is handled speaks much to the limit of how far the film-makers were willing to go. The affair itself is still clouded by controversy but in almost all circumstances, a 50 year old man having an affair with a 15 year old girl must be considered, at least, culpable if not criminal. There really is no such thing as consensual sex between a slave and a master. Since nobody really knows the hows and whys of the affair, Merchant and Ivory had free license to present it in any light that they wanted---and they chose to make (unrealistically in my view) Sally Hemmings the sole initiator of the affair -- In fact, it's difficult to picture Nolte's Jefferson as initiating the affair--much less forcing it. I think that this version of events rather begs credulity. As usual, Merchant and Ivory, have produced a movie that has wonderful period details - the costumes and sets are at the very top of the line in every way. The building storm of the revolution is set as the backdrop to all that happens in the film. Mob scenes are inserted between views into the luxury and leisure of the French nobility in an effort to remind us that many of these extremely glib and well dressed people will be without heads in the near future. \"Jefferson in Paris\" offers a little something for everyone---History -Romance----class and race conflict----take your pick....It's a movie well worth watching.",
         "Although I have been interested in Jefferson for many years, I put off seeing this film for some reason, and only caught it recently on cable. I give it mixed reviews, generally favorable. Ivory/Merchant have again fashioned a lavish tableau, and the sets, costumes, props, etc. are first rate. The cast is solid. I was afraid Nolte would be a little too rough for my image of Jefferson, but that played out all right. What made this film interesting to me was certainly not whether it was accurate in a historical sense. How could it be--not nearly enough is known of that situation. The question is whether or not the film is plausible and \"honest within itself,\" i.e., whether we can accept the story as having something to tell us, if what is depicted is historically true or not. To me, the movie is about freedom, and the contradictions of freedom. Jefferson, freedom's advocate, is ensnared within the institution of slavery, and that ends up torpedoing any mature romance with Maria Cosway. Jefferson is also in his own life quite rigid, pulling his own daughter back from possible conversion to Roman Catholicism. His granting of freedom to James and Sally Hemmings has limitations. What bothered me some about the movie was its use of the backdrop of the coming French Revolution--by itself a commentary on the limitations of freedom. To the filmmakers it seems \"the Terror,\" two or three years in the future, is the definitive statement and stage of the revolution. The movie even seems soft on the ancienne regime, which over time killed a lot more people than the Terror. These muted investigations of freedom in the film move very slowly, but still hold interest--they are thoughtful, probing, and, to a degree, don't pass simplistic judgements on people. Cerebral film, but then Jefferson was a cerebral guy!",
         "We are invited here to see some of the more infrequently discussed aspects of the multifaceted Thos. Jefferson: architect, scientist, horticulturalist. Less of these perhaps than we might like, but more than we usually receive. Jefferson the scientist is mostly implied -- he witnesses one of the early Montgolfier ballooning experiments, for example. The primary focus is on the contentious matter of Jefferson's affairs of the heart. These include, most notably, a speculative miscegenetic one, but there is a second one, better documented, for contrast. Even if one suspects that the decision to direct attention here was primarily a commercial one, those portions of the film are well enough executed, while the creators, Prawer Jhabvala and Ivory, do provide us with a little seasoned food for the intellect, both here and elsewhere. \"Jefferson in Paris\" does contain a few speech anachronisms but otherwise seems to have found the flavour of the period. Altogether, not an exceptional film, but one which has much to recommend it.",
         "This is a screen account, directed by James Ivory, of a fascinating historical episode - Thomas Jefferson's period as US ambassador in Paris for the five years leading up to the 1789 revolution. Many Americans may be put off the film, because they do not accept its assumption that Jefferson was the father of children born to his young slave Sally Hemings. Non-Americans may be less interested in this arguable relationship than in the undoubted fact that Jefferson - a passionate believer in individual liberty and draftsman of the Declaration of Independence with its ringing references to equality and inalienable rights - was a slave-owner, and that he could justify his two-way stance (at least to himself). Jefferson also displays double-think when, though a fierce defender of religious liberty, he stops his pious, dutiful daughter Patsy (Martha) -an admirable portrayal by Gyneth Paltrow in a difficult role - from converting to Catholicism and joining a convent. Overall, Jefferson does not come out of the movie too well. In addition to revealing him as a child-molesting hypocrite, Ruth Jhabvala's scenario allows Nick Nolte to convey the tentative and observant side of Jefferson's character, but gives him scant opportunity to bring out the depth and breadth of Jefferson's mind or his political philosophy. In addition to the visual delights of costume and setting that we have learned to expect from Merchant-Ivory productions, the most successful aspect of the movie is the all-but love affair between Jefferson and witty, charming Maria Cosway - the wife of a foppish English artist (Simon Callow in full make-up) - a role in which Greta Scacchi lights up the screen. By contrast, Thandie Newton has been criticised for her awkward hamming as Sally, but it should be remembered that she is playing an uneducated 14 or 15 year old girl. Perhaps the movie's worst features are the \"framing\" sequences set in the late 19th century, where a Jefferson/Hemings descendent (James Earl Jones) relates his family history to a newspaper reporter. If these superfluous scenes had been cut, perhaps there would have been time to go deeper into Jefferson's politics, which after all is why the man is remembered today.",
         "So many of the negative comments seem to be reactions against either downplaying or overemphasizing Jefferson's relationship with Sally. It strikes me that this is a reasonably balanced presentation of what's been learned in recent years. Other negative critiques are the disappointments recorded by patriots expecting some grandiose pageant for Fourth of July consumption. But this is all-in-all a less pretentious and better film than the typical celebration of Americana. Nolte presents Jefferson as an idealistic but very human being. Paltrow is very persuasive as Patsy, and many of the rest of the cast present excellent (or well-proportioned) characterizations. Except for some trivial inaccuracies, this is a richly textured reconstruction of history as it may very well have occurred. I find that I look in on it just about every time it pops up on cable--and I'm always rewarded.",
         "I love this movie, because I am a complete sucker for movies set in the 18th century, and this is exceptionally well done. Nick Nolte is the most extremely unlikely choice to play Jefferson, but somehow he and the director make it work. The extensive selections from Jefferson's letters as he watches things unravel in France add a great deal to the entertainmnet value. Most people think that TJ signed the Constitution, when in fact he was US ambassador to France. From a costume point of view and in terms of certain vignettes, this movie does a marvelous job of debunking that notion. Now to the Sally Hemmings thing. DNA evidence does not lie, and it is now clear that he did indeed father her children. But I have a problem, and I'm not sure if there is any historical resolution to it. In the movie, she is a \"massah, how's you feelin' today\" type slave. I'm willing to accept that they fell mutually in love, but I'm still having a hard time dealing with her not having more class. It is a mistake to believe that slaves of relatively enlightened owners (yes, folks, I know what I'm saying) had no sophistication. Dumas Malone, the great biographer of Jefferson, would go into an apoplexy if you raised the possibility of this affair being real. Now that we know that it was, I might be his unworthy successor in suggesting that a man like Jefferson would not simply take a steppinfetchit slave girl to his bed, but would rather seek comfort in the arms of someone whom he could respect, however questionable the situation looks in a modern light.",
         "My interest in seeing this movie was to compare it with the recent CBS mini series, \"Sally Hemmings,\" which I recently saw and enjoyed. This movie was slow moving and not nearly as interesting as the mini series but it did provide some supplementary information about Jefferson that was not in the mini series. The movie, of course, was written from Jefferson's perspective while the mini series was written from the perspective of Sally Hemmings. The photography in the movie was wonderful as well as the acting. The last part of the movie, was by far the best.",
         "I have viewed this movie numerous times and find the story profound. The acting supersedes the actual script, but this is why I rate this movie so high. Thandie Newton as Sally Hemming is as good as portrayal as any I've seen. Her naivety, yet bountiful charisma lingers in your mind for days and even now I can see her frolicking, sweet character. As for Nick Nolte, he IS Thomas Jefferson: stern yet generous, political yet extremely intelligent. And, unlike other Gwyneth Paltrow roles, she CAN play vindictive and succeeds wonderfully. Her contempt for her father's relationship with Sally, her slave/maid, coupled with her religious beliefs only compliment the main plot line. Her angst over joining the nunnery or continuing on to care for her father, provides the overall story with some depth. This helps suggest a theme of moral temperament and uninhibited enlightenment over issues of race and religious convictions. Although the movie drags at times, the acting shines through as superb.",
         "I watched this movie last night. Unbelievably, Channel 4 (tv channel here in the UK) scheduled it at 2.15am - right in the middle of the night! Who on earth is likely to watch it at that time? I just hope some people decided to record it & watch it later. I think its a great film. I couldn't stop watching it. It gives you an insight into Thomas Jefferson and his personal life, and into the French society of the time. The film is also visually great. But, as with any movie, it has its flaws. My main criticism is that it was too much like an historical documentary. It didn't have the courage to speculate more about the relationship between Jefferson and Sally (the black slave girl). Jefferson must - in real life - have displayed more emotion with the slave girl than is depicted in this film, especially behind closed doors. Yet we don't see it. We see Jefferson being more affectionate with his daughter (Jefferson hugs her at one point in the film), than with Sally the slave girl, and yet he is supposed to have been passionately involved with Sally & fathered her children. Therefore it has a documentary feel to it, without any fictional element, which leaves the viewer somewhat detached & disconnected. But credit to the maker's for tackling the subject, and it's certainly made me interested in learning more about the man.",
         "\"Jefferson in Paris\" is a truly confounding film. It presents Thomas Jefferson (Nick Nolte) in the most unflattering light possible, painting him as a liar, racist and pedophile, yet offers not a shred of condemnation for those sins. This is the way he was, the film seems to say. End of sentence, end of movie, the door's behind you. After arriving in Paris with his daughter Patsy (Gwenyth Paltrow), Jefferson proceeds to win the heart of Maria Cosway (Greta Scacchi), the wife of a homosexual English painter (the criminally underused Simon Callow). A turn of events sends Maria to England, however, and Jefferson proceeds to forget her with astonishing speed for a man who, mere minutes of screen time before, was asking her to live with him in America. He's been bewitched, you see, by Sally Hemmings (Thandie Newton), one of his slaves just arrived from America. Just why he's bewitched is hard to tell--although Sally is undeniably beautiful, she acts like a simple-minded child in front of Jefferson. When she isn't telling ghost stories in exaggerated \"darky\" speech patterns, she's slinking around his bedroom, practically oozing lust for her distinguished massa. If her behavior is an attempt to excuse Jefferson's, it doesn't work. Jefferson damns himself further when Maria, tired of waiting for his letters, travels from England to see him. I've not changed toward you, he insists, offering weak excuses for not writing. To her credit, Maria sees through his brazen lies immediately. When Sally appears, and she and Jefferson flirt openly (and cruelly, to my mind) in Maria's very presence, the illusion falls apart completely. No one today believes that Jefferson, Washington and the rest were utter paragons of virtue and morality. Yet, are we supposed to believe that the learned, distinguished Jefferson would be attracted to Sally, a woman whose most intelligent conversation is about how \"massa's Frenchie friends don' unnastan' aw corn\" and who rubs herself against his front as she passes, right before Maria's eyes? Even if we let that slide, it's followed by the horrifying revelation that Sally was only 15 when this affair took place (Jefferson was 41). Strangely, this fact comes out only toward the very end, when Sally's brother James is understandbly furious at her blase announcement that she is carrying Jefferson's child. Jefferson is equally blase when told that Sally is carrying his child, and patronizingly tells her that she'd be far better off under his protection than free and living in France with her brother. But, he promises, I'll free her when I die and our children (including any more that come, Jefferson says, in a chilling declaration of Sally as *his*) when they reach 21. Oh thank you, massa, you feel like telling the screen. Big deal. The worst scene is still to come, however, involving Jefferson's daughter Patsy. She is already angry at him, first for breaking his vow, made to her mother on her deathbed, not to marry again. (Obviously the woman wasn't just talking about matrimony.) Jefferson has also refused to allow Patsy to become a nun as she wishes, despite earlier moralizing about freedom of religion (that seems to mean freedom to agree with him). Having promised Sally and her brother their freedom, Jefferson calls in Patsy to witness the bargain and promise to fulfill it should anything happen to him. Sally's brother blurts out the impending birth of the child, and Jefferson asks, \"do you swear?\" Paltrow's performance in this scene is brilliant, although she has almost nothing to say. Her face nearly contorts in agonizing pain at this revelation, yet she controls her grief and whispers yes. If anything, and the filmmakers could have had something if they'd emphasized this point more, \"Jefferson in Paris\" is an indication of the status of woman in the late 18th century, viewed even by men like Jefferson as attractive property, pleasing but without true intellect or souls. We see Jefferson shed a few tears over a letter from Maria, obviously telling him where to get off, but he's soon laughing away at a wild dance from Sally, complete with tossed hair and heaving bosom. I don't know whether this is an accurate portrait of Jefferson or not. I don't care to watch it, however, just for the sake of watching it. This Jefferson is no hero or even an anti-hero. He's a selfish, lying child-molestor--and one who gets away with it--not the kind of man I want to see a movie about."
      ],
      "genres": [
         "Biography",
         "Drama",
         "History",
         "Romance"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Merchant Ivory Productions"
      ],
      "summaries": ["One of the obsessive speculations in American history is whether Thomas Jefferson, in the years before he became president, had an affair with (and fathered a child with) his 15-year-old slave Sally Hemings. JEFFERSON IN PARIS follows Jefferson to France (as the U.S. ambassador to the court of Louis XVI), following the death of his wife his friendships and flirtations with the French, his relationship with his daughters and slaves from home (especially Sally), against the backdrop of the beginning of the French Revolution."],
      "budget": 14000000
   },
   "movielensId": 254,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-31",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["James Ivory"],
      "runtime": 139,
      "movieId": 254,
      "title": "Jefferson in Paris",
      "mpaa": "PG-13",
      "actors": [
         "Nick Nolte",
         "Greta Scacchi",
         "Thandie Newton",
         "Gwyneth Paltrow",
         "Jean-Pierre Aumont",
         "Simon Callow",
         "Seth Gilliam",
         "James Earl Jones",
         "Michael Lonsdale",
         "Nancy Marchand",
         "Charlotte de Turckheim",
         "Lambert Wilson",
         "Vincent Cassel",
         "Steve Kalfa"
      ],
      "imdbMovieId": "0113463",
      "originalTitle": "Jefferson in Paris",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["UxoLGZ3J3-M"],
      "plotSummary": "His wife having recently died, Thomas Jefferson accepts the post of United States ambassador to pre-revolutionary France, though he finds it difficult to adjust to life in a country where the aristocracy subjugates an increasingly restless peasantry. In Paris, he becomes smitten with cultured artist Maria Cosway, but, when his daughter visits from Virginia accompanied by her attractive slave, Sally Hemings, Jefferson's attentions are diverted.",
      "tmdbMovieId": 87729,
      "avgRating": 2.88538,
      "releaseYear": "1995",
      "numRatings": 650,
      "posterPath": "/qKr3Mgo1HB3HkGTAVoVEpOSWlp2.jpg"
   }
}