{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "france",
            "id": 254
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "passion",
            "id": 2983
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "conflict",
            "id": 11933
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "violence",
            "id": 14819
         }
      ],
      "imdb_id": "tt0157208",
      "video": false,
      "title": "The School of Flesh",
      "recommendations": [
         42707,
         10613,
         5719,
         24200
      ],
      "backdrop_path": "/u2z0r73WX6PCrjoUCSYvrw4sT8D.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dominique",
               "gender": 1,
               "credit_id": "52fe4984c3a368484e12f7bb",
               "name": "Isabelle Huppert",
               "profile_path": "/wGG9v1Uci3sfrbjt0bRXkLrTqjY.jpg",
               "id": 17882,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Quentin",
               "gender": 0,
               "credit_id": "52fe4984c3a368484e12f7bf",
               "name": "Vincent Martinez",
               "profile_path": null,
               "id": 142574,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Chris",
               "gender": 2,
               "credit_id": "52fe4984c3a368484e12f7c3",
               "name": "Vincent Lindon",
               "profile_path": "/ttfk7etXzELkW1gMSo5eH8aEzjY.jpg",
               "id": 5443,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Mr Thorpe",
               "gender": 2,
               "credit_id": "52fe4984c3a368484e12f7c7",
               "name": "Jean-Louis Richard",
               "profile_path": "/wAjzD4mkSgwL67EtZCRukwHUw86.jpg",
               "id": 18558,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mme Thorpe",
               "gender": 1,
               "credit_id": "52fe4984c3a368484e12f7cb",
               "name": "Marthe Keller",
               "profile_path": "/vJS0w1lz2YKyfyKd7Iz925bt5WB.jpg",
               "id": 25282,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Soukaz",
               "gender": 2,
               "credit_id": "52fe4984c3a368484e12f7cf",
               "name": "François Berléand",
               "profile_path": "/47NVX74FK3KCmGEF7HKmgNhvwMo.jpg",
               "id": 7693,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dominique's Friend",
               "gender": 0,
               "credit_id": "52fe4984c3a368484e12f7d3",
               "name": "Danièle Dubroux",
               "profile_path": "/mMbTMv8GrPurvcN9n3J0WFFXqQy.jpg",
               "id": 239344,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Cordier",
               "gender": 2,
               "credit_id": "52fe4984c3a368484e12f7d7",
               "name": "Bernard Le Coq",
               "profile_path": "/tJVXbu8Zmpfic0bMLPPvdYcx5dN.jpg",
               "id": 6015,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Marine",
               "gender": 1,
               "credit_id": "52fe4984c3a368484e12f7db",
               "name": "Roxane Mesquida",
               "profile_path": "/A7cXGXQg4waLLtJblAUTDuAVHW9.jpg",
               "id": 7706,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Louis-Guy",
               "gender": 0,
               "credit_id": "52fe4984c3a368484e12f7df",
               "name": "Jean-Claude Dauphin",
               "profile_path": "/i67AXSx0q6qwvsw1gWscalOO6Es.jpg",
               "id": 24405,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Quentin's Mother",
               "gender": 1,
               "credit_id": "52fe4984c3a368484e12f7e3",
               "name": "Michelle Goddet",
               "profile_path": "/bNgmKi6tNHb9d99vA3VuikdV22j.jpg",
               "id": 275776,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "The Young Plumber",
               "gender": 0,
               "credit_id": "52fe4984c3a368484e12f7e7",
               "name": "Laurent Jumeaucourt",
               "profile_path": "/qkiTgtMIMfYjUDr097ecdvL55VL.jpg",
               "id": 582861,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Robert",
               "gender": 2,
               "credit_id": "52fe4984c3a368484e12f7f5",
               "name": "Pierre Laroche",
               "profile_path": "/dSFH2xk3KFRod828tG1IeCruQDl.jpg",
               "id": 24857,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "The Photographer",
               "gender": 0,
               "credit_id": "52fe4984c3a368484e12f7eb",
               "name": "Richard Schroeder",
               "profile_path": null,
               "id": 582862,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4984c3a368484e12f7f1",
               "name": "Benoît Jacquot",
               "profile_path": "/gQ9Mxt0uYIcFs0g1byxYqI2FoZx.jpg",
               "id": 229263,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54c500269251412fdb0015fe",
               "name": "Jacques Fieschi",
               "profile_path": null,
               "id": 23506,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a168b6c0e0a2612dd0073fd",
               "name": "Yukio Mishima",
               "profile_path": "/emuA4XpDqWtoy91WF7qlzgjqYRO.jpg",
               "id": 140102,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "5a168b8a92514153a60071e9",
               "name": "Caroline Champetier",
               "profile_path": "/tkHJncN5hO0RXkWGKDSoek67fng.jpg",
               "id": 50539,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "5a168b9a92514153a90074e5",
               "name": "Luc Barnier",
               "profile_path": null,
               "id": 23397,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5a168bb092514153ac007438",
               "name": "Katia Wyszkop",
               "profile_path": "/pKoJs8TOm59C7DLIQAusGG0tDIh.jpg",
               "id": 26098,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 1.238602,
      "production_countries": [
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "LU",
            "name": "Luxembourg"
         }
      ],
      "id": 77936,
      "vote_count": 7,
      "budget": 0,
      "overview": "In Paris, Dominique, a middle-aged fashion professional, solicits the services of the handsome Quentin , a bisexual bartender and prostitute who is 15 years her junior. After they first sleep together, their business transaction becomes transformed into a passionate love affair. However, the couple's romance becomes an ugly power struggle when social class and age distinctions begin to bubble toward the surface.",
      "similar": [
         1024,
         979,
         23949,
         49950,
         1259,
         4771,
         6075,
         86331,
         339692,
         19053,
         9540,
         1643,
         8067,
         226,
         24420,
         3134,
         17612,
         9093,
         2149,
         1903
      ],
      "original_title": "L'école de la chair",
      "runtime": 110,
      "poster_path": "/o8ZxuZLMR5fLOk6dZUWgoJ14AOd.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Orsans Productions",
            "id": 44821,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Artémis Productions",
            "id": 11773,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Bel Age Distribution",
            "id": 44822,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         }
      ],
      "release_date": "1998-11-18",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Lessons in love, sex and betrayal.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Benoît Jacquot"],
      "runtime": 110,
      "synopsis": null,
      "writers": [
         "Jacques Fieschi",
         "Yukio Mishima"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0157208/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczNjkyNzkyMV5BMl5BanBnXkFtZTYwMjY0MDM5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Isabelle Huppert, Vincent Martinez, Vincent Lindon | See full cast and crew »"],
      "reviews": [
         "There is something extraordinary about the two leads in this movie. Vincent Martinez was initially quite appalling to look at - scrawny, brooding with features more akin to a caricature! However, as the film progresses, one can sense a certain charisma and physical presence that he projects more and more palpably; yes, even from a man's perspective. But that's as far as it goes for him... As for Isabelle, my! What an actress, what a woman! These French actress: Catherine Deneuve, Adjani, Beart - very few Hollywood actresses can be placed in the same league as them. This is my first time seeing Ms Huppert perform and I was really blown away. She brought so much contradicting sides to her character and she made them so believable. The character is strong in career and personality, yet vulnerable in her devotion to the above-mentioned man-animal. She is decisive and purposeful in life choices of career, marriage and the man-in-her-life yet defers constantly to the whims and fancies of him. You get the picture! Anyway, with one single long shot of her face as betrayal, despair and sadness climax into a single track of tears - extraordinary! No self-pity, no cloying sentimentality; just plain sadness at the state of affair....At first glance, she did not appear extraordinarily beautiful. But as the film progresses, she looked increasingly radiant and one can't help but feel drawn to her. One of the best film I've seen at this year's film festival where more is said through pregnant silences than confrontations and accusations a la Hollywood.",
         "If there is one thing you can't blame the creators of this movie of, than it must be the fact that their movie is too sugar sweet. This is certainly not like any other romantic Hollywood movie that you may have seen in the past. This movie is actually a very good study of people and human nature in not so average but very recognizable situations. \"L'École de la Chair\" or \"The School of Flesh\" could be the title of a cheap porn movie, but it certainly isn't. This is an intelligent movie about a mature fashion executive called Dominique who gets obsessed with Quentin, a bisexual male prostitute. He's a violent man who loves nobody but himself and yet she can't resist him. She is filled with passion, but hates the man at the same time because he always hurts her feelings and doesn't seem to love or care about her. What should she do? Should she show him the door or keep trying to get him out of the prostitution? Should she listen to her friends, colleagues, Quentin's former and current clients... who all try to help her, but sometimes do more harm than good? Although I would like to say that everybody should watch this movie, I know for sure that not many will like it. This isn't the kind of movie that will easily reach a large audience. Nevertheless this is an interesting movie, but I guess it will be loved most by people who are used to watch this kind of movies or people who like the European cinema. Personally I liked what I saw and that's why I give it a 7.5/10.",
         "\"School of Flesh\" tells of the ebb and flow of a sex/love relationship between a well-to-do middle aged woman and a handsome young bisexual male hustler. In typical French fashion the pair of star-crossed protags are locked in constant maneuvering in order to better define the limits of their relationship and their influence over it. Though the film is very well acted and directed with Huppert exuding expressionless controlled intensity, the underlying story seems somehow worn, unoriginal, and lacking the psychodynamics required for audience satisfaction. Recommended only for Huppert fans and aficionados of French cinema. (B-)",
         "More than a few French film-makers seem to like to take two strong characters\u0097with different strengths\u0097and throw them together and wait for the reactions. Jacquot's version of this procedure involves an older woman, Dominique (Isabel Huppert) involved with a younger man, the hustler Quentin (Vincent Martinez). While this pairing suggests cliché, somehow it grows well beyond the usual fare To begin with, Dominique is a complicated character, strong, in control of her life, inclined to be merry though not entirely content with things and hating boredom. It's not entirely clear what she does professionally\u0097perhaps a designer or owner/executive of a fashion company\u0097but she enjoys it and is good at it. She takes her droopy friend (Danièle Dubroux) around with her, and at a nightclub she sees Quentin staring at her. The gay waiter Chris (Vincent Lindon) helps her get acquainted, and an affair begins. Quentin is fickle and stubborn and wayward, turns tricks for money, knows he's good at it, prefers women but doesn't mind men. He isn't as strong as he looks. Though Quentin makes gestures about preserving his independence, going out, seeing others, and doling out attention according to his convenience, in fact Dominique makes the rules. When he does things that would hurt or threaten a more conventional woman, she remains unfazed. What she wants is Quentin as he is, vibrant and smoldering and vulnerable. It's interesting to watch the way his attempts to assert a bad-boy independence always wind up with him walking away from the supposedly edgy scene\u0097the nightclub where they met, the street where the rent-boys hustle\u0097with Dominique, or heading back to her apartment. And it's surely symbolic that he practices karate enthusiastically in the dojo, but he's not so tough outside, falling down twice in brief fights. But when inevitably there's a crisis it's not a predictable case of him acting out the bad boy part. No, he plans to marry the pretty young daughter of Dominique's friends. Dominique has the chance to blackmail Quentin with explicit pictures of him having sex with a male client, provided by Chris (who says she wanted to be able to have power over him but not to use it. Dominique is stronger. But she burns them. And in doing so, she realizes they're finished. Quentin wants to stay with Dominique, but by this time she's exhausted. She sends him away; he sits shirtless on the floor, mourning, refusing to leave. Then a brief coda: Dominique a few years later, elegant, with longer hair, runs into Quentin outside a metro stop. He's carrying a young child, his daughter from his by now failed marriage. He gives Dominique his address, but she doesn't take it. She watches him go. Martinez is pretty good, sneaking in boyishness under the carapace of macho sexuality, and he has a great smile. Lindon is also excellent as Chris, an elective girl with a great knowing look. There are also a couple of brief appearances by an old boyfriend of Quentin's, Soukaz (François Berléant), who is rueful and nervously dignified. The real delight is Huppert, who is simply breathtaking in this part. In other movies she has been called upon for over-the-top effects, but here she uses a subdued, subtle technique, registering emotions with small but affective expressions: boredom, curiosity, desire, joy, discomfort, hope, desperation, humour, calm, sadness, self-control. A great movie, one that turns stereotypes inside out.",
         "\"Middle-aged divorcee picks up barman in gay bar\" isn't a promising plot-line; the title's soft-porn suggestion is also off-putting. But in fact it's a delicate and attractive handling of what could have been sordid relationships. The key word, I suppose, is \"tender\"; we are frequently led to expect violence (the barman Quentin is a kick-boxer - we watch him attacking a punchbag during the title sequence) but are instead surprised by reasonableness and gentleness. The few nude scenes manage to be erotic without ever being vulgar. Relationships are weird, the film (and Mishima's novel) seems to say, but there can still be tenderness in life. Isabelle Huppert exudes French charm . . .",
         "This film is near the top of my list for best films out of France. It is a superb production. The scenes between Dominique (Isabelle Huppert) and Quentin (Vincent Martinez) are completely convincing with natural conversation and sensitive mood changes. While the disparity of ages between lovers is not a new theme, it has never been handled more expertly than here where the older woman wants to \"possess\" the young call-boy but he is determined to remain a free spirit. What is so arresting in this story is that we know so little about the characters and their past. But information is gleaned bit by bit from their conversations, and never very much, so we hunger for more as the story unfolds. The dewy-eyed Isabelle Huppert in the final scenes reveals her talent as a fine actress. A wonderful piece of cinema that holds you to the end...and what an ending when the two characters realize that their dream has ended and they now face the harsh realities of life.",
         "This movie examines obsession of the heart and body. Isabelle is brilliant. She is very personal. She expresses her need to be adored in a very vulnerable way, as in the arcade scene, when the boy refuses to leave. She walks away, the camera tracks with her, revealing her ambivalence and confusion. She then returns, tries to play his games, but is unsuccessful. It's a wonderful scene and she's fabulous. Love to meet and work with this incredible actor. Her expressions are so telling. This movie had subtitles here in American and I really didn't need them most of the time to understand what was happening on the screen. I could identify with needing someone so much that you are addicted to them. Again, terrific movie. No car chases, just people chases.",
         "Huppert is fascinating and wonderful. I could not take my eyes off her face -- the subtle shifts in emotion. You could almost see what she was thinking every moment although there were baffling moments as well. What was she looking for? Vincent is engagingly vulnerable and repulsive at the same time -- bravo to him for an excellent first effort. I'd like to see Isabelle and VIncent paired again in future films. Highly recommend this film.",
         "A superb study of a mature woman's knowledge of her inner self, and acting out on instinct, regardless of the consequences, THE SCHOOL OF FLESH is memorable. Isabelle Huppert, at home playing cold, calculated women, shines as the mature woman, supported by fine performances, notably by Vincent Lindon, in a highly atypical role, and professional direction by veteran Benoit Jacquot.",
         "Although the two protagonists are so different from one another in age, socio-economic status, education, they are both lonely souls who have been deprived of guidance and love. It is the blind leading the blind as they come together in a kind of relationship of convenience. It seems at first that Dominique seeks a walk on the wild side, but ultimately to tame and to nurture her conquest, while Quentin seems to take even temporary financial support wherever he can find it. The characters' development, through their relationship with each other, and as they expose how their inner life has been conditioned before they met, is a kind of dance of the seven veils. Neither is who each seems and manages to defy the inevitable stereotype we expect to fit the story's premise. The nuanced twists and turns in character, and particularly as they forge a relationship with \"the other,\" demands subtle acting. Both actors are up to the task. Martinez's presence grows as an essential humanity is revealed that elevates him above his day to day urge for survival and autonomy. Isabelle Hubert stuns by restraint, bringing vulnerable dignity to Dominique's emotional trajectory. They can not change the fate of their relationship, but they leave a lasting impression on each each other nonetheless."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Artémis Productions",
         "Bel Age Distribution",
         "La Sept Cinéma"
      ],
      "summaries": ["Fashion executive Dominique's obsession for Quentin, a young bisexual hustler, fills her desire for physical love but leaves her taxed emotionally. Twists and turns in the relationship, along with the man's violent and abusive nature, force Dominique to reconcile the conflicts created by her passion. In this quest, Dominique is aided [and sometimes hindered] by friends, clients, and Quentin's former and current acquaintances."],
      "budget": 0
   },
   "movielensId": 2544,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-11-18",
      "dvdReleaseDate": "1999-12-07",
      "directors": ["Benoît Jacquot"],
      "runtime": 110,
      "movieId": 2544,
      "title": "The School of Flesh",
      "mpaa": "R",
      "actors": [
         "Isabelle Huppert",
         "Vincent Martinez",
         "Vincent Lindon",
         "Jean-Louis Richard",
         "Marthe Keller",
         "François Berléand",
         "Danièle Dubroux",
         "Bernard Le Coq",
         "Roxane Mesquida",
         "Jean-Claude Dauphin",
         "Michelle Goddet",
         "Laurent Jumeaucourt",
         "Pierre Laroche",
         "Richard Schroeder"
      ],
      "imdbMovieId": "0157208",
      "originalTitle": "L'école de la chair",
      "genres": [
         "Romance",
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["0IIMTO9vXtE"],
      "plotSummary": "In Paris, Dominique, a middle-aged fashion professional, solicits the services of the handsome Quentin , a bisexual bartender and prostitute who is 15 years her junior. After they first sleep together, their business transaction becomes transformed into a passionate love affair. However, the couple's romance becomes an ugly power struggle when social class and age distinctions begin to bubble toward the surface.",
      "tmdbMovieId": 77936,
      "avgRating": 3.22222,
      "releaseYear": "1998",
      "numRatings": 135,
      "posterPath": "/o8ZxuZLMR5fLOk6dZUWgoJ14AOd.jpg"
   }
}