{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "hiv",
            "id": 9766
         },
         {
            "name": "lesbian",
            "id": 10768
         }
      ],
      "imdb_id": "tt0159696",
      "video": false,
      "title": "Relax... It's Just Sex",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Vincey Sauris",
               "gender": 2,
               "credit_id": "52fe48ff9251416c9109f4bd",
               "name": "Mitchell Anderson",
               "profile_path": "/uSUVpqJmtsokGvwrEvSp6f62OwX.jpg",
               "id": 535895,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Buzz Wagner (as T.C. Carson)",
               "gender": 0,
               "credit_id": "52fe48ff9251416c9109f4c1",
               "name": "Terrence 'T.C.' Carson",
               "profile_path": "/eto2MDC4VXLGiPOXNqSdlWJ5yxL.jpg",
               "id": 233191,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Emile Pillsbury",
               "gender": 2,
               "credit_id": "52fe48ff9251416c9109f4c5",
               "name": "Seymour Cassel",
               "profile_path": "/atWyQvsLNjmXP5dxsOiaf5Qg9j.jpg",
               "id": 5950,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Megan Pillsbury",
               "gender": 1,
               "credit_id": "52fe48ff9251416c9109f4c9",
               "name": "Serena Scott Thomas",
               "profile_path": "/dvTjb6V46wOo9JGgcViU54UoZNN.jpg",
               "id": 10780,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Tara Ricotto",
               "gender": 1,
               "credit_id": "52fe48ff9251416c9109f4cd",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Alicia Pillsbury",
               "gender": 1,
               "credit_id": "52fe48ff9251416c9109f4d1",
               "name": "Susan Tyrrell",
               "profile_path": "/2cQnK1bJxp9PldCeA05kohavPs8.jpg",
               "id": 59369,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Sarina Classer",
               "gender": 1,
               "credit_id": "52fe48ff9251416c9109f4d5",
               "name": "Cynda Williams",
               "profile_path": "/jSbrK4y3JSboIs8yEiomlIF0pwj.jpg",
               "id": 87117,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Auntie Mahalia",
               "gender": 2,
               "credit_id": "52fe48ff9251416c9109f4d9",
               "name": "Paul Winfield",
               "profile_path": "/6FuLfJh70aDUxggFuPC2oID5Mjg.jpg",
               "id": 1818,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Jared Bartoziak",
               "gender": 2,
               "credit_id": "52fe48ff9251416c9109f4f5",
               "name": "Billy Wirth",
               "profile_path": "/oyigYLUbcfdpkhC5SqAQuRyLA7p.jpg",
               "id": 39112,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Javi Rogero",
               "gender": 0,
               "credit_id": "58cb9bfd9251415e2800f51d",
               "name": "Eddie Garcia",
               "profile_path": null,
               "id": 1397694,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Gus Rogero",
               "gender": 2,
               "credit_id": "52fe48ff9251416c9109f4e1",
               "name": "Timothy Paul Perez",
               "profile_path": null,
               "id": 62713,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Diego Tellez",
               "gender": 0,
               "credit_id": "52fe48ff9251416c9109f4e5",
               "name": "Chris Cleveland",
               "profile_path": "/lsijA5v1NOvtL33EgO3KJjANUl4.jpg",
               "id": 91267,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Dwight Bergman",
               "gender": 2,
               "credit_id": "52fe48ff9251416c9109f4e9",
               "name": "Gibbs Tolsdorf",
               "profile_path": null,
               "id": 931032,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Marcia Fu",
               "gender": 0,
               "credit_id": "52fe48ff9251416c9109f4ed",
               "name": "Kathryn Bundy",
               "profile_path": null,
               "id": 931033,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Robin Moon",
               "gender": 1,
               "credit_id": "52fe48ff9251416c9109f4f1",
               "name": "Lori Petty",
               "profile_path": "/u2D3zteSlOj4zLp7jBcGqQVBsR1.jpg",
               "id": 15309,
               "order": 14
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe48ff9251416c9109f4b9",
            "name": "P.J. Castellaneta",
            "profile_path": null,
            "id": 617183,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.755441,
      "production_countries": [],
      "id": 84586,
      "vote_count": 5,
      "budget": 0,
      "overview": "A mixed group of individuals - lesbian, gays, and heterosexuals who all frequent a local bar struggle to accept each others lifestyles. However when the two gays are attacked and fight back and ultimately rape one of their attackers, the group becomes strongly divided on their actions.",
      "similar": [
         449176,
         10938,
         184352,
         9800,
         1213,
         376867,
         11000,
         2898,
         258480,
         342,
         26280,
         81716,
         428493,
         152532,
         21060,
         338189,
         1429,
         1966,
         244772,
         401898
      ],
      "original_title": "Relax... It's Just Sex",
      "runtime": 110,
      "poster_path": "/ee89DQPUYbOE2ZNMRzVFuIk6yoj.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": null,
         "name": "TLA Releasing",
         "id": 328,
         "origin_country": ""
      }],
      "release_date": "1998-06-26",
      "vote_average": 4.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["P.J. Castellaneta"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["P.J. Castellaneta"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0159696/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE3NTk5OTAwNF5BMl5BanBnXkFtZTcwNDE3OTYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Mitchell Anderson, Jennifer Tilly, Terrence 'T.C.' Carson | See full cast and crew »"],
      "reviews": [
         "Late one night on a Monday (if you can believe it) there was nothing and I mean nothing on television, until I came to this movie called Relax....It's just sex. I saw a couple of familiar faces and decided to stick around. When you get right down to it. This movie is about everyone. Whether your white, black, latino, from the middle East or China, male, female, gay, straight, lesbian, whatever. This movie is about love, friendship, sex, tears, death, life and everything else that comes in the middle of all that. See this movie. Trust me, at the end you'll go ---- yeah...",
         "Maybe I'm a bit presumptuous in marking this one as a gay film, but since the majority of the characters is in fact gay I choose to do so anyway and I really do not mean anything more than: this is a film mainly about gay people! Now the beginning of the film really is how I imagined how the whole film would be, giving the audience a somewhat comedic look on sex and human nature. Gradually I found out that this was a different sort of film though and I must say that I really was amazed by how well the film turned from comedy, to seriousness, to drama. There are not too many films out there that are able to get from a really funny scene like the intro to such a dramatic last scene, without something seeming odd or misplaced, yet this film did. I mean I really felt as if I was changing alongside the characters on the screen and in the end I was amazed at what I'd seen. There was comedy, there was drama, there were thrills and everything was so realistic that you'd have to have a heart of stone not to be touched by it - except for the conservative maybe ;-)! 7,25 out of 10",
         "This could have been a shallow by-the-numbers movie about gay, lesbian and straight friends in LA, but it wasn't. The characters and situations are realistic, all the acting was good and the movie doesn't shy away from showing male-male sex scenes (which is why it's unrated). The movie isn't perfect. It isn't as funny as it could be and some scenes don't play out at all or play out too long. Still, when was the last time we had a movie that dealt honestly and explicitly with gay men without desexing them or turning it into innocuous comedy (like \"Jeffrey\"). A really good film.",
         "This is a fairly decent film with a really lame title. The film's opening is even misleading, starting with some pretty raucous gay sex--so from the outset it appears as if the film is going to be yet another dull explorating of the trials of gay life in the 90s. And there have been a lot of those films lately. Fortunately, director PJ Castellaneta is more wily than he lets on, and allows the film to evolve into something more intricate and at times very touching. The film manages to balance a cast of widely different characters and maintain a sense of order without devolving into a who's who of politically correct character inclusion. You have the straights, the gays, the lesbians, the bisexuals, blacks, whites, latinos, and the film even manages to present Christianity in positive tones, albeit with a few well placed jabs now and then. The scripts evenly doles out its emotional weight, never straying into farce when it would be the easy thing to do, nor does it list grind into maudlin sentimentality when it would also be the easy thing to do. The story revolves around the lives of a coterie of friends of various sexual orientations and temperament. \"Relax\" follows their development with humor and insight, sometimes relying too much on an intrusive voiceover by the main character, Vince. The emotional centerpiece of the film is a gay bashing where the victim suddenly gains the upper hand. This moment threatens to overwhelm the final half of the film because it raises a crucial question that the \"Relax\" never adequately, answers (nor did I feel it should have answered), which is, In a world where one is oppressed by violence, to what degree is violence--retributive, eye-for-an-eye violence--an appropriate response? This is just one of a number of issues that the film raises and leaves for your consideration. Perhaps it is just as well, since it seems like to dwell overly long on these issues would overwhelm the rest of the film; indeed, Castellaneta felt it necessary to remove Vince from the main thread of the film, whereas he was hitherto the central character. In his place, Jennifer Tilly takes over, and she takes the film to its conclusion. Tilly usually goes for the quirks or the sex appeal of her film characters, but this time around she plays a woman whose quirks don't overwhelm her personality, merely compliment. She makes the film. It was also nice to see a gay film that didn't trot out the familiar, banal diatribes against Christianity. Granted, the gay Christian couple does come across as a little hokey at times, they are never portrayed as weird, evil, judgmental, or exclusionary. Indeed, they are a fitting completion to the the microcosmos that revolves around Tilly's maternal presence. I came to the film with few expectations and came away rather pleased. There are still a few drawn out moments that could have been trimmed, but the overall package of this film was a surprising delight.",
         "This was a very fun and heartfelt film. There is a better energy when watching this in a theatre with others. I noticed that it lost some of its energy when watching at home on video. The characters are endearing and you will find yourself drawn to all of them. This is well written and acted. A crafty and adept mixture of humor and heartfelt drama. There are many films that get a gay following, but this film outclasses most of the. I strongly recommend this film. It has stayed with me for so long now since I saw it numerous times at an independent theatre in Houston. I keep up with the careers of the actors and director of this film and anxiously await their future work. I think this could work very well as a TV series or sequel. I think it is just hard for me to say goodbye to these characters!",
         "The first half of the film is plagued by strange use of music and poor sound quality, but somewhere along the line, as if by magic, the film takes root. The technical weakness improves a great deal, and the characters come to life. By the end of the movie, you want more. This is a realistic view of problems faced by many people: anti-gay violence, relationships that go awry, disease, and miscarriage. The relationships between the friends in this film are very strong and moving, and in the last half of the movie we see some very powerful and wonderful results of the friendships. Perhaps loveliest of all is a scene between two women, former lovers, who are talking as the NEW lover overhears everything. I won't say what happens, but it is a wonderful and gorgeous scene unlike anything I have seen in any other movie. This scene alone makes the film worth seeing. See it by all means, but be prepared for some frustration with the first half of the film.",
         "As a gay man but more importantly as a member of the human race, this movie spoke volumes to me. Most of us search for meaning and love in our lives and try to find these through our spirit, sexuality, mind and body. These characters representing races, religions, men, women and various sexualities were all looking for the same thing showing how similar we all really are. I consider myself a tough guy but any movie that makes me cry and that I would see twice has touched me very much and draws parallels to my own life. I found the movie \" fluffy \" until the gay-bashing scene and then the depth of characterization and interaction became apparent. I would proudly take any of my friends and family to see this film and think it could also be an effective tool to show high school sex education or family courses. How better to stimulate conversation about the search for human love across all boundaries.",
         "Shook me up and I'm not very clear as to why. Having only been 'out' for a few months, some of what I felt I'm sure was due to inexperience. To me, the story of a playwright who lives and breathes in 'Dating Hell' is something everyone gay or straight can relate to. His anger at the 'gay bashers' and his general confusion really had an effect on me. Kind of like taking 'Okay so now you're a Homo 101' and being faced with a lot of issues from across the board. I truly believed the storyline and the actors were so real to me. The HIV issue with Javi was well done and Buzz made his points regarding alternative opinion convincingly. The lesbian turned straight, Robin and Serina and their triangle against the backdrop of the 'rape' (I won't say more) while the main arc of the story is the straight woman who wants a baby so bad -- all of this demanded me to examine and comment on 'our human condition'. The film jams alot of perspective into 96 minutes. See it! I enjoyed it. I cried. And laughed alot but never has a movie made me feel more alone than this one.",
         "A total surprise! From the title I expected a gay sex farce and got a great dramatic/comedy! One of Tilly's best! All around the acting was very good and the script was a delight! There's lots of laughs, but keep the hankies close by. Too bad the Academy overlooks what they consider small gay oriented films. Because, this film deserved many Academy nominations!",
         "Relax... It's Just Sex starts out as a comedy. The first twenty minutes are absolutely hilarious; the jokes are well-timed, the characters really seem to have chemistry and the there is a general light-heartedness about the film. This, however, changes after the first half hour. The jokes move to the background. Now it's about the people. Relax... turns into a touching drama with a lot of different topics: gay bashing, procreation, AIDS, finding love are a few that spring to mind. Everyone, gay, bi or straight, male or female will identify with at least one of the characters. It doesn't matter that some of the characters are slightly exaggerated. It's the problems they deal with and the way they deal with those problems what makes this truly a film to watch."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Forefront Films",
         "Sneak Preview Entertainment"
      ],
      "summaries": ["A mixed group of individuals - lesbian, gays, and heterosexuals who all frequent a local bar struggle to accept each others lifestyles. However when the two gays are attacked and fight back and ultimately rape one of their attackers, the group becomes strongly divided on their actions. Jennifer Tilly is the mother hen of the group who tries to hold everyone together. The lesbian lovers break up when one admits to having an affair with a man."],
      "budget": 0
   },
   "movielensId": 2545,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-06-26",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["P.J. Castellaneta"],
      "runtime": 110,
      "movieId": 2545,
      "title": "Relax... It's Just Sex",
      "mpaa": "R",
      "actors": [
         "Mitchell Anderson",
         "Terrence 'T.C.' Carson",
         "Seymour Cassel",
         "Serena Scott Thomas",
         "Jennifer Tilly",
         "Susan Tyrrell",
         "Cynda Williams",
         "Paul Winfield",
         "Billy Wirth",
         "Eddie Garcia",
         "Timothy Paul Perez",
         "Chris Cleveland",
         "Gibbs Tolsdorf",
         "Kathryn Bundy",
         "Lori Petty"
      ],
      "imdbMovieId": "0159696",
      "originalTitle": "Relax... It's Just Sex",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["J-VYnoNKWAc"],
      "plotSummary": "A mixed group of individuals - lesbian, gays, and heterosexuals who all frequent a local bar struggle to accept each others lifestyles. However when the two gays are attacked and fight back and ultimately rape one of their attackers, the group becomes strongly divided on their actions.",
      "tmdbMovieId": 84586,
      "avgRating": 3.26,
      "releaseYear": "1998",
      "numRatings": 150,
      "posterPath": "/ee89DQPUYbOE2ZNMRzVFuIk6yoj.jpg"
   }
}