{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "boy",
            "id": 5202
         },
         {
            "name": "reunion",
            "id": 9824
         }
      ],
      "imdb_id": "tt0120646",
      "video": false,
      "title": "The Deep End of the Ocean",
      "recommendations": [
         48287,
         21311,
         41240,
         15592,
         21349,
         15556,
         33657,
         41590,
         10333,
         10691,
         18856,
         9839,
         61418,
         32304,
         69719,
         83489,
         38509,
         45712,
         31633,
         15506
      ],
      "backdrop_path": "/7o7glW9lssAvPFM8dS5fZYJnL3Q.jpg",
      "revenue": 28121100,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Beth Cappadora",
               "gender": 1,
               "credit_id": "52fe444d9251416c9100bf31",
               "name": "Michelle Pfeiffer",
               "profile_path": "/vyoJV5QYwIGZohrPpKFdKc7EpSP.jpg",
               "id": 1160,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Pat Cappadora",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf35",
               "name": "Treat Williams",
               "profile_path": "/uKejRJTEVOy6IOsJX2mJH3SwbTl.jpg",
               "id": 4515,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Candy Bliss",
               "gender": 1,
               "credit_id": "52fe444d9251416c9100bf39",
               "name": "Whoopi Goldberg",
               "profile_path": "/n3lF8w4X4rDa4J2LMDIxMEcuUeH.jpg",
               "id": 2395,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Vincent Cappadora - Age 16",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf43",
               "name": "Jonathan Jackson",
               "profile_path": "/yn7cbSXZapwGeUUHyflPZ0TfwhE.jpg",
               "id": 23495,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Vincent Cappadora - Age 7",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf47",
               "name": "Cory Buck",
               "profile_path": null,
               "id": 156606,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Sam Karras / Ben Cappadora - Age 12",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf4b",
               "name": "Ryan Merriman",
               "profile_path": "/sdo2IMtBRjiIJOLpmBrebAJaF89.jpg",
               "id": 57136,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kerry Cappadora",
               "gender": 1,
               "credit_id": "52fe444d9251416c9100bf4f",
               "name": "Alexa PenaVega",
               "profile_path": "/aHABeErlMgzBkrMSaHOsZFsNlhV.jpg",
               "id": 57674,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jimmy Daugherty",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf53",
               "name": "Michael McGrady",
               "profile_path": "/s8P82DWDBLyg1iMedzWdWHfD20v.jpg",
               "id": 157015,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Ellen",
               "gender": 1,
               "credit_id": "52fe444d9251416c9100bf57",
               "name": "Brenda Strong",
               "profile_path": "/gjmYWKrfqST0HJ42bjO52NE4E4A.jpg",
               "id": 101396,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Ben Cappadora - Age 3",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf5b",
               "name": "Michael McElroy",
               "profile_path": "/rULrnbuQV5PUDGTab2q708DmDwF.jpg",
               "id": 159435,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Grandpa Angelo",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf5f",
               "name": "Tony Musante",
               "profile_path": "/i1zETdFvGG9vnGtRvdg7PTqpJ5k.jpg",
               "id": 20564,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Grandma Rosie",
               "gender": 1,
               "credit_id": "52fe444d9251416c9100bf63",
               "name": "Rose Gregorio",
               "profile_path": null,
               "id": 140355,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "George Karras",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf67",
               "name": "John Kapelos",
               "profile_path": "/5s1r2lu8l1iODlmCf75hBhtxBoU.jpg",
               "id": 55554,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Laurie",
               "gender": 1,
               "credit_id": "52fe444d9251416c9100bf6b",
               "name": "Lucinda Jenney",
               "profile_path": "/nhKWN1oWThSgz0AnUDOcQTubh3r.jpg",
               "id": 5148,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Chief Bastokovich",
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf6f",
               "name": "John Roselius",
               "profile_path": "/guNyP8vyN2aPI7OGvrY2KhaiwE4.jpg",
               "id": 9285,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444d9251416c9100bf3f",
               "name": "Ulu Grosbard",
               "profile_path": null,
               "id": 140354,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54825627c3a36829a700726d",
               "name": "Stephen Schiff",
               "profile_path": "/yT2M7F417i38EzRK09wHbbycdDY.jpg",
               "id": 59583,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "54825636c3a36817a500740c",
               "name": "Jacquelyn Mitchard",
               "profile_path": null,
               "id": 1395166,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "57a68817c3a3681000002aa1",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "57a6886d9251417f2b002585",
               "name": "Stephen Goldblatt",
               "profile_path": null,
               "id": 5582,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "57b9edc99251413618000fb6",
               "name": "James Dyer",
               "profile_path": "/nj7U5fz4SVIuibmGkxl97mGZgs3.jpg",
               "id": 58471,
               "department": "Production",
               "job": "Unit Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 7.923042,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30943,
      "vote_count": 74,
      "budget": 38000000,
      "overview": "Michelle Pfeiffer is ferocious in the role of a desperate mother whose 3-year-old son disappears during her high school reunion. Nine years later, by chance, he turns up in the town in which the family has just relocated. Based on Jacquelyn Mitchard's best-selling novel (an Oprah book club selection), the movie effectively presents the troubling dynamics that exist between family members who've suffered such an unsettling loss.",
      "similar": [
         275,
         8067,
         2320,
         2163,
         562,
         4771,
         446791,
         14043,
         270487,
         3580,
         33107,
         8834,
         8090,
         862,
         37430,
         8681,
         1571,
         14869,
         59967,
         193893
      ],
      "original_title": "The Deep End of the Ocean",
      "runtime": 106,
      "poster_path": "/iUBMUUqBMPRQ7fCOtCsmBaFBPCB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Mandalay Entertainment",
            "id": 1236,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-03-12",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "The search for her son was over. The search for her family was just beginning.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ulu Grosbard"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Jacquelyn Mitchard",
         "Stephen Schiff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120646/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTA1Mzc5NjQzOTdeQTJeQWpwZ15BbWU2MDYyMzk4OA@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Michelle Pfeiffer, Treat Williams, Whoopi Goldberg | See full cast and crew »"],
      "reviews": [
         "Beth Cappadora is at a reunion in a hotel when her middle child of three goes missing. At first the search is informal but it grows increasingly frantic and official as they realise that Ben has been taken by somebody. The family never fully recovers and carry the scars for years. Nine years later the family have moved to Chicago to start a new life. When Beth has a local boy come to the block to cut the grass, she believes that he must be Ben because her looks just like him despite the age. The police recover Ben but is it fair to take him away from the people Ben now considers his family? The plot summary gives the impression that this is just a standard weepy that would easily screen on a weekday afternoon. However the presence of a couple of well known names in the cast list suggests that this film will give the subject a more serious approach that acts more as drama than weepy. Partly the latter is true but not 100%, and the film is still essentially a sort of weepy that has a control of it's emotions and is actually quite stable but not to the point where it is an engaging debate. The material should be thought provoking but it isn't really. What I thought would be the main thrust of the film was really just mentioned in the final 20 minutes and it was not only obvious that it was coming but it was quite logically dealt with without real emotion - this is not a `Sophie's Choice' situation but something quite lacking. The start of the film is OK but it deals with the loss too easily and I never got overwhelmed with the emotions the family must feel. Towards the end the film does a good job looking at the effects the whole thing has had on the other son's character but even this lacks an emotional punch. The cast are good on paper but they seem strangely stilted. Pfeiffer is a good actress who sadly doesn't seem to get as much good work as she gets older. Here she tries hard but can't get across what her character must be feeling inside. Williams is an OK support for her and does OK. Jackson is quite good and his character became more interesting to me than the return of Ben itself. Goldberg hangs around but attempts to give her a character through one line of dialogue about her sexuality and security in her job are so out of the blue that I was left wondering where it came from. Overall this is not a weepy because it aims higher than that and doesn't wrench all the emotion out of every scene to get the audience. However it doesn't aim high enough or reach the level where it is emotional or thought provoking, the end result being an interesting film that is a notch above the level of daytime TV weepy but not as worthy or moving as it wants to be.",
         "I think that I would have liked this movie a LOT more if I'd never read the book! If anyone of you have the chance, READ the book! Oh, it's AWESOME!!! In my opinion, the movie left out some stuff that would have made it a LOT more interesting!!! Some people seem to think that parts of the movie are unrealistic, but when you read the book and get all the detail and everything, it starts to become a lot more believable than it is in the movie. Plus, the older brother has a MUCH larger role in the book, which makes more sense than how they protrayed him in the movie. Anyway, I guess you can tell, what I'm trying to say is, READ THE BOOK!!!! :-)",
         "Ulu Grosbard has directed this fine adult drama adapted from the best-selling novel by Jacquelyn Mitchard. Michelle Pfeiffer and Treat Williams portray Beth and Pat Cappadora, parents of three youngsters. On a trip to her high school reunion, Beth loses her three year old son in a busy hotel lobby. The boy is absent from the family for nine years, after which he is surprisingly returned to his birth family. This is just the bare bones of the plot. However, it is the touching performances of all of the principals which transcend the television movie-of-the-week sound of the plot. Michelle Pfeiffer adds another moving performance to her gallery of roles. If the film had been released in the fall of 1998, as was originally planned, she might have had an Academy Award nomination. Treat Williams' role is less defined, but it is alway a pleasure to watch this under-used and under-rated actor. However, it is Jonathan Jackson and Ryan Merriman as the oldest son and the lost boy who make this such an emotionally satisfying drama. Whoopi Goldberg adds some needed humor to the serious proceedings as the detective assigned to the case. Stephen Schiff, writer for the New Yorker, has done a lean adaptation of the novel. Grosbard has unpretentiously directed this fine cast. \"The Deep End of the Ocean\" is one of the best contemporary dramas to come along in quite a while.",
         "At last a good movie for Pfeiffer. Great performance. If you're a fan of Pfeiffer-and not only-it's well worth this. The stories with illegal adoptions make some people feel uncomfortable. However, this is a movie with great actors. Goldberg as Candy Bliss is great and Jonathan Jackson as Vincent (16 years old) is a very talented young actor. Generally the movie has 2-3 very POWERFUL scenes, go and see it!",
         "\"Kids don't just vanish up in smoke, kids don't just get lost, PEOPLE LOSE THEM!\" Pat Cappadora (Treat Williams) yells in an argument to his wife Beth (Michelle Pfeiffer) about their three-year-old Ben being kidnapped while at Beth's 15-year reunion. It seems that seven-year-old Vincent (Cory Buck) didn't keep close enough of an eye. Beth's hysterical, and nobody knows what to do. Flash ahead nine years. The baby Kerry is now nine years old. Vincent (now played by Jonathon Jackson) is a rebellious teen with a knack for hot-wiring cars. Pat has his own resturant in Chicago (named Cappadora's). Beth has given up photographing. When a boy, Sam Karras (Ryan Merriman), offers to mow their lawn, Beth takes photos. And, lo and behold, it happens to be little Ben. Touching, superbly acted, well written, and emotionally moving. Pfeiffer and Williams give great performances. When Pfeiffer was hysterical, that seemed a little forced; other than that she was great. Williams delievered a strong dramatic performance, he was perfect in almost every way. The supporting characters delievered strong emotions and were very believeable. Deep End's sap isn't falsely given to you: it's done in a very believable way, even if it does seem a little over-the-top and unlikely at first. Not many movies can truly force-feed you emotion and lump-in-the-throats, but this one does. The plot twists actually were somewhat unpredictable. Actually, the movie was divided in half: the first half is when Ben is missing, the second is when Sam comes. When the finale comes in, I was surprised, even though they go for the \"Hollywood Ending\". It definately didn't seem scripted. The human interactions were very real, and the chemistry between everyone (especially Jackson and Merriman) were extremely believeable. The Deep End of the Ocean is a touching, sad, yet somehow satisfying yarn of family. My rating: 8/10 Rated PG-13 for language and thematic elements.",
         "I never heard of Deep End of the Ocean until it showed up on cable the other night. The whole time that I watched it, I thought that it was a made for cable movie. Pretty good performances--I think some of the other reviewers came down extremely hard on this movie. Not generally my kind of movie(emotional chick/family movie), but I was pleasantly surprised, even though I must say that it did have that \"Lifetime Channel\", feel about it. 7/10 stars",
         "Here we have a story that starts slowly but develops into a tense emotional drama. Michelle Pfeiffer is not only nice to look at but she plays the role of a frantic mother in search of her abducted 3-year old with great passion and at times hysteria. Whoopi Goldberg who plays the part of top policewoman in charge of investigation gives a moving sympathetic performance. What I greatly admire in this actor is the clear enunciation of her speech. I missed not a word delivered with clarity and depth of meaning. The film explores the feelings of children and parents caught up in the problems associated with child adoptions. Where does this baby belong: with his biological mother or his adopted father? It's an interesting film because the problem is real and with us to-day. The ending may surprise you.",
         "Well made, superbly acted film about a family who faces the loss of a loved one to a kidnapping. He appears 9 years later, but he feels foreign to the family he once knew. Pfeiffer delivers one of his strongest, most deeply passionate performances as the emotionally torn mother of the missing child and she is complimented by Williams (his best in years), Jackson as a troublesome elder son and Goldberg, in a pivotal role as the detective who helps find the family's boy. The pacing is just right and the performances make you grab for the tissues at the pleasant ending.",
         "Beth Cappadora (Michelle Pfeiffer) is at her high school reunion when her 3-year-old son disappears from his brother's care. The little boy never turns up, and the family has to deal with the devastating guilt and grief that goes along with it. Nine years later, the family has relocated to Chicago. By a sheer fluke, the kid turns up, living no more than two blocks away. The authorities swoop down and return the kid to his biological parents, but things are far from being that simple. The boy grew up around what he has called his father, while his new family are strangers to him; the older son, now a teenager, has brushes with the law and behavioral problems. His adjustment to his lost brother is complicated by normal teenage churlishness, and the dad (Treat Williams) seems to expect everything to fall into place as though the family had been intact all along. It's a tightrope routine for actors in a story like this, being careful not to chew the scenery while at the same time not being too flaccid or understated. For the most part, the members of the cast deal well with the emotional complexity of their roles. Though the story stretches credulity, weirder things do happen in the real world. The family's pain for the first half of the film is certainly credible, though the second half almost seems like a different movie. Whoopi Goldberg plays the detective assigned to the case; casting her is a bit of a stretch, but she makes it work. All in all, a decent three-honky movie in the vein of Ordinary People.",
         "At first impression, The Deep End of the Ocean can be a story of a mother's courage and all that, and it looks that there's no other way the movie can be but go sappy and mushy. Moreover, it will give anyone who has a rather not-too-good relationship with their mothers a gnawing amount of guilt. But screenwriter Schiff's take on the Mitchard bestseller and director Grosbard's restraint steers the movie away from the hackneyed themes substantially, though not totally. SPOILER ALERT The movie opens with mother Beth Cappadora (Michelle Pfiffer) going to Chicago for her high school reunion with her two children, Ben and Vincent. Ben gets lost in the hotel's crowded lobby. Even with the help of police and detective Candy Bliss (Whoopi Goldberg), Beth and her husband Pat (Treat Williams) are not able to find Ben. While everything around her starts to get on with life, Beth languishes in guilt, anger and grief. She retreats into days of sleep and pills. Her social contacts remain confined with her husband and relatives though most ends in anger and resentment. In the process, she misses much of other things, and one casualty is Vincent (Jonathan Jackson) who becomes a teenager harboring resent ment against her. As life is beginning to go on--Pat opens an Italian restaurant, the youngest child Kerry is growing and they move to Chicago--Beth suddenly meets Ben (Ryan Merriman) after nine years. He has been raised by an adoptive father George (John Kapelos), goes by the name and has no memory of his real family. Here starts the crux of the film, revealing to us the pain and complications of Ben's integration. Different emotions beef up this part of the film: joy, disorientation, sibling rivalry, anger, etc. Here the film widens its emotional focus to include Vincent who develops his own take on the situation. Ben, on the other hand, doesn't do well with the Cappadoras, missing his adoptive father and running away at nights to sleep on his own bed. Eventually, Beth comes to realize that they are really giving the boy pain rather than being his shelter. She decides to give him back to George. But eventually Ben comes back and makes a reconciliation with Vincent Though, the film effectively plumbs the appropriate pathos and the meaning of family, it however decides on a snappy resolution effected more by a story's need for conclusion than a desire to depict life's process, which takes a rather long and quirky closure. Overall, Deep End's emotional dose is superbly measured, thus coming out effectively poignant, but not totally convincing. Let's tackle its poignant power. Besides the movie's innate tearjerking quality, Grosbard's manipulations do not fall into the sentimental pits, even though the movie is very similar to a better-quality television movie or special. The direction is what you call sober, that is serious in its intention in spaying out lives torn apart by emotionally turbulent events and not in desperately tugging the audience's emotional chord, playing with their feelings and excruciatingly coaxing tears. His style remains devoid of florid qualities, thus not impressing the audience with startling visuals, momentous scenes and high-grade effects. Thus, nothing is impressed into the viewer's mind visually, but it serves effectively the film's purpose of straightforward telling. Schiff, who was a film critic in Vanity Fair before turning to writing screenplays, adapted his screenplay from Mitchard's novel of the same title. He tries to portray and beef up as many characters in the movie as possible from the father to the delinquent son, which is okay, only these showings of characters and their interests and backgrounds do not do a lot for the film's focus and do not really contribute with the film's organic unity. At best, they are mere appendages. With these efforts, however, he fails to show the adoptive father's side adequately and to think, he strikes me as a most sympathetic character besides Beth Cappadora, the mother and the kidnapped son. Thus, we have this feeling of fullness after watching the film although he sense that there's something lacking we cannot put our finger into. Most probably it is, and it maybe very well is, the film's failure to completely convince. There are certain details left along the trail that is undisclosed and it can be tedious to enumerate. But we tend not to notice because they do not rankle, but still they left marks. And then caps that trail with a end dead. Because the movie must stop at one point, and Deep End does it and rather too neatly as to be abrupt and hurried, thus the unconvincing nature As for the actors, Pfeiffer emanates with acting brilliance, drawing us to a pain of a loss. After a couple of mother roles before this and she can very well carry on other roles that this, she is effective enough. Matching her is Jonathan Jackson who plays the delinquent son and the brother of the kidnapped-and then-found boy. He radiates with silent power in his character. Noticeable also is Goldberg, not because she steals the limelight, but because of her sparing appearance. The filmmakers likely know of her capacity to overwhelm and keep her at bay. Deep End is drama that can be a powerful drama, which is effectively played up but not to the extent brilliance."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Columbia Pictures Corporation",
         "Mandalay Entertainment",
         "Via Rosa Productions"
      ],
      "summaries": [
         "The Deep End of The Ocean is a film about a family's reaction when Ben, the youngest son is kidnapped and then found ten years later, living in the same town.",
         "Pat Cappadora's neurotic wife Beth takes their two boys along on a class reunion annex photography mission in Chicago. She makes 8 year-old Vincent 'watch and keep pinned down' 3 year-old Ben, the acts as the sole victim when Ben goes missing. She neglects job and household utterly and keeps complaining, even over amazing neighborhood efforts to find Ben, all in vain. In the process, neglected Vincent, who helped pa raise his youngest sibling in her place, embitters and starts going astray. Nine years later, Pat moves them to Chicago to set up a new restaurant in Chicago. By chance, a boy almost next door, Sam Karras, is identified as Ben, kidnapped by his late ma and lovingly raised by her husband George Karras. Both families are now upset to the core repeatedly.",
         "The Deep End of The Ocean is a film about a family's reaction when Ben, the youngest son is kidnapped and then found nine years later, living in the same town, where his family had just moved."
      ],
      "budget": 40000000
   },
   "movielensId": 2546,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-03-12",
      "dvdReleaseDate": "1999-08-10",
      "directors": ["Ulu Grosbard"],
      "runtime": 106,
      "movieId": 2546,
      "title": "The Deep End of the Ocean",
      "mpaa": "PG-13",
      "actors": [
         "Michelle Pfeiffer",
         "Treat Williams",
         "Whoopi Goldberg",
         "Jonathan Jackson",
         "Cory Buck",
         "Ryan Merriman",
         "Alexa PenaVega",
         "Michael McGrady",
         "Brenda Strong",
         "Michael McElroy",
         "Tony Musante",
         "Rose Gregorio",
         "John Kapelos",
         "Lucinda Jenney",
         "John Roselius"
      ],
      "imdbMovieId": "0120646",
      "originalTitle": "The Deep End of the Ocean",
      "genres": [
         "Drama",
         "Mystery"
      ],
      "youtubeTrailerIds": ["mWa7nDm9Wdg"],
      "plotSummary": "Michelle Pfeiffer is ferocious in the role of a desperate mother whose 3-year-old son disappears during her high school reunion. Nine years later, by chance, he turns up in the town in which the family has just relocated. Based on Jacquelyn Mitchard's best-selling novel (an Oprah book club selection), the movie effectively presents the troubling dynamics that exist between family members who've suffered such an unsettling loss.",
      "tmdbMovieId": 30943,
      "avgRating": 3.00494,
      "releaseYear": "1999",
      "numRatings": 1114,
      "posterPath": "/iUBMUUqBMPRQ7fCOtCsmBaFBPCB.jpg"
   }
}