{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0125778",
      "video": false,
      "title": "Harvest",
      "recommendations": [],
      "backdrop_path": "/el2OsR5Nl6Lb8ev49GcWXKAVk8b.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a8bc3a36847f81d44f7",
               "name": "Jeffrey DeMunn",
               "profile_path": "/n47DHl1RFfSEKUvL0MKGKwrL71S.jpg",
               "id": 12645,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a8bc3a36847f81d44fb",
               "name": "John Slattery",
               "profile_path": "/53hxIYkC93E1FEkqOvAHRgRIxXX.jpg",
               "id": 21134,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a8bc3a36847f81d44ff",
               "name": "James Van Der Beek",
               "profile_path": "/gcytCvmikcg8BEVg7GyINmnsF7I.jpg",
               "id": 19210,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a8bc3a36847f81d4503",
               "name": "Frederick Weller",
               "profile_path": "/eeyLI8ED2CQIm31WNj04szabJAF.jpg",
               "id": 143017,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4a8bc3a36847f81d4507",
               "name": "Mary McCormack",
               "profile_path": "/et3POqgfLTA1tNXr7nWvsIMejsw.jpg",
               "id": 1980,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a8bc3a36847f81d450b",
               "name": "Wil Horneff",
               "profile_path": "/uwUoJ5CMObTRMxaF0GsOPtyCqIQ.jpg",
               "id": 171243,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4a8bc3a36847f81d450f",
               "name": "Julianne Nicholson",
               "profile_path": "/iXjSXsYpb8GAehnLPKX74eXZE6H.jpg",
               "id": 86034,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4a8bc3a36847f81d4513",
               "name": "Paula Garcés",
               "profile_path": "/bc1NhQCaUsoJFCi6vIGxiljQl86.jpg",
               "id": 21124,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4a8bc3a36847f81d4517",
               "name": "Lisa Emery",
               "profile_path": "/oKn0KGgb7KOoz7UHZv8WtQG1ba3.jpg",
               "id": 59201,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4a8bc3a36847f81d451b",
               "name": "Josh Lucas",
               "profile_path": "/gv7jI1SZLRXRVJnNGOS1zK6yWB.jpg",
               "id": 6164,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a8bc3a36847f81d44e1",
               "name": "Stuart Burkin",
               "profile_path": null,
               "id": 1196937,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a8bc3a36847f81d44e7",
               "name": "Jim Biederman",
               "profile_path": null,
               "id": 1196938,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a8bc3a36847f81d44ed",
               "name": "Stuart Burkin",
               "profile_path": null,
               "id": 1196937,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a8bc3a36847f81d44f3",
               "name": "David M. Korn",
               "profile_path": null,
               "id": 1196939,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.001266,
      "production_countries": [],
      "id": 107946,
      "vote_count": 0,
      "budget": 0,
      "overview": "A DEA agent and a local sheriff have to wrestle with their consciences as they start raids on local farmers, who have started growing marijuana simply to keep their farms operational. Story focuses on a young man, who accidentally discovers that his straight-laced parents are involved in the marijuana cultivation.",
      "similar": [],
      "original_title": "Harvest",
      "runtime": 96,
      "poster_path": "/lyNbqutrWk3P2mw2IDakgZoxOlW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-01-09",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Stuart Burkin"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "Jim Biederman",
         "Stuart Burkin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0125778/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3NTM3NzQ0N15BMl5BanBnXkFtZTcwOTA2NjAzMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Arthur J. Nascarella, Stephen Earnhart, Evan Handler | See full cast and crew »"],
      "reviews": [
         "I got to see this film because my friend wanted to see Dawson Creek stoned. She got what she wanted, the dude was in the movie for about two scenes he was high as a kite. But the movie isn't about that and it's not a stoner comedy as the ads make it out to be. This actually turned out to be the best movie that friend rented in a while, though that's not saying much. It's a drama about small town farmers who decide to grow marijuana to survive in troubled times. The best part of the film was the storylines involving the farmers themselves and the local Sherriff and DEA agent. Those storylines are realistic and provide interesting motivations and insights about marijuana production and the role of law enforcement. These farmers are not bad people and, while they may be a little naive, they are simply trying to survive when they're only other option would be losing their farms. While the DEA agent offers by the books interpretation of what they do, the Sherriff is conflicted because he knows why they are doing it and he wonders if a big pot bust would be bad for the small town's psyche. The film bogs down with the story of the farmer's son, an innocent and earnest Will Horneff. This isn't a pro-legalization film, if anything the Horneff character is the moral voice of the film. His character is angry about his parents growing weed not because he's afraid of their well-being with the DEA sniffing around, but because he believes it's simply a bad thing to do, even though he hangs around kids who smoke it all the time. His intolerance grows as it get's closer to home. Even though much of the film tries (and succeeds) to be even-handed about the issue, in the end it has a pretty clear anti-weed stance. All the characters who do smoke weed are jerks. The dealers are jerks, even the sexist brother of the cute candy-striper. The only characters involved with it with any redeeming value in the film are the farmers, and of course, they are just doing it to survive. This is somewhat disappointing, whether or not it was a case of the film-makers not havingenough guts to remain neutral or it was the film-makers asserting their point of view. The film is strongest when it is neutral, but the fact that in the end the film isn't neutral doesn't kill it.",
         "The DEA agent's name, Anslinger, is a nice inside joke - this is the name of the former drug czar who almost single-handedly made marijuana illegal. Despite this bit of book knowledge, the writers go on to have the farmers harvesting and selling fresh undried leaf, rather than cured buds. Additionally, I always find it amusing that movie makers never seem to be able to find real marijuana plants for filming. You would think there would be a business that would make real looking fake ones for the movie business or maybe they could film a couple of scenes in Amsterdam or Switzerland. I suppose that's asking too much for the budget. Probably the most interesting thing about the film is the attempt to cover the notion of exactly what is right and what is wrong in society and how the law treads that line and yet tries to do justice in spite of it.",
         "(Spoilers) \"Cash Crop\" goes something like this. Down-on-their-luck farmers grow pot to make ends meet. DEA agent blows into town. Farmers hide the pot. DEA agent leaves town. End of story. This flick features solid performances by some second tier actors, mediocre direction, and a so-so screenplay...but it ain't got no story. And since the story is the foundation of every drama, \"Cash Crop\" is an utter failure. Too boring to recommend.",
         "Funny how people \"upholding the law\" can justify what laws they choose to follow. This movie has a lot of truth. How many people do you see throwing their cigarette butts out the window of the car? Isn't there a law against littering? And isn't tobacco a drug? Also interesting how \"Big Business\" makes laws that benefit them, and then uses marketing to convince the farmer to borrow money, then starves him out, takes his land, and forces him to get a factory job which makes stuff so Big Business can sell it back to them and take more of their money. I think it's funny when the DEA agent gets sick from eating the non-processed food that is grown organic by the same farmers she is trying to arrest. I thought the writers made their point very well. Everyone should watch this movie and wake up to what is happening to the farmland. Urban sprawl is a self-serving industry. In the immortal words of Ray Zalinsky, `What the American public doesn't know is what makes them the American public'. WAKE UP people! And check out `GRASS'.",
         "I'm a fan of farmers but this mass-media notion that farmers are losing their shirts doesn't hold water in the real world. Unless they are VERY stupid, there are so many federal subsidies available, along with other programs, that farmers would never even consider growing pot. Plus, as pointed out by others, to just pick fresh plants and throw them into a garbage is not the way pot is sold (or so i've been told. Nod, nod, wink wink.) The movie itself is shallow, the characters ridiculous.",
         "I caught this on Cinemax very late at night...nothing else was on so I pretty much had no choice. Bottom line, terrible plot, slow, waste of good film and actors' time. To make it short, don't even bother with this one. It's too bad we can't give zeros as a rating; this one really is not worth even a consideration!!!"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Goldheart Pictures"],
      "summaries": ["A DEA agent and a local sheriff have to wrestle with their consciences as they start raids on local farmers, who have started growing marijuana simply to keep their farms operational. Story focuses on a young man, who accidentally discovers that his straight-laced parents are involved in the marijuana cultivation."],
      "budget": 0
   },
   "movielensId": 2547,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-01-09",
      "dvdReleaseDate": "2001-10-23",
      "directors": ["Stuart Burkin"],
      "runtime": 96,
      "movieId": 2547,
      "title": "Harvest",
      "mpaa": "",
      "actors": [
         "Jeffrey DeMunn",
         "John Slattery",
         "James Van Der Beek",
         "Frederick Weller",
         "Mary McCormack",
         "Wil Horneff",
         "Julianne Nicholson",
         "Paula Garcés",
         "Lisa Emery",
         "Josh Lucas"
      ],
      "imdbMovieId": "0125778",
      "originalTitle": "Harvest",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A DEA agent and a local sheriff have to wrestle with their consciences as they start raids on local farmers, who have started growing marijuana simply to keep their farms operational. Story focuses on a young man, who accidentally discovers that his straight-laced parents are involved in the marijuana cultivation.",
      "tmdbMovieId": 107946,
      "avgRating": 2.78571,
      "releaseYear": "1999",
      "numRatings": 21,
      "posterPath": "/lyNbqutrWk3P2mw2IDakgZoxOlW.jpg"
   }
}