{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "alcohol",
            "id": 567
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "supernatural powers",
            "id": 4769
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "orphan",
            "id": 13014
         }
      ],
      "imdb_id": "tt0057129",
      "video": false,
      "title": "The Haunting",
      "recommendations": [
         16372,
         31417,
         16180,
         25508,
         931,
         28043,
         11167,
         229,
         16093,
         11868,
         25319,
         27632,
         11773,
         28501,
         1939,
         13550,
         16307,
         10787,
         13581,
         27130
      ],
      "backdrop_path": "/tYr2PmqHGXgpHs50gQnPYamFC3w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Eleanor 'Nell' Lance",
               "gender": 1,
               "credit_id": "52fe44829251416c7503742d",
               "name": "Julie Harris",
               "profile_path": "/6NMUZcW1lwSgxaPnANIsmEuYLiF.jpg",
               "id": 2750,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Theodora 'Theo'",
               "gender": 1,
               "credit_id": "52fe44829251416c750373f7",
               "name": "Claire Bloom",
               "profile_path": "/4x0Cfh1g8apqOPio8AJx9oUV9mK.jpg",
               "id": 29545,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dr. John Markway",
               "gender": 2,
               "credit_id": "52fe44829251416c750373fb",
               "name": "Richard Johnson",
               "profile_path": "/miDA5sN3ijfED6M4oRZ0NTdBfBR.jpg",
               "id": 20510,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Luke Sanderson",
               "gender": 2,
               "credit_id": "52fe44829251416c750373ff",
               "name": "Russ Tamblyn",
               "profile_path": "/eSVSJvOR18dTgLRkeOqRYd6ew31.jpg",
               "id": 6725,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Mrs. Sanderson",
               "gender": 1,
               "credit_id": "52fe44829251416c75037431",
               "name": "Fay Compton",
               "profile_path": "/mRUOqVsfufXejXWqFfR4IXdEg9h.jpg",
               "id": 131449,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Mrs. Dudley",
               "gender": 1,
               "credit_id": "52fe44829251416c75037435",
               "name": "Rosalie Crutchley",
               "profile_path": "/3GeycPOd4LHV1tSaRErb8tHT67q.jpg",
               "id": 39001,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Grace Markway",
               "gender": 1,
               "credit_id": "52fe44829251416c75037439",
               "name": "Lois Maxwell",
               "profile_path": "/uQneO3fT5H7vmjxusi3lJmm3xT3.jpg",
               "id": 9878,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Mr. Dudley",
               "gender": 2,
               "credit_id": "52fe44829251416c7503743d",
               "name": "Valentine Dyall",
               "profile_path": "/mc1iqiiah72TBQwhjU33mKpz5Mh.jpg",
               "id": 47480,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Carrie Fredericks",
               "gender": 1,
               "credit_id": "52fe44829251416c75037441",
               "name": "Diane Clare",
               "profile_path": "/47DPimtMoHRFkHqTOJnH5WIn6c.jpg",
               "id": 102661,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Eldridge Harper",
               "gender": 2,
               "credit_id": "52fe44829251416c75037445",
               "name": "Ronald Adam",
               "profile_path": "/mD8zf8SdsreKNW6lN2hmtG1hBRA.jpg",
               "id": 104302,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Children (voice)",
               "gender": 1,
               "credit_id": "5ab8629bc3a3680a49028a9a",
               "name": "Debi Derryberry",
               "profile_path": "/mfmF3MjoL7sV76BSElFkVgDgA30.jpg",
               "id": 73016,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44829251416c75037405",
               "name": "Robert Wise",
               "profile_path": "/6EPkRgYsDMQOYmE9s1vZt2O470R.jpg",
               "id": 1744,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44829251416c7503740b",
               "name": "Robert Wise",
               "profile_path": "/6EPkRgYsDMQOYmE9s1vZt2O470R.jpg",
               "id": 1744,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44829251416c75037411",
               "name": "Shirley Jackson",
               "profile_path": null,
               "id": 70038,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe44829251416c75037417",
               "name": "Nelson Gidding",
               "profile_path": null,
               "id": 19459,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44829251416c7503741d",
               "name": "Humphrey Searle",
               "profile_path": null,
               "id": 70443,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44829251416c75037423",
               "name": "Davis Boulton",
               "profile_path": null,
               "id": 70444,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44829251416c75037429",
               "name": "Ernest Walter",
               "profile_path": null,
               "id": 11124,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 9.75284,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11772,
      "vote_count": 192,
      "budget": 0,
      "overview": "Dr. Markway, doing research to prove the existence of ghosts, investigates Hill House, a large, eerie mansion with a lurid history of violent death and insanity.",
      "similar": [
         91586,
         201085,
         138843,
         11601,
         19592,
         620,
         65086,
         2252,
         1586,
         77949,
         65754,
         210577,
         565,
         75174,
         39939,
         21208,
         242512,
         243688,
         745,
         401898
      ],
      "original_title": "The Haunting",
      "runtime": 112,
      "poster_path": "/eUdYY4saosBCzonPsr2y4y1LjIt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Argyle Enterprises",
            "id": 6305,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1963-09-18",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "You may not believe in ghosts but you cannot deny terror",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Robert Wise"],
      "runtime": 112,
      "synopsis": "The 1963, Robert Wise directed version, opens with narration over a silhouette of Hill House at night. The narrator, Dr. John Markway (Richard Johnson) tells us, \"An evil old house, the kind some people call haunted is like an undiscovered country waiting to be explored. Hill House had stood for 90 years and might stand for 90 more. Silence lay steadily against the wood and stone of Hill House. Whatever walked there walked alone.\" Title and credits follow, then narration continues, \"Scandal, murder, insanity, suicide: The history of Hill House was ideal. It had everything I wanted...\" The house was built in New England by a man named Hugh Crain for his wife and young daughter. A horse and carriage accident took the life of the first Mrs. Crain (an uncredited Pamela Buckley) before she even saw the house. Hugh Crain (an uncredited Howard Lang) and young daughter, Abigail (an uncredited Janet Mansell) said a few words over the body, but Hugh was left an embittered man. Crain married again, and the second Mrs. Crain (an uncredited Freda Knorr) also died, falling down the main staircase. Hugh Crain left Abigail with a nurse (an uncredited Susan Richards) and went to England where he died in a drowning accident. Abigail kept the same nursery room her entire life. By the time she was eighty (an uncredited Amy Dalby) she was a bedridden invalid. Her nurse-companion (an uncredited Rosemary Dorken) was a local girl and, it is with this young companion the evil reputation of Hill House really begins. The old lady died while calling for help. The companion was trysting on the verandah with a farm hand. The companion inherited Hill House and occupied it for many years, but eventually hanged herself. The house then passed to a distant relative, Mrs. Sanderson (Fay Compton). Markway convinced Mrs. Sanderson to let him use the house for psychic research. He explains, \"I shall occupy the house with a group of carefully selected assistants...I must have specially qualified help to take notes and document any evidence of the supernatural I may find.\" Eldridge Harper (Ronald Adam), Mrs. Sanderson's lawyer, voices his concern about publicity seekers and the propriety of having women in the house. Harper suggests to Mrs. Sanderson that her nephew, Luke, joins the doctor at Hill House, as he expects to inherit the property. Mrs. Sanderson asks point blank, \"Exactly what do you and your assistants expect to find at Hill House?\" Markway replies, \"Maybe only a few loose floorboards, and maybe, I only say maybe, the key to another world.\" Dr. Markway, taking a leave of absence from his university professorship, finalizes his list of assistants. Only two end up accepting, Eleanor Lance and Theodora (no last name). Eleanor Lance (Julie Harris) is living with her sister. She is nearly broke and weary after looking after her invalid mother non-stop for eleven years. Mother is now dead, and she fights with her sister over just about everything. She begs to use the car, which is after all, half hers. Her brother-in-law, Bud Fredericks (an uncredited Paul Maxwell) tries to act as mediator between Eleanor and his wife, Carrie (Diane Clare). He is sympathetic to Eleanor's plight, but their daughter, Dora (an uncredited Verina Greenlaw) takes her cues from her mother, and taunts her Aunt Eleanor. On the vacation plan, Bud sides with Eleanor, \"I think you should have a vacation, Nell.\" Carrie objects, but Eleanor is not to be deterred and she shows her family how she reacts when pushed to her breaking point. She is normally quiet and meek, but when pushed is loud and assertive. Nell decides to take the car and confronts the garage attendant (an uncredited Claude Jones) for the keys. She departs Boston along U.S. 50 and Route 238 to Hill House. We hear Nell thinking and she reveals she will never return to live with her sister. In fact, most of what we learn of Eleanor is hearing her thoughts. Eleanor arrives at Hill House. The property is surrounded by a stone wall and the entrance by a tall, iron spiked, gate. She honks the car horn, and Mr. Dudley (Valentine Dyall), the caretaker, finally deigns to respond. \"What do you want?\" he asks. Eleanor explains that she is expected. After an impertinent exchange with Eleanor, Dudley finally opens the gate and allows her to enter the property. Eleanor is the first to arrive and drives up to the house. Along the way she stops to look at it. It is a huge, stone mansion with lots of detail on the façade and steep, pitched roofs. Her first reaction is that the house is vile and it is staring at her. She carries her suitcase to the front door and is greeted by Mrs. Dudley (Rosalie Crutchley). Mrs. Dudley reluctantly allows Eleanor to come inside, but does not utter a word to her. The inside of the house is dark and over-decorated, and Eleanor is escorted to her room. Mrs. Dudley explains the house rules about meals, and that she won't stay in the house after dark. Eleanor checks out the bathroom and hears the next guest arrive. Theodora (Claire Bloom) introduces herself. Eleanor explains they share a bathroom. Mrs. Dudley repeats her meal and departure rules by rote, but Theo and Nell ignore her. Theodora is a bit strange, her sexual orientation is only hinted at, and we later learn she has the gift of ESP. Theo and Nell explore the house, but they get lost. Both women feel a chill, and Nell observes, \"The house, it's alive.\" Theo seems to feel that the house wants Nell. Dr. Markway appears and explains he left the door opened, but it closed itself. Markway gives the women a tour of part of the house, starting with the main purple parlor, which they will use as an operations center. He explains that all the doors were set slightly off-center, so they close themselves. Despite studying plans to the house, even Markway gets lost on his way to the dining room. They hear a noise, but it turns out to be Luke Sanderson (Russ Tamblyn) mixing a pitcher of martinis as he enters the dining room. Luke serves each person a martini. They sit down for dinner and discuss their duties and responsibilities. Markway explains that Theo was accepted because of her remarkable power of ESP and Eleanor had a poltergeist experience as a child, \"showers of stone fell on your house for three days when you were 10 years old.\" Luke is a non-believer. His interest is to financially exploit Hill House, after he inherits it, of course. That evening, in the parlor, Markway works on his notes while Eleanor sits quietly on the couch. Theo and Luke play gin rummy at the game table. Theo's ability to see cards allows her to win five games in a row, much to Luke annoyance. She demands he pay her the $12 he owes, but he refuses because she cheated. The four decide to turn in for the night and continue the tour the next morning. Markway gives them papers and asks that they complete them with their observations each night. Sometime during the night, Eleanor wakes, and still in a near dream state, thinks she hears her mother knocking on the wall. Theo hears it from the next room also and calls to Nell. The two women are frightened and both hear the pounding noise. It comes and goes, but louder each time. They finally hear a woman shrieking and laughing that fades away. When Nell opens the door she sees Luke and Markway in the hall outside. The men explain they were chasing a dog and followed it outside, but they did not hear the loud noises the women heard. Markway concludes that something is trying to separate the men and women. The next morning, Markway and Nell join for breakfast. Nell is starting to develop romantic feelings for John Markway, unaware that he is married. She volunteers that she spent eleven years taking care of her invalid mother. Nell also voices her fear that she will be turned out of Hill House with no where to go. Markway tells Nell how he came to do psychic research, and that his family disapproves. Theo joins the pair and warns the doctor, \"If anyone gets hurt, it's going to be your fault, Markway.\" Markway explains that no one has ever been physically hurt by a ghost. Luke enters and directs his companions to something he saw in the hall. Someone or something has handwritten a message in chalk on the wall. It says, \"Help Eleanor Come Home.\" Eleanor reacts strongly. She first accuses Theo of playing a cruel joke. The two women bicker and Markway postpones the tour and tells Theo to take Eleanor to her room. The tour starts with the greenhouse. A large stone sculpture sits in the center of the room. It is supposed to be St. Francis curing the lepers, but Luke thinks its a family portrait of Hugh Crain and his wives and daughter. Suddenly the door slams open and a gust of wind moves the plants. They approach the library, but Nell refuses to enter. The smell reminds her of her mother's sick room. Prominent in the room is a very tall, wrought iron, spiral staircase. Markway points out that the balcony high above is where the companion to Abigail Crain hanged herself. Luke climbs up a few feet on the staircase, but jumps back to the ground when it starts to sway and shake. Eleanor ventures out to the verandah and nearly falls over the balcony as she looks up to the tower above the library. Markway threatens to send her home, but Nell begs to stay. Markway suggests Theo and Nell share a bedroom, like sisters. The women discuss their lives and plans for the future. Nell makes up a story about having an apartment of her own. Markway calls the other three into the hallway outside the Nursery. He has discovered a cold spot. He invites all to experience the phenomenon. He gleefully explains, \"A cold spot, a genuine cold spot. I guarantee it won't register on any thermometer.\" Luke dismisses it as just a draft, but Markway says it is the heart of Hill House: The Nursery. In the middle of the night, Nell awakens. She hears a little girl laughing. She asks Theo to hold her hand, as their two beds are almost touching. The laughter continues and Nell complains, \"Theo, you're breaking my hand.\" The laughs turn to wimpering and Nell complains that something is hurting a child and she won't allow that to happen. She yells, \"Stop It!\" Theo turns on the light and we see Nell is on a day bed about twenty feet from the bed Theo occupies. Nell stares at her hand and asks, \"Whose hand was I holding?\" Markway is in the music room and checks his watch and makes a note about the harp playing itself. Nell enters the room and asks about how it could play itself. Markway explains that it may be preternatural: Something we don't have any natural explanation for right now, but probably will have some day. Nell voices her fear that it is all in her imagination and concludes she may be going insane. She is haunted by the circumstances of her mother's death and that she may somehow be responsible. They both hear the harp play a note and Markway again checks his watch and makes a note in his paperwork. Luke finds a disturbing book that Hugh Crain made for his daughter, Abigail. Nell and Theo bicker and Markway notes that everyone's nerves are on edge. Theo continues to needle Nell, this time about a budding romance she fantasizes about with John Markway. Nell accuses Theo of being, \"Unnatural things. Nature's mistakes they're called. You, for instance.\" At that moment, a car horn honks and a taxi pulls up in front of the house. Grace Markway (Lois Maxwell), John's wife, arrives. She informs her husband, \"A reporter's been telephoning all day. He's on your track. He's heard about you renting this place.\" Grace begs her husband to abandon the house and his research. When John refuses, Grace pays the driver, grabs her suitcase and announces she is staying at Hill House, \"to join the ghost hunt.\" When Eleanor casually mentions the nursery as a place to stay, Grace quickly accepts the challenge, \"Thank you, my dear. The nursery it is.\" Markway and Nell try to dissuade her, but Grace responds, \"You insult my intelligence. You don't think I'd believe anything you ghost hunters might tell me.\" Luke notices the door to the nursery is open for the first time. Grace decides to spend the night in the room, despite everyone's warning not to. Markway insists he and the three researchers spend the night downstairs in the parlor. Nell and Theo sleep by the fireplace as Markway sleeps in a chair. Luke finishes his tour upstairs and enters the parlor. He heads for a bottle on the mantle. The door slams shut and the others wake with a start. They hear a deep rhythmic banging outside the door. Markway is concerned about his wife upstairs. Next a very loud banging comes from just outside the door. The door bows inward and out like breathing, creaking and crunching against the hinges. The sound moves to overhead towards the nursery. Markway is desperate to check on his wife. Unseen, Nell runs from the parlor, through the music room, and upstairs directly to the nursery room. The doors are open, but Grace Markway is nowhere to be seen. Her bed shows signs of being used. Markway and the others arrive and start the search. Nell wanders away. She finds herself in the greenhouse. Descending into her own little world, Nell dances out onto the verandah. When she hears the others calling to her, Nell runs into the Library. She is drawn to the spiral staircase and the balcony at the top. Before she reaches the top, the rickety staircase begins its swaying, the lateral support bolts pulling away from the wall. Markway calls to her, begging her to carefully walk back down. She ignores him and stands on the balcony. Markway carefully climbs the stairs and joins Nell on the iron balcony platform. Before they walk back down, Nell sees Grace Markway peer at her through a trap door in the ceiling. Markway is furious and now insists Eleanor leave the house for her own safety. Luke brings her car around and Theo packs her bag. Nell tries to talk them out of her dismissal, but the three insist she leave. They escort Eleanor out to her car. Luke gets back out of Nell's car to retrieve the gate key from Markway. She drives off without Luke. Before she reaches the gate she is distracted by the white-robed figure of Grace Markway and crashes into a tree. The three find Eleanor dead in the half overturned car. She crashed into the same tree that killed the first Mrs. Crain. Grace wanders over to the accident scene. She explains to her husband, \"I didn't want any of this to happen. You must believe me, John.\" She explains that she woke and was frightened. She got lost looking for her husband and ended up in the attic. While Theo blames Grace for Eleanor's accident, Luke takes a different view. \"Eleanor did it to herself. It looked to me, anyway, like she deliberately aimed the car at this tree.\" Markway blames the house. Luke stares at the house and remarks, \"It ought to be burned down and the ground sowed with salt.\" We close with an evening shot of Hill House and the end title.",
      "writers": [
         "Nelson Gidding",
         "Shirley Jackson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057129/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4NDk5ODA4OF5BMl5BanBnXkFtZTcwOTg3MDAwMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Julie Harris, Claire Bloom, Richard Johnson | See full cast and crew »"],
      "reviews": [
         "THE HAUNTING(1963) is an important horror film because it is one of a tiny handful of films within the tradition that genuinely unsettle the viewer. Are the events at Hill House for real, or are they happening on the inside of Eleanor Lance's head? The author of the novel upon which this movie was based, Shirley Jackson, left us to wonder at the end of her story. A constant theme in Jackson's work was the displacement and the destruction of the hopes of women (Most of her work was written in the 1940s and 1950s). Jackson, in her own intriguingly artful manner, asks us in The Haunting of Hill House to contemplate the domestic prison that many women like Eleanor Lance found themselves in. Eleanor is a spinster, the slightly dotty older sister compelled by restrictive family relationships to care for an ailing mother. She's been nowhere, she has had no experiences, and she barely has social skills. Like anyone else, she wants love, intimacy, friendship, and she doesn't know how to seek them. Naturally, she operates from a place of low-key fury. Julie Harris conveys this so successfully in the film that she actually bounces the viewer between feelings of empathy and feelings of exhaustion. \"Why doesn't she make up her mind to go or stay?\", we ask ourselves. Eleanor isn't an attractive person, and Julie Harris plays this to the \"t\". THE HAUNTING explores Jackson's extended metaphor of feminine anger damn near as skillfully as the author presented it on the page. Certainly whatever \"walks alone at Hill House\" is not such a distant cousin from the Corn Goddess, or other archetypal representations of the understandable rage of women whose lives have been restricted by domestic roles. But how much of it genuinely resonates from that house with its \"doors that stay sensibly shut\", and how much of it is between the ears of Eleanor Lance, who, even in a crowd, is walking alone, just as is whatever is in Hill House? In creating this book, Shirley Jackson was able to breach the same territory the 19th century feminist Charlotte Perkins Gilman explored in her remarkable story The Yellow Wallpaper. And it is no small thing that the cast of The Haunting- Julie Harris and Claire Bloom foremost- were able to recreate on the screen and do this complex novel such justice. Director Robert Wise, who fifteen years before gave us the Val Lewton masterpiece THE BODYSNATCHER, labored diligently to establish the same stifling atmosphere found in that earlier film. Patterns in wallpaper that vibrate with voice, doors that breathe, and that steady, horrific hammering on the walls that chills as certainly as did Jackson's description in the book itself. Certainly Rus Tamblyn and Richard Johnson do more than pull their weight in this piece, and it couldn't have been easy to play second line to talents like Harris and Bloom. The cast, the direction, the set, everything works in this movie, a remarkable work of harmonic convergence on celluloid. THE HAUNTING is an important film to see because it does what horror films rarely do, it freely explores the internal and takes us all along, and babies, we ain't laughing. But it works. And that's more than can be said for three quarters of the over-hyped movie offerings in the horror tradition. Among U.S. horror films of the 1960s, only PSYCHO and ROSEMARY'S BABY touch so boldly on the unspoken terror in the horror film:a common fear among our spieces that we may be unworthy of love. Are we talking frightening now?",
         "After watching \"The Haunting\" 1963, I slept with my hands under the covers for 3 weeks. I was alone in the house, very late at night. Every sound amplified.. I was a full grown woman. For Pete's sake, I have watched almost every monster movie made. Even the original \"Wolfman.\" Hummm, I could handle this. Wrong! I have never been so frightened in my life. Who or What was holding her hand??... The door at the top of the spiral stair almost gave me a stroke. This movie made a believer out of me. The sound effects, the lighting, the \"breathing door\", plus the fact it was Black and White.. The house, well don't ask me to attend a dinner party there. You will be eating alone. Perfect movie for Halloween. I give this movie a \"10\", The \"remake\" ?? Was that from the same book? Nuff Said.",
         "ABC broadcast this film as a Sunday Night Movie in, I believe, 1965. I watched it with my best friend at his house, which happened to be next door. After the movie was over I was afraid to walk home. Thirty eight years later, this movie is still the scariest movie I've ever seen. It's hard to put into words why this movie triggers such an emotional response. There is no blood and gore, no creatures or monsters in plain sight. In fact, there is very little physical presence in this movie that should evoke such a fear reaction. True, there are multiple angle exterior shots of the mansion that make one feel as if the house is watching them all the time. And there are loud unexplained noises, bulging wall panels, and door knobs that turn by themselves. All-in-all, the physical evidence is pretty tame, especially by today's standards. The fear reaction lies not in the physical form, but in the psychological sense. For example, as Theo and Nell cling to one another as wall pounding draws closer to their room, only to stop and dead silence replaces the noise. Later in the movie, Nell and Theo are again in their room when Nell grabs hold of Theo's hand as noise begins to build outside their bedroom door. Finally, unable to stand the noise any longer, Nell begins to scream which awakens Theo, who happens to be halfway across the room, and thus not close enough to be holding Nell's hand. So the question is \"who or what was Nell holding?\". There are many scenes that are similar to the above. This film was directed by Robert Wise who made me believe there was something lurking around every corner, or there was something that was going to happen, but you just didn't know quite when. This is the type of directing that has given this movie the classic status it so richly deserves. So, if you are more into the physical style of a movie, go see \"Texas Chain Saw Massacre\", but if you are ready for a genuinely scary movie, go rent or buy the 1963 version of \"The Haunting\".",
         "There is no blood, there is no slashing, today this would be rated \"G.\" But, this is the scariest movie, ever. Every time I watch this masterpiece (and I have watched it over 50 times), I see or hear something new. The density of the black and white is incredible. The camera angles and reflection shots are unsettling. The score is appropriately terrifying, from the ringing of tiny bells to the cannon ball rocking down the hall. The cast is excellent. The direction superb. This is horror at the peak of perfection--it is in your mind. The only thing better is to read the book by Ms. Jackson on a dark night when you are all alone, and \"far from town.\" As Stephen King said about Shirley Jackson, \"She never had to shout.\" Mr. Wise is to be credited with bringing her whispers to the screen. Rent this for Halloween. Or, own it forever. I still have trouble getting to sleep after I watch this.",
         "This movie is a genuine Hitchcock-esque classic. Predating modern special effects, this movie subtly maneuvers the viewer into a crescendo of paranoia. My mother introduced me to this movie when I was still very young (and since the terror is of the psychological variety, it is a strangely age-appropriate movie for youngsters who wish to see scary movies). I think that the casting, concept, and script are all brilliant. This movie does not need the glitz of Hollywood effects because there is enough cranial content to more than compensate for what most people nowadays consider necessary visual enhancements. The cast has an amazing chemistry and plausibility. I don't recommend this movie to effects-addicts. If you appreciate well-executed theatre, believable acting, using your OWN imagination, then... see for yourself!",
         "The Haunting is the best haunted house movie of all time. It is creepy as hell, packs a real sense of dread, and always leaves the shocks to the imagination. It starts with an extremely effective prologue detailing the sinister history of Hill House over it's 90 year presence, and this prologue includes some really excellently done scenes. Flash forward 90 years, and four guests are invited to stay the night at Hill House, and experience the house's hypnotic power. The main character is Eleanor (Julie Harris) who is starting to believe the house wants something from her. The Haunting is a teriffically crafted, genuinely creepy story from Robert Wise, and many elements have been used in recent films (The freezing breath in The Sixth Sense, and the ghosts only implied by strange sounds and giggles in The Blair Witch Project). Overall, this is an excellent horror movie proving you don't need special effects and gore blah blah blah... Just see the movie. 9/10.",
         "Robert Wise took the time between WEST SIDE STORY and THE SOUND OF MUSIC, two very different musicals, to direct this cult-ish film of a house gone bad which seems to have a will of its own and is looking to acquire another soul to inhabit its walls. The production is a homage to Val Lewton's less-is-more taken to the extreme. From the moment the house is introduced, there is only mounting dread and things that go bump in the night and three scenes are a standout of modern horror. The first sequence is of course, the first sequence with the relentless pounding that is slowly moving towards the rooms where Eleanor Vance and Theo -- two of the psychics chosen by Dr. Markway to assist him in his ghost hunting. All they, and we, can do is focus on that twisting, turning door knob. The second sequence is even more disturbing: Eleanor Vance is sleeping with Theo in her bedroom, and as Theo holds her hand, Eleanor spots a pattern on a wall which seems to be malevolently observing her as unintelligible rants and raves by what seems to be an old man and the whimpers of a frightened child are all she can hear. When she reacts she finds she's not even in Theo's room (or bed) anymore. The third and scariest sequence revolves around the events after the arrival of skeptical Mrs. Markway (Lois Maxwell from the JAMES BOND series) who could care less about his paranormal investigations and is staying in the nursery -- a room reputed to have a dank, cold spot. The crew huddle together, listening to the increasingly deafening pounding with a will of its own and then staring in mute horror as the door separating them from that unseen entity seems to bend inwards, in a breathing fashion. This is the most claustrophobic moment in the entire movie, full of the power to scare the wits out of anyone. (Stephen King adapted numerous elements from this movie to re-create them for his classic horror novel THE SHINING with incredible success; ergo the influence this film has on the appreciation of cerebral horror.) THE HAUNTING is excellent in establishing character instead of making its players behave like they were automated puppets meant to do the very thing that they're not supposed to. Dr. Markway (Richard Johnson) is a serious minded fellow who has a paternal approach to his assistants. Luke Sanderson (Russ Tamblyn, well cast) is a playboy, arrogant young man whose very insouciant nature will be tested. The ambiguously named Theo (a silky voiced Claire Bloom) is icy cool, someone in touch with herself, who can't understand why Eleanor can't be. She has a predatory quality about her, although she genuinely likes Eleanor. Lastly, Eleanor Vance is a wounded individual full of baggage whose impressionable nature is just what Hill House is looking for: someone whom it can suck the will out of, using her own weaknesses and inner turmoil as a weapon against her. THE HAUNTING is also keen in its images: black and white make way to light and dark and smothering shadows. Robert Wise amps the suspense as the \"presence\" that is Hill House tightens its grip on the characters. While maybe the music is a little too shrill at times, seeing a door wide open when it shouldn't be is more unsettling than seeing a full-fledged ghost drenched in pallor, and the only thing remotely close to one is Mrs. Markway near the end. Lighted from below at a key scene, she might as well be one of the walking dead. Where this movie fails is in the casting of Julie Harris as Eleanor Vance. Her performance is the only weak link here: she's much too shrill, even when in repose. One gets the hint that her Eleanor is already unhinged as it is and may be causing these events to herself for attention. So needy is Eleanor that it seems she would want to put herself in danger as seen when she climbs the already wobbly staircase and as Dr. Markway reaches out towards her, she veers so far backward it's a miracle she didn't actually fall. And if that isn't enough, another flaw in the movie is Harris' intrusive voice-overs. A little is fine, too much, and coming from her as petty drones and moans, is almost like getting a molar wrenched out without Novocaine. It would have been best to have Harris approach her acting with subtlety and eliminate the voice-overs. A film that has become the haunted house to beat despite the stilted acting of Julie Harris, THE HAUNTING can still give the feeling one is not alone at home and will make people think twice before listening to the rustling noises that linger after everyone has gone to sleep.",
         "This is one of the best haunted house movies where you actually don't see the ghosts, you just hear them, and you wonder whether they're really there or just the people's imigination. The movie is about four people who go to spend a weekend at a well known haunted house and experience some real bumps in the night! Excellent acting and direction not to mention the creepy music. Highly recommended. they should make more movies like this! Hopefully the remake will good as well",
         "I saw this movie the summer I got out of high school. I went with a date and he about dug a hole in the arm of my sweater, it scared him that much. What makes the movie really scary is the fact that it does not have any slashers, monsters, blood and/or gore. Robert Wise scared you with camera angles, the unknown \"presences\" that seemed to be always lurking behind every door, and the sound effects were very effective. Filming it in black and white also made it creepier. The audiences imaginations and their own personal fears make the movie very effective. We have all experienced a frightening event at some time in our lives (dark closets, what's under the bed, what's outside the window after dark, did you hear that?, etc.) This movie plays on those feelings as you watch it. The remake was disappointing at the least. It had a great cast, but the producers/directors were trying too hard. These days, it seems that special effects can sometimes ruin a movie. There's nothing to play on ones imagination. That's why the book is usually much better than the movie. I purchased this movie on VHS a few years ago and I watch it every once in awhile in the dark (of course) when my husband is here. I don't think I could watch it alone - in the dark - in the night....",
         "Seeing 'The Haunting' in the horror section, rated G, was the first surprise this movie offered. Even though the rating may seem tame, the film offers a lot more than many of the trashy 80's and 90's horror movies which always seem to make it into video stores and hang around like a bed smell. This small gem of a movie may not stand out on the shelf and probably wouldn't appeal to many horror fans scouring the shelves for the latest gore flick, but if their eyes were to look past these to 'The Haunting,' they would be in for a pleasant surprise. This film is what a supernatural story should be - forgoing the usual barrage of special effects and buckets of blood, and relying on excellent cinematography to achieve the scares. The black and white combined with unique camera angles give Hill House an eerie, almost mystical appearance. Even though some of the acting may be a little corny at times (amid some superb acting, it must be said), the film manages to build tension steadily without ever showing the 'ghost,' therefore leaving you on the edge of your seat throughout. The main character (Elenor Lance) does unfortunately grate on the nerves after a while, being an overly neurotic and paranoid character, but otherwise the cast acts creditably well...even though the house steals the show! If you want a movie that gets your heart racing, turn down the lights and pump up the sound. Hill House will have you on the edge of your seat and keep you there for almost 2 hours. I only hope the remake this year does this superb film justice."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Argyle Enterprises"],
      "summaries": [
         "Dr. Markway, doing research to prove the existence of ghosts, investigates Hill House, a large, eerie mansion with a lurid history of violent death and insanity. With him are the skeptical young Luke, who stands to inherit the house, the mysterious and clairvoyant Theodora and the insecure Eleanor, whose psychic abilities make her feel somehow attuned to whatever spirits inhabit the old mansion. As time goes by it becomes obvious that they have gotten more than they bargained for as the ghostly presence in the house manifests itself in horrific and deadly ways.",
         "Located in a remote part of New England and isolated from any nearby community, Hill House is a 90-year-old, 19th century mansion with a long history of death and murder. When Dr. John Markway gets a chance to stay there for a few weeks, he sees an opportunity to study what is reportedly a genuine haunted house. With several other including Luke Sanderson, Eleanor 'Nell' Lance and a one-named woman named Theodora, they prepare to launch their experiments. Theo is there because of her ESP skills while Nell had a previous experience with a poltergeist and Luke represents the family that still owns Hill House. Soon after their arrival, the temporary occupants begin to face terrifying ordeals. Nell, who has lived a sheltered and repressed life life having spent all of her time caring for her recently deceased mother, is the clearly focus of the emanations and the haunting. She is both terrified ans comforted in Hill House and part of her wants to stay. The spirits seem to want to keep her as well.",
         "Ninety years ago, Hugh Crain builds the mansion Hill House in a remote area of New England. When his wife is moving to the mansion, she has an accident and dies, leaving the bitter Hugh Crain and his daughter Abigail alone in Hill House. Hugh Crain marries again and his wife also dies in Hill House. He moves to England and dies, living Abigail alone. When she is an old and invalid woman, she hires a paid companion from the village, but the woman neglects her and she dies. The companion inherits Hill House but the mansion drives her crazy and she commits suicide. In the present days (1963), Dr. John Markway rents the mansion from the inheritor Mrs. Sanderson to study the supernatural and prove the existence of ghosts. He invites the clairvoyant Theodora 'Theo' and the unbalanced and needy psychic Eleanor 'Nell' Lance to spend vacation in Hill House, and he goes with the skeptical future inheritor Luke Sanderson to the mansion. During the nights, the quartet witness supernatural manifestation in the house and the sanity of Nell is affected by her ghosts.",
         "Anthropologist Dr. John Markway is interested in the study of the supernatural, much to the chagrin of his wife, Grace Markway. He is able to convince Mrs. Sanderson, the current owner of isolated Hill House, to let him bring a research team into the house to search for supernatural phenomena. In its ninety year history, Hill House, located in remote New England, has been the location of many a violent and mysterious death of its inhabitants, Mrs. Sanderson being a distant relative of the original family owners, the Crains. Mrs. Sanderson, who doesn't live at the house believing it to be haunted, has one stipulation: that her Midwestern nephew Luke Sanderson, the spoiled and immature supposed heir of the house, be part of that research team. The other two members of the team, who Dr. Markway has not yet met but hired solely based one issue he knows about each, are surname-less Theodora - \"Theo\" - and Eleanor Lance - \"Nell\" - the former a somewhat glib psychic, the latter who grew up with some supernatural phenomena which she would rather forget. Eleanor is a meek and nervous woman who has felt trapped in most of her adult life, having to take care of her invalid mother until her passing two months ago about which she feels some guilt in its occurrence. Currently living with her married sister, Eleanor sees this research as a vacation, realistically an escape from her current sad life. As the research progresses, the four members truly begin to believe that there is something supernatural about their environment. But Eleanor begins to feel connected to the house, and what is happening in it... or is she just justifying it as a better replacement for her current life?",
         "A scientist doing research on the paranormal invites two women to a haunted mansion. One of the participants soon starts losing her mind."
      ],
      "budget": 1400000
   },
   "movielensId": 2550,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-09-18",
      "dvdReleaseDate": "2003-08-05",
      "directors": ["Robert Wise"],
      "runtime": 112,
      "movieId": 2550,
      "title": "The Haunting",
      "mpaa": "G",
      "actors": [
         "Julie Harris",
         "Claire Bloom",
         "Richard Johnson",
         "Russ Tamblyn",
         "Fay Compton",
         "Rosalie Crutchley",
         "Lois Maxwell",
         "Valentine Dyall",
         "Diane Clare",
         "Ronald Adam"
      ],
      "imdbMovieId": "0057129",
      "originalTitle": "The Haunting",
      "genres": [
         "Mystery",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "noW6c70Yrbs",
         "SrE9FQwWTcA",
         "4stHJHXgVMs"
      ],
      "plotSummary": "Dr. Markway, doing research to prove the existence of ghosts, investigates Hill House, a large, eerie mansion with a lurid history of violent death and insanity.",
      "tmdbMovieId": 11772,
      "avgRating": 3.59674,
      "releaseYear": "1963",
      "numRatings": 1747,
      "posterPath": "/gWXqJJTNwRCkuj9HEIsI9douVPf.jpg"
   }
}