{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "hen",
            "id": 166511
         },
         {
            "name": "graveyard",
            "id": 166512
         },
         {
            "name": "strapped down",
            "id": 166513
         }
      ],
      "imdb_id": "tt0107626",
      "video": false,
      "title": "My Boyfriend's Back",
      "recommendations": [
         48565,
         17140,
         27226,
         25234,
         25028,
         293901,
         54094,
         262088,
         287579,
         54768,
         48660,
         70576,
         177838,
         340865,
         30467,
         90926,
         291540,
         30236,
         153060,
         65871
      ],
      "backdrop_path": "/o1PnsdMQHSEF7r84QBCeOVDNm61.jpg",
      "revenue": 3335984,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Johnny",
               "gender": 0,
               "credit_id": "52fe44819251416c91013207",
               "name": "Andrew Lowery",
               "profile_path": "/fj23CIIFhYxGlw4maP1YP6Dl1SF.jpg",
               "id": 65704,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Missy McCloud",
               "gender": 1,
               "credit_id": "52fe44819251416c9101320b",
               "name": "Traci Lind",
               "profile_path": "/miY35kDAwcTdp2uKYmPEtbhQwUt.jpg",
               "id": 64062,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Eddie",
               "gender": 2,
               "credit_id": "52fe44819251416c9101320f",
               "name": "Danny Zorn",
               "profile_path": "/jGvuaukRRv1VL1yH0ROn7cxasXn.jpg",
               "id": 108098,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mr. Dingle",
               "gender": 2,
               "credit_id": "52fe44819251416c91013213",
               "name": "Edward Herrmann",
               "profile_path": "/3AGRAverIuT6kgSfGQPiY55QZzG.jpg",
               "id": 52995,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mrs. Dingle",
               "gender": 1,
               "credit_id": "52fe44819251416c91013217",
               "name": "Mary Beth Hurt",
               "profile_path": "/A1Whvk91g7uMZHjRX5rdxJsofeY.jpg",
               "id": 54782,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Sheriff McCloud",
               "gender": 2,
               "credit_id": "52fe44819251416c9101321b",
               "name": "Jay O. Sanders",
               "profile_path": "/wgCFAatAtmfN5zWgwzGgA48wwXu.jpg",
               "id": 6067,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Camille McCloud",
               "gender": 0,
               "credit_id": "52fe44819251416c9101321f",
               "name": "Libby Villari",
               "profile_path": "/8wZEo27NXwbuylQ4OzuWKK4uATr.jpg",
               "id": 2857,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Buck Van Patten",
               "gender": 2,
               "credit_id": "52fe44819251416c91013223",
               "name": "Matthew Fox",
               "profile_path": "/o8hMOleGaZ4BbZQFJXrU0xtMsSI.jpg",
               "id": 28657,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Chuck Bronski",
               "gender": 2,
               "credit_id": "52fe44819251416c91013227",
               "name": "Philip Seymour Hoffman",
               "profile_path": "/8DjE4XIngdn0dK3RnIKTHB8U8jZ.jpg",
               "id": 1233,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Big Chuck",
               "gender": 2,
               "credit_id": "555a138c9251416e1e001b5d",
               "name": "Paul Dooley",
               "profile_path": "/rnzvqo7oR2IwSfN2Ayh3ysc4WNt.jpg",
               "id": 15900,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44819251416c9101322d",
               "name": "Bob Balaban",
               "profile_path": "/3g7IKz8ycv0opDxmpoBxsQkUslU.jpg",
               "id": 12438,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "555a1373925141410100043e",
               "name": "Dean Lorey",
               "profile_path": null,
               "id": 64746,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.82649,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31503,
      "vote_count": 26,
      "budget": 0,
      "overview": "Missy McCloud is the most beautiful girl in school and Johnny Dingle has been in love with her for years. One night, Johnny is killed trying to win her over, and soon he comes back from the dead, and wins Missy's heart.",
      "similar": [
         10925,
         19908,
         82654,
         766,
         485415,
         170,
         1562,
         72190,
         294254,
         336843,
         24935,
         16288,
         747,
         49524,
         76492,
         159824,
         16281,
         400136,
         6479,
         1991
      ],
      "original_title": "My Boyfriend's Back",
      "runtime": 85,
      "poster_path": "/me2PB6nN4ICUFOGWEnhZH8iuF9y.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1993-08-06",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "A comedy that proves true love never dies.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Balaban"],
      "runtime": 85,
      "synopsis": null,
      "writers": ["Dean Lorey"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0107626/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ2NTY5NjQzOF5BMl5BanBnXkFtZTcwNjYyMzcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Andrew Lowery, Traci Lind, Danny Zorn | See full cast and crew »"],
      "reviews": [
         "I just feel bad for the girl that admitted to enjoying Pauly Shore films. This movie is a complete original and doesn't take itself seriously. I honestly feel that some movies are made for people with a certain level of intelligence or, for that matter, dementia. I believe that only highly intelligent, somewhat demented people are in on jokes like this one. \"We don't take kindly to dead kids around here.\" C'mon, that's hysterical. It's completely ludicrous and that's why it's funny. Anyone who doesn't appreciate the humor of this film is operating on a lower level of intelligence than those who liked it. Count me in as a demented devotee...",
         "You want to see a zombie movie, but your girlfriend wants to watch a romantic comedy. What do you do??? Compromise!!! This movie bombed at the box office, if I recall, and didn't do too well on video either. As such, its hard to find out there (I had to visit 15 video stores personally), literally making this a hidden gem! While the narrative is a little off, the one liners alone make this Romantic Black Comedy about a zombie truly entertaining! And while most of the actors in it have fallen off the face of the earth (except Edward Herrmann and a very young Phillip Seymour Hoffman), they help make this film what it is. Definitely worth hunting out if you want something a little different than your average run of the mill comedy.",
         "As a comedy, \"My Boyfriend's Back\" is pretty one-joke, the joke being that the existence of a zombie barely raises an eyebrow in this peaceful little town (until he starts eating people, that is). The film is more interesting as a not-too-subtle anti-racist parable about the plight of the outcasts. It has some near-inspired moments, as well a feeling of profound sadness to it, which make it hard to dismiss as quickly as most critics have. (**)",
         "'My Boyfriend's Back' is both great as a political analogy (dealing with generic prejudice and social mistrust) as well as a hard mockery of standard teen fare. The story is that of a teen who is dying to go to the prom with the school beauty. Unfortunately, a plan to get her attention backfires and he dies. But, he rises as the walking dead in order to keep the date. But, even though no one seems to mind much that the dead kid pretty much resumed his normal life, he is quickly decaying. And, it requires that he eats living things in order to slow the process until a doctor (played fantastically by character actor, Austin Pendleton) can figure out how to chemically reverse the process. Of course, his cannibalism does not blow over well with the towns folk, who soon begin to ostracize the boy (and violently, at that). It is a witty little black comedy that does sometimes strive too hard to impose its humor on the audience (though, maintaining some witty subtle humor at the same time). The generic supporting characters such as the oblivious father (played by Edward Hermann), the exceedingly prim mother, and, of course, the doctor (Austin Pendleton) are great. Its seems like a more scaled down, cheaper version of something that Tim Burton could put together (and sort of did, with Frankenweenie). Also, look for Cloris Leachman, Paul Dooley, and a then-unknown Matthew Fox and Phyllip Seymour Hoffman in supporting roles. If you enjoy this movie, check out 'My Best Friend is a Vampire,' 'The Applegates,' 'I Was a Teenage Zombie,' 'Terror Vision,' or the disturbing black comedy 'Parents.' This is one of those oddball varieties.",
         "This really is special: a zombie movie about acceptance and love. Our zombie's parents accept him with barely any question, because he's their son, and our zombie's girlfriend accepts him because the depth of his love is what has enabled him to return from death and make it to the prom, even if that means his devouring a couple of classmates. Charming and sweet, and I mean that sincerely,",
         "first of all, this is not a good movie. however, it has some of the best lines i've ever heard. and the whole \"dead guy as a satire on societal discrimination\" was great and probably not easy to do. if you appreciate the stupid/funny/strange, then this is a good choice. plus, it has austin pendleton, who just rocks.",
         "I thought it was hilarious, a bit graphic for the extremely squeamish, but really well-done. The script was well-written with lots of fondness for the characters. Traci Lind was a stand-out as the class beauty trying to get a grasp of a weird situation. The way the townspeople adapt to a zombie in their midst is another great thing about this very funny and well- done movie.",
         "I saw this movie a while ago on cable and since then I've rented it a couple of times because it is the funniest movie of the 1990's. It is just a really funny movie. It's not your average teen comedy and that's what I like about it. It's kind of gross, but it could've been a lot worse. If you're a teenager and you don't mind seeing a little gore, you will probably enjoy this movie!!!",
         "My girlfriend and I had a movie night recently in which we watched the critically (and audience)acclaimed Black Swan, Jackass 3 and this. I bought it mostly because I heard it had some A listers in early rolls and I enjoy trying to point out future stars before my girlfriend can recognize them. I'm sure I would be mercilessly attacked for saying this on a Black Swan board -or even a Jackass board for that matter- but we both chose My Boyfriend's Back as easily our favourite of the three. Sure it was stupid, but after the dark, serious feel of Black Swan, it's silly, goofy tone was all the more appealing. Andrew Lowery is quite likable in the lead, and Traci Lind is lovely in a roll that was likely quite difficult to play. Her character was required to show some very serious emotions in a very unserious movie, and she seemed to walk the line between them admirably. The supporting cast was a joy, without fail they understood the script's oddball, offbeat humour and really ran with it. The scene stealing Mary Beth Hurt was a stand out as Lowery's too understanding mother, and Cloris Leachman was excellent in a small, rather thankless cameo. Celebrity watchers will find plenty to keep them busy here as well. A young Matthew Fox (future star of Lost)makes his film debut; Oscar winner Phillip Seymour Hoffman plays his loathsome sidekick;as well as Edward Herrmann and Austin Pendelton(from HBO's Oz, not to mention countless other films and TV shows); character actor Paul Dooley; JFK's Jay O' Sanders; and even Matthew McConaughey makes his film debut as Guy in Movie Theatre. Perhaps this means I don't have any future as a film critic, but I was really surprised that both of us enjoyed a low budget flick with a rating under 5 and less than two thousand votes hands down over a 13 million dollar movie with 100,000+ votes and a rating over 8. I guess my point in all this is that you really can't judge a movie based on the general consensus about it. Had I dismissed this movie because of it's low approval among both critics and IMDb user's (as I normally would have), we really would have missed out on a sweet, irreverent little hidden gem. When selecting a movie, don't just check the star rating or critic approval percentage, but scan the fan reviews as well and see if any really speak to you. You just might end up turning a rather uninspired date night into an unexpected last minute success.",
         "I'll be the first to admit it. This movie is terrible. While the acting is decent and the cast (Edward Hermann, Chloris Leachman, Paul Dooley) is just plain awesome, this movie is terrible... in the perfect way. What most people don't get is that it's supposed to be campy and over the top. That's what farce is. In terms of production value, yes, this movie is a load of stinky camel poo, but it's funny and weird and it changed my life. I was eleven going on twelve when I popped into the theaters for this one and I was moved by this pathetic romantic. I maintain that if it wasn't for all the cannibalism and borderline necrophilia, this would be one of the most celebrated love stories of all time. I mean, he died for her! He came back from the dead for her! And to this day, I ask myself \"Do I love this person enough to eat someone's stomach... just for ONE DANCE with them? That's love. And I think people take far too insecure a pride in the eschewing of campy humor. I know this movie is terrible, but I love it for its humor, its wonderfully bizarre characters and for teaching me what true love is all about... not eating people, but being willing to eat people for someone you love. Sick? Perhaps. But would you eat someone's stomach just to dance with your significant other? I wish I could find someone I loved that much."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror",
         "Romance"
      ],
      "productionCompanies": ["Touchstone Pictures"],
      "summaries": [
         "Missy McCloud is the most beautiful girl in school and Johnny Dingle has been in love with her for years. One night, Johnny is killed trying to win her over, and soon he comes back from the dead, and wins Missy's heart.",
         "Johnny is a teenager like everyone else. He's in love with a beautiful girl named Missy, but he can't tell it to her. One day the shop where Missy works gets robbed and Johnny is killed trying to help. But Johnny doesn't want to stay dead, so he returns to his life like nothing ever happened. After a while he discovers that his body is disintegrating and he must feed with human flesh if he wants to survive. Looks like he is a real zombie..."
      ],
      "budget": 0
   },
   "movielensId": 2552,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1993-08-06",
      "dvdReleaseDate": "2002-09-03",
      "directors": ["Bob Balaban"],
      "runtime": 85,
      "movieId": 2552,
      "title": "My Boyfriend's Back",
      "mpaa": "PG-13",
      "actors": [
         "Andrew Lowery",
         "Traci Lind",
         "Danny Zorn",
         "Edward Herrmann",
         "Mary Beth Hurt",
         "Jay O. Sanders",
         "Libby Villari",
         "Matthew Fox",
         "Philip Seymour Hoffman",
         "Paul Dooley"
      ],
      "imdbMovieId": "0107626",
      "originalTitle": "My Boyfriend's Back",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["C7ZUKMWyPZs"],
      "plotSummary": "Missy McCloud is the most beautiful girl in school and Johnny Dingle has been in love with her for years. One night, Johnny is killed trying to win her over, and soon he comes back from the dead, and wins Missy's heart.",
      "tmdbMovieId": 31503,
      "avgRating": 2.30975,
      "releaseYear": "1993",
      "numRatings": 318,
      "posterPath": "/me2PB6nN4ICUFOGWEnhZH8iuF9y.jpg"
   }
}