{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "evil child",
         "id": 177201
      }],
      "imdb_id": "tt0056931",
      "video": false,
      "title": "Children of the Damned",
      "recommendations": [
         47605,
         29412,
         42344,
         37521,
         26652,
         40244,
         37467,
         73218,
         26811,
         28955,
         52840,
         52867,
         23293,
         112481,
         99008,
         31984,
         86616,
         390253,
         48136,
         31579
      ],
      "backdrop_path": "/66hWBsiiKxp0lmFXvuO5vixZaJD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Col Tom Llewellyn",
               "gender": 2,
               "credit_id": "52fe44059251416c910024a7",
               "name": "Ian Hendry",
               "profile_path": "/yncW9U3Q2Pvzc1fNoCfbWdkVrgE.jpg",
               "id": 58339,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Dr. David Neville",
               "gender": 2,
               "credit_id": "52fe44059251416c910024ab",
               "name": "Alan Badel",
               "profile_path": "/77IvpKDvxUqkXnAJxhSNZdelfXv.jpg",
               "id": 39065,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Susan Eliot",
               "gender": 1,
               "credit_id": "52fe44059251416c910024af",
               "name": "Barbara Ferris",
               "profile_path": "/xn3R0fWtxVhjgC7Q9O5vi0EWjnc.jpg",
               "id": 87420,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Colin Webster",
               "gender": 0,
               "credit_id": "52fe44059251416c910024b3",
               "name": "Alfred Burke",
               "profile_path": "/xuqiPV4UnMYB2RcNDN7EKRBv28Q.jpg",
               "id": 105823,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Diana Looran",
               "gender": 1,
               "credit_id": "52fe44059251416c910024cf",
               "name": "Sheila Allen",
               "profile_path": "/xRj8h5w0d6btBtR9mhQIv7ufXjL.jpg",
               "id": 1220981,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Defense Minister",
               "gender": 2,
               "credit_id": "52fe44059251416c910024b7",
               "name": "Ralph Michael",
               "profile_path": null,
               "id": 40160,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Commander",
               "gender": 2,
               "credit_id": "52fe44059251416c910024bb",
               "name": "Patrick Wymark",
               "profile_path": "/vrXTDBBGi4UdXFt8aEupKPTee9R.jpg",
               "id": 67917,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Prof. Gruber",
               "gender": 2,
               "credit_id": "52fe44059251416c910024bf",
               "name": "Martin Miller",
               "profile_path": null,
               "id": 105824,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Paul",
               "gender": 2,
               "credit_id": "52fe44059251416c910024c3",
               "name": "Clive Powell",
               "profile_path": null,
               "id": 105825,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Mi Ling",
               "gender": 0,
               "credit_id": "52fe44059251416c910024c7",
               "name": "Yoke-Moon Lee",
               "profile_path": null,
               "id": 105826,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Nina",
               "gender": 1,
               "credit_id": "52fe44059251416c910024cb",
               "name": "Roberta Rex",
               "profile_path": null,
               "id": 105827,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44059251416c91002497",
               "name": "Anton Leader",
               "profile_path": null,
               "id": 105822,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44059251416c9100249d",
               "name": "John Briley",
               "profile_path": null,
               "id": 11845,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44059251416c910024a3",
               "name": "John Wyndham",
               "profile_path": null,
               "id": 70449,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.358352,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 30202,
      "vote_count": 33,
      "budget": 0,
      "overview": "Six children are found spread through out the world that not only have enormous intelligence, but identical intelligence and have a strange bond to each other.",
      "similar": [
         10320,
         42196,
         11773,
         55538,
         43751,
         58792,
         84107,
         40217,
         54013,
         82990,
         241927,
         127884,
         60632,
         64623,
         511439,
         3560,
         62521,
         72648,
         48630,
         290590
      ],
      "original_title": "Children of the Damned",
      "runtime": 90,
      "poster_path": "/fjIiCQJRIpJTGUW4A8jSPqIIkH1.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Lawrence P. Bachmann Productions",
            "id": 23843,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1964-01-29",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Beware the eyes that paralyze!!!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Anton Leader"],
      "runtime": 90,
      "synopsis": "Several children inEnglandhave astounding intelligence and Col Tom Llewellyn (Ian Hendry) is eager to find out why one in particular has developed. He discovers that the mother is a victim of divine pregnancy but several more children appear with the same cerebral gifts as the original one. In particular there is a child from every major nation in the world, and this group of six share a common consciousness and kinetic powers. When the children take over a small church and the army closes in to eradicate them, they send a message of peace and love to the world.",
      "writers": [
         "John Briley",
         "John Wyndham"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056931/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM4MDU0MjE5M15BMl5BanBnXkFtZTcwNjkyOTUyMQ@@._V1_SY317_CR22,0,214,317_AL_.jpg",
      "actors": ["Stars: Ian Hendry, Alan Badel, Barbara Ferris | See full cast and crew »"],
      "reviews": [
         "Children of the Damned has generally been considered grossly inferior to Village of the Damned. I beg to differ as the point of both movies is quite different. In Village of the Damned the children were the result of alien insemination (presumably) and were simply evil. In Children of the Damned they are the result of a jump in evolution and they, themselves, are unsure of who they are and why they are here. The mystery is cleared up however when Paul makes a very eloquent speech near the end of the movie where he states that they have realized that they are here to help mankind. This speech no longer exists on the video version. It apparently was edited out at some point. However without it the ending makes no sense. The dropped screwdriver is played as a tragedy in the movie which contradicts the impression that the children are evil. In fact what the movie is about is a religious theme about how mankind kills its saviors.",
         "The inexplicable appearance of a group of children, advanced 1 million years beyond Mankind's genetic development, causes fear among the governments of the world. When the authorities try to contain them, the children respond with deadly telepathic force. This is a rare instance of a sequel being better than the original. The 1960 adaptation of John Wyndham's Midwich Cuckoos, filmed as Village Of The Damned, was a highly memorable and influential movie in its own right. However, it was also a product of post-war British film making complete with cozy, somewhat gentrified attitudes to class, sex and an illusory rural idyll. This was exemplified by George Sanders' typically suave performance as the smoking-jacket clad, martini sipping hero. Children Of The Damned is a much tougher affair. This time the action takes place in the dark, grim, urban backstreets of early sixties London - not so much swinging as downright gothic. Rather than the aliens invaders of the first film, the children here are a human super-species, socially and intellectually incompatible with the rest of humanity. They don't seem to mean any harm, but their eerily cold and quiet presence provokes the authorities into a fearful contemplation of what they might do. John Briley's adult and intelligent script takes an insightful look at how our inherently insecure systems of authority might hunt and destroy that which merely suggests a challenge to their control. The cast is excellent. Ian Hendry and Alan Badel as the two conscientious scientists trying to fathom the children's secret, are terrific. They bounce Briley's sometimes caustically witty lines between them with a delightful, naturalistic touch. The rest of the cast play it for keeps too, imparting a sense of urgency and, as with Alfred Burke's government man, icy menace. The children themselves are surprisingly well played. No brattish over-acting here. Instead, the group of young, multi-racial actors exude a perfect sense of other-worldly calm, and, when necessary, chilling ruthlessness. The film's technical credits are excellent. Cinematographer Davis Boulton's vivid black and white images ensure that Children of the Damned is one of the best photographed British films of the era. The special effects are simple (glowing eyes) but startlingly effective. The late, great Ron Goodwin was a composer best known for comedies and war films, but here he provided a subtler kind of score which suggests both the child-like and the ethereal. It was one of his best. The main plaudits must go to director Anton M. Leader. His handling of actors, the imaginative staging and his pictorial compositions, particularly towards the climax, are outstanding. For example, the scene depicting a group of gunmen trying, somewhat disastrously, to capture (or kill) the children in a derelict church is a tour de force of tension and horror. Yes, horror. This movie may have children in it, but it isn't a children's film. In all, this is much more than a quick cash-in sequel. It deserves credit for making an early stab at confronting the ethics of genetics, and for being, along with the Quatermass movies, that rare thing; a thought provoking, grown-up science fiction film.",
         "Although it is often referred to as a sequel to \"Village of the Damned\", the plot differs in enough ways to make the claim seriously questionable. No mention is made of the events in the first film. The only real similarity is that the story concerns six children who are perceived as a threat to mankind because they possess strange telepathic and mind-control powers. Unlike the first film, however, the children are of different nationalities (not identical blonds, as the children in the first film) and they do not mature at an accelerated rate. It's as if the basic premise (six superintelligent kids who are a threat to mankind) was reworked into a new story. The children are explained as being \"quantum leaps in evolution\" (not alien offspring, as in the first film). And yet the story never clarifies why they were all born at approximately the same time in different parts of the world (coincidence?). When one sympathetic government agent asks the children, \"Why are you here?\", the children reply \"We don't know.\" A line of dialogue by a major character, stating that the children are here to help mankind, was later edited from the film. Too bad. Mankind, rather than the kids, are portrayed as the bad guys. Despite some confusion over these basic plot elements, director Anton M. Leader does deliver a clear message concerning the hate, fear, and intolerance which society feels towards anyone who doesn't \"fit in\", as well as the greed for power which nations feel in their efforts to gain dominance over each other.",
         "Five super-intelligent, emotionless children are discovered around the world. They also have the power to control peoples minds (their eyes glow when they do this). They're all taken to London to be studied but they escape and barricade themselves in an old, abandoned church. But what do they want? Not as good as the original \"Village...\" but this sequel showed real promise. It's effectively filmed in moody black & white and has some very talented British actors giving good performances. Also the kids themselves are extremely spooky--especially when their eyes are glowing. It also shows how various countries want to use the children for their own gain. It also leads up to a (sadly) violent climax leaving most of the questions unanswered. Basically, it's a cop out and that's too bad. If you're going to set up a situation like this at least give it an ending...don't just end with violence (although that may be the point). Some people think this is better than the original but I disagree. Still, I was never bored and admired the direction and photography. Worth seeing, if you can handle the lousy ending.",
         "Not really a sequel to the original classic, but rather its own story with its own things to say. This is, in fact, a powerful allegory about our violent world, the suspicious nations that make it up, what those nations teach their children by way of example, the state of religion in the modern world, etc. Very smart, and beautifully shot in glorious black and white. If you're looking for a horror movie, you might be disappointed, but as an allegorical fantasy it's top of the line.",
         "Children of the Damned is not so much a sequel to Village of the Damned as a supplement to it. This time it's children in the heart of London who are displaying terrifying powers. Instead of personalising the story as in the first film, this time screenwriter John Briley enlarges the scope to encompass some philosophical questions: what right does man have to interfere with evolution? Who's more scared, the adults or the children? And of course, nature vs. nurture? Highly recommended, Children of the Damned is a fine example of British science fiction filmmaking, as good as Five Million Years to Earth.",
         "(Small Spoilers!!!) Children of the Damned got released as a sequel to `Village of the Damned', though not officially and not starring George Sanders. Yet, both films are fascinating, prominent Science Fiction efforts and still some of the most jaw-dropping films I ever saw. A study, let by the United Nations results in bizarre and alarming findings. Six children, from all corners of the world, score unusually high on intelligence tests. It becomes even more remarkably when it seems that none of them has a father and all of them have label mothers. One mom even declared her boy is `not from this world'. While psychologists and other prominent scientists from all over the world search for explanations, the group of prodigies together seek shelter in an abandoned church\u0085.Things are getting more and more frightening when it turns out they're telepathic and able to hypnotize humans with their minds and eyes\u0085 Children of the Damned offers suspense from the beginning till the very end, with a few breath-taking climaxes in-between. I rarely saw a movie that has such a constant tense-level. The silent, yet intriguing children are terrifically cast and often they look scarier as most other cinema-madmen! I know it sounds like a cliché by now but\u0085This is SF like they only could have made it in the old days. Scriptwriters nowadays simply can't come up with such ingenious and creative plots anymore. The script is intelligent (with a few interesting lectures on genetics) and the black and white cinematography helps increasing the tension even more. And, if the high entertainment values aren't enough yet\u0085Children of the Damned also raises a stunning ethical debate and it severely questions the statement whether humans are a superior species or not. Impressive AND thought-provoking! What more could you possibly wish for?",
         "Title: Children of the Damned (1963) Director: Anton Leader Cast: Clive Powell, Barbara Ferris, Ian Hendry, Alan Badel Review: Having seen the first film (Village of the Damned) and loved its eerie ideas of children with powerful psychic powers taking over the world I looked upon the opportunity to see its sequel Children of the Damned with great anticipation. Would it be just as good as its predecessor? The story is about these very intelligent kids with psychic powers that start to sprout all over the world. Women start giving birth to these kids all over the planet, sometimes women who have never been with a man or women that aren't married. So as would be natural in a situation such as this, the government starts to take notice of these kids and sees in them military intelligence potential. So, each country tries to grab a hold of their special child and of course they have plans to exploit these kids in the military endeavors. Unfortunately for the governments of the world, the kids are not up for it. This is a flick from the early 60's, and at that time creature features where very popular (Dracula, Frankenstein, Giant Spiders, Giant everythings) so when a series like this one shows up where its got no special effects, no monsters, no men in suits destroying the city...well you kind of get to wondering, will it hold interest? It is a horror film and people expect to get spooked...but no monsters or effects? Yes, thats right, the creatures in this film are just kids and believe me thats enough. I thought it was great how this series of films managed to be so good without the monsters and effects. Its just a good chilling story, with a good premise and great performances. The first one was about presenting us the kids. Suddenly there they where amongst the town of Midwich in London. There they were using their powers on people and there they were killing whoever got in their way. But that first movie never answered any questions. It just asked them. Who where these kids and what did they want? And thats where this sequel comes in. For a moment there while I was watching it I thought the answers where never going to come and that the filmmakers where going to continue toying with the audience and keep us in the dark about the kids purpose, but low and behold, this sequel actually gives us some insight on why the kids are here. There's a lot of great moments on this film that shouldn't be missed, for example when the kids lock themselves up inside of a spooky old church and barricade themselves in it. I loved that weapon that they created with the giant old piano in the church! That has to be one of the coolest and most original things I've ever seen on any movie! Awesome moment. The last 20 minutes of the film are really gripping and tense so I suggest that you stay all the way to the end and not give up on this film. The filmmakers really came up with an interesting situation that turns red hot in the suspense o meter with the kids facing off with the military. I know its an old movie, and I know its not as fast paced as todays films, but dammit, this is a gripping, intense and suspenseful tale. Screw special effects! This is a good story! The only thing I didn't like was that I thought the look of the children on the first one was spookier. I liked the fact that they all had blond hair. The looked like drones or clones of some sort. The big distinction with the sequel is that the kids are all from different nationalities and are all different looking. One is Indian, one is African, one is Chinese and so forth. I just thought it would have been creepier if they were all from different parts of the world yet looked the same. Still its no big deal because the children are just as scary once you get into the movie. Anyhows, I highly recommend this great sequel if your into good story and suspense in your films (even if they are in black and white and old) well then your in for a treat. Rating: 5 out of 5",
         "This surprisingly strong semi-sequel to the outstanding \"Village of the Damned\" centers on six highly advanced mutant kids with remarkably sophisticated intellects and acute psychic abilities from all over the globe. They all band together in London at an old rundown and abandoned church seeking refuge from a scared and uncomprehending adult world that wants to destroy them. A very tense and compelling stand-off ensues, with both the kids and the adults alike trying to figure out the proper course of action for this highly unusual and potentially dangerous situation. This film benefits from the same substantial strengths that graced the original: low-key, unflashy direction that wisely downplays special effects in favor of focusing more on the absorbing story and exceptionally well-drawn characters, uniformly fine acting from an excellent cast (the kid actors in particular are all terrific while Ian Hendry and Alan Badel are superb as the gay couple protagonists; this latter element is handled with refreshing taste and subtlety), a smart and thoughtful script, beautifully crisp black and white photography, a pleasingly eerie and ambiguous tone, and a stimulating subtext about how people automatically feel threatened by and hence want to kill anything they can't easily understand. The uncompromisingly bleak and tragic ending is genuinely heartbreaking. Moreover, the political aspects of the story give the movie an extra stinging edge and the theme of prejudice is effectively addressed with genuinely poignant and provocative results. Overall, this picture is one of those rare glorious instances where a follow-up is every bit as comparable in top-notch quality to the sterling original.",
         "Children of the Damned is morally and politically more ambitious still than the original Village of the Damned, exploring the notion that humans are perhaps far worse than the cuckoos in their midst. Unfortunately it's also very dull, good performances from Alfred Burke and Ian Hendry notwithstanding. There's no real involvement or forward momentum, and it exists in a vacuum \u0096 the events in the first film are never even acknowledged. But the saving grace of the Region 1 DVD at least is screenwriter John Briley's audio commentary, dealing with the themes of the movie as well as taking detailed diversions into the effect of the blacklist on Hollywood, the exile of US talent to Britain and the artistic and political freedom that MGM UK's sheep farming activities gave them! (There's also a brief harbinger of things to come with a photo of Gandhi overlooking Indian politicians debating killing the children in the film: Briley would go on to write Attenborough's biopic.)"
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Lawrence P. Bachmann Productions",
         "Metro-Goldwyn-Mayer British Studios"
      ],
      "summaries": ["Scientists discovers that there are six children who each have an enormous intelligence. The children are flown to London to be studied, but they each escape their embassy and gather in a church."],
      "budget": 0
   },
   "movielensId": 2554,
   "movielens": {
      "languages": [
         "English",
         "Pусский"
      ],
      "releaseDate": "1964-01-29",
      "dvdReleaseDate": "2004-08-10",
      "directors": ["Anton Leader"],
      "runtime": 90,
      "movieId": 2554,
      "title": "Children of the Damned",
      "mpaa": "",
      "actors": [
         "Ian Hendry",
         "Alan Badel",
         "Barbara Ferris",
         "Alfred Burke",
         "Sheila Allen",
         "Ralph Michael",
         "Patrick Wymark",
         "Martin Miller",
         "Clive Powell",
         "Yoke-Moon Lee",
         "Roberta Rex"
      ],
      "imdbMovieId": "0056931",
      "originalTitle": "Children of the Damned",
      "genres": [
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "4pJdejSLPFc",
         "WFFuDKrnoRI"
      ],
      "plotSummary": "Six children are found spread through out the world that not only have enormous intelligence, but identical intelligence and have a strange bond to each other.",
      "tmdbMovieId": 30202,
      "avgRating": 3.18914,
      "releaseYear": "1964",
      "numRatings": 801,
      "posterPath": "/fjIiCQJRIpJTGUW4A8jSPqIIkH1.jpg"
   }
}