{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "genius",
            "id": 6257
         },
         {
            "name": "toddler",
            "id": 155644
         },
         {
            "name": "baby geniuses",
            "id": 234456
         }
      ],
      "imdb_id": "tt0118665",
      "video": false,
      "title": "Baby Geniuses",
      "recommendations": [
         31117,
         17745,
         11511,
         13908,
         16314,
         31395,
         11870,
         9622,
         26441,
         15581,
         29901,
         278608,
         36934,
         64170,
         39180,
         11894,
         17711,
         14819,
         17894,
         9446
      ],
      "backdrop_path": "/bkiITWsN6r0xI2fXtgAFHQoBZN5.jpg",
      "revenue": 36450736,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Elena Kinder",
               "gender": 1,
               "credit_id": "52fe443dc3a368484e017859",
               "name": "Kathleen Turner",
               "profile_path": "/jM1gpAt7vsn81NsvWqJGVLhD8As.jpg",
               "id": 3391,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Heep",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e01785d",
               "name": "Christopher Lloyd",
               "profile_path": "/iQzG9apaIsHnn7iGrer3YEDp8Zo.jpg",
               "id": 1062,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Robin",
               "gender": 1,
               "credit_id": "52fe443dc3a368484e017861",
               "name": "Kim Cattrall",
               "profile_path": "/zWG2cZkaPdIMMhpujPdUXNa4yqu.jpg",
               "id": 2109,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dan",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e017865",
               "name": "Peter MacNicol",
               "profile_path": "/hw4KTj66xh2FupS5sQMeNMNL6lx.jpg",
               "id": 12688,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lenny",
               "gender": 2,
               "credit_id": "52fe443dc3a368484e017869",
               "name": "Dom DeLuise",
               "profile_path": "/u1DOOocPOgaiCucbbbxPkdOTuo8.jpg",
               "id": 6844,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Reporter",
               "gender": 0,
               "credit_id": "5745f24f9251413232000a10",
               "name": "Dan Monahan",
               "profile_path": "/1dyNIvDWNmqYydrlstwT9tozc3a.jpg",
               "id": 64221,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe443dc3a368484e01786f",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5481ca219251416e7e00630d",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5481ca329251416e7b005c16",
               "name": "Greg Michael",
               "profile_path": null,
               "id": 1394970,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 6.569448,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 22345,
      "vote_count": 100,
      "budget": 12000000,
      "overview": "Scientist hold talking, super-intelligent babies captive, but things take a turn for the worse when a mix-up occurs between a baby genius and its twin.",
      "similar": [
         95610,
         11472,
         41210,
         810,
         2758,
         37135,
         9732,
         9659,
         4141,
         76494,
         110415,
         195589,
         206487,
         929,
         9381,
         1427,
         473,
         489,
         381283,
         9494
      ],
      "original_title": "Baby Geniuses",
      "runtime": 97,
      "poster_path": "/jQfj2mST2uRbRbYG8qKcdqb6JCM.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Crystal Sky Worldwide",
            "id": 4077,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Triumph",
            "id": 4078,
            "origin_country": ""
         },
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         }
      ],
      "release_date": "1999-03-12",
      "vote_average": 3.4,
      "belongs_to_collection": null,
      "tagline": "Think innocent. Think helpless. Think again. Naps are history.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bob Clark"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Steven Paul",
         "Francisca Matos"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118665/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxODAxNzE4NV5BMl5BanBnXkFtZTcwNDMyODYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kathleen Turner, Christopher Lloyd, Kim Cattrall | See full cast and crew »"],
      "reviews": [
         "Two scientists, Dr. Elena Kinder (Kathleen Turner) and Dr. Heep (Christopher Lloyd), use genius-baby studies to fund BabyCo's theme park \"Joyworld\". According Dr. Kinder's Research, babies are supposed to possess vast, universal knowledge and speak a secret yet impossible-to-translate baby pre-language called \"Babytalk\". At age two, however, the knowledge and language are lost as the babies \"cross over\" by learning how to talk. Most of the babies that were raised in Dr. Kinder's vast, underground research facility were adopted from the Pasadena orphanage, transformed into geniuses through use of the Kinder Method, and then used in experiments to decipher the language used by the baby-geniuses. One mischievous toddler, Sylvester (AKA Sly), makes repeated attempts to escape Dr. Kinder's research facility and one night, Sylvester goes into a dirty diaper truck and he actually succeeds. The next morning, Sylvester does not expect is to run into his twin, Whit, in a mall playground. Although Sylvester and Whit share a telepathic bond, they have no idea of each other's existence. While the guards from Dr. Kinder's research facility capture Whit, mistake him for Sylvester, and take him back to Dr. Kinder's research facility, Sylvester is taken home by Whit's adopted mother, Robin (Kim Cattrall), who is Dr. Kinder's niece. After Dr. Kinder is Horrified that Whit and Sylvester switched at the mall, she decides to do a cross evaluation on Sylvester and Whit. However, when she comes to Dan Bobbin's Place, she realizes that Dan Bobbin can understand babies. After the attempts to retrieve Sylvester fail, Dr. Kinder decides to move the research facility to Lichtenstein So that they can transform Whit into becoming a genius thanks to him getting bred by the Kinder Method (Thus erasing his memories about his foster parents, foster brothers and foster sisters) and use him as an experiment to crack the code to \"Babytalk\". The babies at Bobbin's place hypnotize Lenny (Dom DeLuise), the bus driver to drive to Dr. Kinder's research facility. Once at the research facility, Sylvester goes to the control room to set the robots from the theme park on the lab scientists. When the Bobbins return home, their natural daughter Carrie tells her father that the children are in Dr. Kinder's research facility. At the end of the fight Dr. Kinder captures Whit and takes him to the helicopter pad on the roof. Robin and Dan chase them to the roof, where Dr. Kinder reveals that she and Robin are not related, and that Robin was adopted at age two. After Dr. Kinder got arrested by the police, Sylvester and Whit come together on the roof to cross over. Dan and Robin adopt Sylvester. Dan is still curious of the secrets of life, but as the twins have crossed over they no longer know those secrets. Carrie, their sister, doesn't reveal anything (just gives her dad a sly smile) because adults aren't meant to know their secrets. Baby Geniuses Is So Funny,Quite Amusing & Impressive.Undoubtedly it is one of the best family movies I have Ever Seen.",
         "This is up there with Chairman Of The Board(1998) starring none-other than Carrot-Top! This is the funniest movie of 1999. I love this movie. When a weak 20lb baby can beat up a fully grown adult, you know it's going to be a great show. I'm so glad this movie was made that I saw it four times in the theater, and as soon it came out, got it on DVD. Greatest show ever.",
         "Baby Geniuses is one of the best films that i have seen in a long time. It shows the true meaning of friendship and how we should not be racist. I laughed every second of it. This jokes were not stop from beginning to end. If you liked Old School or Wedding Crashers, then this movie is for you. It has that kind of humor that only these actors could pull off. I give it 10 out of 10 stars because its awesome, entertaining, and action packed. There are some scenes that are very emotional, but the rest is just complete laughs. If your looking for just a non stop thrill ride, and one of the best comedic performances of your life, then watch Baby Geniuses.",
         "This movie changed my life. Right up there with American Psycho! There is so much symbolism in this movie I had to watch it thrice just understand it fully! When the one baby said \"Don't have a cow Basil\" I thought wow, a reference to The Last Temptation of Christ\" Humor, intense plot, this babies got it all! All I can say is WOW! If you like intense psychological thrillers than this movie is for you! The switching of the twins was a total plot twist! I had no idea that would happen! I even found myself mistaking the two Sly and Whit! Christopher Llyods best performance since the powerful Angels in the Outfield! Kathleen Turner delivers a moving and convincing performance as a tough woman trying to succeed in a mans world. You go girl!",
         "Babies and film have a widely celebrated history together. One has to look no further than the 1989 opus, Look Who's Talking, and subsequent trilogy, to see how dynamic the formula translates to film. Ten years later, this breathtaking film was released. Baby Geniuses is just that: a genius work of film starring babies. From the hilarious in-your-face comedy styling of triplet actors Leo, Myles, and Gerry Fitzgerald, to the haunting performance as the Cruella-Deville-inspired villain Dr. Elena Kinder, played by the venerated Kathleen Turner. I'll admit I was skeptical. When I embarked on my initial viewing, I had certain preconceived notions about the nature of babies and their intellect that hindered my enjoyment. After my third or fourth screening, I was hooked. It's all based on the ancient belief that children are born with advanced conceptions of the universe that are lost by the time they enter into the adult world. This long-held belief by many Eastern religions has been shunned and avoided in film for decades. Baby Geniuses, at its heart a social film about the nuclear family and child slavery, confronts the issue head on. This fearless script, endlessly researched, jumps from the actors mouths and rattles the viewer to their core. What begins as an interesting piece of humorous science fiction, ends with a death-defying, heart-pounding final scene as actor Peter MacNicol, who performs all of his own stunts in the film, dangles from the rope of a helicopter\u0097every second ascending, every second pulling him from a safe landing \u0096 a phobia that millions of Americans struggle with day-to-day. I should also mention this film's ahead-of-it's-time visual effects. With limited technology at their disposal, seeing that production was completed in 1998, the team of computer animation experts were able to truly wow me with the babies' seamlessly advanced dexterity and speech. I'm not typically one to conjecture on movie magic and try to decode how certain shots were pulled off, but I do believe that they must have used some sort of puppets on strings and then digitally replaced the heads of the characters, specifically in the now famous John Travolta homage scene. The results are spectacular and will leave audience's 100 years from now scratching their heads at just how they were able to pull this off. The film is a fun, energetic, twisted baby comedy-thriller that will be revered for generations to come. A landmark accomplishment. Run, don't crawl, to go see Baby Geniuses.",
         "I know that many critics say this movie is \"bad\", but they are must be watching with their eyes closed, do they not see the detail, and the amazing effects, not to mention the dead on acting from Lloyd and Turner. Technology like this has not been seen since Forrest Gump, with the mouth moving detail, it'll blow you're mind. And what a story, it really shows what a little imagination and two separated twins can do. Without even going into the \"Mall Montage\" I'll just say that this movie is a MUST SEE for any discriminating movie-goer.",
         "I find this movie funny. Maybe not side splitting, laugh out loud funny but it has a story and it has some good ideas and will tickle you a bit. I don't agree that it is the worst movie of any year as some have said. You have to watch it for what it is. It is simply a little story held together with some nice performances by some kids who probably did not know what they were doing most of the time. I expect it took a lot of editing time to make this happen with the right expressions and timing by the kids. The story holds together, although there is some fantasy in it and at least one hard to believe plot point. I have watched it twice. Once, some years ago and I accidentally watched it again tonight. I thought it was something else (a documentary on smart babies) And I made it all the way through, both times. I don't always make it through movies with no story or bad acting. But this has a good cast, including the twin baby leads (played by triplets), some good lines and it holds together. How bad could it be. There was a sequel and that means that it did make some money and there was some thought by someone that it would make more with the sequel. So take it for what it is. A cutesy little movie with a plot, some evil characters and some fantasy plot points to hold it together and it will be enjoyable. I do not work in the entertainment industry and certainly don't work for any entity connected with the movie but I do think it is not nearly as bad as most here say. Maybe they were embarrassed in some way and were afraid to admit liking it. Whatever! Just see it and judge for yourself. I think you will be pleased at the time spent. miKe",
         "First of all, let me just say that these comments are via my 7 year old son who didn't appreciate the fact that Baby Geniuses was on the list of the 100 worst movies -- and he figured that the vote tally was largely a reflection of adults who just didn't get it! According to him, Baby Geniuses is funny and he likes funny stuff. So it's one of his favorite movies. It's a good story.",
         "I wasn't sure what to expect when I saw this movie (I went to a sneak preview) and boy was I pleasantly surprised! Forget Star Wars, this movie has some of the most amazing technology I have ever experienced! And the concept of talking babies - it's funny! I don't often leave a movie wanting more but I can't wait to see the sequel!",
         "I was shocked to see that it wass listed as so, We are very fond of it and the kids have a ball watching it. What is wrong with not being all blood or about car chases.Come on people, there is more to movies the special effects.Many should rewatch the movie and see the charm it truly holds. Any more movies are all about violence, while this has some of what could be termed mild violence, on the whole it is a film the whole family can enjoy. It is a movie that we will watch over and over. While I wouldnt reccomend making a sequel to it. I would reccomend to my friends and family to watch it. The idea that it is somethign that COULD really happen as far as babies being raised and studied, not the being so intelligent part. You just never know. Give it a chance it doesnt derserve to be on the WORST list."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Crystal Sky Worldwide",
         "Triumph"
      ],
      "summaries": [
         "Dr. Elena Kinder and Dr. Heap work for BABYCO, the world's leading manufacturer in baby products. What the public doesn't know, however, is that Dr. Kinder and Dr. Heap are secretly working on cracking the code to \"baby talk\" which is actually a highly sophisticated language which allows babies to communicate the knowledge of the secrets of the universe with which they are born. Problems arise when Sly, the smartest of the babies, escapes from the lab and unites the babies of the outside world to help free the babies trapped in the lab. Kinder and Heap must find Sly before it is too late.",
         "Two scientists, Dr. Elena Kinder and Dr. Heep use genius baby studies to fund their Babyco theme park. At age two, the children are due to 'cross over', learn to talk, and forget their universal knowledge. One mischievous toddler, Sly, makes repeated attempts to escape the \"Kinder\" lab and one night, he actually succeeds. What Sly does not expect is to run into his twin, Whit, in a mall playground. Although Sly and Whit share a telepathic bond, they have no idea of each other's existence. When the guards from the lab capture Whit, mistaken him for Sly, and take him back to the Kinder lab, Sly is taken home by Whit's adopted mother, who has mistaken him for Whit.",
         "Scientist hold talking, super-intelligent babies captive, but things take a turn for the worse when a mix-up occurs between a baby genius and its twin."
      ],
      "budget": 18000000
   },
   "movielensId": 2555,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1999-03-12",
      "dvdReleaseDate": "1999-07-27",
      "directors": ["Bob Clark"],
      "runtime": 97,
      "movieId": 2555,
      "title": "Baby Geniuses",
      "mpaa": "PG",
      "actors": [
         "Kathleen Turner",
         "Christopher Lloyd",
         "Kim Cattrall",
         "Peter MacNicol",
         "Dom DeLuise",
         "Dan Monahan"
      ],
      "imdbMovieId": "0118665",
      "originalTitle": "Baby Geniuses",
      "genres": [
         "Science Fiction",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["UYQbO20MUOE"],
      "plotSummary": "Scientist hold talking, super-intelligent babies captive, but things take a turn for the worse when a mix-up occurs between a baby genius and its twin.",
      "tmdbMovieId": 22345,
      "avgRating": 1.73427,
      "releaseYear": "1999",
      "numRatings": 1605,
      "posterPath": "/jQfj2mST2uRbRbYG8qKcdqb6JCM.jpg"
   }
}