{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120859",
      "video": false,
      "title": "Telling You",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Deb Freidman",
               "gender": 1,
               "credit_id": "52fe4876c3a36847f81680fb",
               "name": "Jennifer Love Hewitt",
               "profile_path": "/kp8cLdEivtJD5yu8Ij8xMeZ1Jc8.jpg",
               "id": 33259,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Phil Fazzulo",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f81680ff",
               "name": "Peter Facinelli",
               "profile_path": "/jVlwcMxC0mtWttvvSbovybpLrBX.jpg",
               "id": 56857,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Adam Ginesberg",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168103",
               "name": "Matthew Lillard",
               "profile_path": "/gJsQkX20g0ABquHqVpBJzMXR2JF.jpg",
               "id": 26457,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dennis Nolan",
               "gender": 2,
               "credit_id": "52fe4876c3a36847f8168107",
               "name": "Dash Mihok",
               "profile_path": "/jnruNUJv57nNtO66SR3oJ5tQuM5.jpg",
               "id": 6066,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Beth Taylor",
               "gender": 1,
               "credit_id": "566219b0c3a3682bd2000957",
               "name": "Jennifer Jostyn",
               "profile_path": "/ryxfr10cqSMdWQT8oWQG5OBgFQ2.jpg",
               "id": 27739,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Susan",
               "gender": 1,
               "credit_id": "566219c8c3a3682bcd000914",
               "name": "Jensen Daggett",
               "profile_path": "/7wjMKfdyLuIyH803jCQHt0CSbVW.jpg",
               "id": 64733,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Kristen Barrett",
               "gender": 1,
               "credit_id": "566219e3c3a3682bef0009fb",
               "name": "Gina Philips",
               "profile_path": "/m2Th51wF7IUfQe0spOaQmFp1TTP.jpg",
               "id": 56356,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Sal Lombardo",
               "gender": 2,
               "credit_id": "56621a4dc3a3682bd2000976",
               "name": "Frank Medrano",
               "profile_path": "/rMd8vzLUCOGnp3d1mDF1GJJnjvy.jpg",
               "id": 1216752,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Cheryl Tangeray",
               "gender": 1,
               "credit_id": "56621b15c3a3682bd0000973",
               "name": "Shanna Moakler",
               "profile_path": "/bnwl4snot1JUFsfyxXG8QbroP2J.jpg",
               "id": 175604,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Allison Fazio",
               "gender": 1,
               "credit_id": "56621b7c9251412ad50009ad",
               "name": "Charlotte Ayanna",
               "profile_path": "/7gylpOlomdAFyx83NUaQqQqgen0.jpg",
               "id": 6281,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Tommy Spahn",
               "gender": 0,
               "credit_id": "56621c82c3a3682c01000a25",
               "name": "Marc Bossley",
               "profile_path": "/on36hWufuBQd3sZdKzfnT5rBMaw.jpg",
               "id": 1418566,
               "order": 10
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4876c3a36847f816810d",
            "name": "Robert DeFranco",
            "profile_path": null,
            "id": 1016047,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.257591,
      "production_countries": [],
      "id": 53685,
      "vote_count": 3,
      "budget": 0,
      "overview": "Two college graduates who find themselves stuck behind the counter of a pizza parlor while their friends move on struggle to find a new direction for their lives.",
      "similar": [],
      "original_title": "Telling You",
      "runtime": 94,
      "poster_path": "/t4SLO38ADgWTDlRy3fFTFM6OQF5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-08-07",
      "vote_average": 2.3,
      "belongs_to_collection": null,
      "tagline": "Have a Silce of Life",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Rob DeFranco"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Denis Flood",
         "Marc Palmieri"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTEwNTMzMDUwMjBeQTJeQWpwZ15BbWU3MDMyMzkzMjE@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Peter Facinelli, Jennifer Love Hewitt, Dash Mihok | See full cast and crew »"],
      "reviews": [
         "Films are like fires, they start with a spark, warm up and build up the heat or they splutter out and die. This film is somewhere in between; there is a fire burning but it is just that someone comes along once in a while and throws cold water on it. To begin, the film is not really a comedy, it is a serious drama with light-hearted moments. Without the lighter moments you fear the story would be too heavy. What it really comes down to is whether you can empathise with the perfectly cast Dash Mihok as Dennis Nolan. If you've ever found yourself alone out in the yard at night wondering where life went wrong you will click in with Dennis and enjoy the story. So often Mihok manages to convey his pain and confusion without words, so you either understand him or you don't. The film so neatly sets out his problems and then neatly provides the answers. But like all films, there are the scenes we would like removed; the opening monologue by Peter Facinelli is painful and Jennifer Love Hewitt grossly over acts her minor part. The worst is a scene in a club where glamorous females sit alone at tables awaiting for any male to come up and sort out their life. This scene should be put back in the Male Fantasy file where it belongs, but apart from that it offers an original story and some brilliant acting (especially Jennifer Jostyn) though Facinelli's character is too shallow to show his great ability. I might add the original title 'Telling You' is perfect; I cannot believe that anyone who saw it would name it 'Love Sucks as it is marketed in the UK.",
         "Although everyone else who commented detested this movie, I liked it, a lot. I rented it a few months ago, and decided to buy it cheap last week. I think that the slow movement of it was a positive factor, and that it didn't overload or bombard the viewer. It was a lazy, relaxed, detached attitude; the perfect kind of movie to watch on a Sunday afternoon when feeling down on your luck. I think it might be better suited to interpretation as a play, because the action is more verbal than visual. It does make some attempt at developing characters, within its short runtime. The only part I disliked was the ending--unexpectedly abrupt and brief. I will also say, that this movie holds a \"spot in my heart\" for having perhaps the saddest moment I have ever seen in a movie. After Howard (the weird, smart, and nice guy of the five) spends much time and effort into interacting with a girl at the bar, he is brushed off in a terrible and heartbreaking manner that hit home because I know I'll be hearing the same line someday. . .",
         "I don't know why everyone hates this movie so much. I loved it! But I will tell you one thing. *THIS MAY SPOIL IT FOR ANYONE WHO JUST WANTS TO SEE J.L.H* I don't want to ruin it for anyone who likes Jennifer Love Hewitt, but she is in NO WAY the main character. In fact, she's only got a very small part. They probably just put her on the cover to get people to buy it. But, the movie is still really good! I don't know why, but I really like it. Don't listen to any of the people that said it was bad. Because it wasn't. Go out and rent it today!",
         "Saw this on Comedy Central last month. Some of it is downright silly but throughout there was something sad and honest about it. Facinelli and Mihok are great together. Scenes with the old man (who apparently is the Ancient Mariner of Coleridge's epic poem) are compelling but kind of seem out of place. Or maybe not- that's what I mean by weird. The movie has a confused leading character and the story doesn't exactly clear things up, but in a way, that's the point. The actors get to be outrageous but everyone knows these types of people so it's a believable world. Kinda reminds me of that idle time right after college, back at home, and not knowing what, if anything was going to become of life. Good parts, good ending, but it makes very amateur mistakes.",
         "Maybe I am a little biased but that's not the point. This movie is very unique. It incorporates Samuel Coleridge's poem Rhyme (Rime) of the Ancient Mariner into its plot. Jennifer Love Hewitt, although listed as a main character, actually has a small, but hilarious part. Matthew Lillard also has a small part but his strange behaviour is entertaining. Although Peter Facinelli is considered the main character, Dash Mihok is totally the main character. Not only is he hot as gold at melting point, but he is way talented. His acting shines through this role. He probably the only redeeming part of the movie. (Ok, I am totally obsessed with him.) the movie is a good movie to watch at least once because it evokes thought and has a positive message. There are a few grotesque things in the movie.",
         "I caught this film on cable late last night. Admittedly I was desperate to find a film just to waste some time and while away the hours. Surprizingly though I found it really enjoyable. O.K., so it might be best to watch it between the ages of sixteen and twenty-four, although I, for one, look forward to the day when as a forty year old, I happen to be up late one night and find this film once again. The sepia tinted, fuzziness of some scenes is just too corny to watch in comfort but stick it out and you'll probably enjoy this tale of regret and second-chances. The movie even alludes to literary value with its 'Ancient Mariner' motif; a valiant idea. Perhaps this isn't the most glowing review. Circumstances dictated that I came across this purely at the right time but all the same, I know I'll remember this movie for a long time; a corny, yet seminal viewing, I'm telling you.",
         "I rented this movie because I'm a fan of Jennifer Love Hewitt, and I'm actually glad I did so I could warn other unsuspecting fans off this slow, boring and completely pointless production. The only positive comment I can make is that I was actually quite pleased with JLH's performance as the hyper and audible Deb Friedman. Peter Facinelli served little purpose except to give myself and other female viewers some delicious eye candy; his \"Badda Boom Badda Bing\" accent was a complete turnoff and totally over the top. The most abhorrent feature of this film, rather than the plot (which, in all truthfulness, I didn't even understand, and the film ended without me even knowing what happened) was the performance of Dash Mihok. Besides having no chemistry with the other members of the cast (especially the girl he lusted after), his delivery is bland and at times incomprehensible. Bottom line, avoid this stinker at all costs. No stars.",
         "Potentially misleading - Jennifer Love Hewitt's top billing for a minor character - but, appealing nonetheless. A pizza store serves as a backdrop for ruminations on life & lost opportunities. Hard to figure whether the film embraces or condemns the job as measure of success ethos; count this confusion as a strength. Sad to say, Hewitt annoys as a shrill novice fashion-designer - misses \"cute\" sliding straight into \"grating\". The opening dog s*** tale's good (minus the punchline) & \"Soccer Ball\" is the greatest tune The Offspring never wrote. What's with the Coleridge reference? Quality Low-Bud effort.",
         "Denis Flood, the co-writer for this movie is an amazing writer. This was his first work but with a quality piece like this i'm sure he will be back with a second. I don't think this movie could get any better. I think that once D Flood's movies start getting recognized he will be one of the best writers in the world. His dialogs and plot line should make audiences around the world want to see this movie. D Flood will soon be a self made millionaire. Wow, I am going to start a D Flood fan club. Don't u wish your writer was hot like D Flood. D Flood's writing skills are as hot as the Moho Region... no actually as hot as the inner core. The next volcano over the Haiwian hot spot will be named D FLOOD and will be a super volcano that will shoot amazing stories into filmmakers hands around the world. Can D Flood beat his already amazing writing skills with his next movie.. i don't know, do you? D Flood Rep.",
         "This movie is a pathetic waste of time, with a pathetic script, following pathetic characters. The two main characters are recent college graduates who ... are working in a pizza shop? If there was a plot here I didn't see it...basically a bunch of burnouts bumbling through life without a plan. If you're going to see a guilty pleasure high school movie, rent She's all That or Can't Hardly Wait (which, ironically, feature large portions of the cast from this movie). Those are much better done than this drivel."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Division I Entertainment Inc."],
      "summaries": ["Two college graduates who find themselves stuck behind the counter of a pizza parlor while their friends move on struggle to find a new direction for their lives."],
      "budget": 0
   },
   "movielensId": 2556,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-07",
      "dvdReleaseDate": "2000-06-27",
      "directors": ["Robert DeFranco"],
      "runtime": 94,
      "movieId": 2556,
      "title": "Telling You",
      "mpaa": "",
      "actors": [
         "Jennifer Love Hewitt",
         "Peter Facinelli",
         "Matthew Lillard",
         "Dash Mihok",
         "Jennifer Jostyn",
         "Jensen Daggett",
         "Gina Philips",
         "Frank Medrano",
         "Shanna Moakler",
         "Charlotte Ayanna",
         "Marc Bossley"
      ],
      "imdbMovieId": "0120859",
      "originalTitle": "Telling You",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Two college graduates who find themselves stuck behind the counter of a pizza parlor while their friends move on struggle to find a new direction for their lives.",
      "tmdbMovieId": 53685,
      "avgRating": 1.94898,
      "releaseYear": "1998",
      "numRatings": 49,
      "posterPath": "/t4SLO38ADgWTDlRy3fFTFM6OQF5.jpg"
   }
}