{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "rage and hate",
            "id": 3927
         },
         {
            "name": "misanthrope",
            "id": 9622
         },
         {
            "name": "monologue",
            "id": 11635
         },
         {
            "name": "incest overtones",
            "id": 11792
         },
         {
            "name": "unsimulated sex",
            "id": 12420
         },
         {
            "name": "new french extremism",
            "id": 224663
         }
      ],
      "imdb_id": "tt0157016",
      "video": false,
      "title": "I Stand Alone",
      "recommendations": [
         1568,
         18912,
         14019,
         29452,
         10319,
         65296,
         97513,
         33257,
         979,
         42881,
         34647,
         5204,
         18919,
         45698,
         25951,
         62330,
         187864,
         46767,
         39883,
         6077
      ],
      "backdrop_path": "/A7XeFOpYLldBYaxPZxCAbm05e04.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "le boucher",
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032755",
               "name": "Philippe Nahon",
               "profile_path": "/1ZrnApxh9qZz1EdEB1vKWwoFd5B.jpg",
               "id": 5444,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "sa fille",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032759",
               "name": "Blandine Lenoir",
               "profile_path": "/bGEI9iE02Gii7jixkE41PtuGnm7.jpg",
               "id": 17614,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "sa belle-mère",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f803275d",
               "name": "Martine Audrain",
               "profile_path": null,
               "id": 17617,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "sa maîtresse",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032761",
               "name": "Frankie Pain",
               "profile_path": "/n6tU9XjwQer9kvhF5WHLewbEHki.jpg",
               "id": 17618,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "agent immobilier",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032765",
               "name": "Jean-François Rauger",
               "profile_path": null,
               "id": 17622,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "gérant de supermarché",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032769",
               "name": "Guillaume Nicloux",
               "profile_path": "/hnwJUi0pbpB36rzbuBOAAs9V2Vn.jpg",
               "id": 17623,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "narrateur",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f803276d",
               "name": "Olivier Doran",
               "profile_path": "/zW2m0k2ZPFQNRNlBiyLH70kLCQH.jpg",
               "id": 17624,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Dr. Choukroun",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032771",
               "name": "Aïssa Djabri",
               "profile_path": null,
               "id": 17625,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "directeur d'hôpital",
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032775",
               "name": "Serge Faurie",
               "profile_path": null,
               "id": 17626,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032751",
               "name": "Gaspar Noé",
               "profile_path": "/7v4DeEFTX5Uud0JlArnAaGHazRR.jpg",
               "id": 14597,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032781",
               "name": "Gaspar Noé",
               "profile_path": "/7v4DeEFTX5Uud0JlArnAaGHazRR.jpg",
               "id": 14597,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032787",
               "name": "Lucile Hadzihalilovic",
               "profile_path": "/mGl0UN0iGrD4jPSzBvpITggmhni.jpg",
               "id": 17627,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f803278d",
               "name": "Dominique Colin",
               "profile_path": null,
               "id": 17531,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42fec3a36847f8032793",
               "name": "Lucile Hadzihalilovic",
               "profile_path": "/mGl0UN0iGrD4jPSzBvpITggmhni.jpg",
               "id": 17627,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe42fec3a36847f8032799",
               "name": "Gaspar Noé",
               "profile_path": "/7v4DeEFTX5Uud0JlArnAaGHazRR.jpg",
               "id": 14597,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55a904a0c3a3682ff9003442",
               "name": "Gaspar Noé",
               "profile_path": "/7v4DeEFTX5Uud0JlArnAaGHazRR.jpg",
               "id": 14597,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a45d841c3a368586c06a64d",
               "name": "Gerald Kargl",
               "profile_path": null,
               "id": 83863,
               "department": "Crew",
               "job": "Thanks"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.508891,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 1567,
      "vote_count": 116,
      "budget": 0,
      "overview": "The Butcher (known from Noe's short film Carne) has done some time in jail after beating up the guy who tried to seduce his teenage mentally-handicapped daughter. Now he wants to start a new life. He leaves his daughter in an institution and moves to Lille suburbs with his mistress. She promised him a new butcher shop. She lied. The butcher decides to go back to Paris and find his daughter.",
      "similar": [
         3134,
         34647,
         1631,
         2003,
         26338,
         35712,
         11845,
         570,
         1836,
         35717,
         65296
      ],
      "original_title": "Seul contre tous",
      "runtime": 93,
      "poster_path": "/6VsYFr7gsNfGMyiji4tyObEvxzD.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/oA5OLrPPlfbaskzPAo7J4uLydzD.png",
            "name": "Canal Plus",
            "id": 104,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Cinémas de la Zone",
            "id": 1157,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Love Streams Productions",
            "id": 1158,
            "origin_country": ""
         }
      ],
      "release_date": "1998-05-16",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "In the bowels of France",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gaspar Noé"],
      "runtime": 93,
      "synopsis": null,
      "writers": ["Gaspar Noé"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0157016/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MTY2NDcwNV5BMl5BanBnXkFtZTcwMzA1NDAzMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Philippe Nahon, Blandine Lenoir, Frankie Pain | See full cast and crew »"],
      "reviews": [
         "'I Stand Alone' goes where few movies dare these days. It presents a portrait of hatred, disgust, despair and nihilism. Many would probably not like to face up to the fact that people like \"The Butcher\" exist in our society, but they do. By ignoring them we compound the problems they present and represent. Philippe Nahon plays a middle aged unemployed French butcher who is trapped in a loveless relationship with his pregnant girlfriend (Frankye Pain). She has some money and uses it as a power trip, promising to set him up with a new shop. When that doesn't eventuate he attacks her in a fit of rage, and leaves with a gun and three bullets. He heads back to Paris with no money and no prospects. As he sinks lower and lower into hopelessness his anger intensifies, and his mind races with fantasies of violence and revenge. This is a confronting and profoundly disturbing movie, mainly because of it's realism and believability. While it certainly features some scenes of extreme violence, and one scene of explicit pornography (blurred in the print I watched), most of what makes it so powerful and horrible is the almost non-stop venomous monologues of \"The Butcher\". Director Gaspar Noe self consciously apes Scorsese's 'Taxi Driver' in several scenes, but this movie is a truly original vision. Highly recommended for movie buffs with strong stomachs, and the ability to deal with dark and troubling material.",
         "A brilliantly disturbing film, unlike anything I have ever seen. This is an incredibly detailed account of how a disturbed human mind rationalizes everyday reality. It's like looking right into the mind of a man pushed to the brink, a man capable of anything. The film darkly builds as we watch the main character fall lower and lower, becoming more and more desperate. I love a movie that can capture an emotion so strongly, and this film defiantly grabs you and does not let go. The tension literally drips off the screen making it difficult at times to take, but like a car crash, you can't take your eyes off of it. Noe's direction is excellent. The pace is slow and methodical and cut up with a surprising sound affect that makes you jump almost every time you hear it. This just adds to the disturbing, uneasy atmosphere that the film creates. Its a trip that not all people should take, but those of you how are not easily offended, and have a strong stomach and a good eye for art, you should go far out of you way to see this film.",
         "This fearless film may or may not be a masterpiece, but there is little about this film that feels false or inauthentic. Many have already compared this film to TAXI DRIVER; but TAXI DRIVER is more of a film about a man that is dragged to insanity by psychotic fantasies he can no longer resist. TAXI DRIVER does, however, share with SEUL CONTRE TEUS a sense of psycho-sexual determinism. The protagonists in both films are at least partly driven by sexual compulsions they either can not control, feel they can not control or badly desire to explore. Both films have memorable scenes that take place inside a porno theater, emphasizing the dominance sex and sexual compulsions have over each of the protagonists (though for different reasons in each of them). SEUL CONTRE TEUS, however, is less of a film about an inexorable pull toward insanity and instead is more of a film about an inescapable rage -- the rage associated with a fiercely guarded sense of pride that has a strong tendency of violence toward anything that appears the least bit insulting; and a rage that comes from endless feelings of loneliness. The protagonist (known only as \"The Butcher,\" which is his past profession) is consequently very vulnerable to feelings of humiliation and has little ability to make sound decisions in life. SEUL CONTRE TEUS is about the rage of those in the working classes that suffer the pain of a hard childhood, are punished for their crimes that mainly arise out of anger, and endure the humiliation of unemployment and unwantedness -- yet refuse to let the harshness of life knock them down for good. The Butcher refuses to lie down. He wants to fight back at whatever blocks his path. But, like an animal, he chooses his targets arbitrarily and impulsively. Those that he is most threatened by in reality offer little danger; and perhaps could instead offer friendship or even assistance. The film features an astounding interior monologue that runs like an intensely embittered sermon (told through a voice over) throughout the duration of the film. Many of The Butcher's thoughts are intensely provocative and refreshingly, fearlessly insightful and profound. My favorite is probably the line that says (something like) \"there is no revolution anymore; when we are all alone there is only revenge.\" Valuable lines like this are mixed in with incendiary rants against foreigners and homosexuals -- thoughts and emotions rooted in painfully stubborn pride and bitter humiliation, but which sometimes have the feel of some desperate, lost, apocryphal truth to them. There are a couple of other qualities this film shares with TAXI DRIVER. For the most part, even though they are quite frightening, the protagonists in both films are sympathetic (though again for different reasons) and even charismatic. Also, both films have extremely violent climaxes that, thematically and psychologically, resemble the male orgasm gone psychotic. The conflation of sex and violence in both films is unmistakably real and psychologically (and perhaps politically) profound. Also, both films feature a twisted sense of redemption at the end (though I will say no more than that for fear of spoiling the endings of both films) -- twisted in the sense that there is a future and not all hope is lost; but it is a hope that is rooted in something unclean and false. I think most people will find the scene of reconciliation and redemption toward the end of SEUL CONTRE TEUS to be remarkably moving (at least until it turns into something perverse). This film is not for everyone -- that's for sure. If TAXI DRIVER was more than you bargained for, then stay away from this film because this film is even more intense and brutal. But for those of you who desire, or even need, to see a film about the rage of a man who is disenfranchised and dispossessed and is driven toward fantasies and expressions of violence and perversity -- then here it is. This is for you.",
         "Good, well-directed French film in the vein of TAXI DRIVER, where an out-of-work, 50-year-old butcher slowly begins to lose control with the people and the world around him as he encounters one indignity after another. Unable to find a job no matter how hard he tries, having to contend with abuse from the fat and controlling dominant woman he lives with just because she has a few dollars, facing the burden of having fathered an illegitimate girl who now lives in a home and is unable to communicate, the tensions mount until the butcher is in danger of taking his frustrations out on himself and the miserable scum around him. The butcher's bizarre feelings and motivations are translated to us through what he's thinking, instead of relying on talk. This is a brutal, honest, powerful movie that pulls no punches and draws the viewer into the mind of the man slowly going over the edge. Many people will be able to relate to feeling as lost and hopeless as he does, at least at some dark point in their lives. Here is a foreign film that succeeds in staying consistently interesting and captivating, despite its not having a plethora of special effects and pretty young teen stars (which so many recent American films seem to require). *** out of ****",
         "Wow, I need to take a shower. This is the kind of film Godard would have made if he'd grown up with THE TEXAS CHAINSAW MASSACRE instead of THE MALTESE FALCON. Based on this and Noe's new film IRREVERSIBLE I'd say Gasper's got a few issues he's hammering out and he's taking us down into the depths with him. It's a very well made film. He uses one repetitious devise that just about gave me a heart attack the first time it was used. I won't tell you what it is, but I wouldn't recommend this film to anyone who suffers from a hyperactive nervous system. If you have a strong stomach and love great filmmaking, though, I'd definately recommend this artistic, sadistic shocker.",
         "The movie shocked me, it made me feel sad, sorry and ashamed. It shows how a potentially good human being can become bad due to the lack of love in our society. Society and it's egoism, loneliness, selfishness, and individualism affect all humans. Some more than others. This movie is a rather extreme example, but it is definitely what is needed to shake you and make this world a better place. Some might interpret it as a useless display of bitterness and turn their head to keep on living their \"comfortable\" lives. Probably most will do that by fear of confronting such a terrible reality. With that attitude nothing will change. I see the main's characters attitude as the natural consequence of a society without love, a society where everything is given in exchange of something (natural consequence of capitalism). Unfortunately people living afraid and with no love are everywhere. Their acts are a consequence of the extreme individualism and lack of interest of human beings towards others, hence the lack of care for themselves, hence the lack of love. \"Life is a selfish act\". Unfortunately our society, or in other words ourselves, act selfishly. As long as that keeps on going the world will be a sad, boring and lonely place. I have faith in humanity and in living in a world of care, respect, tolerance and responsibility towards the rest. Unfortunately we still have a looooong way to go. I recommend it to everyone, specially the ones who do not like facing reality and prefer living in \"comfort\". They need it more than anyone. I give it a well merited 10.",
         "Gaspar Noë's first full-length film seeks to provide, and sometimes achieves, an elegantly bleak picture of the world through the eyes of a French butcher whose life has been devolving from day one. The film begins as a kind of quick documentary life, narrated over still photos with the voice-over of the butcher, played by Philippe Nahon. From here forward the voice never leaves us, moving relentlessly forward with its declarations of gloom and anger. The narrator's negativism commands our attention and even our respect because of its intensity and clarity. Perhaps this man is just a depressive, a hopeless loser. But his anger and his articulateness command attention and create an irresistible and memorable voice -- a voice quite reminiscent of the writings of Louis-Ferdinand Céline (\"Journey to the End of the Night,\" \"Death on the Installment Plan\"), who like Noë's protagonist was a nihilist, fascist, and anti-Semite, and likewise shocked with his bluntness of expression. Set in 1980, the story of \"I Stand Alone\"/\"Seul contre tous\" may also be meant to reflect the thinking of a certain French underclass of that time whose desperation and resentment toward growing minorities in the country and toward the rich and the liberal bourgeoisie led them to rally behind the far right political leader Jean-Marie Le Pen. Philippe Nahon is strong in the central role. Indeed one can hardly imagine anybody else playing it. But all the characters Nahon interacts with tend to be little more than static cameos. There are even moments when we are not sure they exist, or when his declarations seem like fantasies, and this uncertainty undermines the otherwise forceful narrative. Unfortunately also the film tends to disintegrate into excess verbiage and alternative finales in its last chapters. The nonstop narration has seemed to work well up to then, but when Noë resorts to an overlapping second voice and approaches the father's sexual violation of his daughter through panning off into the street, the voice-over becomes a wall preventing us from experiencing what's been dealt with and the hitherto blunt manner -- the obscene slangy language and the gun-shot blast divisions of images and the boldly declarative intertitles (Noë is of the nothing-succeeds-like-excess school of film-making) -- comes to seem a bit of a facade. As in the later \"Irréversible\" it seems as though the director's desire to shock and exploit ingenious and attention-getting cinematic techniques is greater than his willingness to develop a story and characters in depth. Nonetheless there are strong signs of a bold and original talent on display here, and of an independent point of view. The respected critic Jonathan Rosenbaum went overboard when he classified \"I Stand Alone\" as a \"masterpiece.\" Noë strives so hard to achieve profundity he dupes himself into the certain conviction that he has achieved it. Whether \"I Stand Alone\" will stand the test of time is a question only time, not Noë or Rosenbaum, can decide. The film is not particularly well served by a Strand Leasing DVD providing a slightly blurry print and no extras. The Menu design however is rather handsome. Watched on Netflix DVD November 2005.",
         "In the last couple years, french filmmaker Casper Noe has created quite a name for himself. With two full length films that are both extreme and psychologically disturbing. \"I Stand Alone\" is not as disturbing as Noe's \"Irreversible\", but it still is a bumpy ride that some people might not be prepared for. The main character is the jobless butcher, who is featured in Noe's other films. The film narrates the history of the butcher's life and all the hardships he has faced. It's 1980 in the film, and the butcher can't find a job. He lives with his whiny pregnant girlfriend along with her mother. The butcher's mute daughter seems to be the only person he cares about. Throughout the film, we hear the thoughts of the butcher, which are angry, hateful and horrifying. He's at the point of a midlife crisis, and wants to now live his life for vengeance. Peace of mind through a hand gun, so to speak. He slowly starts to loose his sanity as he endlessly searches for a job, and is turned down repeatedly. The film is very bleak like \"Taxi Driver\" and \"Bad Luitenant\" and psychotically tense like \"Clean Shaven\". Viewers are even warned before the disturbing finale. Let's just say the butcher loves his daughter a little too too much. Casper Noe takes us inside the mind of a man who's sometimes racist, misogynistic and homophobic but is still sympathetic towards the character's insanity. In fact, I felt so bad for the butcher that the film made me almost cry. It has such poetic emotion. I have to say, \"I Stand Alone\" and \"Clean Shaven\" are the two films which portray mental illness the most realistically. I say this because I have suffered with mental health problems since I was young, and have been on many medications. At one point of my life, when I was working 70 hours a week and on two medications, I almost had a similar emotional breakdown like in the film. That's why I can identify with the butcher. The film is so gritty and realistic in it's portrait of insanity. Many people will probably find the finale frightening. \"I Stand Alone\" is a masterpiece of psychological drama and intensity unlike any other film. Casper Noe just may become this generation's Roman Polanski. I can't even imagine what he's going to do next.",
         "Stunning. The writer-director Gaspar Noe's first-person account of a jobless butcher's trip on the down escalator has a lot of superficial resemblances to TAXI DRIVER, but the real unseen hand behind this shattering picture belongs to Louis-Ferdinand Celine, whose scabrous stream-of-consciousness monologues Noe has translated into scorching, nineties angry-white-man-ese. As the butcher's three hundred francs dwindle, and his handgun starts looking more and more appealing, Noe surgically implants us inside the antihero's head using a cascade of hilarious and horrifying nihilistic rants that don't quite resemble anything you've ever heard in a movie. Noe's ingenuity in reinventing the subjective style of TAXI DRIVER is near-limitless; his array of techniques dazzles, from the Godardian intertitles that break the action like a butcher's cleaver hammering a wooden cutting board, to the deafening gunshots accompanied by digital pans and zooms that throw a Brechtian bucket of icewater on the proceedings whenever they calm down. At times the picture suggests one of Fassbinder's fatalistic fables staged as a William Castle horror movie; in a stroke of genius, Noe conceives of the inevitable crack-up finale not in terms of some novel spin on the image, but as a blizzard of scurrilous language--a head self-narrating to the implode point. At times, the butcher's and Noe's nihilism seem to be one--and a posturing, collegiate nihilism it can be. And the penultimate section of the movie thunks along as Noe recreates painfully familiar scenes from TAXI DRIVER almost in toto. But the cumulative effect of the movie is lacerating, the way early Scorsese and Toback must have felt the first time out. French-language cinema hasn't gotten this kind of wake-up call since the (lesser) MAN BITES DOG.",
         "This is Gaspar Noe's deliberately disturbing film of one man's resentment of his own life. It's a highly cinematic monologue of malevolence by a volatile, middle-aged protagonist. The film's brilliance comes from the daring moralism it projects right up to it's startling conclusion. Without giving anything away, this is a mean-spirited, convincingly fiendish love story that sadistically gives it's audience a 30 second chance to leave the theater before things get resolved. A absolutely terrific monster movie for mature audiences only!"
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Canal+",
         "Les Cinémas de la Zone",
         "Love Streams Productions"
      ],
      "summaries": [
         "The Butcher (known from Noe's short film Carne) has done some time in jail after beating up the guy who tried to seduce his teenage mentally-handicapped daughter. Now he wants to start a new life. He leaves his daughter in an institution and moves to Lille suburbs with his mistress. She promised him a new butcher shop. She lied. The butcher decides to go back to Paris and find his daughter.",
         "France, 1980. A retired horsemeat butcher fights to survive. After abandoning his teenage daughter, and hoping to rebuild a new life, he moves to Lille with his pregnant lover. He doesn't love her. He likes even less living at his mother-in-law's apartment. Quickly his hopes turn into bitterness, and this bitterness into obsessions. Violence explodes. The man returns to Paris and tries to restart his life again. He counts on his luck to find work and new friends. But both are hard to find. In this city, like elsewhere, living is a selfish act. Alone against everyone the ex-butcher stays in the hotel room where many years ago his daughter was conceived. Without a penny and with the sole company of a gun charged with three bullets, he doesn't see clearly what the purpose of his life is. His stomach cries for food. His brain orders him to take revenge. And his heart...",
         "A horse meat butcher's life and mind begins to breakdown as he lashes out against various factions of society while attempting to reconnect with his estranged daughter."
      ],
      "budget": 0
   },
   "movielensId": 2557,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-05-16",
      "dvdReleaseDate": "2001-06-05",
      "directors": ["Gaspar Noé"],
      "runtime": 93,
      "movieId": 2557,
      "title": "I Stand Alone",
      "mpaa": "",
      "actors": [
         "Philippe Nahon",
         "Blandine Lenoir",
         "Martine Audrain",
         "Frankie Pain",
         "Jean-François Rauger",
         "Guillaume Nicloux",
         "Olivier Doran",
         "Aïssa Djabri",
         "Serge Faurie"
      ],
      "imdbMovieId": "0157016",
      "originalTitle": "Seul contre tous",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "a2LrPPzQhkM",
         "ruL-zmpbYxo"
      ],
      "plotSummary": "The Butcher (known from Noe's short film Carne) has done some time in jail after beating up the guy who tried to seduce his teenage mentally-handicapped daughter. Now he wants to start a new life. He leaves his daughter in an institution and moves to Lille suburbs with his mistress. She promised him a new butcher shop. She lied. The butcher decides to go back to Paris and find his daughter.",
      "tmdbMovieId": 1567,
      "avgRating": 3.77425,
      "releaseYear": "1998",
      "numRatings": 299,
      "posterPath": "/6VsYFr7gsNfGMyiji4tyObEvxzD.jpg"
   }
}