{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "venice",
            "id": 110
         },
         {
            "name": "inquisition",
            "id": 344
         },
         {
            "name": "beauty",
            "id": 3258
         },
         {
            "name": "courtesan",
            "id": 4178
         },
         {
            "name": "16th century",
            "id": 208244
         }
      ],
      "imdb_id": "tt0118892",
      "video": false,
      "title": "Dangerous Beauty",
      "recommendations": [
         63020,
         40562,
         28029,
         74026,
         20024,
         27283,
         47452,
         17771,
         26290,
         45609,
         18451,
         53905,
         17941,
         22625,
         249724,
         46278,
         51363,
         47907,
         54994,
         23941
      ],
      "backdrop_path": "/mTTfuEc6LMYdyw8Ck3Pnm6ZJ4NO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Veronica Franco",
               "gender": 1,
               "credit_id": "52fe44afc3a36847f80a4389",
               "name": "Catherine McCormack",
               "profile_path": "/a8Jszh3rHQ2T4u1VyE4lXrb0uDI.jpg",
               "id": 2462,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Marco Venier",
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a438d",
               "name": "Rufus Sewell",
               "profile_path": "/f2PNMnztHluTOw8YfCJUZ2pKfbe.jpg",
               "id": 17328,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Paola Franco",
               "gender": 1,
               "credit_id": "52fe44afc3a36847f80a4391",
               "name": "Jacqueline Bisset",
               "profile_path": "/ys2YfG4d26jUiGvok0jplWgUhzP.jpg",
               "id": 14061,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Maffio Venier",
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a43b3",
               "name": "Oliver Platt",
               "profile_path": "/an9n3aUKFAN50GDsbqwIkvWlcus.jpg",
               "id": 17485,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Giulia De Lezze",
               "gender": 1,
               "credit_id": "52fe44afc3a36847f80a43b7",
               "name": "Naomi Watts",
               "profile_path": "/8W02WOJI1pEGh2iqQsgITR5tV0P.jpg",
               "id": 3489,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "King Henry",
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a43bb",
               "name": "Jake Weber",
               "profile_path": "/b0Qaj3mE1BfV1areG4EulYDGKHe.jpg",
               "id": 4177,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Courtesan",
               "gender": 0,
               "credit_id": "5995bf25c3a3683dc1000eb8",
               "name": "Patrizia Leonet",
               "profile_path": "/g2byjp2pyCmTQCz6bU3vpeX5NkO.jpg",
               "id": 1871254,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a437f",
               "name": "Marshall Herskovitz",
               "profile_path": "/lx7aETWxebJ28hALsM4vouFrmZB.jpg",
               "id": 9182,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44afc3a36847f80a4385",
               "name": "Jeannine Dominy",
               "profile_path": null,
               "id": 55389,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a4397",
               "name": "Edward Zwick",
               "profile_path": "/ucBi071XeIGMEHaEGKtU6PN1FwN.jpg",
               "id": 9181,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a439d",
               "name": "George Fenton",
               "profile_path": "/23V03rGdkvNgeiBwLodJzNKdhJC.jpg",
               "id": 1528,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a43a3",
               "name": "Bojan Bazelli",
               "profile_path": "/2UcvIkDpDeKLUwickH8zZuBCFY4.jpg",
               "id": 11699,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a43a9",
               "name": "Steven Rosenblum",
               "profile_path": null,
               "id": 2484,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44afc3a36847f80a43af",
               "name": "Arthur Coburn",
               "profile_path": null,
               "id": 800,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.473916,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8583,
      "vote_count": 72,
      "budget": 0,
      "overview": "Veronica is brilliant, gifted and beautiful, but the handsome aristocrat she loves, Marco Venier, cannot marry her because she is penniless and of questionable family. So Veronica's mother, Paola, teaches her to become a courtesan, one of the exotic companions favored by the richest and most powerful Venetian men. Veronica courageously uses her charms to change destiny -- and to give herself a chance at true love.",
      "similar": [
         192,
         4517,
         657,
         23047,
         9870,
         1579,
         1213,
         1934,
         2270,
         80752,
         346,
         652,
         9654,
         89,
         698,
         931,
         9374,
         310593,
         9889,
         314
      ],
      "original_title": "Dangerous Beauty",
      "runtime": 111,
      "poster_path": "/vSGDmTsjaD2yZrS73nUJ4ikPqjQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Bedford Falls Productions",
            "id": 348,
            "origin_country": ""
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Arnon Milchan Productions",
            "id": 25087,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-02-20",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Born without privilege. Bound by tradition. She found the courage to follow her heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marshall Herskovitz"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Margaret Rosenthal",
         "Jeannine Dominy"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0118892/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzOTYyNDMzMV5BMl5BanBnXkFtZTYwODgzOTE5._V1_SY317_CR9,0,214,317_AL_.jpg",
      "actors": ["Stars: Catherine McCormack, Rufus Sewell, Oliver Platt | See full cast and crew »"],
      "reviews": [
         "For me the power of this movie rests in its faithfulness to Margaret Rosenthal's book the Honest Courtesan; which is a well-researched look at Veronica Franco's life and the plight of Venetian women in the 16th century. Dangerous Beauty, while making certain assumptions and taking some literary license, was a talented translation of Rosenthal's careful research into a captivating film. Many of the witty remarks and social commentary come directly from 16th century documents. Surprisingly the most unbelievable aspect of the movie (her escape from the Inquisition and support from prominent Venetian nobles) is historical fact. While the details are unknown and the movie is certainly more romatically dramatic than I would imagine the actual historical event, it was very true to the spirit and feel supported by the evidence we have. Venetian women, and indeed most medieval women, were in an unenviable position as second class citizens. Veronica Franco's struggle to find an acceptable position in society as a woman of good family but poor, is representative of the moral and societal conflicts of her time. Courtesans were not respected but they were accepted as a necessary evil. Their income was even taxable! In a society where female chastity was considered sacrosanct if she were to marry and a marriage bed was no less for sale than a courtesan's, women's choices were limited indeed. Franco's impassioned cry in the movie \"I did what was necessary to survive!\" is no less true were it not a verbatim report of her defense. As a penniless girl her options were limited to scullery work, the nunnery or prostitution. Her distinction was that, while she chose to sell her body, she never chose to be dominated by her profession or those who sought her out. In publishing her book of poetry and personal letters, she redefined herself as a woman first and a courtesan second. Using her wit to defend herself in the public arena she skillfully manipulated accepted literary mores of the day to show her mastery of the literary as well as political implications of her position. Her greatest detractors were courtiers, such as Maffio Venier, who competed with courtesans for the money bestowed by wealthy patrons. As she says in the movie, they must both sing for their suppers. The problem is that while she is willing to accept they are equal in their need of patronage, he is unwilling to be outdone by a woman. His misogynistic works of poetry were directed toward Franco and other courtesans with the intent of parading his own virtue by damning theirs. The greatest irony is that Maffio was ultimately killed by a sexual disease while Franco died of causes unrelated to her sexual practices. While there are those who might see this movie as an acceptance of prostitution, I believe they are missing the true story behind the sexual facade which they are focusing on. Franco's life was one of courage and honesty. She made choices that we may not understand, but we do not live in her world. And she accepted both the privilege and the degradation that her position brought her. This movie is a powerful tribute to one who sought more in life than mere existence and who faced her trials with the courage of her convictions, whether or not we or others share those convictions is immaterial.",
         "A very under rated movie... The visuals are amazing, and really opens up your eyes to a piece of history that is generally ignored. Veronica Franco was a real person, and Catherine McCormack does her justice. The movie is not the speediest, but the learning process, and the development of the situation is excellent. The music is also very good, I believe by George Fenton, and suits and supports the music and is worth the listen all on its own. Even my husband loves to watch this movie with me, and its one of our well beloved date movies, sensual, moving, yet ultimately triumphant. In an odd sort of way, I got an almost female version of Braveheart in the courtroom scene at the end... Try it! It's worth it!",
         "This particular movie was lost in the shuffle somewhere but I am certainly glad I found it. Catherine McCormack (Braveheart) portrays an innocent girl, that loses in love so decides to do what she has to do just to have him any way possible. It's a very backwards Cinderella. A good girl that falls in love with a \"prince\" (he's from a family with a title and she's not) but will true love prevail? Rufus Sewell is to die for, the sexiest and most talented actor to come our way in years. The rest of the fine cast Oliver Platt, Moira Kelly, Naomi Watts, Fred Ward and Jacqueline Bisset are very convincing in their portrayals of these period characters. I have had every single one of my friends watch it and they all have enjoyed it as much as I have. The music is fantastic and we even get a short history lesson. With this sensational cast, the storyline that is based on actual poetry books from a Courtisan, it really is my favorite historical romance of all time. Take the time to find this rare gem and see it as soon as possible.",
         "There's a consistent moral thread that runs through every society from age to age and generation to generation, the tenets of which are established within parameters, and therefore subject to change; or more specifically, subject to a change in perspective. And that change can come very quickly-- veritably over night in some instances. There is also another constant that defines the human condition in any era, and as we find in `Dangerous Beauty,' directed by Marshall Herskovitz, it is the fact that an individual will do whatever is necessary to survive. It is simply an undeniable, irrefutable basic instinct of the human animal. Moral tenets and survival, however, taken as properties are something akin to oil and water, and will mix accordingly. Being more often than not polar opposites, conflict is inherent and will ultimately surface at some point or other, the outcome of which is determined by the strength of whichever perspective is prevalent at the moment. And it is at such moments that we discover that life, like politics, can be a sordid, unpleasant affair; or at the other end of the spectrum, the greatest gift of all. It's 16th Century Venice; Marco Venier (Rufus Sewell) is of a wealthy and powerful family, and is a Senator in good standing in the community. He is also in love with Veronica Franco (Catherine McCormack), who though intelligent and beautiful, is beneath Marco's station in society, and they are, therefore, forbidden to marry. Instead, Marco's father, Pietro (Jeroen Krabbe), has arranged a marriage for his son, an alliance that will be to the substantial benefit of both families. Veronica's family, meanwhile, due to prevailing circumstances must look to Veronica for support, so her mother, Paola (Jacqueline Bisset), not only arranges for Veronica to become a courtesan, but instructs her herself in the fine art of seduction and the kind of pleasures that will put the most coins in the coffers, as well as how to survive by being in love with `love.' For Veronica, it soon becomes a lucrative, if not fulfilling enterprise, but there are clouds forming on the horizon, the least of which involves an impending war with the Turks, a war they cannot win without the help of King Henry (Jake Weber) of France. Very quickly, life in Venice changes; Marco is off to war, and the formerly open acceptance of the courtesans undergoes a swift and drastic reversal of perspective among a seeming majority of those within the city. And once again Veronica's life is in flux; and she is about to find out that it will never be the same again. Nicely presented and beautifully filmed (the cinematography by Bojan Bazelli is exquisite), Herskovitz's film-- which is based on a true story and adapted from Margaret Rosenthal's novel by screenwriter Jeannine Dominy-- succinctly points up the moral hypocrisy that has always existed within any given culture or society, and which will continue to exist so long as there are social institutions and structures to support them. And the possible consequences of such diverse perspectives and attitudes, when zealously pursued, are effectively personified in the character of Maffio Venier (Oliver Platt), in whom we find the ultimate manifestation of moral decay, masked by platitudes of self-serving righteousness. Herskovitz also effectively uses the relationship between Veronica and Maffio-- initially a mutually agreeable rivalry; a contest of words which later turns aggressively ugly-- as a reflection of how readily one facet of society will turn on another if but afforded the appropriate circumstances. It's a film that works well on a number of levels, as on one hand it's a love story, while on the other it's an insightful dissertation on the inherent imperfections of society, and the fragile moral fiber that holds it together. In the title role, McCormack gives a solid performance; that Veronica is beautiful is obvious, but most importantly, McCormack conveys her intelligence, as well, and it makes her character three-dimensional and quite convincing. Interestingly enough, Veronica is a sympathetic character for whom, nevertheless, you do not necessarily feel sorry; and perhaps it's because she carries herself so well and has such a strong sense of `victory' about her, hiding any vulnerability that would make her susceptible to pity. This is a woman who takes the detritus life throws at her and makes something of it-- and she does it with dignity. If her life is morally compromised, it is not due to any acquiescence on her part, but rather the need and the will to survive. This is a complex character who has to tread a number of fine lines, and McCormack plays it beautifully and believably. As Marco, Sewell hits his stride and turns in an excellent performance, as well. Marco is something of a pivotal character, in that Veronica's response to him and their relationship becomes the most telling expression of the effects of the courtesan life on her. And as the story unfolds, Sewell does a nice job of developing his character, finally achieving a depth of emotion that significantly heightens the impact of the climax. In supporting roles, both Platt and Bisset give notable performances, too. Platt once again demonstrates that he is one of the best character actors in the business; and not only is Bisset exemplary in the role of Paola, but the casting of her and McCormack as mother/daughter was inspired. The supporting cast includes Moira Kelly (Beatrice), Naomi Watts (Guila), Fred Ward (Domenico), Joanna Cassidy (Laura), Peter Eyre (The Doge), Justine Miceli (Elena), Carla Cassola (Caterina), Michael Culkin (The Bishop) and Charlotte Randle (Francesca). As Michael Corleone said at one point, `We're all a part of the same hypocrisy;' and if there's a lesson to be learned from `Dangerous Beauty,' it's that one should not deign to pass judgment on another without first walking in that person's shoes. It also reminds us of the necessity of maintaining a proper perspective-- and keeping in mind that what's acceptable today may not be acceptable tomorrow. 8/10.",
         "To call Dangerous Beauty an adaptation of Margaret Rosenthal's The Honest Courtesan is beyond insulting to Ms. Rosenthal \u0096 it's bewildering, quite frankly. The Veronica Franco depicted in Rosenthal's rather scholarly and unsentimental biography was a feminist heroine and a rather unusual figure for her or any time. Veronica Franco in Herskowitz's pretty romance novel is anything but a feminist heroine, for all the Lifetime channel rhetoric. First, a few historical corrections. According to Ms. Rosenthal's scholarship, Franco's meeting with Henri III (then King of Poland, not yet of France and not there at request of the Doge) was more important to her poetry than Venetian politics or her sex life, her trial before the inquisition was quite different, her relationship with the Veniers was far more professional and her life in general was far less dependent on men, let alone a man. Henri III was traveling through Venice when Franco entertained him at her home and may well have slept with her. However, the relationship seemed more courtly than sexual \u0096 Franco even gave him gifts on his departure, two sonnets and a miniature. What Rosenthal remarks on are the sonnets she wrote in tribute to Henri in true (masculine) court style and the likelihood that Franco was trying to collaborate with other poets on a book in the future King of France's honor. Franco's poems on the event were courtier's poems and not love poems; in fact, she pulled of the rather difficult task of using the story of Jupiter and Danae as a model for her poems and undermining the eroticism her contemporaries (men) highlighted when using that myth. Franco often reclaimed overly sexualized female figures and made them into civic, public figures \u0096 a pity that Herskowitz and script writer Dominy do the reverse to Franco. Franco's trial before the inquisition wasn't the maudlin thing it was in the movie, either. It wasn't even public and her accuser was a disgruntled and unpaid tutor, claiming she participated in rituals and other rites in her house. Veronica got out of it basically by admitting to allowing her servants to have these rituals and participating in them at times, but she never believed in it and it wasn't a sin or demonic if one didn't believe in it. She was hardly the only person to be pulled before the inquisition at the time \u0096 Domenico Venier, her patron, was also brought before the inquisition because of a servant. Rather than having to defend her sexual behavior, she was in the position many men found themselves in. Their financial or employment practices irked a servant and the servant accused them of heresy. Unsexy as it is, Veronica's trial could be more easily compared to Martha Stewart's trial than to the sentimental theatrics in Herskowitz's film. Historically speaking, there is no reason to believe that Marco and Veronica were as close as the film shows. They were friends and fellow poets with great respect for the each other's work, certainly, and quite possibly lovers. Veronica had many lovers, though, and she did not ride off to some 'happily ever after' with Marco at all. There were other lovers she seemed to be more passionate about, including those who fathered some of her children, also left out of the film. So, as a historical drama it fails because it ignores historical fact and I think it fails even more as a feminist revision. I don't think Franco's story needs any revisionism to be feminist, and certainly not of this kind. When the heroine is more than happy to commit herself entirely to a man who has no qualms about publicly humiliating a wife who never injured him and sees nothing wrong with demanding Veronica's fidelity without offering his own, I can't consider her a feminist role model. When a film cheerfully sets up a dichotomy between the sexually adventurous but ultimately submissive mistress and the frigid, demanding wife, I can't call the film exactly a paragon of feminist values, especially when the mistress wins out. Why was there no sympathy for Guilia, who seemed quite unhappy with her lot and had no way out? Why no pretty speech about perpetual inconsequence for her, especially when she's the one is consigned to that more than any of the others. Apparently, if a woman isn't ready to be cheerfully sexually accessible to a man who can afford her, she doesn't deserve decent and respectful treatment from her husband. How this is a liberating message escapes me. The only level this film does work is as a guilty pleasure, and on that level it's fantastic. The cast is pretty, the set is pretty, the costumes are pretty, the music is pretty (if a bit sentimental and overpowering) and if you don't think about it too hard, it's a nice fairy tale. Had they not tried to base this on real people and had they deleted the ridiculous, Maxim-friendly just-do-me-feminism, it would have been a satisfying romance novel of a film. However, in trying to give this substance, they made it at best vaguely offensive.",
         "I saw this when it first came out and I just saw it again on video. Superb movie. I adore Venice and feel I got a real taste of what it must have been like in the 16th century. Great photography and costumes. Beautiful actors. Comedy. Romance. Based on a true story. Shows some of the ugliness of the zealot church of the time. A must see and one of the year's best. Where were the critics on this one? Played to empty theaters mostly. What a shame.",
         "In 1583, Venice is the richest and most decadent city in Europe and its women are treated like property and few even knew how to read. The youth and witty Veronica Franco (Catherine McCormack) and the wealthy Marco Venier (Rufus Sewell), who is the brother of her best friend Beatrice (Moira Kelly), are in love for each other, but her mother can not afford the dowry for their marriage. When Marco tells Veronica that they can not marry to each other because he should have a marriage of state and his parents would oppose due to their social differences, Veronica's mother Paola Franco (Jacqueline Bisset) tells her heartbroken daughter that she was a courtesan in the past, and now Veronica shall learn how to be a courtesan to support the family. The poetess Veronica becomes the most famous courtesan in Venice, loved by the powerful elite except Marcos. When the Turks threaten Cyprus, Veronica spends the night with King Henry (Jake Weber) and he gives the necessary ships to protect Cyprus. When the Inquisition comes to Venice, she is accused of witchcraft by the Church. \"Dangerous Beauty\" is one of the most beautiful love stories I have ever seen, and based on a true story. Catherine McCormack is extremely gorgeous and this is probably her best role along her career, with a stunning performance. This movie is quite perfect, with a wonderful story, excellent screenplay, magnificent direction, witty dialogs, a fantastic cast and awesome cinematography, set decoration and costumes in the environment of Venice in the Sixteenth Century. It is impressive how this movie excited me with the most different emotions and I have just included it in my list of favorites. My vote is ten. Title (Brazil): \"Em Luta Pelo Amor\" (\"In Fight for Love\")",
         "Four of us (aged 40 - 50) saw this on video and thoroughly enjoyed it. The speeches at the end provide us with the finest acting and script that is available. The film is a bit slow in the beginning, but don't give up because this is one incredible piece of dramatic art.",
         "I LOVED this movie. It is especially gripping when you stop to realize it is based on a true story! It's lead character is based on Veronica Franco, citizen and writer from sixteenth century Venice. Margaret F Rosenthal wrote about her in \"The Honest Courtesan\". The acting is superb...the period costuming is fantastic. As is the scenery. This is a must see on many levels. The courtesans in this era were intelligent, witty, and refined. Married woman of the time (the wealthy ones) were confined to a very dull life while their husbands entertained themselves with well educated courtesans. The courtesans were the only women allowed in the libraries of the day. As much as I love books...there is no doubt in my mind as to what role I would have chose! lol The movie revolves around those of wealth. The poor women of the day are in terrible straits...I'm glad this era is over. Seriously, this is a wonderful movie visually. And, it is spiced with some interesting bits of history. It is not one to take your kids to which usually causes me to deduct points. But, the scenes that make it unsuitable for children are absolutely essential for this story. And, what a wonderful story! Oh, and another delight is the music. Buy the CD!",
         "OK, let's face it, the reason I saw this was because of potential chemistry between Catherine McCormack and Rufus Sewell. I love both of them as actors, and I was psyched when I heard they were in a movie together. Then I looked at the plot, and was intrigued. I'd seen a movie similar to this, Moulin Rouge. Hmm, would it be as good as that? Would it be a let down? Looking at the title and the cover, I wasn't expecting too much. Soft porn, maybe? Eh, probably. But I rented it anyways, simply because I was in the mood for a period piece, and Rufus Sewell is easy on the eyes. :) The movie ended up becoming one of my absolute favorites. It is sumptuously filmed, gorgeous, like staring at a beautiful painting for hours. Every piece of colors and cinematography is top notch. The acting between Sewell and McCormack is amazing, astounding. I fell in love with their romance. The film hasn't left me long after I saw it. The score is brilliant. George Fenton is an emotional genius. If you want to hear more of his stuff just check out Ever After, starring Dougray Scott and Drew Barrymore. :) I really want to buy this movie. It works so well, and it is just really, really good. It's a movie to be felt, not explained. If you love intriguing plot lines, romance, and period pieces, then I highly recommend you check this out. :)"
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Regency Enterprises",
         "Arnon Milchan Productions",
         "Bedford Falls Productions"
      ],
      "summaries": [
         "In 16th century Venice, courtesans enjoy unique privileges: dressed richly in red, they read, compose poetry and music, and discuss affairs of state with the men who govern the Republic. When Veronica Franco comes of age, she cannot marry Marco Venier, whom she loves, because she is well born but penniless. Her choice: cloister or courtesan. She steels her heart, and with beauty and intelligence becomes the best. She's a heroine when she helps convince France to aid Venice in war with Turkey, but when plague descends, the Church charges her with witchcraft. At her inquisition, she must match wits with an old rival, speak for all women, and call courage from Venier.",
         "A Venetian courtesan becomes a hero to her city, but later becomes the target of an inquisition by the Church for witchcraft."
      ],
      "budget": 0
   },
   "movielensId": 2563,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-02-20",
      "dvdReleaseDate": "1998-10-27",
      "directors": ["Marshall Herskovitz"],
      "runtime": 111,
      "movieId": 2563,
      "title": "Dangerous Beauty",
      "mpaa": "R",
      "actors": [
         "Catherine McCormack",
         "Rufus Sewell",
         "Jacqueline Bisset",
         "Oliver Platt",
         "Naomi Watts",
         "Jake Weber",
         "Patrizia Leonet"
      ],
      "imdbMovieId": "0118892",
      "originalTitle": "Dangerous Beauty",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["xYu37jF0d3c"],
      "plotSummary": "Veronica is brilliant, gifted and beautiful, but the handsome aristocrat she loves, Marco Venier, cannot marry her because she is penniless and of questionable family. So Veronica's mother, Paola, teaches her to become a courtesan, one of the exotic companions favored by the richest and most powerful Venetian men. Veronica courageously uses her charms to change destiny -- and to give herself a chance at true love.",
      "tmdbMovieId": 8583,
      "avgRating": 3.64263,
      "releaseYear": "1998",
      "numRatings": 964,
      "posterPath": "/vSGDmTsjaD2yZrS73nUJ4ikPqjQ.jpg"
   }
}