{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0116192",
      "video": false,
      "title": "The Empty Mirror",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "570944cc925141713900007d",
            "name": "Barry J. Hershey",
            "profile_path": null,
            "id": 1603348,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.074591,
      "production_countries": [],
      "id": 123728,
      "vote_count": 1,
      "budget": 0,
      "overview": "Adolf Hitler faces himself and must come to terms with his infamous career in an imaginary post-war subterranean bunker where he reviews historical films, dictates his memoirs and encounters Eva Braun, Josef Goebbels, Hermann Göring and Sigmund Freud.",
      "similar": [],
      "original_title": "The Empty Mirror",
      "runtime": 118,
      "poster_path": "/AuZeZsLUO5AaeByvhse3CH4qG7V.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1996-04-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Barry J. Hershey"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "R. Buckingham",
         "Barry J. Hershey"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0116192/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMzg3Mzg2OF5BMl5BanBnXkFtZTcwNjAyNTkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Norman Rodway, Camilla Søeberg, Peter Michael Goetz | See full cast and crew »"],
      "reviews": [
         ". While I doubt this movie appeals to the majority of people, it is never-the-less accurate both historically and psychologically. Many of the ideas expressed (by the character Hitler and his cohorts), facts referenced, and behavior exhibited are realistic. I have studied Hitler to a some extent, particularly his psychology and neuroses (read Robert G .L. Waite), and I feel that this movie shows the man as he was, a facade of power covering thinly doubt and pain. Hitler is not, after all, simply the worst monster in history, he had reasons and beliefs that motivated his actions. While the depiction of him may seem to inappropriate to some, it shows Hitler as a vulnerable, conflicted person who uses power and cruelty to attempt to hide his own debilitating lack of self confidence. Hitler needed to be accepted, loved, and to belong. He tried to use power and fear as a surrogate for all these things that make a healthy happy person, but it gave him no rest. He did indeed stare into an empty mirror. Hitler was a victim of his own twisted mind and lonely, hollow existence. Hitler deserves not to be forgiven, but understood. The empty mirror shows Hitler as human, and a weak one. This is not a tribute: Hitler wanted to be remembered as a great destructive prophet, to see him as the vulnerable victim of himself (while not pardoning what he did) is not what Hitler wanted. Watch, and understand Hitler the victim.",
         "I strongly disagree with the comments made about this movie. It's not obscene. It's an honest attempt to get at the heart of one of the most fascinating and significant people in history. Sure, it takes some chances but all great works of art do. Is there any guarantee that Hitler actually had the thoughts that the writers of this movie think he had? No. But that's the case with most biographical movies. All in all, I found the movie disturbing, enlightening, and very much worth seeing.",
         "A superficial pass over The Empty Mirror will lead to superficial conclusions. I saw this several years ago at an American Cinematheque screening in Los Angles. The director (himself Jewish) tried to take a look at Hitler as a man, unsullied by the gross oversimplifications that typically underscore such material. Most people feel a need to discard Hitler as merely \"insane\" and \"evil\" because it conveniently avoids the stickiness of trying to develop an understanding of his psychology. Most other material about Hitler and the Third Reich may try to offer honest insights, but more often then not devolve at some point into oblique moral condemnation \"All you REALLY need to know is that they were all very NAUGHTY/BAD/EVIL.\" They don't trust you to be intelligent and reach your own conclusions. The Empty Mirror takes a reasonably unclouded look - the majority of Hitler's lines are taken directly from _Mein Kampf_ and his interaction with other significant figures of the era provide us with insight (conjectured but believable) into his thought processes, motives, and rationalizations. The movie occurs in a surreal, dripping dark stone bunker which the camera never seems to quite capture the dimensions of. It's more of a \"dream\" state than actual location as the rooms change, occupants shift, uniforms taken on and off. See the movie yourself. The director is for once not insulting our abilities and is providing an opportunity to reach our own conclusions. Swallow your distaste for the subject for an hour and a half and try to objectively form your own opinion. Remember that this is the last movie hitler would ever want anyone to see - one that demystifies the \"Fuhrer-myth\" by showing him to NOT necessarily be a 2-dimensional cartoon hellbeast, but alas, merely a man.",
         "Like a dark demon flapping across the screen, Barry J. Hershey's `The Empty Mirror' takes a fascinating look at the mind of Adolph Hitler. Bizarre, surrealistic and staged more like a play than a movie, Hershey weaveslive scenes of Hitler (Norman Rodway ) looking back at his life, apparently after his death, while 1.) dictating a book, 2.) Reminiscing with former cohorts, and 3.) being analyzed by Sigmund Freud. All the while, newsreel footage of Hitler's glory days is playing in the background. SPOILERS AHEAD Hershey weaves an amazing tapestry of cinematic work. Yet it is difficult and ambiguous to interpret. Most likely he intended it to be so. It took two viewings for me to form opinions as to what his take really was on Hitler and his legacy. Most of the two-hour movie shows Hitler happily lecturing school children, Eva Braun, Joseph Goerbels and Herman Goerring, debating with Dr. Freud and dictating to his typist. All the while, German propaganda films run in the background. I wish I had gotten out my typewriter, to capture some of the soundbite-like quotes Hershey's Hitler made, regarding media and image. Calling himself `the greatest actor in Europe,' he speaks of `playing the fuhrer role,' which, he claims, he later finds to fill a distinct need within the German people's collective psychic. The carefully choreographed images will make him immortal, he brags. His business has been creating and maintaining an image. This notion is returned to again and again and seems to play a poignant role in the end of the film. Of course Hitler's recognition of and use of film certainly cannot be denied. Hitler looks back at his life and career as he relaxes with Braun (Camile Soeberg), looks over newsreel footage and model cities with Goebbels (Joel Gray) and Goering (Glenn Shadix) and dictates his book. Of course, from time to time, Freud (Peter Michael Goetz) pops up and begins probing his mind. It is difficult \u0096 especially on first viewing to determine what Hershey is about. If one were forced to miss the last several minutes of the film, it would be easy to believe Hershey is actually defending Hitler. Some unlikely thoughts are put in Hitler's mouth as he reflects on the turn of the tide in Russia in late 1941. He seriously considered calling a worldwide peace conference, Hitler says, or of retiring to spend more time painting! `Let someone else play the Hitler role!' he fumes. This is certainly provocative and original material \u0096 as unlikely as these sentiments seem for the man. As the film progresses, his cohorts and underlings gradually begin to question bits and pieces of Hitler's grand designs. Freud's questions become more penetrating. As the fuhrer's reflections reach the downfall of the Third Reich, he seems to get more defensive \u0096 and Rodway visibly ages \u0096 in the end looking much older than Hitler was at his death. Although Hitler and Goering earlier discuss the death totals, opting to pad the numbers to `an even' six million Jews killed, out of 12 million total (They seem inclined to point out that about as many Christians were put to death as were Jews.), Hitler cannot escape the blood on his hands. Eventually a tide of blood, in a very dramatic flurry, busts through the stone walls of his sanctuary and drowns him in a crimson tide. The movie does not end there, though. It continues with Hitler reflecting more, now quite old and worn down. Finally, in a bizarre scene just before the end, he manages to stick his hands into and through the giant newsreel images on the wall. Apparently in pain and panic, he has to fight to remove his hands. This, again, seems to return to the idea of Hitler being merely a man trapped in a PR image that got away from its creators like a runaway snowball. On first viewing this struck me as reminiscent of the final days of Howard Hughes. Both were old men, once the most powerful (or wealthy) man on earth, now alone, nearly mad, trapped in a projection room with flickering images of his past. I am not certain whether Hershey is really suggesting this, or if he is merely conjecturing on what excuses Hitler might have tried to use, had he been given a post-life opportunity to defend himself before the world. I was also not certain, on first viewing, of where exactly he WAS during this film. Upon second viewing, though, I have to conclude that this is Hell. The earlier stages, in which Hitler felt invigorated (`It feels GOOD to be writing again!) and confident, perhaps, served only as a vehicle to revive him from the madness at the time of his death. This, then allowed him to extol his beliefs in full confidence, only to have the ambiguities gradually pointed out and the rug eventually yanked from under him. He must be made to realize his errors before his actual time in Hell can begin, perhaps. Certainly the closing shot, while sticking to the cinematic theme, gives a Hellish feel to it. Whatever one's take on the film, it is impressively and stylistically done. Almost surrealistic to the extent of `Dr. Caligari,' it is wonderfully edited by Marc Grossman and makes great use of Wagner and other appropriate classical music. Rodway turns in a strong performance as Hitler. It took me a few minutes, the first viewing, to accept him AS Hitler, since the resemblance is so slight. Later, as the aged, white-haired Hitler, he bears an uncomfortable resemblance to comic Steve Martin. In some shots, though, he looks uncannily like Hitler. Appearances aside, and discounting the slight English accents with which both he and Goering speak, he is most convincing. Gray is outstanding as Goebbels, the twisted propaganda genius and Shadix and Goetz are solid in their roles. Soeberg is perfect as Eva Braun. The backdrops are unusual and intriguing and the cinematography by Frederick Elmes is outstanding. However one interprets this dark masterpiece, it is definitely a film to watch.",
         "In 1956, our high school history classes were assembled in the auditorium and shown the film documentation which was used as evidence at the Nuremburg trials. \"The Empty Mirror\"--a fiction--is well enough made to convey a chamber in Hell and bring closure to my 44 years of personal nightmare set going by that documentary footage. The fiction of Hitler's self-deconstruction, helped by a clear-eyed Sigmund Freud, includes such declarations as: \"I have edited the imaginations of people not yet born.\" and \"I wasn't put in a lunatic asylum. I created a lunatic asylum.\" Norman Rodway portrays the insanity of Hitler with painfully acute skill. There is no daylight in the film except as it flickers second-hand in documentary footage of the Third Reich. One might continue to brood over the problem of Hitler, except that built into the script is the clue that to brood over Hitler creates a type of 1000-year Reich in his behalf. The take-home offer: know what madness looks like, and never to be betrayed by it. Here, the evil of megalomania is shown veiled by the attraction of power. But the viewer is placed behind the veil where the evil is chewing itself up. One disturbing thought: all those kidnapped blonde children in Hell with Hitler. Souls also non-existent? Above all, this is an art(literature/history) film. Gothic drama viewers will likely be disappointed.",
         "This movie is definitely not for everyone. I just watched it on IFC and felt strangely moved by this work. There are quite a few disturbing images thus the \"not for everyone\" comment. However, if you believe that life itself is itself, you may perhaps be able to take in what the director was attempting to portray through all the twists and turns of a never denied, man whose sanity was doubtful, lending itself to a tortured person, for indeed he was a person...who inflicted the most selfish, prejudiced, vile, horrific, death, pain, and suffering upon countless souls. His was never the right as it is none of our right to \"take\" life and I believe the director moved through this piece attempting to portray the fact...for it is a fact, Hitler was a flesh and blood mortal born into this world like the rest of us. His trip through this life became a twisted shard of a soul constantly at war with itself and with humanity. See this movie",
         "Well I see people are po'ed because this film doesn't get all preachy about how \"Hitler is evil\". Well come on, there are countless films that talk about the holocaust and such, this film is unique in that it is trying to explain Hitler from HIS POINT OF VIEW. It is a very interesting film and a must view for any historian interested in the WW2 era. I'm sure many will disagree if it is an accurate portrayal of Hitler or not, but that should be an interesting debate. Oh yes and Norman Rodway gives one of the best 'one man' acting performances I've ever seen. 8/10",
         "A friend recommended this film as a psychological study of Hitler. I felt the filming along with the juxtaposition of scenes and the overlapping of scenes to be superb. The way the actor playing Hitler was examining the films (as Hitler, of course) to what? Give a better speech or perfect his arm salute? Why didn't he want people to see him having fun? How could one man bring an entire country to his side by, in his speeches, always yelling? I noticed the faces of the people in the crowd scenes and they are smiling. Hitler certainly wasn't a benevolent person so why did Germany follow him? When the film reel started to unravel, I knew he would too. He was so concerned about the \"pure\" Germans, yet he was dark and born in Austria. An excellent film!",
         "I am a WWII buff, and you can't be a WWII buff without having some fascination with Adolf Hitler. Most movies you see vilifies him, and certainly, there is plenty to villifry, but it's hard to find anything that analyzes the man for what makes him up, that is exactly what this movie does. This wonderful work looks at Hitler from his own eyes, giving a unique look at the man, his ideals, and his motivations from his own perspective. It never makes Hitler look like a \"hero\" though, which is certainly a delicate balance when looking a the man from his own eyes, if anything, it is what makes the movie terrifying in seeing just how fine the line is between genius and insanity - what could this man have accomplished if he had taken his drive toward humanity instead of world conquest? The movie uses actual German propaganda and war clips behind Hitler talking about his drive and motivation to provide a surrealistic horrifying image, and does a wonderful job of showing his cross from that line of insanity/genius. You can't possibly be a student of the world we lived in during WWII without considering Adolph Hitler's part in it, and you can't understand exactly what the world faced until you understand the man behind it. If you are a student of the world of WWII, you must see this movie!",
         "While I am not an exact History major. Nor am I quite a Hitler freak or anti-Indie movies. I found myself wraped around the dialog of the movie. The dialog may seem pretentious to others, but I found it quite original. Yes, the Frued thing was gimmickal, but it wasn't necessarily a bad one. It was a light movie, fictional in nature. Slight tongue-in-cheek humor, with more than a handful of decent famous quotes you've heard over the years. All in all I think when people bad mouth this movie, or call it crap. They forget what real bad film making is. This movies deserves a view."
      ],
      "genres": [
         "Drama",
         "History",
         "War"
      ],
      "productionCompanies": ["Walden Woods Film Company Ltd."],
      "summaries": ["Adolf Hitler faces himself and must come to terms with his infamous career in an imaginary post-war subterranean bunker where he reviews historical films, dictates his memoirs and encounters Eva Braun, Josef Goebbels, Hermann Göring and Sigmund Freud."],
      "budget": 0
   },
   "movielensId": 2564,
   "movielens": {
      "languages": [""],
      "releaseDate": "1996-04-09",
      "dvdReleaseDate": "2003-08-19",
      "directors": ["Barry J. Hershey"],
      "runtime": 118,
      "movieId": 2564,
      "title": "The Empty Mirror",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0116192",
      "originalTitle": "The Empty Mirror",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Adolf Hitler faces himself and must come to terms with his infamous career in an imaginary post-war subterranean bunker where he reviews historical films, dictates his memoirs and encounters Eva Braun, Josef Goebbels, Hermann Göring and Sigmund Freud.",
      "tmdbMovieId": 123728,
      "avgRating": 2.84783,
      "releaseYear": "1996",
      "numRatings": 23,
      "posterPath": "/AuZeZsLUO5AaeByvhse3CH4qG7V.jpg"
   }
}