{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "yorkshire",
            "id": 9180
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "friends",
            "id": 9713
         }
      ],
      "imdb_id": "tt0122906",
      "video": false,
      "title": "Among Giants",
      "recommendations": [],
      "backdrop_path": "/x5pqB1CUgVTLKe6OLEh8GNhTBpI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Raymond 'Ray'",
               "gender": 2,
               "credit_id": "52fe4abcc3a368484e1641f7",
               "name": "Pete Postlethwaite",
               "profile_path": "/5nbSzrwyDcLhC15buncGdrQqJ8e.jpg",
               "id": 4935,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Gerry",
               "gender": 1,
               "credit_id": "52fe4abcc3a368484e1641fb",
               "name": "Rachel Griffiths",
               "profile_path": "/eufpAqIIViSBe0ZpMRs47drKiQw.jpg",
               "id": 3052,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe4abcc3a368484e1641ff",
               "name": "Andy Serkis",
               "profile_path": "/eNGqhebQ4cDssjVeNFrKtUvweV5.jpg",
               "id": 1333,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Shovel",
               "gender": 2,
               "credit_id": "546359fa0e0a2678150020aa",
               "name": "Lennie James",
               "profile_path": "/ilmHrtWZMa7FP3yCyJoHX6sSZjx.jpg",
               "id": 1120,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Steven 'Steve'",
               "gender": 0,
               "credit_id": "5485e662c3a368666a002481",
               "name": "James Thornton",
               "profile_path": "/nE7AHtAEGERy8NBwZ2gWKBuJNcm.jpg",
               "id": 1219959,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Weasel",
               "gender": 0,
               "credit_id": "5485e6729251416a5d003648",
               "name": "Rob Jarvis",
               "profile_path": "/t2MLooTwg1bnXOVudjJ6D0iY5wz.jpg",
               "id": 1214693,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Frank",
               "gender": 2,
               "credit_id": "5485e6809251416a6f002fc9",
               "name": "Alan Williams",
               "profile_path": "/pM0p11m4FltnX88DQ0kKgCr8M7D.jpg",
               "id": 122589,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4abcc3a368484e164205",
               "name": "Sam Miller",
               "profile_path": "/4d8TvENmraAu4Z6a51T2Qw8tRYn.jpg",
               "id": 134156,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5485e6499251416a6c0035e1",
               "name": "Simon Beaufoy",
               "profile_path": "/cMXUiYg2lUBCkN5MMaaxI5xyB9K.jpg",
               "id": 57631,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.862764,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 125123,
      "vote_count": 2,
      "budget": 0,
      "overview": "A manager hires Ray, off the books, to paint all the power towers in a 15-mile stretch of high-tension wires outside Sheffield. Ray's crew of men are friends, especially Ray with Steve, a young Romeo. Into the mix comes Gerry, an Australian with a spirit of adventure and mountain climbing skills. She wants a job, and against the others' advice, who don't want a woman on the job, Ray hires her. Then she and Ray fall in love. He asks her to marry him, gives her a ring. Steve's jealous; Ray's ex-wife complains that he spends on Gerry, not his own kids, and she predicts that Gerry won't stay around. Plus, there's pressure to finish the job fast. Economics, romance, and wanderlust spark the end.",
      "similar": [
         13523,
         24420,
         1259,
         276,
         1903,
         50544,
         862,
         38,
         19913,
         1628,
         19053,
         1643,
         316021,
         16980,
         44564,
         2470,
         17612,
         1024,
         2770,
         109414
      ],
      "original_title": "Among Giants",
      "runtime": 93,
      "poster_path": "/ugTs1SDHUAsBuCpdrCDKTC2kHeK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/16fY7pucCzn7WSOYxOGRHlAayL3.png",
            "name": "British Broadcasting Corporation (BBC)",
            "id": 3324,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Screen Productions",
            "id": 12745,
            "origin_country": "GB"
         }
      ],
      "release_date": "1998-06-24",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "a love story from the writer of \"The Full Monty\".",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Sam Miller"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Simon Beaufoy"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0122906/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQzMDgzNjM2MF5BMl5BanBnXkFtZTcwNTc1MzAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Pete Postlethwaite, Rachel Griffiths, James Thornton | See full cast and crew »"],
      "reviews": [
         "I really don't understand why this film has received such generally negative reaction. I agree that it does bog down in a couple of places, and maybe some of the charactors could have been developed in a litte more detail, but Postelwaite and Griffiths are thoroughly engrossing. Also, the film is visually very interesting. Someone has a real eye for shot construction. After looking at the user ratings, I was expecting to be disappointed. I wasn't.",
         "I did not know of the existence of this film until i saw it on a video preview. I rushed right out to hunt it down as Pete Postlethwaite and Rachel Griffiths are absolutely brilliant actors. I think it is fantastic that character actor Pete Postlethwaite, finally gets to play a romantic lead. There has always been something compelling and charismatic about him. Rachel Griffiths is perfect also. Forget your air-brushed, hollywood ideas of romance and sex, this is real, and sexy and uplifting at the same time.",
         "As a drama set in working class Yorkshire, Among Giants certainly has its antecedants: The Fully Monty, with which it shares a screenwriter, Sheffield and an interest in full male nudity (which in this film, we actually get to see!); Brassed Off, which also featured Pete Poselthwaite, a collection of emotional but never histrionic performances, and a slightly charicatured depiction of free market economics; and sitting above them all, the memory of Ken Loach's Kes. The film lacks Loach's realism, and the plot is full of holes. Against that, both Poselthwaite and Rachel Griffiths are superb, and it's shot with a great feel for landscape, both inside and outside the city. It's not perfect, and it lacks the Monty's cheap selling points, but in spite of that, it's done with real feeling and is arguably the better film.",
         "this is a must see movie for those who love Pete and Rachel. although unlikely lovers, it is refreshing to see a movie which does not go down the standard Hollywood road of beautiful man meets beautiful woman; they argue, they fight, they then fall in love. this script is life as it is, not as it might be if we all lived in the typical studio executive mind...",
         "If you are like me, and don't subscribe to the hollywood blockbuster type movie, you will probably like this movie. Pete is great as usual, and sexy, and he finally plays a romantic lead part. This movie has many funny scenes. So do yourself a favor, next time you are at the rental place, walk past the wall of 50 copies of the same movie, and take the one with only two copies. That is where I found this little gem. Enjoy!",
         "Ray is the foreman of a crew working for the electricity board on an informal, cash in hand basis. They have a few months to paint a 15 mile row of electricity pylons. Into this mix comes Australian back packer Gerry who joins the crew for some work. Ray and the much younger Gerry start to fall for each other as they work causing splits and disharmony within the crew. I vaguely remember hearing reviews of this film when it was released but it didn't do well and was hardly in the cinemas for a week before it vanished. It popped up recently on TV and I gave it a go despite not hearing much good about it. It is actually not that bad but it is a long way short of The Full Monty. The film seems to want to have some sort of gritty social dimension about it but this is no Ken Loach film and it doesn't come off. I didn't get any wider point about the class of these men that ran through the story. The serious side to the work that comes in later is not as strong as it needs to be and didn't carry enough weight. The main thing here is the confused romance between Ray and Gerry that didn't quite come off. The reasons for the difficulties in the relationship are not totally clear and the way it goes is not convincing, rather a bit dull and pedestrian. It has it's moments of potential beauty such as the cooling tower scene and tender moments between the pair, but these don't come off as well as they should. I found this to be partly the fault of the cast. Postlethwaite is a reasonably good actor and Griffiths can be very good (check out HBO's 6ft Under) but they lack a real sense of chemistry that was needed to be realistic. The crew are all pretty good despite having not well formed characters. Postlethwaite needed to be stronger but he is a little lo-key when really he should have commanded the screen more, although his tact does work in the quiet moments. The direction is good and Miller seems to like the wide Northern landscapes with all his swirling helicopter shots and fancy shots through the pylon structures. Add to this the haunting score and the film has a sort of other-worldly feel to it that the material can make good on. Maybe I just didn't get it and others may find this to be very touching, however I must admit that I never got emotionally involved in any of it and it left me feeling a bit dry more than anything else. It may have had potential on paper but on the screen it goes for a big drama but fails to satisfactorily deliver.",
         "This is the type of movie that you don't want to trash, but you have to anyway. There is too much illogical behavior, too many dramatics, and not enough things to recommend. There was a beautiful scene in a watertower and some of the aerial shots are great, but unless you are a Pete Postlethwaite completist, I'd stay away.",
         "This movie is not nearly as bad as some other reviewers would have you believe. While it is no Hollywood big budget blockbuster it is a nice, sensitive movie about three people and their brief involvement. The scenery is breathtaking and the towers make a great backdrop. As far as being embarrassed by Postlethwaite's nudity I can only say I hope I look that good at 53. This is not a movie about a perfect man and a perfect woman under palm trees in a perfect world, It is about life in a dreary town leading a dreary existence. The crying man? He was living his dreary life, into a bookie for more than he had, knowing he was not getting out. I might cry as well. The movie was a bit slow at times but give it a chance.",
         "An odd movie. Rachel Griffiths is the one to watch. She plays a free spirit climber who gets involved with one of the male leads. She's vulnerable and not at all sure of the situation she is involved in. I wish her character was more revealed, emotionally. I wanted to know more of her character but maybe that is what she was playing towards. She was intriguing. She was great in `Hilary and Jackie'. Pete Postlethwaite was as usual very good. He's a very versatile and talented actor",
         "This film is truly awful. Its intention is to be in the vein of Raining Stones or Secrets and Lies or Brassed Off. It only skips the surface, never digging into the lives of the characters. The guy who cries in the campfire scene must have a problem, but what is it? Can you imagine Rachel Griffiths falling in love with Pete Postlethwaite? Excerpt: \"Somewhere under those clothes there's a woman... Get 'em off.\" That _ridiculous_ scene in the silo or whatever it is, the two of them nude in the falling water? Postlethwaite looks like the village idiot. Heaven knows why he got mixed up in this film. Don't you make the same mistake."
      ],
      "genres": [
         "Romance",
         "Comedy"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "British Broadcasting Corporation (BBC)",
         "British Screen Productions"
      ],
      "summaries": ["A manager hires Ray, off the books, to paint all the power towers in a 15-mile stretch of high-tension wires outside Sheffield. Ray's crew of men are friends, especially Ray with Steve, a young Romeo. Into the mix comes Gerry, an Australian with a spirit of adventure and mountain climbing skills. She wants a job, and against the others' advice, who don't want a woman on the job, Ray hires her. Then she and Ray fall in love. He asks her to marry him, gives her a ring. Steve's jealous; Ray's ex-wife complains that he spends on Gerry, not his own kids, and she predicts that Gerry won't stay around. Plus, there's pressure to finish the job fast. Economics, romance, and wanderlust spark the end."],
      "budget": 2500000
   },
   "movielensId": 2569,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-24",
      "dvdReleaseDate": null,
      "directors": ["Sam Miller"],
      "runtime": 93,
      "movieId": 2569,
      "title": "Among Giants",
      "mpaa": null,
      "actors": [
         "Pete Postlethwaite",
         "Rachel Griffiths",
         "Andy Serkis",
         "Lennie James",
         "James Thornton",
         "Rob Jarvis",
         "Alan Williams"
      ],
      "imdbMovieId": "0122906",
      "originalTitle": "Among Giants",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["K2WVviKjYXY"],
      "plotSummary": "A manager hires Ray, off the books, to paint all the power towers in a 15-mile stretch of high-tension wires outside Sheffield. Ray's crew of men are friends, especially Ray with Steve, a young Romeo. Into the mix comes Gerry, an Australian with a spirit of adventure and mountain climbing skills. She wants a job, and against the others' advice, who don't want a woman on the job, Ray hires her. Then she and Ray fall in love. He asks her to marry him, gives her a ring. Steve's jealous; Ray's ex-wife complains that he spends on Gerry, not his own kids, and she predicts that Gerry won't stay around. Plus, there's pressure to finish the job fast. Economics, romance, and wanderlust spark the end.",
      "tmdbMovieId": 125123,
      "avgRating": 2.83065,
      "releaseYear": "1998",
      "numRatings": 62,
      "posterPath": "/ugTs1SDHUAsBuCpdrCDKTC2kHeK.jpg"
   }
}