{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "dancer",
            "id": 733
         },
         {
            "name": "tango",
            "id": 2683
         },
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "love",
            "id": 9673
         }
      ],
      "imdb_id": "tt0120274",
      "video": false,
      "title": "Tango",
      "recommendations": [
         49680,
         47909
      ],
      "backdrop_path": "/kBMNdsBAB1eJvzRp4YLpdDzYI1s.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Mario Suárez",
               "gender": 2,
               "credit_id": "52fe4718c3a368484e0b4b89",
               "name": "Miguel Ángel Solá",
               "profile_path": null,
               "id": 230213,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Laura Fuentes",
               "gender": 0,
               "credit_id": "548201069251416e7e006912",
               "name": "Cecilia Narova",
               "profile_path": null,
               "id": 1395095,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Elena Flores",
               "gender": 1,
               "credit_id": "54820113c3a36829a30067db",
               "name": "Mía Maestro",
               "profile_path": "/UIf7kAHqAGRwJ9TZSkZ91A1scr.jpg",
               "id": 6859,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Carlos Nebbia",
               "gender": 0,
               "credit_id": "5482011fc3a3685c0e00077b",
               "name": "Juan Carlos Copes",
               "profile_path": null,
               "id": 1395096,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4718c3a368484e0b4b85",
               "name": "Carlos Saura",
               "profile_path": "/xzDUMRTBkL3lmmTmYMgmKatYqNs.jpg",
               "id": 96369,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "548200f69251416e7e00690f",
               "name": "Carlos Saura",
               "profile_path": "/xzDUMRTBkL3lmmTmYMgmKatYqNs.jpg",
               "id": 96369,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58070f79c3a3684d4e010135",
               "name": "Lalo Schifrin",
               "profile_path": "/zYz8R5xJGdO4Rq2FrcagMoG1UxD.jpg",
               "id": 9217,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58070fa29251415b900118c7",
               "name": "Vittorio Storaro",
               "profile_path": "/4QuZy1Y5TEqSeo3GM3FJYrRM0Xa.jpg",
               "id": 7202,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.16393,
      "production_countries": [
         {
            "iso_3166_1": "AR",
            "name": "Argentina"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 65749,
      "vote_count": 8,
      "budget": 0,
      "overview": "A dangerous love affair inspires a director to create the most spectacular and bodly seductive dance film ever made. 1998 Oscar Nominee Best Foreign Language Film.",
      "similar": [
         24420,
         31900,
         11224,
         872,
         1903,
         3933,
         10545,
         38050,
         50546,
         46705,
         10530,
         38,
         703,
         812,
         313369,
         1407,
         1643,
         12545,
         3087,
         45272
      ],
      "original_title": "Tango, no me dejes nunca",
      "runtime": 115,
      "poster_path": "/ngW0tkg7hmPQAZsfCC419GJxZ3O.jpg",
      "spoken_languages": [{
         "name": "Español",
         "iso_639_1": "es"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Adela Pictures",
         "id": 40451,
         "origin_country": ""
      }],
      "release_date": "1998-02-12",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Tango: do not ever leave me",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": "ESP ",
      "directors": ["Carlos Saura"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Carlos Saura"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0120274/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMDIxMzExMl5BMl5BanBnXkFtZTYwNzY5MDY5._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Miguel Ángel Solá, Cecilia Narova, Mía Maestro | See full cast and crew »"],
      "reviews": [
         "Tango may well be the greatest dance movie ever made. Its stunning dance sequences, relentless tango music (orchestrated by Lalo Schiffrin)and throbbing sexuality place this film in a class by itself. There simply has never been anything like it. And, if you have any male hormones left and do not fall immediately head over heels in love with Mia Maestro than something is definitely wrong with you. She is what Audrey Hepburn might have been had Miss Hepburn been Latin and had a spectacular dancer's figure. But the entire cast is wonderful and the lighting and color are explosive. Go see it, then take the next plane to Buenos Aires. I did.",
         "Tango deals with the different ways that people deal with the ending of romantic relationships. It shows that there is always something worth living for and that life goes on even though it may seem at times that there is nothing left to live for. (spoilers) This film was all one man's story of how he dealt with having a broken heart, and how he recovered. It is an autobiography by Mario, the main character, who tells the story himself, which is made clear in the first few minutes of the film. Mario returns to find Laura, his ex, getting the last of her things, and he begs her to come back to him but she is happy living with another man. The dancing scenes in the film seem to show a way that Mario tries to escape from his emotions, but it backfires because he sees Laura there dancing with the man that she left him for. Whenever he sees her, everything else that is going on in the movie stops abruptly. There is nothing but the music, the dancing, and Mario's mesmerized stare. He seems to be in a trance every time he sees her, and he even has murderous visions. His mind seems to be so choked with emotional turmoil that he cannot function when he is in her presence, he is absolutely captivated by her. When Mario finally meets another woman, it is a result of her dancing ability. In fact, the first thing that is spoken of her in the film is about her exceptional dancing skill. This is very effective because from this point on, she is seen as being superior to all of the other women, and she is focused on when she is in a large group, which makes Mario's romance with her more moving. She represents a new beginning for Mario, and she makes him forget about Laura, which is all he seems to want up to this point in the film. There was one very quick scene worth noting because it is an exact example of what the film is about. Mario is at a dancing school where there is a classroom of young students learning to tango, and he is speaking with an elderly man. The man tells him that his wife recently passed away, and his life no longer has any meaning, he has nothing left. As soon as he finishes saying this, he looks across the room and his face breaks into a wide grin as he points his granddaughter out to Mario, claiming her to be the `best in the class.' This is a perfect example of the meaning of this movie! The moment after this man tells Mario that his life is meaningless because his wife passed away, he lovingly boasts the dancing skill of his granddaughter. His life obviously still has meaning because, even though his wife is gone, he can still watch this girl grow as both a person as well as a dancer. I hope Mario noticed this man's glaring miscalculation of the importance of his own being. The surprisingly ironic ending of the film represented the fact that life goes on, and also that sometimes it is really necessary to end some relationships in order to be happy, even if it seems like the end of the world. Mario is very happy with this woman that he met, but in order for her to be with him, she had to break a man's heart just the same way as Laura had broken his. That man's heart was broken the very same way that Mario's was broken at the beginning of the film, which is very ironic because this man is in the exact same position that Mario was in after Laura left him earlier in the movie. The title of this film refers not to a particular style of dancing, but to the emotional tango that people can dance with each other. Even though dancing is abundant throughout the film, it's not actually ABOUT dancing. However, the dancing did tie everything in the film together. Another element that is particularly interesting is the way the camera is used. This is the first film I have ever seen that actually seemed to give the camera itself a bit of personality. In the second half of the film, the director did not seem to make the slightest effort to avoid filming the camera's reflection. There was even one scene where the camera was looking directly at itself in a mirror, which for some reason I find fascinating. I think that this was supposed to suggest that all of the dancing that went on in the film was all rehearsal for a play or some sort of live presentation, rather than people acting for the movie itself. This gives you a whole different perspective and, ironically enough, it makes the film seem even more realistic.",
         "In Buenos Aires, the director Mario Suarez (Miguel Ángel Solá) is developing and rehearsing a tango play with historical events as background. Mario misses his mate Laura Fuentes (Cecilia Narova), who has recently left him, and is recovering from a car crash with an injured leg. When the major investor Angelo Larroca (Juan Luis Galiardo) asks for an audition for his lover Elena Flores (Mía Maestro), she succeeds and participates in the play; however, Mario falls in love for her and Elena fears the dangerous Angelo. I saw \"Tango\" for the first time on 01 January 2001; I have just watched it again and I still believe it is one of the most wonderful tributes to the tango. Carlos Saura uses the concept that history is indestructible and recalls the dark years of military dictatorship in Argentina after the amnesty entwined with a passionate love of a middle-aged man for a young woman to build the plot, supported by stunning cast, choreography, music score and lighting. However, the conclusion is confused and disappointing, and I really do not understand the relationship of Angelo and Mario acting like pals in the last scene. Cecilia Narova and Mía Maestro are extremely beautiful and fantastic dancers, and I do not get tired of seeing them dancing tango. My vote is seven. Title (Brazil): \"Tango\"",
         "There's a scene in \"Some Like it Hot\" in which Jack Lemmon dances a tango with Joe E. Brown. The tune is a famous one, La Cumparasita or something like that, turned into an American pop song in the 1950s with English lyrics and named \"Strange Sensations.\" Anyway, the dance is played for laughs. Well, it's understandable. The conventions of the tango seem so automated to someone used to other forms. But what surprised me here was the flexibility of the form, the way it is adapted to circumstances. There is, of course, a number here in which two or three dancers express intense passion, the emotion we usually associate with the tango. But there is also a number that is informed by humor. Suarez, who is about to direct a show featuring the tango, native to Argentina, is alone in his studio, talking to himself about the folly of falling in love, and he imagines a scene in which the silhouettes of two dancers perform a comic number, waggling their bottoms at the camera, the music bumping along in the background featuring a few strings and a flatulating tuba, itself an amusing instrument in sound and appearance. Thank you for that tuba, Lalo Schifrin. As an Hispanic himself, Schifrin knows what he's doing. (He makes good use of the bandoneon, a kind of concertina, too.) There is a less-successful number that uses boots and military uniforms in an evocation of the period in the 1970s and 1980s when citizens of Argentina were \"disappeared.\" There are tango-tinged encounters between men and others involving women, that are homosexual in effect. And sometimes there is no music behind the dances at all -- only the natural sounds of clothing rustling and soles squeaking on the wooden floor as the performers twist and turn. Let me get back to that homosexual dance between the two women. One of them, if I got it right, is Suarez's ex wife, a superb dancer played by Cecilia Narova. The younger one is played by Mia Maestro. The dance ends with a sensuous kiss, and I can understand why another woman might want to kiss Maestro. I could understand it even if some twisted extraterrestrial whose native notion of esthetic perfection looked like the inside of an alarm clock wanted to kiss Maestro. She is egregiously beautiful, two-thirds Diane Venora and one third Audrey Hepburn, and sports what must be, even to the most jaded eye, a nearly perfect body whose movements are entirely under her own control. Her high kicks beat those of Eleanor Powell. And when her numbers freeze in tableaux, it would be perfectly okay if she just retained those balletic poses for, oh, say five or six minutes so we can burn the images into our brains. I don't think the human form and the suppleness of which it is capable has ever been displayed more elegantly. Not to put down Fred and Ginger. That's a different ballroom game. The Spanish as spoken is appropriately Argentinian too, for what it's worth. The pronunciation is regional and so is the grammar. I say this out of complete ignorance of the language except for that which comparative linguists tell us. And a chat buddy in Buenos Aires. (Besos a vos, mi compaera). The plot is nothing much. Abstract and arty and colorful. Saura's 8 1/2. Suarez, the benign director of a musical show, falls for Maestro. She is living with a Mafioso who is a dangerous dude, sub specie aeternitatus. But she tells the Mafioso off anyway and stalks off as he shouts after her -- \"You're making a big mistake.\" If it did turn out to be a mistake we don't learn about it. The movie ends happily if trickily. I want to emphasize that the dances are just about everything here. They bear about the same relationship to Lemon and Brown's tango as Fred and Ginger's superbly rehearsed dances do to the twist. There is one number by Maestro in which she does nothing but walk around slowly and strike an occasional pose. It's stunning in it simplicity and sensuousness. And in the duets, the dancers hold each other so close through so many acrobatic movements that, without stretching too much, I can imagine one false step bringing them tumbling to the floor wrapped up in each other. The photography and lighting (by Vittorio Storaro) is superlative and the art direction equally so. Everything takes place in a carefully designed studio with mirrors and stages and painted backdrops scattered around. Sometimes we don't know if we're looking into a mirror or seeing the \"real\" scene. Nor can we always be sure that what we're watching is taking place in \"real\" life or in Suarez's imagination -- sometimes the imaginary turns into the real. But none of this detracts from our understanding of the film. The \"double\" structure is not simple directorial self display, nor is it just more hokum about \"what's reality and what's illusion?\". It adds visual texture to a film that already has more than a dozen Hollywood monstrosities could hold. It's really art, without quotation marks around it.",
         "I absolutely love this film. I am not a huge fan of dance movies or musicals, but this creation is superb. The music, the dancing, and of course, the women are all beautiful. Saura melds fiction & reality with all the skill he has shown in previous films, & Storaro's cinematography is, as usual, stunning. I purchased a DVD copy as soon as it became available & I have found the extras & the commentaries to be both informative & entertaining. For anyone who loves; beautiful filming making, passionate dancing or erotic women, this film will fill all those needs. Buenos Aires, here I come!",
         "It's not often that I will give a film a perfect review, I'm just too picky. And let's face it, there aren't many movies being made nowadays that even approach perfection. I have just had the pleasure of seeing one such film. Director Carlos Saura and cinematographer Vittorio Storaro have again collaborated on a masterpiece. Similar to their last joint effort 'Flamenco', 'Tango' is both an examination of the music and dance of the tango and, more importantly, it's role as a reflection of the human condition. Saura and Storaro have gathered these elements and taken them, and the audience, one step further. Through skillful choreography, the camera weaves it's way through a maze of mirrors, lights, projected images and some of the world's best tango artists. The audience becomes a willing dance partner with their breathtaking eye and find themselves swept into their passionate vision.",
         "My, what a delight for the senses. TANGO has it all: imagination, consonance, balance, choreographical beauty, cinematic creativity, and...the Tango. The dance is beautiful. The music complements the visual magnificence of the film. Although the MATRIX crowd will find it less than stimulating, those with a more artistic appreciation for the nature of things will find it quite beautiful.",
         "While so many have commented on the superlative dancing and the spectacular use of color, this film is not solely about dance. As he did in \"Carmen\", Carlos Saura invites us into a beautifully crafted melange of realism, impressionism, and surrealism to express the human emotions of love, betrayal, jealousy, fear and redemption. His melange results in a film that is an enigma wrapped in the sensuality, color and passion of a tensive tango that expresses his horror at the atrocities of Argentina's \"Dirty War\". This film is as much a political statement as it is a well-crafted masterpiece of cinematic art, color and music. In \"Carmen\" we never know when Antonio's real relationship with Carmen ends and the flamenco drama begins. So too, in \"Tango\", Saura sucks us into a reality carefully created to deceive us while at the same time it teaches us in colorful shades the subtle and sometimes unnoticeable differences between illusion and reality. Until the end of the film the viewer actually believes that Mario has lost Laura and found himself again in his love for Elena, who he suspects will be murdered by one of LaRocca's henchmen. Saura films the scenes with Elena and Mario at the restaurant and in the bedroom in a colorless reality that assures us that this is a real relationship. Thanks to set designer, Waldo Norman (Ricardo Mourelle), Mario is able to travel between time and space through color, particularly shades of red, giving the dream sequence in which he kills Laura a surreal affect. The devils of Mario's surrealistic subconscious are exorcised again in the graphic choreography of the torture and rape scenes depicting the \"Dirty War\" against liberals, students, artists, union workers, and intellectuals. In their acrobatic bends, twists and rolls, the dancers give us the impression of intense pain at the hands of their cruel torturers. Perhaps this surreal dance is the only way that Mario, and Saura, can deal with the horrific atrocities inflicted on the thousands of Argentine \"desaparecidos\" (the disappeared ones) from 1976 \u0096 1983. Mario says as much in the bedroom scene with Elena. While holding her in his arms, Mario states that imagination is the only guardrail that keeps us from plummeting into the deeps of horror and atrocity. It is after this scene that the \"Repression Tango\", Saura's balletic version of the horrors of the \"Dirty War\" take place. Having experienced a choreographed impression of Hell, the viewer is jolted back to reality in the end, when Elena awakens from death to ask if she had played the scene of her murder well. The lights are on and the stage is bustling with actors and stage techs. Mario with his arms around Elena seemingly incredulous at her resurrection, realizes that he too for a moment was sucked into the artist's illusion, but now stands redeemed through art in a reality free of his inner-most demons.",
         "I absolutely love this movie! It's one of my favorite foreign films to watch. The very first time I saw this, I was actually looking for another tango movie. When I found out it was not the movie I was looking for, I almost changed the channel. The very first dance scene with Laura (Cecilia Narova) and the other guy she ends up with (whatever his name is) was so riveting that I literally could not stop watching this movie. It is so sensual and seductive that you can really see why people of all cultures enjoy tangos. The colors of the set, the dancing, the music, even the story line is so enchanting that it's like you're there with the actors themselves. If you're a fan of tangos, the music and/or the dance, you will love this movie. A person has to genuinely enjoy listening and watching because this film evokes all the visual and hearing senses of the Tango. This film was beautifully done!",
         "The dancing in this movie was wonderful to watch. The posture of the dancers amazing. The colours magnificent. I found the tale fascinating. I believe what we watched was the film being made and the story told was what the director wanted us to see, because at the end, everyone was clapping and all were friendly.It was all make believe. The tale was not to be taken seriously, it was a play within a play. On the otherhand what happened in Argentina many years ago was true and the way the director directed this sad time was very inventive. It showed through dancing the tragic story."
      ],
      "genres": [
         "Drama",
         "Musical"
      ],
      "productionCompanies": [
         "Adela Pictures",
         "Alma Ata International Pictures S.L.",
         "Argentina Sono Film S.A.C.I."
      ],
      "summaries": [
         "Set in Buenos Aires, Argentina, the film tells the story of director Mario Suarez's quest to make the ultimate tango film. Lonely after his wife (one of the film's stars) has left him, Mario must find the themes that will hold the film together, while simultaneously permitting his musicians and dancers the freedom of expression that is necessary to satisfy the tango-hungry Argentine audience. Things become complicated when Mario falls in love with Elena, a beautiful and talented young dancer who is the girlfriend of the powerful and dangerous Angelo Larroca, an investor in the picture. And Mario's creative vision is challenged by his investors when he plans a scene that recreates Argentina's dark years of political suppression and \"disappearances\".",
         "In Buenos Aires, the director Mario Suarez is developing and rehearsing a tango play with historical events as background. Mario misses his mate Laura Fuentes, who has recently left him, and is recovering from a car crash with an injured leg. When the major investor Angelo Larroca asks for an audition for his lover Elena Flores, she succeeds and participates in the play; however, Mario falls in love for her and Elena fears the dangerous Angelo.",
         "Mario Suarez is a forty-something tango artist, whose wife Laura has left him. He leaves his apartment and starts preparing a film about tango."
      ],
      "budget": 700000000
   },
   "movielensId": 2573,
   "movielens": {
      "languages": ["Español"],
      "releaseDate": "1998-02-12",
      "dvdReleaseDate": "1999-08-03",
      "directors": ["Carlos Saura"],
      "runtime": 115,
      "movieId": 2573,
      "title": "Tango",
      "mpaa": "PG-13",
      "actors": [
         "Miguel Ángel Solá",
         "Cecilia Narova",
         "Mía Maestro",
         "Juan Carlos Copes"
      ],
      "imdbMovieId": "0120274",
      "originalTitle": "Tango, no me dejes nunca",
      "genres": [
         "Drama",
         "Foreign",
         "Romance"
      ],
      "youtubeTrailerIds": ["TRe1-K8eM7M"],
      "plotSummary": "A dangerous love affair inspires a director to create the most spectacular and bodly seductive dance film ever made. 1998 Oscar Nominee Best Foreign Language Film.",
      "tmdbMovieId": 65749,
      "avgRating": 3.34018,
      "releaseYear": "1998",
      "numRatings": 341,
      "posterPath": "/ngW0tkg7hmPQAZsfCC419GJxZ3O.jpg"
   }
}