{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "misfortune",
            "id": 209222
         }
      ],
      "imdb_id": "tt0129280",
      "video": false,
      "title": "The Out-of-Towners",
      "recommendations": [
         150889,
         19809,
         9409,
         20794,
         10407,
         12257,
         64161,
         29901,
         36934,
         64170,
         75531,
         20759,
         26261,
         31220,
         73587,
         3072,
         11584,
         11933,
         20551,
         68665
      ],
      "backdrop_path": "/v3V8YLg0bjahl3UtHvbisYnoMU7.jpg",
      "revenue": 29000000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Henry Clark",
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa63",
               "name": "Steve Martin",
               "profile_path": "/rI2EMvkfKKPKa5z0nM2pFVBtUyO.jpg",
               "id": 67773,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Nancy Clark",
               "gender": 1,
               "credit_id": "52fe44ccc3a36847f80aaa67",
               "name": "Goldie Hawn",
               "profile_path": "/29s9YEFtR1A3ijJ01JlLjYtLpNU.jpg",
               "id": 18892,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Mr. Mersault",
               "gender": 0,
               "credit_id": "52fe44ccc3a36847f80aaa6b",
               "name": "John Cleese",
               "profile_path": "/kg63gNYQtGPi2fSNIvCnVAclCbi.jpg",
               "id": 8930,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Greg",
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa6f",
               "name": "Mark McKinney",
               "profile_path": "/4ylJGA141TC8ypPp44xocInZFmK.jpg",
               "id": 56867,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Susan Clark",
               "gender": 1,
               "credit_id": "5630c49ec3a3681b5900f84a",
               "name": "Jessica Cauffiel",
               "profile_path": "/ohovTjdfOOFTQ72AKxdQV8CQqHS.jpg",
               "id": 22126,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Janitor on Train",
               "gender": 2,
               "credit_id": "57feacdec3a3685dfa0001a7",
               "name": "Charlie Dell",
               "profile_path": "/z0JgZxazJAVlHxLYXWM8eUZlOk8.jpg",
               "id": 62846,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Andrew Lloyd Webber",
               "gender": 2,
               "credit_id": "57feacf1c3a3685e0100017e",
               "name": "Tom Riis Farrell",
               "profile_path": "/7A3LpATFqv2FJYUTq59RQS4m0dP.jpg",
               "id": 60018,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Sheena",
               "gender": 1,
               "credit_id": "57fead0d92514147100001d9",
               "name": "Cynthia Nixon",
               "profile_path": "/nxOBg8AJ2kYLsGpTiDtwOT36uwE.jpg",
               "id": 38024,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Dr. Faber",
               "gender": 2,
               "credit_id": "57fead2692514147090001e0",
               "name": "Josh Mostel",
               "profile_path": "/jVG0WNJrTDEwETCDfoz0KxZ4vTd.jpg",
               "id": 33489,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Woman in Bathroom",
               "gender": 1,
               "credit_id": "57feadc3c3a3685df000020d",
               "name": "Anne Haney",
               "profile_path": "/hvGWQpPpZjWMBa59Bfp2S1mdP5f.jpg",
               "id": 11718,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Airline Representative",
               "gender": 1,
               "credit_id": "57feade492514147190001e8",
               "name": "Carlease Burke",
               "profile_path": "/vqYAwiodYB8a02iLqM2iYLqPQvR.jpg",
               "id": 149486,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa75",
               "name": "Sam Weisman",
               "profile_path": "/xTUHl1nYyGoTqcEfAxuiFq82Xcr.jpg",
               "id": 54967,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa7b",
               "name": "Marc Shaiman",
               "profile_path": "/aesoPh8jPR5qDKjjt7o5uj9kS3W.jpg",
               "id": 9251,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa81",
               "name": "John Bailey",
               "profile_path": null,
               "id": 1527,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa87",
               "name": "Kent Beyda",
               "profile_path": null,
               "id": 13584,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44ccc3a36847f80aaa8d",
               "name": "Marc Lawrence",
               "profile_path": "/ayItx1leDQbNklqX9wJbPGCD7Yk.jpg",
               "id": 18323,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.678549,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8970,
      "vote_count": 54,
      "budget": 75000000,
      "overview": "The remake of the 1970 Neil Simon comedy follows the adventures of a couple, Henry and Nancy Clark, vexed by misfortune while in New York City for a job interview.",
      "similar": [
         772,
         1771,
         594,
         59108,
         390043,
         57431,
         51876,
         1572,
         769,
         363676,
         10661,
         9029,
         8835,
         284,
         10204,
         40807,
         98566,
         194662,
         10096,
         315635
      ],
      "original_title": "The Out-of-Towners",
      "runtime": 90,
      "poster_path": "/zIEx8ttLYzfiyTS2PzcvRbYbL0j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Cherry Alley Productions",
            "id": 2232,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-02",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "They fell in love 24 years ago... and in the next 24 hours, they'll remember why.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Sam Weisman"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Neil Simon",
         "Marc Lawrence"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0129280/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxODIyMzAxN15BMl5BanBnXkFtZTcwODE5MjkyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Steve Martin, Goldie Hawn, John Cleese | See full cast and crew »"],
      "reviews": [
         "Neil Simon's script for the original 1970 hit, \"The Out-of-Towners,\" was, essentially, a one-joke skit stretched out to a feature-length film. Starring Jack Lemmon and Sandy Dennis as two suburbanites from Ohio who experience a nightmare of frustrating complications when they hit the Big Apple, the film managed to generate some laughs as well as a great deal of grating repetitiousness. The 1999 remake, with Steve Martin and Goldie Hawn in the central roles, manages to be a far worse film. The original at least seemed grounded in some sense of reality as the couple fell victim to a believable, if overstated, series of tourist mishaps; this version spins off into slapstick delirium, going so far as to have its main characters actually swinging on hotel signs six stories above street level and John Cleese as a snippy concierge prancing around in lady's clothing to Donna Sommer's \"Bad Girls.\" Also, in the original, Jack Lemmon seemed determined to really take on all the people who arrayed themselves against him and the film conveyed a real sense of this implacable, almost malevolent force known as NEW YORK coming down with all its might on this innocent couple from the Midwest. In the remake, Steve Martin seems strangely passive and unharried and the victory-over-the-city theme comes along only at the very end. Without that added dimension of epic frustration, the new film robs the original of whatever audience identification it might once have had and simply devolves into an undisciplined display of unfunny slapstick. Martin, Hawn and Cleese are game players, but this \"Out-of-Towners\" should indeed have been driven out of town!",
         "Every time I think about that movie, I always laugh over John Cleese's character, Mr. Mersault. He's rude, sophisticated in the outside, but he's also a transvestite who loves to dress in ladies' clothes dancing to Donna Summer's Bad Girl! And when I hear Donna Summer's song, it reminds me of John Cleese. Another scene I liked was when they were in the limo, and a drugged Steve Martin describes his wife as being \"Frisky!. He tells his wife to say that word as well as Mr. Mersault. The hotel manager loved that new word, \"Frisky!\". Years ago, I went to see John Pizzarelli in concert. Afterwards, I met him & told him I liked him the movie. He started singing \"That Old Black Magic\". Here's the zinger, I told him that his performance was very \"Frisky\"! Pizzarelli laughed at my comment! That made the movie funny for me!",
         "When I went to the sneak preview, I was afraid they would give me 'Runaway Bride', but they managed to come up with something so full of nothing, that I almost left during the break (and I have never done that), and I wouldn't have had to convince my friends. This thing is filled with jokes that I would be ashamed to come up with, like a candy bar stuck in the machine. We have never seen that before right? At one point Steve Martin is sitting in a Limo, and realizes he swallowed an XTC pill, then jumps out of the car and starts to rape a tree. John Cleese was the only funny part, but do yourselves a favour, and go see 'Runaway Bride'. I am sure it's much better. Dennis Pennis was right.",
         "Unfortunately, this movie is so bad. The original Out of Towners was manic and very funny, of course they used the script written by Neil Simon. For some reason Neil Simons script is not used in this film so it falls flat time and time again. Even the audience I was with never laughed. The direction is very slow and tedious and when there is a joke it is given away so the joke dies i.e. The couple having sex in the park. They announce it is a lighting ceremony for New York, well we all know the lights are going to come on and we will be able to see cute and mugging Goldie & Steve do a bit of slap stick. The whole movie winds up being like this...a joke is set up and given away. Why isn't Goldies hair ever even messed up in the movie. You will also notice every close up of Goldie (they use a very intense soft lens). I suggest you rent the original with Jack Lemmon and Sandy Dennis, that's if you want to laugh.",
         "The Out of Towners could have easily been called The Empty Nesters, or perhaps The Empty Plotters. Goldie Hawn and Steve Martin play Alice and Henry, a husband and wife of 27 years who's last child, (he's in his twenties) is tearfully sent off to Europe early in the film. He's not crying, they are, or are likely to. Anyway the parents flinch and then head off from their hick home town in Ohio to New York. Henry has a job interview to attend and we all know what middle aged, middle order executives looking for a job might run in to, at least in an intelligent script written properly for the nineties. The Out Of Towners was based on a screenplay penned by Neil Simon in the early 70's. The story has been re written for this version but it seems that the comedy slant was firmly in the sights of the producers. The plot was therefore left high and dry. It needed a much heavier rewrite. Henry and Alice have both been in advertising, but Alice has given the game away while she's been mothering the children. Henry is tired and a bit dowdy. It would be expected that a truly modern script would have found Alice moving back into her old career and Henry taking on home duties. Henry says as much in the film! Their daughter has also been accruing horrendous credit card debts on cash stricken Dad's card. This is glossed over in happy land Hollywood. And what's to become of Alice? She's lost for a career. So this emasculated script is left to flounder and to rely on a good deal of slapstick. Neil Simon's clever dialogue is largely gone, and the plot is without depth. We're left with a good deal of arm flapping, particularly from Goldie Hawn. As I write this, The First Wives Club (much, much funnier than The Out Of Towners) is on TV in the same room and there's Goldie again, arms a flapping, bum a poutin'. If there's a chair either Henry or Alice will fall over it, and as is the way these days, if there's a buffoon sidekick, he'll be gay. But still, except for it's contrived, energetic humour, which some patrons will enjoy immensely, The Out Of Towners does work reasonably well. There are one or two warm smiles, and perhaps a laugh or two, but really a bit more heart and common sense and a dose of plot credibility would have been an advantage.",
         "I don't know why so many people are slamming this movie, I thought it was hilarious. Goldie Hawn, Steve Martin, and John Cleese make the movie very, very funny. A decent sense of humor is all one needs to laugh from beginning to end.",
         "I have always been a big fan of Steve Martin, and hilarious 80's comedies like 'Trains Planes and Automobiles', so thats why I decided to rent this film. And I can tell you, I was not disappointed! Its not an hilarious movie, but it is funny from beginning to end. The mishaps that Goldie and Steve go through are sometimes predictable, but are always good for a chuckle. And John Cleese just steals the show. I have not seen the 1970 version, but I found this one pleasant and light hearted. I love watching 'endless mishap' comedies like National Lampoon's Vacation and 'Trains Planes and Automobiles', and this is another one to add to my collection. Steve Martin, you are king! And I can;t understand everyones negative comments on this film - maybe they were expecting just too much.",
         "I have always enjoyed Steve Martin and Goldie Hawn; however, I'm not to sure they work to well as a comedy duo. In one of Martin's previous roles he had played a dramatic role in \"The Spanish Prisoner\", which seemed to fit him better than play a comedic part. The jokes in this movie seemed to be old and unoriginal. I can't deny that this film was all bad; I did enjoyed bits and pieces of it; however, it seemed like it had been done before under the guise of a different movie title. It just did not have originality for me to keep my attention. It is a light hearted film that is worth seeeing at home for rent. I am just happy I didn't spend money to see at the theatres.",
         "I despise Goldie Hawn usually, and I found her very funny and touching in this movie as a supportive wife who's sacrificed her career for her children and now hopes to \"suck the marrow\" out of life. Steve Martin, as always, is hilarious. He is partially reprising his role in the BRILLIANT \"Planes, Trains, and Automobiles\" with a vengeance in this film. His attempt at controlling his demeanor at the car rental place by keeping a big smile on his face was really funny. \"This sign should say 'We have car.' honey!\" The homage to \"Mrs. Robinson\" looking through Goldie Hawns' legs at a sheepish looking Steve Martin took me by surprise as well. And, what more can you say about John Cleese? The man is nothing if not funny in everything he does. He is the anti-Fawlty in this movie, and he has a fairly juicy part as well, so look to him for some great laughs as well. Don't listen to all these people with no sense of humor. This isn't a classic film, but it's MUCH better than people have been saying. A little cheesy, a lot of fun.",
         "Being that I was a fan of the original, I found this film to be a complete disappointment. Who thought that they could remake the Out-Of-Towners? It was a stupid move actually. George and Gwen Kellerman are now George and Nancy Clark (Played by Steve Martin and Goldie Hawn). This time they are left with empty-nest syndrome after their son leaves for London. With nothing to do, George needs to go to New York because of a job interview that he desperately needs being that he was let go from his previous job after 23 years. The only thing is that Nancy doesn't know this. But she does nearing the middle of the film. A few jokes are resurrected from the original and still bring a smile to those that watched and enjoyed the original. Other than that, the rest of the movie is a complete disappointment from start to finish. Don't rush so fast to see this one. It is better to wait until it comes out on video."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Cherry Alley Productions",
         "Cort/Madden Productions",
         "Paramount Pictures"
      ],
      "summaries": ["The remake of the 1970 Neil Simon comedy follows the adventures of a couple, Henry and Nancy Clark, vexed by misfortune while in New York City for a job interview."],
      "budget": 40000000
   },
   "movielensId": 2574,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-02",
      "dvdReleaseDate": "1999-09-21",
      "directors": ["Sam Weisman"],
      "runtime": 90,
      "movieId": 2574,
      "title": "The Out-of-Towners",
      "mpaa": "",
      "actors": [
         "Steve Martin",
         "Goldie Hawn",
         "John Cleese",
         "Mark McKinney",
         "Jessica Cauffiel",
         "Charlie Dell",
         "Tom Riis Farrell",
         "Cynthia Nixon",
         "Josh Mostel",
         "Anne Haney",
         "Carlease Burke"
      ],
      "imdbMovieId": "0129280",
      "originalTitle": "The Out-of-Towners",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["erByzW27zEM"],
      "plotSummary": "The remake of the 1970 Neil Simon comedy follows the adventures of a couple, Henry and Nancy Clark, vexed by misfortune while in New York City for a job interview.",
      "tmdbMovieId": 8970,
      "avgRating": 2.63294,
      "releaseYear": "1999",
      "numRatings": 1591,
      "posterPath": "/zIEx8ttLYzfiyTS2PzcvRbYbL0j.jpg"
   }
}