{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "factory worker",
            "id": 730
         },
         {
            "name": "coma",
            "id": 732
         },
         {
            "name": "soulmates",
            "id": 815
         },
         {
            "name": "flat",
            "id": 1439
         },
         {
            "name": "shortage of money",
            "id": 4900
         },
         {
            "name": "female friendship",
            "id": 5248
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "lille",
            "id": 237281
         }
      ],
      "imdb_id": "tt0120449",
      "video": false,
      "title": "The Dreamlife of Angels",
      "recommendations": [
         39968,
         118895,
         42634,
         42144,
         64559,
         121461,
         110771,
         199503,
         198835,
         101330,
         117478,
         117239,
         107035,
         350127,
         27441,
         102514,
         64968,
         31344,
         86240,
         38523
      ],
      "backdrop_path": "/1NB8wwiqvjLXArQaHj6lMmdyulu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Isabelle 'Isa' Tostin",
               "gender": 1,
               "credit_id": "52fe4538c3a36847f80c2ce5",
               "name": "Élodie Bouchez",
               "profile_path": "/27tWcI5AjtrIOyzkXUJmLaWkvUj.jpg",
               "id": 59807,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Marie Thomas",
               "gender": 1,
               "credit_id": "52fe4538c3a36847f80c2ce9",
               "name": "Natacha Régnier",
               "profile_path": "/so9iXkL7FgvKNUJ40mJJuaHXjg1.jpg",
               "id": 59826,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Charly",
               "gender": 0,
               "credit_id": "52fe4538c3a36847f80c2ced",
               "name": "Patrick Mercado",
               "profile_path": null,
               "id": 59830,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Chriss",
               "gender": 2,
               "credit_id": "52fe4538c3a36847f80c2d0f",
               "name": "Grégoire Colin",
               "profile_path": "/dkz109o3fl5PL4mak1ZhhU5tI35.jpg",
               "id": 136170,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Fredo",
               "gender": 2,
               "credit_id": "52fe4538c3a36847f80c2d13",
               "name": "Jo Prestia",
               "profile_path": "/7ZF93XBMOF5Mr6F22YKGnzM4QMp.jpg",
               "id": 14610,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4538c3a36847f80c2cf3",
               "name": "Erick Zonca",
               "profile_path": "/j7KH9JZDY7ExyKgEQoFWYSha1d1.jpg",
               "id": 19377,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4538c3a36847f80c2cf9",
               "name": "Erick Zonca",
               "profile_path": "/j7KH9JZDY7ExyKgEQoFWYSha1d1.jpg",
               "id": 19377,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4538c3a36847f80c2cff",
               "name": "Roger Bohbot",
               "profile_path": null,
               "id": 32502,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe4538c3a36847f80c2d05",
               "name": "Agnès Godard",
               "profile_path": "/aPpU4xD0mtTZY29RmBXcv3h5QnU.jpg",
               "id": 14196,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4538c3a36847f80c2d0b",
               "name": "Yann Tiersen",
               "profile_path": null,
               "id": 2422,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.526929,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 9840,
      "vote_count": 25,
      "budget": 500000,
      "overview": "In Lille, two penniless young women with few prospects become friends. Isa moves in with Marie, who's flat-sitting for a mother and child in hospital in comas following a car crash. Isa is out-going, unskilled, with hopes of moving south to warmer climes. Marie usually is either angry or detached. Then, while Isa begins to visit the child in whose flat they live, going to hospital to read to her, Marie slowly falls for a rich youth. At first Marie keeps him at bay, then she not only pursues him, she begins to dream he is her life's love. When Isa tries to warn Marie, their friendship flounders. How will Marie handle the inevitable? And once they lose the flat, where will they go?",
      "similar": [
         23168,
         40807,
         68718,
         28178,
         8065,
         509,
         2009,
         290762,
         397422,
         62211,
         41630,
         862,
         55721,
         10625,
         8839,
         376660,
         50725,
         80038,
         888,
         13523
      ],
      "original_title": "La vie rêvée des anges",
      "runtime": 113,
      "poster_path": "/7QMEbbtZt3141wWG8CFgAp7ooAm.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1998-09-16",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Erick Zonca"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Erick Zonca",
         "Roger Bohbot"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0120449/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjQ3Njc2MTE2OV5BMl5BanBnXkFtZTYwNDAzMTk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Élodie Bouchez, Natacha Régnier, Grégoire Colin | See full cast and crew »"],
      "reviews": [
         "Two French girls who are \"not the chosen ones\" (to recall Cyndi Laper) befriend one another after meeting at a sweat shop where they operate sewing machines. One of them, Marie (Natacha Régnier) is apartment-sitting for a mother and her daughter who are in the hospital, victims of an accident. The other, Isabelle (Élodie Bouchez) has been living day to day with her backpack on her back, sometimes selling handmade cards on street corners. Almost immediately there is an affinity, and they find joy and adventure in one another's company. Part of the power of Erick Zonca's forceful and precise direction is to make us not only identify with his two heroines, but to force us see the world from their point of view. They are tossed about by strong emotions, powerfully projected by both actresses. Their lives and happiness are at the whim of forces beyond their control, the most powerful of which are their own feelings. When I was a little boy and went to the movies I would see three films, bang, bang, bang, one after the other, and when I came out, five or six hours later, I was transformed. I had grown, and I could see the world in a different way. Of course I was a little boy and every little bit of experience was amazing and added to my knowledge of the world. Now, such transformations, like moments of Zen enlightenment, are rare and precious. The Dream Life of Angels is one of those rare and precious films that has the kind of power to make us see the world afresh as though for the very first time. Bouchez and Régnier shared the Best Actress award at the 1998 Cannes Film Festival for their work in this movie. Indeed it is hard to choose between them. Both are wonderful. Bouchez's character, Isabelle, has a gentle, fun-loving, child-like nature, tomboyish and sentimental. Marie is cynical, uptight and wired. Her emotions swing wildly from deep pessimism to a tenuous hope for something better in this life. When she is seduced, rather forcefully, by the arrogant and predatory Chris (Grégoire Colin) who owns nightclubs and is accustomed to having his way with women, she is stunned to find that she wants him, needs him, loves him. But she knows (and is warned by Isabelle) that he is just using her and will dump her. She hates herself for loving him and therefore lashes out at Isabelle who is a witness to her humiliation. As a counterpoint to the raw animal love that Marie finds in Chris, there is the tender, dreamlike love that Isabelle finds for the daughter of the woman who owns the apartment. The mother dies from her injuries, but the daughter, Sandrine, lives on in a coma. Isabelle finds Sandrine's diary and reads it, and is touched by the sentiments expressed by the girl, and falls in love with her. A nurse tells Isabelle: \"You can talk to her. She's sleeping, but she can hear you.\" Whether she can or not, we don't know, but to show her love Isabelle visits the comatose girl in the hospital and reads from her diary to her. In a sense we feel that the dream life of angels is the dream of Sandrine, who is dreaming the life of the young women who are living in her apartment. She is an angel and they are her dream, a troubled dream of raw emotion contrasted with her state of quiet somnolence. The Dream Life of Angels is beautifully shot in tableaux of pastel interiors in which the characters are sometimes seen at offset as in portraits. In one scene we see one of the girls in the apartment while in the right upper corner is a window through which we see in clear focus a car pass in front of a picturesque building, so that the scene is seen in layers, so that we experience the inner life and the outside world at once. In another scene, Isabelle is reading Sandrine's diary, which we see over her shoulder. Just as she reads the words that excite her passion for the girl, there is just the slightest quickening of tempo as Isabelle flips the page to see what Sandrine writes next, and in that small gesture, we feel the emotions of the girls, the one who wrote the words and the one who reads them. As a foil to the smooth, but bestial Chris, we are given Charlie (Patrick Mercado), fat motorcycle dude who is gentle and wise. This enlightened juxtaposition of character is part of director Erick Zonca's technique. We see it also in the contrasting characters of Marie and Isabelle. Obviously this is a work of art, but it is also a triumph of film making in a directorial sense. Zonca's careful attention to detail and his total concentration throughout turn something that might have been merely original into a masterful work of art. (Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon!)",
         "Think of desperate couples in cinema and you conjure up Joe Buck and Ratzo from \"Midnight Cowboy\" or \"Thelma and Louise\". After seeing the beautifully done French film, \"Dreamlife of Angels\", you must add Isa and Marie to that list. \"Dreamlife of Angels\" triumphs because it is a story simply told and acted with such real-life honesty that you feel intimately tied to the main characters by film's end. It also helps that it is filmed mostly with a hand-held camera giving close ups and studied portraits of two people's alienated lives. Isabella is twenty-one, moving from town to town with all her worldly belongings on her backpack, intelligent yet strangely without much of a future. Marie is the same age and in the same rut, seemingly without any anchor herself although she does have a flat she is 'house-sitting' since the mother and daughter occupants have been involved in a tragic auto accident. They want to chain smoke their way through life, devoid of wealth and ambition. There is much insight into their broken lives when Isa remarks that her father left her mother for another woman when she was young while Marie counters that having separated parents is better than to have an abusive father living together with her victimized mother. The title of this film suggests an angelic life but it is clear from their bleak existence that it is a wish and a yearning rather than reality. Isa and Marie do get to share each other's misery. And their desire not to follow the cookie cutter mode does unite them for awhile (the film makes pointed references to a sewing factory and an electronics workplace where everyone is doing the exact tedious chore). However Marie falls prey to her blind passion to love and be loved and cannot tolerate the conscience personified by Isa. For it is Isa that nags about loyalty to friends, about the scoundrel boyfriend Chris who will only break her heart and about a bond of fidelity toward Sandrine, hospitalized in a deep coma and someone Isa knows only from reading her personal diary. \"Dreamlife of Angels\" could have passed as another soap opera if not for the genuine performances of Elodie Bouchez as Isa and Natacha Regnier as Marie. Their smiles and grimaces are heartfelt and it is their portraits which illuminate a most telling story of love, betrayal, and finally resignation.",
         "Dreamlife Of Angels best exemplifies why I enjoy foreign films. It is not dependent on \"star\" power, computer generated images, overt violence, or scenes with fantastic stunts. What it has are characters which are richly developed, believable, showing emotions which are palpable and for whom we can care. What we find out here is simple is sometimes best. The plot is the life and death of a friendship. It is an interesting character study of two poor, young women. One is outgoing and carefree while the other has been abused is more withdrawn and insecure. The set is a small, very plain town in France which was filmed simply and often with hand held cameras. The performances by Elodie Bouchez (Isa) and Natacha Regnier (Marie) in the title characters were outstanding. Gregorie Colin (Chris) as the boyfriend, club owner, and heel was great as well. The film as also provides food for thought in its title especially considering the last few scenes. I'll let you make those conclusions. If you don't get to see this film in the theater, rent it. Caution: the film's rating is due to a rather explicit sex scene. Three plus stars!!!",
         "This film confirms my long-held suspicion that their films are the best. They may not make as much money as US films but at least they offer something of substance. Clearly, this is not a feel-good movie. And no, it's not about beautiful people living ostentatiously in palatial houses and wearing designer colthes. It's about the real life of two normal people and, although that might not appear to be a recipe for a particularly fascinating film, I was enthralled. It is so rare nowadays to see a films that conveys emotions and human relationships so powerfully and I have no hesitation in putting this film in my short list of the best I've seen in recent years. In detail, two girls whose lives are drifting nowhere are staying rent-free in the flat of a family all but one of whom have been killed in a car accident. One of the girls has a family background that we never learn more about but which is clearly unhappy. She pins her hopes on a rich boyfriend whose father owns the nightclub they frequent. The other girl is more of a thoughtful type and becomes obsessed with the only survivor from the car accident whom she regularly visits in hospital, where she is lying in a deep coma. The girls' lives start to take different directions, their relationship breaks down and one of them starts to lose her mind. Any further detail would spoil the plot but the final scene shows one of the girls working in a clean and efficient-looking factory which is in marked contrast to the tacky sweat shop where the girls were working at the beginning of the film. For all the tragedy, the film's message is ultimately one of hope: however hard life is, don't give up.",
         "The reason to watch \"The Dreamlife of Angels\" is to see how an accomplished and talented actor makes a movie come to life and seem absolutely real, for that is what both Elodie Bouchez and Natasha Regnier achieve in this film. Which performance is better? Upon several viewings, one must conclude that it is a draw. Bouchez's Isa opens the film as a wandering street urchin searching for a warm place to spend the night in Lille, a town in northern France. You feel sorry for her because she has no one but herself upon which to depend and roams around trying to find a decent situation, but her appearance and behavior are a tad off-putting and you can understand why no one is falling all over themselves to help her out. Once she does land a place to live with her alienated and terminally pessimistic workmate, Marie, she begins to blossom, gradually at first, ultimately being transformed into a lovely, sensuous, introspective, and vastly intuitive young lady who is a pleasure to watch. The key to her transformation is the security she has found, her budding friendship with Marie, and the comatose patient, Sandrine, whose apartment they share while she is in the hospital recovering from the accident that killed her mother. For the helpless Sandrine, Isa fully expresses her generous, optimistic nature, and with her care and attention, ultimately saves the girl's life. Sandrine, for her part, has given Isa exactly what she needs -- a secure place to live, the companionship it provides in housemate, Marie, and someone worse off than she had been who needs her help to survive. The high point of the film is one scene between Isa and Marie, wherein the two young women are discussing Isa's relationship with Sandrine after she confesses that she found the comatose patient's diary and had read it to her aloud in the hospital, hoping to wake her up. More than at any other point in the movie, we now see how beautiful these two \"unexceptional\" girls really are, the depth of their characters, and the poignance of their perceptions, despite their youth. Watch Bouchez's facial expressions closely. This naturally attractive actress is so subtle, but no doubt the cameraman should be given some of the credit, too, for it is he or she who captured it all on film. Regnier's performance is of an entirely different sort. She is such a sad young woman, so full of anger, pride, dignity, and spirit but utterly defeated by the world going in. She fully understands and appreciates the scope of its cruelty and has almost resigned herself to never being happy, yet she keeps trying. The last time she tries is when she pins all her remaining hopes on the stinking, arrogant little bastard, Chris, whose perennially smug expression practically demands a well-deserved punch in the face. He is the quintessential spoiled brat who has been totally sheltered from the seamier realities of life and always gets what he wants (or he will throw a tantrum). I've known many people of this sort, for they are an all-too-common breed, and am always appalled at the depths to which they will sink, their absence of shame, and the complete lack of insight they possess concerning the simplest of life's enduring truths. Nevertheless, they populate this earth like a bunch of selfish, sadistic cyborgs, ruthlessly dominating the less-advantaged and the underprivileged in the pursuit of shallow (if widely-recognized) achievements, seeking relief from the inevitable pressures they encounter with transient, ephemeral pleasures. They remain convinced that their money, their homes, their cars, their jobs, and their \"perfect\" children somehow totally define their worth, which of course, just ain't so, yet at any suggestion of this inconvenient fact, they may become truly dangerous and are capable of almost any turnabout or betrayal, however low and despicable. This \"winner\" Chris, therefore, is a corrupted, suppurating sore on the ass of humanity, although nobody but the \"losers\" Isa and Marie have the guts to put him in his place. Unfortunately, Marie falls in love with him, despite her knowledge of what a crumb he is, and is thus rendered powerless to defend herself against his predatory nature, sacrificing herself in his stead. Isa finally rebukes him soundly for the thoughtless way he has toyed with Marie's emotions before casting her aside. Like a total coward, he actually expects Isa to inform Marie that their affair has ended because he cannot face her, and the slap he receives is little more than a slap on the wrist. He slinks away wearing the same stupid, self-satisfied grin we have come to expect. In the scenes where Marie seeks his company, knowing full well that she likely will be taken down yet another notch, the distraught, pained look in her childlike eyes is intense. Probably her best scene is when her competition, a pretty but shallow French snob (the sort of conceited blonde tart one used to see in ski lodges flirting with the owner), dares to insult her right in front of Chris. Marie suddenly jumps her and gives her the all-too-brief ass-kicking she so richly deserves. Regnier is dead-on as the spirited, take-no-sh** Marie and her untimely demise is very sad. At least Isa, who isn't so proud about what she must do to make a meager living) is able to carry on, and just before Regnier is sacrificed, Sandrine emerges from her coma and is going to live. The ending is therefore mixed but hopeful, and a haunting song is played as Isa starts a new, more promising job and the credits roll. This is a poignant movie that demands repeated viewings.",
         "\"Dreamlife of Angels\" is an absorbing film about two young French women struggling to find their place in life. Both are solidly working class, unskilled and rootless. Circumstance has thrown them together and the film describes a two-month period as they housesit the apartment of a car accident victim. Their prospects are not great, and each deals with the hand life has dealt them very differently. This is not an uplifting movie, but not a downer either. It tells it's story straight up and unflinchingly. Everything about it is top drawer; the screenplay, the directing and especially the acting by the two young leads, Elodie Bouchez and Natacha Regnier. We'll definitely see more them in the future. This movie is highly recommended.",
         "This touching and compelling story is another one of those films which year after year drive me further and further away from Bollywood pot-boilers. In Europe we make films: in Hollywood they make spectacle turn-gate busters. This is a simple but sensitive story of two girls somewhat adrift in life, somewhat lost in the hopes for life, somewhat floating from day to day without much to go on or go by. But so refreshingly and carefully enacted and directed: Eric Zonca is indeed one of those directors who put great power into simple stories, so that the resulting film is captivating, beyond the story per se. Here is excellent European theatre, among the best. Mixing tragic moments with joyful experiences, mixing friendship in the deepest human values. \"La Vie rêvée des anges\" is a film for the intelligent and sensitive viewer who wants to see real life human drama at ground level. If you like this film, do not miss Fernando León de Aranoa's \"Princesas\" (2005)(qv).",
         "At the risk of sounding like a quote whore, if I see ten films better than this one released this year, 1999 is going to be an excellent year. First time director Erick Zonca has made an absolutely stunning debut, which not only resonates while you watch it, but gets you thinking afterwards (for example, I didn't get that last shot right away, but after thinking about it, I did). And while there's a philosophical point to be made, this is not what I would call a \"nothingness of being\" movie, where the primary interest of the filmmaker would seem to be either lecturing the audience, or in self-indulgent symbolism. Instead, Zonca makes his points lightly and carefully, allowing them to build up for us later. Of course, it also helps that he has the services of Elodie Bouchez and Natacha Regnier, who deservedly shared the Best Actress Award at Cannes last year(and if there's any justice, will be nominated for an Oscar this year). Bouchez's Isa is hooked on life, in a dreamy way, and is open to all the possibilities, yet she sees how fleeting it all is. Regnier's Marie, on the other hand, doesn't expect much from the hand she's been dealt, and enters a bad relationship because of it, but there's enough there that we desperately wish she could find the peace Isa wishes her near the end. I forget who said great acting is in the eyes, but Bouchez and Regnier certainly qualify there; you can see the life in Bouchez's, and the cold resignation in Regnier's. This is an outstanding film.",
         "A very strong movie, concentrated on the lives of two girls who share an apartment. One of the girls, Marie, is one of the most dramatic characters I've ever seen in a movie : she falls in love with a man who only uses her - she realises this but cannot resist him despite herself. The other girl, Isa, gets entangled in Marie's life. The story reminded me of the atmosphere of 'the unbearable lightness of being' of Kundera (the book rather than the movie). An additional strong point of the movie is the very persuasive acting.",
         "This was one of the most moving, intimate, insightful movies I have seen in years. It is one that I have gone back to in my mind many, many times since. I would recommend this movie to anyone and have in fact! The final piece of music, the song \"Rue des Cascade\" by Claire Pichet is a fantastic piece of art. The music is emotional, gripping and flowing, I love it, but the ending with Claire's voice makes it all the more better, as her voice truly sounds like it came from the heavens!! I think anyone who perhaps found it unenlightning, trite or dull the first time around would do themselves an injuistice to not go back to give it a second chance!"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Diaphana Films",
         "Les Productions Bagheera",
         "France 3 Cinéma"
      ],
      "summaries": ["In Lille, two penniless young women with few prospects become friends. Isa moves in with Marie, who's flat-sitting for a mother and child in hospital in comas following a car crash. Isa is out-going, unskilled, with hopes of moving south to warmer climes. Marie usually is either angry or detached. Then, while Isa begins to visit the child in whose flat they live, going to hospital to read to her, Marie slowly falls for a rich youth. At first Marie keeps him at bay, then she not only pursues him, she begins to dream he is her life's love. When Isa tries to warn Marie, their friendship flounders. How will Marie handle the inevitable? And once they lose the flat, where will they go?"],
      "budget": 0
   },
   "movielensId": 2575,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-09-16",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Erick Zonca"],
      "runtime": 113,
      "movieId": 2575,
      "title": "The Dreamlife of Angels",
      "mpaa": "",
      "actors": [
         "Élodie Bouchez",
         "Natacha Régnier",
         "Patrick Mercado",
         "Grégoire Colin",
         "Jo Prestia"
      ],
      "imdbMovieId": "0120449",
      "originalTitle": "La vie rêvée des anges",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In Lille, two penniless young women with few prospects become friends. Isa moves in with Marie, who's flat-sitting for a mother and child in hospital in comas following a car crash. Isa is out-going, unskilled, with hopes of moving south to warmer climes. Marie usually is either angry or detached. Then, while Isa begins to visit the child in whose flat they live, going to hospital to read to her, Marie slowly falls for a rich youth. At first Marie keeps him at bay, then she not only pursues him, she begins to dream he is her life's love. When Isa tries to warn Marie, their friendship flounders. How will Marie handle the inevitable? And once they lose the flat, where will they go?",
      "tmdbMovieId": 9840,
      "avgRating": 3.93035,
      "releaseYear": "1998",
      "numRatings": 1443,
      "posterPath": "/7QMEbbtZt3141wWG8CFgAp7ooAm.jpg"
   }
}