{
   "tmdb": {
      "original_language": "fr",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0116932",
      "video": false,
      "title": "Love, etc.",
      "recommendations": [],
      "backdrop_path": "/lFgErpLAAZchcHycE8oCp54TYQB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Marie",
               "gender": 1,
               "credit_id": "52fe4d049251416c7512d291",
               "name": "Charlotte Gainsbourg",
               "profile_path": "/hWUtcljrFsaSf9ZFTgjIoo4FxfQ.jpg",
               "id": 4273,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Benoît",
               "gender": 2,
               "credit_id": "52fe4d049251416c7512d295",
               "name": "Yvan Attal",
               "profile_path": "/kSP1gv3n06amj8zoajm8Gam5Mzl.jpg",
               "id": 2245,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe4d049251416c7512d299",
               "name": "Charles Berling",
               "profile_path": "/5W9uDe33eFYFNOW5lqJVvlzHkzb.jpg",
               "id": 48576,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4d049251416c7512d29d",
               "name": "Thibault de Montalembert",
               "profile_path": "/9a7UV4wMCiLL2xwhkouFjgXQlUa.jpg",
               "id": 19361,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d049251416c7512d2a1",
               "name": "Élodie Navarre",
               "profile_path": "/hLTiIyutbtih9JxISMO3tOPE4zD.jpg",
               "id": 142443,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4d049251416c7512d2a5",
               "name": "Marie Adam",
               "profile_path": null,
               "id": 534168,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d049251416c7512d2a9",
               "name": "Charlotte Maury-Sentier",
               "profile_path": "/u6J0E6wXNxgjt02VHjEEkMZ7l7H.jpg",
               "id": 364611,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4d049251416c7512d2ad",
               "name": "Valérie Bonneton",
               "profile_path": "/sgCXut1t8MEI00sx699TdiLTAwt.jpg",
               "id": 54324,
               "order": 7
            }
         ],
         "crew": [{
            "gender": 1,
            "credit_id": "52fe4d049251416c7512d28d",
            "name": "Marion Vernoux",
            "profile_path": "/oGtxaTXdQKqhpqP3Oar9LpbgiwD.jpg",
            "id": 24560,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.372051,
      "production_countries": [],
      "id": 186705,
      "vote_count": 2,
      "budget": 0,
      "overview": "A triangle: love, obsession, and choice. Pierre, a ladies' man who has little cash and no fixed residence, describes his best friend Benoît as the world's oldest 32-year-old. The shy, well-employed Benoît's life changes when he answers the personal ad of Marie, a 25-year-old who restores paintings. He's attracted to her and she likes his steady calm and his honest attention. They're soon a couple, and they include Pierre in their dinners, outings, and trips. What will happen when Pierre realizes that he too is in love with Marie?",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         297762,
         376867,
         394117,
         437557,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Love, etc.",
      "runtime": 105,
      "poster_path": "/gsoWfGTJV6B4KgGE4FDXOoPgyOR.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1996-11-27",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marion Vernoux"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Dodine Herry",
         "Marion Vernoux"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0116932/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1MTAxMjgxNV5BMl5BanBnXkFtZTcwODQ5NDEzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Charlotte Gainsbourg, Yvan Attal, Charles Berling | See full cast and crew »"],
      "reviews": [
         "This is one of the funniest, saddest and most truely beautiful films I have ever seen. I watched this film several months ago in the Cambridge Arts Cinema and the memories of its wonder remain with me today. I took my boyfriend, who speaks no french, to see it, worried that he would be bored and frustrated by imposing subtitles and missing some of the very \"frenchness\" that brought the French government to insist on \"l'exception culturelle\" that makes French films so special to watch. What a waste of anxiety! The two of us were spell bound throughout the whole performance. Attal, Gainsbourg and Berling's performances are gripping. The film is intense- filled with extremes of emotion. In the space of seconds the actors manage to plummet the audience from laughter to stunned silence as the plot unfolds. We are not witnesses to this story, we are able to involve ourselves deeply with the highs and lows of the action. But it's not simply a well-acted and well written script that make this film compelling viewing. What I really love about french films is the way you can climb into the heads of the characters so well. I found myself fascinated by the transformation of Pierre (Attal) from the eternal bachelor to the devoted lover. His character literally takes the place that Benoit (Berling) occupied in the opening scenes. This transformation could have seemed clumsy, even unbelievable, but the subtlety of Attal's acting made it gripping and convincing to watch. Equally dramatic is the eruption of the quiet Benoit over dinner when he confronts Marie (Gainsbourg) and Pierre about their affair. Gainsbourg too, is very strong in the role of Marie, especially in her development of Marie's anger into love for Pierre. What is essentially a sad story (a best friend running off with his best friend's wife and a wife who is torn in love for two very different men) is also very comical and even ends with that feeling that this is something very sad yet very beautiful. The real beauty of this film is its ending... which I shan't expand on for fear of ruining it for anyone who wants to see the film. I shall only say that these final scenes made me think about the entire film for hours, even days afterwards. I left the cinema truely spellbound by the magic that had been worked in the space of a couple of hours. The soundtrack complements this film excellently and I recommend you buy the cd. I chased over London to find it and it is one of the best £17 pounds that I have ever spent. Music by Lenard Cohen, Pavarotti plus music written specially for the film follows the same intensive pattern of emotions that the film does. If you make time to see one film, see this one. Even now I cannot stop thinking about the power and magic of it. My only regret is that I can't seem to find it on video in the UK as soon as I can, I shall \"take this waltz\" many times again.",
         "Long a fan of French films (Eric Rohmer is my favorite director), I rented \"Love, etc.\" with high hopes. I have often found that even the most superficial of French films have more to say about life and relationships than the best Hollywood product. \"Love, etc.\" proved to be an exception. It starts off promisingly, successfully capturing the dynamics of a long-term friendship and the awkward dance common at the beginning of relationships. But it soon degenerates into a story of three superficial, unlikable characters with hard-to-fathom motivations. There is little evidence of \"love\" and much exploration of \"etc.\". The self-congratulatory \"aren't-we-civilized-and-modern\" final scene only serves to cap off what is, on the whole, a truly bad French film.",
         "\"Love, etc.\" gently goes along like a modern version of Truffaut's \"Jules & Jim\"... It's a rather nice movie, well directed in a clean and polished way, quite sensitive and even touching at times... The best things about it are -no doubt- Charlotte Gainsbourg's inspired performance (\"as always...\" one might add), Yvon Attal's touching caracter, and an absolutely brilliant music score from Alexandre Desplat... The \"not-so-good\" things include a rather unconvincing and over-acted performance from Charles Berling, and the general feeling that the movie never really realises how gripping and emotional it could have been if it hadn't been so... hum... polished actually. Worth seeing though... PS : ...and now available in France on VHS, for you anonymous fan of this movie !!!",
         "Marion Vernoux is good at pain and relationships and even better at painful relationships (she worked on the screenplay of Tonie Marshall's brilliant Venus Beaute' and wrote and directed the wonderful Rien a faire which translates as nothing doing) and here, straying into Jules et Jim territory she applies scalpel and probe to expose the diseased tissue in a melancholic menage a trois. Yvan Attal, an excellent writer director himself, and Charlotte Gainsbourg have long been an offscreen couple and often act together so it's not unusual that they make it look easy. The fatal flaw in all this is Charles Berling, a fine actor as he's demonstrated time and again but woefully lacking in the charm and charisma which we are constantly informed is Pierre's stock in trade - where other unprepossessing men sometimes laugh women into bed we can only assume that Pierre has bored his string of girl friends into bed. Apart from Jules et Jim we're also in the Forbidden Fruit ballpark here; Hitherto it's Pierre who inhabited the Fast Lane love/sex-wise while Benoit couldn't get arrested but when Benoit, against all the odds, meets and marries Marie, Pierre cannot and will not rest until he has seduced her away from his best friend and as someone once said, with friends like that ... Vernoux contrives to inject a delicate Chekhovian melancholy into even the happier scenes and for those who insist on reading deeper meanings into even Police Academy it could be argued that Benoit is a Vanya who actually wins his great love only to lose her and wind up attempting to balance the books of his emotional life without even a niece to assist him and share his misery. If Rien a fair remains Vernoux's finest film (to date) by a mile Love, etc is an honourable second.",
         "This film inspired me to read the Julian Barnes novel in French (!), so it must have something going for it. It's your basic menage a trois movie, but is filmed with admirable restraint. The stripped back mise en scene suggests the emotional emptiness of the characters' lives, or perhaps rather their fear of emotion. It is an interesting experience in cross-channel perceptions that this quintessentially English novel (despite Barnes' obsession with France - but then francophilia is an English trait too) was turned into a French movie. The story of individual suffering in the novel (a brilliant moment where each character proclaims 'it's me who will suffer the most') is here translated into abstracted ideas about friendship and love (perhaps friendship is the 'etc' of the title. The title comes from a passage in the book (called Talking it Over in English version) where the characters discuss how letters are signed off. Love is a synonym for good-bye. Love, it seems, is unable to sustain itself - there can be no forever. This makes the ending especially poignant.(SPOILER ALERT) Marie says she is on the beach with the two men she has loved most in her life, but she can't have them both. Something will always be missing.",
         "A French adaptation of a Julian Barnes novel, this is a pretty basic and very tedious romantic triangle: when shy loser Yvan Attal hooks up with Charlotte Gainsbourg, his luck changes while his best friend Charles Berling's fortunes suffer reverses as he falls for her and bores passing strangers by telling them his hopes of how to win her. Unfortunately this seems to be by going for the Anakin Skywalker route of whining her into submission, as his tiresome self-pity gradually and inexplicably wins her over. There are a few nice moments: a wedding photo in which all three reveal their innermost thoughts, one of Berling's captive confessors asking him \"Don't you ever get tired of your bulls**t?\" and Berling following his comparison of an affair being as unsatisfactory as a holiday in Marbella by his nervous rambling that \"Actually, Marbella can be nice at this time of year. I went there once. It's best to go off season.\" Similarly, his dismissal of Leonard Cohen's genius by admitting he finds a lack of imagination in rhyming 'ay' with 'ay ay ay' neatly punctures Attal's tendency to play Cohen's waltz at every opportunity. Unfortunately they are few and far between, and Berling is astonishingly annoying here. You keep on waiting for someone to hit him, repeatedly (now there's an idea for a movie!), but it never happens. There is one great final confrontation when Attal confronts the two: his performance has real power here and the writing mirrors the ebb and flow and awkwardness of such moments. But it's not enough.",
         "I was impressed by the performances of Charlotte Gainsbourg and Yvan Attal (who co-habit in real life) in the 2001 film \"My Wife Is an Actress\" and so I was pleased to find this earlier film, \"Love, etc.\" they did together in 1996. It is a moving, evocative story marked by good acting but unfortunately marred by a terrible ending that is contrived, too pat and unbelievable. Benoit (Attal) and Pierre (Charles Berling) are friends since grade school. Pierre is the dominant one of the pair -- handsome, outgoing, good with girls -- and the introverted Benoit is the sidekick. But then the tables are turned. Pierre gets in trouble at work and loses his job. Benoit, responding to a personals ad, finds true love in Marie (Gainsbourg), an equally shy and insecure wallflower, and soon they marry. Suddenly Benoit is the friend whose life is going well. Pierre, as if he can't stand Benoit's happiness, decides that he loves Marie and must have her. He launches an obsessive campaign to woo her. She protests but by not taking steps to stop it (such as telling her husband about it) she invites further attention. Inevitably, and unbelievably, she falls for this best friend/stalker. Even Benoit seems to be aware of what's happening, but unable to articulate his feelings to Marie or Pierre he seems helpless to prevent it, and resigned to his fate. The scene in which Benoit finally confronts Marie and Pierre is powerful. Gainsbourg, an immensely appealing actress if not a classic beauty, conveys great emotion without uttering a word. (POSSIBLE SPOILER) Up to that point it is a very good movie. Then it flashes forward to New Year's Day, 2000, and the beach where the trio, during earlier, happier, times promised to meet and celebrate the turn of the century. Marie has dumped poor Benoit and, while still technically married to him, taken up with Pierre. They engage in mundane chitchat. It appears that they are no longer close but still friendly. She makes a little speech about being with the only two men she ever loved. What baloney! She can't have it both ways. Marie and Pierre, wife and best friend, betrayed Benoit. She chose Pierre over her husband. She and Pierre acted in ways to humiliate Benoit. The idea that he would remain civil, let alone friendly, with the treacherous pair stretches credulity too far. And that's where the movie leaves it -- nowhere. As nicely done as the movie is to that point it leaves the viewer feeling empty, frustrated and cheated, much as Benoit must have felt."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Alicéléo",
         "France 3 Cinéma",
         "StudioCanal"
      ],
      "summaries": ["A triangle: love, obsession, and choice. Pierre, a ladies' man who has little cash and no fixed residence, describes his best friend Benoît as the world's oldest 32-year-old. The shy, well-employed Benoît's life changes when he answers the personal ad of Marie, a 25-year-old who restores paintings. He's attracted to her and she likes his steady calm and his honest attention. They're soon a couple, and they include Pierre in their dinners, outings, and trips. What will happen when Pierre realizes that he too is in love with Marie?"],
      "budget": 0
   },
   "movielensId": 2576,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1996-11-27",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Marion Vernoux"],
      "runtime": 105,
      "movieId": 2576,
      "title": "Love, etc.",
      "mpaa": null,
      "actors": [
         "Charlotte Gainsbourg",
         "Yvan Attal",
         "Charles Berling",
         "Thibault de Montalembert",
         "Élodie Navarre",
         "Marie Adam",
         "Charlotte Maury-Sentier",
         "Valérie Bonneton"
      ],
      "imdbMovieId": "0116932",
      "originalTitle": "Love, etc.",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "A triangle: love, obsession, and choice. Pierre, a ladies' man who has little cash and no fixed residence, describes his best friend Benoît as the world's oldest 32-year-old. The shy, well-employed Benoît's life changes when he answers the personal ad of Marie, a 25-year-old who restores paintings. He's attracted to her and she likes his steady calm and his honest attention. They're soon a couple, and they include Pierre in their dinners, outings, and trips. What will happen when Pierre realizes that he too is in love with Marie?",
      "tmdbMovieId": 186705,
      "avgRating": 2.69512,
      "releaseYear": "1996",
      "numRatings": 41,
      "posterPath": "/gsoWfGTJV6B4KgGE4FDXOoPgyOR.jpg"
   }
}