{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "liar",
            "id": 9468
         },
         {
            "name": "compromise",
            "id": 174491
         },
         {
            "name": "nude model",
            "id": 174497
         }
      ],
      "imdb_id": "tt0119665",
      "video": false,
      "title": "Metroland",
      "recommendations": [
         91217,
         27397,
         43047,
         41166,
         55123,
         38772,
         37922,
         41768,
         48464,
         18602,
         29825,
         17320,
         17113,
         31179,
         61280,
         17736,
         41469
      ],
      "backdrop_path": "/Oa5w9pwZFRtyb1gvb2miJnQu2A.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "",
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c163",
               "name": "Christian Bale",
               "profile_path": "/2ocrTd8ChuUyJOzMuD4PsQw8eCB.jpg",
               "id": 3894,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 0,
               "credit_id": "52fe444e9251416c9100c167",
               "name": "Emily Watson",
               "profile_path": "/jyIC8axLoCrbQoKGGjGFRU7hfNI.jpg",
               "id": 1639,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Toni",
               "gender": 2,
               "credit_id": "53f1215c0e0a2675b2004197",
               "name": "Lee Ross",
               "profile_path": "/lMOJz7ZSs4iOWYON0NdKlVuWvlo.jpg",
               "id": 93177,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Annick",
               "gender": 1,
               "credit_id": "53f121700e0a2675b20041a2",
               "name": "Elsa Zylberstein",
               "profile_path": "/bw1bIuyfyOyxRlx2qIKk4AwQLTU.jpg",
               "id": 39195,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444e9251416c9100c16d",
               "name": "Philip Saville",
               "profile_path": null,
               "id": 107414,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53f120dac3a3685ae700329f",
               "name": "Julian Barnes",
               "profile_path": null,
               "id": 1353910,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "53f120f3c3a3685ad9003594",
               "name": "Adrian Hodges",
               "profile_path": "/A1TwQ4GR4vj3eRW6xN9aGCzQw3A.jpg",
               "id": 29483,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.826019,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 30950,
      "vote_count": 13,
      "budget": 0,
      "overview": "After ten years absence Toni, Chris's best friend, suddenly reappears in London to bring chaos and doubt into Chris's calm, tranquil, slightly boring, predictable life. Chris starts to remember his carefree youth as a photographer in Paris when he lived with and enjoyed a torrid affair with Annick. It was also in Paris that he first met and fell in love with Marion. The temptations and pressure exerted on Chris by Toni to return to their former carefree life of sex, drugs and rock'n'roll soon starts to have an impact on Chris's marriage. He starts to question his values, his lifestyle choices and his relationship with Marion and even suspects her of starting an affair with Toni whom she dislikes! Eventually circumstances come to a head and Chris is forced to decide whether to follow Toni back to the hedonistic, irresponsible life of his youth or face the harsh realities of the present and stay with Marion.",
      "similar": [
         646,
         657,
         667,
         708,
         253,
         668,
         682,
         699,
         691,
         707,
         714,
         146216,
         634,
         210479,
         658,
         954,
         297761,
         177677,
         259693,
         1581
      ],
      "original_title": "Metroland",
      "runtime": 105,
      "poster_path": "/xQZ5jhnFXu9p7uHk7Ebtm6eiBSi.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MACT Productions",
            "id": 393,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Arts Council of England",
            "id": 718,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Blue Horizon Productions",
            "id": 30225,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eurimages",
            "id": 850,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "European Co-production Fund",
            "id": 30226,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmanía S.L.",
            "id": 11943,
            "origin_country": ""
         }
      ],
      "release_date": "1997-08-30",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philip Saville"],
      "runtime": 105,
      "synopsis": null,
      "writers": [
         "Julian Barnes",
         "Adrian Hodges"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119665/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTcxOTI5NjgxOV5BMl5BanBnXkFtZTcwMjE1OTMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Christian Bale, Lee Ross, Emily Watson | See full cast and crew »"],
      "reviews": [
         "It's 1977 and Chris is a 30ish bloke who still has the eager, wistful face of an angelic adolescent, enjoys a placid existence in the London suburbs, taking comforting in his wife, his baby, and his garden. Yet he's a haunted man. Spurred by the arrival of Toni, his rakish counterculture chum, he is tormented by visions of what might have been - the enticing word of sexual possibility he left behind, embodied in memories of his blissed out love affair with a sultry secretary during his bohemian Paris days in the late '60s. As the film glides back and forth between eras, the churning of Chris' heart comes to the force with with disarming intimacy. We feel as if we're seeing the formation of an individual: his all too brief fling with hedonism, the sadness and hidden wisdom of a path that seems to have choosen him rather than the other way around. \"Metroland\" is a no-fuss movie that casts a rich, tranquil spell. It's a rare portrait of a happy marriage that is honest about the complex currents of desire, and the drama is beautifully played by Bale who gawks with soulful sweetness, and Emily Watson does her most piercing work since \"Breaking the waves.\"",
         "The main character in Metroland embodies the crisis that every one of us has already or will probably go through. \"Have we made the right choices in our lives to make ourselves happy?\". The movie portrays this character's search for the answers through flashbacks to his past as well as new events that are occurring in his present. The two paths that he could have taken were shown. He begins questioning if he had made the right choice with his current life. A life which he thought he would never want when he was younger and rebellious. The \"9 to 5\" job that we, or at least some of us, have all dreaded in fear of the death of our own creativity and individualism. The main male character basically is the imperfect hero with imperfect thoughts, much akin to the \"hero\" that we can hope to be at this day and age. The last line in the movie, \"If not now, then, never.\" is a line we always hear but take its meaning for granted. Truly, if happiness is not found in the moment..in the \"now\"..then, where else can it ever be?",
         "\"Metroland\" Christian Bale stars as Chris, a 30 year old man who must reexamine his priorities and life choices once an old friend(Lee Ross) comes back into his life. The friend criticizes Chris on the lack of excitement in his life and urges him to leave his wife Marion (Emily Watson) and travel the world. As enticing the dramatic possibilities seem with this plot, \"Metroland\" takes all the expectations one might have and tries something new. It's a character piece, headlined with a smashing performance by Bale. It's also funny, bright, and deeply introspective. The plot takes us on a tour of Chris's past. A past that included a stay in Paris with a beautiful native. The woman teaches Chris the ways of love and bohemian lifestyle, a lifestyle Chris has always wanted. The section takes up about half of the film, and is the film's strongest suit. We see the very English Chris try to pass himself off as a Parisian and curse at other Brits, he also loses his virginity is a grandly comical scene. The other half of the film deals with Chris trying to justify his lack of shame in his calm, predictable life. Veteran director Philip Saville does a good job making sure the audience never loses faith in Chris. It could have been real easy to drag the film through a series of lame dramatics, but Saville gives realistic answers to realistic questions. There are a lot of pluses in \"Metroland\". It's well written, sharply shot with a good eye for detail, and everybody out there knows how I feel about the brilliant Emily Watson. What I liked best, and this might seem weird, but with all the grotesque nudity in such films as \"Go\" and \"He Got Game\", \"Metroland\" is refreshingly blunt. There is a lot of bodies on display here, but in a very natural and - dare I say - beautiful way. It's not thrown in your face. It just is. This is a good movie that relies on a soft, steady narrative than a hyped, antsy one.------------- 8",
         "If Francois Truffaut were still alive today I think Metroland would easily fit into his oeuvre. A film about a person taking stock of himself at the crossroads, Metroland introduces us to a suburban utopia where people go to work everyday, take their kids to school, and wash their cars on the weekend. Christian Bale seems to accept this life until an old friend rings him up wanting to revisit the old times. Throughout the film we see what Bale's character could've been and how much happier he thought he was. Metroland's assertion is to accept life for what it is and not what it is not. Not everyone's cup of tea as evidenced by Bale's boyhood chum but being the film's setting takes place during the late seventies in England right before the rise of Thatcherism may be a subtle stab at what the middle class of the film will come to accept. Conformity over confrontation may ultimately be Metroland's theme no matter how much it hurts us to admit it.",
         "I agree with all the posts about what this movie was about -- a man evaluating his present life. But what made this film so good to me was the fantastic acting by Christian Bale and Emily Watson who portrayed their characters so authentically. As a 30 yo single woman myself, the relationships portrayed in this movie came off in a genuine way. What it's like to be married for nearly 10 years and how to preserve the love in the relationship and yet deal w/ the tensions and problems from it. All of this was portrayed subtly, sensitively, and with humour at many times throughout this movie in a natural and unforced way. I credit this to Christian Bale and Emily Watson's acting abilities and the Director's talent. To me, underlying the mid-life crisis of one man in this movie is the theme of \"relationship\" and how he gets his life from them. Whether it's with his wife, girlfriend or best friend from childhood. I really thought everything about this moview was excellent: script, acting, directing, scenes. More than that, it captured the subtle nuances and emotions shared between people which wasn't stated in words but one \"felt\" as a viewer that one knew what that look meant or the silent treatment was for. It's now my favorite top 10 movies in my book.",
         "Metroland is true to the midlife crisis, except between two people who haven't quite reached that stage of their lives yet. Christian Bale plays an Englishman who begins to reminisce about his past in the mid and late '60s when an old friend (played by Lee Ross) comes back to stir up his life. While I felt that the story was strong and seemingly dramatic enough to keep me interested and entertained, the character played by Lee Ross just seemed unnecessary. This character is supposed to build the plot the first half of the movie and I felt this could've been reached in many other directions. And if you love France, well, you'll love the beautiful depiction of French women with an excellent performance given by Elsa Zylberstein, Bale's character's 'old flame' that he thinks about constantly throughout the film. Beautiful 'still' cinematography throughout is perfect for Bale's character's love for photography and makes the film very watchable just for art's sake. By the time I reached the last 45 minutes or so, I was much more intrigued and worried for the well-being of Bale's marriage with his present day (1977) wife, played wonderfully by Emily Watson. The tension between the two of them throughout the film is far more than believable and I loved it. While I wanted to give this movie a much higher rating, I think it is fair to say that the first half moves much too slow. I was also slightly disappointed by the ending of the film, but it was still a great surprise and hit me unexpectedly. I highly recommend for Bale/Watson fans.",
         "Based on the novel by Julian Barnes and directed by Philip Saville (Masterpiece Theatre's The Buccaneers, The Life and Loves of a She-Devil miniseries), Metroland is a charming little British movie. It's a character study of Chris, played by Christian Bale (American Psycho, Batman Begins, Rescue Dawn), in an early role that is a nice change of pace for him. Bale captures this sweet, geeky, funny every-man character brilliantly. In 1977, now a married man with a baby girl, Chris lives in the suburb of Metroland, his hometown, where he vowed as a teenager that he would leave and never return. Every working day he takes the mass transit rail out of the suburb to London to his job at an advertising agency. He wanted to be a globe-trotting photographer, but settled for this. Chris seems content with his life, but when his ne'er-do-well chum Toni, played by Lee Ross (Secrets and Lies), shows up, Chris has a midlife crisis, albeit a young midlife crisis. Toni's appearance brings back the memories of his carefree life before marriage and responsibility: during the 1960s, when he lives in Paris, takes photographs, and has his first serious girlfriend, Annick (Elsa Zylberstein). Bale plays a naive, love sick man to Annick's worldly, sexy French woman. They start an intense sexual affair, and Chris is quite smitten with Annick until he meets Marion\u0097all decked out in go-go boots, liquid eyeliner, and a That-Girl hair flip. Chris is attracted to Marion mainly because she can see through some of his foolishness. In one conversation between the two\u0097reminiscent of It's a Wonderful Life, in which James Stewart informs Donna Reed that he doesn't want to marry or have kids, but then gleefully gives in, kissing Reed\u0097, Chris tells Marion that he wants to stay on in Paris and doesn't want to get married and have children. Marion cruelly replies, \"You're not original enough to.\" Chris reconsiders his relationship with Annick, who he has nothing in common with\u0097only lust. And he chooses Marion. In one of many funny scenes, Chris is in bed with his wife, Marion, played by Emily Watson (Breaking the Waves, Hilary and Jackie, The Water Horse: Legend of the Deep). He starts kissing her sweetly, but she is too tired for that. He says to her, \"I can't remember the last time.\" \"Yesterday morning,\" she replies. Then he says, \"Yeah, we used to do it three times a day.\" She says, \"It only happened once, and you complained about being sore a week afterwards.\" He smiles and replies, \"Sore, but very smug.\" This changes Marion's mind, but they are soon interrupted by their daughter's cry--such is the life of a family man. During Toni's visit, Marion makes her dislike for him clear to Chris who defends his lifelong friend. Toni is bound and determined to lead Chris astray, so that Toni can prove to himself that he made the right decision not to settle down. Toni plays his part well as the devil on Chris' shoulder. At his party, Tony convinces one of his free minded girlfriends to give Chris a shag. Just as Chris is considering consummation, he imagines Marion being carried away in an ambulance. When Toni happens to pass by the room, Chris realizes that Toni put her up to it\u0097and is insulted and leaves. It shows how even the closest, longest friendships can die in adulthood when people choose to go down different paths. Later Chris suspects something happened between Marion and Toni, and he gets into fisticuffs with Toni. Marion tells Chris that he made a pass at her; she was somewhat tempted, but refused. As Toni gets ready to leave town, Chris and he make up somewhat half-heartedly. While taking a bath together, Chris tells Marion about the girl at Toni's party who he nearly slept with, and, of course, Marion has an ongoing joke of telling Chris to go ahead and have an affair. Marion then reveals to Chris she had a one night stand long ago and tells him that it won't happen again. We don't know if this is true, or if Marion is only trying to spice things up\u0097because as a result of her confession, they have passionate sex. And afterwards she kids him about having sex with the girl at the party. Christian Bale's mutton chops and flared collars and pants legs give the movie a real retro feel. Bale has some great comedic moments here. In one of two very good scenes, Toni takes Chris to a punk rock concert, but Chris hates punk and only tolerates it by getting drunk and stoned. Chris comes home quite randy and keeps trying to pull Marion down on the bed in his inebriated state. The other scene is Chris' first date with Annick in which he conspicuously kisses her\u0097and pulls her into bed awkwardly. The female characters teeter on being stereotypical. Annick and Marion are the archetype of the all-knowing, all-beautiful, all-witty woman to the archetype of Chris as the bumbling, sex obsessed male. Emily Watson's performance elevates Marion's character, so she doesn't turn into a shrew\u0097we can sympathize with her as Chris shuts her out as he daydreams about his glory days of youth. We also feel sympathy towards Annick as she goes from being the experienced one in the relationship to being the needy and jealous one as Chris matures. I describe Metroland as a British cozy romantic dramedy\u0097if such a thing exists. Some memorable scenes and some funny moments make the film worthwhile. As does the good acting between Bale and Watson, who make it more than a forgettable flick. Bale and Watson have good chemistry and repeat that again in the 2002 Sci-Fi cult classic, Equilibrium. Metroland is a movie you rarely see now: a movie that deals intelligently and realistically with themes of adulthood.",
         "After several years of a happy marriage an old friend from his single years re-appears. The movie then lets us see in flashbacks how the main characters have evolved into an urban \"long time married couple.\" The friend's return creates great tension between the husband and wife and leads the husband to a re-examination of his life. The characters play off each other very well and the actress that plays the French girlfriend was terrific. The best line in the movie was, \"Oh, you'll get married and have a family, your not original enough not to.\" This film tells its story, develops the characters, and by the time it ends has tied everything up in nice packages leaving the viewer satisfied.",
         "I liked this movie. Its stars, Christian Bales and Emily Watson, shine with a refreshing innocence. It is one of those pictures where you can regret the time wasted watching it, or reflect on what it means to settle for the suburban lifestyle with its daily commutes to the city, the crying baby in the middle of the night, the sometimes jaded sex. All the time knowing it will continue until you retire. And to look back at the freedom of the young years in Paris with \"sex in the afternoon\" and not much money. Toni, played by Lee Ross, looking dissolute and hedonistic, blows back into the life of Christian Bales ten years later and tries to make him take the road less travelled by going around the world and living free and easy with no ties. There are then a series of many flashbacks to the carefree years. I liked the way Chris takes the time to evaluate his current life. It is not all about duty and responsibility but choices too and there is a bit of a zinger in the last few scenes. 7 out of 10. A thoughtful adaptation of the novel.",
         "This film adapted from a novel by one of England's best writers, Julian Barnes, was a story to anyone who has been married for a while. Set mainly during 1977, the drama focuses on Chris (Christian Bale) and Tony (Lee Ross), who grew up together in suburban England a decade earlier. Chris is now happily married to Marion (Emily Watson) and has a baby daughter. Tony has never settled down. A surprise visit from his childhood friend causes Chris to reassess his present life and to remember his days working in Paris; there he lived with Annick (Elsa Zylberstein), a young, liberated French woman, before he fell in love with Marion. Bale and Watson were superb in this film. He fantasizes about how his life would have been had he not gotten married. Tony is trying to convince him to give it all up, and Marion is trying to save her marriage. There is a lot of nudity and sex, but none is gratuitous. It all adds to the story and , at times, is funny, especially when he was new at sex in Paris. The most interesting part of the film consists of two related scenes. he tells Tony that he is \"content.\" Maybe that is the best you can hope for from an Englishman. His wife asks later if he is \"happy.\" he says, \"If not now, never.\" That is certainly, to me at least, not a ringing endorsement. Maybe again, it is particularly English. The film was very enjoyable, and the only criticism I would have is the graininess in the middle. I am beginning to like Bale more and more."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "Blue Horizon Productions",
         "Eurimages"
      ],
      "summaries": [
         "After ten years absence Toni, Chris's best friend, suddenly reappears in London to bring chaos and doubt into Chris's calm, tranquil, slightly boring, predictable life. Chris starts to remember his carefree youth as a photographer in Paris when he lived with and enjoyed a torrid affair with Annick. It was also in Paris that he first met and fell in love with Marion. The temptations and pressure exerted on Chris by Toni to return to their former carefree life of sex, drugs and rock'n'roll soon starts to have an impact on Chris's marriage. He starts to question his values, his lifestyle choices and his relationship with Marion and even suspects her of starting an affair with Toni whom she dislikes! Eventually circumstances come to a head and Chris is forced to decide whether to follow Toni back to the hedonistic, irresponsible life of his youth or face the harsh realities of the present and stay with Marion.",
         "Follows the story of two best friends as they discover lust and love in their youth. One friend becomes married with children, while the other remains single, cynical and idealistic.",
         "The sudden reappearance of his best friend Toni, after ten years absence, causes Chris to remember his past, to question some of his lifestyle decisions and to re-evaluate his life and marriage to Marion."
      ],
      "budget": 0
   },
   "movielensId": 2577,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1997-08-30",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Philip Saville"],
      "runtime": 105,
      "movieId": 2577,
      "title": "Metroland",
      "mpaa": "",
      "actors": [
         "Christian Bale",
         "Emily Watson",
         "Lee Ross",
         "Elsa Zylberstein"
      ],
      "imdbMovieId": "0119665",
      "originalTitle": "Metroland",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "After ten years absence Toni, Chris's best friend, suddenly reappears in London to bring chaos and doubt into Chris's calm, tranquil, slightly boring, predictable life. Chris starts to remember his carefree youth as a photographer in Paris when he lived with and enjoyed a torrid affair with Annick. It was also in Paris that he first met and fell in love with Marion. The temptations and pressure exerted on Chris by Toni to return to their former carefree life of sex, drugs and rock'n'roll soon starts to have an impact on Chris's marriage. He starts to question his values, his lifestyle choices and his relationship with Marion and even suspects her of starting an affair with Toni whom she dislikes! Eventually circumstances come to a head and Chris is forced to decide whether to follow Toni back to the hedonistic, irresponsible life of his youth or face the harsh realities of the present and stay with Marion.",
      "tmdbMovieId": 30950,
      "avgRating": 3.208,
      "releaseYear": "1997",
      "numRatings": 250,
      "posterPath": "/xQZ5jhnFXu9p7uHk7Ebtm6eiBSi.jpg"
   }
}