{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ecstasy",
            "id": 1941
         },
         {
            "name": "drug dealing",
            "id": 11733
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "high",
            "id": 168811
         },
         {
            "name": "bisexual man",
            "id": 168812
         },
         {
            "name": "multiple storylines",
            "id": 171366
         }
      ],
      "imdb_id": "tt0139239",
      "video": false,
      "title": "Go",
      "recommendations": [
         10223,
         9434,
         10218,
         2293,
         11443,
         10279,
         9452,
         4997,
         10668,
         11229,
         2255,
         6071,
         9451,
         10442,
         13785,
         11004,
         10141,
         13531,
         9080,
         13342
      ],
      "backdrop_path": "/s65p1RNTIl3wMheVoaiXlGBZ36X.jpg",
      "revenue": 28451622,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Ronna",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b4787",
               "name": "Sarah Polley",
               "profile_path": "/asFwK6hCFYHtHVJoOwMBSMTETtg.jpg",
               "id": 98,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b4783",
               "name": "Katie Holmes",
               "profile_path": "/eYeE0Z1sOvqxt7LsQHK30vUfWaM.jpg",
               "id": 3897,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Zack",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b478b",
               "name": "Jay Mohr",
               "profile_path": "/6HGBa7y15h6Xrg55Wr8BepS363R.jpg",
               "id": 12217,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Todd",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b478f",
               "name": "Timothy Olyphant",
               "profile_path": "/qPqm3mx3xzROFjlSGvh5dqR0XtV.jpg",
               "id": 18082,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Burke",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4793",
               "name": "William Fichtner",
               "profile_path": "/oIGjbztWvTqn4tnolW9rDCjpgxu.jpg",
               "id": 886,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Adam",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4797",
               "name": "Scott Wolf",
               "profile_path": "/y5NBlTvKDIe2csxZeeYv6ooM8rN.jpg",
               "id": 24965,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "Switterman",
               "gender": 2,
               "credit_id": "56b8b060925141054700010d",
               "name": "Robert Peters",
               "profile_path": "/pxTWTen2PPT2A4I7FrSPdTLKxQC.jpg",
               "id": 1217939,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Stringy Haired Woman",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b479b",
               "name": "Suzanne Krull",
               "profile_path": "/h7PHyUbTpV79lx4w0tTVTGzeTMd.jpg",
               "id": 19307,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Simon Baines",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b479f",
               "name": "Desmond Askew",
               "profile_path": "/duVUWh17XHY3HCVhAOkQSGBNb4R.jpg",
               "id": 59284,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Mannie",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b47a3",
               "name": "Nathan Bexton",
               "profile_path": "/zSDOqtv5VRkHkdnIo4jde0ERQqv.jpg",
               "id": 19223,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Sandra",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b47ab",
               "name": "Melissa McCarthy",
               "profile_path": "/qVb4VmZRwcANDuzhXjVjTlQ761x.jpg",
               "id": 55536,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Marcus",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b47af",
               "name": "Taye Diggs",
               "profile_path": "/1g1demRAGhwdUpwi8PA0wgFe2IX.jpg",
               "id": 17637,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Tiny",
               "gender": 2,
               "credit_id": "56d952169251412e28004570",
               "name": "Breckin Meyer",
               "profile_path": "/7V3hXjmSJXApsuu2aGkEgFFAy03.jpg",
               "id": 33654,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Singh",
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b47b3",
               "name": "James Duval",
               "profile_path": "/ydlb3Rp5vkle9codpcfBWxFmUYr.jpg",
               "id": 1582,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Irene",
               "gender": 1,
               "credit_id": "52fe44f6c3a36847f80b47b7",
               "name": "Jane Krakowski",
               "profile_path": "/sOeuLd0MLBk3M6P0nyvZ8TCDUeK.jpg",
               "id": 13636,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Loop",
               "gender": 2,
               "credit_id": "542461c60e0a263b7a003e8b",
               "name": "Jay Paulson",
               "profile_path": "/z3g4eWlY0EQG3IFn729lIHPjBQf.jpg",
               "id": 88597,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Becky",
               "gender": 0,
               "credit_id": "562e67b1925141284500a84e",
               "name": "Katharine Towne",
               "profile_path": "/33AK0lDtxIhh7125JC7daDWMSkC.jpg",
               "id": 15012,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4755",
               "name": "Doug Liman",
               "profile_path": "/cWpE3dSbskWOea4kAGzQpNIkfxM.jpg",
               "id": 11694,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b475b",
               "name": "John August",
               "profile_path": "/t0jbO861bLCaKVC4hDBZ7sic8na.jpg",
               "id": 1300,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4761",
               "name": "Paul Rosenberg",
               "profile_path": null,
               "id": 58314,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4767",
               "name": "Mickey Liddell",
               "profile_path": null,
               "id": 48498,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f6c3a36847f80b476d",
               "name": "Matt Freeman",
               "profile_path": null,
               "id": 58315,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4773",
               "name": "Doug Liman",
               "profile_path": "/cWpE3dSbskWOea4kAGzQpNIkfxM.jpg",
               "id": 11694,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b4779",
               "name": "Stephen Mirrione",
               "profile_path": null,
               "id": 1891,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f6c3a36847f80b477f",
               "name": "Moby",
               "profile_path": "/AmgaMF4Z8xYalPHPfoigTvqPkIu.jpg",
               "id": 39121,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5a622124c3a36836c7000747",
               "name": "BT",
               "profile_path": "/cDCjxFri0Co2M7P1vvwe2Ydpx0C.jpg",
               "id": 6898,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "5a62212a0e0a2671db000838",
               "name": "Moby",
               "profile_path": "/AmgaMF4Z8xYalPHPfoigTvqPkIu.jpg",
               "id": 39121,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 7.030407,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9430,
      "vote_count": 240,
      "budget": 6500000,
      "overview": "Told from three perspectives, a story of a bunch of young Californians trying to get some cash, do and deal some drugs, score money and sex in Las Vegas, and generally experience the rush of life.",
      "similar": [
         627,
         20289,
         180863,
         401,
         39939,
         8363,
         9352,
         319,
         359156,
         10474,
         11455,
         100,
         1164,
         429733,
         796,
         396940,
         3509,
         179144,
         9490,
         19384
      ],
      "original_title": "Go",
      "runtime": 98,
      "poster_path": "/kr1nz11EILLPdRmn51jtvvBQrWL.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1999-04-09",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "A weekend wasted is never a wasted weekend.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Doug Liman"],
      "runtime": 102,
      "synopsis": "The film is told out of chronological format, the story being told from four different points of view. As such, the following summary only generalizes the actual sequence of events which take place. Ronna's story It is Christmas Eve in Los Angeles. Adam (Scott Wolf) and Zack (Jay Mohr), a couple of TV soap opera actors, have been busted for narcotics possession. In a plea deal, they will help Officer Burke (William Fichtner) set up a sting operation for Simon (Desmond Askew), an occasional drug dealer who sells ecstasy from his cash register at a local grocery store. Unbeknownst to them, Simon has taken a vacation to Las Vegas. Filling in at his register is Ronna (Sarah Polley), an 18-year-old runaway and high school dropout who is facing eviction and desperate for the extra paid hours of income. When the actors ask about Simon and where they might buy some ecstasy, Ronna recognizes a lucrative financial opportunity. She offers to \"see what she can do\" for them, taking down their address. They give her a flier with the details of a rave later that evening. After work, Ronna and co-worker friends Claire (Katie Holmes) and Mannie (Nathan Bexton) debate the underground drug trade \"rules,\" such as circumventing Simon to become competing dealers themselves. Ronna decides this will be a one-time-only deal and proceeds to Simon's drug supplier, Todd (Timothy Olyphant). Todd is suspicious of Ronna's sudden interest in dealing drugs, and that the quantity she has requested is the exact amount that constitutes a drug trafficking felony. Reluctantly, he offers to sell her the drugs at a higher price. Unprepared for the price hike, she offers to leave collateral in exchange for bringing the balance back after the sale is complete, and bullies Claire into being the collateral. Ronna and Mannie then proceed to Adam and Zack's pre-rave party at their apartment. Ronna goes inside to complete the deal, while Mannie stays in the car and downs two of the pills he swiped from the bottle. Inside at the \"party\", there's only Adam and Zack behaving uncomfortably, along with an older man (Officer Burke, the undercover officer) who seems overly focused on finishing the drug deal. Ronna quickly realizes something is amiss here, so she asks to use the restroom before completing the deal. When Zack turns to show Ronna the way to the bathroom, he whispers \"Go!\" to her. She goes into the bathroom, flushes the drugs down the toilet, and emerges empty-handed. She tells Burke she wasn't able to obtain the drugs after all, and to defend herself from further scrutiny, notes to Burke that she is underage to be drinking the beer he gave her. Realizing he is now on surveillance giving alcohol to a minor, and without evidence to hold her, Burke lets Ronna go. Ronna, in a state of panic, ponders her situation with Mannie, who is slowly succumbing to the effects of the pills he took. She doesn't have the money to buy Claire's release from Todd, and now she has no drugs to sell. In desperation, she shoplifts a large supply of over-the-counter medication from her own grocery store. Finding pills roughly the same appearance as the ecstasy pills, she refills Todd's bottle and returns to his apartment. She explains to Todd that the deal fell through, gives the \"stash\" back to him, and frees Claire from collateral duty. Ronna realizes that she's still facing eviction and decides to attend the rave to sell the remaining medication as ecstasy. Her scam works, and she quickly makes more then enough money to cover her rent. Meanwhile, Todd has discovered the fake pills and shows up at the rave to settle the score. He sees Ronna and Mannie from afar and chases them through the dancing crowd. Mannie is too high to run and is slowing them both down. Ronna hides Mannie behind a piece of sheet metal in a back alleyway, tells him to keep quiet until she comes back, and runs off alone. Todd catches up to Ronna in the parking lot. He has a few last words with her about the nature of the illegal drug trade, and takes out a gun intent on killing her. At that very moment, a yellow Mazda Miata swerves around a corner of the parking lot at high speed and squarely hits Ronna, catapulting her onto its roof. It then shoots forwards and stops suddenly, sending her flying into a ditch. The driver, in panic from seeing Todd with a gun, flees the scene. Todd leaves Ronna for dead and flees as well as it begins to rain. Ronna lies motionless in the ditch. Simon's story Earlier.... After recruiting Ronna to cover his shift at the grocery store, Simon goes off with three of his friends Marcus (Taye Diggs), Tiny (Breckin Meyer), and Singh (James Duval) for some adventures in Las Vegas, footing their hotel bill with the credit card he had borrowed from Todd. Shortly after arriving, Tiny and Singh develop bad cases of diarrhoea from eating some bad seafood at the hotel's buffet restaurant and are stuck in their hotel room while Simon and Marcus hit the casino. Simon quickly loses much of his money and then wanders into a wedding party on the premises. There, he meets two female guests, with whom he eventually smokes pot and has sex (both of them). One of the women accidentally starts a fire in her hotel room, causing Simon to flee naked (clothes in tow) in an elevator. Putting his clothes back on, he meets up with Marcus back in the casino. Marcus's yellow sports coat gets him mistaken for a hotel employee, even earning him a tip when a customer mistakes him for a bathroom attendant. This eventually works to his advantage, though, when another hotel guest assumes Marcus is a parking valet and hands him the keys to his Ferrari. Simon and Marcus jump at this golden opportunity to take the red Ferrari for a spin, winding up at the Crazy Horse strip club. En route, Simon discovers a 9 mm pistol in the glove compartment, which he pockets for himself. At the strip club, Marcus warns Simon not to order \"champagne\" - strip club code for a private lap dance they cannot afford - however, Simon does precisely that, and he heads to a back room with two dancers and Marcus in tow. Before the lap dance commences, they receive a stern warning from menacing Victor Junior (Jimmy Shubert), one of the bouncers and the son of the club owner, to behave like gentlemen and not touch the dancers \"or else.\" Simon hands the bouncer Todd's credit card and he and Marcus enter the back room; the lap dances have barely begun when Simon loses his self-control and gropes his dancer. Victor Jr. immediately bursts into the room and begins beating him. Marcus tries to defend Simon and is himself attacked by the bouncer. Simon then draws the gun he found and shoots Victor Jr., wounding him in the arm. Simon and Marcus hastily flee the premises and head back to the hotel. Simon and Marcus rush into their room and roust up the sickly Tiny and Singh, telling them they have 30 seconds to get up and out. Before they can flee, the Victors Jr. and Sr. (J.E. Freeman) arrive at their door, so Simon and crew bribe a young boy staying in the next room to open the connecting door for their escape. After a frantic car chase down the Las Vegas Strip, Simon and his three friends manage to elude their pursuers and reach the highway back to Los Angeles and drive away in the light of dawn in Simon's damaged car. They believe they are safe, reasoning that their pursuers would have called the police in Vegas...or so they think. What Simon forgets is that it was Todd's credit card he left back at the strip club. Adam and Zack's story Earlier... Adam and Zack are actually closeted gay lovers forced to be decoys in a police sting operation, in exchange for having their own drug charges dropped. In the grocery store parking lot, they test out their hidden microphones; inside, they look for Simon, their usual dealer, but find only Ronna. Later, after the sting with Ronna goes bad, Burke handcuffs Zack, then makes a bizarre suggestion: Why don't they spend Christmas Eve at his house and have dinner? Nervous, they reluctantly accept his invitation. It is an odd atmosphere in the house, and Zack and Adam have odd encounters with Burke and his wife Irene (Jane Krakowski). Zack comes out of the bathroom and runs into Burke completely nude; Burke urges him to lie down on his bed and try out some cologne. Adam, meanwhile, meets Irene, who comes on to him and even kisses him full on the lips. Later, when the four sit down to Christmas dinner, Burke explains that he and his wife are the fourth leading sales team in the region for Confederated Products, an Amway-type retail company, and that virtually everything in the house from the food to the cologne is from the company. Burke wants Adam and Zack to sell Confederated products for him. Zack then gets Adam to feign illness to excuse themselves, and they leave the house, both of them uneasy from the evening's events. Adam and Zack engage in small talk and discover that both of them are cheating on each other with the same man, Jimmy, a makeup artist in their television studio. They go to Jimmy's apartment and find out from his sister that he is attending the same rave that they had earlier advertised to Ronna. Adam and Zack show up and get revenge on their mutual two-timing lover by holding Jimmy down and cutting a sizable chunk of his long hair. Satisfied, they leave the party, get into Adam's yellow Miata and barrel into Ronna, sending her flying into the ditch. Then they see a man with a drawn pistol (Todd) and, terrified, flee the scene. They stop at a gas station and try to figure out what to do, debating whether Ronna survived the accident and, if so, whether or not the man with the gun finished her off. Adam goes to the toilet where he realizes that he is still wearing the hidden microphone from earlier that afternoon. Panicked, they throw the devices away and drive back to the spot where they hit Ronna. They find her still lying in the ditch, unconscious but alive, and hoist her on top of a nearby car with the alarm blaring. They watch in satisfaction from afar as other partygoers discover Ronna early the next morning and call an ambulance for her. Conclusion It is dawn now, and Claire, who does not know what happened to Ronna, leaves the rave and goes to the diner where she usually meets Ronna when they get separated. She encounters Todd; they engage in small talk, then realize they are attracted to each other. They end up kissing and groping in the stairwell of Todd's house, where they are discovered by none other than Victor Jr. and Victor Sr., the Crazy Horse bouncer and owner whom are after Simon and have tracked him through Todd's credit card. Todd explains they have the wrong man; he begins to draw out directions to Simon's place, when Simon himself walks into Todd's apartment ironically, to seek refuge from the bouncers. At first they want to kill him, but Claire points out that she and Todd would be witnesses to the crime. So an \"eye for an eye\" deal is struck where Victor Jr. gets to shoot Simon in the arm. Just as he is about to get justice, performance anxiety suddenly springs upon Junior and he cannot bring himself to pull the trigger. Claire gets impatient and leaves during his hesitations; as she gets halfway down the hall she hears a gunshot. She flinches and shuts her eyes. Simon calls out: \"It's all right... I'm okay!\" Meanwhile, Ronna wakes up in the hospital recovered enough to return to work, happy that, despite the night's batterings, she did indeed make enough money to save herself from eviction. She talks with Claire and suddenly realizes to her horror that she never went back for Mannie, who is presumably still hidden where she left him. Ronna and Claire return to the scene and find Mannie still there, shivering and terrified, but otherwise okay. They all get into Ronna's car and drive away, and Mannie wonders aloud what they'll do for New Year's Day just a week away.",
      "writers": ["John August"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0139239/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxODU5NDc3Ml5BMl5BanBnXkFtZTYwMjYzNTg4._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sarah Polley, Jay Mohr, Scott Wolf | See full cast and crew »"],
      "reviews": [
         "\"Go\" reads like a very very good sophomore offering by a very very good up-and-coming director. You can almost see a bright future for everyone involved in the film, from the director (Doug Liman) to the screenwriter (John August) to all of the young actors. The script is clearly the winner, with witty dialogue and a convoluted plotline (or plotlines, depending on how you view it) centered around a dozen or so GenX-er Los Angelenos on Christmas Eve. The film slickly moves you from one plotline to the next, as you follow one minor disaster leading to other minor disasters. The film being a \"sophomore offering,\" of course, has some drawbacks. Yes, it is tangentially derivative of \"Pulp Fiction.\" And yes, it does scrounge a bit from this teen flick and that. In some cases, certain plotlines wrap up too neatly, and in other cases the plotlines don't converge nearly as neatly enough. But what the film may lack in originality it certainly makes up for with style and quirks. The real discovery in all this is the cast. Sarah Polly stands out (listen to her mild Canadian accent slip through once in a while) as the world-weary checkout gal who's first and only foray into drug-dealing unleashes a legion of trouble for her. Desmond Askew (wonderfully punny name) is this Pulp Fiction's Tim Roth, glib and cocky as his well-ordered world whirls and crumbles around him in a neatly choreographed disaster. As the sinister drug supplier, Timothy Olyphant is particularly menacing, exuding equal amounts of danger and innocence, sexiness and insecurity. The characters in \"Go\" never become cardboard parodies of themselves, and they never dissolve into charicatures of themselves for the sake of plot or atmosphere. So watch the film, soak in the plot, atmosphere, and the characters. At the risk of sounding glib myself, by all means \"Go.\"",
         "One of the best this year! A wild ride that is hard to not compare to \"Pulp Fiction\", but if you didn't like Pulp, you won't like Go. I loved both, so this is a treat! Doug Liman had directed a worthy follow-up to Swingers, in the eyes of 7 kids and a drug deal gone way bad. The funniest moments come from Desmond Askew and Taye Diggs in Las Vegas. Never once is this movie dull. Watch with an open mind and a wild imagination!",
         "I don't know what really makes this movie so great. It could be the outstanding cast, the pitch perfect editing, the quick and funny dialog or maybe some other feature of a movie one could possibly like. The truth is this movie couldn't been done any better. When I watch a movie I usually come up with lots of things, which could have been done better or at least differently. This time I ended up with nothing. What amazes me the most is how they manage to define all the 10+ major characters so well, and they do it in what, less than 100 minutes. Most movies featuring many characters, fall apart cause there isn't enough screen time to present the differences among them, which just leads to a smear of unrecognizable faces. This doesn't happen with this movie for two reasons: A) All characters have at least one scene to really define themselves. B) By dividing the the film into three sub-plots you can easily relate each character to a specific sub-plot. The tempo is very fast for 90% of the movie. There are two scenes, which have a significantly slower tempo. Those are the two scenes featuring Katie Holmes and Timothy Olyphant. First in the apartment and later in the coffee-shop. In my opinion those scenes are the best, but there is a lot to choose from so I'm not offended if yours isn't. This movie really shows that even simple and straight forward stories, can be both unpredictable and entertaining, if they are told the right way. Add to this a pumping soundtrack, solid editing and an overall great production in an unpredictably entertaining movie, you will agree with me that Go is one of the best films ever made.",
         "This film has traces of Pulp Fiction embedded in it, but it's got a little \"Swingers\" and other films to it as well. All in all it's an entertaining movie which ends without epiphany for these characters (like .....). This film has multiple stories but does not try to be alternative and cool. It just wants to work! Sarah Polley (whom I never heard of at the time but follow her work now) was great; Katie Holmes wasn't quite Katie Holmes - and that was good; Fichtner's good; but my favorite was Timothy Olyphant who did a kick-ass job of a charasmatic bad-guy (it was hard not to hate him by the end). I've read the other comments and these people just take this thing TOO seriously! It's not the movie of 1999, it's not \"Pulp Fiction\", it's just \"Go\". I have this movie on DVD and heard Doug Linman's commentary: he sounds like he had a lot of fun making this. I had a killer time watching this. I guess if I came in with different expectations I would've hated it like everyone else on this site!",
         "One of my favorite films of all time. Hip, like Pulp Fiction, it's just crazy-insane fun. Not for everyone, due to language and drugs, but I really LOVED it! There are also so MANY cameos of great actors we know and love today. Director Doug Liman has gone on to do HUGE, great movies, such as The Bourne Identity and Mr and Mrs Smith. Here we see some of his early talent. Writer John August writes the Ask the Filmmaker/Ask a Screenwriter column here on IMDb.com Just a great, fun movie, that hasn't seen been seen by as many people as it should. 3-14-06 Walt D in LV",
         "Spoilers herein. I'm coming to this film late in the comment stream, which means that critics and commentors have beaten to death the `Pulp Fiction' comparisons. Yes, this has parallel stories, time folding (but not the time shuffling of `Pulp'), black and white shuffling, guns drugs and ironic violence, diner scenes and a hip perspective. But to me that is less central than the relationship of the shape to the style. Tarantino's method is from comic books, his manipulation of the narrative deliberately has nothing at all to with the narrative itself. That's the point, that emptiness. `Go' is the opposite. It takes much of the same stylistic manipulation of narrative and turns it all to the service of the movie: the film capriciously meanders like the small lives of these kids. Now, that's not a very heavy notion to settle on, but it is cinematically profound in linking the point of the movie to the unrolling of the images. In other words, if you love the visual grammar of film, you'll love this. If instead you prefer using the art of filmmaking to display the emptiness of film, you'll like `Pulp.' They are as different as can be. `Go' follows the tradition of Hitchcock and Welles where the `story' is centered in the images. `Pulp' follows a wholly contradictory world defined by the `new wave' where every image is ironic and deliberately doesn't rest in the story but runs contrary to it. At some point, every serious film viewer will confront this choice. It is a matter of whether you will let yourself `go' with the flow or always maintain a smug distance. The writer understands this, and makes it explicit with `story C' which features two actors. They are enlisted in an enterprise of `moviedom' in real life where they are wired for sound and videoed. More, their master engages them in forced commerce. This is mirrored in story B with the lap dance `show' and more faintly in A with the selling in the store and the rave. All these kids are engaged in indentured but shameless sales of the movie to us. I have a very short list of actors who are worth watching regardless of the context. Cate Blancett, Kate Winslet, and Julianne Moore are the actresses I follow because of their ability to present more than one personae at a time. Sarah Polley is close to being on that list, but not for the same reason. She -- or her advisors -- has made some very intelligent choices, placing her in central roles in some very alternative projects. These are films that require -- even in the watching -- a deliberate shift in thinking about what film is. In each, she has appeared with radically different acting styles, always entirely apt. It shows that she understands what these rather subversive projects are all about. Privately, her politics seems amazingly unsophisticated, but her deliberate plasticity on screen shows a remarkable ability. Ted's Evaluation -- 3 of 4: Worth watching.",
         "I liked this movie well enough to watch it twice. I waited 'til it came out on video, but made sure to see it, because it stars Sarah Polley, who I've been a fan of since her \"Road to Avonlea\" days. This is not a serious movie. It's fun, upbeat, quick, and for those with short attention spans. I liked it. I didn't think it was as incredible as some say, but enjoyable enough to watch it twice. So many people have compared it to Pulp Fiction. Frankly, the only similarity I see between the two, is the \"jumping around timelines\". Which I like. Good movie to watch, just don't bother trying to analyze it - you won't come up with much.",
         "There are several kinds of movies that I like, but they almost all have one thing in common: they have something special to offer. In this case it is the way the story was brought to the audience. The story is told over and over again, each time from the perspective of a different character. The fact that the story is told over and over again in isn't new. If you know the German movie 'Lola Rennt', than you've seen it before. The main difference between these two movies is that this time the story remains the same and the characters change, while in the German movie it was exactly the opposite of that. It starts with Simon Baines who wants to go to Las Vegas with his friends, but who normally has to work in a 24-hour grocery store. His colleague Ronna takes over his shift, when two guys, named Adam and Zack, walk in asking to score some dope from Simon. Because Simon isn't around anymore Ronna decides to sell them some drugs herself and asks her friends Claire and Mannie to help her buying some stuff from the local drug dealer Todd Gains. But the drug deal was set up by a narcotics agent called Burke who forced Adam and Zack to cooperate. Ronna soon finds out something is wrong and flushes the drugs trough the toilet. Normally she would return it to the drug dealer, but because she hasn't got it anymore she has to try to fool him with phony drugs. In the mean time Simon's adventures with his best friend Marcus hit an unfortunate turn during a trip to a strip club in Las Vegas and Adam and Zack end up spending Christmas Eve with Burke and his wife Irene before being able to drive to a rave, where Ronna is dealing some more \"drugs\". When they arrive at the rave, the guys accidentally hit Ronna with their car and leave her for dead. Nearby, Mannie nearly gets an overdose and Claire gets more friendly with a vengeful Todd who is now looking for Ronna. At first I didn't like this movie all too much, mainly because I didn't see the reason why so many information was left out. It didn't make too much sense really. But I gave it a chance and watched it completely and only then I fully understood the story. Even though it has some flaws, I must say that I thoroughly enjoyed this movie. I loved the way the story was told and the good combination of humor and crime. All in all this is a movie that is worth more than just a watch. I loved it and give it an 8/10.",
         "Go is a surprisingly engrossing, surprisingly nifty little multi-stranded crime film running on inspiration from other crime films of the era; a director's own, kinetic style and a central, focused look at a whole range of troubled, often sleazy, young adults in a modern world full of drugs; debt; dangers and the forced taking on of responsibility. When I first saw Go, I liked it a lot; revisiting it a few years later, I found it just as entertaining; just as interesting and just as engaging as I did before. Everything about the premise for Go screams that it doesn't have a cat's chance in Hell of working, but the stylised energy combined with the tasteful handling of a lot of different scenes and situations work surprisingly well, and blend to create an experience which most certainly wears you out, but in an oddly refreshing sort of way. The film, in covering an array of different characters but never bombarding nor overwhelming us, manages to deliver on a basis of both narrative and character. It is seamless in its blending of elements of the realistic with the surrealistic, all under a banner of raw energy spanning several hundred miles of which the characters travel within the picture. More recently, we've seen films which take a quick, kinetic and relatively easy-going aesthetic and apply criminal activity to it as a group of youths venture in and around contemporary America in some form. An example might be 2007 film Superbad, which did nothing but crack adolescent jokes, hate women and trivialise delicate and often illegal situations for a crowd. Go knows its place and it knows its genre as study, observations, the progression of character and some pretty frightening scenarios all play out under this same umbrella. Those that laugh at certain parts of Go have completely missed the point. The first of three stories, this and another two of which revolve around those whom aren't usually explored in films of this ilk, sees Sarah Polley's shop worker named Ronna heavily in debt; facing eviction and desperate for money. Her story sees her involved in a drug deal with two other young men and a much elder male, which grows increasingly suspicious as she interacts with them, and eventually sees her have to ditch the drugs she was meant to deal resulting in the angering of dealer Todd (Olyphant), whom gave them to her. Ronna's fearless and independent attitude towards the men in her story, in particular Todd whom is financially better off and comes with a real air of menace, presents positive characteristics for the female in this role, as she descends deeper into a situation she brought upon herself through desperation. Ronna's ability to defy her male counterparts in doing what's best for her in avoiding the drug deal sting and being able to fool the dealer as she pulls along a casual and inept male companion, in Mannie (Bexton), who'd be lost without her, adds meat and awareness to an unfortunate but otherwise familiar short story. Continuing with the film's theme of debt, and relatively hapless young adults getting themselves into hotter water than they'd like through which they'll come to learn the harsh realities of life that comes with getting involved in the sorts of activity they do, Simon (Askew), who's one of Ronna's co-workers, and a group of friends spend some time in Las Vegas. Again, the premise for the short with the accompanying aesthetic suggest it ought not work. Indeed, the trip is given the sort of leery and unnerving build when the group of four interact. In a much lesser work, it would've fallen apart at the seams, but the facing of facts that Las Vegas is a large; intimidating; confusing and dangerous place is gradually filtered through the system of the four. While not necessarily a demonisation of the place itself, it is certainly a reality check for the attitudes the characters share. The study begins with the character of Tiny (Meyer) telling a story of himself to the others which transpires to have been untrue. He is caught out, made to look a fool and the entire sequence sets the tone for the narrow-minded, adolescent beliefs the characters have and how they'll be caught out. From here, the videos telling the occupants of a hotel room how to gamble downstairs comes across as arduous and confusing, further suggesting that these guy's are out of their depth, while the causality driven mishaps ranging from food-poisoning to casual drug use that leads to hotel fires is apt. Later, theft; misogyny and raging testosterone will put them in further jeopardy with some local strip-club owners which is the climax of all this dangerous, ominous build up. The third story maintains the same consistencies the other two had in terms of study and it's to the the film's credit that the film's concept has not yet worn us out: we're ready for one more. The strand centres on, like the first, usually somewhat marginalised characters for the genre; in this case two homosexual male actors, named Adam (Wolf) and Zack (Mohr), who go on a kind of odyssey which seems to be about the revealing of true feelings and unexplored sexual appetites; highlighted by the actions of a police officer and his wife when around at their house as well as the revelations that arise when they have a conversation with each other, which in turn pushes the film out into a revenge piece of sorts. Go was made at a time when Doug Liman could compliment his all-over-the-place approach to film-making with character and substance; much unlike his 2005, fetishistic firearm flick Mr. and Mrs. Smith; while his most recent work, 2008's Jumper, did not garner much of a positive critical consensus. But Go holds up, knowing what it is but additionally knowing how to explore the lives and characters within without marginalising them nor rendering them too weak, clichéd or unlikeable.",
         "I saw this last night and I was going to praise it to the sky straight after seeing it , but it was 2.30 am in the morning , I was tired so I decided to review GO the next day . Now that I`ve had some sleep I`m starting to ask myself why I liked it so much because I can hardly remember a thing about it !!!! SPOILERS !!!! GO is PULP FICTION for the MTV generation . It`s the same story told from three different viewpoints , the viewpoints from Ronna , Simon and a couple of gay actors called Adam & Zack but the more I think about the story from memory less than 24 hours after seeing it the more it falls apart , I didn`t have this problem with PULP FICTION . Correct me if I`m wrong but isn`t there something wrong with the time frame here ? After Ronna leaves Adam & Zack`s house , sells the drugs while Adam & Zack are having Christmas dinner and having Adam & Zack turn up at the club only to have them run her over there seems to be a time descrepincy , not to mention the ridiculous coincidence of being run over by two characters she met earlier the same . There`s another scene of ridiculous coincidence of having Simon turn up at drug dealer`s Todd`s house where some mafia types from Las Vegas Simon has upset are waiting for him . Couldn`t Simon have phoned Todd instead of turning up at the house ? This also leads to a scene I disliked of the Vegas mafia giving Simon a sore arm . Come on you p*ss off the mafia and they just give you a flesh wound ? Has no one seen GOODFELLAS then ? There are a few amusing moments in John August`s script but much of the credit for making GO an entertaining film belongs to director Doug Liman . However it should be pointed out that much of this success is down to a great soundtrack and it`s the easiest thing in film making to use a soundtrack to give a scene impact . Todd tells Ronna to lift up her blouse to make sure she`s not wired by cops , Todd turns up the sound of his CD player and Angel by Massive Attack explodes onto the sound system as the camera spins 360 degrees around Ronna a few times . Great scene , but one that is very easy to achieve . Liman also makes good use of tracks by Leftfield and Fatboy Slim I do remember enjoying GO at the time but I`m convinced that it`s a shallow film , and it wasn`t untill I looked up their profiles on this site that I found out Liman directed THE BOURNE IDENTITY while August wrote the screenplay to the CHARLIE`S ANGELS movies . This lends even more weight to my conviction"
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Columbia Pictures",
         "Banner Entertainment",
         "Saratoga Entertainment"
      ],
      "summaries": [
         "Told from three perspectives, a story of a bunch of young Californians trying to get some cash, do and deal some drugs, score money and sex in Las Vegas, and generally experience the rush of life.",
         "'Go' is set mostly during one long Christmas Eve in the lives of a group of young adults on the events surrounding a drug deal in Los Angeles replayed three different times from three different views. In a straightforward manner; when slacker Simon Baines takes off for a getaway to Las Vegas with his friends, Ronna takes his shift at the 24-hour grocery store where they work. When two guys, named Adam and Zack, walk in asking to score some dope from Simon, Ronna takes it upon herself and her friends Claire and Mannie to buy some some stuff from the local drug dealer Todd Gains. But the drug deal is a sting that Adam and Zack are forced to set up by an overzealous narcotics agent, Burke. Ronna is forced to dispose of the drugs. With no other alternative, she tries to double-cross Todd with phony drugs. Meanwhile in Las Vegas, Simon's adventures with his best friend Marcus hit an unfortunate turn during a trip to a strip club, while Adam and Zack end up spending Christmas Eve with Burke and his wife Irene, and afterward while driving to a rave that Ronna is dealing, the guys accidentally hit Ronna with their car and leave her for dead. Nearby, Mannie nearly OD's on dope, and Claire gets more friendly with a vengeful Todd whom is now looking for Ronna.",
         "Go! tells the story of the events after a drug deal, told from three different points of view."
      ],
      "budget": 6500000
   },
   "movielensId": 2580,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-09",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Doug Liman"],
      "runtime": 98,
      "movieId": 2580,
      "title": "Go",
      "mpaa": "R",
      "actors": [
         "Sarah Polley",
         "Katie Holmes",
         "Jay Mohr",
         "Timothy Olyphant",
         "William Fichtner",
         "Scott Wolf",
         "Robert Peters",
         "Suzanne Krull",
         "Desmond Askew",
         "Nathan Bexton",
         "Melissa McCarthy",
         "Taye Diggs",
         "Breckin Meyer",
         "James Duval",
         "Jane Krakowski",
         "Jay Paulson",
         "Katharine Towne"
      ],
      "imdbMovieId": "0139239",
      "originalTitle": "Go",
      "genres": [
         "Crime",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["0KTWEFpDOis"],
      "plotSummary": "Told from three perspectives, a story of a bunch of young Californians trying to get some cash, do and deal some drugs, score money and sex in Las Vegas, and generally experience the rush of life.",
      "tmdbMovieId": 9430,
      "avgRating": 3.67092,
      "releaseYear": "1999",
      "numRatings": 9443,
      "posterPath": "/kr1nz11EILLPdRmn51jtvvBQrWL.jpg"
   }
}