{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "sexual humor",
            "id": 11316
         },
         {
            "name": "drug humor",
            "id": 11485
         }
      ],
      "imdb_id": "tt0166195",
      "video": false,
      "title": "Foolish",
      "recommendations": [],
      "backdrop_path": "/1GmiMLBonzpkmXqaq1PuqQ7N7ed.jpg",
      "revenue": 6033999,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Miles 'Foolish' Waise",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051ef7",
               "name": "Eddie Griffin",
               "profile_path": "/jgz5HDtC3aXYXBSULqay1PKWQOL.jpg",
               "id": 62842,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Quentin 'Fifty Dollah' Waise",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051efb",
               "name": "Master P",
               "profile_path": "/crshi8WF4eXvaumY5CLmPoTyMFB.jpg",
               "id": 65164,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Desiree",
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051eff",
               "name": "Amie Petersen",
               "profile_path": "/n9cUPLelQcQPwsHbeVDhfrR8tLV.jpg",
               "id": 97778,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Giovanni",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051f03",
               "name": "Frank Sivero",
               "profile_path": "/tLogWMv98IE1S3P7RosPSaKs891.jpg",
               "id": 11480,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Clarisse",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051f07",
               "name": "Daphnée Duplaix Samuel",
               "profile_path": "/fxnZIMmTX4L9lZey7TjK4mZjmeH.jpg",
               "id": 97779,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Numbers",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051f0b",
               "name": "Jonathan Banks",
               "profile_path": "/s6K0lromCtmSTzuX9hig8OPiRsC.jpg",
               "id": 783,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "El Dorado Ron",
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051f0f",
               "name": "Andrew Dice Clay",
               "profile_path": "/1KzjDfy2r0Q8HUiEYfLvrOqVWH0.jpg",
               "id": 57906,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Paris",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051f13",
               "name": "Sven-Ole Thorsen",
               "profile_path": "/vNjv3gk22eqihzOqXm2vz5yP58V.jpg",
               "id": 20761,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Odetta",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051f17",
               "name": "Marla Gibbs",
               "profile_path": "/nQuJrBZup56wkJXmM3zp46Z6wNO.jpg",
               "id": 68751,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Simone",
               "gender": 1,
               "credit_id": "52fe454bc3a368484e051f1b",
               "name": "Traci Bingham",
               "profile_path": "/no8ZFXzZYiPbDnRy2rwcUw8cdAF.jpg",
               "id": 97780,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jimmy Beck",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051f1f",
               "name": "Bill Nunn",
               "profile_path": "/dcZWC2iGjHasKwdYSwpHcWFQX5a.jpg",
               "id": 5502,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Alabama Brown",
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051f23",
               "name": "John Marlo",
               "profile_path": null,
               "id": 55632,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Everette Washington",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051f27",
               "name": "Clifton Powell",
               "profile_path": "/hBw76xJtCwKS2v5rZtzDBqvKLN6.jpg",
               "id": 58924,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051f2b",
               "name": "Anthony Johnson",
               "profile_path": null,
               "id": 83101,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe454bc3a368484e051eed",
               "name": "Dave Meyers",
               "profile_path": "/fmQTI7xBDh0Pr2VwBJTc5zL27L3.jpg",
               "id": 54827,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe454bc3a368484e051ef3",
               "name": "Master P",
               "profile_path": "/crshi8WF4eXvaumY5CLmPoTyMFB.jpg",
               "id": 65164,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.627792,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 27455,
      "vote_count": 3,
      "budget": 0,
      "overview": "'Foolish' Waise is a talented comedian with a hard-edge trying to make it in the comedy clubs in LA while his brother is a hard-nosed gangster trying to make it on the streets. With all the competition they face in their chosen \"professions,\" their biggest battle is with each other over the love of a pretty girl.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         8810,
         948,
         298312,
         14433,
         4771,
         4638,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "Foolish",
      "runtime": 84,
      "poster_path": "/2uOoAVhjKvKlI923SUnUkL7lO9H.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Shooting Star Pictures",
            "id": 40648,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "No Limit Films",
            "id": 16718,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-09",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "This big mouth is ready for the big time",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dave Meyers"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Master P"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0166195/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MDU0NTY4NV5BMl5BanBnXkFtZTcwODU3NDcyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Eddie Griffin, Master P, Amie Petersen | See full cast and crew »"],
      "reviews": [
         "\"Foolish\" is a refreshing, honest, and scathing indictment of the racial inequality present in the film & television industry. It performs a powerful two-pronged attack on this subject matter through the wild comedy stylings of Eddie Griffin, and the skills of dramatic thespian Master P. Eddie, who's rakish good looks and obvious capabilities as a modern-day Don Juan make one think that he is the second coming of Miles Standish, is the main character of the film. He portrays Miles 'Foolish' Waise, a semi-successful stand-up comedian who is being \"woo-ed\" by entertainment executives eager to harness his humorous talents. They sense that he is a masterful genius after hearing his stand-up routines. However, to say they are \"routine\" is to perform an injustice to Mr. Griffin. His stand-up performances delve into such previously untapped comedic wells as: the tensions and differences between people of different color, what it is like to grow up poor, and (his comedic tour de force) how \"crazy\" white people are. Providing the Yin to Eddie's Yang is Master P as Quentin 'Fifty Dollah' Waise. I'm not sure if \"P\" had the opportunity to study under Adler, Strasberg, or perhaps even Uta Hagen, but wherever it was that he received training I'm sure that there is a proud teacher shedding a tear at the dramatic performance of \"P\". How fitting it is that \"P\", who's first scene in \"Foolish\" brought about comparisons to Olivier and Brando in THIS reviewer's mind, should have the first name \"Master\". For he has truly \"mastered\" the art of dramatic storytelling from an actor's and writer's perspective. Without giving away any details, watch for the subtle nuances in Master P's performance when the nubile young woman removes her clothes...10 seconds of pure acting brilliance. Also lending assistance to this quality oasis in a desert of cinematic drivel are Andrew Dice Clay in an astounding performance as El Dorado Ron, whip-smart Traci Bingham as Simone, and (in a scene-stealing role) Swedish acting legend Sven-Ole Thorsen as Paris. In most cases great films aren't made without quality production design and \"Foolish\" certainly holds nothing back there. It is clear that Master P must have mortgaged the entire 'No Limit' fortune to pay for the cost of this picture. The sets look convincing, background crowds appear dense and well-directed, as do the authenticity of street and studio scenes. The costume design is ingenious as well. Master P's choice of the gold tooth was no doubt arrived at after an intensive amount of character research. One curious note however...It does appear that the budget for the women's clothing was stretched thin, as in some scenes they appear in little or nothing at all. Other than that, \"Foolish\" looks like a $60-$80 million dollar studio picture. For the sake of providing the most pure viewing experience possible to the uninitiated, I will leave further details untouched. I think that my thesis regarding the point of this film is so convincingly and entertainingly proven in its viewing that I won't risk spoiling it here. Ultimately I believe this story breaks new ground by dealing with exciting and inflammatory subject matter by using realistic, almost documentary-style filmmaking and performances. The stand-up segments are filled with fresh insights that investigate material that hasn't been investigated before. Master P's performance is capable of generating empathy from the most time-hardened cynic, and Eddie Griffin's character 'Foolish' makes us both laugh and cry. My verdict?... FOOLISH = 'Master'-ful 'P'iece of Filmmaking!",
         "Foolish is a decent flick , based on where it came from. Eddie Griffin does what he can with the script, but it almost takes away from his acting chops. This film should have just been a stand up comedy film, because that's all it really is.",
         "While I knew what I was getting myself into by purchasing a ticket to a film written by Master P, who could have guessed that 50% of this movie would be a concert film. That's where `Foolish' stands. If you enjoy comedian Eddie Griffin, then this film will sate your appetite quickly. If you're a fan of decent writing and average acting, then this flick will fail you. I understand where this film comes from. Like last year's `I Got The Hookup', Master P has cornered the market on lowbrow entertainment. Simply because it's cheap to produce, he can call in favors, and the audience can only trust the brand name of P. The final product is devoid of any real drama, interesting characters, and even laughs. I do not find Eddie Griffin funny at all, so sitting through his endless `White guys act like this, black guys act like that' type bits is intolerable. I doubt there is even 10 pages of dialog here, and the stuff that made it into the film is unintentionally funny. It's a hoot to watch Griffin and P try to stumble their way through a dramatic scene, It's more horrifying that anything David Cronenberg could dream up. A supporting cast of Andrew `Dice' Clay (wearing glasses that would make Elton John blush) and Traci Bingham should spell out clearly the quality of this production. Master P consistently shovels s**t to his audience, and they come begging for more. It's a crying shame. ---------- 2",
         "I rented Foolish about 9 months ago and found it one of the most hilarious movies that I have ever seen. Not because of the acting by Master P and Andrew Dice Clay, but because Eddie Griffin was just \" on \" in this movie. Some of his acting was good but all of his stand up was great. On the DVD there's more stand up which is better than the movie stand up including bits about Hilary Clinton, Sperm and (of course) White People. To sum this up I would recommend viewing this if you really want to laugh your ass off and see something funny, but if your looking for a great story with suspense and plot don't bother.",
         "This is short and to the point: the only good thing about the movie and the only reason why it isn't a 1 star movie is because of Eddie Griffin's incredible stand up. Master P is by far the worst screenwriter to ever put a film together. The worst part of the movie wasn't even the writing however, it was Master P's incapability to act that screwed the movie further. The entire movie should have been under the control of Eddie Griffin, perhaps he could have saved it, his scenes with his grandmother and his stand up are the only positive moments in this movie. and one last thought: why was Andrew Dice Clay in the movie? who made that decision???",
         "Master P's Foolish is a funny flick that provides laughs by Eddie Griffin's stand-up comedy, and provides some good \"G\" drama from Master P. Both combine to make a OK film, but not exactly the best about this type of business. Andrew Dice Clay appears in a small role as El Dorado Ron, who (if you are a rabid Dice fanatic like me, will want to see again and again) shines if not overshadowed. B",
         "Terrible. For those who want a textbook example of everything that could possibly suck in a movie, then this is one. I guess Master P is a hip-hop artist. I don't know why he thinks that qualifies him to write and produce movies but I think he should stick to music. Having hip-hop gangstas write fiction is about as appropriate as having John Updike or Norman Mailer cut their own rap albums. There are certain arenas that aren't meant to cross over and this is one of them. (with maybe one exception. . . \"Friday\" by Ice Cube was good, funny film) Gangsta rapper/hip hop masters should do the entire film-going community a favor and stick to what they do best, i.e. ripping off/remixing old song riffs and transposing them to juvenile lyrics. Leave the actual writing to people who know what the hell they're doing.",
         "A lot of the movie is stand-up footage of Eddie Griffin, most of his material was about \"white people\" and sex, of course. Occasionally there would be a naked woman, for usually no particular reason. Good mix of serious and funny parts, P still needs to work on his acting and only one No Limit Cameo that I can remember and that was Mia X. Also making small appearances were AJ Johnson, and the guy that played the security guy LaFours in the movie Mallrats.",
         "\"Foolish\" is another addition to that subgenre of film that is tangible proof that if you're famous enough in any other area besides films, you can still make your own film. Master P and Eddie Griffin combine their celebrity sway into writing, acting, producing, and improvising an entire feature-length picture. The result is a poorly-written, poorly-acted, and tragically unfunny comedy about two brothers who are trying to make it to \"the big time\" in a supposedly oppressive and controlling world. Among the favors called in by these two stars for this movie are a supporting cast of actors who could otherwise have been brought together to make a perfectly acceptable, direct to video, fluffy action/comedy: Andrew Dice Clay, Jonathan Banks, Sven Ole Thorsen, Traci Bingham, and even the late great Brion James. However, even their presences are wasted in favor of random footage of standup acts from Griffin as well as several of his fellow comedians. Music video director David Meyers makes his motion picture debut stitching together this unorganized sequence of scenes into a cohesive storyline. And the closing credits serve the dual purpose of showcasing songs from not one, not two, not three, but four separate artists from P's record label. Master P read a book on screen writing and used everything he learned to put his script together. He even remembered to actually introduce the grandmother character a full 10 minutes before inexplicably having her die, and thus leading to Griffin's character's dramatic spiral into a drunken depression. And P made sure the script left plenty of scenes open for Griffin's standup routines, attractive women to appear in the nude, the characters to discuss their lives while driving in a car, and Griffin's standup routines. The end of the movie has something to do with \"blue light\".",
         "I think Eddie Griffin is an underrated comic in the industry. He has received mild popularity with viewers of \"Def Comedy Jam\" and was on the short-lived UPN sitcom \"Malcolm and Eddie.\" He is very talented, very energetic and I wish I can see him in more movies. The film spends most of its time on stage, with Eddie on the spotlight doing his hilarious schtick. That's a good thing. Because I feel that is the only reason to see this film. All of its subplots involving drug-dealing and the death of a family member are throwaways. Master P doesn't exactly have a knack for drama. But ignore those elements and you'll have a great time. I was laughing uproariously!!!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "No Limit Films",
         "Shooting Star Pictures"
      ],
      "summaries": ["Eddie Griffin is Miles Waise, a fast rising nightclub comedian. His life is made difficult by his manager, who wants him to sell out for big bucks, and his brother Fifty Dollah, a scheming hood whose dream is to start a comedy club with Foolish."],
      "budget": 2000000
   },
   "movielensId": 2584,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-09",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Dave Meyers"],
      "runtime": 84,
      "movieId": 2584,
      "title": "Foolish",
      "mpaa": "",
      "actors": [
         "Eddie Griffin",
         "Master P",
         "Amie Petersen",
         "Frank Sivero",
         "Daphnée Duplaix Samuel",
         "Jonathan Banks",
         "Andrew Dice Clay",
         "Sven-Ole Thorsen",
         "Marla Gibbs",
         "Traci Bingham",
         "Bill Nunn",
         "John Marlo",
         "Clifton Powell",
         "Anthony Johnson"
      ],
      "imdbMovieId": "0166195",
      "originalTitle": "Foolish",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["QfejI2Ojkqk"],
      "plotSummary": "'Foolish' Waise is a talented comedian with a hard-edge trying to make it in the comedy clubs in LA while his brother is a hard-nosed gangster trying to make it on the streets. With all the competition they face in their chosen \"professions,\" their biggest battle is with each other over the love of a pretty girl.",
      "tmdbMovieId": 27455,
      "avgRating": 2.22,
      "releaseYear": "1999",
      "numRatings": 25,
      "posterPath": "/2uOoAVhjKvKlI923SUnUkL7lO9H.jpg"
   }
}