{
   "tmdb": {
      "original_language": "es",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "love at first sight",
            "id": 699
         },
         {
            "name": "becoming an adult",
            "id": 1412
         },
         {
            "name": "love of one's life",
            "id": 2038
         },
         {
            "name": "first time",
            "id": 2201
         },
         {
            "name": "pilot",
            "id": 3203
         },
         {
            "name": "scandinavia",
            "id": 5475
         },
         {
            "name": "snow",
            "id": 10794
         },
         {
            "name": "fate",
            "id": 10855
         },
         {
            "name": "coincidence",
            "id": 10901
         },
         {
            "name": "relationship",
            "id": 14534
         },
         {
            "name": "divorce",
            "id": 15160
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "antarctic",
            "id": 157160
         }
      ],
      "imdb_id": "tt0133363",
      "video": false,
      "title": "Lovers of the Arctic Circle",
      "recommendations": [
         2460,
         116312,
         32934,
         47143,
         55847,
         55836,
         32636,
         31987,
         92676,
         65016,
         287011,
         75653,
         125891,
         43344,
         12627,
         42513,
         185633,
         81792,
         45133,
         2588
      ],
      "backdrop_path": "/1aIDlIOJufYjcTH0wAmK4mZ8Gd0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Ana joven",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f989",
               "name": "Najwa Nimri",
               "profile_path": "/1HjYUf3gvfEXP26Z2ejflW2AtOi.jpg",
               "id": 16442,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Otto joven",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f98d",
               "name": "Fele Martínez",
               "profile_path": "/7Hccxji7taf2NmfNBiXBnQLCyHk.jpg",
               "id": 1602,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Otto",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f991",
               "name": "Joost Siedhoff",
               "profile_path": "/lQWdOSjm7nIin41ta5FFrpy69qw.jpg",
               "id": 16943,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Otto niño",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f995",
               "name": "Peru Medem",
               "profile_path": null,
               "id": 16944,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Ana niña",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f999",
               "name": "Sara Valiente",
               "profile_path": null,
               "id": 16945,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Otto adolescente",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f99d",
               "name": "Víctor Hugo Oliveira",
               "profile_path": null,
               "id": 16946,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Ana adolescente",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9a1",
               "name": "Kristel Díaz",
               "profile_path": null,
               "id": 16947,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Álvaro",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f9a5",
               "name": "Nancho Novo",
               "profile_path": "/1pf4vsVQcQy6Atvc0pJxUkOp02x.jpg",
               "id": 16948,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Olga",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9a9",
               "name": "Maru Valdivielso",
               "profile_path": null,
               "id": 16949,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Javier",
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f9ad",
               "name": "Pep Munné",
               "profile_path": "/90gcn8bhvGFSHTyV9vV8uvJYl2e.jpg",
               "id": 16950,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Sofía",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9b1",
               "name": "Rosa Morales",
               "profile_path": null,
               "id": 16951,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Aki",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9b5",
               "name": "Petri Heino",
               "profile_path": null,
               "id": 16952,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Madre de Otto",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9b9",
               "name": "Beate Jensen",
               "profile_path": null,
               "id": 16953,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Álvaro Midelman",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9bd",
               "name": "Jaroslav Bielski",
               "profile_path": null,
               "id": 16954,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Mensajera",
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f9c1",
               "name": "Outi Alanen",
               "profile_path": "/hOeL8R3odVr8ttZJ4gCN9WugFeZ.jpg",
               "id": 16955,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Dependienta",
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f9c5",
               "name": "María Isasi",
               "profile_path": null,
               "id": 16956,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f95b",
               "name": "Julio Médem",
               "profile_path": "/ohftr2f6JyITzMios6RTpCKS54j.jpg",
               "id": 16435,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f961",
               "name": "Julio Médem",
               "profile_path": "/ohftr2f6JyITzMios6RTpCKS54j.jpg",
               "id": 16435,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f967",
               "name": "Fernando Bovaira",
               "profile_path": null,
               "id": 16941,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe42f4c3a36847f802f96d",
               "name": "Alberto Iglesias",
               "profile_path": "/2PGZyiqdAAyi2S0ZpFw5V0ojCqY.jpg",
               "id": 405,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f973",
               "name": "Gonzalo F. Berridi",
               "profile_path": null,
               "id": 16942,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f979",
               "name": "Iván Aledo",
               "profile_path": null,
               "id": 16438,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe42f4c3a36847f802f97f",
               "name": "Sara Bilbatúa",
               "profile_path": null,
               "id": 3629,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe42f4c3a36847f802f985",
               "name": "Estíbaliz Markiegi",
               "profile_path": null,
               "id": 16440,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 4.741978,
      "production_countries": [{
         "iso_3166_1": "ES",
         "name": "Spain"
      }],
      "id": 1414,
      "vote_count": 66,
      "budget": 0,
      "overview": "Otto and Ana are kids when they meet each other. Their names are palindromes. They meet by chance, people are related by chance. A story of circular lives, with circular names, and a circular place (Círculo polar) where the day never ends in the midnight sun. There are things that never end, and Love is one of them.",
      "similar": [
         12220,
         369557,
         8390,
         3594,
         1903,
         73,
         587,
         2064,
         595,
         85350,
         12102,
         5123,
         164457,
         225886,
         9836,
         10693,
         712,
         158907,
         842,
         376659
      ],
      "original_title": "Los Amantes del Circulo Polar",
      "runtime": 112,
      "poster_path": "/4HRUZYCAXN1W3C0qgJpAWbp7nNo.jpg",
      "spoken_languages": [
         {
            "name": "Magyar",
            "iso_639_1": "hu"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Sogetel",
         "id": 15469,
         "origin_country": ""
      }],
      "release_date": "1998-09-04",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "Destiny cannot be denied.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Julio Medem"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Julio Medem"],
      "originalLanguage": "Spanish",
      "imdbLink": "http://www.imdb.com/title/tt0133363/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzc0MTIwODQ3Ml5BMl5BanBnXkFtZTcwNDk0MzIzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Najwa Nimri, Fele Martínez, Nancho Novo | See full cast and crew »"],
      "reviews": [
         "Your love's mother gets married to your father, she becomes your sister and you grow up together as brother and sister. What a story!!! And Julio Medem is a great director who made a very good film from this story. The movie is full of original ideas, this uncommon relationship requires an uncommon way of telling. The story builts up from mosaics so it keeps you interested in until the last minute because you have to put the pieces in order for yourself. It's a fantastic idea that we can only see the children (Otto and Ana) at the back seat of the parents' car going to school. They don't meet each other for years just at the car and they don't even talk to each other because their love is so deep and spiritual that words are unnecessary. Just secret touches, stolen moments. When the teenager Otto moves to his father's and stepmother's house because he wants to be next to Ana, they become real lovers. The first night together, when their spiritual love becomes physical, is a so gentle, innocent and discovering journey into the world of sexuality, that never been better put on screen before. The next scenes, where we can see them as secret lovers hiding from the parents are so beautiful that the last one hour, when Otto leaves Ana and works as a pilot and they don't meet for years, is one of the most sorrowful one hour in the film history. They are crossing each other's lines, but they never meet, and it causes a physical pain to the viewer. During these years they're getting to know more about themselves and their family, relationships, have some accidental meetings. Finally, years after they meet... The ending is as unusual as the whole movie, Julio Medem had enough talent to make a good ending which is the biggest risk of the movies - and he doesn't fail, leaves some doors open, because life doesn't finish, when curtain goes down. Full of surprises, one of the best film of the 90s. I highly recommend it to everyone who is tired of pink, unrealistic romantic films, and wants to see a really good, modern romantic film.",
         "It's really difficult to understand European cinema after watching thousands of American-Big Studio films. At least that's what looks clearly apparent when I read many of the comments in imdb. But for some of us, who are in contact with a different way of making films, this one excels at the visual poetry from the very start. And from a cinematographer's point of view, as a real jewel in filmmaking. What Los Amantes is about, is love, and only that. The way this story is portrayed is quite original, in a way some directors have tried and done pretty good jobs (Alejandro González Iñárritu, for instance, in his two films: Amores Perros and 21 Grams). It's a compelling way to explain simple things in reverse. Thoughts, and internal processes are not directly understood or apparent to the viewer. Medem demands his audience to think (remember Abre los Ojos). It's really sad to think that linear and flat plots that only demand to sit and watch are what most people see as good films. When something catches them out of balance, sometimes they refuse to stay tuned and think. The revelation, as is with this film, comes at the very end. And it deserves a second session to go through the small details -which are plenty in Medem's work. It's a long film... some argue. What is a long film when everything is like a whirlpool that draws you in? I don't think this is a long film. Me and many of my friends have pored through it many, many times. So many, in fact, that we had to throw away the original video. A pity, because it was in it's original widescreen version, not as the recently issued dvd that's been murderously cropped. Whatever it is what you like to see, take a look at this film. It can open a lot of possibilities to widen your taste, and your approach to \"long\" films.",
         "For people who do not like Medems work, it will be hard to watch and boring. If you liked any of his other films you will love it. Otherwise you will have to sit and be patient to let Medem touch you. Everyone will recognize some parts his own falling in love, or his relationship with his parents. Medem describes all this in a poetic and heartbreaking way, edited in multiple viewpoints. If you can open up yourself on these subjects, this film will make you think over your own life, love and parents. It is also nice to see that this film fits exactly between \"Tierra\" and \"Sex and Lucia\", Medems other masterpieces made before and after this movie. Absolutely great stuff.",
         "This is so beautiful, it hurts. Tender. It is a lacy filigree in what it is, essentially a story about longing, urges and space. But that filigree extends to the nature of the space that surrounds the story on screen. And the motion of weaving extends further to the shape of the narrative threads which present the story and urges. Some viewers will be put off by the structure. It may seem contrived or mechanical, though hardly more so than the usual way which rigidly starts at the beginning and rolls in only one direction. To others it may seem like a lot of unnecessary work. Well, it does require some engagement, but that's the nature of poetry. And unlike \"Irreversible\" and \"Mememto\" there's more to it than merely sharing the discovery of knowing with the main character. I'm convinced that there is a mode of storytelling, the deepest, richest, most rewarding mode... a manner of structuring narrative in such a way that we are \"folded\" into the story, both watching and participating. I further believe that the most powerful of folds have geometric structure. We are after all geometric thinkers at root. We think we live in a world of shape and form and reason about that world in the same way. All this is underscored in cinema, which reshapes that real world in ways that we can handle and examine. I'll go so far as to posit that the best art has a story, a presentation of that story and an annotation of the nature of art and presentation, all using the same strokes and shapes. Geometric folds, cosmologies, readable structure. Medem is our current master of this. His \"Sex and Lucia\" goes much further than this in the complexity of structure and the circularity of urge weaving future pasts. But this has an appeal in its simplicity. As with \"Lucia\" (a scrambled \"Alice\" story), you can start anywhere \"Hopscotch\" -wise and build from there on reflection after leaving the theater. Were the lovers related? Was the girlfriend his mother? Did they even ever meet on the plaza? Did he die in the trees after weaving a happy virtual life? Or was it one circular boyish ejaculation under his bed? Along the way, look for airplanes: starting with a zillion paper airplanes thrown out a window with a message so dear that it changes everyone it touches. Overlap that with the image of having the courage to come back in through the (same) window and touch someone with love. There are a few patterns in the lace here that you will take with you for the rest of your life. And anything that can do that, and do it using the language of dreams in such a way that makes love more lucid \u0097 if it can do that, you'll want to see it, handle it, co-invent with it \u0097 turn it over in your mind, a golden woven solid of wires as geometric urges. And it is so much richer if you know the story between the filmmaker and his father to whom this is dedicated. And that Medem's own son plays the boy. Start with \"Lucia.\" Its a masterpiece. Then absorb this. Ted's Evaluation -- 3 of 3: Worth watching.",
         "MINOR SPOILERS What many film-goers fail to understand is that \u0091Los Amantes del Círculo Polar' is poetry in images. That simple. I've had other people's opinions thrown at me, and none have pointed this out. What I find too ridiculous (and depressing) is when I find myself going through those who say the film fails to achieve historical accuracy about Spain's past, and that the film is an insult to Basque national identity. That's just hilarious. The film has nothing to do with Spain's history, or anything like that, it's just a love story, told following a personal poetic style, that's all. Medem is perfectly conscious that the German airplane pilot is a Nazi, as he has one of the parents point out in the background. What he wants to reflect is how the teenage Ana accepts a childlike fantastic reality, and how the process of growing up involves a construction of realities that may not be completely true to physical or social realities, but nevertheless are to emotions. Other people talk about how Medem's telling of the story from different perspectives undermines the ultimate truth. What they fail to see is that this is just poetry, and that poetry sometimes isn't a search for this rational truth you'd look for in something like science. What's more, this film deals with human emotions, which are to my knowledge of the most irrational thing ever. Emotions are, just like this film, an intense accumulation of inexplicable wandering half-lost half-found images and words. We're not looking for the real truth, and even less from a normal perspective or linear narrative. It appears that those who protest about this film want a nice, and informed, objective view of a relationship. But where's the good in that? How can someone tell a love story from the outside if he hasn't lived it himself? The \u0091endless' repetitions just bring up an immensely fresh way of telling a love story, which I am more than willing to appreciate. The slipping in of the child Otto into the grown-up Otto is just as great as any others, despite what some people say. The scene where he discovers his dead mother, the grown-up Otto is the one who wants to leave and ignore the reality, but it's the child Otto, with his child-like curiosity, that turns round and heads for the kitchen where his dead mother lies. If you didn't like this slipping in of each actor into different phases of their lives, you failed to see that this is a mere reflection on how people don't change. If emotions haven't changed throughout human history, they're not likely to change now, are they? Every person always keeps a bit of their child feelings in them, precisely what a cold-blooded critic is just as likely to fail to see. Some think they can strengthen their argument by pointing out the absence of story-line, and what in their eyes would be a more conscious production of art. However, the immense strength of the film is in aspects that aren't in the writing, but rather in the direction. Just admit it, some great films have incredibly simple story-lines and this is one of them. It's as if you set out to define the word \u0091love'. While one person can come up with a dictionary definition, another does so with an infinite number of images. The first person would complain that the story-line is only about one word, and the artist who's translated the word into those thousand images gets no credit. Please\u0085 I was thinking of a definition someone gave me once about the meaning of poetry, which was that it was about trying to give justice to every word. Image poetry, just this film, is the same; every image in the film tries to give justice to every word in the story. So what's more important for a film, the image or the word? It doesn't matter, not here at least, but just in this case it's the images. The film is about presenting the words, and then giving them the justice they deserve in images. Most of the time, in this film it's about giving justice to the image by itself, and forgetting about the words. Now, comparing this with another director, like Kieslowski, is also approaching the issue in the wrong way. Everyone's different.. Medem thinks his way, and Khrystzov his, and they're both great. The latter was a very unhappy guy who gave his films an ironic touch by looking for life's beauty, a concept he was constantly doubting in real life. The former believes that love stories like in his film don't exist, but that it's good to think they do. They're both subtle in their own ways. They both reflect things even we may not understand. What's more, this film would be inappropriate for Kieslowski, because it has too much movement, and this director had a more static way of presenting his poetry. So just let things like these be. Each auteur brings his own viewpoint, and however underrated many of them are, and ignored and insulted, they're what I'm in this thing called cinema for. Back in Theo and Cleopatra from 5 to 7, they discussed whether art was worth it. Is it? Thousands die everyday and art doesn't save them. But what it does do is immortalise a person, an emotion, a feeling, an attitude\u0085 Its there so that when one dies his thoughts aren't forgotten. A photograph remains even if the person is dead. Otto and Ana will remain even if we all die. I say respect every artist in cinema, and learn to appreciate their effort. And with this film, Medem contributed to film and to emotions at the same time, I'm not sure to which of the two he's done most for. We're living on borrowed time, people, so all I can say is that I hope that the nightly wind Medem created in \u0091Los Amantes' blows forever!",
         "Los Amantes del Círculo Polar is probably not a movie to everybody's taste. If you want to see a lot of action, great comedy or some astonishing special effects, you better don't even think about watching this one. In fact it hasn't much more to offer but some philosophical thinking. Thinking about destiny and how we can't escape from it, thinking about life and love, thinking about coincidences... It starts with a young boy running through a forest because he wants to retrieve a soccer ball. A girl of about his age is running through the same forest. She's running because her mother told her that her father has died. He follows her and she falls on the ground. She sees him and immediately recognizes her father in him, he on the other hand immediately falls in love with her... Because of some coincidences his father and her mother start a relationship and they become \"brother and sister\". As they grow older their love for each other doesn't fade, but their lives separate. In the end they meet each other again, not in Spain, but in Lapland (Finland). Los Amantes del Círculo Polar is shot in a very original way. First you get the scene from the point of view of one of the two characters, than you get the scene again, but this time from the other character's side. Even though the director has paid more attention to the story and the way it was told than to the performances of the actors, this still is a very impressive movie. I give it an 8.5/10",
         "And this one does. The names of the protagonists are palindromes, Otto and Ana. Life may be a palindrome. There is much talk of circles. The beginning of the movie may be the end. Coincidences abound. Missed chances, never more exemplified than by the two lovers sitting unaware of each other in a cafe and moving along on another path for a while. Haunting images of caribou, planes crashing, red buses, accidents that may or may not be happening. Newspaper headlines that could cover many similar events. Destiny. Can we create our own? Is there just one soulmate out there for each of us? How does this movie end? All unknowns. I was challenged, uplifted and mystified. Technically, the subtitles were very poor in places - white on white, frustrating. Musically, very sombre, rather unnecessary. Children Ana and Otto beautiful, understated. 7 out of 10.",
         "This is one of those films that the less you know about it the better-- but GO SEE IT. This is one of the most romantic movies I've ever seen. It's a really magical, intricate, intense and beautiful film. This film is also very hard to describe. You flip/flop from one perspective to another, learning what the events of the movie MEAN to each character. The connections are so intricate and complex, the visual storytelling so compelling, I was just blown away by this film, and I felt the rest of the audience was right there with me. If you've seen and liked THE LOVER you'll like this-- it's one of those slow, languid, dreamy and beautiful movies about a true love that lasts beyond all circumstances. It's so intense one almost swoons watching it. The only other thing it reminded me of was the novel THE WHITE HOTEL. I know I sound like a huge flake, but I'm not! GO see this-- and try not to hear too much about it. You'll be converted. Really an EXPERIENCE. I'm saying it's the best of 1999 so far-- and I doubt I'll see anything better. GO! Now! Take a loved one! --- Check out website devoted to bad and cheesy movies: www.cinemademerde.com",
         "Ana and Otto met when they were children. She was running in the woods after hearing of her father's death; he was running to get a football. When they met, he fell for her immediately and she could see her dead father inside him. Sadly coincidences lead her mother to fall in love with his father and, before long, they are brother and sister. Over the years though, their affection grows and they begin a relationship that is so secret that they barely know it themselves. In this circle of love and life, strange things occur that they see from different perspectives. This film is the sort of foreign art-house cinema that will make some viewers pull their hair or fall asleep with boredom, so maybe be careful if you are the type of viewer more at home with Porky's rather than anything cerebral; but for everyone else this strange yet engaging film is well worth a look. The plot is about a stepbrother and sister who are sort of in love but to just describe it as that is to do it an injustice. It is much more than that, not all necessarily good, but all interesting enough to watch. The plot movies in little circles \u0096 like their names, it has a palindromic effect with one large circle and lots of little ones within; it is very smartly written and I did enjoy it for this. This doesn't help the heart of the film though, and at times I did find it very cold and uninvolving \u0096 the characters weren't really real enough and I found the coincidences to actually stop the story being moving and occasionally did make it feel gimmicky. It is also knowingly weird at times and that also put me off; but the overall effect is good. The cast are little more than players within this tricky little film and, as such, they mainly struggle to deliver real characters. Ono and Anna are played pretty flat and cold but it is at least good that they were played consistently over the generation jumps and each acting partnership. It is not really their fault because the film is more interested in the ironies of the circling life and coincidences rather than getting to the heart of the characters \u0096 they try hard but this is not a film to watch for strong acting performances. Overall this is a good film but one that may leave many viewers cold and unimpressed by the gimmicks; however many others will be won over by the clever delivery that is filled with mini circles within circles all within the overall palindrome of the total product. At times the cold telling is a bit distracting and the coincidences are not as deep as the film would have us believe but generally it is worth a shot and is a memorable little film.",
         "This is one of the best films I have seen, I could say, in my entire life. I don't usually comment if it isn't that way. The film is a masterpiece, a very strong union of every thing that we could want and ask of a film. The story is complex, yes, but it has been set for our eyes in a simple, yet involving way. Then the spectacle really begins, when you feast your eyes on the images passing in front of you. You feel the cold, the warm, the lonely, Ana, Otto, the love.... you feel the story as if it were yours, and believe me, it is. The images achieved by director Julio Medem and cinematographer Gonzalo Berridi are breathtaking, they arouse and touch you, you have the sensation of having seen all that beauty before or the contrary, of never having seen images so beautiful in your entire life, or both. Is life a constant clash of coincidences? I don't know, but watch this film even if it's not by coincidence. You will breathe, love, think, love, see, love different afterwards. This is poetry, this is art, and this is one of the reasons why I am so passionate about cinema, and why it will always be so. My vote?.... Would a 10/10 be enough??? I'm not sure, make that 11."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "Sociedad",
         "Sociedad General de Televisión (Sogetel)"
      ],
      "summaries": ["Otto and Ana are kids when they meet each other. Their names are palindromes. They meet by chance, people are related by chance. A story of circular lives, with circular names, and a circular place (Círculo polar) where the day never ends in the midnight sun. There are things that never end, and Love is one of them."],
      "budget": 0
   },
   "movielensId": 2585,
   "movielens": {
      "languages": [
         "Magyar",
         "Español"
      ],
      "releaseDate": "1998-09-04",
      "dvdReleaseDate": "2000-07-24",
      "directors": ["Julio Médem"],
      "runtime": 112,
      "movieId": 2585,
      "title": "Lovers of the Arctic Circle",
      "mpaa": "",
      "actors": [
         "Najwa Nimri",
         "Fele Martínez",
         "Joost Siedhoff",
         "Peru Medem",
         "Sara Valiente",
         "Víctor Hugo Oliveira",
         "Kristel Díaz",
         "Nancho Novo",
         "Maru Valdivielso",
         "Pep Munné",
         "Rosa Morales",
         "Petri Heino",
         "Beate Jensen",
         "Jaroslav Bielski",
         "Outi Alanen",
         "María Isasi"
      ],
      "imdbMovieId": "0133363",
      "originalTitle": "Los amantes del círculo polar",
      "genres": [
         "Drama",
         "Mystery",
         "Romance"
      ],
      "youtubeTrailerIds": ["rSd0L-L-GWQ"],
      "plotSummary": "Otto and Ana are kids when they meet each other. Their names are palindromes. They meet by chance, people are related by chance. A story of circular lives, with circular names, and a circular place (Círculo polar) where the day never ends in the midnight sun. There are things that never end, and Love is one of them.",
      "tmdbMovieId": 1414,
      "avgRating": 3.82553,
      "releaseYear": "1998",
      "numRatings": 662,
      "posterPath": "/4HRUZYCAXN1W3C0qgJpAWbp7nNo.jpg"
   }
}