{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "corruption",
            "id": 417
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "infidelity",
            "id": 1326
         },
         {
            "name": "fraud",
            "id": 4373
         },
         {
            "name": "politician",
            "id": 6083
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "romance",
            "id": 9840
         },
         {
            "name": "betrayal",
            "id": 10085
         },
         {
            "name": "singer",
            "id": 10229
         },
         {
            "name": "erotic movie",
            "id": 190370
         },
         {
            "name": "neo-noir",
            "id": 207268
         }
      ],
      "imdb_id": "tt0119219",
      "video": false,
      "title": "Goodbye Lover",
      "recommendations": [
         27408,
         86068,
         39927,
         58797,
         54109,
         22121,
         41938,
         25269
      ],
      "backdrop_path": "/mx5CVXnHTfyj64i2lHzqdDUmWqY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Sandra Dunmore",
               "gender": 1,
               "credit_id": "52fe47b3c3a36847f8143a2f",
               "name": "Patricia Arquette",
               "profile_path": "/9Sz0M91CHHkJ5tlPteiXv34gpgK.jpg",
               "id": 4687,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Jake Dunmore",
               "gender": 2,
               "credit_id": "52fe47b3c3a36847f8143a33",
               "name": "Dermot Mulroney",
               "profile_path": "/uqDPswlyj7hUVrmTn5mbDiWiTQi.jpg",
               "id": 20212,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Peggy Blane",
               "gender": 1,
               "credit_id": "52fe47b3c3a36847f8143a37",
               "name": "Mary-Louise Parker",
               "profile_path": "/3e72qs1QuqMlpieIm2JZtX1WNg2.jpg",
               "id": 18248,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Stg. Rita Pompano",
               "gender": 1,
               "credit_id": "52fe47b3c3a36847f8143a3b",
               "name": "Ellen DeGeneres",
               "profile_path": "/wBB6C4IGsYlHzIEMW6Q3JIvNAfz.jpg",
               "id": 14,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bradley",
               "gender": 2,
               "credit_id": "52fe47b3c3a36847f8143a3f",
               "name": "John Neville",
               "profile_path": "/b6s37ak6b0ikhpVk6XVG56QWVqp.jpg",
               "id": 12642,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Rollins",
               "gender": 2,
               "credit_id": "52fe47b3c3a36847f8143a43",
               "name": "Ray McKinnon",
               "profile_path": "/gjZv4RQfPrOQEn0QRuR1G7HEz0D.jpg",
               "id": 1472,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Det. Crowley",
               "gender": 2,
               "credit_id": "52fe47b3c3a36847f8143a47",
               "name": "Alex Rocco",
               "profile_path": "/u2JStL4Pk9Huq1xmrjqezfysivt.jpg",
               "id": 20752,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Ben Dunmore",
               "gender": 0,
               "credit_id": "52fe47b3c3a36847f8143a4b",
               "name": "Don Johnson",
               "profile_path": "/yQHW10SE2HyuaZmHvUrSxKhqqWg.jpg",
               "id": 25129,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe47b3c3a36847f8143a13",
               "name": "Roland Joffé",
               "profile_path": "/kis74mAa2ZsccFr1ToDsrkMy7Gn.jpg",
               "id": 8965,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b3c3a36847f8143a19",
               "name": "Ron Peer",
               "profile_path": null,
               "id": 21826,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b3c3a36847f8143a1f",
               "name": "Ron Peer",
               "profile_path": null,
               "id": 21826,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b3c3a36847f8143a25",
               "name": "Joel Cohen",
               "profile_path": "/cCJDIvQatfefZtB9cI49S2L3erC.jpg",
               "id": 12892,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b3c3a36847f8143a2b",
               "name": "Alec Sokolow",
               "profile_path": "/v79vlRYi94BZUQnkkyznbGUZLjT.jpg",
               "id": 12893,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 5.034948,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 49981,
      "vote_count": 18,
      "budget": 20000000,
      "overview": "Police investigate when a man having an affair with his brother's wife disappears suddenly.",
      "similar": [
         11423,
         111083,
         2832,
         4771,
         101,
         949,
         9873,
         58625,
         2275,
         261023,
         17494,
         1586,
         9679,
         189,
         106646,
         10528,
         2118,
         75780,
         27582,
         156022
      ],
      "original_title": "Goodbye Lover",
      "runtime": 102,
      "poster_path": "/3lNQLHILeYX26FlHTjj4UPTEc21.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Lightmotive",
            "id": 16978,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gotham Entertainment Group",
            "id": 39288,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1998-05-01",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "No one's ever been so good at being so bad.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Roland Joffé"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Ron Peer",
         "Ron Peer"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119219/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwMDg0NDMwNV5BMl5BanBnXkFtZTcwMjI1NTUxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Patricia Arquette, Dermot Mulroney, Mary-Louise Parker | See full cast and crew »"],
      "reviews": [
         "You can't please everyone. If you have a story that's easy to follow people will say its boring and predictable. If you have a richly complex story, people will say its labyrinthine and confusing. The trick is to have something in the middle, and that is what Goodbye Lover gives us. The central thread is simple. The complications happen on the periphery. You can't watch this movie with one eye closed. You have to pay attention! How can you have a mystery when you already know whodonnit? Ah, that is the question. Are you up to the challenge? This is a comedy. Comedies have license to be wacky and over-the-top. Patricia Arquette and Ellen DeGeneres give standout performances. I love this movie. Its very entertaining, very clever, very funny, fast paced, never boring. Isn't that what a comedy should be?",
         "I wrote this comment mainly because there are so many negative reviews posted here and fewer positive ones and I think this film definitely deserves better. I liked it very much, have seen it twice, once on the big screen and just now on DVD. It was not the least bit boring the second time even though the film relies heavily on its plot twists and the suspense they produce. I think many people just don't come to terms with cross-overs, they want either a suspense film that takes itself dead serious or a clear cut comedy. I liked the humor in the film and its outrageous characters well played by a perfectly assembled cast. Patricia Arquette is just great, a pleasure to watch! She deserves the price for the funniest sociopath femme fatale ever seen on the silver screen. Vincent Gallo in his tiny role as contract killer is the icing on the cake! The film is superbly shot and directed and features a brilliant soundtrack. I voted it a 9.",
         "\"Goodbye Lover\" is a quite good dark comedy about -- as Jake Dunmore says quoting his brother Ben -- \"Image is everything.\" Everything in this movie is about image, and yet nothing is at it appears. And in this respect the very context of the movie sustains the content exceedingly well: it's a beautifully shot movie -- too pretty, in fact. So pretty it's easy to miss the fetidness just beneath the surface. Almost every shot is too shiny, too glossy, too seamless, too meticulously composed. Many scenes are suffused with those ubiquitous cinematic blues and oranges contemporary DPs and directors like so much, but raised to such a degree that it almost enters the realm of the fanciful. Many other scenes are done in hi-tech blacks, whites, and grays. Everything is window dressing -- reality is nothing more than appearance, beautifully symbolized by mirrors everywhere. Lots of mirrors, shiny surfaces, glass & windows, all reflecting everyone to everyone else, a world of appearances without substance, without soul. And when people aren't being reflected in mirrors they're being framed behind glass, a diorama for display. The world is just one big department store window. Yet just as a structurally crumbling, termite-ridden house can be painted to look pristine and beautiful, so does this shiny veneer hide the most vicious, rapacious, cynical behavior. Indeed, the world in which this takes place may look beautiful, but it is very very empty and ugly. And as such this is a kind of morality tale that shows the dangers to a society that lives strictly for appearance. There are few movies I can think of which so excellently explore this tense boundary between the shiny packaging, and the rancid stuff it hides. As Ben Dunmore says, \"People worry that it's a dangerous and sh*tty world. And it is our job to make it look safe and clean.\" Thus our hero works at a PR firm, packaging a morally bankrupt politician as a wholesome, devout family man; the president of the PR firm pretends to be a holy man -- a rather inherent contradiction; our two principals work in a church that obviously serves Mammon over anything else: religion is just another accoutrement, something to accessorize the soul; and then there's the wedding chapel in Las Vegas, where an unctuous smile sells ersatz sincerity. [Sorry.] Etc. (In fact, it's surprising how many such examples of this there are in the movie -- the writers were very inventive and consistent in coming up with such a profusion of image vs substance motifs.) The only person in this world of appearances who doesn't belong, Detective Rollins, is a \"F*cking Mook\" -- as his partner, Sergeant Rita Pompano (Ellen Degeneres), calls him. For him, appearance *is* reality. His sincerity is regarded with mocking disbelief by everybody: he obviously doesn't understand the rules of the game that everyone else is playing. Even we, the audience, take sides against him -- that's how subtly subversive and well presented -- even seductive -- this world is. And speaking of Ellen Degeneres, she is great in this movie. Others complain that she isn't funny or witty, merely insulting. But in one of those delightful twists where the line between fiction and reality dissolves, this is her payback for the flack she took from the forces of christian oppression after she came out of the closet. Ellen obviously relishes this role -- she mercilessly mocks her Mormon partner, gets to be a \"guy\" (and, for an attractive woman, she is laudably unattractive in this role), and, at the end of the movie, looks ridiculous when she dresses in \"drag\". This may also be Don Johnson's best movie. For once he gets to play the kind of character he seems uniquely equipped to play: a high-end used car salesman, all style, all flash, sexy in his way, but empty and sleazy. It's very fitting that when he says he's \"trying to get something real in his life\", he unknowingly gets quite the opposite. And, since he wants to leave the game, he no longer belongs in this world -- and is appropriately removed from the game. Sometimes the symbolism is a bit heavy-handed (\"Go For It\" billboard), as is the writing (\"You need to go down on your knees for her.\" \"Well, someone obviously did.\"). But it's all in good spirits, and I'm willing to accept its blemishes (as it were) 'cause it succeeds admirably in most other respects. And the acting in general is uniformly solid -- in fact, it's very well cast, even the curiously unfatale femme fatale Patricia Arquette. The movie ends on a wonderfully humorous note to the tune of \"Climb Every Mountain\" as image thoroughly triumphs over substance, much as it does in real life -- which may be the reason this movie doesn't sit well with many people. The filmmakers obviously had fun making this movie, and it shows. All in all, it's a very well-made, fun movie -- if you scratch its surface. [8/10]",
         "I'd never heard of this movie and came across it as it was starting on cable last night. I only intended to watch a few minutes of it and then go to sleep but I ended up watching the whole thing. I was particularly intrigued with Ellen Degeneres' character, a hard-boiled, seen-it-all detective with a great sense of timing and humor. I was also very impressed with the direction and editing, the movie moves at a fast, bright clip, it's quick and sexy and funny. And I liked Patricia Arquette as the conspiring wife, she plays her role with deft accuracy. Unlike the first reviewer of this movie who found the plot twists predictable, neither my husband nor I saw them coming. I thought this was a thoroughly enjoyable movie, I'm only sorry we missed seeing it on the big screen.",
         "Shady married couple conspire to knock-off the husband's rich brother, but when the wife finds out her husband is in cahoots with the brother's spouse, she does some conspiring of her own. Over-plotted mystery-comedy-drama sat a long while on the shelf. Highly mediocre picture does have a great character for Patricia Arquette to play, but it still isn't funny enough nor convincing enough to make much of an impression. Though directed by the esteemed Roland Jaffe, this is just a cartoonish doodle that only served to give several under-used actors (Don Johnson, Ellen DeGeneres, Dermot Mulroney, Mary Louise Parker) a chance to be \"colorful\". End result is exhausting and tedious. ** from ****",
         "The opening scene of Goodbye Lover is perhaps the most subtle part of the whole film: Patricia Arquette as Sandra, an LA realtor, is shown driving down a busy LA freeway while listening intently to a self-motivational tape. With this as evidence, we just _know_ this chick's nuts. And as the movie goes on, our suspicions are proved correct: we watch as Sandra schemes to kill her husband, Jake (Dermot Mulroney), along with her lover, who also happens to be Jake's brother, Ben (Don Johnson, in a particularly solid performance). But after Sandra's plan \"succeeds\", we learn that things aren't nearly as simple as they seem. Rather, as we meet more and more characters, we find that each one is secretly screwing the other (In both senses of the word). A \"good\" girl played by Mary-Louise Parker and a cynical LA cop played by Ellen DeGeneres become embroiled in Sandra's web of deceit, and as each person succumbs to his/her avarice, the script gets funnier and funnier. In the end, it's a close tie between Arquette and Ellen for the most memorable moments in the film, but both characters have certain qualities that make them enjoyable to watch. Arquette's Sandra is a seductive and especially shrewd femme fatale who hums choruses from the Sound of Music while prancing about other people's homes (Arquette is the perfect Real Estate Agent From Hell). Meanwhile, DeGeneres' Rita Pompano is hilariously aloof to the lives of the people around her, casually dropping off-hand (And almost always crude and sarcastic) comments that demonstrate just how wise she is to Sandra's lusty motivations. Sorry to say, I can't divulge too much of the film without spoiling it, but Goodbye Lover is something like a cross between The Last Seduction and Wild Things. However, unlike the ridiculous series of plot twists that just about ruined Wild Things, Goodbye Lover manages to avoid being too obvious in order to fulfill one's desire for a satisfying conclusion. Overall, I'd have to rate this sexy, noirish thriller with a well-deserved \"A\".",
         "But I HATED the movie. First, Ellen (sorry I love her) was terrible. She just is not that person and can't pull it off. Her having a trashy mouth and being a hard as nails cop just doesn't work at all. After that everything else pales. If you like Mary Louise Parker, watch Weeds and Fried Green Tomatoes and Boys on the Side, and Saved and The Client, and Angels in America, but do not watch this movie please. Patricia Arquette - love her and actually I did love her performance in this movie, but the rest of the movie was just so awful it's a large price to pay to see her performance.",
         "If you've got nothing better to do one night and manage to catch this little gem on late night TV, then it's worth an hour and a half of your time. A stylishly shot quirky film noir with a plot that twists and turns like a twisty-turny thing. With a sizzling performance by the weird femme fatale Patricia Arquette, and great dialogue from Ellen de Generes as the laconic cop, it's a very entertaining thriller. Be warned if you are a cynic, Citizen Kane it ain't, but if you're a fan of the genre and into the Likes of Last Seduction, Bound, Palmetto etc., this underrated piece of work may just tickle your fancy.",
         "\"Goodbye Lover\" is the remedy for a person in need of sizzling, film noir mystery or laugh-out-loud comedy. Patricia Arquette and Ellen DeGeneres carry the film and both seem right at place as their characters. Arquette plays Sandra Dunmore, Don Johnson is Ben, her husband's brother. Dermot Mulroney is Jake Dunmore, Sandra's husband. A plan is being woven and you don't always know by who, as insurance money is what everyone wants. I won't give anything away, even though twists aren't the only thing this film has going for it. Like I said, I spent half the time laughing hysterically. Ellen DeGeneres is Rita Pompano, a lazy detective who hates the human race and is only in the force because \"Every once in a while I get to shoot somebody.\" The film's script is smooth and well written, full of the right dose of thrills and laughs. Despite what many may say about this film, it is the perfect example of what film noir is all about. Not just mystery, not just comedy, but a little bit of both. A fantastic film.",
         "It is extremely difficult to sleep in weather like this, especially if you're off work and not doing much during the day. That may sound like the understatement of the year but it's the only reason I can think of for watching this anonymous film last night on BBC 1. Described as a comic thriller (surely an oxymoron if ever there was one), I was reminded of so many other films whilst watching \"Goodbye Lover\" and nearly all of them were better than this. Despite an impressive cast, its lack of cohesion causes the plot to twist so much that it ends up eating its own tail. A shame, really, because Patricia Arquette's femme fatale is such a good character that she doesn't deserve to languish in this turgid mess. Don Johnson plays Ben, a PR guru working alongside his alcoholic brother Jake (Dermot Mulroney). But Ben hides a secret - he has been having an affair with Jake's wife Sandra (Arquette). After meeting and falling for Peggy (Mary-Louise Parker) at work, Ben decides to end the relationship with Sandra but she is reluctant to let go of him. Before long, things take a murderous twist and it's up to foul-mouthed Detective Pompano (Ellen DeGeneres) and her buttoned-up partner (Ray McKinnon) to solve the case. In what must be the heist of the century, this film borrows so much from other films that it must be a criminal offence. It reminded me of things like \"Fatal Attraction\" and \"Basic Instinct\" but while there is nothing wrong with these influences, \"Goodbye Lover\" is a long way from those giddy heights. It had that awful 'TV movie' feel to it all and at times, it looked cheap and tacky. Credit is due to the actors, especially Arquette and DeGeneres who comes across quite differently from other things I've seen her in. But the writing is the biggest let-down and by the time the climax had arrived, I was no longer surprised by yet another twist. I'm sure, if you pay attention to things like this, you'll see them all coming but personally, each new twist came as a disjointed shock to the system and made the whole film feel disconnected and written on the fly. The only character I had any sympathy for was poor murdered Ben and it's not right that the character you empathise with the most is only in it for the first third of the movie. I honestly don't feel as if this movie is worth all the praise others seemed to have heaped on it. It's silly, not that funny (unless people making love in a church is your idea of comedy) and unlikely to hold your interest for too long. Yes, Arquette steals the movie with vampish ease but if I want to watch a decent modern film noir then I'll stick with \"Body Heat\" which is better, sexier and much more enjoyable. This, by contrast, is needlessly convoluted and not nearly as much fun. Serves me right - I should have been trying to get to sleep instead of watching this."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Regency Enterprises",
         "Gotham Entertainment Group",
         "Lightmotive"
      ],
      "summaries": ["Ben and Sandra are hot and provocative lovers, but Sandra is unfortunately married to Ben's younger brother Jake, and soon Jake will find out about Ben."],
      "budget": 20000000
   },
   "movielensId": 2586,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-01",
      "dvdReleaseDate": "1999-11-12",
      "directors": ["Roland Joffé"],
      "runtime": 102,
      "movieId": 2586,
      "title": "Goodbye Lover",
      "mpaa": "R",
      "actors": [
         "Patricia Arquette",
         "Dermot Mulroney",
         "Mary-Louise Parker",
         "Ellen DeGeneres",
         "John Neville",
         "Ray McKinnon",
         "Alex Rocco",
         "Don Johnson"
      ],
      "imdbMovieId": "0119219",
      "originalTitle": "Goodbye Lover",
      "genres": [
         "Thriller",
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "youtubeTrailerIds": ["uTSG2qdbCzI"],
      "plotSummary": "Police investigate when a man having an affair with his brother's wife disappears suddenly.",
      "tmdbMovieId": 49981,
      "avgRating": 2.68306,
      "releaseYear": "1998",
      "numRatings": 183,
      "posterPath": "/3lNQLHILeYX26FlHTjj4UPTEc21.jpg"
   }
}