{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mississippi",
            "id": 787
         },
         {
            "name": "racist",
            "id": 7856
         },
         {
            "name": "bootlegging",
            "id": 10696
         },
         {
            "name": "criminal",
            "id": 15009
         },
         {
            "name": "life imprisonment",
            "id": 195166
         }
      ],
      "imdb_id": "tt0123964",
      "video": false,
      "title": "Life",
      "recommendations": [
         10723,
         8860,
         16300,
         9713,
         12158,
         11353,
         11066,
         5851,
         8427,
         10411,
         9085,
         306,
         11078,
         14034,
         11692,
         11595,
         11517,
         10136,
         11001,
         9776
      ],
      "backdrop_path": "/qDvtbrCrK29qcBACXNFtuHO2aJM.jpg",
      "revenue": 73521587,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Rayford Gibson",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f8090773",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Claude Banks",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f8090777",
               "name": "Martin Lawrence",
               "profile_path": "/uBVQuIdS3wGCpYaZFEeKZBuiZ2l.jpg",
               "id": 78029,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Willie Long",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907ab",
               "name": "Obba Babatundé",
               "profile_path": "/vUYCsIIoasA6rnxGuN7ZjaRIBrn.jpg",
               "id": 52057,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Sergeant Dillard",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907af",
               "name": "Nick Cassavetes",
               "profile_path": "/daXFYs1PxFtrAZJv5iLMpqnIGet.jpg",
               "id": 11151,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Jangle Leg",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907b3",
               "name": "Bernie Mac",
               "profile_path": "/3qIk1hVV82kcZSEffbuUHpMQBCq.jpg",
               "id": 1897,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Goldmouth",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907b7",
               "name": "Michael Taliferro",
               "profile_path": "/8W5mA1wm9pF1J6F7w1XaUojhlUm.jpg",
               "id": 87360,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Cookie",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907bb",
               "name": "Anthony Anderson",
               "profile_path": "/xcMJimUAcQJGCSw25je1TLMy8rC.jpg",
               "id": 18471,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Pokerface",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907bf",
               "name": "Barry Shabaka Henley",
               "profile_path": "/29JdJxKxHEMvbBS9DWeRMU9dwjj.jpg",
               "id": 8689,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Biscuit",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907c3",
               "name": "Miguel A. Núñez, Jr.",
               "profile_path": "/7uju1sYJOoT78cHpxVk0Sspo3S7.jpg",
               "id": 74354,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Can't Get Right",
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907c7",
               "name": "Bokeem Woodbine",
               "profile_path": "/OewCN9cV4xwvMwPwBw05kqKy2v.jpg",
               "id": 71913,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Sylvia",
               "gender": 1,
               "credit_id": "52fe4458c3a36847f80907cb",
               "name": "Lisa Nicole Carson",
               "profile_path": "/tBSQsDwvA7G4hLzsHwE2wCi2Yzy.jpg",
               "id": 55274,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Daisy",
               "gender": 1,
               "credit_id": "52fe4458c3a36847f80907cf",
               "name": "Sanaa Lathan",
               "profile_path": "/pnLeXOKrKquzk0R9cp1lpDKoEZP.jpg",
               "id": 5411,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Billy's Mama",
               "gender": 1,
               "credit_id": "57266a969251417744003d00",
               "name": "Brooks Almy",
               "profile_path": "/ipmUkAfeaAtGe058pf2mOXmVaTt.jpg",
               "id": 160872,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Billy",
               "gender": 2,
               "credit_id": "57266ac79251413309003b3e",
               "name": "Hal Havins",
               "profile_path": null,
               "id": 61289,
               "order": 13
            },
            {
               "cast_id": 25,
               "character": "Older Mae Rose Abernathy",
               "gender": 1,
               "credit_id": "57266ae7c3a3681c260040c5",
               "name": "Poppy Montgomery",
               "profile_path": "/AvILGeLZoeK5CEQtbSBcaubRMBA.jpg",
               "id": 77028,
               "order": 14
            },
            {
               "cast_id": 26,
               "character": "Juke Joint Waitress",
               "gender": 1,
               "credit_id": "57266b9c9251411e9f0042e1",
               "name": "Venus DeMilo",
               "profile_path": "/iyoogld9S3Cbx5f6Js7Od4ddT2f.jpg",
               "id": 1216556,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f809077d",
               "name": "Ted Demme",
               "profile_path": "/1YVhJuhhgiLXZTOD7nK6nr1jtEC.jpg",
               "id": 34849,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f8090783",
               "name": "Robert Ramsey",
               "profile_path": null,
               "id": 52053,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f8090789",
               "name": "Matthew Stone",
               "profile_path": null,
               "id": 52054,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f809078f",
               "name": "Brian Grazer",
               "profile_path": "/yqiKX3auDuorea0BOtuB6Ifhyp6.jpg",
               "id": 339,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f8090795",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f809079b",
               "name": "Wyclef Jean",
               "profile_path": "/7gsHQGAyQ5WzCP6iTwc9az46FVe.jpg",
               "id": 4246,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907a1",
               "name": "Geoffrey Simpson",
               "profile_path": null,
               "id": 52055,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4458c3a36847f80907a7",
               "name": "Jeffrey Wolf",
               "profile_path": null,
               "id": 52056,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "558e707ec3a368686d001ed0",
               "name": "Margery Simkin",
               "profile_path": "/dCyAWZGEaW1OlGgh5ALiqGfsbpb.jpg",
               "id": 6347,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "56abf13c9251417e20003bb6",
               "name": "Bill Corso",
               "profile_path": "/iL7zT7LUL5p7aBuKfQa4vXF4bAt.jpg",
               "id": 15017,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 11.559045,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6522,
      "vote_count": 218,
      "budget": 80000000,
      "overview": "Two men in 1930s Mississippi become friends after being sentenced to life in prison together for a crime they did not commit.",
      "similar": [
         11414,
         8467,
         414,
         134,
         281,
         1538,
         629,
         395990,
         390043,
         339692,
         338766,
         302946,
         136795,
         82633,
         77866,
         10637,
         1586,
         1924,
         59967,
         339988
      ],
      "original_title": "Life",
      "runtime": 108,
      "poster_path": "/c9phL8FXuL7i15CrjQH5PfM60NB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         },
         {
            "logo_path": "/4PR5ZyqlDrMqx1h5PyOL4VRL70z.png",
            "name": "Imagine Entertainment",
            "id": 23,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-04-16",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Share it with someone you love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ted Demme"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Robert Ramsey",
         "Matthew Stone"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0123964/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwMTEwMDAwMl5BMl5BanBnXkFtZTcwODk4NDgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Murphy, Martin Lawrence, Obba Babatundé | See full cast and crew »"],
      "reviews": [
         "If you're not a fan of Eddie Murphy's humor, then skip this one. The movie begins in modern times, 1997, with the main characters' funerals. The movie then flashes back to 1932 to begin telling their story, and continues as they age in prison in Mississippi. They were \"petty criminals\" but were sentenced to life in prison for a murder they did not commit. However, being black in 1930s Mississippi did them no favors. The story that unfolds is irreverent and funny and has enough twists along the way to keep things very interesting. I can't understand why the average rating of this movie is below \"6\". I give it \"8\" of \"10\" for its overall entertainment value, plus a few \"life's little lessons\" thrown in. I think it is one of Eddie Murphy's best movies.",
         "Sure,Eddie Murphy has gotten credit over the years for being the comic genius that he is,but he does not always get proper credit for his movie work.1999's Life is a good example of Murphy getting overlooked.He does great work here,along with Martin Lawrence(whom I am not a huge fan of, but I must give him due credit here)as two men wrongly sentenced to life imprisonment.This is an excellent story,and casting Murphy and Lawrence in the lead roles is nothing short of a perfect idea.I never would have thought of them as a great team,but I was pleasantly surprised here.A must see for any die hard Eddie Murphy fan.",
         "I found this film funny and inventive. Two adjectives that I have not been able to use for an Eddie Murphy film for a long time. With a story line as good as this one, it was up to Eddie to see how he could develop it. If this film had a flaw, I think this was it. I believe had Mr Murphy decided to look really deeply into the role of Rayford Gibson, it could have been a possible \"Oscar\" role for him. There are no doubts regarding Eddie Murphy's acting ability, yet sometimes I think he sacrifices the script and his role for a cheap laugh when it's not really necessary. It is possible that he is caught up in his own 'identity creation' of \"Eddie Murphy: Comedy first, drama...maybe not!\" That said, Eddie Murphy and his worthy partner, Martin Lawrence successfully produce a comedy worth watching. I just hope that Eddie Murphy continues in this same vein. Please no more films like Beverly Hills Flop 3 and Holy Man! Finally, a general point, which needs to be addressed, is that it is so strange how comedy films with far more substance, fail to do well financially. Moreover, there are films which fall short in quality, that can generate $100M+ for substandard, regurgitated, \"comedy\". \"Life\" which is struggling to reach the $65M mark falls into the former category. \"Austin Powers: The Spy who Shagged Me\" and \"Big Daddy\" definitely fall in the latter. The mind boggles! Anyway, for those who have not seen \"Life\", go and see, you won't regret watching it.",
         "I cannot even begin to count how many `comedies' I have sat through that try to reach for the `timeless' formula by interjecting some lame dramatics to engage the audience even more than the comedy ever could. It's a practice as old as time in Hollywood. Most of these movies fail miserably. You leave the theater thinking `It was funny enough, why couldn't it just stay silly?' My friends, I'm with you on every page. It's a slippery slope to juggle the two genres. `Life' is the millionth attempt at warm-hearted comedy. It tries to make you pee your pants with its jokes, and yet slap your emotions around with the drama. And damn the odds, it fits like a glove. `Life' is also a film that defies much criticism. You either love stars Eddie Murphy and Martin Lawrence, or you don't. I'm in the first category. As the main characters, the two comedians prove just how valuable they are. Murphy is coming off a uniquely horrific year. `Dr. Dolittle' was a smash, but a career setback to say the least. `Holy Man' was an unmitigated disaster, but one that didn't effect Murphy with any real damage. The greatest gift `Life' gives to Murphy is a chance to show off range. Murphy is a very talented actor, and this movie makes you wish he would try a straight drama for once. Murphy can be devastatingly funny. But he can also be very dramatically convincing. With each new movie, Murphy grows as an actor. I really think he's set for brighter things. Martin Lawrence shares many of the same attributes as Murphy. He's terribly funny, and yet able to win your heart with a depth most comedians don't have. `Life' has Lawrence with the quieter role. He uses that chance to provide the film with a backbone. He eventually comes out the best rounded character in the fractured storytelling. It's a good performance, but even better, it's a brilliant pairing with Eddie Murphy. The two are seamlessly funny. Squeezing every moment for comic and emotional juice. It's refreshing to watch a movie with two actors who seem to be trying something different, all the while living up to previous expectations. Ted Demme is a solid director, a thought that immediately puts me in the minority. His `Who's The Man?' was a strictly silly romp, but was actually funny. `The Ref' was the critically lauded and sharp black comedy. `Beautiful Girls' is a film that every time I sit down to watch, feels as comfortable as an old cardigan. He's yet to falter in my eyes. I like his attention to detail, and his gift for trusting his actors. `Life' wouldn't work as well as it does without a specific amount of direction and free will. Demme manages to keep the film on track without ever succumbing to an over-reliance on improv. The best scenes in `Life' are the quiet ones: the gay inmate who's release from prison provides a dilemma, the passage of time montage, and Lawrence's moment with the freshly baked pies(which is actually comical, but who's counting?). The film seems like it was longer at one point, but the film on display here really pleased me. I would recommend this film to anybody that has lost faith in Eddie Murphy.------------- 9",
         "After reading the user comments on this movie, it appears that the main complaint is that it is not the rollicking laugh-a-minute comedy that fans of the two leads expected. Once you let that expectation go, this is a great movie! It succeeds as a drama with comic tone. There have been some great ones that do this, and we mistakenly classify them as comedies. For example, M*A*S*H, Mr. Roberts, It's a Wonderful Life. These are pictures that provide comic overtones to people struggling to get through a very serious and overwhelming event: war, contemplated suicide, and in the case of Life, life imprisonment. I was surprised at how good Murphy is in this flick.Not one of my favorites, he convinces as he ages and grows under the burden his character carries, that of an entire life stolen from him. And he survives with a certain dignity. Lawrence is almost as good, but he does labor a bit with the dramatic parts, seeming a bit uncomfortable shedding his comic bent. Note that when these characters are shown as old men, Murphy actually becomes an old man, Lawrence is still a young man in oldster's make-up. Let's not overlook an interesting small role expertly understated by Ned Beatty, and the charm of Bokeem Woodbine as Can't Get Right. Life is well-mounted and the sets are as convincing as any I've seen. Comedies are rarely as dirty and sweaty as this movie. I thoroughly enjoyed this picture, realizing early on that it was a very serious movie wrongly hyped as a comedy.",
         "Martin Lawrence finally sheds his \"Whats UUUUUUUUUUP!\" image with a stellar performance in Life. Eddie Murphy returned to greatness with his first good movie in awhile. Hopefully this is the start of something good by having these two amazing actors working together. \"Are you gonna eat that cornbread?\" I couldn't stop laughing the whole time I was there. I give Life a 10 and recommend it to everyone.",
         "The movie \"Life\" is funny, warm and a bit sad. Because Eddie and Martin are innocent of the crime, you actually feel sorry for their situation. I kept hoping for them to escape much sooner, so that we could have seen some funny situations they would have been doing to avoid being re-captured. Two nuts on the run.",
         "I usually am not a fan of Eddie Murphy, but I thoroughly enjoyed the interweaving of comedy and drama in \"Life.\" At first glance the title seems to refer to the life sentence wrongly given to the two men. As the story unfolds, the viewer sees the \"life\" they must make for themselves in the spartan setting of a prison in Mississippi. The end of the film should bring the viewer to question what he has done with his life and how much he has depended on \"props\" for a meaning to his own life. Many who submitted comments compared \"Life\" with \"The Shawshank Redemption,\" but a more likely comparison is \"Cool Hand Luke,\" which starred Paul Newman in a similar story also set in a Mississippi prison. The comic gags, such as the warden's curvaceous daughter, were taken from \"Cool Hand Luke.\" Overall, the film is rich in meaning as it shows how life in general is an interweaving of comedy and tragedy. Another comparison story is \"Death Comes for the Archbishop\" by Willa Cather, in which Ms. Cather shows how two priests, also in a spartan situation (a desert pastorate in New Mexico) and without the usual trappings of success, make meaningful lives for themselves while living sacrificially for others.",
         "Ray Gibson and Claude Banks get involved with a local crime boss and end up doing some work for him to make up for their debts. However when running moonshine across the Bible belt they encounter racism and eventually get framed for a murder by a racist sheriff. Sentenced to life they experience a range of things but eventually find that friendship can overcome many things during a course of a life. I approach this with a certain amount of caution. I expected a buddy comedy full of the heavy-handed comedy that usually comes with a Murphy or a Lawrence movie. Admittedly it does have a certain amount of that \u0096 but in small amounts it can be quite funny. The story doesn't create as good a relationship between Ray and Claude as it could have done, and ignores any brutality that may occur, but it still manages to have poignant things to say about friendship. The `old' makeup isn't as good it could have been but it passes. The story isn't anywhere near Shawshank but it tries to cover similar ground. Although it never reaches that level it is a lot more involving than you'd expect it to be. It may always come down to Murphy and Lawrence bickering but it isn't just that. My only criticism of it is that it appears to have been more fun to make than it is to watch \u0096 the outtakes are the funniest bit in the whole thing. Murphy and Lawrence are not the most subtle of performers but they do OK here. They do better at the comedy than the serious elements but both are warm enough to convince. The cast is made up of a range of reasonable black actors and comedians \u0096 Bernie Mac is funny, but again this feeds into the image that the real fun was had in the making of the film rather than the actual film itself. Interesting side roles are given to Ned Beatty, R. Lee Ermey, Bokeem Woodbine, Rick James, Lisa Nicole Carson and Heavy D. Overall this isn't just a buddy comedy and it isn't quite as meaningful as Shawshank. It falls in-between and, while it's not a classic it's still quite enjoyable to watch \u0096 even if all the best bits are in the outtakes at the end.",
         "Excellent, simply brilliant. One of the most funniest films I have seen. I have seen this so many times and I don't understand why it has only scored a 6/10! I always think that story lines that cover a large chunk of the characters' lives are always very interesting as the audience gets to see how they evolve and change with age. All of the characters pull this off - over the years we see Ray (Eddie Murphy) change from a young confident individual who never gives up hope to a tired old grouchy man who is hard of hearing; but its never sad. Even when the characters are riddled with old age the humour is still fantastic."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Imagine Entertainment",
         "Universal Pictures"
      ],
      "summaries": [
         "In the mid-1990s, two inmates bury the burned bodies of two lifers at Mississippi's infamous Parchman Farm; a third old-timer relates their story. They'd served 65 years for a murder they didn't commit, framed by a local sheriff while buying moonshine whiskey for a Manhattan club owner to whom they owed money. In flashbacks we see this odd couple thrown together (Ray is a fast-talking con man, and Claude is a serious man about to start work as a bank teller), the loss of Ray's watch (sterling silver, from his daddy), the murder and trial, the hardships of Parchman, and the love-hate relationship of Claude and Ray as they spend 65 years bickering and looking for a way to escape.",
         "The story of two criminals (Eddie Murphy and Martin Lawrence) who discover the value of life after being sentenced to life imprisonment."
      ],
      "budget": 75000000
   },
   "movielensId": 2587,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-16",
      "dvdReleaseDate": "2000-06-06",
      "directors": ["Ted Demme"],
      "runtime": 108,
      "movieId": 2587,
      "title": "Life",
      "mpaa": "R",
      "actors": [
         "Eddie Murphy",
         "Martin Lawrence",
         "Obba Babatundé",
         "Nick Cassavetes",
         "Bernie Mac",
         "Michael Taliferro",
         "Anthony Anderson",
         "Barry Shabaka Henley",
         "Miguel A. Núñez",
         " Jr.",
         "Bokeem Woodbine",
         "Lisa Nicole Carson",
         "Sanaa Lathan",
         "Brooks Almy",
         "Hal Havins",
         "Poppy Montgomery",
         "Venus DeMilo"
      ],
      "imdbMovieId": "0123964",
      "originalTitle": "Life",
      "genres": [
         "Comedy",
         "Crime"
      ],
      "youtubeTrailerIds": ["_0LkiWPmnns"],
      "plotSummary": "Two men in 1930s Mississippi become friends after being sentenced to life in prison together for a crime they did not commit.",
      "tmdbMovieId": 6522,
      "avgRating": 2.97343,
      "releaseYear": "1999",
      "numRatings": 1035,
      "posterPath": "/c9phL8FXuL7i15CrjQH5PfM60NB.jpg"
   }
}