{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0143261",
      "video": false,
      "title": "Friends & Lovers",
      "recommendations": [32456],
      "backdrop_path": "/6OxFToLTKLtFyRYUri64zelVlLm.jpg",
      "revenue": 94633,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "David",
               "gender": 2,
               "credit_id": "52fe4b56c3a36847f81fecef",
               "name": "Danny Nucci",
               "profile_path": "/q1KztDGVWkVzbKYlj5GAoojpQc4.jpg",
               "id": 8540,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jon",
               "gender": 2,
               "credit_id": "52fe4b56c3a36847f81fece7",
               "name": "Stephen Baldwin",
               "profile_path": "/w2nZjBsEsjboQDZJXEkysuGgue4.jpg",
               "id": 9045,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Ian Wickham",
               "gender": 2,
               "credit_id": "536301490e0a261df8000f11",
               "name": "George Newbern",
               "profile_path": "/kUFci5BzhMyx3ZNQEvpauRmpMyT.jpg",
               "id": 59222,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Keaton McCarthy",
               "gender": 2,
               "credit_id": "536c676d0e0a2647cb00d160",
               "name": "Neill Barry",
               "profile_path": null,
               "id": 97315,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Hans",
               "gender": 2,
               "credit_id": "536c67d20e0a2647d100cbbd",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Motel Clerk",
               "gender": 0,
               "credit_id": "536c67970e0a2647c400d34f",
               "name": "Ivo Lopez",
               "profile_path": null,
               "id": 1317808,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Richard 'Richie' Wickham",
               "gender": 2,
               "credit_id": "536c67500e0a2647d400ce40",
               "name": "David Rasche",
               "profile_path": "/9qDHYBJViTtFeGbErb2bQwj6u4F.jpg",
               "id": 33533,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Tree Lot Owner",
               "gender": 0,
               "credit_id": "536c67b30e0a2647d800d17c",
               "name": "Josi K. Waksman",
               "profile_path": null,
               "id": 1317809,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b56c3a36847f81fece3",
               "name": "George Haas",
               "profile_path": null,
               "id": 941809,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "536c68130e0a2647d400ce5d",
               "name": "Neill Barry",
               "profile_path": null,
               "id": 97315,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "536c68260e0a2647db00cd93",
               "name": "George Haas",
               "profile_path": null,
               "id": 941809,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "536c68350e0a2647ce00cb90",
               "name": "George Haas",
               "profile_path": null,
               "id": 941809,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "536c68510e0a2647cb00d16e",
               "name": "Gregory Cascante",
               "profile_path": null,
               "id": 43517,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "536c68680e0a2647c400d360",
               "name": "Josi W. Konski",
               "profile_path": null,
               "id": 49453,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "536c687d0e0a2647c800d568",
               "name": "Juan J. Llauro",
               "profile_path": null,
               "id": 1317811,
               "department": "Production",
               "job": "Line Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.964533,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 114719,
      "vote_count": 6,
      "budget": 0,
      "overview": "Friends for ten years, a group of twenty-somethings head for the ski slopes as guests of Ian's father. (Ian and dad are estranged because dad worked too many hours when Ian was a lad.) Dad has something to say, but Ian won't listen. Meanwhile, David is gay and virginal; Ian's business partner, Keaton, is unhappy that his sister Jane is pregnant with no plans to tell the father; Lisa is everybody's pal and no one's lover; John, stuck in adolescence, is always on the make. He brings German-born stunner, Carla, and promptly loses her affection to Hans, a fast-talking ski instructor. David meets Manny: they have chess in common. Soon, surprises abound as relationships take new turns.",
      "similar": [],
      "original_title": "Friends & Lovers",
      "runtime": 103,
      "poster_path": "/5zh1PQPN7dl8BX2zdaEYyiNRNXp.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "C.E.O. Films",
            "id": 23036,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Laguna Entertainment",
            "id": 23038,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-16",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "... can you tell the difference?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["George Haas"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Neill Barry",
         "George Haas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0143261/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMDExNzU3MF5BMl5BanBnXkFtZTcwNzM3NTc0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Stephen Baldwin, Danny Nucci, George Newbern | See full cast and crew »"],
      "reviews": [
         "\"Friends And Lovers\" Trashed by every critic, and deservedly so. This comedy features the oddest tone of a feature film in some time. It's silly, it's deeply dramatic, it's sexually explicit, it's shockingly amateurish... It's everything! Stephen Baldwin, Allison Eastwood, Danny Nucci, George Newbern, David Rasche, and Claudia Schiffer head the cast of friends who gather at a ski chalet during the holidays. The share life lessons, deep secrets, and raging hormones over the course of two days. It's real easy to see why actors would want to be in this. \"Friends\" is the type of film that's very actor friendly. Director George Haas lets his cast have free reign over their performances, often resulting in self-conscious acting. I was drawn to this for two reasons, Schiffer being the first. I was curious about her acting (this being her second starring role, the first in a Able Ferrara film that has yet to find American distribution - actual proof that there is a God). Needless to say, she stinks. She just doesn't have the chops for the big screen. The other reason I attended this was for Robert Downey Jr's hilarious performance as a German ski instructor named Hans. He's the lone bright spot in this bizarre film. Some dramatics between Newbern and Rasche work well too, they just seem from a different movie. The locations are nice, and the technical credits are appropriate. Plus when isn't it a good thing to see a schlocky old fashion 1987 ski montage complete with squealing guitars? Anyone? This wasn't terrible to sit through, but it is a bad film. Just one of those movies that come around that makes you think just how much blow was passed around to get it made.------ 3",
         "Gees, what a film. Basically, a lot of friends (and enemies?) on a skiing holiday togheter. The result of the film is pretty much that all the wrong people end up in bed together. You wouldn't think this would make a good film, but it does! At least I think so. It's a complicated movie, but still it doesn't require much thinking. (hm...) Most of the thinking cosists of trying to keep all the different characters apart. Personally, I think this is a basic case of \"we're-on-holiday-so-we-can-do-what-we-like\" and maybe it's not the best plot ever. Still, you can't help but enjoy it when Claudia's character dumps her arrogant, but good-looking, boyf. for Robert DJ's rather silly (but charming) character. Sends out a message that looks don't really matter. Any guy (or girl) who's ever wanted anyone \"outta their league\" probably feels the same way. So, in my opinion, a GREAT film... Sorry other people don't feel the same way.",
         "With a cast like this, you figure the film shouldn't be that bad, but believe me it is. The cast are fighting a losing battle from the start, Robert Downey Jr, should kick himself for getting wrapped up in this film, and as for his accent, the Bavarians have probably put a Fatwa out on him. Claudia Schiffer, shows some potential, but the gag that she falls for a guy with the line \"Have you ever considered being a model?\" is so thin, it makes Twiggy look over weight. Alison Eastwood also shows potential, but again drowns in the watery story. If this was a kids report card, the phrase 'Can do much better' would be the the one that stands out",
         "This is not supposed to be Citizen Kane. It's a fluff piece. If you're locked up on a rainy day--or better yet, in a cabin during a winter snowstorm--with a couple of friends, some rum & a board game, it doesn't hurt to toss this on in the background, if for no other reason than to watch RDJ's fine derrière, easily the best part of this whole thing. Having said that, the one thing, if nothing else (and seriously, I'm not doing that much of a review here anyway...), that needs to be pointed out to the several people who have commented on RDJ's \"bad\" German accent--it's intentional. His accent is supposed to be cheesy like that because he's from New Jersey, not Germany. If that accent was supposed to be spoken by a genuine German character, bet your rear that Downey would have nailed it. It's a silly little bit of comedy that's not intended to be Shakespeare, and if you can just look at it that way, and try to enjoy the scenery, i.e. RDJ's man-tastic buns and the mountains, it's not a bad little flick, and it's mildly entertaining.",
         "Ok, ok, this is not a masterpiece. There are thousands of \"good\" movies and this one is certainly not one of them. But come on! If you rent a video like this you are NOT expecting any intellectual experience or to see award-winning performances (fine, you don't expect to see pointless frontal nudity, either. I've got to give you that). \"Friends and lovers\" was perfect to help me spend two hours of my time I had nothing better to do with. If that's your case, then rent the video - it can be funny of you don't expect too much.",
         "Friends and Lovers is a meandering and pointless story about a half dozen depthless characters finding love and sex in a luxury ski lodge. The characters don't seem to have any past but thanks to a talented product placement director, they do have very expensive cars and clothes. Tedious themes (son estranged from father, insensitive Lothario who can't find love) aren't helped any by a gay story line that suggests the writer has never met a gay person in his life. In an industry where producers have to struggle to piece together the funding for a film like \"The Opposite of Sex\", its upsetting to see such a waste of human effort and money as \"Friends and Lovers\".",
         "I have to admit I actually liked this movie. Once I got pass the very pathetic first 10 minutes or so, the sometimes extremely banal dialogues and jokes and the painfully predictable and stereotypical everybody-gets-what-they-wanted ending, \"Friends And Lovers\" comes out as a fairly decent movie about, well friendship. Plus I enjoyed Robert Downey's character a lot and got to see Suzanne Cryer's right boobie. Besides being very sexy and attractive she also delivered the best performance in the movie(the weeping scene). It is sort of weird to write yourself a scene to show your penis, but hey, whatever rocks Neill Barry's boat. I wondered how they chose the actor(is there an audition for these things), it turned out he was dying to show his pride. If you watch it on TV you just might get pass the bad points and enjoy the movie for what it has to offer; some funny and touching moments, full frontal male nudity, some female nudity, Claudia Schiffer almost nude(not my type, but still) and a decent list of celebrity names you thought you'd never see in this type of movie. 6/10",
         "Read that as 'Wee tah did.' Robert Downey Jr. has a disgusting, fake German accent, and the rest of the movie is worse. I did manage to finish the movie, but I didn't see every scene because I was rolling my eyes continuously. Every line in the movie was superficially 'acted,' if you can call people facing the camera while engaging in a monotonous, boring dialog acting. Save your money.",
         "What can I say but that I agree with J.C., this one was bad. Generally, Robert Downey, Jr. is a good actor. He was very good in \"Restoration\" and was funny in \"Two Girls and A Guy.\" But in this movie he was terrible, he didn't even fake the German accent well. Stephan Bladwin was also in this film. I enjoyed his performance in \"The Usual Suspects\" and liked him in \"Fled\". But in this movie, he was just no good. Perhaps if the screenplay was even close to decent this movie could have been o.k., but that's really pushing it. Badly acted, badly written, and badly directed. This movie violated most of the laws of movie making.",
         "This movie rocked, fun from start till the end, it starts off as having you think it will be a sex fest,but the plot takes many turns and twists. Very funny and Robert Downey Jr. plays a funny German guy who ends from New Jersey. A good film to rent if you having some friends over for a game of pictionary or Twister. Check this one out!"
      ],
      "genres": [
         "Drama",
         "Romance",
         "Comedy"
      ],
      "productionCompanies": [
         "C.E.O. Films",
         "Laguna Entertainment"
      ],
      "summaries": ["Friends for ten years, a group of twenty-somethings head for the ski slopes as guests of Ian's father. (Ian and dad are estranged because dad worked too many hours when Ian was a lad.) Dad has something to say, but Ian won't listen. Meanwhile, David is gay and virginal; Ian's business partner, Keaton, is unhappy that his sister Jane is pregnant with no plans to tell the father; Lisa is everybody's pal and no one's lover; John, stuck in adolescence, is always on the make. He brings German-born stunner, Carla, and promptly loses her affection to Hans, a fast-talking ski instructor. David meets Manny: they have chess in common. Soon, surprises abound as relationships take new turns."],
      "budget": 0
   },
   "movielensId": 2589,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-16",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["George Haas"],
      "runtime": 103,
      "movieId": 2589,
      "title": "Friends & Lovers",
      "mpaa": "R",
      "actors": [
         "Danny Nucci",
         "Stephen Baldwin",
         "George Newbern",
         "Neill Barry",
         "Robert Downey Jr.",
         "Ivo Lopez",
         "David Rasche",
         "Josi K. Waksman"
      ],
      "imdbMovieId": "0143261",
      "originalTitle": "Friends & Lovers",
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "youtubeTrailerIds": ["RbPKyuqQON8"],
      "plotSummary": "Friends for ten years, a group of twenty-somethings head for the ski slopes as guests of Ian's father. (Ian and dad are estranged because dad worked too many hours when Ian was a lad.) Dad has something to say, but Ian won't listen. Meanwhile, David is gay and virginal; Ian's business partner, Keaton, is unhappy that his sister Jane is pregnant with no plans to tell the father; Lisa is everybody's pal and no one's lover; John, stuck in adolescence, is always on the make. He brings German-born stunner, Carla, and promptly loses her affection to Hans, a fast-talking ski instructor. David meets Manny: they have chess in common. Soon, surprises abound as relationships take new turns.",
      "tmdbMovieId": 114719,
      "avgRating": 2.76486,
      "releaseYear": "1999",
      "numRatings": 370,
      "posterPath": "/aic0M3cGf8X5GBaXdMRyWBJaU4A.jpg"
   }
}