{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "hoodlum",
         "id": 160488
      }],
      "imdb_id": "tt0113552",
      "video": false,
      "title": "Kiss of Death",
      "recommendations": [
         31000,
         12518,
         11517,
         9546,
         4997,
         12395,
         400,
         11384,
         10427,
         11074,
         4911,
         9455,
         9430,
         6723,
         40480,
         6,
         12647,
         8860,
         8688,
         10410
      ],
      "backdrop_path": "/sn90ttZdVehr8SArkvEwXax7nsG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jimmy Kilmartin",
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089ceb",
               "name": "David Caruso",
               "profile_path": "/i251LGpMkOeOqRmqlCpKkNoGdni.jpg",
               "id": 16560,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Calvin Hart",
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089cef",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Little Junior Brown",
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089cf3",
               "name": "Nicolas Cage",
               "profile_path": "/fW37Gbk5PJZuXvyZwtcr0cMwPKY.jpg",
               "id": 2963,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Bev Kilmartin",
               "gender": 1,
               "credit_id": "52fe443bc3a36847f8089cf7",
               "name": "Helen Hunt",
               "profile_path": "/ws1ClG9BBUIVLZRYTNKconJn9Sy.jpg",
               "id": 9994,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Rosie Kilmartin",
               "gender": 1,
               "credit_id": "52fe443bc3a36847f8089d25",
               "name": "Kathryn Erbe",
               "profile_path": "/eB6H3pSImCJLBq83eH3oy8s9yrL.jpg",
               "id": 49824,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Frank Zioli",
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089d29",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Ronnie Gannon",
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089d2d",
               "name": "Michael Rapaport",
               "profile_path": "/i39bAISjAUWYlXZZA0wmjYWnZGf.jpg",
               "id": 4688,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Omar",
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089d31",
               "name": "Ving Rhames",
               "profile_path": "/8nS83GOu0iqxjL2Oj2DgwkAceFQ.jpg",
               "id": 10182,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Big Junior Brown",
               "gender": 2,
               "credit_id": "539a0421c3a3682acb0003eb",
               "name": "Philip Baker Hall",
               "profile_path": "/eH7GrivSuLEvhJL85qPkhNvg3E7.jpg",
               "id": 4492,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Jack Gold",
               "gender": 2,
               "credit_id": "539a042fc3a3682ac8000391",
               "name": "Anthony Heald",
               "profile_path": "/nRXLwMuuv5nUbEz2sFLtEU4zUYg.jpg",
               "id": 16293,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089cfd",
               "name": "Barbet Schroeder",
               "profile_path": "/jDMy62PR1pfD0dX5E0K3Q6SI1wm.jpg",
               "id": 23393,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089d03",
               "name": "Barbet Schroeder",
               "profile_path": "/jDMy62PR1pfD0dX5E0K3Q6SI1wm.jpg",
               "id": 23393,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe443bc3a36847f8089d09",
               "name": "Eleazar Lipsky",
               "profile_path": null,
               "id": 49823,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe443bc3a36847f8089d0f",
               "name": "Richard Price",
               "profile_path": "/lGGzvyUTDwhzSrY5PyW63tvy9cg.jpg",
               "id": 2989,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe443bc3a36847f8089d15",
               "name": "Trevor Jones",
               "profile_path": "/86HjonjMXwcDyOlpaQW1SVR9CXh.jpg",
               "id": 7020,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089d1b",
               "name": "Luciano Tovoli",
               "profile_path": null,
               "id": 49069,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe443bc3a36847f8089d21",
               "name": "Lee Percy",
               "profile_path": null,
               "id": 2866,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.687531,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6071,
      "vote_count": 100,
      "budget": 40000000,
      "overview": "Jimmy Kilmartin is an ex-con living in Astoria in the New York City borough of Queens, trying to stay clean and raising a family with his wife Bev. But when his cousin Ronnie causes him to take a fall for driving an illegal transport of stolen cars, a police officer named Calvin Hart is injured and Jimmy lands back in prison. In exchange for an early release, he is asked to help bring down a local crime boss named Little Junior Brown.  Jimmy remarries and attempts to renew a relationship with his child. But he is sent undercover by Detective Hart to work with Junior and infiltrate his operations. As soon as Little Junior kills an undercover federal agent with Jimmy watching, the unscrupulous district attorney and the feds further complicate his life. He must take down Junior or face the consequences.",
      "similar": [
         186,
         9462,
         1607,
         9519,
         18747,
         10002,
         11701,
         15542,
         2069,
         9917,
         11613,
         2252,
         4982,
         8961,
         7516,
         553,
         470,
         156022,
         245891,
         276907
      ],
      "original_title": "Kiss of Death",
      "runtime": 101,
      "poster_path": "/uQjFpAEF6GUIKW46sbndWtsEQSl.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1995-04-21",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Barbet Schroeder"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Eleazar Lipsky",
         "Ben Hecht"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113552/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTY2MTMyMjM0OV5BMl5BanBnXkFtZTcwNzQ0OTUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: David Caruso, Samuel L. Jackson, Nicolas Cage | See full cast and crew »"],
      "reviews": [
         "I liked this movie and I am quite surprised by the low IMDb user voting for this film. It is certainly not Academy Award material. But the story, character development, and the acting performances are really above average. I am not a big fan of television dramas. I have never seen a single episode of CSI. I thought NYPD Blue was very overrated, except for Dennis Franz. However, I think that David Caruso is a much better movie actor than he gets credit for. This one is definitely worth seeing. It is not a stupid high-action movie like Armageddon. However, it does have some very intense and well staged scenes that will keep action movie fans happy.",
         "Ex-con Jimmy Kilmartin agrees to drive a truck of stolen cars as a favour to a friend. Whilst on the job he gets caught but refuses to role over on the others involved. Whilst in prison his wife is killed in a car crash and Jimmy leaves prison, bitter but with a determination to move on. However NYPD officer Calvin wants to use Kilmartin to get close to Little Junior Brown and get evidence to shut him down. This was one of several vehicles that was planned to turn David Caruso from a TV hit to a big screen star - as we know, it didn't work out that way. However the story is pretty solid, it doesn't break new ground and there's nothing outside of the usual crime thriller plot to surprise you but it's really quite good. At times it's a little dull because it is so straight forward but it's mostly entertaining. Caruso, for all his current lack of success, is actually very good. The problem is that he's good by doing the same \"NY Irish tough but fair\" role that he did in NYPD Blue, King of New York, Bodycount and most films he's done! It's good but I don't think he can do anything else. Jackson has presence as he always does and the support cast is really well filled out with people like Helen Hunt, Stanley Tucci, Rapaport, Philip Baker Hall, Ving Rhames. Nicolas Cage's Little Junior is a mixed bag. At some points he is effective but for the most part he's horribly OTT and hammy. His character is full of ticks and eccentricities that at the end of the day that's all Cage has to do. Overall this is a solid thriller with no surprises. Caruso fans (like me) will like it regardless because it's Caruso doing his usual role. But others may not be so easily made to overlook the weaknesses.",
         "David Caruso and a beefed up Nicholas Cage star in this remake of the 1947 noir film..In this one David Caruso, on parole, is talked into doing a job to help his cousin, when he is busted, his cousin takes advantage of him and his wife Helen Hunt. Caruso is offered a deal by a slippery DA with political aims, played with the usual excellence by Stanley Tucci. Caruso then discovers the meaning of the word politics and seeks revenge on those who betrayed him. An underrated movie that didnt get much press when released (probably due to Caruso's controversial exit from NYPD Blue) this film builds the suspense and keeps you involved and interested.Caruso, the Cagney for the 90s, plays his part great with a tension you can feel. All the other roles are played well in this sleeper movie.. Well recommended Kiss of Death rates a 8",
         "Kiss of Death boasts an impressive cast, authentic locales, and a gritty, accessible storyline, but it still comes across as an asthmatic remake of the film noir classic. Nobody \"stars\" in KOD; rather, David Caruso, Helen Hunt, Nicholas Cage, Samuel L. Jackson, Ving Rhames, and Kathryn Erbe all put in good, workmanlike performances that just don't catch fire. I enjoyed Kiss of Death ten years ago when I rented it. What made it enjoyable again was seeing people I had forgotten about--a young Hunt, commanding on screen, an obscure Jackson, Cage almost unrecognizable, and Caruso, long before he decided to trade in acting for the ridiculous posturing he does on the boneheaded CSI: Miami. Yet, the movie never really jells. We know the story well so we expect something better to make KOD stand out. \"Workmanlike\" just isn't enough. I'd still recommend it, though. The freshness of the talent might be enough for you. And Cage, ripped and psychotic is so different from his breezy action roles of the last half decade. You may find a gem here!",
         "Everyone agrees that the casting was marque. And that it has great source material. But I feel it gets a bum rap with critics. And Nicolas Cage was exactly what the film needed. I thought so then and I think so now. Color, flash, and style. Something out of the ordinary to give it some desperately needed weight. And Cage makes weight. Literally. That is the strongest look I had seen since Stallone did \"First Blood, Part II\". Cage is a physical bull and it's impressive. I wouldn't have recognized him if I hadn't seen the trailer with his name on it beforehand. If you never saw this, see it. For no other reason than to be scared of Nic Cage. I was.",
         "Barbet Schroeder hands us his scariest impression of a violent world since the \"Self Portrait\" of Idi Amin. Richard Price's script clicks along like a BQE on hardboiled rails. Both are aided by distinctive, urgent characterizations from just about everybody. This is at least as good as the original. There are, of course, many guilty pleasures here. Helen Hunt hit by a truck in the second reel, Michael Rapaport right-crossed to death, and Sam Jackson shot in the face are what genre pictures are all about. It's Godzilla stomping Tokyo, mortar fire at Omaha Beach, a Peacemaker laying out the sheriff - the lurid fulfillment of forbidden wishes. But a good B movie must earn these cheap thrills: a good B movie must entertain the higher faculties to deserve tumbling skyscrapers and spurts of blood. None of Michael Bay earns its shocks. Most of Eastwood doesn't; some of Friedkin, half of Tony Scott, most of Ford, and nearly all of Hawks do. Having proved his ability in the American idioms of the courtroom drama (\"Reversal of Fortune\") and, to a lesser extent, the stalker picture (\"Single White Female\"), here Schroeder demands efficiency and style of every technician and artist and delivers a sharp crime thriller. This works because it's the best kind of melodrama. The characters do not make absurd decisions; the plot suits the story, instead of the other way around, as in almost every Schwarzenegger vehicle. No decision is without consequence. Nobody wins, until the very silly last five minutes, by which time the real climax has already occurred. These are bad people in bad situations behaving, for the most part, very badly. There is pathos without sentiment, virtue without idealism, sacrifice without honor. Chiefly there is redemption without cynicism. Ben Hecht would approve. Henry Hathaway would not recognize it as proper American film-making. Perhaps it isn't. David Caruso is as good as he is capable of being in the central role, and the character's plight is sympathetic enough. Caruso is always competent, but hanging a whole film around his neck is a bad call because he's hard to like. (For best use of Caruso, see \"King of New York\" and \"Session 9\".) So it's Nicolas Cage's movie in spite of his own deficiencies. Cage's forte is light comedy; he is naturally brilliant at it, but not at the virile heroic stuff he makes all his money on. No matter how big he gets or how hard he stares, his Little Junior isn't as creepy as Widmark's little Tommy Udo. Still Cage's character's unpredictable behavior and inflated physical presence are enough to overpower most of the performances sharing screen time with his. The support puts in a good day's work, though - Hunt is less affected than usual, Jackson less cartoonish, Stanley Tucci less pretentious. They all have Price to thank for credible motivation and clever things to say. They should also thank Schroeder for not being Roger Spottiswoode, Joel Schumacher or George Cosmotos.",
         "I think the best way to approach this movie is on its own terms rather than as a remake of the 1940s film. In any case, it merely follows the general story outline of the earlier picture. What makes it altogether new is Richard Price's screenplay, Barbet Schroeder's direction, a great lineup of actors, and location shooting in some of New York City's seediest and most squalid areas. Along with the great locations, what really provides the atmosphere is Price's writing. Once again he shows his down to the ground knowledge of the characters, mannerisms, and lingo of the creeps and hoodlums in the big city underworld, and the law enforcement people who deal with them. And there is also Price's trademark offbeat humor. While the earlier film gave us Richard Widmark as a really scary psycho, in this later film Richard Price has given us Little Junior Brown, a bulked-up killer with a child's mind and an abiding faith in the nostrums of New Age philosophy. What a delight when Little Junior, fresh from committing murder, asks our hero to take the next day off so they can get together and \"talk about life and stuff\"! Or when he urges him to settle on an acronym that will give shape to his identity. (Little Junior's is B-A-D--for \"Balls, Attitude, Direction.\") Nicholas Cage is often accused of playing over the top, but in the case of Little Junior, over the top is the way to go. There are also good performances by Stanley Tucci and Samuel L. Jackson. Tucci excels in portraying charming snakes. When he leers and sneers, it is impossible to keep from watching him. This movie was really very enjoyable.",
         "Ben Hecht's original story had enough strength to be carried over into this successful remake, aided by a strong cast. I'm not sure how much the modernization of the script adds to it, but it's worth seeing. Caruso is a con who, out of concern for his family, rats on some friends when the prosecutor promises him freedom. Things go legally awry and Caruso finds himself and his family being hunted by the chief thug (Nicholas Cage) while the police (Stanley Tucci and Steven Jackson) provide a simulacrum of protection. Finally Caruso takes matters in his own hands, confronts Cage in a night club, and is beaten like hell before the cops arrive and put things back in order. The original script depicted what now seems like an old-fashioned model of the justice system. Good cops vs. bad guys, with the good guys hampered by laws that are too lax. This is brought up to date in that EVERYBODY is corrupt in one way or another, with a few exceptions. Caruso is family-oriented, though a con, and his family and Jackson have their hearts in the right place. But the agents of social control -- both federal and state -- are petty and bickering. Tucci, the head cop, isn't really interested in bad guy Cage. He wants a federal judgeship or judgehood or judgedom. It's a much more cynical model of the justice system. The brutality quotient is cubed. Somebody's brains get shot out and splattered all over somebody. Or a suspected snitch is beaten to death with fists and his blood splashes against the wall. I think the earlier version is superior. For one thing, it was an original, not a copy. And some of the performances here don't measure up to the original's. Kathryn Erbe -- great name in German, by the way -- is a pretty and talented actress but she does not exude the winsome cheerful devotion of the sexy, stupid, beautiful Colleen Gray. David Caruso is a more convincing New Yorker than Louisvilleian Victor Mature was, but his performance is understated compared to Mature's nervous clumsiness. Some of the roles are just differently interpreted. Where Brian Donleavy was a stolidly ethical prosecutor, Stanley Tucci is transparently reptilian. Who would believe Tucci when he claims to be \"a man of honor\"? And, of course, there is nothing in this remake that looks even vaguely like Richard Widmark's Tommy Udo in his wolfman wig, nor any scene quite as terrible as Widmark's pushing the old lady strapped in her wheelchair down the stairs. At the time THAT was more shocking a scene that all the current bloodshed and poundings put together. That's what I mean by \"original.\" Still, not a bad movie on its own.",
         "This is not the 1947 film but a 1995 re-make of the famous gangster flick of the same name. While the classic film had one brutally nasty guy, this one has a whole cast full of them....too nasty, frankly. I watched this once and was fairly interested in it. A couple of years later, took a second look and found it so sleazy and I couldn't finish it. David Caruso, who obtained a lot more fame in television shows than movies, still was interesting for me to watch as he played Victor Mature's old role. Caruso is one of the better actors I've seen when it comes to expressing his emotions just by his facial looks. It seems fashionable to knock him, but I've always been a fan of his work. Nicholas Cage plays Richard Widmark's psycho character \"Tommy Udo\" but is called \"Little Junior Brown\" in this film. Personally, I liked Widmark's performance and character much more. A lot of people, especially 20-somethings, like these modern tough films with brutal characters and tons of profanity, but the characters in this movie were so nasty that the film never really caught on with anybody. It certainly had one thing going for it: a very good cast that also included Samuel L. Jackson, Michael Rapaport, Ving Rhames, Stanley Tuccki, Helen Hunt and Kathryn Erbe. To summarize: it's not that bad: it just has too hard an edge to it.",
         "Here we have ourselves a case of a fairly not wide known director, but not necessarily a bad director. Out of his sleeves we can find 'Desperate Measures', a movie about an autistic child, which was fairly good, and 'Murder by Numbers' which, also, was decent. Here we have a crime thriller, a remake, and a pretty good movie. In this movie we can find Nicolas 'Put-the-bunny-back-in-the-box' Cage as a pawn in a crime gang who suddenly finds himself on top of the food chain, Ving Rhames as a drug addicted big boss (also of a gang) and finally David Caruso, as an unlucky bastard who finds himself in much trouble and is way in over his head. The movie begins with Caruso, a man who was in jail for hijacking cars, being free. He vows to remain safe and live a fair live. He has a family, works for the living, and doesn't do the things he shouldn't be doing anymore. And then his brother comes in on one night. Without spoiling, I will stop here and say that from this point on, this very scene already starts tearing apart the life he built here. Just see the movie, it's worth it. I'm serious. I mean, it was for me. Caruso's path of suffering continues through the movie, while the other characters seem to continue to wreak him a little more, but while still giving room to motivate him to go on. The ending, for me, was satisfying and realistic. The movie starts off quickly but loses it's pace between the third and second act, which cripples the otherwise delightful experience with the movie. It has some brutal scenes that are well placed and not too exceeded. There is much suspense throughout and it keeps you guessing on how it will end. Some scenes are just downright exciting, because the characters are so well characterized you'll just look forward to when Cage and Caruso will meet each other again. Cage's acting as well as Caruso's is superb in this one, with the first being like a kid on sugar despite suffering from asthma, and the latter always being the wrong man at the wrong place. Cage once again shows that he is made to put down roles of near-crazy people, really. Remember Face/Off? You get the same dose of craziness here. And, honestly? I love it. I just love how he does that unique kind of craziness that only he can do. As if you would mix sugar with a touch of drugs. You get the idea. It's a great movie, suffering a bit from the little usual mistakes. But don't miss out on it. Who knows? Maybe you'll find another cheesy Nicolas Cage line to make another internet meme out of!"
      ],
      "genres": [
         "Action",
         "Crime",
         "Thriller"
      ],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Jimmy Kilmartin's an ex-con who's trying to go straight. But he can't say no to a quick driving job because his so called friend's life is threatened. The job is for Little Junior Brown, a violent and powerful villain. When things go wrong, Jimmy is left to do the time, and his whole life is turned upside-down, but if that wasn't enough, the cops won't leave Jimmy alone when he gets out... They want 'Little Junior'",
         "A reformed convict goes undercover with the help of an angry detective to ensnare a psychotic mobster."
      ],
      "budget": 40000000
   },
   "movielensId": 259,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-04-21",
      "dvdReleaseDate": "2004-06-01",
      "directors": ["Barbet Schroeder"],
      "runtime": 101,
      "movieId": 259,
      "title": "Kiss of Death",
      "mpaa": "",
      "actors": [
         "David Caruso",
         "Samuel L. Jackson",
         "Nicolas Cage",
         "Helen Hunt",
         "Kathryn Erbe",
         "Stanley Tucci",
         "Michael Rapaport",
         "Ving Rhames",
         "Philip Baker Hall",
         "Anthony Heald"
      ],
      "imdbMovieId": "0113552",
      "originalTitle": "Kiss of Death",
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["gzF3Z9IObMU"],
      "plotSummary": "Jimmy Kilmartin is an ex-con living in Astoria in the New York City borough of Queens, trying to stay clean and raising a family with his wife Bev. But when his cousin Ronnie causes him to take a fall for driving an illegal transport of stolen cars, a police officer named Calvin Hart is injured and Jimmy lands back in prison. In exchange for an early release, he is asked to help bring down a local crime boss named Little Junior Brown.  Jimmy remarries and attempts to renew a relationship with his child. But he is sent undercover by Detective Hart to work with Junior and infiltrate his operations. As soon as Little Junior kills an undercover federal agent with Jimmy watching, the unscrupulous district attorney and the feds further complicate his life. He must take down Junior or face the consequences.",
      "tmdbMovieId": 6071,
      "avgRating": 3.06807,
      "releaseYear": "1995",
      "numRatings": 2086,
      "posterPath": "/uQjFpAEF6GUIKW46sbndWtsEQSl.jpg"
   }
}