{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "activism",
            "id": 213971
         },
         {
            "name": "hospital visit",
            "id": 215059
         }
      ],
      "imdb_id": "tt0123923",
      "video": false,
      "title": "Jeanne and the Perfect Guy",
      "recommendations": [],
      "backdrop_path": "/qum8SmlCSPNhGYRnmAlDe0UWoCa.jpg",
      "revenue": 13936,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Olivier",
               "gender": 2,
               "credit_id": "52fe44ccc3a368484e037911",
               "name": "Mathieu Demy",
               "profile_path": "/f1e9ZAhnnsHnwhIFyJsp2xa80jv.jpg",
               "id": 64751,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jeanne",
               "gender": 1,
               "credit_id": "52fe44ccc3a368484e037915",
               "name": "Virginie Ledoyen",
               "profile_path": "/t9TdJUerLsUD766Q2dN9tJ4dRCG.jpg",
               "id": 19163,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "François",
               "gender": 0,
               "credit_id": "563d58029251411867000ec7",
               "name": "Jacques Bonnaffé",
               "profile_path": "/omETyIWs4pPtiWL6R6c2VQxV7po.jpg",
               "id": 5082,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "563d5816c3a3681b5e0275bd",
               "name": "Valérie Bonneton",
               "profile_path": "/sgCXut1t8MEI00sx699TdiLTAwt.jpg",
               "id": 54324,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44ccc3a368484e03791b",
               "name": "Olivier Ducastel",
               "profile_path": "/aHL0qEasSybjiIVri6WEVctBMra.jpg",
               "id": 5066,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "563d57b49251416cd8001780",
               "name": "Olivier Ducastel",
               "profile_path": "/aHL0qEasSybjiIVri6WEVctBMra.jpg",
               "id": 5066,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563d57c292514129fe01abc6",
               "name": "Jacques Martineau",
               "profile_path": "/5WSELi82AoBHP8hMZsskVjg68Pc.jpg",
               "id": 5067,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "563d57cac3a3681b4b02670f",
               "name": "Jacques Martineau",
               "profile_path": "/5WSELi82AoBHP8hMZsskVjg68Pc.jpg",
               "id": 5067,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.639271,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 25512,
      "vote_count": 4,
      "budget": 0,
      "overview": "Jeanne, a receptionist at a travel agency, is looking for the love of her life. She thinks she has finally found it with Olivier. However, Olivier reveals he has AIDS and disappears from her life after her profession of love and confession of infidelity.",
      "similar": [
         1024,
         24420,
         1259,
         276,
         19913,
         1643,
         226,
         44564,
         17612,
         38,
         979,
         28178,
         489,
         13,
         1903,
         86331,
         46705,
         627,
         68718,
         332872
      ],
      "original_title": "Jeanne et le garçon formidable",
      "runtime": 93,
      "poster_path": "/hQQR7qlFeEd1WsYBeU9BrGVdC8m.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [],
      "release_date": "1998-04-22",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Olivier Ducastel",
         "Jacques Martineau"
      ],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Olivier Ducastel",
         "Jacques Martineau"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0123923/",
      "coverLink": null,
      "actors": ["Stars: Virginie Ledoyen, Mathieu Demy, Jacques Bonnaffé | See full cast and crew »"],
      "reviews": [
         "With \"Jeanne and the perfect guy\" (1998), we can be grateful to the duo Olivier Ducastel/Jacques Martineau for a thing: having lent credibility again to French musical. A cinematographic genre whose golden age was in the sixties but which had somewhat sunk into oblivion at the end of the twentieth century. It is the story of Jeanne (Virginie Ledoyen) who works as a receptionist in a travel agency. She lives a simple life and waits for the love of her life. She is persuaded that she found him with Olivier who also shows love for her. But he disappears overnight. He has his reasons: he is HIV positive. But Jeanne persists. She absolutely wants to spend her life with him. Given that Olivier is HIV positive and his days are numbered, it is probably Jeanne who is right. We can see it: the film-makers have chosen a delicate and bleak topic. However, we couldn't attribute the two quoted topics to the presented treatment. Indeed, Ducastel and Martineau's work is bursting with joy of living and loving. It contains ravishing songs which often come out of the blue but they integrate well into the plot. There's also a luminous photography with sparkling colors, a light making. In the content and form, it is a beautiful tribute to Jacques Demy's universe that the two authors offer us. Besides, Olivier's role is held by the latter's son: Matthieu Demy. The problem of AIDS is tackled without sentimentality and the film-makers avoid useless pathos. They also succeed in creating emotion in front of Matthieu's life broken by this terrible disease. As for Virginie Ledoyen, she confirms all the good we can think of her. With all that's been previously said, we can conclude by saying that \"Jeanne and the perfect guy\" is a light and shiny movie which enables to believe in love and in happiness. It would also reconcile anyone with life. The two authors have surely been satisfied with the result because they won't hesitate to use a second time, their magic system: pessimist topic/optimist treatment for their next movie: \"Drôle de Félix\" (2000). For this film, AIDS will still be at the background but musical will have given ground to the road-movie. Of course, this movie will reach the same goal as \"Jeanne\": to believe in love and happiness.",
         "Jacques Demy's \"Young Girls of Rochefort\" 1968 is an all-time favorite musical of mine. When I had the chance to watch \"Jeanne and the Perfect Guy\" 1998 (aka \"Jeanne et Le Garcon Formidable\") co-directed by Olivier Ducastel and Jacques Martineau (also co-wrote the dialog and song lyrics), I was amazed at how good they have delivered this musical in contemporary setting. From the very beginning note the music started with the opening credits, and the unabashed hint that this is a musical - a minute into the credit roll, there's a glimpse of a passing man in front of Jeanne the receptionist, turned around holding out his hand and pulled a lady partner towards him as in a dance, I felt that this is a dedication to Demy's films. The music and arrangements by Philippe Miller include a wide variety approach: from the beginning number by the janitorial crew that contains Middle Eastern flavor, to tango beat on a dancing floor, to a lively marching rhythm inside an Oriental food café with customers twirling with Jeanne and sister Sophie, to duet tender loving exchange between a frank intimate scene of Jeanne and Olivier (portrayed by Virginie Ledoyen and Mathieu Demy - Agnes Varda and Jacques Demy's son), to the up-tempo song with samba, percussion and 'cha-cha' beat delivered by the bookstore lady, and solo declaration of love by Jeanne in the hospital, by the messenger on the stairs outside of Jeanne's apartment door, in addition to the (\"Umbrella of Cherbourg\" like) literal singing of subjects at hand - a total of fourteen numbers in 1 hour 33 minutes, not forgetting even in a dejected mood of Jeanne's, the delightfully fun duet by sister Sophie and husband Julien's \"On Credit\" that made our heroine smile again, and the sprightly steps and tune of \"Until Tomorrow.\" This is an ambitious musical, bold in its endeavor to 'sing out' on current issues, of HIV AIDS concerns, gays and straights, love and lovingness, family and sisterly support, and in contemporary settings as meeting on subways, walking and talking along the river, going up the steps of a slope, in the kitchen or in a hospital. Besides screenplay and direction, music and choreography, cinematography and editing, costume and set design, central to the success of this film is Jeanne portrayed by Ledoyen - she absolutely shines from beginning frame to end. Her face, expressions, body movements, and her energy are infectiously fetching. As Jeanne's mother pointed out, \"You have to want love to find it.\" And when you do, as this film depicted, one would also have to learn to let go of one's expectations in order to give and freely receive love. Glad to note that the English subtitles were by Ian Burley, who also did the brilliant translations for \"Bread and Tulips\" 2000 (aka \" Pane e Tulipani\"), \"The Last Kiss\" 2001 (aka \" Ultimo Bacio, L'\"), (Tom Tykwer's) \"Heaven\" 2002 and more recently, \"Kings and Queen\" 2004 (aka \"Rois et Reine\").",
         "It's not so much the story itself but its presentation that shines in this film. It's a kind of modern operetta in which the characters sing their roles, reminiscent of \"Umbrellas of Cherbourg\" (although not as good). The singing is thin and whispery but it does have an intimacy that seems to suit the characters. The story is simple: Girl meets lots of boys,sleeps with lots of boys, then chooses an absolute stranger whom she believes is the perfect guy. But in truth no-one is perfect.A chance meeting of this guy (Mathieu Demy) on the Metro with an exchange of fleeting glances begins a romance that blossoms quickly until........ The mood of the film changes suddenly, but their love never wanes. Some of the light-hearted scenes are well-remembered e.g. the song and dance of the Algerian office cleaners, the out-burst of the Chinese snack bar assistant, the philosophy of the lazy plumber. I liked especially the courier who delivers letters and packets each day to \"Jet Tours\". His miming is great and he turns a minor role into a memorable event. The outdoor scenes are a delight - the promenade along the Seine and the steps to Sacre Coeur. These scenes plainly tell us we are in romantic Paris where love springs eternal. Much of the film's charm is due to Virginie Ledoyen who plays the sexy, highly spirited girl in search of perfection. For those in a romantic mood, this film is the one,",
         "When this film first came out in France, a friend reported that this represented the sad state of the declining French film industry, that it had now resorted to making AIDS musicals. With government subsidies, of course. In fact, the film was a little better than I had been expecting, although I'll withhold comment on the plot outline: Beautiful, bra-less, teen nympho has trouble meeting men. Her latest boyfriend has HIV. You'd think she'd be the one with HIV given her lifestyle, but, sorry, I'm withholding comment on the plot. The boyfriend with AIDS story was much much more movingly and believably handled by the late Cyril Collard in his multi-César-winning \"Les nuits fauves\" (1992) with Romane Bohringer as the pretty brunette girlfriend on that occasion. This film about Jeanne and her new beau tries hard to be charming. You have to give it some credit for sheer nerve: the production number with singing, dancing janitors, or the plumber warbling his Toilet Song. (The French chanson has been ailing too, much like the film industry.) There was a minor scandal in the US some years ago. The government had spent thousands of dollars on a toilet. Whether thousands are better spent on a toilet or on a song about toilets, we'll allow history to decide. French musicals have always been an acquired taste, a taste which still eludes this viewer. To me, this one is less brittle than Jacques Demy's innovative, understated, pop-operatic \"Les parapluies de Cherbourg\" (1964) with Catherine Deneuve -- considered an unassailable masterpiece in France, or so I understand -- and less dumb than Demy's final \"Trois places pour le 26\" (1988), with Yves Montand and Mathilda May. Of those two leads, he can be described as « une des dernières légendes vivantes » while she is « considérée comme la meilleure et la plus belle des actrices françaises de la jeune génération », at least according to the hyperbole of the video release, using the glowing terms one usually reserves for films known to be failures. This film in fact carries on the Demy family tradition, with Jacques's son Mathieu playing the boyfriend. There are a couple of songs here which would not have seemed out of place in \"Les parapluies\" -- e.g. the one about choosing jam or honey for breakfast (sacré bleu!) -- but in general the film was not an out-and-out embarrassment. The lyrics aside, the actual score is inferior to \"Les parapluies\", although the composer tried for greater variety -- the Chinese restaurant ditty about Tsing Tao beer goes for an Oriental flavour. The film's greatest attraction is its star(let), Virginie Ledoyen, who is rarely off the screen. She doesn't have a great range, but there's some potential there. And a nice left profile. She certainly looks very sleek in a red cheongsam. Teenage North American males would probably like Virginie, assuming they ever tire of Jennifer Love Hewitt.",
         "The two finest nude scenes in the Ledoyen canon are the highlights of this otherwise nearly unbearably well-meaning and preachy French musical concerning a slatternly young beauty and her many boyfriends, one of whom is stricken with AIDS and who, despite not showing any outward symptoms other than occasionally being out of breath (a common enough occurrence when chasing the delicately flouncing Virginie through Paris) is doomed by the film's earnestness to sport a MAY EXPIRE BEFORE FINAL CREDITS tattoo across his none-too-pretty Gallic forehead (my girlfriend was quite disappointed with Demy's looks, but I must reserve comment as my eyes were consistently directed elsewhere)."
      ],
      "genres": [
         "Drama",
         "Musical",
         "Romance"
      ],
      "productionCompanies": [
         "Canal+",
         "Centre National de la Cinématographie (CNC)",
         "Les Films du Requin"
      ],
      "summaries": ["Jeanne has an appetite for love that can never be satisfied. Lovers at every corner of her life she is still in search of that \"one\". When a impromptu tryst on the subway with Olivier gives her butterflies like never before she finally finds herself in love, truly in love. Yet she continues her affairs but now with a realization that they are not what she wants, she wants Olivier. Olivier reluctant to continue the romance with Jeanne for fear of hurting her or worse yet her seeing him at his worse. Olivier reveals to Jeanne he has AIDS from a bad needle during his heroine use. This however does not scare Jeanne off and her love for him turns her into a new person who wants to care for him, but that is not what he wants. The two share a common friend that is an AIDS Activist but they don't know it. Then Olivier because severely ill and Jeanne professes her love and her infidelity. That is the last she ever sees of Olivier. She returns to the hospital to find he has left with his parents, and left no forwarding address. Much time passes, and still the pain of her lost love resides. She knows of nothing of his whereabouts and no way to find him, until she bumps in to a friend that accompanied Olivier on the subway when she met him. Then she finally learns her love has passed on. A musical about the french governments lack of concern and role in the dire conditions of their citizens and about the different classes in society from the immigrant workers, soldiers, upper class and economic dependency on credit cards. A story that covers all walks of life and the pains of love."],
      "budget": 0
   },
   "movielensId": 2591,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-04-22",
      "dvdReleaseDate": "2000-07-24",
      "directors": [
         "Olivier Ducastel",
         "Jacques Martineau"
      ],
      "runtime": 93,
      "movieId": 2591,
      "title": "Jeanne and the Perfect Guy",
      "mpaa": "NR",
      "actors": [
         "Mathieu Demy",
         "Virginie Ledoyen",
         "Jacques Bonnaffé",
         "Valérie Bonneton"
      ],
      "imdbMovieId": "0123923",
      "originalTitle": "Jeanne et le garçon formidable",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Jeanne, a receptionist at a travel agency, is looking for the love of her life. She thinks she has finally found it with Olivier. However, Olivier reveals he has AIDS and disappears from her life after her profession of love and confession of infidelity.",
      "tmdbMovieId": 25512,
      "avgRating": 3.05128,
      "releaseYear": "1998",
      "numRatings": 39,
      "posterPath": "/hQQR7qlFeEd1WsYBeU9BrGVdC8m.jpg"
   }
}