{
   "tmdb": {
      "original_language": "it",
      "keywords": [],
      "imdb_id": "tt0110570",
      "video": false,
      "title": "The Monster",
      "recommendations": [
         12776,
         43645,
         10846,
         27670,
         10599,
         38366,
         56020,
         37775,
         38262,
         50531,
         56370,
         41610,
         38397,
         41668,
         41663,
         43646,
         38396,
         25606,
         44268,
         30459
      ],
      "backdrop_path": "/553IdU87M8ZYQ3aNVbqJLIoR9la.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Loris",
               "gender": 2,
               "credit_id": "52fe4451c3a368484e01c5bd",
               "name": "Roberto Benigni",
               "profile_path": "/v2C2JVPVRg0zwgrI0yqeanUxVLa.jpg",
               "id": 4818,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jessica Rossetti",
               "gender": 1,
               "credit_id": "52fe4451c3a368484e01c5c1",
               "name": "Nicoletta Braschi",
               "profile_path": "/KVd8Wj5PXrZ4XhtnWzbdqvQLIu.jpg",
               "id": 9235,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Paride Taccone, le psychiatre",
               "gender": 2,
               "credit_id": "577cfc8d925141111d006b7a",
               "name": "Michel Blanc",
               "profile_path": "/6sLalr8OqR6WMlxzBR4C6OrsrnU.jpg",
               "id": 21175,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jolanda Taccone",
               "gender": 1,
               "credit_id": "577cfd849251413b3e00293c",
               "name": "Dominique Lavanant",
               "profile_path": "/4yGFrY1IAJiWdY3VG1bQK2Sm231.jpg",
               "id": 1972,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Roccarotta",
               "gender": 2,
               "credit_id": "577cfdd4c3a368427e002cce",
               "name": "Jean-Claude Brialy",
               "profile_path": "/g3kkYcAvq90tALMErxmdAIcIXsE.jpg",
               "id": 24299,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pascucci",
               "gender": 2,
               "credit_id": "59a6c79dc3a368275600dba7",
               "name": "Ivano Marescotti",
               "profile_path": "/8rpl4Sj43nlqn2WxN1xo0ZaRqx.jpg",
               "id": 15918,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "il professore di cinese",
               "gender": 0,
               "credit_id": "59a6c7be92514112ef00e866",
               "name": "Franco Mescolini",
               "profile_path": "/ltYfyulyKzHC2rbWpfOY4gcgxXX.jpg",
               "id": 1724150,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "commissario Frustalupi",
               "gender": 2,
               "credit_id": "59a6c7d0c3a36827bd00e9fd",
               "name": "Laurent Spielvogel",
               "profile_path": "/ccXfj4h0NeRPLCAC8GPD6QKCLoK.jpg",
               "id": 115686,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "il condomino distinto",
               "gender": 0,
               "credit_id": "59a6c7e1c3a36827f900d353",
               "name": "Massimo Girotti",
               "profile_path": "/bz4jZxPSe00wKze4vF6aGpIcKn6.jpg",
               "id": 18340,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "antiquario",
               "gender": 2,
               "credit_id": "59a6c7f3c3a36827d300ec56",
               "name": "Vittorio Amandola",
               "profile_path": "/dE6WnX5yh550Q4PIGGvWU4uHu7S.jpg",
               "id": 203457,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Claudia",
               "gender": 0,
               "credit_id": "59a6c900925141129300eb26",
               "name": "Luciana Pieri Palombi",
               "profile_path": null,
               "id": 1879355,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4451c3a368484e01c5c7",
               "name": "Roberto Benigni",
               "profile_path": "/v2C2JVPVRg0zwgrI0yqeanUxVLa.jpg",
               "id": 4818,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "590dc6dc9251414e8500ea66",
               "name": "Carlo Di Palma",
               "profile_path": "/i9bOfpLR2V68gGYv0yqJkjF6qiT.jpg",
               "id": 15194,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.16481,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 22826,
      "vote_count": 182,
      "budget": 0,
      "overview": "A vicious serial sex killer is on the loose, and landscape gardener and shop-window outfitter Loris is the prime suspect, thanks to his unfortunate habit of getting caught in compromising situations (for which there is always a totally innocent explanation that the police fail to spot). Undercover policewoman Jessica is assigned by eccentric police psychologist Taccone to follow Loris and ...",
      "similar": [],
      "original_title": "Il mostro",
      "runtime": 112,
      "poster_path": "/frhnN2qMeZ3qoAjKiL0ieIlonj7.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "IRIS Films",
         "id": 7042,
         "origin_country": ""
      }],
      "release_date": "1994-10-22",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roberto Benigni"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Roberto Benigni",
         "Michel Blanc"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0110570/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2ODAwNDc2NF5BMl5BanBnXkFtZTcwMDMyMzIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Roberto Benigni, Michel Blanc, Nicoletta Braschi | See full cast and crew »"],
      "reviews": [
         "This is one of the funniest movies I've ever seen. Benigni is a genius when it comes to comedy, the modern Charlie Chaplain. After `Life is Beautiful', this is probably his best movie. A sex-crazed serial killer is on the loose and has already killed a dozen women. When the goofy Loris (Benigni) is mistaken for the killer and the local police launch a 24-hour surveillance of his crazy life, the laughs begin and never end. Benigni's real-life wife, Nicoletta Braschi, also in `Life is Beautiful', stars in this one as well as a police officer who goes undercover to catch him in the act. She sublets (illegally) his apartment and movies in with him to try to entice him into his sexual psychosis. When normal life fails, she then must dance around the apartment naked shoving her genitalia right into his face. It's a little on the edge, but in the tradition of Benigni comedy, is still quite tasteful. 17 and over only though. Sexually explicit scenes all over the place, but no nudity.",
         "What an excellent movie 'Il Mostro' is! It is absolutely certain that it will destroy you from the first moment. Make sure you watch it in Italian audio though. A lot of Benigni's (as of course any other actor's) performance comes out of projecting his lines and Benigni always sounds hilarious. And don't expect to see 'scary movie' here. This is quality comedy, with great script and a genius actor. Don't miss it! 9/10",
         "I was told by my Doctor to laugh a lot as it will help me improve my situation. Well, after watching Robert Benigni in the Movie\" Il Mostro,\" I could not Stop laughing. I have seen it more than 6 times, and each time is like watching it for the first time. Wonderful prescription for anyone needing to laugh a lot. I intend to buy the film soon, for it is my prescription for good health. In fact i plan on watching it again with my family very soon. The acting by all in the Movie was done very professionally. The scenes, in itself was very good. I especially enjoyed the scene on the scaffold and the one where everyone was chasing him down the street.",
         "What Einstein did for the world of science Benigni has done for the world of cinema. Since being captivated and devastated (in a brilliantly sad way) by \"La Vita e Bella\", I've been eager to seek out other Benigni films. I was thrilled to find \"Johnny Stecchino\" and \"Il Mostro\" on the shelves of my local video store. Both are works of comedic genius! While Benigni employs very similar formulas and plot devices (mistaken identity, physical humour and petty theft) the plots are vastly different but both equally hilarious. \"Il Mostro\", as well as \"Johnny Stecchino\" will have you laughing within a minute of pressing play on your VCR. Rent these both for a night of back to back gut-busting fun!",
         "This is one of the funniest movies of all time. Roberto Benigni is the definitive next-generation Charlie Chaplain. His use of camera angles to get the dummies in compromising positions, depending on how it's seen, and the way he can include so many different characters so effectively in the movie is amazing. My favorite scene is when the Detective is analyzing Loris when Loris leaves the restaurant. \"Now he is punishing it - 'No, not in public'\" and \"And we can all see what this means.\" If you want to see it, I've seen the film at Jumbo video in the foreign films section. I advise that you go out and rent it IMMEDIATELY! I gave it a ten, and so will you.",
         "Roberto Benigni's \"The Monster\" is a laugh-a-second romp that is truly reminiscent of the greater works of Charles Chaplin, Buster Keaton and Peter Sellers. Benigni stars as a loser who works for a mannequin company who unwittingly becomes caught up with the authorities who believe that he is the titled character, a man who has been raping and murdering women all over the city. Naturally, Benigni is not the guy they are after but all the strange coincidences make him appear to be the criminal. Undercover beauty Nicoletta Braschi (Benigni's real-life wife) tries to trap Benigni by enticing him in the most creative ways. The film is great fun, but it is very adult-oriented with sexual situations and innuendos galore. Overall \"The Monster\" is a really great film and Benigni fans will love it more than most others. Plot resolution late hurts the film, but not enough to keep it from being very successful overall. 4 stars out of 5.",
         "Before Roberto Benigni proved himself capable of masterpieces with \"Life is Beautiful\" (why did he follow it up with that awful \"Pinocchio\"?), he made a number of zany comedies, including \"Il Mostro\" (called \"The Monster\" in English). After a string of murders, the police suspect builder Loris (Benigni). I should identify that they only have circumstantial evidence, but boy is it some funny circumstantial evidence! Having \"learned\" about this man, Jessica Rossetti (Nicoletta Braschi) agrees to help nail him. And let me tell you, what she does to try and provoke him into attacking her...well, let's just say that you can't possibly prepare yourself for how funny it is! A hilarious movie in every sense.",
         "Il Mostro by the Italian master, Roberto Benigni, is his funniest among some very funny movies. The earlier comment to watch it in Italian with subtitles is essential. Some of the humour, both spoken and physical slapstick is a little hard at first for North Americans. Once you fall into the Italian sense of humour it will have you on the floor, Roberto Benigni is the twenty first century's Charlie Chaplin. It is optimum for enjoyment if you have lived in Italy, but not required. Go to Italy afterwards! Like Felleni and the Bertolucci brothers, Benigni reflects a lot of what is intrinsically Italian. Il Mostro is about a mix up, but what comedy is not, it is really about Roberto, the words, the way the words are said, the body gestures and his mastery of playing. You can fall in love with his visual poetry... then learn Italian. I also recommend the unsung, underrated, Son of Pink Panther, it gives a new twist to the Sellers' humour. It's all that Sellers was and more, this is the true successor to the Pink Panther series! If you like the style of Il Mostro then try the earlier Johnny Stecchino, it is classic Benigni as well!",
         "the movie is built around Loris, the character played by Roberto Benigni. who delivers best performance. he is 100% belevable in this role. the movie has almost all classic ingredients of a great comedy and they work. Roberto Benigni's character captures that facet of most of us men at some point in our lives. a lazy and not so well organized guy, far from hansom looking, who'd like to have a lot of women and money, but not yet successful with neither, improvising plans and schemes to get them fast and easy, getting himself in trouble instead, and plunging into more trouble the more he tries to sort things out. eventually the police is after him (the police surveying tape is hilarious), as goofy as Benigni's character is, the police match him with style. they dispatch a bait to unleash the monster within, and Loris has to go great lengths to avoid unleashing that monster =)) watch this movie in Italian with subtitles, don't let some lousy dubbing spoil your experience.",
         "While the subject matter of this movie may seem very heavy and not appealing, it is one of the funniest movies. Even though he is a suspect in several awfull crimes, there is hardly anything offensive in this movie. Plus it a has a satisfying ending, leaving nothing wanting. A very bizzare but good flick."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Mystery"
      ],
      "productionCompanies": [
         "Canal Plus",
         "IRIS Films",
         "La Sept Cinéma"
      ],
      "summaries": ["A vicious serial sex killer is on the loose, and landscape gardener and shop-window outfitter Loris is the prime suspect, thanks to his unfortunate habit of getting caught in compromising situations (for which there is always a totally innocent explanation that the police fail to spot). Undercover policewoman Jessica is assigned by eccentric police psychologist Taccone to follow Loris and provide evidence for his arrest - but things don't quite go according to plan..."],
      "budget": 0
   },
   "movielensId": 2593,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1994-10-22",
      "dvdReleaseDate": "1999-10-05",
      "directors": ["Roberto Benigni"],
      "runtime": 112,
      "movieId": 2593,
      "title": "The Monster",
      "mpaa": "",
      "actors": [
         "Roberto Benigni",
         "Nicoletta Braschi",
         "Michel Blanc",
         "Dominique Lavanant",
         "Jean-Claude Brialy",
         "Ivano Marescotti",
         "Franco Mescolini",
         "Laurent Spielvogel",
         "Massimo Girotti",
         "Vittorio Amandola",
         "Luciana Pieri Palombi"
      ],
      "imdbMovieId": "0110570",
      "originalTitle": "Il mostro",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "A vicious serial sex killer is on the loose, and landscape gardener and shop-window outfitter Loris is the prime suspect, thanks to his unfortunate habit of getting caught in compromising situations (for which there is always a totally innocent explanation that the police fail to spot). Undercover policewoman Jessica is assigned by eccentric police psychologist Taccone to follow Loris and ...",
      "tmdbMovieId": 22826,
      "avgRating": 3.57066,
      "releaseYear": "1994",
      "numRatings": 559,
      "posterPath": "/frhnN2qMeZ3qoAjKiL0ieIlonj7.jpg"
   }
}