{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "punk",
            "id": 4470
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "redneck",
            "id": 10250
         },
         {
            "name": "salt lake city",
            "id": 10807
         },
         {
            "name": "hospital",
            "id": 11612
         },
         {
            "name": "breaking the fourth wall",
            "id": 11687
         },
         {
            "name": "bromance",
            "id": 12648
         }
      ],
      "imdb_id": "tt0133189",
      "video": false,
      "title": "SLC Punk",
      "recommendations": [
         13552,
         9685,
         1546,
         9430,
         28054,
         49457,
         45153,
         60994,
         34574,
         27070,
         40562,
         45174,
         16148,
         19033,
         17140,
         51145,
         91101,
         83105,
         44250,
         150889
      ],
      "backdrop_path": "/nhBcLcKUWMQ5h7WO0CzSPPOcPVj.jpg",
      "revenue": 299200,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Stevo",
               "gender": 2,
               "credit_id": "52fe444fc3a36847f808e839",
               "name": "Matthew Lillard",
               "profile_path": "/gJsQkX20g0ABquHqVpBJzMXR2JF.jpg",
               "id": 26457,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bob",
               "gender": 2,
               "credit_id": "52fe444fc3a36847f808e83d",
               "name": "Michael A. Goorjian",
               "profile_path": "/y8yhMiLlNDnaxGpDkhHaj18gtAS.jpg",
               "id": 49424,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Trish",
               "gender": 1,
               "credit_id": "52fe444fc3a36847f808e841",
               "name": "Аnnabeth Gish",
               "profile_path": "/tA2iInfNHuqWvAec0wtnrji0nGw.jpg",
               "id": 49425,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe444fc3a36847f808e845",
               "name": "Til Schweiger",
               "profile_path": "/mRQ9URazBbImeV0NxHZsGS3Px7D.jpg",
               "id": 1844,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mike",
               "gender": 2,
               "credit_id": "52fe444fc3a36847f808e861",
               "name": "Jason Segel",
               "profile_path": "/49zyYG6HSQm76mN1SLmCCzgIN0Y.jpg",
               "id": 41088,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Sean",
               "gender": 2,
               "credit_id": "52fe444fc3a36847f808e865",
               "name": "Devon Sawa",
               "profile_path": "/jur7ijuplTyNWItmXuFhCcUffd6.jpg",
               "id": 50398,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "John the Mod",
               "gender": 2,
               "credit_id": "52fe444fc3a36847f808e869",
               "name": "James Duval",
               "profile_path": "/ydlb3Rp5vkle9codpcfBWxFmUYr.jpg",
               "id": 1582,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Brandy",
               "gender": 1,
               "credit_id": "52fe444fc3a36847f808e86d",
               "name": "Summer Phoenix",
               "profile_path": "/mKBiUY3QxsOK7tYD1j51p8MAUxK.jpg",
               "id": 34543,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Stevo's Dad",
               "gender": 2,
               "credit_id": "570094e3c3a3686e88004157",
               "name": "Christopher McDonald",
               "profile_path": "/wrmn93czsOTrX8KtQuIAEh9PZpR.jpg",
               "id": 4443,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Jennifer",
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e871",
               "name": "Chiara Barzini",
               "profile_path": null,
               "id": 112484,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Chris",
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e875",
               "name": "Kevin Brenznahan",
               "profile_path": null,
               "id": 1282667,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Jamie",
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e879",
               "name": "Christina Karras",
               "profile_path": null,
               "id": 991305,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e84b",
               "name": "James Merendino",
               "profile_path": null,
               "id": 33156,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e851",
               "name": "James Merendino",
               "profile_path": null,
               "id": 33156,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e857",
               "name": "Sam Maydew",
               "profile_path": null,
               "id": 51642,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe444fc3a36847f808e85d",
               "name": "Greg Littlewood",
               "profile_path": null,
               "id": 51643,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 5.146133,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 6396,
      "vote_count": 127,
      "budget": 0,
      "overview": "Two former geeks become 1980s punks, then party and go to concerts while deciding what to do with their lives.",
      "similar": [
         11564,
         40807,
         10312,
         510,
         956,
         244267,
         336843,
         298312,
         378018,
         2142,
         11835,
         806,
         3134,
         37257,
         2163,
         1919,
         313922,
         167,
         6404,
         10843
      ],
      "original_title": "SLC Punk",
      "runtime": 97,
      "poster_path": "/v3Ho0MeyhN5y4itc8Q5YLBHTOhe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Beyond Films",
         "id": 2081,
         "origin_country": ""
      }],
      "release_date": "1998-09-24",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "God bless America... they're going to need it.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Merendino"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["James Merendino"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0133189/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2ODEzNDY5M15BMl5BanBnXkFtZTcwNzM5NDEzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Matthew Lillard, Michael A. Goorjian, Annabeth Gish | See full cast and crew »"],
      "reviews": [
         "I saw this movie for the first time tonight and I must admit, I wasn't expecting much but it left me almost crying in the end, and recommending it to all of my family and friends. I don't claim to know what the 80s punk scene was like, especially in Utah, but regardless of whether punk life was portrayed correctly or not in this movie (I think most of you who bitch about that aspect wouldn't know anyway), it was written extremely well and the acting was just incredible.",
         "If you pick this up at the video store, you'll probably expect the wrong thing: kind of a goofy, teen-oriented, mock angst trip by a couple of overdone punks through Salt Lake City's holy land. That's not even close to the heart of this film, which is smarter and more vital than most. Essentially a monologue by the main character, Steve or Steve-o, SLC Punk starts, ends, and runs with energy and insight, all without the ponderous pronouncements you'll find in most films focused on one character. The central character and his interesting entourage are not the caricatures you see on the box, they're the genuine, multi-dimensional people you went to school with if you were lucky. The visuals are savvy and professional, opening up what could be a stage show to the wider world. A classic experimental 3-D pan shot done with over a hundred one-shot cameras would be hailed as groundbreaking, had this film not been released concurrently with The Matrix. Film hounds will catch the theme and scene parallels with Easy Rider, particularly a drug trip much richer than the exaggerated freak out in that film. Funny, smart, immediately engaging, dangerous, and often more textured and subtle than it appears at first glance, you will understand why SLC Punk (released by Sony Pictures Classics) has such a loyal following. This is the film I wish Kevin Smith had made instead of Clerks. Yes, that's a compliment for Smith, who admits he has grown a lot as a filmmaker, and a mild slam on Clerks, which was what it was -- interesting characters wrapped in a poorly done film.",
         "It's unfortunate that more people have not seen this movie. Well at least people in the 15-28 age range, that is. If you have ANY interest in punk rock and the attitude that comes along with it, you have to see this movie. If you have ever wanted to just tell the world to F*** off, then this is a movie you should see. Granted, it's not for everyone, there are those who may not be able to look past the language and violence, but that's what being punk is all about. I was very impressed by Matthew Lillard in this movie, his performance in the ending of this movie shows just how good a dramatic actor he can be, too bad he's typecast in all those teen movies, not that he isn't great in them.",
         "This film is about anarchy and the whole 1980's punk rock scene with references to many early punk bands such as Sex Pistols and The Ramones. If you're expecting this to be another Matthew Lillard teen flick, you are greatly mistaken. Sure it has its funny parts, but mainly this film survives on great acting by Lillard and Michael Goorjian. Lillard and Goorjian's characters believe that they are the only \"true\" punk rockers in Salt Lake City, Utah and go about their lives liberating against conformity. Their characters, like every punk, need to be different and their main focus in life really is anarchy. Film would have suffered if not for the casting of Lillard and his narration throughout the film was another plus. I recommend seeing it because it is something far different than anything Matthew Lillard has ever done.",
         "I did not expect much from this movie and was pleasantly surprised, and having been to Salt Lake City a few times, I was particularly amused. I was there in 1980, at the outset of the decade in which the movie takes place. That visit turned out to be the one and only time I set foot in a disco club. It is a good thing I didn't run into Stevo and Bob, the twin protagonists of \"SLC Punk!\" They would have kicked my butt because they hate mods, hippies and rednecks. Whether or not to pound on a disco-goer wouldn't even be a question. At one point, Bob asks a British punk band's lead singer why he would never come back to SLC. \"Too bleeding violent,\" says the bruised singer. \"Thank you!\" says Bob. Stevo and Bob are anarchists. Not philosophical anarchists like Kropotkin, Goodman and Goldman (Peter, Paul and Emma), but more like Leon Czolgosz, the guy who assassinated President William McKinley. Except Czolgosz had more direction in his life. Aside from throwing darts at pictures of President Ronald Reagan, Stevo and Bob just get drunk and high. Correction, only Stevo smokes grass while \"Heroin\" Bob is ironically nicknamed because he is afraid of needles and anything stronger than booze. The story is picaresque in both senses of the term: it is about a couple of semi-likeable rogues, and it is less a story than a series of vignettes. I thought that each vignette more or less stood on its own, but there is something of an overarching theme, too. These young men grow up physically if not emotionally. Though angry and feeling not a little betrayed by society, they can't be Salt Lake City punks for the rest of their lives, or can they? The narrator, Stevo, is haunted by the fear that he or Bob or both of them might be the worst thing there is: a poser, a phony punk. This movie also features one of my favorite under-rated actresses, Annabeth Gish, as Trish who runs a head shop. Bob sells himself to her for thirty-six dollars. As decadent as that might seem, there turns out to be something sweet about it, much to Stevo's disgust! Like wearing a blue-green mohawk, \"SLC Punk!\" might not be for everyone, but I mainly enjoyed it. My favorite scene is the one in which Stevo's parents sit him down and try to get him to go to Harvard. What a scathing satire on my self-righteous and self-satisfied boomer generation!",
         "Anyone who has spent time in the American punk underground will find many points of reference in SLC Punk. The film is an amazingly realistic portrayal of the suburban punk subculture. All the issues are here: poseurs, sell outs, authenticity, straight edge, rebellion, boredom...and of course the perennial problem of whether mods and punks can get along! I can't recommend this gem strongly enough.",
         "Matthew Lillard - what a surprise! I have always found him to be annoying, but in this film he was likeable and quite clever. \"Stevo\" is the blue-haired punk son of silly, over-hippified parents who went from mohawk to a more low-key look after graduation. He is obviously not stupid. He uses his audience-addressing monologues to amuse us and let us know exactly what's up, instead of merely whining at us or grinning and nudging us with his elbow. The kid is downright charming. And I appreciate the fact that he actually gets along with his parents, even while fighting against what they want. It's refreshing. I am in his age group (in the movie - 80's teenager) but I am not familiar with punk lifestyle, and now I feel like I have been exposed to something I've always found interesting, but never delved into before. Stevo goes through a bunch of changes and realizations, and by the end decides that you can \"F--k stuff up more from within the system that outside it\". And that being rebellious comes from inside, and not from your haircolor (even though blue hair is still cool). Great message, neat movie. Recommended.",
         "It was a joy to watch this film and see myself and my wife. There we were watching the movie on one of our countless movie channels on our huge cable account while we ate popcorn in bed and she knitted. We were both hard core alternative kids in our youth and somehow ended up living in a high rent condo in Seattle with corporate jobs. The movie pretty much tells the story of every true intelligent punk. Why do you ask? Well, because those of us that were so hard core, were also into CHANGE. And the only way to change the world, is to live IN it. Be a part of it. We laughed at the end when we realized we were both just like the lead character. Anarchy is great for your youth. But anarchy for life is not going to lead you anywhere if you still want to LIVE. Rather, you need to get INSIDE the world to turn it inside out. Bravo. Wonderful little film. High marks.",
         "OK first the disclaimer: Punk rock died the day it was blessed with its moniker, I think somewhere around 1979/1980. I think part of the reason it died was because everyone was trying to strictly define what Punk meant, kinda defeating the purpose. The idea of anyone claiming to be \"punk\" now or at any point during the 90s or even the 80s is patently ridiculous. It's death, however, did serve to allow many people in different places to cadge together their own ideas about what \"punk\" was and reshape their own local counter-culture scene into something somewhat resembling that. Let's face it, the entire idea behind Anarchy is that of Iconoclasm; the destruction of images and false constructs, for example pop culture trends such as PUNK. End disclaimer. I came in as part of the punk revival (2nd wave) in the mid-80s, growing up in a mid-sized Midwestern city. The punk scene was very alive there and I immediately identified with it, but stuck with the non-conformist nature of it rather than filing off into a splinter group and wearing a uniform. This movie recalled a lot of my own experiences, ideas and feelings from that time. Uncomfortably so. Of course there was a lot of BS too, but the BS was part and parcel of the scene since everyone was co-opting \"punk\" into their own little social circles. I didn't learn anything from this movie, which to my mind illustrates its accuracy as a decent, digestible snapshot of what was going on within that world where each of us knew a Heroin Bob, a crazy Belgian Mark, an intense nerdy Mike who just might go off the deep end and start a fight with the cops, a slutty Sandie, and armchair philosophers galore. And of course drugs, booze, filth and bad music. A previous reviewer scolded this film for not following the \"true punk\" philosophy and went on to talk about how the Midwest \"doesn't have a punk scene.\" Wrong. Buddy, reading books or watching videos about the history of that movement won't tell you anything. It was not deep, profound, or incredibly thoughtful. Don't read too much into it.",
         "Which, in this case is a good thing. I've seen the title before, found it vaguely interesting. However, without having heard anything about it, I wasn't going to chunk any money on it. Then it came on cable, so I decided to give it a chance. I've seen Matthew Lillard in about four movies, and so far he has been a single-note actor, always playing the ragingly obnoxious punk. Still, on that one-note he is amazingly convincing and impossible not to watch. Much like Jimmy Stewart or early Arnold Schwarzenegger, building fame on familiarity. Christopher MacDonald gave the best performance I've seen him do as Steveo's dad. Very solid, sympathetic, and even likeable. The movie itself mesmerized far more than I expected. I was transfixed from the beginning to end. Acting and clothes were excellent, not a sour note in the entire lot. Plotting and scripting were very well developed. The movie kept me involved, interested, and ready to buy. Thank you for a great movie."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Beyond Films",
         "Blue Tulip Productions",
         "Straight Edge"
      ],
      "summaries": [
         "Two punks live in Salt Lake City. The film covers their all-day routine. The realism of the character-narrated movie may be discussed. One of the punks gets ill, stays in hospital for three weeks, comes out again. Three parties are covered and one concert including a fight between punks, rednecks and others.",
         "SLC Punk is a film about a couple of kids who become sick of their dull, ordinary life. They make plans to try to change things and create anarchy.",
         "In the early 1980s Stevo and Heroin Bob are the only two dedicated punks in conservative Salt Lake City."
      ],
      "budget": 0
   },
   "movielensId": 2596,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-24",
      "dvdReleaseDate": "1999-10-12",
      "directors": ["James Merendino"],
      "runtime": 97,
      "movieId": 2596,
      "title": "SLC Punk",
      "mpaa": "",
      "actors": [
         "Matthew Lillard",
         "Michael A. Goorjian",
         "Аnnabeth Gish",
         "Til Schweiger",
         "Jason Segel",
         "Devon Sawa",
         "James Duval",
         "Summer Phoenix",
         "Christopher McDonald",
         "Chiara Barzini",
         "Kevin Brenznahan",
         "Christina Karras"
      ],
      "imdbMovieId": "0133189",
      "originalTitle": "SLC Punk",
      "genres": [
         "Crime",
         "Romance",
         "Comedy",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["MsZziQvRWCg"],
      "plotSummary": "Two former geeks become 1980s punks, then party and go to concerts while deciding what to do with their lives.",
      "tmdbMovieId": 6396,
      "avgRating": 3.62271,
      "releaseYear": "1998",
      "numRatings": 1744,
      "posterPath": "/v3Ho0MeyhN5y4itc8Q5YLBHTOhe.jpg"
   }
}