{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "restaurant",
            "id": 1946
         },
         {
            "name": "neighbor",
            "id": 10226
         },
         {
            "name": "dog",
            "id": 15162
         },
         {
            "name": "ring",
            "id": 189093
         }
      ],
      "imdb_id": "tt0120836",
      "video": false,
      "title": "Lost & Found",
      "recommendations": [
         21433,
         42158,
         157036,
         118991,
         18856,
         27993,
         61418,
         76297,
         8014,
         61651,
         46924,
         26014,
         26555,
         24073,
         15513,
         27984,
         40688,
         40876,
         51321,
         35371
      ],
      "backdrop_path": "/d1YTDur6obvF8Zgm1jgWBx1HTfB.jpg",
      "revenue": 100,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dylan Ramsey",
               "gender": 2,
               "credit_id": "52fe47429251416c9106f63f",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lila",
               "gender": 1,
               "credit_id": "52fe47429251416c9106f643",
               "name": "Sophie Marceau",
               "profile_path": "/xrMvKw3bAuCyXKSc4IQIoOPBQZV.jpg",
               "id": 1957,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ginger",
               "gender": 1,
               "credit_id": "52fe47429251416c9106f647",
               "name": "Ever Carradine",
               "profile_path": "/hXuT4YFpD0Fwb7Ez7b3W3KkOhHn.jpg",
               "id": 41557,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Restaurant Patron #2",
               "gender": 0,
               "credit_id": "52fe47429251416c9106f64b",
               "name": "Stephanie Chang",
               "profile_path": null,
               "id": 1034545,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Restaurant Patron #1",
               "gender": 0,
               "credit_id": "52fe47429251416c9106f64f",
               "name": "Neal MacMillan",
               "profile_path": null,
               "id": 1034546,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mark Gildewell",
               "gender": 2,
               "credit_id": "52fe47429251416c9106f653",
               "name": "Mitchell Whitfield",
               "profile_path": "/xvLWnBsTbUmW9KcDkH7pvi5W6v0.jpg",
               "id": 19505,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47429251416c9106f659",
               "name": "Jeff Pollack",
               "profile_path": null,
               "id": 88060,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54889b1ac3a3682d010004c3",
               "name": "J.B. Cook",
               "profile_path": null,
               "id": 1229374,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54889b24c3a3684148001acb",
               "name": "Marc Meeks",
               "profile_path": null,
               "id": 1397386,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54889b2e92514151ff0024c5",
               "name": "David Spade",
               "profile_path": "/tamKFAKdB1Q2mllHYHXxqg3YUXr.jpg",
               "id": 60950,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.731533,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39964,
      "vote_count": 32,
      "budget": 1,
      "overview": "A comedy about finding your true love at any price. Dylan Ramsey resorts to snatching his beautiful neighbor's dog so he can spend time with her while they go on a phantom dog hunt. Succeeding in his plan, Dylan goes to return the pooch, only to discover that it has hidden Dylan's best friend's diamond ring. Written by WARNER BROS.",
      "similar": [
         2898,
         928,
         9598,
         28178,
         424488,
         72207,
         13053,
         35056,
         639,
         927,
         164,
         12230,
         3933,
         9502,
         788,
         9273,
         82693,
         239563,
         345915,
         399174
      ],
      "original_title": "Lost & Found",
      "runtime": 95,
      "poster_path": "/jaylLo7TsJrJriNVGf72Asen1Fr.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Dinamo Entertainment",
            "id": 40675,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Alcon Entertainment",
            "id": 1088,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-04-23",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "A comedy about a guy who would do anything to get the girl of his dreams - and did!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jeff Pollack"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "J.B. Cook",
         "Marc Meeks"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120836/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyNzcwOTIyMl5BMl5BanBnXkFtZTcwMDQ3OTQxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: David Spade, Sophie Marceau, Ever Carradine | See full cast and crew »"],
      "reviews": [
         "After reading all the bad comments, i figured to make my own opinion. Now, i can understand if you didn't like the movie, it happens sometimes (personally, i loved it. it was very cute...which is why i'm weird....i guess)but to say David Spade isn't funny really ticks me off! I think he's super funny,and he's one of the few that makes me laugh (i'm a hard person to make laugh). And give me a darn break, gosh! at least he's trying. GOSH! anyway, the movie was great, like all the other movies he's done. so good job David Spade! you are a truly funny funny person. hmmm you know what?! i don't think i'm weird anymore! you people, are the weird ones the ones that don't think he's funny!",
         "Lost and Found: boy meets girl, boy wants girl, boy kidnaps girl's dog to get close to her, but cheating ex-fiance who wants girl back is determined to foil boy. Amazingly enough this is the actual plot (there is a sub-plot involving a struggling restaurant and a lost ring\u0085). This movie is pure Hollywood formula, with very little originality and several noticeable lulls. What is even more amazing is that this movie is actually funny. In his first solo film outing David Spade does not ask us to make a big leap of faith -Dylan Ramses could have been any character from his SNL days, or Dennis from Just Shoot Me. This translates into some snappy, sarcastic, and funny dialogue. Sophia Marceau as Lila Dubois is gorgeous and vulnerable when she needs to be - exactly what is expected of her. Jon Lovitz also adds a few laughs as a vet with special talents. If you are in for some light humor, without violence, coarse language and nudity (okay, one male behind) this movie may be for you. But hold off until Tuesday night, or better yet, wait the three weeks it will take to move to the second run theaters (of course there's always video).",
         "David Spade is a very funny man, but his brand of comedy gets real old real quick. He admittedly relies largely on his weaknesses to be funny. You know, the sarcasm, the blow-dried hair, the all-around geekiness. Unfortunately, it seems that he never really tried to develop his acting skills. I have laughed myself to tears because of David Spade in his two best movies, Black Sheep and Tommy Boy (in both of which he played virtually that exact same character), but Lost & Found just wasn't amusing to me. Too much reliance on fourth grade humor and not enough of anything new for anything really good to be said of the film. And what was Sophie Marceau thinking?! She went from playing a significant (although relatively small) role in the spectacular 1995 epic Braveheart to this garbage? She must have been pretty desperate. Sure, she looked good in the movie, but the film itself is totally inconsequential and immediately forgettable. David Spade revealed in interviews just before the theatrical release of Lost & Found that he was worried about how the public would react to an actor with his iconography actually getting the girl, and frankly, I think he should have thought about that a long time ago. Watching David Spade kiss someone as stunningly beautiful as Sophie Marceau is like watching a junior high school kid make out with a 30 year old woman. Disturbing, to say the least. The entire film was a jumbled mess of goofy and pointless jokes and bonehead antics, mainly on the part of Spade, as he tries to keep his idiot dog-napping scheme a secret. The gay jokes, the making fun of the foreign guy (whether he deserved it or not), the fact that Spade spends any amount of on-screen time at all running around naked all come together to form a boring comedy that should be blissfully ignored by everyone. Just look at the cover of the movie. David Spade is naked and covering himself with a small dog. This is not something that you want to purposely subject yourself to.",
         "I love laughing when watching films, and this film undoubtedly didn't fail to make me laugh. David Spade is a sellout; he's perfect for the part (he's not very handsome, but his humor makes him adorable), he plays Dylan with ease, and he works with his co-stars with excellent rapport. I say this is one of the film comedies you don't want to miss!",
         "The idea of David Spade being cast in a romantic comedy opposite french beauty Sophie Marceau is a real head-scratcher. But the movie sort of works. Spade plays Dylan, a restaurant owner who's hot for his new neighbor Lila Dubois (Sophie Marceau). Just by looking at the poster of this movie, it's pretty clear that Lila is totally out of Dylan's league. Dylan realizes this when Lila's rich ex-boyfriend, Rene (Patrick Bruel), shows up. So, to impress Lila and make her forget about her ex, he kidnaps her dog and plans to become a hero by returning it to her later. Despite the lack of any real chemistry between Spade and Morceau and the rather silly plot,'Lost & Found' can be entertaining. You just have to suspend belief and not really think while watching. But still I'd take 'Lost & Found' over any other flops by other former SNL clowns, did anyone say 'Corky Romano'. Rating: (6/10)",
         "Unlike most romantic comedies Lost and Found is truly funny. Other romance/comedies tend to focus mainly on the romance and kinda forget to put any comedy in. Lost and Found is very funny, plus it has genuine emotion and romance. David Spade is great as Dylan, and unlike most of his roles, he plays a really likeable guy. He plays the hero you root for,instead of his usual sarcastic jerk character. The jerk in this movie is Patrick Bruel as Renee, Lila's sleazy ex-boyfriend. Sophie Marceau is likeable as Lila,but lacks personality.Artie Lange is hilarious as Spade's unwanted sidekick, Wally. But the true star of this one is David Spade. I loved this movie and highly recommend it to anyone who loves a great comedy w/ a little romance.",
         "A rather pleasant surprise, this comedy is hardly original but has some inspired moments of hilarity if you're willing to suspend a certain measure of disbelief. The writers are a little too blatant in their attempts at a \"There's Something About Mary\" (which came out the previous year) style romp and it takes a while to get used to seeing Spade as the romantic leading man, but once you're over that hump, the movie is a lot of fun. The film is not a classic and those who don't have a taste for raunchy humor should definitely stay away, but there are many worse comedies out there these days. Actually, one of Spade's better solo efforts.",
         "I thought this movie was pretty funny and one of David Spade's finer moments in his career. I'm not a huge fan of his(I'm more of a Sandler type guy). But he does some good stuff. Dylan has just fallen in love with his new neighbor, Lila. He can't seem to get her attention though. So he \"dognaps\" her dog and plans to give it back and be a hero. But the dog ate his best friend's wedding present so he has to get it back and hijinks ensue as he must deal with the dog, his restaurant and Lila's ex-boyfriend. This movie had several good things about it. Artie Lange had the funniest scenes. People may call him a Farley-wannabe, but I think he's just as funny as him, if not funnier. Jon Lovitz also has a funny cameo. Good stuff. 8/10",
         "This movie is an exact copy of \"There's Something About Mary.\" Every idiotic scene with the dog is trying to be like Mary. There are scenes where actor David Spade is brushing the dogs teeth and feeding it goldfish. Gee, the dog scenes were never used before. Oh wait, Mary did that. Worst movie of 1999.",
         "My low expectations of this film were met admirably. I cannot tell if it is just me, but they do not seem to be making any comedies lately that are even remotely amusing. Time was that you go catch a comedy and be entertained. Stripes, Caddy Shack, Animal House, Blues Brothers, Airplane, Groundhog Day where have you gone (the way of Joe DiMaggio I fear). Clearly the makers of this latest piece of dribble are unfamiliar with the past and are, quite unfortunately, living in the present. This latest \"masterwork\" is just plain bad. A typical Saturday Night Live Alum offering. Spade offers 90 minutes of his not-so clever quips and mixes in some unrealistic romance with a woman who would not give Spade the time of day. Everything was telegraphed. There were no surprises. What we get is boy meets girl, boy does something stupid to woo girl (stealing her dog), boy competes with some arrogant stud for girl, and boy gets girl in the end. Add some stupid animal high-jinx and there you have it, a flat D minus."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Alcon Entertainment",
         "Dinamo Entertainment"
      ],
      "summaries": [
         "A comedy about finding your true love at any price. Dylan Ramsey resorts to snatching his beautiful neighbor's dog so he can spend time with her while they go on a phantom dog hunt. Succeeding in his plan, Dylan goes to return the pooch, only to discover that it has hidden Dylan's best friend's diamond ring.",
         "Dylan Ramsey is a restaurant owner looking for the girl of his dreams. His new neighbors, Lila Dubois is a French cellist pursuing a spot in the L.A. Philharmonic whose pushy ex-fiancée, Rene, shows up to win her back. Dylan can handle the ex-fiancée, it's his four-legged competition that has him stumped. So he does what any man desperate for a date would do... kidnaps her beloved pooch, Jack, volunteers to help his distraught owner with the search and plans to produce the lost doggie in time to reap the gratitude (and a date?) from Lila. But things start to misfire when the dog eats an anniversary ring Dylan was given to hold by his restaurant partner and a jealous Rene figures out Dylan has kidnapped the dog.",
         "In order to impress his beautiful French neighbor, Dylan Ramsey dognaps her pet pooch so he can return him and become a hero. Unfortunately, things do not work out as planned."
      ],
      "budget": 13000000
   },
   "movielensId": 2597,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-23",
      "dvdReleaseDate": "1999-10-05",
      "directors": ["Jeff Pollack"],
      "runtime": 95,
      "movieId": 2597,
      "title": "Lost & Found",
      "mpaa": "PG-13",
      "actors": [
         "David Spade",
         "Sophie Marceau",
         "Ever Carradine",
         "Stephanie Chang",
         "Neal MacMillan",
         "Mitchell Whitfield"
      ],
      "imdbMovieId": "0120836",
      "originalTitle": "Lost & Found",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["HUNgL4jTPeQ"],
      "plotSummary": "A comedy about finding your true love at any price. Dylan Ramsey resorts to snatching his beautiful neighbor's dog so he can spend time with her while they go on a phantom dog hunt. Succeeding in his plan, Dylan goes to return the pooch, only to discover that it has hidden Dylan's best friend's diamond ring. Written by WARNER BROS.",
      "tmdbMovieId": 39964,
      "avgRating": 2.54286,
      "releaseYear": "1999",
      "numRatings": 525,
      "posterPath": "/jaylLo7TsJrJriNVGf72Asen1Fr.jpg"
   }
}