{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "airport",
            "id": 822
         },
         {
            "name": "air controller",
            "id": 4545
         },
         {
            "name": "adversary",
            "id": 5440
         }
      ],
      "imdb_id": "tt0120797",
      "video": false,
      "title": "Pushing Tin",
      "recommendations": [
         9452,
         16379,
         12772,
         10442,
         10859,
         10608,
         10694,
         16384,
         2107,
         9440,
         26261,
         8866,
         14628,
         10631,
         14577,
         2565,
         9409,
         9434,
         10478,
         11088
      ],
      "backdrop_path": "/xZseruEjmxMARBfDOYttEVmNMbt.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nick Falzone",
               "gender": 2,
               "credit_id": "52fe45039251416c75048b8b",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Russell Bell",
               "gender": 2,
               "credit_id": "52fe45039251416c75048b8f",
               "name": "Billy Bob Thornton",
               "profile_path": "/gPCPKXh7HvobcrldRGj5QchW34p.jpg",
               "id": 879,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Connie Falzone",
               "gender": 1,
               "credit_id": "52fe45039251416c75048b93",
               "name": "Cate Blanchett",
               "profile_path": "/5HikVWKfkkUa8aLdCMHtREBECIn.jpg",
               "id": 112,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Mary Bell",
               "gender": 1,
               "credit_id": "52fe45039251416c75048b97",
               "name": "Angelina Jolie",
               "profile_path": "/6tocswK39SrSjZIRDaTpVyPxDz8.jpg",
               "id": 11701,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Enzo Sorrento",
               "gender": 2,
               "credit_id": "57052184c3a36802b400009f",
               "name": "Gene Dinovi",
               "profile_path": "/4x6VBpy1erh5WLMprgjFfZePOYe.jpg",
               "id": 76102,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Tina Leary",
               "gender": 1,
               "credit_id": "5a6f9712c3a36847ea005a4c",
               "name": "Vicki Lewis",
               "profile_path": "/vXKKbsYikbLZ3DS1GbCWwMoqDN7.jpg",
               "id": 14723,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Ed Clabes",
               "gender": 2,
               "credit_id": "5a6f971e0e0a26796c006472",
               "name": "Kurt Fuller",
               "profile_path": "/rZUUgDoYTfYwbh87V7E4VVWUPlh.jpg",
               "id": 29685,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Barry Plotkin",
               "gender": 2,
               "credit_id": "5a6f972e0e0a2679690063f9",
               "name": "Jake Weber",
               "profile_path": "/b0Qaj3mE1BfV1areG4EulYDGKHe.jpg",
               "id": 4177,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Ron Hewitt",
               "gender": 2,
               "credit_id": "5a6f9b8dc3a3684800005082",
               "name": "Matt Ross",
               "profile_path": "/tl51oqEpUoa9S5JGbklg9aXd99Q.jpg",
               "id": 11154,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Pete",
               "gender": 2,
               "credit_id": "5a6f9ba4c3a36847e0006044",
               "name": "Mike O'Malley",
               "profile_path": "/9VwiKnQySJN7buvCg53v4NB5Tj7.jpg",
               "id": 87192,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Doctor Freeze",
               "gender": 2,
               "credit_id": "5a6f9bbac3a3684808005f5b",
               "name": "John Carroll Lynch",
               "profile_path": "/5eEGOANKnCCj7FLa3oV28gGYWkW.jpg",
               "id": 3911,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048b9d",
               "name": "Mike Newell",
               "profile_path": "/aE6M4LhrTqtQ8i3WI5QeZAFN4pO.jpg",
               "id": 10723,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048ba3",
               "name": "Glen Charles",
               "profile_path": null,
               "id": 73037,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048ba9",
               "name": "Les Charles",
               "profile_path": null,
               "id": 73038,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048bb5",
               "name": "Alan Greenspan",
               "profile_path": null,
               "id": 57464,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048bbb",
               "name": "Art Linson",
               "profile_path": "/dEtVivCXxQBtIzmJcUNupT1AB4H.jpg",
               "id": 1254,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe45039251416c75048bc1",
               "name": "Anne Dudley",
               "profile_path": null,
               "id": 851,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45039251416c75048bc7",
               "name": "Chris Seefried",
               "profile_path": null,
               "id": 73039,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048bcd",
               "name": "Gale Tattersall",
               "profile_path": "/9KA5irPbb2fygOJ4i23oZW4YiHR.jpg",
               "id": 42119,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45039251416c75048bd3",
               "name": "Jon Gregory",
               "profile_path": "/bjtIqNephAYhm5T47q6YBWWGUMi.jpg",
               "id": 10725,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "55a6d77e92514125da00009c",
               "name": "Michael Flynn",
               "profile_path": null,
               "id": 1382732,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 5.970674,
      "production_countries": [
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12596,
      "vote_count": 144,
      "budget": 33000000,
      "overview": "Two air traffic controllers (John Cusack, Billy Bob Thornton) who thrive on living dangerously compete to outdo each other on several levels.",
      "similar": [
         9737,
         533,
         86130,
         1597,
         37834,
         585,
         594,
         1281,
         10404,
         44214,
         45317,
         9472,
         55721,
         114150,
         1124,
         813,
         8328,
         1370,
         62211,
         1573
      ],
      "original_title": "Pushing Tin",
      "runtime": 124,
      "poster_path": "/A33xLPsTIgT7tN3E5UWfVURFlPV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Taurus Film",
            "id": 20555,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "3 Miles Apart Productions Ltd.",
            "id": 81141,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dogstar Films",
            "id": 17422,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         },
         {
            "logo_path": "/A32wmjrs9Psf4zw0uaixF0GXfxq.png",
            "name": "The Linson Company",
            "id": 4700,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-23",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "A comedy about losing control",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Newell"],
      "runtime": 124,
      "synopsis": "Nick \"The Zone\" Falzone (John Cusack) and his fellow air traffic controllers at New York TRACON pride themselves on their ability to handle the intense stress of being a controller for one of the busiest airspaces in the country, even boasting of the 50% drop-out rate for new additions to the staff who are unable to cope with the pressure. The group is joined by the quiet and confident Russell Bell (Billy Bob Thornton), a veteran of TRACONs in the Western United States. Russell quickly proves to be exceptionally capable of handling the increased workload by using unorthodox and risky methods. Nick feels challenged by the new controller's ability to out-perform him at seemingly every task and warns his supervisor that Bell is a loose cannon, especially after discovering that Russell once stood on a runway to allow himself to be violently propelled by a landing commercial airliner's jetwash. At a supermarket, Nick encounters Russell's despondent young wife Mary (Angelina Jolie), who is sobbing over a grocery cart full of alcohol. In consoling her, Nick ends up back at the Bells' house, where he and Mary both cheat on their respective spouses by having sex. Several days later, Mary informs Nick that she immediately told Russell about the affair, and that the confession has actually improved their marriage. Fearing retaliation, Nick confronts Russell at work, and is confused and surprised by Russell's even-tempered response to the situation. Meanwhile, Nick's wife, Connie (Cate Blanchett), seems to become more and more intrigued by Russell, and Nick becomes increasingly paranoid that Russell will eventually seek revenge by having sex with her. While out of town for his father-in-law's funeral, Nick can't bring himself to lie when a grieving Connie challenges him to say that he has never cheated on her. As their flight home approaches New York, Connie tells Nick that she has indeed slept with Russell. The plane then makes an odd turn, and Nick assumes that Russell is harassing him, or possibly going insane, by purposely directing the plane into a dangerous storm. Soon after going to TRACON to confront Russell, a bomb threat is called in to the center. The building is evacuated as both Nick and Russell volunteer to stay behind to handle the daunting task of landing all the planes on approach in their airspace before the alleged bomb is set to go off in 26 minutes. Successfully routing all but one plane that has lost radio contact, Nick leaves the building as the deadline approaches, while Russell instead remains inside to make contact with the plane by calling one of its passengers via Airfone. Russell is lauded as a hero for making the effort despite the threat, which turned out to be a hoax. Russell abruptly quits and he and Mary move to Colorado. Connie leaves Nick, and his performance at work suffers; the once cocky, boastful controller is sent home after being responsible for two deals (near mid-air collisions) in one shift. After learning that Russell had ordered the diversion of Nick's flight not to provoke him, but to clear a path to make a plane with a medical emergency on board next in line for a landing, Nick impulsively drives out to Colorado to make amends with Russell. Nick seeks his advice on how to get his personal life back in order, but Russell is unable to make Nick understand with words. He instead brings Nick to a runway so that he too can experience being caught in a landing aircraft's turbulence. The two engage in the stunt together, and it has a profound effect on Nick, who thanks Russell. He returns to New York, where he regains his form at work, and reconciles with Connie.",
      "writers": [
         "Darcy Frey",
         "Glen Charles"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120797/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwNDE5MTcwOF5BMl5BanBnXkFtZTcwMjk3NjIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: John Cusack, Billy Bob Thornton, Cate Blanchett | See full cast and crew »"],
      "reviews": [
         "Pushing Tin is somewhat of an odd movie. It's not really funny enough to be considered a comedy, and it's not really compelling/dramatic enough to be considered a good drama. It attempts to pull off both at once, but never really succeeds. The pacing seems a little \"off\". You always expect the movie to pick-up at some point but it never really does. It does manage to move along quick enough that it keeps you awake (barely), but I always found myself wanting the story to move someplace / anyplace to keep me more interested than I was. The story itself primarily centers around the antics of Nick Falzone (John Cusack) and Russell Bell (Billy Bob Thornton), both of whom are air traffic controllers. To it's credit, I've never seen a movie about ATC's, but at the same time Nick and Russell could have been in any other profession and the story would have held up. I sometimes think the writer chose ATC's simply because no one else had done it. The main conflict centers around Nick's desire to out-do Russell. Why he feels the need to do this is never adequately explained. It's also somewhat of a mystery as to what Nick is hoping to accomplish by out-doing Russell. Most of their competitions are basically irrelevant and don't prove much anyway: holding onto a match the longest, shooting freethrows, stacking as many planes into a queue as possible, etc, etc. Their \"battle of wits\", as it were, eventually begins to involve their significant others. Unfortunately the respective wives (Blanchett and Jolie) are seemingly little better than pawns in Nick and Russell's bizarre and meaningless mind game. They don't have much depth of character, nor any wants/desires of their own (beyond the superficial), and, as a result, you don't really care what happens to them. So, in short, Pushing Tin isn't that funny (though I seem to remember it being billed as a comedy) nor is the story engaging enough to be considered a good drama. As noted in my header, it's not a bad movie, but it isn't that good either. Worth a rental if you've seen everything else. I rate it 5/10.",
         "Director Mike Newell's `Pushing Tin' is about the turbulent life of air traffic controllers. Its delightful and thought-provoking screenplay is not intended for the usual `airhead' moviegoer. So please put on your thinking cap for this one. The film stars John Cusack, Billy Bob Thornton, Cate Blanchett, and Angelina Jolie. Thornton and Jolie executed average `plane' performances. However, Cusack and Blanchett rose high with theirs. I do not blame Billy Bob or Angelina for not going up to par with John and Cate. Maybe, Billy Bob and Angelina were way too much in the clouds on and off the set, or maybe it was just that their characters were not fully developed in the script. Even though i am not `Pushing Tin' as one of the best film of 99, it is still one that you should put on the `safe landing looking' section. *** Average",
         "PUSHING TIN (1999) *** Starring: John Cusack, Billy Bob Thornton, Cate Blanchett, Angelina Jolie, and Jake Weber Directed by: Mike Newell Running time: 124 minutes Rated R (for language, and some sexuality/nudity) By Blake French: \"Pushing Tin\" is really nothing more than a very interesting character study that maintains support from its script to succeed. So many movies these days have well-written characters but not the thriving screenplay to back them up. At last, we can enjoy a film with strong comic performances, smart dialogue, and an engaging atmospheric environment. The film stars John Cusack as a hot shot air traffic controller named Nick Falzone, nicknamed \"the zone\" because he is truly the best at his profession. He lives in New Jersey with his happy housewife, Connie, and their son. (who is seldom mentioned or seen.) He has an intense, stressful work life, enjoys having fun with his co-workers, and seems to have a pretty optimistic look at life. All things change, however, when Nick meets his new neighbor, Russell Bell. He's a roughneck motor cycle-driving, quiet and challenging man who really needs to shave. Nick immediately feels tension between Russell and himself. And it just so happens that Russell is also an air traffic controller, making things even more competitive between these two individuals. The two soon begin efforts to try to impress the other, in and outside the job. The personal battles between Nick and Russell soon put each of them in bed with the opposite's wife. Nick is the first to commit adultery when he falls for Bell's highly attractive young wife, Mary. While he meant well, by taking her out for dinner after observing Mary sobbing at the grocery store, when they got home, things obviously got out of hand. The movie is very detailed both in the workplace and in its colorful, intriguing characters. The original tasting flavor of being placed in an air traffic control tower is quite captivating. The characters stare at the plane monitors like children at a television screen while playing a video game. The characters themselves are relevant, ordinary people, which is why they are so easy to relate to. Even though some of their personalities and motives are instantly obvious, we still have lots of fun watching their everyday living style While some comedies would eventually regulate into a formalistic climax and follow predictable events, \"Pushing Tin\" is too smart for that. The ending is happy and light hearted, but it's most of the fun getting there. Mike Newell, director of \"Four Weddings and a Funeral,\" knows exactly what he wants out of the actors here, and they do exceedingly well at giving what he requires. Each fits their character perfectly, especially Cusack, Jolie, and contributing an Oscar worthy performance, Thornton. \"Pushing Tin\" offers a variety of characters and contrasts them effortlessly. In particular, during a just-for-fun basketball game, Nick makes a sudden bet for $100 that Russell can not make a hoop from a certain point in the court. Russell excepts. Nick nervously changes his gamble to fifty cents, but Russell stands firmly on the original amount. He shoots...and misses. \"Close enough, Russell,\" pardons Nick, \"Lets call it even.\" Russell walks over to him manly and states \"You either make it or you don't,\" as he hands Nick the cash promised. The chemistry between these characters is as effective as pouring oil in to water. And that is exactly how it is designed to be. Brought to you by 20th Century Fox.",
         "I loved this movie. Its about competition, not ordinary competition but the kind of obsessive rivalry that causes you to focus so much on your rival that you forget about the things that really matter in your life, and you begin to act in a way that is destructive. The movie is also about letting go and getting your life back again. I do think it was a mistake to categorize this movie as a comedy, which could lead people to expect a wacky \"Airplane\" sort of movie. Pushing Tin is not a \"ha-ha\" sort of comedy. It has a subtle humor that is inherent in the absurdity of the aspect of human nature that is being portrayed. It does have some of the exaggeration of comedy, i.e. some of the events are not the sort of thing that really happens in reality. But the underlying emotions and situations are real, and watching the movie I had that feeling of recognition, of truth, that you get with a movie that has something to say to you. I was interested in the movie from the first few moments of watching it, and remained fascinated throughout, so I can't agree with those who think it was slow or uneven. The ending was sweet enough that I didn't care if it was a bit unrealistic. I think Mike Newell did a good job, the story was good, and the acting was wonderful. I intend to buy this movie when I get a chance because its one I could see many times and would like to share with others.",
         "Pushing Tin takes a unique subject matter, a job that affects almost everyone in America, and compelling lead character in the midst of a moving internal struggle and absolutely ruins it. Why did the director and/or producer have to try and make Top Gun for Air Traffic Controllers? The first scene of this movie was so laughable I almost walked out. These filmmakers adapted this movie from an article, as the opening credits state. Too bad they used the Hollywood cookie cutter to do it. Mr. Cusack and Mr. Thornton are enjoyable as usual and so was Ms Blanchett, unfortunately that is not enough.",
         "It's difficult to know where to begin. I was looking forward to seeing this film as I think both John Cusack and Billy Bob Thornton are both fine actors, also Kate Blanchette is in it so how bad can it be? It reeks. John Cusack plays a macho air-traffic controller for the New York metro area who thinks he's God's gift to pilots. Billy Bob Thornton comes along and out-machos him both in the control-room and on the basket-ball court, and also happens to have the sluttiest wife in the history of cinema. Name the cliches: 1. Billy Bob's zen-like cool as a half-Cree or is it half-Choctaw? both get mentioned - anyway, he wears a feather when he's controlling the planes. 2. Cusack sleeping with aforementioned slut. 3. Major fight in control-room while planes are haplessly flying around out there - very professional, guys. 4. The stupid ending . There's plenty of other garbage which is too numerous to mention.I almost got testosterone-poisoning from all this schlock. I'm amazed these fine actors wanted to be associated with this horrible film.",
         "`Pushing Tin' concerns two air traffic controllers. One is Nick Falzone, played by John Cusack, who as the hotshot of his workplace is happily married to one Connie (Cate Blanchett) with two kids. Into his life comes the notorious new air traffic controller Russell (Billy Bob Thornton) with his beautiful wife Mary (Angelina Jolie). The two men do not react well to one another and spates of jealousy and male rivalry, with consequences, ensue.. To it's credit `Pushing Tin' at least has an original setting - I can't recall another movie about air traffic controllers. Of course its merely a premise for male ego bating, a long running plot concept of countless movies. Here the bating takes place in trying to outdo one another in all aspects - work, social esteem and even with one another's wives. This leads us to the comedic events of this comedy. The comedy here is very soft, as the movie has a more comedy/drama mould to it than being ostensibly an all out comedy. Cusack's performance here is quite manic, as he winds himself up trying to outmatch his peer. As usual it's also quite good - Cusack has a great sense of being an actual character rather than an actor portraying a character. He works very well with the material he's given portraying a character that - while not as well drawn as his roles in such movies as `High Fidelity' and `Grosse Point Blank' - is nonetheless flawed, but still worthy. Thornton's character is the laconic counterpoint, laidback about the situation for most of the time but with a sense of energy and vitality brimming beneath. Thornton once again turns in a neat performance, with just enough character embellishments and detail to lift his character from blandness into quasi-life. Unfortunately Blanchett and Jolie - as the objects of affection - can do little with their limited material and serve merely as surfaces for the two leads to bounce off. The problem with the movie lies in the pacing of the script. Considering the intensity of the job, there's no pressure ever evident in the movie in either the script or direction (courtesy of Mike Newell). Even the manipulation of planes, using some graphics and actual plane shots, lacks any urgency. Thus the comedy tends to amble along to a rather drab finale. The drama elements are adequate and the performances flesh out the characters, but there's not enough originality to make it avid viewing. Therefore you'd expect the comedy elements to balance it out. Alas, while there're some smiles to be had, there's very few laughing aloud moments. Sure the characters neuroses and clashes can create some amusing sparks but they're not frequent enough, nor sharp enough to sustain this movie as a comedy. Thus, overall, the movie is grand and passable but there's nothing to really warrant much of a look in, except to see the works of two strong Hollywood actors. 5/10.",
         "Here's 1999's winner for the film least likely to be shown during an overseas flight. Cusack stars as a hotshot air traffic controller whose top dog status is threatened by the arrival of the equally gifted but enigmatic Billy Bob Thornton. Cusack's mounting rivalry with the inscrutable Thornton eventually consumes his personal life as he falls prey to Thornton's sexy wife (Angelina Jolie) and his marriage (to Cate Blanchett) gradually disintegrates. Director Mike Newell showed great flair in balancing comedy and drama in 1994's \"Four Weddings And A Funeral\", but here the mix is less assured and the extremes far too close together. Only fitfully amusing, \"Pushing Tin\" too rarely concentrates on its examination of air traffic controllers and their daily stresses, opting instead for a simple one-upmanship plotline with a superficial and sometimes flippant look at the men and women within whose hands we entrust our lives. The four leads are more than adequate in their roles, though the characters portrayed by Blanchett and Jolie (excellent during her brief appearances) are all but forgotten for long stretches at a time. As for rental possibilities, visibility should remain zero.",
         "Okay, several parts of this movie were a bit far-fetched; (the wake turbulence from a heavy jet being one of them)but from a technical standpoint I can say that the phraseology, hazing, harassment, and ego trips are very accurate. Why? In a word, pride. Perhaps false pride at times, but pride nonetheless. The U.S. air traffic control system handles more traffic in a single day than any other country does in a week. Check the numbers, kids. It's true. The training is rigorous and relentless, and, at the risk of sounding like a commercial for the Marines, if you happen to be the one out of about a thousand who makes it through training to become a full performance level controller, it becomes a badge of honor. Very few people can do it. It is a close-knit family, which was also displayed in the film. If you'll notice the scene where a particular departure didn't \"tag up\" and one controller didn't notice it, several others jumped in to help out, and all joking and hazing stopped. Forgive my preaching, but this is the first movie that actually gave a somewhat accurate view of my profession, so hopefully I can be forgiven for being protective. (By the way, if I was married to someone who looked like Angelina Jolie, I'd keep her in the woods away from the slugs I work with, too.)",
         "I wanted to be a Navy SEAL when I grow up, but after seeing this screen gem I want to be an Air Traffic Controller! There is something inherently wrong with a movie that tries to make us believe that ATCs are testosterone-laden, fast-driving, married-to-gorgeous-women studs. I know quite a few and they are the remnants of the chess and AV clubs from high school. There's nothing wrong with that - just don't try to convince me that they're cut from the same cloth as F-14 pilots or the aforementioned Navy SEALs. This movie stinks on so many levels it's hard to know where to start first. It's worst sin, though, is being mind-numbingly slow between action-packed scenes of ATCs doing incredibly macho things. SPOILER NOTICE Doesn't the last scene seem just a tad hypocritical to have the main character spend 5 minutes wooing his estranged wife over the ATC radio?!? What happenened to the pressure? The intensity? The life or death in the sky?!?!?! I've had bars of soap that left a better film than this!"
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "3 Miles Apart Productions Ltd.",
         "Art Linson Productions",
         "Dogstar Films"
      ],
      "summaries": [
         "Nick and the other boys (and Vicki Lewis) working the hotspot of air traffic control in New York are impressed with themselves, to say the least. They thrive on the no-room-for-error, fast-paced job and let it infect their lives. The undisputed king of pushing tin, \"The Zone\" Falzone, rules his workplace and his wedded life with the same short-attention span that gets planes where they need to be in the nick of time. That is, until Russell Bell, a new transfer with a reputation for recklessness but a record of pure perfection shatters the tensely-held status quo. The game of one-upmanship between the two flies so high as to lead Nick into Russell's bed with his wife. His sanity slipping just as fast as his hold on #1, Cusack's controller is thrown out-of-control when Thornton's wanderer quietly leaves town. Nick must now find a way to regain his sanity and repair his marriage before he breaks down completely.",
         "Nick \"The Zone\" Falzone is an air traffic controller at New York TRACON, where it's busy 24 hours a day. He's acknowledged as the best, until a quiet guy Russell Bell arrives on the scene from the Southwest somewhere. Russell and his wife Mary don't quite fit into the close-knit community of controllers and their wives, and a rivalry soon builds.",
         "A feud develops between two air traffic controllers: one cocky and determined while the other is restrained and laidback, which inevitably affects their lives."
      ],
      "budget": 38000000
   },
   "movielensId": 2598,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-23",
      "dvdReleaseDate": "1999-10-05",
      "directors": ["Mike Newell"],
      "runtime": 124,
      "movieId": 2598,
      "title": "Pushing Tin",
      "mpaa": "R",
      "actors": [
         "John Cusack",
         "Billy Bob Thornton",
         "Cate Blanchett",
         "Angelina Jolie",
         "Gene Dinovi",
         "Vicki Lewis",
         "Kurt Fuller",
         "Jake Weber",
         "Matt Ross",
         "Mike O'Malley",
         "John Carroll Lynch"
      ],
      "imdbMovieId": "0120797",
      "originalTitle": "Pushing Tin",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["A2S6ys_XZCU"],
      "plotSummary": "Two air traffic controllers (John Cusack, Billy Bob Thornton) who thrive on living dangerously compete to outdo each other on several levels.",
      "tmdbMovieId": 12596,
      "avgRating": 3.01078,
      "releaseYear": "1999",
      "numRatings": 4268,
      "posterPath": "/A33xLPsTIgT7tN3E5UWfVURFlPV.jpg"
   }
}