{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shakespeare",
            "id": 497
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "moor",
            "id": 17982
         }
      ],
      "imdb_id": "tt0114057",
      "video": false,
      "title": "Othello",
      "recommendations": [
         38413,
         50116,
         69007,
         41971,
         22176,
         32221,
         48364,
         32855,
         3526,
         73247,
         19317,
         26269,
         32636,
         48249,
         41057,
         43236
      ],
      "backdrop_path": "/1Bx7LaWenFDoCrQCy83jAHY5T4z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Othello",
               "gender": 2,
               "credit_id": "52fe46d29251416c75084b0b",
               "name": "Laurence Fishburne",
               "profile_path": "/8suOhUmPbfKqDQ17jQ1Gy0mI3P4.jpg",
               "id": 2975,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Desdemona",
               "gender": 1,
               "credit_id": "52fe46d29251416c75084b0f",
               "name": "Irène Jacob",
               "profile_path": "/vjlwVgbpb22S4rriqkfOd9H4kmU.jpg",
               "id": 1350,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Iago",
               "gender": 2,
               "credit_id": "52fe46d29251416c75084b13",
               "name": "Kenneth Branagh",
               "profile_path": "/bmpGjbqvAVNOK3ggiuET2Jl96tZ.jpg",
               "id": 11181,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cassio",
               "gender": 2,
               "credit_id": "52fe46d29251416c75084b17",
               "name": "Nathaniel Parker",
               "profile_path": "/w5SnRNxxY00lIDPB1SUh47nx46n.jpg",
               "id": 27631,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Roderigo",
               "gender": 2,
               "credit_id": "546251330e0a267bef00010a",
               "name": "Michael Maloney",
               "profile_path": "/f0rV6ZXr8W6BkSCFeJo2KXdnD4A.jpg",
               "id": 17483,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Emilia",
               "gender": 1,
               "credit_id": "546251410e0a267bf500010a",
               "name": "Anna Patrick",
               "profile_path": "/jdi9sSi5DF5uOmurxSwQhAsXjYf.jpg",
               "id": 1227643,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Montano",
               "gender": 2,
               "credit_id": "546251500e0a267bef00010d",
               "name": "Nicholas Farrell",
               "profile_path": "/t1I4m6x2aAki1pRueK6pxbi7j9s.jpg",
               "id": 32357,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Bianca",
               "gender": 1,
               "credit_id": "52fe46d29251416c75084b1b",
               "name": "Indra Ové",
               "profile_path": "/nxJqWvoKAeke90UIJVgSTlvVtsu.jpg",
               "id": 232174,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lodovico",
               "gender": 2,
               "credit_id": "5462515ec3a3680813000118",
               "name": "Michael Sheen",
               "profile_path": "/rbDgZ38bn22MUC2mMpkrG0L6nhB.jpg",
               "id": 3968,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d29251416c75084b07",
               "name": "Oliver Parker",
               "profile_path": "/3qdUN7qhcQn4P3tEOTKJgTUdCIr.jpg",
               "id": 56710,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5462510ec3a368082d000121",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54625118c3a368081300010e",
               "name": "Oliver Parker",
               "profile_path": "/3qdUN7qhcQn4P3tEOTKJgTUdCIr.jpg",
               "id": 56710,
               "department": "Writing",
               "job": "Adaptation"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.666577,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 16420,
      "vote_count": 44,
      "budget": 0,
      "overview": "The evil Iago pretends to be friend of Othello in order to manipulate him to serve his own end in the film version of this Shakespeare classic.",
      "similar": [
         862,
         1213,
         68718,
         28178,
         19913,
         207,
         13523,
         397422,
         50544,
         1934,
         8839,
         23168,
         1578,
         2253,
         1429,
         1374,
         1903,
         1422,
         4951,
         235
      ],
      "original_title": "Othello",
      "runtime": 123,
      "poster_path": "/qM0BXEQjmnAzlkDZ0tYmV6twqMX.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-12-15",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Envy, greed, jealousy and love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Oliver Parker"],
      "runtime": 123,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Oliver Parker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114057/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMzA2ODk2NV5BMl5BanBnXkFtZTcwMzQ4ODIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Laurence Fishburne, Kenneth Branagh, Irène Jacob | See full cast and crew »"],
      "reviews": [
         "I rented this film mainly to see Kenneth Branagh once again, but was totally surprised by the entire cast, especially Laurence Fishbourne who portrayed Othello brilliantly. The dignified, regal Fishbourne transforms Othello into a tragic figure with restraint, control and believability. It was also an added surprise to see two actors from Brahagh's Hamlet: Michael Maloney and Nicholas Farrel. And any film with Nathaniel Parker is a pleasure. Branagh brought a depth to Iago that I hadn't seen before, especially during the scene on the beach when he and Othello hug. Iago in tears? And then again at the final scene. Iago was evil, yes, but for an actor to find a few moments to make him human -that's when the audience knows something extraordinary has happened on stage or screen. See this film.",
         "I've always enjoyed Kenneth Branagh's versions of the Shakespeare classics, as he always does a very good job, but in this movie, the one who lifts the whole movie, is none other than \"the-always-great-actor\" Laurence Fishburne. Surely he has made some poor choices in films, even though he's a wonderful actor, but in this one we're truly given the real Othello: the passion, the intensity of jealousy as it grows stronger alongside with Fishburne's well portrayed paranoia and, furthermore, we're finally given a black Othello! I don't think they could have chosen a better Othello. Who else could have given him that blend of sympathy/antipathy, love/hatred and, not to forget, those fiery eyes...? Branagh is good as always, but not at his peak, Iréne Jacob's Desdemona is fairly good but a bit bleak, whilst Laurence Fishburne truly lifts it and makes it a very interesting and enjoyable movie. Do watch it.",
         "Director Oliver Parker wanted to make Othello a more \"pacy\" story, so he omitted quite a lot of the original text when writing this version for the screen. Luckily, the cuts and alterations that he has made do little damage to the old Shakesperean chestnut. I wouldn't say that any of the tweaks are particularly for the better, but the essence of Shakespeare's tale of envy, jealousy and deceit is so powerful that it would take a bungling fool - an Ed Wood wannabe, for instance - to rob it of its power. The weighty themes shine through as strongly as ever in this latest presentation. Laurence Fishburne plays the titular character, a renowned Moorish soldier. His courage has impressed young Venetian lady Desdemona (Irene Jacob) and the pair of them secretly marry. However, her father is displeased by this secret ceremony and he warns Othello that if she can deceive her own father then she may one day do the same to him. One of Othello's soldiers, Iago (Kenneth Branagh) fails to get a promotion of rank which he feels he deserves, and to gain revenge he engineers a series of lies and incidents designed to convince Othello that his wife is being disloyal to him by fornicating with another man. Inevitably, viewers may find themselves comparing this version with other productions. How does it rank alongside the 1952 Orson Welles version and the 1965 Laurence Olivier one? To be honest, it depends upon the viewer. Purists would probably opt for the Olivier offering, since it is only very slightly abridged and contains such strong performances that all four lead actors earned Oscar nominations. Film buffs might go for the Welles version, with its moody b&w lighting and a now-classic murder scene, not to mention the fact that the production history itself is as fascinating as the story. This version will undoubtedly find favour with viewers more inclined towards modern tastes. It has high production values, a sweeping score, accessible delivery of the lines, flashy photography, and \"cool\" stylistic touches (Fishburne's head tattoo, for instance). Personally, I feel the 1952 Othello will always be the benchmark, but this one is reasonably well made and it compares quite favourably with other versions.",
         "As my Shakespeare Professor had mentioned, the part of Othello is highly challenging, which is why many don't perfect it or intend to play it. Larry Fishburne however did a magnificent job! He provided us an astonishing portrayal of how even a noble, righteous and even intelligent man, can succumb to \"the green eyed monster.\" The calculatingly evil Iago was FLAWLESSLY portrayed by veteran Shakespearian actor Kenneth Branagh, who occasionally stared into the eyes of the camera itself, explaining his dark plans and expectations.",
         "For me, the Lawrence Fishbourne version of \"Othello\" is the best ever put on film. His performance is excellent, while not overpowering the villainous Iago. And the title role is played by a black man, as it should be, rather than a white man with boot-polish on his face. The film's marginal eroticism has been criticised, but isn't eroticism at the very heart of the story? Olivier's \"Othello\" was essentially a film of the stage production, and for me the Orson Welles version was a failure, despite Welles' star performance, because most of the other actors were almost devoid of charisma. How could Desdemona possibly have been interested in a slob like Welles' Cassio? I have always found the original play unconvincing, for several reasons. Iago's motive, resentment of Cassio's promotion, seems too trivial for the tragedy it precipitates. At risk of committing heresy, I found the Verdi opera more convincing, with the soliloquy by Iago explaining his innate determination to commit evil. Also, given the closeness of Othello's friendship with Iago, his decision to bypass him in favour of Cassio makes little sense. Likewise, Othello's readiness to believe the worst of Desdemona, and the ease with which Iago leads him on to murder, makes the title character look quite pathetic, almost simple-minded. In this film, the cutting of the text to the absolute minimum helps to hide the play's inherent faults and tighten the action, and Fishbourne's wordless suffering speaks volumes that more than make up for the loss of Shakespeare's lines. I couldn't help comparing this film with Kenneth Brannagh's \"Hamlet\", the longest and most tedious of his self-advertisements, in which every long-winded speech was preserved intact. Here Brannagh's Iago is almost as good as Fishbourne's Othello, and he makes the most of the lines he has. To sum up, ten out of ten. I can only regret that Fishbourne is not offered more roles of this quality.",
         "While maintaining the location and time period of the original play, this film gives us a much clearer insight into Othello as a character and as a story than many of the supposedly more important versions. The dialogue is trimmed to what is essential, the settings are atmospheric, and the cast is great. You will never forget the story after you see this version.",
         "shakespeare's plays have a way of transcending time. The language somehow breaks the time barrier. but perhaps it is the actors who really do that. after the disappointment in Romeo and Juliet (the version with Claire Danes and Leonardo DiCaprio), was hesitant take on another modern rendition of Shakespeare. To my surprise Othello was great! Iago's character was played so well by the Kenneth fellow! even thoough Iago is really evil and despicable, the character was played so well that it does what shakespeare intended for the charater to be, a pleasure for the audience to hate. i have to say that fishburne's performance here was really good as well. i recommend this for shakespeare scholars and lazy students (who refuse to read the book) alike.",
         "Othello, the classic Shakespearen story of love, betrayal, lies, and tragedy. I remember studying this story in high school, actually I found Othello to be probably my favorite Shakespeare story due to the fact of how fascinating it was, the fact that Shakespeare captured the feeling of friendship, love, and racism perfectly. I mean, when you really do study this story, you could go into so many philosophies on why Othello went insane with jealousy in the blink of an eye. But later on for my report I also watched this version of Othello and I have to say that it was absolutely brilliant. Lawerance and Kenneth just capture the story so well and understood it's darkness. Othello is the big time soldier in his city, he is loved by everyone, including the king. But when the king finds out that Othello snuck off with his daughter, Desdemona, the king is infuriated, but excepts it. Othello is welcome in the city and makes his best friend, Cassio, his side man instead of Iago, who has stood by Othello. Due to his insane jealousy, he's out for revenge. Still pretending to be Othello's best friend, he just mearly hints at Othello that Desdemona is cheating on him with Cassio, never says that they are, just makes Othello think that it's happening. Othello is driven insane and doesn't have pleasant plans for Desdemona or Cassio and Iago is more than happy to help him out. Othello is an incredible story, I highly recommend that you read it. It's an incredible story that keeps you thinking after you've read it. Othello the movie is also great and once again I recommend it, it captured the story perfectly and has a big tearjerker type of feel, or you could just be in utter shock of what happens between Othello and Desdemona, how quickly he believes that his true love would betray him. This is a terrific movie, great acting, good sets, and good direction, this is what Shakespeare meant when he wrote the story. 10/10",
         "I like the full versions of Shakespeare on film and will happily put in the effort for the reward. However I do like the cut versions (Richard III, Romeo & Juliet etc), yes they are for the short of attention MTV generation, but is that a bad thing? It's good to get a new generation into these plays. In this version Brannagh gives an effortless performance (he can do shakespeare in his sleep) and Fishburne is great as the main character tortured by the betrayal and lack of honour of those around him.(although at times i was listening for the \"Shaft\" theme song - he did play it a bit street-tuff at time!). A cut version yes, but it looks beautiful and is more accesible than other versions.",
         "You do not get more dark or tragic than \"Othello\" and this movie captures the play fairly well, with outstanding performances by Lawrence Fishburne and Irene Jacob. Fishburne's expresses to the viewer Othello's torment as he falls prey to Iago's lies very convincingly, even providing a realistic epileptic episode. Jacob is the loving and loyal wife who becomes either the instrument of Iago's revenge against Othello, or the object of his wrath (it is not clear which since no motive for Iago's behavior is offered). Although Kenneth Brannagh (sp?) displays his usual talent for Shakespeare in this movie, he is somewhat marginalized. The characters of Cassio and Emilia also wander in and out of scenes even though they, like Iago, seem more crucial to the plot. I have not checked the movie against the play to see how many lines were cut out, but I know that Shakespeare tends to develop his characters, even the seemingly unimportant ones, very well. If I had any criticism of the movie it would be that the story unfolds too quickly, and that the relationships between some of the characters are not laid out more. The director had a great cast, and no one offered a bad performance. The relationship between Cassio and Othello and that between Emilia and Desdemona need to be further developed earlier in the film. I have a feeling that they were closer to each other than the movie suggests, although you get a sense of this very late into the movie. Also, Othello and Desdemona need more time together. Although their anguish is convincing, the amount of interaction they have with each other makes it seem like they just met. On the other hand, maybe the did just meet---like Romeo and Juliet. In brief: good performances, too short."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Dakota Films",
         "Imminent Film Productions"
      ],
      "summaries": [
         "Iago convinces Othello, The Moor of Venice that his wife, Desdemona has been unfaithful. Iago is an evil, manipulative character with his own agenda. A plot of jealousy and rage transpires in this classic Shakespearean tale.",
         "The evil Iago pretends to be friend of Othello in order to manipulate him to serve his own end in the film version of this Shakespeare classic."
      ],
      "budget": 11000000
   },
   "movielensId": 26,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-12-15",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Oliver Parker"],
      "runtime": 123,
      "movieId": 26,
      "title": "Othello",
      "mpaa": "",
      "actors": [
         "Laurence Fishburne",
         "Irène Jacob",
         "Kenneth Branagh",
         "Nathaniel Parker",
         "Michael Maloney",
         "Anna Patrick",
         "Nicholas Farrell",
         "Indra Ové",
         "Michael Sheen"
      ],
      "imdbMovieId": "0114057",
      "originalTitle": "Othello",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["RAYuASqrs94"],
      "plotSummary": "The evil Iago pretends to be friend of Othello in order to manipulate him to serve his own end in the film version of this Shakespeare classic.",
      "tmdbMovieId": 16420,
      "avgRating": 3.61251,
      "releaseYear": "1995",
      "numRatings": 3022,
      "posterPath": "/qM0BXEQjmnAzlkDZ0tYmV6twqMX.jpg"
   }
}