{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119546",
      "video": false,
      "title": "A Little Bit of Soul",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Godfrey Usher",
               "gender": 2,
               "credit_id": "571e01d79251411ca7000f47",
               "name": "Geoffrey Rush",
               "profile_path": "/5h91WHSK80YtqTk1bMiar2IZzO2.jpg",
               "id": 118,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Dr. Richard Shorkinghorn",
               "gender": 2,
               "credit_id": "571e01e99251411ca7000f4b",
               "name": "David Wenham",
               "profile_path": "/xDUXLTF5i2fYx7eSEAR3IdaUb9y.jpg",
               "id": 1371,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Kate Haslett",
               "gender": 1,
               "credit_id": "571e01fb9251416b63002504",
               "name": "Frances O'Connor",
               "profile_path": "/tWGMS7DciV43tlxA6UEc2UqxrhL.jpg",
               "id": 1518,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Grace Michael",
               "gender": 1,
               "credit_id": "571e02059251415fd00032a2",
               "name": "Heather Mitchell",
               "profile_path": null,
               "id": 61350,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Judge",
               "gender": 2,
               "credit_id": "571e0214c3a36820420010e7",
               "name": "Roy Billing",
               "profile_path": "/4fnmZ3ANu7KcjsOizlzNPjWQSpm.jpg",
               "id": 94793,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Voice of Sir Samuel Michael",
               "gender": 2,
               "credit_id": "571e022f92514115e2005df3",
               "name": "Richard Roxburgh",
               "profile_path": "/hN1bWQ0Qe0DrA33Ch6TLKuIWs0.jpg",
               "id": 12206,
               "order": 6
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "571e0177c3a36820420010cb",
            "name": "Peter Duncan",
            "profile_path": null,
            "id": 61335,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 1.29866,
      "production_countries": [],
      "id": 89522,
      "vote_count": 2,
      "budget": 0,
      "overview": "Richard and Kate are former lovers who are now working independently to find the secret of the aging process. Both apply for funding from the Michael Foundation, and are asked to spend the weekend discussing the proposals with the Head of the Foundation, who happens to be married to the Australian Treasurer. They have a very interesting weekend.",
      "similar": [],
      "original_title": "A Little Bit of Soul",
      "runtime": 84,
      "poster_path": "/V1RitvMjD2fTYPk2jKKf6kOZvt.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-03-19",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter Duncan"],
      "runtime": 84,
      "synopsis": null,
      "writers": ["Peter Duncan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119546/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxODU5MTI1MV5BMl5BanBnXkFtZTcwNjU2NzAwMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Geoffrey Rush, David Wenham, Frances O'Connor | See full cast and crew »"],
      "reviews": [
         "I remember seeing reviews for this film when it was first released in Australia about 3 years ago, and while they weren't great I thought I should see it anyway. 3 years on and I still hadn't seen the film but, luckily for me, it was on TV. While it was slow in patches there were some genuinely funny black comedic moments - pitch black! The plot is simple Richard Shorkinghorn is struggling to find funding for his \"fountain of youth\" project and insanely wealthy Grace Michael, Heather Mitchell, comes forward as a prospective svengali. Unknown to Richard his ex-fiance and co-worker Kate, Frances O'Connor, is also seeking the same backing for a remarkably similar project and Grace invites the two up to her country home for them to sell their idea to her. Godfrey User, Geoffrey Rush, and Grace's husband joins in the frivolity of the weekend and the story moves from there. The mere idea that Godfrey, the Federal Treasurer and later Prime Minister, is a satanic worshipper is reason alone to see this film (and not entirely surprising). Excellently played by all given the patchy nature of the film and I felt that it was probably helped by the continuous ads on the TV.",
         "A movie that shows us a well welcomed return to \"Subtle comedy\", something definitely lacking in todays film industry. What starts out as possibly a very believable movie plot gets sillier and sillier and you can't help but laugh..... which is the idea! Excellent performers from all involved especially Geoffrey Rush and David Wenham. The beauty of the movie is that it is masterminded by one person. Not one of these godforsaken movies that is written by one person, produced by someone who doesn't care, directed by a friend of the production company who owes them a favour etc. Honestly, i don't expect everyone to enjoy this, but if you're into black comedy and smart humour, give it a go.",
         "Although the script somewhat concerns discovering a method for controlling the aging process of humans, this low-budget film is most notable for top-flight satirical writing and exceptional acting. Heather Mitchell, a stage trained actress Down Under, is remarkable with her acutely accurate sense of comic syntactic timing. She, along with Geoffrey Rush, much lauded for his performance in \"Shine\", thoroughly enjoy creating their roles. Australian politics, hardly different from any other, are broadly pastiched. The director, Peter Duncan, also scripted and nicely plays a barrister. The plot is wildly improbable but each scene presents something of interest. This little known work deserves a wider audience than it has had.",
         "Great cast. Great director. Great premise. So what happened? The script is patchy and the interpretation of same woeful at best. It's not the subject material: Satanistic leanings within ANY government would seem to be a given. Brrrr! It's the complete lack of engagement, characterwise, by ANY of the cast. CAMP is OK, but this seems a pale rendition of the \"Rocky Horror Picture Show\" without the songs and over-the-top kitsch. In fact, it's the soundtrack that saves this abomination from the trashcan. Australian films, at least HUMOROUS ones, tend to fall flat when they attempt parody or satirical-humour per se. It's not that we can't do it... it's more that we do it best on television. There is something episodic about \"A Little Bit of Soul\": the editing is woeful and the dialogue patchy. Like a lot of things we in Oz do: couldabeen.",
         "I am an Australian that loves renting movies on Netflix to get some international films that are not released in America. In general I love international films because they often provide a different cultural take on life. I was quite excited waiting for A Little Bit of Soul (ALBS) to arrive because it had some of my favorite Australian actors - Geoffrey Rush, Frances O'Connor, and Heather Mitchell. WHAT A DISAPPOINTMENT! Some describe the movie as a farce or black comedy, I describe it as a mess! You know you are in trouble when the nominal plot line is about research on chickens to turn back the cluck (err...the aging clock that is..haha?). Rush plays the husband of the woman funding the research but for some unknown reason is also the Federal Treasurer - a position akin to Secretary of State in the US in terms of profile/respect. Oh, and why don't we make the husband and wife into devil worshippers as well. The plot really just starts to go downhill from there. Lots of meaningless dialog and inane plot twists. Its really not even worth writing about or describing. I cannot understand how this film got financed or distributed. I highly recommend this film...to give to your worst enemy.",
         "Nobody says it like the New York Times, source of the above quot. I saw a movie I hadn't heard of in the new releases rack at Bockblusters. I thought what's to lose with Geoffrey Rush and good Australian perverse fun? My first problem is that they actually show you a trailer for the movie right before the movie? What folly this? After watching I can only guess that some exec thought that the anticipation of wacky plot twists might keep viewers from springing out of their seats and pushing rewind. I sure couldn't make it through the viewing in one sitting. Had to view part 2 first thing on Thanksgiving morning when resistance was low. Astoundingly dull. Lovely actors and scenery portraying a feeble script. Really: don't bother. :::-:::-:::-:::-:::"
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Beyond Films",
         "Columbia TriStar Television Pty. Ltd.",
         "Faust Films Pty. Ltd."
      ],
      "summaries": [
         "Richard and Kate are former lovers who are now working independently to find the secret of the aging process. Both apply for funding from the Michael Foundation, and are asked to spend the weekend discussing the proposals with the Head of the Foundation, who happens to be married to the Australian Treasurer. They have a very interesting weekend.",
         "Two scientists vie for funding from a wealthy heiress and her loopy politician husband."
      ],
      "budget": 0
   },
   "movielensId": 2601,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-03-19",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["Peter Duncan"],
      "runtime": 84,
      "movieId": 2601,
      "title": "A Little Bit of Soul",
      "mpaa": "R",
      "actors": [
         "Geoffrey Rush",
         "David Wenham",
         "Frances O'Connor",
         "Heather Mitchell",
         "Roy Billing",
         "Richard Roxburgh"
      ],
      "imdbMovieId": "0119546",
      "originalTitle": "A Little Bit of Soul",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Richard and Kate are former lovers who are now working independently to find the secret of the aging process. Both apply for funding from the Michael Foundation, and are asked to spend the weekend discussing the proposals with the Head of the Foundation, who happens to be married to the Australian Treasurer. They have a very interesting weekend.",
      "tmdbMovieId": 89522,
      "avgRating": 2.80952,
      "releaseYear": "1998",
      "numRatings": 21,
      "posterPath": "/V1RitvMjD2fTYPk2jKKf6kOZvt.jpg"
   }
}