{
   "tmdb": {
      "original_language": "zh",
      "keywords": [{
         "name": "gorilla",
         "id": 690
      }],
      "imdb_id": "tt0076164",
      "video": false,
      "title": "The Mighty Peking Man",
      "recommendations": [
         43023,
         49304,
         34084,
         64214,
         42517,
         92312,
         43105,
         47345,
         31472,
         28673,
         38826
      ],
      "backdrop_path": "/j7aW3KSEzJ5VLApKMliC2A1HcXO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "\"Samantha\" / Ah Wei",
               "gender": 1,
               "credit_id": "52fe45f6c3a36847f80e47d5",
               "name": "Evelyne Kraft",
               "profile_path": "/khx6H5GMROYIZvngX0V1ddQS5kX.jpg",
               "id": 34601,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Johnnie Fang / Johnny Chen Zheng Feng",
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47ed",
               "name": "Danny Lee Sau-Yin",
               "profile_path": "/nfWVMzoHe6CFKZjDLukoxUfWaTo.jpg",
               "id": 26784,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Lu Tien",
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47e9",
               "name": "Ku Feng",
               "profile_path": "/zSJwvWED9pT54YUBrQhL31UzeaC.jpg",
               "id": 229302,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Chen Shi Yu",
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47f1",
               "name": "Lam Wai-Tiu",
               "profile_path": "/gqVoTwBhn3Gv786XIbqfaxOkLl.jpg",
               "id": 1178832,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Huang Tsui Hua",
               "gender": 1,
               "credit_id": "52fe45f6c3a36847f80e47f5",
               "name": "Siu Yiu",
               "profile_path": null,
               "id": 1200047,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Lucy",
               "gender": 1,
               "credit_id": "52fe45f6c3a36847f80e47f9",
               "name": "Chen Ping",
               "profile_path": "/dVYtdIGYsaUF65lJzS8uUiNl4Sd.jpg",
               "id": 240181,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dr. Ah Long",
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47d9",
               "name": "Norman Chu",
               "profile_path": "/txvot9CrqOsVLtS2Z9io4GIe93D.jpg",
               "id": 70674,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Dr. Ah Pi, anthropologist",
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47fd",
               "name": "Ng Hong-Sang",
               "profile_path": "/b4DJP22hBXYSyfStrZMvnRBf5ar.jpg",
               "id": 1140994,
               "order": 7
            },
            {
               "cast_id": 26,
               "character": "Views Peking Man at stadium",
               "gender": 0,
               "credit_id": "58cc6b0cc3a36851e8002d22",
               "name": "Wang Han-Chen",
               "profile_path": null,
               "id": 1134979,
               "order": 8
            },
            {
               "cast_id": 27,
               "character": "Views Peking Man at stadium",
               "gender": 2,
               "credit_id": "58cc6b19c3a36851e0002fff",
               "name": "Lee Sau-Kei",
               "profile_path": null,
               "id": 1180151,
               "order": 9
            },
            {
               "cast_id": 28,
               "character": "Man in his kitchen window",
               "gender": 2,
               "credit_id": "58cc6b2e92514174470031c7",
               "name": "Gam Tin-Chue",
               "profile_path": "/v9zMKXExLwZsLux84HwxydRHxYD.jpg",
               "id": 1583011,
               "order": 10
            },
            {
               "cast_id": 30,
               "character": "Man in the bedroom",
               "gender": 0,
               "credit_id": "59da720ec3a36861df04c0c9",
               "name": "Chin Chun",
               "profile_path": null,
               "id": 1152471,
               "order": 11
            },
            {
               "cast_id": 31,
               "character": "Ship crew",
               "gender": 2,
               "credit_id": "59da950192514124cd04a986",
               "name": "Ting Tung",
               "profile_path": null,
               "id": 1619660,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47df",
               "name": "Ho Meng-Hua",
               "profile_path": "/jLkA0nvyuSwdRrLGJPnyLXWpX4D.jpg",
               "id": 1042634,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f6c3a36847f80e47e5",
               "name": "Ni Kuang",
               "profile_path": "/41TVqxyNekPr2HQR4IhUuIXhPzZ.jpg",
               "id": 70675,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5813f243c3a368798d024f35",
               "name": "Chiang Hsing-Lung",
               "profile_path": "/4rJVpsyq1UA2JoMQDdvGSbvzxMh.jpg",
               "id": 43913,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5813f24ec3a368798a028794",
               "name": "Frankie Chan Fan-Kei",
               "profile_path": "/jQ2wfYUiG5IGEB1eC5BmNxayBCJ.jpg",
               "id": 1011224,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5813f0de925141579b028356",
               "name": "Pang Shing",
               "profile_path": null,
               "id": 1700965,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 2,
               "credit_id": "5813f10c92514152d5029716",
               "name": "Chan King-Sam",
               "profile_path": null,
               "id": 1427703,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5813f159c3a368798a0286e9",
               "name": "Johnson Tsao Chuang-Sheng",
               "profile_path": null,
               "id": 1699006,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5813f169925141543e02aad1",
               "name": "Chen Yung-Lieh",
               "profile_path": null,
               "id": 1700966,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "5813f18bc3a3687a8d02862c",
               "name": "Cho Wai-Kei",
               "profile_path": null,
               "id": 1427704,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5813f191c3a3687b18025f07",
               "name": "Wu Cho-Hua",
               "profile_path": null,
               "id": 1637706,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5962d973c3a368253c0cac00",
               "name": "Wang Yong-Hua",
               "profile_path": null,
               "id": 1095148,
               "department": "Sound",
               "job": "Sound Recordist"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 1.871732,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 42230,
      "vote_count": 14,
      "budget": 0,
      "overview": "Word of a monster ape ten stories tall living in the Himalayas reaches fortune hunters in Hong Kong. They travel to India to capture it, but wild animals and quicksand dissuade all but Johnny, an adventurer with a broken heart. He finds the monster and discovers it's been raising a scantily-clad woman, Samantha, since she survived a plane crash years before that killed her parents. In the idyllic jungle, Johnny and Samantha fall in love. Then Johnny asks her to convince \"Utam\" to go to Hong Kong. Lu Tien, an unscrupulous promoter, takes over: Utam is in chains for freak show exhibitions. When Lu Tien assaults Samantha, Utam's protective instincts take over: havoc in Hong Kong.",
      "similar": [
         869,
         871,
         10329,
         61791,
         281338,
         278927,
         119450,
         1705,
         37135,
         1688,
         1685,
         9822,
         107920,
         10603,
         10130,
         31126,
         42235,
         12117,
         28324,
         8767
      ],
      "original_title": "猩猩王",
      "runtime": 90,
      "poster_path": "/nRVrv8FyuVjK6BW9jGsYpKQQI23.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": "/nPGLMS26OKdu6T7RYakXGYVXFzK.png",
         "name": "Shaw Brothers",
         "id": 5798,
         "origin_country": ""
      }],
      "release_date": "1977-08-11",
      "vote_average": 5.2,
      "belongs_to_collection": null,
      "tagline": "Torn from their jungle paradise... Betrayed by those they trusted... destruction for all!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "HKD ",
      "directors": ["Meng Hua Ho"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Kuang Ni"],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0076164/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTgxNDE1MDU1Ml5BMl5BanBnXkFtZTcwNTEyMTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Evelyne Kraft, Danny Lee, Feng Ku | See full cast and crew »"],
      "reviews": [
         "Man, these B gems are fun to watch. Shaw Bros Studios definitely pay homage to the King....Kong that is. Beware the Mighty Gorilla suit! This movie teaches you so much! When heartbroken, sign up for a dangerous, life threatening expedition which probably means getting only a one way plane ticket. Danny Lee is good as the hero and for donning those crazy big lapels. Other times, he looks like he had a fun time with Evelyne Kraft since he's always got his hands all over her! There's also a weird triangle going on...don't mess with a gorilla's woman. The big guy likes to watch. Kraft as Ah Wei is pure eye candy and she works well with Lee (I had to laugh at the sappy love chase scenes in the deep jungle...of INDIA??? I thought we were in Peking!). Also, Shaws pulled out all the budget stops with model villages and miniscule downtown Hong Kong. It just gets the film more points in the shlock category. Laughter ensues during the stampede guns firing at the rear projection screen. One villager really gets a \"leg\" up during the goofy tiger scene. 15 minutes into this one and you get a feeling who the sleazeball is going to be. Was it just me or was there a lot of sexual innuendo with Ms Tarzan and the tree/light pole straddling? There's also reckless carnage, a crazy hellbent army commander, millions of dollars in property damage...well, maybe $100 worth of model kits. Watch for that big hairy hand and the kooky Tonka dump trucks. You know, despite the fact that there's a 6 story massive gorilla in the city, the people of Hong Kong took it very well. Great kampy fun here, Shaw style!",
         "Words cannot describe this movie, it must be experienced! Things to watch for: the explorers climb a cliff with no supplies, but somehow a huge tent filled with sleeping cots is set up in the next scene; the plane diary is in English in a Chinese movie and although the jungle girl can only grunt, she can read the handwriting in the diary with no trouble; the \"costume\" she wears keeps peeling off when she runs...you can even see some of the glue peeling in a couple scenes; AND, the tree-climbing scene is NOT to be missed!!!!!",
         "This is not just any King Kong rip-off... this is a King Kong rip-off from the legendary Shaw Bros! Filmed in Shaw Scope! Shady Chinese guys try to find a giant ape in India. The \"exploration\" is wonderfully ridiculous. Then, just when you and your friends think you can't possibly laugh any more, amidst all the Chinese actors appears a beautiful blonde westerner! Raised in the jungle, she swings through the trees like Tarzan with a crazy scream. Her top is glued on... barely. Lots of bad, generic 70's music accompany all of this. When she shimmies up a tree, legs akimbo, the hapless Chinese explorer guy gets quite an eyeful. She can control all the jungle animals. The tigers, cheetahs and elephants all love to frolic with her. Except the snakes. One nasty snake bites her high on the inner thigh. Pretty close to the danger zone. What's the hapless Chinese explorer to do while she writhes in pain? Why stick his face down between her legs and suck the poison out, of course! The miniature sets are fantastically cheap. Not one of them would have qualified for a Godzilla movie. They don't help matters by offering lots of close-ups of the miniature trees and fake streams. You keep expecting a Lionel train to whistle by. Samantha (the girl) doesn't command much of any language, preferring grunts. She is so grateful to the hapless Chinese explorer that they make love in her cave. Cue more 70's music. Oh, and Samantha, raised in this harsh jungle since a child, wears a lot of make-up. The Peking Man changes size a bit, depending on the sets. He seems to range from 20 to 100 feet tall. If you enjoy campy trash, this is a must see! Our group has watched a lot of bad movies together but very few have given us as much joy as Mighty Peking Man.",
         "The Mighty Peking Man (1977) stars Danny \"The Man\" Lee as an anthropologist who's searching for the mythical \"Peking Man\". Funded by a wealthy investor, Lee and his associates travel to Northern India to find the behemoth. Along the way he encounters a jungle girl (Evelyne Kraft who's so friggin' hot that she broke my babe-o-meter) who just happens to have the Peking Man as her guardian and companion. The original Hong Kong version of this film has a very sad and depressing overtone to it (unlike the badly dubbed \"international\" version). The original version plays out like an updated Mighty Joe Young. I liked this movie very much. Danny Lee is my hero! Another entry in the Shaw Brothers attempt to go international. The movie is not as bad as people make it out to be. Don't believe the hype people. A cheesy movie with loads of fun! Highly recommended! Evelyne Kraft is hot!",
         "Honest speaking, this movie is really bad, however some awful movies are somehow very attractive and possess some kind of mysterious charms, and this Mighty Peking Man is one of those movies. This is a Hong Kong version of King Kong, who is able to change his size according to each scene, which is miracle! I laughed a lot from the beginning to the end. Samantha is gorgeous and love scene of Johnny and Samantha is very memorable with awesome music, \"Could it be I'm in love? Maybe~\" I wonder if the director was serious about this movie or he actually intended to make funniest comedy of the decade. Anyway, I really love this movie and if you are reading this and you haven't watch Mighty Peking Man, run to the nearest video shop and grab it. If you can't find it there, try the furthur video shop! It's worth it. Finally I would like to thank Quentin Tarantino for brings back this movie to life.",
         "Mighty Peking Man was done in the seventies after the last Godzilla film of the original Godzilla series (Terror of Mechagodzilla, 1975) and this totally takes up the slack. It's even at least as entertaining as the last Godzilla films easy. It's a rip-off of King Kong and Godzilla but never tries to be anything more than it is, and that's what makes it honest and fun. The miniatures is this film are fantastic, especially near the end where the giant is walking around the city and elevated roadways. The action even starts early, no waiting an hour for the monster's first appearance. This is one of my personal fave giant monster films, definitely gonna buy it on DVD! This even had a recent successful midnight run here in New York City. Don't miss it!",
         "At one time, this was the most expensive movie in the history of Hong Kong cinema. It's campiness exceeds words. It is hard to believe that the filmmakers were actually serious when they made this hilariously horrible movie. The film is good as a comedy simply because of its being so terrible. I saw the re-release of this film at QT3 in Austin and the audience laughed their asses off.",
         "Please do not be confused by any futile attempts by the \"Shaw Brothers\" to film a serious King Kong-Sheena hybrid. \"Mighty Peking Man\" is a mind bending movie experience, that must be seen to be believed. The most fun can be had if you simply concentrate on the utter magnificence of the movie's ineptitude. Some highlights would be finding your girl in bed with your brother, and immediately running off to the jungle on a wild ape hunt. Rocks that change size as they are thrown. Avoiding an elephant stampede by jumping into quicksand. Not shooting a tiger who is tearing off a guy's leg, but then executing the man after the attack. Finding plenty of eye shadow and makeup while living in the jungle, even though this jungle beauty can only grunt. Having a sexy blonde clad in animal skins immediately get a ride from total strangers in downtown Hong Kong \"Take me to Peking Man\". People thrown off of a 40 story building by a gorilla, winding up on the pavement below, looking no worse than if they had fallen out of bed. It just goes on and on. - MERK",
         "Before Danny Lee made it big in The Killer, he played Johnny Feng in... The Mighty Peking Man! Beginning with an earthquake & an initial attack by the ape man, the film becomes a jungle fantasy for a while, with an elephant stampede, death by quicksand, Samantha the blond jungle girl, a romantic flashback, and a battle between a leopard and a cobra (as Johnny sucks poison from Samantha's inner thigh!) When Johnny, Samantha and Utam the giant ape go to Hong Kong the film switches to King Kong mode, with Utam becoming a sideshow act, taking part in a tug-of-war with what look like Tonka Toy trucks (as the locals throw fruit and prod him with sticks.) Utam finally runs amok when he sees Samantha being molested, and the film culminates with Johnny, Samantha and the Peking Man atop a high-rise building, getting buzzed by army helicopters. This movie is hampered by shoddy process shots, and a sub-par ape costume, though close-ups of Utam's face are more successful, but the film more than makes up for this with the inclusion of Samantha (who seems constantly to be on the verge of popping out of her animal skin costume), impressively-made, large-scale model shots of downtown Hong Kong, and one of the best endings of a giant ape movie. *Spoilers* In this particular tale, the girl DOESN'T leave the shot-up primate's side and dies, the creature's final, fur-in-flames moments are more violent than Kong's many demises, and the movie finishes in a downbeat fashion.",
         "Mighty Peking man(aka:Goliathon)is a clever film from hong Kong and India about a search for the missing link,called the mighty Peking man, which looks like a 60 ft tall yeti.an adventurer;johnny(Danny lee)finds it along with a sexy blonde bikinied jungle woman(evelyne kraft)who was raised by the giant Peking man.this movie is a personal favorite of Quentin Tarantino and i kind of enjoy it,even if it does have some flaws.its a beauty and beast tale.in the USA it was released as goliathon in 1979.i remember seeing the trailers at the plaza theater in Paterson new jersey.where i saw endless Godzilla,kung fu and b movies.evelyne kraft was stunning,sexy and wild.a must see.5 out of 10."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Shaw Brothers",
         "Shôchiku Eiga"
      ],
      "summaries": ["Word of a monster ape ten stories tall living in the Himalayas reaches fortune hunters in Hong Kong. They travel to India to capture it, but wild animals and quicksand dissuade all but Johnny, an adventurer with a broken heart. He finds the monster and discovers it's been raising a scantily-clad woman, Samantha, since she survived a plane crash years before that killed her parents. In the idyllic jungle, Johnny and Samantha fall in love. Then Johnny asks her to convince \"Utam\" to go to Hong Kong. Lu Tien, an unscrupulous promoter, takes over: Utam is in chains for freak show exhibitions. When Lu Tien assaults Samantha, Utam's protective instincts take over: havoc in Hong Kong."],
      "budget": 6000000
   },
   "movielensId": 2602,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1977-08-11",
      "dvdReleaseDate": "2000-05-23",
      "directors": ["Ho Meng-Hua"],
      "runtime": 90,
      "movieId": 2602,
      "title": "The Mighty Peking Man",
      "mpaa": null,
      "actors": [
         "Evelyne Kraft",
         "Danny Lee Sau-Yin",
         "Ku Feng",
         "Lam Wai-Tiu",
         "Siu Yiu",
         "Chen Ping",
         "Norman Chu",
         "Ng Hong-Sang",
         "Wang Han-Chen",
         "Lee Sau-Kei",
         "Gam Tin-Chue",
         "Chin Chun",
         "Ting Tung"
      ],
      "imdbMovieId": "0076164",
      "originalTitle": "猩猩王",
      "genres": [
         "Science Fiction",
         "Action",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["pwcb6P8gMsU"],
      "plotSummary": "Word of a monster ape ten stories tall living in the Himalayas reaches fortune hunters in Hong Kong. They travel to India to capture it, but wild animals and quicksand dissuade all but Johnny, an adventurer with a broken heart. He finds the monster and discovers it's been raising a scantily-clad woman, Samantha, since she survived a plane crash years before that killed her parents. In the idyllic jungle, Johnny and Samantha fall in love. Then Johnny asks her to convince \"Utam\" to go to Hong Kong. Lu Tien, an unscrupulous promoter, takes over: Utam is in chains for freak show exhibitions. When Lu Tien assaults Samantha, Utam's protective instincts take over: havoc in Hong Kong.",
      "tmdbMovieId": 42230,
      "avgRating": 2.64754,
      "releaseYear": "1977",
      "numRatings": 61,
      "posterPath": "/nRVrv8FyuVjK6BW9jGsYpKQQI23.jpg"
   }
}