{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "coming of age",
            "id": 10683
         },
         {
            "name": "britain",
            "id": 14905
         },
         {
            "name": "lgbt child",
            "id": 34333
         }
      ],
      "imdb_id": "tt0162973",
      "video": false,
      "title": "Get Real",
      "recommendations": [
         342,
         10938,
         15708,
         4369,
         15728,
         15179,
         39517,
         81704,
         17483,
         14681,
         1812,
         19375,
         17614,
         17028,
         27215,
         26032,
         12839,
         4927,
         14205,
         27099
      ],
      "backdrop_path": "/2fTLLKE8fYhchnNTfWYW4eyYuvP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Steven Carter",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d455",
               "name": "Ben Silverstone",
               "profile_path": "/qWdKvFZdO99b3IEszxUDqyvL3Db.jpg",
               "id": 68014,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "John Dixon",
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d459",
               "name": "Brad Gorton",
               "profile_path": "/oV1Qe1MQdVfdnhbfHvTgnMEJyAd.jpg",
               "id": 92024,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe449ec3a368484e02d45d",
               "name": "Charlotte Brittain",
               "profile_path": "/cuUq9JfA8N9mFqnvttprTRLw37o.jpg",
               "id": 92025,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Jessica",
               "gender": 0,
               "credit_id": "58d12f1e9251411ad800b35d",
               "name": "Stacy Hart",
               "profile_path": null,
               "id": 1618572,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Wendy",
               "gender": 0,
               "credit_id": "58d12f2ec3a36838e900a77a",
               "name": "Kate McEnery",
               "profile_path": null,
               "id": 1633400,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mark",
               "gender": 0,
               "credit_id": "58d12f3b9251411aef00b2d3",
               "name": "Patrick Nielsen",
               "profile_path": null,
               "id": 1781139,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Kevin",
               "gender": 0,
               "credit_id": "58d12f59c3a36838af00b37b",
               "name": "Tim Harris",
               "profile_path": null,
               "id": 1781140,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dave",
               "gender": 0,
               "credit_id": "58d12f699251411ae800b747",
               "name": "James D. White",
               "profile_path": null,
               "id": 1781141,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Young Steve",
               "gender": 0,
               "credit_id": "58d12f829251411a9f00b845",
               "name": "James Perkins",
               "profile_path": null,
               "id": 1781142,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Young Mark",
               "gender": 0,
               "credit_id": "58d12f93c3a36838f100a575",
               "name": "Nicholas Hunter",
               "profile_path": null,
               "id": 1781143,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Steven's Mother",
               "gender": 0,
               "credit_id": "58d12fa89251411a9f00b855",
               "name": "Jacquetta May",
               "profile_path": null,
               "id": 1773971,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Steven's Father",
               "gender": 0,
               "credit_id": "58d12fb59251411ae800b77f",
               "name": "David Lumsden",
               "profile_path": null,
               "id": 137950,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Linda's Brother",
               "gender": 0,
               "credit_id": "58d12fde9251411ae800b797",
               "name": "Morgan Jones",
               "profile_path": null,
               "id": 1621641,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Cruising Man",
               "gender": 0,
               "credit_id": "58d12ffec3a368390800a27f",
               "name": "Steven Mason",
               "profile_path": null,
               "id": 1781144,
               "order": 13
            },
            {
               "cast_id": 28,
               "character": "English Teacher",
               "gender": 2,
               "credit_id": "5aaea3190e0a2665f5014383",
               "name": "Richard Hawley",
               "profile_path": null,
               "id": 1233348,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "Bob, the Driving Instructor",
               "gender": 2,
               "credit_id": "59503c86925141310c05443d",
               "name": "Steven Elder",
               "profile_path": "/cHg1B2P0BQZT2HfBNVmeQ549lCg.jpg",
               "id": 80371,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Policeman",
               "gender": 2,
               "credit_id": "59503e05c3a368323204f656",
               "name": "Andy Rashleigh",
               "profile_path": null,
               "id": 40643,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "John's Father",
               "gender": 2,
               "credit_id": "59503e12925141311505436f",
               "name": "Ian Brimble",
               "profile_path": "/nLD8LdHJKtEYEStUBlQ2YeqmsQJ.jpg",
               "id": 133033,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "John's Mother",
               "gender": 1,
               "credit_id": "59503e1c92514131080533be",
               "name": "Judy Buxton",
               "profile_path": null,
               "id": 1225741,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449ec3a368484e02d463",
               "name": "Simon Shore",
               "profile_path": null,
               "id": 103586,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe449ec3a368484e02d469",
               "name": "Patrick Wilde",
               "profile_path": null,
               "id": 103587,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58d13043c3a36838df00a854",
               "name": "John Lunn",
               "profile_path": null,
               "id": 17252,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "58d13050c3a36838c900b4e3",
               "name": "Alan Almond",
               "profile_path": null,
               "id": 47650,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58d13061c3a36838f900afc8",
               "name": "Barrie Vince",
               "profile_path": null,
               "id": 22154,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58d130719251411ae800b825",
               "name": "Bernd Lepel",
               "profile_path": null,
               "id": 8805,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58d130819251411acb00b3c1",
               "name": "Bernd Lepel",
               "profile_path": null,
               "id": 8805,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "58d130909251411ae800b83b",
               "name": "Terry Ackland-Snow",
               "profile_path": null,
               "id": 10200,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.429421,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 24584,
      "vote_count": 63,
      "budget": 0,
      "overview": "A tenderly romantic coming-of-age story as two boys in a British school fall in love.",
      "similar": [
         449176,
         376867,
         26371,
         184352,
         26280,
         26933,
         338189,
         11421,
         10229,
         85350,
         398818,
         428493,
         308369,
         413666,
         152584,
         376660,
         121875,
         1391,
         455661,
         380874
      ],
      "original_title": "Get Real",
      "runtime": 108,
      "poster_path": "/k7KCBnt1VXFhPjoTSt4MePr1MpI.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-08-16",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Simon Shore"],
      "runtime": 108,
      "synopsis": "A 10/10 must see/have gay film! Meet Steve - a troubled teen coming to terms with his sexuality. Taunted & bullied, fate entwines him with John the school jock who, surprisingly, is having similar feelings. So their story unravels as they try to lead double lives as what society expects of them and how they are with one another. Get Real has an interesting take on the gay cliches without going over the top as so many do. The token female friend and her very real problems. John's, jock friends, and their denial of his sexuality. The mistaken assumption of their female friends beliving they are wanting more then just friendship. The realness of the parents coming to terms with sexuality is portrayed effectively well. Their inner torment of what a society percieves them as and who they truthfully are is acted to the best!! This amazing coming of age story is filmed tastefully & shot with beautiful cinematography.",
      "writers": [
         "Patrick Wilde",
         "Patrick Wilde"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162973/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxNDk4MjcyNl5BMl5BanBnXkFtZTcwNDU1MzMzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Ben Silverstone, Brad Gorton, Charlotte Brittain | See full cast and crew »"],
      "reviews": [
         "I rented the movie \"Double Jeopardy\" one evening and was skipping through the previews when I saw the trailer for this movie. I had heard about it before from a few friends who had seen it and had read about it in TIME magazine, not knowing much about the movie. Growing up in a household where being \"different\" in that sense is not acceptable, it has been hard for me to deal with my issues without support from my parents. I went to the local video store a few nights ago and immediately picked out \"Get Real\" to watch and enjoy. What I didn't expect was how true to life this movie really is! \"Get Real\" is the story about a 16-year old gay teenager named Steven Carter (played by the boyishly adorable Ben Silverstone) who has known about himself since he was 11-years old and is perfectly fine with it. Although he is dying to be accepted for who he is and not for who he pretends to be, he is afraid to tell his peers and his parents about his true nature. Only his best friend Linda (Charlotte Brittain, who delivers a terrific performance) knows and is worried about Steven, due to his sexual adventures at a gay men's restroom in a park. But one day, he unexpectedly has an encounter with the \"straight\" high school jock John Dixon (Brad Gorton, who plays his role of someone with much sexual confusion with complete realism) and the two boys fall in love. Steven wants to be open about the relationship, while John wants to hide his love for Steve. These differences, along with many others than I will not spoil for those who have not seen this, lead to one of the most tear-jerking endings I have ever seen in a movie. Bravo to everyone involved for creating such a realistic story! Being gay is not easy these days, especially for teenagers, but we all wish we were as brave as Steven, who matures as the movie goes on and we all hope the best for him as he embarks on his emotional recovery after the end of this movie. Way to go Steven! If you haven't seen this movie, see it soon! It is worth your every buck! RATING: 10 out of 10! Rent this m",
         "Could a more realistic demonstration of what it is like to be young exist than this film? Don't think so. A lot of talk centers around how hard growing up is for teenagers. Yet seldom is it mentioned that however hard it is for straight kids to grow up, it is a million times harder for gay kids, who have no one to turn to for help - not friends, not teachers, not parents, not the church, not books, not counselors, not ANYONE. This film shows what it is like. And it further shows the horrid situation that a young gay athlete finds himself in, torn between being able to do what he enjoys (sports) and being able to be himself. When you're gay, you can't have both, thanks to the homophobia which still rules athletics with an iron fist. The two main characters of this film struggle to maintain a relationship, because they are in love - yet ultimately the homophobic attitudes of the world force them to part. Tragic, yet it is a tale that plays itself out in every little town on the globe. In spite of this, it is a tale never before told on film. It's about time. This should be required viewing for all high school students.",
         "Intelligently scripted, well-crafted and exceptionally acted story of a young gay man finding his way through the adolescent wilderness. The situations that arise, when one finds themselves serving too many masters, are portrayed in a moving, heart warming manner. A great balance of relevant humor and teenage emotional tribulation is struck, without so much as a gram of maudlin melodrama, which normally crops up in films of this nature (especially American ones). In the good ol' USA, teenage development in movies tend to be played for laughs or for mawkish sentiment, which could propel whining into an Olympic event. In a short summation, Steve Carter, the main protagonist, finds the path to love strewn with thorns. His friend and counsel, Linda, walks the same road. Steve in discovering himself, discovers that anguish is also a companion to love. GET REAL does just that in such an honest, disarming way, that it exudes originality. The performances and characterizations, are far ranging and finely realized. There's not a weak link in the chain, either in performance, script execution or direction. Innovative and fresh from start to finish. A contemporary classic that is highly recommended.",
         "The lives of gay people are full of the stuff that makes for drama; inner conflicts, self acceptance, conformity, family tensions and many other issues gay people are forced to confront. Whether it's the late start or lack of a tradition, the genre of the gay movie has very little quality on offer. American cinema has been particularly weak in this area. The AIDS epidemic has been handled with more assurance than the inherent ordeals gay people face. There have been many stereotypical, predictable and basically forgettable gay movies over the years. \"The Boys in the Band\" made over 30 years ago still stands out as a major gay film; indeed a sorry state of affairs. European cinema has fared far more successfully with matters gay, with such fine works as \"Wild Reeds\" and the outstanding \"Come Undone\". It comes as much of a surprise that the stodgy British cinema should have produced some of the landmark gay movies, amongst them the brave \"Victim\" (1961) made when homosexuality was still against the law and John Schlesinger's fiercely intelligent \"Sunday Bloody Sunday\" (1970). While \"Get Real\" is no masterpiece, it certainly is one of the most important gay themed films of the past few years. Its importance lies in the lesson it so succinctly delivers. It's not a film directed especially at gay audiences and should be seen by all, especially high school audiences for whom it should be compulsory viewing. The casting of Ben Silverstone was inspired. He manages to be totally convincing throughout, even pulling off the perhaps unlikely speech he delivers in the finale. Brad Gorton as his conflicted love interest has some truly moving moments. Director Simon Shore also elicits fine performances from the secondary characters, in particular Charlotte Brittain in the fag hag, fat friend role. It could have gone very wrong in lesser hands, but Brittain is a joy to watch and brings a lovely sense of humor to the proceedings. Ultimately it's a truly unpretentious and very moving movie, far more effective than \"Beautiful Thing\". Don't miss it.",
         "A move that hits the heart in so many places. Two teenagers, one knowing of his homosexuality, and one refusing it. This is a move that I think everyone should watch. It opens up ones' mind into the complications and implications involved with the entire circle around someone who is gay. Mostly it provides an understanding into the pain and confusion one faces when they are gay. This movie will stick with me forever, and no doubt moved up to my top favorite movie of all time because of its similarity with my life and my own homosexuality. The actors, especially Brad Gorton, aren't that bad either :) He's a terrific actor with an incredible capability for realism.",
         "I've seen this film more than a few times, and each time I find something more to become enthused about - the masterful mirroring of plot elements, the subtle shadings in each character, the fantastic camera work, and so on and so forth. This is one of those movies that you can see again and again and never become tired of - for my money, it ranks up there with It's A Wonderful Life and Belle Epoque, as both an artistic success and a story of the triumph of the human spirit. The leads are magnificent - Ben Silverstone is more than a little swoonsome, and Brad Gorton switches from smooth as silk to blubbering jelly with just a twitch - and to all of you wondering why John would fall for Steven, wouldn't you want a boyfriend who makes you laugh, forces you to take risks, and to generally put yourself at ease? I know I would. Bravo to Ben and Brad and Charlotte, to Simon, Patrick and Stephen for making a movie that will stay with me for all time. Ciao, tutte!",
         "Steve is a 17 year boy, still in school. He has long since decided he is gay but only meets men in the park for sex. When one of the people he meets in the park toilets turns out to be none other than the hunky head boy, Steve is unsure where he stands. However their relationship grows into lovers and they both balance the feelings brought around by secrecy and feeling like no one understands. From the sparky opening and good sense of humour, I had expected this film would just be another in the line of Richard Curtis-lite style of British romantic comedies. Indeed it does have this feel to it throughout - it has some good songs on the soundtrack and much of it is funny in that bittersweet way that British rom-coms seem to have claimed as their own. However what made this such a good film is the fact that it is a lot more sensitive and moving than most of this genre ends up being. The plot may well drag a little at times, but it never really seems unrealistic or dull. The characters are part of the reason it does so well. It is rare in the mainstream to see gay characters portrayed fairly and without caricature - HBO's 6 Feet Under is one of the rare ones, but this does as well. I wish that all those who hold up `Will & Grace' as a milestone in gays in the mainstream could all sit and see how much better it is when done like this! The dialogue is good and none of the characters are fake or pointless. Of course some react the way you expect them to, but the fact that they have been drawn well stops them being lazy - just broad. The film is weak in some pretty important areas however. The main one being the lack of relationship between Steven and John - I never saw them together and all they had in common is their sexuality. The cast do pretty well with the characters, even if some of them are being held up by the good script. Silverstone is great in the lead - he gives a really low key performance that even extents to his `speech' scene - where he could have really hammed it up some. Gorton is not as good but does do sterling work. The support cast are mixed although all do their jobs ably enough. Overall this is a great little film that will never get the same success as the Richard Curtis comedies from which it borrows a bit of it's style, however the script is really strong and it is quite unarming in how well it deals with the issues without cliché or lazy caricature of characters.",
         "If \"Get Real\" chronicles anything, it is that messed-up jumble of a time that gay men have as teenagers, trying to be true to themselves without giving too much offense to those who abhor them. The mixed-up measures they take to express themselves and give expression to their feelings of desire and adolescent lust, suppressed by community morality and repressed by personal fear and self-hatred, unfolds over the London suburb of Basinbroke where a stick figure of a 16-year-old--Steven Carter--sits in or outside a public bathroom, trying to make contact with someone. He finds it unexpectedly with the big man on the high-school campus who garners immeasurable pleasure from their private meetings, but cannot bear the thought of being outed. The story passes through a grist mill of situations that leave the viewer with the simplistic notion that everything will be fine, if you just have the courage to be yourself with others. If it were that easy, I'm sure Brandon Teena would still be alive today. Adapted from Patrick Wilde's play \"What's wrong with being angry,\" \"Get Real\" sends a manifesto to parents and teachers about the supposed pressures they may be putting on their children, gay or otherwise. If you're willing to accept it on this level, the movie functions as an emotional release for all those pent-up gay teenagers who couldn't vent their anger and frustrations at the forces that impose on their burgeoning dreams. But if you try to take it any deeper, then you'd have to consider the internal struggles of John Dixon, the object of Steven's desire, because that is one of the few places in this movie where something is at stake. Johnny (as Steven likes to call him) travels a thornier road, and although Brad Gorton doesn't quite seem up to the challenge, his self-conscious jock does not seem so much a coward in the end as someone saddled with all the trappings of his gentrified upbringing who doesn't want to let go of them. Johnny Boy's smart, but like all teenagers, he's thwarted by desires that defy his good sense. And that is a shame, because if there ever was reason to give up everything for love, Ben Silverstone would be it. He is the real find in this picture. He's the most elegantly constructed scarecrow to touch the silver screen (Seeing him, Conrad Veidt and \"The Cabinet of Dr. Caligari\" come to mind.), and it's amazing what calm he brings to the center of this movie. Unlike newcomer Gorton, the camera loves Silverstone, and it takes him in as if he were born to be in front of it. If that weren't enough, this young actor (He is about the same age that Steve should be.) has a voice that rivals Jeremy Irons for expressiveness and majesty. Imagine him as Hamlet or Edward II or in a remake of \"Brideshead Revisited\" and that sultry sound pouring forth in velvety plenitude. Why, it's enough to make you stand up and salute the Queen Mother. With Stacy Hart as the iridescent Jessica whose dance with Steve is probably the sexiest scene in the entire movie.",
         "I have just watched this film as part of Film 4's British Connection. I felt this film was an excellent exploration of homosexuality in the heart of Middle Class Britain. I lived close to the film's location Basingstoke when this was made and am the same age (give or take a year) as the main character, Stephen. Whilst never being as confident in my sexuality as Stephen, I really connected with the story told, his relationship with his parents and the scatter-shot but inadvertently appropriate use of homophobic abuse by the bullies. Also thought the excellent flashes of dialogue uplifted the film such as \"Whenever I see that badge (Head Boy) I wish it were an invitation.\" Priceless. The performances are almost perfect through out (I was a little unconvinced by Jon the Head Boy to begin with but warmed to him hugely as the film and love story progressed.) The cinematography is suitably understated and this is not the most cinematic film ever shot, which I feel helps with the realism. Some of the symbolism is quite fantastic, especially the closing shot, which I wont spoil. I found it to be a much more recognisable film for me than Brokeback Mountain, Not to that films detriment, it is a masterpiece but I may feel closer to this because I have regularly been to the Odean in Basingstoke, but have never herded sheep on a snowy mountainside with Jake Gyllenhall. It is a simple effective narrative about a subject close to my heart and I recommend it highly.",
         "What a delicious film this is. Directed with taste and delicacy by Simon Shore and written by Patrick Wilde [a relative of Oscar?] with some pretty fantastic performances by the leads. You believe everything they go through. You feel the frustration and the embarrassing situations they run into. The conflicts, the desires, the explorations of each other's sexuality and the honesty of a special relationship. Unfortunately, in this situation, the differences of class, age and strength of character makes the outcome predictable. But, along the way it tells a beautiful love story between two guys in school [one quiet and shy, the other a popular jock on the rugby field], who by chance, happen to encounter each other's secret in a public toilet in the park. Unknowingly, they make plans by sending each other notes on toilet paper under the stalls. Then once out in the sunlight, they recognize the other's identity. Well played scene by both actors. The scene where John, the jock played beautifully by Brad Gorton, talks of his secret pleasures with other male bodies and his torment in keeping it inside of him, was wonderful. And the way Steven, played by the wonderful Ben Silverstone, held him in his arms and comforted him brought tears to my eyes. So delicate a scene. Their first kiss took my breath away. Other notable performances were by the delightful Charlotte Brittain as Steven's next door neighbor best girl buddy. Her scenes with Steven Elder as her driving instructor were hysterical. Also her fainting scene at the wedding to get Steven out of the party and to his boyfriend was funny. I also liked Jacquetta May and David Lumsden as Steven's parents. They were played with sensitivity and depth. Even though Dad had to go further in understanding his son, Mom was there. The scene where she challenges the school bully, picking on her son, brought cheers from this viewer. But, alas, we aren't granted a happy ending in this movie. The one downer in the picture. Thought the ending was weak and sort of wasted after building to such a climax. Steven's confession to his classmates, deserved better than a brush-off by John and a car ride with Linda. Boo! Up till then, a classic film with excellent acting by all. 9 out of 10 points from this viewer."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "British Screen Productions",
         "Distant Horizons"
      ],
      "summaries": [
         "This tenderly romantic film tells the story of Steve, a young man in a British prep school, as he struggles with coming out and falling in love with the class jock, John... who, amazingly, falls in love with him as well.",
         "When homosexuality was still an absolute taboo in England, sensitive rural town model student Steven Carter hides his gay feelings, except for fat neighbor girl Linda. Suddenly his desperate search for partners in male public lavatories leads to a blind date with golden boy John Dixon, bound for an Oxbridge career. Steven finds the courage to approach John by volunteering for the school paper as sports photographer. A wonderful affair follows, but John is terrified of loosing his social status. As the boys' love blossoms, so grows despair about secrecy or outing consequences.",
         "A tenderly romantic coming-of-age story as two boys in a British school fall in love."
      ],
      "budget": 0
   },
   "movielensId": 2607,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-08-16",
      "dvdReleaseDate": "2000-02-22",
      "directors": ["Simon Shore"],
      "runtime": 108,
      "movieId": 2607,
      "title": "Get Real",
      "mpaa": "",
      "actors": [
         "Ben Silverstone",
         "Brad Gorton",
         "Charlotte Brittain",
         "Stacy Hart",
         "Kate McEnery",
         "Patrick Nielsen",
         "Tim Harris",
         "James D. White",
         "James Perkins",
         "Nicholas Hunter",
         "Jacquetta May",
         "David Lumsden",
         "Morgan Jones",
         "Richard Hawley",
         "Steven Mason",
         "Steven Elder",
         "Andy Rashleigh",
         "Ian Brimble",
         "Judy Buxton"
      ],
      "imdbMovieId": "0162973",
      "originalTitle": "Get Real",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["dsqlriNlXr4"],
      "plotSummary": "A tenderly romantic coming-of-age story as two boys in a British school fall in love.",
      "tmdbMovieId": 24584,
      "avgRating": 3.80269,
      "releaseYear": "1998",
      "numRatings": 669,
      "posterPath": "/kvaOgaVZkSZEZjEnW2kt2ii891T.jpg"
   }
}