{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "architect",
            "id": 2301
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "vision",
            "id": 10629
         }
      ],
      "imdb_id": "tt0120697",
      "video": false,
      "title": "Heaven",
      "recommendations": [],
      "backdrop_path": "/6SBSLPgM54kPeGQOUtrGNbuocTZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Robert Marling",
               "gender": 2,
               "credit_id": "52fe4dd0c3a368484e1ff3f3",
               "name": "Martin Donovan",
               "profile_path": "/bNS43B8maD5A4UYSWy4UjgHru1a.jpg",
               "id": 42993,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jennifer Marling",
               "gender": 1,
               "credit_id": "52fe4dd0c3a368484e1ff3f7",
               "name": "Joanna Going",
               "profile_path": "/8wPmJGGj4HEUfaYzYjoL1AzOSlf.jpg",
               "id": 59662,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Heaven (as Danny Edwards)",
               "gender": 0,
               "credit_id": "580d2c56c3a368241301295f",
               "name": "Daniel Edwards",
               "profile_path": null,
               "id": 1698596,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Stanner",
               "gender": 2,
               "credit_id": "580d2c659251416efe011fad",
               "name": "Richard Schiff",
               "profile_path": "/gHFxL7MIGvmcbg5hhTNrbjIttQN.jpg",
               "id": 31028,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Melrose",
               "gender": 2,
               "credit_id": "580d2c7292514171a301329a",
               "name": "Patrick Malahide",
               "profile_path": "/pv65v8oEhLo0ibCz1K23UCoKMuS.jpg",
               "id": 8979,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Sweeper",
               "gender": 2,
               "credit_id": "580d2c7e9251417138012aa2",
               "name": "Karl Urban",
               "profile_path": "/tHYOUO33K7iaDw8nXyqRvDIkVuM.jpg",
               "id": 1372,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4dd0c3a368484e1ff3fd",
               "name": "Scott Reynolds",
               "profile_path": null,
               "id": 206549,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4dd0c3a368484e1ff403",
               "name": "Chad Taylor",
               "profile_path": null,
               "id": 1198615,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4dd0c3a368484e1ff409",
               "name": "Scott Reynolds",
               "profile_path": null,
               "id": 206549,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.049948,
      "production_countries": [],
      "id": 213985,
      "vote_count": 6,
      "budget": 0,
      "overview": "A struggling architect, being sued for divorce by his wife and struggling with booze and gambling, finds work remodeling a friend's strip club, the Paradise. There he meets a transsexual stripper who is bothered by accurate, but extremely violent visions of future events. The increasingly violent visions start including the architect, who doesn't believe in the prophesy. One who does however is a psychiatrist who is seeing both the stripper and the architect and is sleeping with the ex-wife. He uses the prophecies for his own financial gain. Finally the scenes from the vision move into reality amidst many plot turns.",
      "similar": [
         182560,
         9737,
         50456,
         15092,
         96,
         270303,
         694,
         161,
         755,
         263472,
         10320,
         90,
         1895,
         12163,
         35056,
         99861,
         141,
         19912,
         19913,
         674
      ],
      "original_title": "Heaven",
      "runtime": 105,
      "poster_path": "/rqMSkolEGtdQSrLoxTrpyR9qJiH.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1999-04-29",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "Every Seduction Is A Gamble.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "New Zealand",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Scott Reynolds"],
      "runtime": 103,
      "synopsis": null,
      "writers": [
         "Chad Taylor",
         "Scott Reynolds"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120697/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMzIxOTc4NF5BMl5BanBnXkFtZTcwMTkwMjUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Martin Donovan, Daniel Edwards, Richard Schiff | See full cast and crew »"],
      "reviews": [
         "I got a free TV guide with Saturday's tabloid newspaper and it described HEAVEN as \" A gambling addict contests custody of his son with his estranged wife , little knowing that she and his psychologist are having an affair \" which has got to be the most misleading synopsis ever written . I know I often criticise the info button on my remote control but this has got to be the most misleading plot summary ever written . Okay this plot thread happens in the movie but it's totally unnecessary and the movie would have benefited if it had been excluded at first draft since it comes to a literal dead end What HEAVEN is , is a violent compelling thriller with supernatural overtones . I don't really want to give too much away but it's a bit like THE DEAD ZONE meets THE CRYING GAME , rather strange , superbly directed and far far more thought provoking and touching than I was expecting .I should also mention the cast who do a good job , there might be a slight criticism in casting so many Brits , Americans and Aussies in the one movie making the location a little too cosmopolitan but hey it's an electic cast so we can overlook that . Oh and if you're wondering where you've seen \" The Sweeper \" he's the Rohan horseman from LORD OF THE RINGS and the psychologist creep used to be Chisholm from MINDER If you like indie films I can certainly recommend it . If you like down beat movies I recommend it , and if you dislike the pop corn garbage that Hollywood has been producing for the last few years then boy do I recommend HEAVEN . Bare in mind however it's a thriller - not something the TV guide mentioned",
         "Last night I watched \"Heaven\" on television. I was about to skip it because I hadn't heard nothing about it. Luckily, I stayed tuned. And I say luckily because it's one of the best films that I've seen lately. \"Heaven\" is a marvelous conjunction of neo-noir drama with a surprising touch of magic realism. The story-line is so original that caught me in a while. The film construction is puzzling, but never confusing, and helps the film to be even more thrilling and fascinating than it's promising premise allowed us to expect. The editing job here is really remarkable; I'd dare to say it is, along with \"Pulp Fiction\" and \"Memento\", one of the most coherent and creative works seen in the nineties American filming. Martin Donovan is excellent, as well as the rest of the cast, but if you look for one unforgettable character, the travesty Heaven, sweet, strong in her weakness and with the surprising ability to anticipate the fate of those who surround her, will immediately catch your eye. After watching \"The ugly\" and this extraordinary piece of film art, I'm really looking forward to see Scott Reynold's new project.",
         "Robert Marling is a struggling architect who is a gambling addict, a drunk and separated from his wife. His wife is filing for divorce, seeking sole custody of their son and chasing Robert for more money than he has. The reason she is after the money is because she is having an affair with Dr Melrose, who is treating a stripper called Heaven. Heaven has a gift of premonition and she has seen Robert winning a lot of money from her boss, Stanner, in a card game. However, in her sessions with Melrose, Heaven tells him these visions - information he feeds to Jennifer's lover. Heaven also shares this information with Robert and, as a result, they get closer - however Heaven is also haunted with dark, violent visions of the future that she cannot fully understand. I confused this film with another one of the same title when I videoed it last week. Despite this I decided to give it a try anyway and see if it was any good and I'm glad I did - which is not to say that I'm proclaiming this film for everyone. The plot is never less than weird, and this is possibly the only way to describe it. It goes places that I didn't expect and it goes there in moments of sudden pace changes or sudden violence. This is made more impacting by the non-linear way that the story is told, other reviewers have compared it to the backwards telling in Memento but it is not to that extreme. However we do quite often see consequences before the film shows us the actions that caused them. For the most part this seems to work really well, even if I would find it difficult to really explain why. What I do know is that the story and the manner of the telling served to pull me along with it effortlessly for the whole running time. The only word of warning would be that the film is quite graphically violent at times and the whole subject matter is unrelentingly dark. The cast is a very strange mix that really reflects the strange mix of characters that are depicted. Mixing actors from America with those from New Zealand and Australia has a slightly confusing effect (at the start I thought it was happening in two different time zones) but the majority of them are worth this minor quibble. Donovan is nearly always watchable and he is here again, giving a great performance in a difficult role. Even more surprising is Danny Edwards, who plays Heaven without cliché and manages to make such an unlikely person into a character that I cared about. Schiff is a surprise and is very different from the West Wing character who I always see him as now; the film also has a pre-lord of the rings role for Karl Urban - he has not much character but he has a good presence. Going and Malahide are OK but really the film belongs to Donovan and Edwards (and to a lesser extent, Schiff) and they carry it well. Of course by `belongs to them' I mean in the acting stakes as the film is very much the property of writer/director Reynolds. He gives the whole film a great feel and has written a script that could easily have been silly and exaggerated and it is to his credit that in his hands it only manages to be involving and really enjoyable. Overall this is a great film that pleased me even more by the fact that I found it by chance. I'm sure many viewers will be put off by the character of Heaven, or the unexplained nature of her gift, or the way the film goes extreme places or even the fact that bits are told out of sequence, however I hope that most viewers will see these aspects as strengths - strengths that were held together by a writer/director who I will be looking out for from now on.",
         "New Zealand director Scott Reynolds has a flair for getting into viewers heads while they watch, and this was very apparent in his previous film, The Ugly. Time seems to be a force in this film as well, by playing with the sequence of events, going forward and back. Fortunately, we seem to understand what happens (like the constant time playing in the film Siesta), and become more involved with what is happening to the characters. Gambling addictions, child custody, seedy strip joints, and even a psychic all weave a fascinating situation that could help or destroy all involved. Despite its rough nature, it still manages to be a very satisfying experience. One you will tell friends you have to see to believe. It does deserve notice as a unique film and hopefully word of mouth will help get this film the recognition it deserves.",
         "This film, shown at both the Montreal and Toronto film festivals, is so original that its merits passed over the heads of the busy reviewers. Scott Reynolds uses a very clever device to allow the viewer to suspend disbelief that one of the characters could accurately foretell the future. Heaven, the seer, is a transvestite stripper in a regular strip club. The viewer focuses on this improbability and lets the improbability that someone can foresee the future slip into the film's reality. Having created a believable character that can and does foretell the future, Reynolds is then faced with another problem. How to keep the viewer from knowing the future. He accomplishes this with a series of carefully staged flashbacks (and flash forwards) that, although accurate, are out of sequence and therefore lead the viewer to believe in a series of events that is not accurate. I have never seen a more cleverly thought up, worked out and executed script. With his plan in place, Reynolds creates one of the most improbable plots imaginable, but because we have moved beyond suspending disbelief and become believers, one that seems very probable. Richard Schiff superbly portrays the character of the strip club owner, Stanner. Stanner has hired Heaven and brought him/her under his wing because he has turned Heaven's ability to foretell the future into profits. Stanner, however, is also involved with Robert Marling, played by Martin Donovan (II). I would continue to say superbly, but the fact is, the acting in the film is first rate all around. Marling is going through a bitter divorce with the stunning Joanna Going as Jennifer Marling. Jennifer is seeing the sleazy psychiatrist Dr. Melrose played by Patrick Malahide. And in the pivotal coincidence, Heaven is also seeing the unbelievably evil (but nonetheless believable) Dr. Melrose because Heaven's visions of the future trouble him/her deeply (the visions, not the sexual ambiguity). Marling is a down and out gambling addict, an architect who is designing a new club Stanner has commissioned with the millions he has earned from following Heaven's visions of the future. Marling is forever losing money to Stanner in poker games. Heaven sets the plot in motion by foreseeing Marling saving him from being viciously murdered by two sadistic thugs. Heaven sets out to reward Marling by using his/her foretelling abilities to feed Marling information on how the cards will fall in his poker hands with Stanner. Evil Dr. Melrose discovers this in his sessions with Heaven. He seduces Jennifer. Advising her on her divorce settlement, the bad doctor tells Jennifer to hold out for the fortune her husband is about to come into as a result of Heaven's foretelling, intending to take the fortune for himself. Stanner has plenty of cash but can't resist playing the angles, deciding to burn down his club to make way for the new one designed by Marling. He hires two homicidal maniacs to do the task for him, the same two sadists Heaven foresees murdering him, and it is these two who initiate the mass slaughter that makes the film so violent. This film is a sleeper. It will be discovered, its clever features copied and it will become a classic. Scott Reynolds does not have a large body of work, but any director or writer would be proud to have this film to their credit.",
         "I almost didn't stay with this. \"Heaven\" is constantly shifting focus between the future and the present. And I'm not one to watch out of the norm sexual actors (in this case there's a transvestite). But I hung in and was engrossed in the movie. There are a lot of twists and turns which are very well handled. As a result, at various points, what you think is or has happened, may not have. I doubt anyone can guess the ending ahead of time. It's not what you expect. For what \"Heaven\" was trying to achieve, it did so in Aces. And I applaud the actors and director for that. It took a lot of vision to make sense of this and pull it off in the end.",
         "Not only was 'Heaven' a straight-to-DVD affair but it was also a joint production between Miramax and producers in New Zealand. Hence, half the actors in the film are American and the other half are from New Zealand. The locale of the film is never identified and it's very odd to hear the husband and wife protagonists speak in an American accent while their young son speaks in a New Zealand accent. 'Heaven' is a strange movie. It's about this down-on-his-luck architect, Robert Marling going through a bitter divorce who fears losing custody of his young son vis-à-vis his estranged wife, Jennifer, who he is now separated from. Robert takes a job working for a sleazy strip club owner by the name of Stanner. 'Heaven' appears to be a pre-op transsexual who works for Stanner at the club. Despite the fact that Stanner often brutalizes Heaven, Robert turns a blind eye to Stanner's vile and demeaning behavior. We're asked to believe that Robert (who has a strong moral code as evidenced by his later acts of heroism in saving Heaven from being raped by two local punks as well as attempting to save his son after the boy is kidnapped) would simply tolerate Stanner's repulsive treatment of Heaven because he needs the work and also must support a gambling habit. So at times his failure to stick up for Heaven coupled with being overly chummy with the despicable Stanner, undermines his portrait as a sympathetic protagonist. Heaven's trans-sexuality not only makes her the victim of Stanner's controlling personality but she's also victimized by the film's two other (lesser antagonists)\u0097Jennifer's psychiatrist boyfriend, Melrose, and two nasty bar patrons who Stanner likes for some reason. Heaven is psychic and predicts the two central (and at times, overlapping) events of the film: Robert's mugging and his later intervention, saving Heaven from being raped. We never learn why Heaven has these special powers and it's rather convenient in terms of moving the plot forward when you have a character who can do such extraordinary things. The film's scenarist doesn't help things with a storyline that features events occurring in a non-linear fashion (there are flashbacks and flash forwards and cross-cutting of dialogue that adds to the general confusion). A good part of the story involves Jennifer's ill-fated romance with her sleazy psychiatrist, Melrose, and subsequent attempt to gain custody of her and Robert's child. Heaven ends up surreptitiously taping Melrose who sexually assaults her (she's also a patient of the shrink) and hands the tapes to Robert who plays one of them at the custody hearing, exposing Melrose as a liar and a criminal. The plot becomes even more frantic when Stanner decides to torch his own club for insurance purposes only to be shot by the two buddies he hires. Finally, Robert saves Heaven from the two punks and he in turn is saved by \"The Sweeper\", the bouncer who Stanner had fired earlier after getting into a confrontation with the two murderous punks. One of central implausible moments in 'Heaven' is when Stanner fires The Sweeper. At the beginning of the film, he praises him as the best bouncer who's ever worked for him. But after The Sweeper confronts the two punky bad guys, Stanner takes their side and fires him. Why would a strip club owner who presumably needs to keep his business going by keeping order, fire a competent bouncer and stick up for a bunch of low-life's who could easily make trouble for him? Unless of course he knew all along that he was going to hire the punks to set the club on fire\u0097but that's never made clear at the film's outset. The main problem with Heaven is with the character of Stanner who is so vile that one cannot believe in him at all. The trick in creating believable antagonists is to give them both sympathetic and unsympathetic attributes. Stanner's 'charming' moments are few and far between. Melrose is a much more sinister and believable bad guy. Heaven (as well as 'The Sweeper') are drawn to the other extreme. They are wholly 'too good', too sympathetic and serve no other function than wearing the mantle of undeserved victim-hood. Robert and Jennifer's tussles are pretty standard stuff, although I think it was a nice touch that Robert doesn't run back to his wife and stay with her in the end. 'Heaven' aspires to be a gritty fairy tale and moves along at a fairly brisk pace. While not always plausible, the film's strength is in its plot. Despite the multitude of unfolding, quirky events, one doesn't care for or believe in these characters. I've alluded to the problems earlier: Stanner's lack of virtually any redeeming qualities; the unexplained quality of Heaven's visions and her one-dimensional portrait as pure victim and Robert and Jennifer's rather pedestrian custody battle. 'Heaven' explores evil only on the surface. It's an unpleasant, trashy potboiler worth watching, but certainly not more than once.",
         "Scott Reynolds may not exactly be well known; but his excellent 2001 thriller When Strangers Appear really took me by surprise, and while Heaven is not as accomplished as the aforementioned film, it's still a very good thriller that takes in multiple different elements, which are somehow combined into a mostly coherent whole. Like many post-Pulp Fiction crime thrillers, this one features a fragmented plot which is told through various flashbacks. The main character is Robert Marling; a man with a gambling addiction. He is recovering from a nasty split with his wife Jennifer, who also wants custody of their son. Robert is friends with Stanner; the proprietor of a strip club and employer of transvestite dancer Heaven. Heaven has an unusual ability to see into the future and takes a shine to Robert when she recognises him from one of her premonitions. The plot thickens when it emerges that the psychologist treating Robert is having an affair with his wife and also treating Heaven... Most of the film is kept within the realms of possibly; the only exception to this being the mystical abilities of the title character, which comes off as being a little strange despite being integral to the plot. Initially, I had the film pegged as a rip-off of The Crying Game; but actually it doesn't make a meal of its gender-bending lead character at all. The plot does flow surprisingly well considering that it is put forward in a fragmented manner; the strong screenplay manages to put everything across in such a way that it all makes sense. There's no shortage of memorable characters, with strip club owner Stanner standing out most in that respect. The strip club itself is very well done and the director ensures that it has a fantastically sleazy atmosphere; it's just a shame that it isn't featured more! The ending is suitably strange and ambiguous; therefore suiting the film well. All in all, this is not quite a brilliant thriller; but it's well made and gripping for the duration and therefore I recommend it.",
         "Danny Edwards, Martin Donovan, and Richard Schiff as the starring threesome have indescribably excellent interwoven chemistry. The director shows us things in non-chronological order, but unlike the overblown Pulp Fiction, most definitely not random, and ties it all up beautifully before all is said and then. The seamy soundtrack, classic set-up antihero with an heroic heart, and dark alleyways and dance club make a perfect backdrop for the films neo-noirist construction. The fast pacing is also a plus. The only nit I feel compelled to pick are two actors who clearly were not on the same page with the rest of the film. The actor playing the unscrupulous psychiatrist does everything but twirl a mustache to let you know he's evil before we're even supposed to realize that. And, the young actor playing Martin Donovan's son seems to be looking at the camera, not his father, far too often. Everyone else was absolutely terrific. Danny Edwards is magnificent in the \"Crying Game\" type role.",
         "Although the technique is used with greater skill in \"28 Grams,\" \"Heaven\" uses a back-and-forth-in-time editing technique to keep the viewer on their toes and constantly thinking. The technique always reminds me of a friend telling a long complicated tale who will break to say, \"Oh, I forgot to tell you, before we went A-B-C, there was this incident where X-Y-Z happened.\" Not a good way to explain it, but I find it an interesting way to let a story unfold. Danny Edwards plays a transsexual, not a transvestite (as the previous reviewer erroneously identified the character-- there is a major difference between the two) and does a splendid job creating a believable and sympathetic character. If the film lacks anything, it's that no one seems to have a cell phone right when when would come in handy (and be expected.) It's also never explained why Robert Marling (the architect character at the story's center) supposedly only has \"$200 in the bank\" in one scene, only to be gambling two grand just hours later. There is one sloppy edit where the bouncer, Sweeper, turns away from a jerk he's just smacked away from the strip club, that quick cuts to a close up where his face is turned another direction, then cuts back to the first camera angle. Other than that, the time shifts in the editing are what keep the movie fresh and interesting."
      ],
      "genres": [
         "Crime",
         "Thriller"
      ],
      "productionCompanies": [
         "Miramax",
         "Midnight Film Productions Limited"
      ],
      "summaries": ["A struggling architect, being sued for divorce by his wife and struggling with booze and gambling, finds work remodeling a friend's strip club, the Paradise. There he meets a transsexual stripper who is bothered by accurate, but extremely violent visions of future events. The increasingly violent visions start including the architect, who doesn't believe in the prophesy. One who does however is a psychiatrist who is seeing both the stripper and the architect and is sleeping with the ex-wife. He uses the prophecies for his own financial gain. Finally the scenes from the vision move into reality amidst many plot turns."],
      "budget": 0
   },
   "movielensId": 2608,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-29",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["Scott Reynolds"],
      "runtime": 105,
      "movieId": 2608,
      "title": "Heaven",
      "mpaa": "R",
      "actors": [
         "Martin Donovan",
         "Joanna Going",
         "Daniel Edwards",
         "Richard Schiff",
         "Patrick Malahide",
         "Karl Urban"
      ],
      "imdbMovieId": "0120697",
      "originalTitle": "Heaven",
      "genres": [
         "Crime",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A struggling architect, being sued for divorce by his wife and struggling with booze and gambling, finds work remodeling a friend's strip club, the Paradise. There he meets a transsexual stripper who is bothered by accurate, but extremely violent visions of future events. The increasingly violent visions start including the architect, who doesn't believe in the prophesy. One who does however is a psychiatrist who is seeing both the stripper and the architect and is sleeping with the ex-wife. He uses the prophecies for his own financial gain. Finally the scenes from the vision move into reality amidst many plot turns.",
      "tmdbMovieId": 213985,
      "avgRating": 3,
      "releaseYear": "1999",
      "numRatings": 54,
      "posterPath": "/rqMSkolEGtdQSrLoxTrpyR9qJiH.jpg"
   }
}