{
   "tmdb": {
      "original_language": "zh",
      "keywords": [
         {
            "name": "china",
            "id": 478
         },
         {
            "name": "deception",
            "id": 9758
         },
         {
            "name": "street performer",
            "id": 217807
         },
         {
            "name": "master and student",
            "id": 229409
         }
      ],
      "imdb_id": "tt0115669",
      "video": false,
      "title": "The King of Masks",
      "recommendations": [
         48812,
         71313,
         40062,
         43121,
         37959,
         26481,
         21121,
         14735,
         24643,
         102195
      ],
      "backdrop_path": "/e7EgM7SmVTchMNroJms7LSx5Wz7.jpg",
      "revenue": 1,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1006,
               "character": "Bian Lian Wang",
               "gender": 0,
               "credit_id": "56b96dae92514106a400131b",
               "name": "Zhu Xu",
               "profile_path": "/3SEkP8JS0icTxzy6JxRFflzOZUV.jpg",
               "id": 15168,
               "order": 1
            },
            {
               "cast_id": 1007,
               "character": "Doggie",
               "gender": 0,
               "credit_id": "56b96de892514106a1001310",
               "name": "Chow Yam-Ying",
               "profile_path": null,
               "id": 1574703,
               "order": 2
            },
            {
               "cast_id": 1008,
               "character": "Liang Su Lan",
               "gender": 0,
               "credit_id": "56b96df2c3a3681e7d001400",
               "name": "Chiu Liu-Kong",
               "profile_path": null,
               "id": 1191994,
               "order": 3
            },
            {
               "cast_id": 1009,
               "character": "Wen Tian Ci",
               "gender": 0,
               "credit_id": "56b96dfec3a3681e60001319",
               "name": "Cheung Shui-Yeung",
               "profile_path": null,
               "id": 1574704,
               "order": 4
            },
            {
               "cast_id": 1010,
               "character": "Ms Wen",
               "gender": 0,
               "credit_id": "56b96e1492514106a1001319",
               "name": "Chan Lee",
               "profile_path": null,
               "id": 1574705,
               "order": 5
            },
            {
               "cast_id": 1011,
               "character": "Slave trader who sold Doggie",
               "gender": 0,
               "credit_id": "56b96e2292514106ac001355",
               "name": "Wong Siu-Kei",
               "profile_path": null,
               "id": 1574706,
               "order": 6
            },
            {
               "cast_id": 1012,
               "character": "Ci's wet nurse",
               "gender": 0,
               "credit_id": "56b96e2dc3a3681e640012df",
               "name": "Dung Kin-Laam",
               "profile_path": null,
               "id": 1574707,
               "order": 7
            },
            {
               "cast_id": 1013,
               "character": "Li Xiang",
               "gender": 0,
               "credit_id": "56b96e3a92514106aa0013b1",
               "name": "Poon Hung",
               "profile_path": null,
               "id": 235190,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036e45",
               "name": "Wu Tian-Ming",
               "profile_path": null,
               "id": 552613,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036e4b",
               "name": "Minglun Wei",
               "profile_path": null,
               "id": 552614,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44c9c3a368484e036e51",
               "name": "Mona Fong",
               "profile_path": "/3hpmsYjWWNChzjGzu2hu5epb6Ai.jpg",
               "id": 70676,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036e57",
               "name": "Titus Ho",
               "profile_path": null,
               "id": 552615,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036e5d",
               "name": "Jiping Zhao",
               "profile_path": null,
               "id": 65285,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44c9c3a368484e036e63",
               "name": "Da-Yuan Mu",
               "profile_path": null,
               "id": 552616,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.98494,
      "production_countries": [
         {
            "iso_3166_1": "CN",
            "name": "China"
         },
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         }
      ],
      "id": 25471,
      "vote_count": 15,
      "budget": 0,
      "overview": "Wang Bianlian is an aging street performer known as the King of Mask for his mastery of Sichuan Change Art in a true story. His wife left him with and infant son over 30 years ago. The son died from illness at age 10. This left Wang a melancholy loner aching for a male descendent to learn his rare and dying art.",
      "similar": [
         746,
         10110,
         311324,
         2253,
         4951,
         55292,
         58595,
         256591,
         2652,
         264660,
         26389,
         1572,
         49527,
         20526,
         291805,
         140300,
         9502,
         1735,
         956,
         714
      ],
      "original_title": "变脸",
      "runtime": 91,
      "poster_path": "/w9c6qw4TiOP5oY9zlh2UL5zyoQ4.jpg",
      "spoken_languages": [{
         "name": "普通话",
         "iso_639_1": "zh"
      }],
      "production_companies": [{
         "logo_path": "/nPGLMS26OKdu6T7RYakXGYVXFzK.png",
         "name": "Shaw Brothers",
         "id": 5798,
         "origin_country": ""
      }],
      "release_date": "1997-12-20",
      "vote_average": 8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "China",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tian-Ming Wu"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Wengui Chen",
         "Minglun Wei"
      ],
      "originalLanguage": "Mandarin",
      "imdbLink": "http://www.imdb.com/title/tt0115669/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2MDkxMDEzNl5BMl5BanBnXkFtZTcwMjg2NDUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Zhigang Zhang, Zhigang Zhao, Renying Zhou | See full cast and crew »"],
      "reviews": [
         "I just saw this movie today with my children (son, 10 and daughter, 4.5) at the 3rd Annual Roger Ebert Overlooked Film Festival. After the film the children in the audience were allowed to ask questions to the Director, Tian-Ming Wu. He (through a translator) told several stories about his life and the making of the film. All tangents aside, both of my children really enjoyed this movie. Of course, I had to paraphrase many of the subtitles for my daughter, but much of the film is visually self-explanatory. I won't give anything away, but the bottom line is that this film is SO MUCH better than 95% of the Hollywood crap (especially children's films) out there. Cheers. p.s. There is a \"real\"/original King of Masks who can/could do 12 masks at once. The actor in the movie trained and learned to do up to 4 masks at a time (then they would cut and change to 4 new masks).",
         "This spectacular film is one of the most amazing movies I have ever seen. It shows a China I had never seen or imagined, and I believe it shows 1930's China in the most REAL light ever seen in a movie. It is absolutely heart-breaking in so many situations, seeing how hard life was for the characters, and yet the story and the ending are incredibly joyful. You truly see the depths and heigths of human existence in this film. The actors are all perfect, such that you feel like you have really entered a different world. I simply can not recommend this movie highly enough. It may just change you forever once you have seen it.",
         "\"The world is a cold place, but we can bring warmth to it.\" - Master Liang Predictable, manipulative, and emotional? Yes, but if you still have a heart that beats, you may find Wu Tianming's 1996 film, The King of Masks, to be a moving and memorable experience. Beautifully photographed in gorgeous color, the film tells the story of Wang Bianlian, a lonely old street performer with rotting teeth who lives in a houseboat on the Yangtze and is a master of the art of \"face-changing\". This involves putting on and taking off silk masks in the flash of a second so that the process is almost invisible to the eye. In the highly patriarchal society of the 1930s, this sort of magic could only be performed by a male; therefore, Wang, abandoned by his wife and children many years ago, must now find a boy to carry on his tradition or it will die forever. When a famous transgender opera performer called the Living Bodhisattva, Master Liang (Zhao Zhigang) offers him a job in his acting troupe, Wang declines and decides he must find his own \"grandson\" to pass down his gift to. Thinking \"she\" is a \"he\", Wang goes to a slave auction and buys a sad eyed little eight-year old for $5 in a dark alley. He calls her \"Doggie\" (Zhou Renying) and takes his new companion to live with him and his beautiful monkey \"General\" (who comes close to stealing the show). When Wang accidentally discovers that Doggie is a girl, he is ready to cast her out, but having been sold seven times previously, she begs to stay. Xu Zhu, an outstanding actor in the Beijing People's Artistic Theater, portrays Wang as a man still operating within the rules of society but one who is full of kindness and good humor. Out of compassion, the old man agrees not to teach Doggie the art of masking but allows her to stay as a servant and to learn acrobatics to perform in his act. Both social outcasts, the two form a friendship based on mutual need and longing. Cutting to scenes from a Chinese opera, Attaining Nirvana, attended by Wang and Doggie, in which a princess, upset over her father's suffering, vows to find and comfort him in the underworld. Sacrificing herself, she becomes a Bodhisattva. This mirrors the emotional pivot of the film when Doggie, now lovingly devoted to \"Grandpa\" (whom she must call \"Boss\"), is willing to sacrifice herself to help him when he is in serious trouble with the authorities. King of Masks is a work of warmth and tenderness, yet is also an indictment of the emotional harm caused by gender preference in society. Zhou (Doggie) is so real in expressing her feelings of being unloved and unworthy that her performance is truly radiant (she is an orphan who performs acrobatics in real life). One of the most poignant moments in the film occurs when Doggie picks up a statue of a Bodhisattva and asks Wang, \"you worship her, don't you?\" Tianming, who returned to China in 1995 after a prolonged absence, stated: \"I wanted to make this film\", he said, \"because I fear that society is forgetting our Chinese traditions. Those traditions emphasized the value of morality and ethics, proper manners, a sense of honor, and taking care of each other\u0085Through this story of an old man and a child in a world full of struggle and suffering, I wanted to express the importance of love.\" He has succeeded far beyond his expectations and, in the process, has elevated us to a new level of understanding and compassion.",
         "The fact that this film was put out on DVD still formatted-to TV and with a fuzzy picture really annoyed a lot of film purists......and rightly so. This deserves a lot better treatment. The story is about a street performer who needs a son to pass on his craft (the rules of the day) and winds up with a little girl instead (not the conventional way) ....and the problems that ensue afterward. The old man had bought the kid at a slave auction and soon discovers the kid is not a boy, which he obviously thought was the case. The old man \"Bianlian Wang (Xu Zhu)is kind of funny-looking with a missing front tooth and an infectious grin. The little girl \"Doggie\" (Zhou Renying) is a cutie. The rest of the story is how the two manage after that. I usually like a nice sentimental ending but this gets a bit carried away in the final 15 minutes. Overall, it's involving story complete with drama, suspense, humor and sadness. Just don't expect a good quality picture for the money you are spending on the DVD. Until it comes out on widescreen, rent it.",
         "The movie is truly poignant, unique and uplifting. The story is universal in that it's a battle between good, evil and the world between. THE MOST IMPORTANT thing is that its rating is wrong, misleading, and a travesty. Blockbuster has it rated as though it were an X rated movie. The truth is is that it is closer to G than PG and should be seen by children who can read the clear and simple sub-titles.",
         "This is a beautiful, rich, and very well-executed film with a rich and meaningful story. Basically, it tells how an old master story teller needs to find a (male) heir to carry on his craft, but ends up not getting what he expected in his very male-dominated world. The characters must then deal with their situation and the old master must grapple with the conflict between his desire for a companion and heir and his and society's traditional notions. The story is fun, emotional, and complex. The exploration of the characters, their lives, and emotions, is rich and compelling the character development is strong while the characters are complex and not one dimensional at all. The film expertly conveys the old man's emotions and his desire to find an heir, and compellingly shows how he and the kid handle the situation. There is also humour, sometimes quite subtle, at appropriate points. The film also examines the good and bad of traditional Chinese culture, creating further interest and depth to the film. The directing, acting, and scenery are all outstanding. Added to the other strengths, this creates rich and convincing visual images and compelling, real characters. As a result, the film evokes strong empathy for, and feelings about, the characters. Some have claimed that the ending weakens the film, but I do not necessarily agree. Perhaps it could have been stronger with a different ending, but any improvement in the overall film would have been rather small.",
         "This movie reminded me of Mulan- only because I saw Mulan first. It was a great film, and as an Asian female and a first-generation American, I found myself relating to \"Doggie\" (the little girl; by translation). I usually don't cry during movies (and I don't think being 8 and watching The Land Before Time counts), but I do admit my eyes did water up. I was impressed at the production quality of this film and I appreciated the accuracy of its set period. It's imagery was hauntingly beautiful and throughout the film I was questioning this film's budget (The Red Violin as well)- I was contemplating how they were able to afford props and costumes and still be able to release, promote and distribute the film at the same time. The King Of Masks is one of those wonderful pieces of International Cinema that almost everyone can agree on.",
         "In the rapid economic development of 1990's in China, there is a resurgence of traditional Chinese culture, partially due to the rise of nationalism accompanied by the increase in wealth, and more importantly, due to the sense of spiritual belonging after the collapse of the old socialist ideology in the post Cultural-Revolutionary era. However, the resurgence of Chinese traditional culture, namely, the Confucianism, was not without disasters, because Chinese are adopted the entire tradition without eliminating the bad part, and the discrimination against girls demonstrated in this film is an excellent example. Moreover, not only the part that should be discarded were inherited, the good part that was supposed to be inherited, such as the traditional opera, and its technique, such as changing face, was ignored in the resurgence, and facing extinction. The director used this film to criticize the problem of re-embracing tradition by contemporary China and this is the deeper meaning behind the movie.",
         "It was a delightful surprise! This movie does not have Gong Li as a lead actress, but it has the quality that beats any other Chinese movies I've seen. I watched 3 Chinese films yesterday: \"Crouching Tigers, Hidden Dragons\", \"The Emporor and the Assasin\" and \"King of the Masks (Bian Lian)\". Despite of the high profiles of the other two, \"King of the Masks\" is the only one that left tremendous impression on me. It is a beautiful, touching film. Well done.",
         "I enjoyed the cinematographic recreation of China in the 1930s in this beautiful film. The story is simple. An older male performer wants to pass on his art to a young man although he has no living children. The faces of the actors are marvelous to see. The story reveals the devotion and gratitude of children to those who treat them well and their longing to be treated well. The operas in the film remind me of FAREWELL MY CONCUBINE, which was more sophisticated and intricate. The story here reminds me of a Dickens tale of days when children were almost chattel. The plot is a bit predictable and a bit too sentimental for me but well worth the time to view for the heroism, humanity, and history portrayed."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Shaw Brothers"],
      "summaries": [
         "Wang Bianlian is an aging street performer known as the King of Mask for his mastery of Sichuan Change Art in a true story. His wife left him with and infant son over 30 years ago. The son died from illness at age 10. This left Wang a melancholy loner aching for a male descendent to learn his rare and dying art. A famous master performer of the Sichuan Opera offers to bring him into his act, thus giving Wang fame and possible fortune, but Wang opts for staying the simple street performer. Then, one night after a performance he is sold a young boy by a slave trader posing as the boy's parent. \"Grandpa\" finds new joy in life as he plans to teach \"Doggie\" (an affectionate term often used for young children in China) his art. All is well until Doggie is found out to really be a girl.",
         "Master Liang, a famous impersonator of female parts at the Sichuan Opera, is enchanted by the art of the street performer Wang, known as the King of Masks. He offers him an engagement at the opera, but Wang says he is a solitary by nature. His only sorrow is that he has no male descendant who can carry on the art of the changing masks after his death. To solve the problem Wang buys an 8 year old orphan. His happiness turns into dejection, when he finds out that \"the boy\" actually is a girl. Despite his displeasure he keeps the girl and trains her as an acrobat. One evening he takes her to a performance of the opera \"Attaining Nirvana\". There Master Liang plays a princess, who hangs from the ceiling by a rope, which she threatens to cut if the officers don't stop the execution of her father, the emperor. Some days later the girl rescues a 4 year old boy from his confinement by some child-traders. Believing he is an orphan, she brings him to Wang, who she knows is longing for a male inheritor. But the boy is actually kidnapped from a wealthy family, and soon Wang is accused of the robbery and sentenced to death. To persuade Master Liang to help her rescue Wang, the girl climbs the roof of the opera house, ties a rope around her leg and hangs to it from the ceiling. She threatens to cut the rope, and when she actually does this, Master Liang throws himself forward and catches her. He is moved by her action and decides to do whatever he can to help the girl rescue Wang."
      ],
      "budget": 0
   },
   "movielensId": 2609,
   "movielens": {
      "languages": ["普通话"],
      "releaseDate": "1997-12-20",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Wu Tian-Ming"],
      "runtime": 91,
      "movieId": 2609,
      "title": "The King of Masks",
      "mpaa": "",
      "actors": [
         "Zhu Xu",
         "Chow Yam-Ying",
         "Chiu Liu-Kong",
         "Cheung Shui-Yeung",
         "Chan Lee",
         "Wong Siu-Kei",
         "Dung Kin-Laam",
         "Poon Hung"
      ],
      "imdbMovieId": "0115669",
      "originalTitle": "变脸",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["EDwo1XKW0Fs"],
      "plotSummary": "Wang Bianlian is an aging street performer known as the King of Mask for his mastery of Sichuan Change Art in a true story. His wife left him with and infant son over 30 years ago. The son died from illness at age 10. This left Wang a melancholy loner aching for a male descendent to learn his rare and dying art.",
      "tmdbMovieId": 25471,
      "avgRating": 3.93924,
      "releaseYear": "1997",
      "numRatings": 502,
      "posterPath": "/w9c6qw4TiOP5oY9zlh2UL5zyoQ4.jpg"
   }
}