{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "poetry",
            "id": 496
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "vietnam",
            "id": 2956
         },
         {
            "name": "leprosy",
            "id": 3341
         },
         {
            "name": "flower girl",
            "id": 4485
         },
         {
            "name": "song",
            "id": 4528
         },
         {
            "name": "daughter",
            "id": 5600
         },
         {
            "name": "post war life",
            "id": 209205
         }
      ],
      "imdb_id": "tt0138874",
      "video": false,
      "title": "Three Seasons",
      "recommendations": [],
      "backdrop_path": "/4iUnp2ORQfdo7IDqcwCT3BaRVMF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "James Hager",
               "gender": 2,
               "credit_id": "52fe43afc3a36847f8067a3f",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hai",
               "gender": 2,
               "credit_id": "52fe43afc3a36847f8067a43",
               "name": "Đơn Dương",
               "profile_path": "/4TnIrHndZiau0zjvbCfFkrNwZno.jpg",
               "id": 35053,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Kien An",
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a47",
               "name": "Ngoc Hiep Nguyen",
               "profile_path": null,
               "id": 35054,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Meister Dao",
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a4b",
               "name": "Manh Cuong Tran",
               "profile_path": null,
               "id": 35055,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Lan",
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a4f",
               "name": "Diep Bui",
               "profile_path": null,
               "id": 35056,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Woody",
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a53",
               "name": "Huu Duoc Nguyen",
               "profile_path": null,
               "id": 35057,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Hagers Tochter",
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a57",
               "name": "Lola Guimond",
               "profile_path": null,
               "id": 35058,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a3b",
               "name": "Tony Bui",
               "profile_path": "/yvYiE6pVcc8FNu70AotIczw2SEZ.jpg",
               "id": 35052,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a5d",
               "name": "Tony Bui",
               "profile_path": "/yvYiE6pVcc8FNu70AotIczw2SEZ.jpg",
               "id": 35052,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a63",
               "name": "Tony Bui",
               "profile_path": "/yvYiE6pVcc8FNu70AotIczw2SEZ.jpg",
               "id": 35052,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43afc3a36847f8067a69",
               "name": "Jason Kliot",
               "profile_path": null,
               "id": 13233,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43afc3a36847f8067a6f",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a75",
               "name": "Richard Horowitz",
               "profile_path": null,
               "id": 35059,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43afc3a36847f8067a7b",
               "name": "Lisa Rinzler",
               "profile_path": null,
               "id": 5271,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a81",
               "name": "Keith Reamer",
               "profile_path": null,
               "id": 35060,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a87",
               "name": "Quan Lelan",
               "profile_path": null,
               "id": 35061,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a8d",
               "name": "Wing Lee",
               "profile_path": null,
               "id": 21971,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43afc3a36847f8067a93",
               "name": "Thai Van Hoang",
               "profile_path": null,
               "id": 35062,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.42754,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "VN",
            "name": "Vietnam"
         }
      ],
      "id": 4154,
      "vote_count": 8,
      "budget": 0,
      "overview": "Three Seasons wants to show individuals triumphing over adversities, recovering from traumas, looking forward to better times, as well as nostalgia for those better days before American and French and other invasions, material and ideological. It is a poetic film that tries to paint a picture of the urban culture undergoing westernisation.",
      "similar": [
         1904,
         13,
         1427,
         600,
         7972,
         1368,
         1369,
         49519,
         50270,
         10999,
         26973,
         116711,
         466,
         157847,
         19724,
         1279,
         649,
         842,
         6963,
         11909
      ],
      "original_title": "Three Seasons",
      "runtime": 105,
      "poster_path": "/56wzqMNbNaN3ZXIC4oVriQliXjd.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Tiếng Việt",
            "iso_639_1": "vi"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Open City Films",
            "id": 547,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "October Films",
            "id": 236,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Giai Phong Film Studio",
            "id": 78240,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-30",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "The war is over.  But a personal battle continues to rage.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Vietnam",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tony Bui"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Timothy Linh Bui",
         "Tony Bui"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138874/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNTgwOTU2MF5BMl5BanBnXkFtZTcwMDUwMDYxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Ngoc Hiep Nguyen, Ngoc Minh, Phat Trieu Hoang | See full cast and crew »"],
      "reviews": [
         "There are not very many movies that can put the viewer into the trance that this one did. It left me wondering why more American films can't be made like this, with subtlety and an eye for simplistic beauty and peace in nature. The many scenes at night in the rain-soaked city only provide a stark contrast to the scenes with lotus flowers and singing, thus making them more effective and fresh. Above this, the characters were intriguing. None had a life even remotely like mine, and this is probably likewise for 99% of Americans, who live in a fast-track, needlessly complicated, and mostly material world. Materialism exists in Three Seasons, but is seen as the enemy (the plastic lotus flowers) or (in the case of the prostitute) something to overcome. I left the theatre feeling somewhat wistful that there are not more films like this being produced today.",
         "Director Tony Bui left Vietnam to live in California when he was only two years old, then returned to take a look at postwar Vietnam in 1994. The result was his 1999 film Three Seasons that walked away with a prize for Lisa Rinzler's cinematography as well as the Best Dramatic Picture Award at the Sundance Film Festival. Performed in Vietnamese with Vietnamese actors, Three Seasons is a series of interweaving stories about loss and redemption in the lives of four characters living in Ho Chi Minh City (though the residents apparently still call it Saigon). Its strength lies, not in its plot or characters, but in the stunning images and dreamlike quality that transports the viewer into a world of sensuous music and soft colors where village women sing while they work, harvesting flowers on a lotus lake. The main and most effective story is about a cyclo driver Hai (Don Duong) who falls in love with a prostitute named Lan (Zoe Bui), He wants to \"redeem\" her innocence and dutifully waits for her each day as she leaves her hotel. When they go to a hotel together, he pays $50 from the money he won in a cyclo race merely to watch her sleep, a gesture that allows her to experience the feeling of being loved for the first time. The second story is about a young lotus picker Kien An, a female orphan (Ngoc Hiep Nguyen) who befriends her employer, Teacher Dao (Manh Cuong Tran), and lovingly copies his poems that he cannot record himself because of leprosy. This gesture allows both to touch the poetic quality of life, the teacher for perhaps the last time. The other stories involve a five-year old street urchin named Woody (Huu Duoc Nguen) who braves monsoon-like weather to sell trinkets to tourists in order to survive. When the box containing his wares is stolen, he sets out to find it. This brings him in contact with an American, James Hager (Harvey Keitel) in Vietnam to search for the daughter he left behind when the war was over. This last episode is the least developed of the four and Keitel's performance seems listless in spite of the fact that he is Executive Producer of the film. All four stories come together at the end in a way that ties up all loose ends. Though I am grateful for any look into Vietnam, Three Seasons left me wanting more. It is almost as if Bui was being overly cautious, afraid to say anything about what he saw because of the censors following him around. As a result, his film does not convey a strong sense of time and place, and the neon street signs and glamorous hotels patronized by the rich could be anywhere in the world. Perhaps it is true that the city's culture is being overrun by rampant commercialism, but the director observes this without comment and seems content to offer only a highly romanticized tone poem. Even the city's textures, squalid areas, and chaotic energy are so muted by the use of camera filters that it robs them of their steamy authenticity. Three Seasons is visually striking but left me feeling like a distant observer. I found the characters to be neither fresh nor engaging and the film overly composed, lacking in the poetic vision that turns an average film experience into a great one.",
         "Tony Bui's \"Three Seasons\" takes place in the teeming nightlife and the majestic hotels and the open marketplace and squalor of modern day Saigon. It is symbolically a film about traveling the historical past and present, put together in four uneven vignettes and how the lives of five people crisscross each other. Bui is not obtrusive and so his film is gentle and sweet and he lets his actors play out their roles with naturalness and grace. The gentleness of this film can be both its strength and weakness, because you leave thinking about discrete images beautifully photographed but you don't really have a sense of what Bui was trying to say. The image of sweat running down the face of cyclo drivers and the red abrasions on naked skin across the woman's back caused by a spoon are just two examples. Also, unlike Western soap opera, he isn't here to manipulate. Take the old man, Master Dao and his terribly scarred up face and amputations. Dao could have been afflicted by the after effects of napalm or a land mine explosion but, no, he has an old-fashioned affliction, leprosy. There is no post-Vietnam hate in Bui. The spirited cycle race through the streets of Saigon descends upon us without much buildup nor dramatics. We don't realize the significance of Hai winning this race till we see what he does with his winnings. Perhaps the few times Bui decides he needs to make an explicit statement, he does so with subtlety: the plastic lotus flowers which outsell the naturally grown ones, the opulent, newer hotels rising in Saigon turning the society into truly haves and have nots (what Bui calls the people of shadows), and the hardworking cyclo driver straining to move his vehicle as his Western couple occupants chatter oblivious to his struggles. The other weakness of \"Three Seasons\" is that the four vignettes are so interesting that each could have occupied the entire film. Instead we get incomplete servings from all four and a hunger to know more. Bui spends more time with the cyclo drive and the prostitute and the water lily girl and her poetic master. The story about the street smart little boy, who is forever in the rainy streets looking for his missing case of trinkets to sell and finding both the case and a tender companion in the end, could have stood by itself. Similarly, the Vietnam vet who comes back to find his lost daughter because he has to 'right a wrong' is a beautiful piece that needed more detail than what the film provided. The final scene of \"Three Seasons\" summarizes this film neatly - the falling crimson pedals from trees lining a boulevard. It is picturesque in its beauty but the meaning of it is more effervescent than lasting.",
         "This film is sheer poetry! The three seasons are actually three vignettes, interpersonal connections which all touch the others in strange and moving ways. (Harvey Keitel is moving as a VietNam war vet who has returned to search for his Amerasian daughter.) The use of flowers and color as metaphor for the \"opening\" of VietNam after the war is truly striking. Don't miss this film.",
         "In the contemporary Ho Chi Minh, former Saigon, Kien An (Ngoc Hiep Nguyen) is a worker hired to gather and sell lotus for her master, Professor Dao (Manh Cuong Tran). Dao was a handsome poet, who is dying of leprosy. He lost his fingers, and Kien offers herself to write his poetries for him. Hai (Don Duong) is a tricycle-taxi driver, who falls in love for the expensive hooker Lan (Diep Bui). Woody is a homeless little child, working as street peddler of watches, cigarette lighters and other minor goods, who has his wallet stolen. He believes that the thief is James Hager (Harvey Keitel), a former marine who is looking for his daughter with a Vietnamese woman during the war. These three parallel bitter and beautiful stories present in a metaphoric view, the transition of the political and economical system of Vietnam. Professor Dao represents the traditional system, the communism, rotten and dying. Lan is a metaphoric view of the transition to the capitalism, corrupted, aimed and unattainable for most of the poor population. Woody and the little girl represent the next generations of excluded of the new wild system, fighting for the survival and having no perspective in life. James Hager would be the return of the American interests in Vietnam. I am intrigued with the title of this film: \"Three Seasons\". The lotus means the spring, the hard rain means the winter; the fallen leaves, the autumn. Where is the summer and why is it missing? \"Three Seasons\" is a highly recommended movie, open to the most different interpretations by the viewers. My vote is eight. Title (Brazil): \"Três Estações\" (\"Three Seasons\")",
         "Please do yourself a favor and see this film. It is a beautiful and touching masterpiece. The film is set in a large city in modern day Vietnam. I believe it was Saigon. The film centers around the lives of several individuals. There is the ex-Marine (Harvey Keitel), hanging around an old GI bar (now a restaurant), hoping to find his daughter; The cyle taxi driver, who yearns to romance a local call girl; the flower girl who volunteers to write for a reclusive poet who lost his hands to leperacy; and the little boy who sells watches and cigarette lighters in hotels, bars, and the street. All these characters are weaved beautifully into the story like a boat moving slowly but surely up a river to a wonderful place. I have seen very very few movies in the past several years which qualify as true works of art. This movie is the real deal. .",
         "The maturity of this young film maker was startling to me. The obviously gorgeous and varied visual feast for one's eyes combined with small subtlteties such as the nipple of the whore's breast showing through the pink nightgown that the cyclo driver gave her.. just a second.. but a revealing moment since all the clothes she dressed in as a whore never revealed her as much. Another example was in the story of the lotus flower girl and the leper.. the more she wrote his poetry the more his face appeared out of the shadows and became lit. The marriage of the visual and lighting movement reflecting the feelings of the characters is rare to see and something to be studied again in this film. And a moving performance by Keitel clearly searching for his humanity. And a perfect bit of casting with the woman who played his grown daughter. The director's sense of timing- not rushed, letting each story unfold, carrying one on the precarious wave of the confused mix of the country's old and the new, the thought provoking issues of the various different kinds of love portrayed..parental love,romantic love, poetic love, the love of beaty where it realy lies....all rare in film making today. Profoundly disturbing scenes of the street children. Nothing like this from a young American film makers that I've seen. And as a worldwide distributor of film, TV and video who tries to support new filmmakers I've seen a fair amount. I would like to know where the poetry came from and how to find it for myself to read and savor it even more.Bravo Tony Bui. Bravo Timothy Bui.",
         "There are three different stories in the movie. The love story interested me the most. Since the call girl Lan took his tricycle, Hai fell in love with her. Every day he will wait for her at the gate of the hotel. He did not care her past at all. Later he won the tricycle race and had the money to sleep with her. But he just watched her wearing the dress he bought for her to sleep. What Hai did was rare for a man. There was no conflict in his thought. He just did what he wanted to do. So simple. So pure. No strong words. The love happened so natural between them. In fact the other two stories are good too. Without any exaggeration but plain performance, the movie brought me uncommon feeling. In addition to that, great cinematography made some scenes so beautiful and unforgettable. An excellent Vietnam movie you should not miss. 8/10",
         "My opinion is quite the opposite of a prior viewer Brian Orndorf. He asks rhetorically \"Maybe I missed something?\" In my opinion he certainly has. I caught only the last 1/3 of this movie but I was riveted to my seat within 2 minutes of viewing. Here's what I loved about this movie. 1 Beautiful cinematography. I especially liked the visions of dark rainy streets among other things. Every scene has a poetic flow. In short the photography is superb 2 The poetry and songs are lovely and work perfectly with the cinematography, and the individual stories that gradually unfold in time 3 The film conveys the gentleness of the Vietnamese culture as well as the harsh poverty and the widening gulf between the \"have's and have nots\" a characteristic not unique to this region I'm certainly looking forward to seeing this wonderful movie in its entirety and recommend it to any sensitive viewers. If you enjoy movies like King of Masks, Central Station, City of Lost Children, Hotel Splendide, Red Lantern, Eat Drink Man Woman, etc. you will probably like this movie. If you don't like this genre then don't waste you time and stick with the usual mass market Hollywood drivel.",
         "\"Three Seasons\" has many layers of complexity, yet it's executed in a deceptively simple and poetic fashion which seems to just flow off the screen. Some may find it too long or may perhaps feel the film seems to get lost in all its elegance. However, hang in there, the payoff comes through understanding it in its entirety. \"Three Seasons\" is a touching and poignant display of Vietnamese society and the dramatic changes it's going through. The cinematography and direction were beautiful and reminded me a bit of the film \"Scent of Green Papaya\". The movie is a collection of at least four different stories, all taking place in Saigon in the present day. Basically, each story is about the struggle to survive, both physically and spiritually in an ever changing and modernized society. Class struggle, the influence from the West (both bad and good), exploitation of children, and corruption of the soul are examined. We are told that like the lotus, some will fall in the mud, and others will fall in a rich pond. \"Three Seasons\" follows the lives of these flowers and the purity and divinity within them."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Giai Phong Film Studio",
         "October Films",
         "Open City Films"
      ],
      "summaries": ["An American in Ho Chi Minh City looks for a daughter he fathered during the war. He meets Woody, a child who's a street vendor, and when Woody's case of wares disappears, he thinks the soldier took it. Woody hunts for him. A cyclo driver, Hai, gives a ride to Lan, a hotel call girl, and starts waiting for her daily; he falls in love with her and tries to break through her tough veneer. Kien An, a young woman, takes a job harvesting lotuses in the ponds of Teacher Dao, a reclusive man who has leprosy. Her singing awakens him from depression, and he asks her to write down poetry he has composed. The characters' paths cross in small ways, around flowers and kindnesses."],
      "budget": 0
   },
   "movielensId": 2610,
   "movielens": {
      "languages": [
         "English",
         "Tiếng Việt"
      ],
      "releaseDate": "1999-04-30",
      "dvdReleaseDate": null,
      "directors": ["Tony Bui"],
      "runtime": 105,
      "movieId": 2610,
      "title": "Three Seasons",
      "mpaa": "PG-13",
      "actors": [
         "Harvey Keitel",
         "Đơn Dương",
         "Ngoc Hiep Nguyen",
         "Manh Cuong Tran",
         "Diep Bui",
         "Huu Duoc Nguyen",
         "Lola Guimond"
      ],
      "imdbMovieId": "0138874",
      "originalTitle": "Three Seasons",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": ["Uq9UPfyIx6Y"],
      "plotSummary": "Three Seasons wants to show individuals triumphing over adversities, recovering from traumas, looking forward to better times, as well as nostalgia for those better days before American and French and other invasions, material and ideological. It is a poetic film that tries to paint a picture of the urban culture undergoing westernisation.",
      "tmdbMovieId": 4154,
      "avgRating": 3.83005,
      "releaseYear": "1999",
      "numRatings": 406,
      "posterPath": "/56wzqMNbNaN3ZXIC4oVriQliXjd.jpg"
   }
}