{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "court case",
            "id": 3012
         },
         {
            "name": "british",
            "id": 6731
         },
         {
            "name": "based on play or musical",
            "id": 10181
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "1910s",
            "id": 210184
         },
         {
            "name": "20th century",
            "id": 232222
         }
      ],
      "imdb_id": "tt0155388",
      "video": false,
      "title": "The Winslow Boy",
      "recommendations": [
         25985,
         31875,
         40522,
         134184,
         124475,
         30892,
         24798,
         53103,
         46976,
         22908,
         41166,
         44297,
         38880,
         129417,
         15730,
         64835,
         51145,
         30805,
         343725,
         43984
      ],
      "backdrop_path": "/3r22q9h7vurVDXyZP05MRZst7Hj.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Catherine Winslow",
               "gender": 1,
               "credit_id": "52fe459ec3a368484e065519",
               "name": "Rebecca Pidgeon",
               "profile_path": "/c8nJjBpB7zYtdnEY1GNPtUSophZ.jpg",
               "id": 27267,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Grace Winslow",
               "gender": 1,
               "credit_id": "57e3c492925141123c004c89",
               "name": "Gemma Jones",
               "profile_path": "/doDUez5AkN0bfqmZWB0bKO9mcJe.jpg",
               "id": 9138,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Arthur Winslow",
               "gender": 0,
               "credit_id": "52fe459ec3a368484e06551d",
               "name": "Nigel Hawthorne",
               "profile_path": "/jKG3trCa3RGE6h5yzjMOramfoed.jpg",
               "id": 15788,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Violet",
               "gender": 0,
               "credit_id": "57e3c4aec3a3687590004a3d",
               "name": "Sarah Flind",
               "profile_path": "/pnD7jIuQv8ANMoQ40RgCt1nlXfX.jpg",
               "id": 195286,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Desmond Curry",
               "gender": 2,
               "credit_id": "5375c39dc3a3681ee1000e2d",
               "name": "Colin Stinton",
               "profile_path": "/hQAOFqXtTOrnbx1LYBMDkcAPyop.jpg",
               "id": 23608,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sir Robert Morton",
               "gender": 2,
               "credit_id": "52fe459ec3a368484e065533",
               "name": "Jeremy Northam",
               "profile_path": "/8NkPuXeJ8nXXIhgrmS8g7kcaTOS.jpg",
               "id": 18325,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Miss Barnes, Beacon Reporter",
               "gender": 1,
               "credit_id": "57e3c4c4c3a368758900476c",
               "name": "Sara Stewart",
               "profile_path": "/mvaa151bfar3OnmnLfksHVEnbib.jpg",
               "id": 3902,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Ronnie Winslow",
               "gender": 0,
               "credit_id": "5375c392c3a3681ee9000e2e",
               "name": "Guy Edwards",
               "profile_path": null,
               "id": 1320100,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Dickie Winslow",
               "gender": 0,
               "credit_id": "58966707c3a3680898010a23",
               "name": "Matthew Pidgeon",
               "profile_path": null,
               "id": 1231399,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe459ec3a368484e065515",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe459ec3a368484e065523",
               "name": "David Mamet",
               "profile_path": "/gyEERG5App4yST1ivDc8t9JrsjP.jpg",
               "id": 1255,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe459ec3a368484e06552f",
               "name": "Barbara Tulliver",
               "profile_path": null,
               "id": 53685,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5910df149251414e89038c0b",
               "name": "Sarah Green",
               "profile_path": null,
               "id": 16398,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5910df08c3a36864a7036803",
               "name": "Terence Rattigan",
               "profile_path": null,
               "id": 137992,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 1,
               "credit_id": "5910df1b9251414e89038c10",
               "name": "Sally French",
               "profile_path": null,
               "id": 1066819,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "5910df28c3a368650a035deb",
               "name": "Alaric Jans",
               "profile_path": null,
               "id": 1813027,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5910df309251414edb0382dc",
               "name": "Benoît Delhomme",
               "profile_path": "/qa2h6tyIG4iIc700VN7acYnhU4v.jpg",
               "id": 21655,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5910df41c3a36864fc037478",
               "name": "Gemma Jackson",
               "profile_path": null,
               "id": 9153,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "5910df549251414eca035e19",
               "name": "Andrew Munro",
               "profile_path": null,
               "id": 1363066,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5910df5a9251414e8d03645d",
               "name": "Trisha Edwards",
               "profile_path": null,
               "id": 13008,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5910df609251414e80038077",
               "name": "Consolata Boyle",
               "profile_path": "/6UwAvvXKsMmvicMnc3n5w4zMjSF.jpg",
               "id": 15734,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 4.086197,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 28519,
      "vote_count": 26,
      "budget": 0,
      "overview": "Early 20th century England: while toasting his daughter Catherine's engagement, Arthur Winslow learns the royal naval academy expelled his 14-year-old son, Ronnie, for stealing five shillings. Father asks son if it is true; when the lad denies it, Arthur risks fortune, health, domestic peace, and Catherine's prospects to pursue justice.",
      "similar": [
         1645,
         389,
         11975,
         9800,
         9623,
         37257,
         1592,
         819,
         595,
         314365,
         634,
         396371,
         93,
         392982,
         11560,
         65086,
         433,
         548,
         377275,
         821
      ],
      "original_title": "The Winslow Boy",
      "runtime": 104,
      "poster_path": "/3N2vi3rERIKJOhQ0OzgNi8er197.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Winslow Partners Ltd.",
         "id": 90093,
         "origin_country": ""
      }],
      "release_date": "1999-04-16",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Mamet"],
      "runtime": 104,
      "synopsis": "It is Christmas 1911 and Arthur Winslow, a retired London banker, is making final preparations for a dinner to seal the engagement between his daughter Catherine, an outspoken supporter of the controversial cause of women's suffrage, and Captain John Watherstone. The family and guests are toasting the upcoming marriage when Arthur discovers that his youngest son Ronnie, a 13-year old cadet at the Royal Naval College at Osbourne, is unexpectedly home. Ronnie has been accused of the theft of a postal order. An internal enquiry, conducted without notice to his family and without benefit of representation, finds him guilty and Mr. Winslow is \"requested to withdraw\" his son from the college (the formula of the day for expulsion). Ronnie proclaims his innocence and his father believes himenough so that he demands an apology from the College. When the college refuses to reinstate Ronnie, Arthur decides to take the matter to court. With the help of his daughter and Desmond Curry, a solicitor and friend of the family, Mr. Winslow decides to hire the most highly sought after barrister in England at the time, Sir Robert Morton, known also to be a shrewd opposition Member of Parliament. The government is unwilling to allow the case to proceed. The Naval College is a representative of the Admiralty and the Crown, and as such British law presumes they are infallible and above question; their judgment can be legally questioned only with the permission of the Attorney General. However, after heated debates in the House of Commons, the government yields, and the case does come to court. Catherine had expected Sir Robert to decline the case, or at best to treat it as a political tool; instead, he is coolly matter-of-fact about having been persuaded of Ronnie's innocence by his responses to questioning (in fact, a form of cross-examination, to see how young Ronnie would hold up in court) in the presence of his family. Catherine, left-wing suffragette, is not so enthusiastic towards Morton who she considers too heartless for a case like this. Catherine is also disturbed by Sir Robert's establishment views: he is a conservative opponent of womens suffrage. \"He always speaks out against what is right,\" she complains. However, she admires his legal skills. Morton on his part is obviously quite taken with her from the moment he glimpses her peering down at him from the ladies' gallery at the House of Commons. In the meantime, the case creates media hysteria and puts a heavy toll on the Winslow family their funds are rapidly depleted in order to cover legal expenses. Mr. Winslow's physical health deteriorates under the strain and the happiness of the Winslows' home is destroyed. Arthur's wife, Grace, begins to wonder if the real issue is justice or a father's stubborn and foolish pride. Forced to make economical sacrifices, Grace Winslow is unwilling to take the drastic measure of dismissing, Violet, who has been the familys maid for over twenty years. The eldest son, Dickie Winslow, has to leave Oxford due to the lack of money destroying his chance at a career in the Civil Service. Instead, he is compelled to find employment in his fathers bank. Catherine's marriage settlement is also gone. Her fiancé John Watherstone breaks off the engagement in the face of opposition from his father (an Army Colonel), forcing her to consider a sincere and well-intentioned offer of marriage from Desmond, whom she does not love. Sir Robert has also declined appointment as Lord Chief Justice, rather than drop the case. The least affected is Ronnie, who happily has been transferred to a new school. At trial, Sir Robert (working together with Desmond Curry and his firm) is able to discredit much of the supposed evidence. The Admiralty, certainly embarrassed and presumably no longer confident of Ronnie's guilt, abruptly withdraws all charges against him, proclaiming the boy entirely innocent. When their resounding victory arrives, not a single member of the Winslows family is present at court. It is Violet, the maid, who tells Mr. Winslow and Catherine what had happened at court. Shortly after, Sir Robert appears in the Winslowss home to share the good news. The film ends with a suggestion that romance may yet blossom between Sir Robert and Catherine, who acknowledges that she has misjudged him all along.",
      "writers": [
         "Terence Rattigan",
         "David Mamet"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0155388/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg2OTU2MTU2N15BMl5BanBnXkFtZTcwNzIyMjA0MQ@@._V1_.jpg",
      "actors": ["Stars: Rebecca Pidgeon, Jeremy Northam, Nigel Hawthorne | See full cast and crew »"],
      "reviews": [
         "In the interest of full disclosure, I will admit right off that I have never read the Terence Rattigan play from which this film is derived. Therefore, my evaluation of it purely concerns the film itself. I saw the movie during its brief stint in American theaters, and I was very surprised. It is the sort of film that I was amazed made it into Anerican movie theaters at all. It is neither fast-moving nor action-packed, and it contains no sexual content or violence. It centers around a functional British family and has very little romance. It does, however, address many issues and has a great deal of sophisticated humor. Rebecca Pidgeon's performance was particularly memorable. She had the perfect combination of restraint and sarcasm. I have heard complaints about her-that she was too stiff and lackluster, but I found her character very believable. Perhaps this is because I come from a close, sarcastic family myself. The Winslows came off as very attached to each other, but their Britishness prevented them from being mushy. I would definitely not recommend this movie to everyone. It is a very specific type of film and probably would be enjoyed by someone who is a fan of slow-paced, dialogue-driven period pieces or by someone who is a bibliophile. It is an unusual film, but I personally think it is pure gold.",
         "It seems the English are invading.....our cinemas. Last year it was Shakespeare in Love and Elizabeth and this year it is An Ideal Husband and The Winslow Boy. I also liked Lock, Stock, and Two Smoking Barrels but that's another story. Why our fascination with the English? I have some theories but I guess I shouldn't get into that here. The Winslow Boy is a terrific film because of its simplicity. A father defending his son's and thereby his own honor. There are no gimmicks, violence, and stunts, and everything and everyone is what and who they appear to be. As a result this film is driven by strong characters and strong, terse dialogue. I also enjoyed the use of newspaper clippings and caricatures from the editorial page to guide us thru the movie. The use of a scripture which appears a couple times dealing with feast and famine was a great metaphor for the father and the family's prospects. The performances were spectacular, especially Jeremy Northam playing Sir Robert Morton....what a \"stage\" presence. Rebecca Pidgeon as Kate as the strong willed suffragette daughter in the family was good as well. I must also mention Nigel Hawthorne, the father on whom the struggle took its toll, performed strongly as usual. I would recommend this to all members of the family from the very young for whom it could teach value lessons to the very old for whom it may awaken some feelings of nostalgia for at times it feels like a film from the 40's. Oh by the way the final lines in the film are super. Make sure you are listening. Three and half stars!!!",
         "A MUST SEE for Mamet fans and anyone who appreciates performances by Nigel Hawthorne, Jeremy Northam and Rebecca Pidgeon -- a pinnacle tour de force! It's costume drama, if you fancy PBS Masterpiece Theater productions, you'll definitely enjoy it. Simply Perfect. It's perfection to a \"tea\" (high tea at four). It's so comfortable and relaxing to watch a Mamet film even when it's a story of intrigue and suspense. Without stress of anticipation or worrying how the film might turn out, I entered the theater already satisfied -- I am seeing a Mamet film (a relieve from the Hollywood blockbusters!) I totally trusted the writer/director, serenely sat there knowing I will have a pleasant film experience, and immensely enjoyable it truly was! Every character is well acted by a perfect cast! Nigel Hawthorne as the senior Winslow, Arthur, head of the family. Gemma Jones as the matron of the house, Mrs. Winslow, Grace. Rebecca Pidgeon (Catherine \"Kate\" Winslow the daughter who works for her cause in women suffrage) flawlessly matches Jeremy Northam (Sir Robert Morton the renowned lawyer who has his influence on the House of Commons). What a fine pair opposite each other. Northam is impeccable and as handsome as he is. Pidgeon is no less brilliant and shines reflectively. There are the other two sons in the Winslow family: the key role of the Winslow boy in question, Ronnie, played by Guy Edwards, and the older son Dickie played by Rebecca's brother Matthew Pidgeon. Also Sarah Flind as the twenty-four years faithful family servant Violet, Colin Stinton as cousin Desmond and Aden Gillett as fiancé John (the two men who keenly pursue Kate) just about do the job for this faultlessly put together story on film. Mamet's screenplay once again superbly presented. Every line, every word in every scene came across so befitting for the moment -- such timing and delivery. This is a politically conscious film: subjects include family unit value, honor and honesty, class structure, influence of a well-known lawyer, along with father and son relationship, father and daughter, husband and wife, and romantic notions being tossed about around Kate -- all integrally paced yet seemingly choreographed together so effortlessly. Mind you the case is not the only central interest, the tension (and subtle tender friendship) between Kate Winslow and Sir Robert Morton is fascinating to watch, as they grow to observe each other closely and exchange banters. Kate, with her seemingly restrained manners, is holding back her feelings, while Sir Robert is opening up steadily and showing (obvious to us viewers) interest in getting to talk to Kate more often than he would a man of his stature. For me, there are four key scenes of exceptional energy, be it in high or low-key delivery. 1) Arthur Winslow (Nigel Hawthorne) talking initially with Ronnie (Guy Edwards). 2) When Kate (Rebecca Pidgeon) first entered Sir Robert's office, our very first glimpse of Sir Robert (Jeremy Northam) and his initial reaction. 3) Sir Robert interrogating Ronnie in his office. 4) The last verbal exchange between Pidgeon and Northam, as Kate and Sir Robert bid goodbye -- miss not a single word of this as you will be satisfied (probably more music to a woman's ears when Northam speaks!) Music score by Alaric Jans complements the film effectively, so do the costume design by Consolata Boyle and photography by Benoit Delhomme. All in all, I repeat, a perfectly satisfying and enjoyable film. Bravo to Mamet, once again. Other gems (screenplay-director) by Mamet besides \"The Spanish Prisoner\" 1998, are his first film \"House of Games\" 1987 and \"Things Change\" 1988. They both have the unique energy of Joe Mantegna, and fascinating strong lead performances from Lindsay Crouse in the former and Don Ameche in the latter -- perfect casting they were, with music score both by Alaric Jans. If you appreciate well written dialog and plot, miss these not.",
         "Terence Rattigan's classic English play from the 1940s but set just before WW1 has been filmed at least five times. This 1999 version is by the American director David Mamet, with his wife Rebecca Pidgeon in a lead role as the Boy's sister Catherine, along with Nigel Hawthorne and Gemma Jones as the parents. The acting honours however truly belong to Jeremy Northam as their barrister, Sir Robert Morton, who finds himself strangely attracted to young Ms Winslow. He is the full QC-MP, urbane, smooth as silk (dammit he is a silk) and deeply cynical, scambling up the greasy pole at Westminster, using his legal skills as best he may. Yet he compromises his career by taking the case. It involves the absurdly trivial matter of the alleged theft of a five shilling postal order but by the time it's over Sir Robert and his clients have managed to put the Navy and half the government on trial. Northam make this almost unbelievable transformation seem not just likely but inevitable. `The Winslow Boy' is of course based on a real case, the Archer-Shee affair, though Rattigan modified the story substantially. In particular the Archer-Shee's counsel, Edward Carson, the prosecutor of Oscar Wilde and raving anti-Irish home ruler, never became personally involved with the family. He was made a law lord (top British judge) shortly after so his quite spectacular career was not affected by his involvement in the Archer-Shee case. Yet the most interesting thing in the film is the entirely ficticious relationship between Sir Robert, the conventional male supremacist and Catherine, the dedicated suffragette. In the end sex triumphs over politics, as it so often does. A pity it did not do so in the case of Lord Carson. The Boy himself has a wonderful line in English Public School patter (I'm sure an American audience would need sub-titles). Sadly the real Boy was killed in WW1, which also killed the society to whom the Archer-Shee case was so important.",
         "Sometimes the best films you see are the ones you've never heard about. I saw this one sitting on the shelf of my local video store and rented it on a lark. This is an adaptation of a play written by the late Terence Rattigan (\"The Browning Version,\" \"Separate Tables\"). Here it is brought to the screen by another famous playwright, David Mamet, who wrote the screenplay and directed this film. It concerns the true story of a young boy who was expelled from the British Naval Academy early in the twentieth century for allegedly stealing a postal order. This movie is very much a play put onto film. The sets are almost exclusively interior and the action is carried forward through dialogue. Events not at hand are explained through theatrical devices such as reading a letter or someone remarking on what's happened. At times I wished the director had made it more of a movie but it's still a very good film, mainly because the key actors are so good. Mamet's wife, Rebecca Pidgeon, plays Catherine Winslow, the little boy's older sister. She's an outspoken but gentle woman who's strongly in favor of women's rights. Jeremy Northam plays Sir Robert Morton, the lawyer and member of the House of Commons who takes the Winslow case. He's outwardly reserved but inside he's as passionate about justice as Catherine. Both of these actors give outstanding performances. And as you might expect, there's a little romance suggested between the two by the end of the film. I wish I knew more about the Winslow case because the film assumes you know most of the facts already. It must have been an important event in early twentieth century British history because they've made several films about it, including one made in 1948 with Robert Donat (Sir Robert Morton), Margaret Leighton (Catherine), and Cedric Hardwicke (the boy's father) that I'll have to see. There must be nuances about the relationship between the government and the common man in this case that are only hinted at here. Very good entertainment and the acting will knock you off your feet.",
         "Just saw The Winslow Boy, and it was a real gem of a movie. Mamet has always been the king of brilliantly droll dialogue, the sort of dialogue that is funny not in its words but its performance, and Winslow Boy is no exception. With unusually clean language, Mamet has written a screenplay that illicits honesty from its players without ever being forced or awkward. It's gorgeous. The cast lent itself beautifully to the script's Mametian style. Most poignant was Nigel Hawthorn, who managed to break my heart with the shift of an eye. It was the kind of razor-sharp subtlety that Mamet's writing (plays and screenplays) requires, and Hawthorn delivered it with soft spoken brilliance.",
         "During the Edwardian period in England, a family is newly in turmoil. The youngest and very dear son has been accused of theft at his school and expelled. The boy swears his innocence to his father & family so the patriarch begins a court proceeding to clear his son of any wrong doing. A rising young attorney (Jeremy Northam) is found willing to accept the defense of the boy. The publicity is intense, making the older sister's wedding engagement in jeopardy. Will the family continue to try and prove their son's case or will circumstances make them give up the fight? This is a beautiful movie, in many ways. The cast is stellar, but, especially, the handsome and intelligent Jeremy Northam excels in his role as the attorney. The sister's role is also portrayed very well and her feisty yet genteel character is extremely attractive. The sets are lovely, the minor characters deft, and the costumes are superb. Mostly, though, the script and direction are of the highest caliber, showcasing what is good and noble in a family with exceptionally high morals. Do you want good character building films without any objectionable scenes, which are also highly enjoyable? This one should make the top ten list every time.",
         "A series of absolutely perfect scenes...crisp, engaging dialogue...ordinary yet intriguing characters interwoven into a seamless web...flawless acting, even down to the boy...great costumes...the best ending lines I've heard in years! I've seen this movie twice and found it just as enchanting the second time. I would not change one thing about this movie!",
         "In movies I really like, the quality they all possess is believable characters; they make me care about what happens to them. I think this movie clears that hurdle. Mamet's signature direction and dialogue are brought to life by a wonderful ensemble of actors. The plot is an interesting vehicle showing how an English family reacted when something bad happened to them and gives insight into a period when things were changing in English society. Changes that would lead to be tectonic shifts in British life like women's suffrage and a questioning of the government's infallibility. I gave it an 8",
         "This film touched me in a way that prompted me to state my affections for this film. I love this film. The plot, character development, dialogue, direction, acting, wardrobe and every detail associated with the film mirrors perfection. Rebecca Pidgeon is a very talented actress and one can see the resemblance between Catherine and Elizabeth in Jane Austin's Pride and Prejudice (Yes, Rebecca Pidgeon would be the perfect Elizabeth Bennet). Jeremy Northam is devilishly handsome (my, oh my) as the reclusive Sir Robert Morton. After seeing this film and reviewing Catherine's and Sir Robert's dialogue at the end of the film numerous times, one can only hope that their path will cross again. During the era of violence and sex in films, it is refreshing and comforting to see a rated \"General\" film that can be viewed with one's whole family. After all, this is a period piece full of love, honour, justice and a families desire to right."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Winslow Partners Ltd."],
      "summaries": ["Early 20th century England: while toasting his daughter Catherine's engagement, Arthur Winslow learns the royal naval academy expelled his 14-year-old son, Ronnie, for stealing five shillings. Father asks son if it is true; when the lad denies it, Arthur risks fortune, health, domestic peace, and Catherine's prospects to pursue justice. After defeat in the military court of appeals, Arthur and Catherine go to Sir Robert Morton, a brilliant, cool barrister and M.P., who examines Ronnie and suggests that they take the matter before Parliament to seek permission to sue the Crown. They do, which keeps Ronnie's story on the front page and keeps Catherine in Sir Robert's ken."],
      "budget": 0
   },
   "movielensId": 2611,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-16",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["David Mamet"],
      "runtime": 104,
      "movieId": 2611,
      "title": "The Winslow Boy",
      "mpaa": "",
      "actors": [
         "Rebecca Pidgeon",
         "Gemma Jones",
         "Nigel Hawthorne",
         "Sarah Flind",
         "Colin Stinton",
         "Jeremy Northam",
         "Sara Stewart",
         "Guy Edwards",
         "Matthew Pidgeon"
      ],
      "imdbMovieId": "0155388",
      "originalTitle": "The Winslow Boy",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Early 20th century England: while toasting his daughter Catherine's engagement, Arthur Winslow learns the royal naval academy expelled his 14-year-old son, Ronnie, for stealing five shillings. Father asks son if it is true; when the lad denies it, Arthur risks fortune, health, domestic peace, and Catherine's prospects to pursue justice.",
      "tmdbMovieId": 28519,
      "avgRating": 3.85498,
      "releaseYear": "1999",
      "numRatings": 1286,
      "posterPath": "/3N2vi3rERIKJOhQ0OzgNi8er197.jpg"
   }
}