{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "time travel",
            "id": 4379
         },
         {
            "name": "dinosaur",
            "id": 12616
         },
         {
            "name": "science",
            "id": 156810
         }
      ],
      "imdb_id": "tt0089652",
      "video": false,
      "title": "My Science Project",
      "recommendations": [
         34086,
         27244,
         13766,
         19596,
         55078,
         49332,
         139367,
         78552,
         134048,
         24046,
         28734,
         83866,
         56162,
         36567,
         45006,
         45225,
         36349,
         39411,
         83412,
         5733
      ],
      "backdrop_path": "/smQmLecMRJ2TnnExScxZDnjGAoN.jpg",
      "revenue": 4122748,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael 'Mike' Harlan",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098fc9",
               "name": "John Stockwell",
               "profile_path": "/f5vvYpkpJnEdS3txCqTncss7Di6.jpg",
               "id": 57082,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Bob Roberts",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098fcd",
               "name": "Dennis Hopper",
               "profile_path": "/rq1n4dbFRXkaBspAbNzmNgyFMp.jpg",
               "id": 2778,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Ellie Sawyer",
               "gender": 1,
               "credit_id": "52fe476e9251416c75098fd1",
               "name": "Danielle von Zerneck",
               "profile_path": "/mKXkVPkJNDfixjREHcg9Bmpis5c.jpg",
               "id": 82220,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vince Latello",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098fd5",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Detective Isadore Nulty",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098fe5",
               "name": "Richard Masur",
               "profile_path": "/w8qQdmxLRRSXNXkjHKHlY5vawXG.jpg",
               "id": 15416,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sherman",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098fe9",
               "name": "Raphael Sbarge",
               "profile_path": "/dqJaYxVxOKJjMcIzOnAf3ef1RfR.jpg",
               "id": 97943,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Lew Harlan",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098fed",
               "name": "Barry Corbin",
               "profile_path": "/38AilHla20EFhEYAqoz6EzfsrQf.jpg",
               "id": 12852,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Dolores",
               "gender": 1,
               "credit_id": "52fe476e9251416c75098ff1",
               "name": "Ann Wedgeworth",
               "profile_path": "/qi153PFDSHi5afMBkdEqquXwxWc.jpg",
               "id": 83145,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Irene",
               "gender": 0,
               "credit_id": "52fe476e9251416c75098ff5",
               "name": "Candace Silvers",
               "profile_path": null,
               "id": 988663,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Matusky",
               "gender": 2,
               "credit_id": "52fe476e9251416c75098ff9",
               "name": "Beau Dremann",
               "profile_path": null,
               "id": 146220,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Crystal",
               "gender": 0,
               "credit_id": "52fe476e9251416c75098ffd",
               "name": "Pat Simmons",
               "profile_path": null,
               "id": 1207305,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Mutant #1",
               "gender": 2,
               "credit_id": "52fe476e9251416c75099001",
               "name": "Michael Berryman",
               "profile_path": "/kqIQo7IqpW5DLcMmWD7mkxokyLX.jpg",
               "id": 7073,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe476e9251416c75098fdb",
               "name": "Jonathan R. Betuel",
               "profile_path": null,
               "id": 70835,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe476e9251416c75098fe1",
               "name": "Jonathan R. Betuel",
               "profile_path": null,
               "id": 70835,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe476e9251416c75099007",
               "name": "Jonathan T. Taplin",
               "profile_path": null,
               "id": 2553,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c7509900d",
               "name": "Peter Bernstein",
               "profile_path": null,
               "id": 19746,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c75099013",
               "name": "David M. Walsh",
               "profile_path": "/iqzK0KjUbH5W2U5XwS3LQZ20RWH.jpg",
               "id": 19129,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c75099019",
               "name": "Carroll Timothy O'Meara",
               "profile_path": null,
               "id": 46008,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c7509901f",
               "name": "Bill Shepard",
               "profile_path": null,
               "id": 2084,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c75099025",
               "name": "David L. Snyder",
               "profile_path": null,
               "id": 601,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe476e9251416c7509902b",
               "name": "John B. Mansbridge",
               "profile_path": null,
               "id": 12869,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c75099031",
               "name": "Jerry Wunderlich",
               "profile_path": null,
               "id": 12848,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe476e9251416c75099037",
               "name": "Betsy Jones",
               "profile_path": null,
               "id": 1207306,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe476e9251416c7509903d",
               "name": "Lance Anderson",
               "profile_path": null,
               "id": 75127,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe476e9251416c75099043",
               "name": "Zoltan Elek",
               "profile_path": null,
               "id": 32355,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.422748,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18252,
      "vote_count": 45,
      "budget": 0,
      "overview": "Michael and Ellie break into a military junkyard to find a science project for Michael's class, and discover a strange glowing orb which absorbs electricity. When the orb begins to blend past, present, and future, its up to Michael and Ellie to stop the orb and save mankind.",
      "similar": [
         88751,
         18890,
         351286,
         425,
         1593,
         10567,
         329,
         105864,
         135397,
         41154,
         23048,
         816,
         8355,
         834,
         105,
         18162,
         49519,
         59436,
         165,
         196
      ],
      "original_title": "My Science Project",
      "runtime": 94,
      "poster_path": "/fLknudxoi1qSNnvtOlNSYRYL8Hq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
            "name": "Touchstone Pictures",
            "id": 9195,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Silver Screen Partners II",
            "id": 10531,
            "origin_country": ""
         }
      ],
      "release_date": "1985-08-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "We must not destroy the world.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan R. Betuel"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Jonathan R. Betuel"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089652/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzI2MzcyNzg3NV5BMl5BanBnXkFtZTcwMjc3NjUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: John Stockwell, Danielle von Zerneck, Fisher Stevens | See full cast and crew »"],
      "reviews": [
         "Man I've been watching My Science Project since way back when I was a kid. It was better then but the only thing that has really dated it is the special effects. The story is still good, Fisher Stevens is still funny, and Dennis Hopper is still far out man! I'm not saying that this movie is better than Star Wars or anything but it's a pretty good example of cheesy 80's Sci-Fi. The trick to watching My Science Project or indeed, any movie from the 80's, is to not take it seriously. Turn off the white hot critic's eye and just enjoy this movie for what it is. It's a great movie. Bottom Line: I can't think of many 80's movies in this genre that are this film's equal, except for maybe The Last Starfighter. If you can let me know.",
         "Movies come in phases now and then where a bunch of movies with similar themes come out at about the same time. There was the underwater craze of 89 (\"The Abyss\", \"Leviathan\", and \"Deepstar Six\") and there was the body switch craze (\"Big\", \"Vice Versa\", and one with Dudley Moore). This movie came out during the comedy with a science twist. The other two movies that came out during this phase are \"Real Genius\" and \"Weird Science\". I liked this phase as I enjoyed all three movies quite a bit. This one was no exception as it combined humor and science fiction very well. This one has a couple of kids finding this strange device that I think ended up being some type of engine. Anyway when this thing gets hooked up with power and turns on all sorts of strange stuff starts happening. The thing seems to be able to move time or open portals. The end is great as the thing really goes berserk and it turns the school (I think it was the school) into a battle zone complete with different times. There is a dinosaur and mutants. All in all I am probably in the minority in liking this one, but I thought it was really good.",
         "Sadly, My Science Project was a very big risk that seems to transcend it's teen film genre. While people will cite better time-travel themed movies like Bill and Ted's Excellent Adventure and Back o the Future, this one will certainly stand on its own due to the Twilight Zone quality of it. Great visuals, great idea, and the story didn't try to insult it's audience by making the story painfully obvious. I especially liked Mike's character, a kind of good guy that was a diamond stuck in the pond scum. Unfortunately, his entire performance was stepped on by Fisher Steven's over the top performance. Dennis Hopper made a perfect cameo performance that really fit his bi-polar acting style. While this film won't be considered one of the elite teen films of the 1980s like The Breakfast Club, Bill and Ted, River's Edge, Say Anything, Sixteen Candles and Ferris Bueller's Day Off, but it will fit comfortably with the silver medalists of that area, much like Can't Buy Me love, The Wraith and Three O'Clock High. A great film for teen movie aficionados.",
         "My Science Project is a great 80s sci-fi movie about a kid in high school who sneaks into an old air force junkyard and stumbles upon an alien device discarded in a 1950s fallout shelter, and tries to turn it in as his science project. When his teacher, played by Dennis Hopper, finds a way to power the device, he zaps himself into another time dimension and from there, all hell breaks loose. Eventually, the kid and his best friend, played by Fisher Stevens, find themselves battling their way through Roman gladiators, the Viet Cong, post-apocalyptic mutants and even a Tyrannosaurus Rex in each room of their High School as they make their way toward the science hall to deactivate the device and save their town. Those who criticize the writing and dialogue miss it's depth as it is as much a movie about trust as it is about time travel. John Stockwell plays a believable high school cool kid who drives a muscle car and hangs out at auto shop. Fisher Stevens plays his hilariously bigoted sidekick buddy Vinnie from Brooklyn. Danielle von Zerneck plays Harlan's (Stockwell) geeky would-be bounce-back girlfriend after his bimbo girlfriend dumps him. Raphael Sbarge plays a hopelessly nerdy librarian that ultimately helps Harlan shut down the device. Dennis Hopper plays an unhinged ex-hippie turned science teacher who gets sent into another dimension but shows up at the end. The special effects are dated but hold well. That T-Rex looked good! Don't get me wrong, it's no Jurassic Park, but it's no Gumby Claymation dinosaur either. If you can overlook the fact that the alien device looks like something you can buy from Spencer's Gifts and some of the cheesiness that comes with an 80s movie, it's a pretty exciting film. If your a sci-fi fan, it's definitely worth a look. It's not just a good idea, it's a good movie as well. I loved it.",
         "I love 'My Science Project'. I first saw it on HBO one day back in 87 and loved it right away, it's a great sci-fi thriller, with many moments of comedy as well. SPOILER ALERT!!! It concerns a car nut high school student played by John Stockwell (you'd think that after the hell he went through with Christine, he'd stay the heck away from cars), who needs a science project to pass his science class, problem is, he doesn't have one. So one night he, and his new girlfreind are rumaging around in an old military junk yard outside of town hoping to find something suitable to impress his teacher, and find a very odd little machine. It's high tech looking, with a glass globe mounted in the middle that when powered up, emits electricity that resembles one of those plasma globes you'd find at Spencers Gifts in the mall. As he's cleaning it, he decides to hook it up to a power supply, this turns out to be a huge mistake as 'the gizmo', as it's called in the film, turns out to be an engine from a spacecraft and can locally warp time and space, bringing objects and people from other times into our own. It soon goes wildly out of control and eventually the whole school is caught in a warp, and it's up to Stockwell, and his wise cracking freind, played wonderfully by Fisher Stevens, to shut down the gizmo for good. A very underrated film, with impressive visuals that still hold up well (except for the dinosaur), great acting from it's cast, inspired writing, and when watched on a good surround set up, a great audio mix to boot. It means no harm, and is fun.",
         "If you've never seen this movie before, give it a try...It's a great 80's high school flick. Add it to your collection with Sixteen Candles, Weird Science, The Breakfast Club, Ferris Buehler and Pretty in Pink. Plus, John Stockwell looks yummy driving his massively sweet red GTO. He was a pretty good actor before he became a pretty good director, too. Vinnie (the guy who played Ben in the Short Circuit movies) has some awesome one liners and Dennis Hopper plays a hysterical former hippie science teacher. Plus, you can laugh at the 80's special effects and realize how good we have it now. Give it a try, it's a good time. If you like this one, also try The Philadelphia Experiment. Another 80's sci-fi flick that has pretty similar special effects.",
         "I've seen this movie several times and actually enjoyed the movie. John Stockwell plays the lead roll of a 80's car crazy High Schooler who is fighting the clock to come up with a project for his science class or he will fail. So he breaks into in Air Force Bone yard base full of old aircraft and accidentally stumbles into a underground bunker where he finds some sort of alien drive device and here the fun begins. His side kick Vince played by Fisher Stevens (who is hilarious) girl friend Ellie played by Daniellie Von Zemeck and Librarian geek Sherman (Mr. Peabody's gofer?) played by Raphael Sbarge are all Drawn into a none stop adventure of time travel, police investigation and teenage problems. This is definitely a 80's special affects movie for sure but still brings the plot across enough to get by. Dennis Hopper as the 60's radical turned laughing gas sucking science teacher was enjoyable to watch if your a hopper fan. On a scale of 1-10 I give movie this an 8.",
         "This is one of the great movies of the 80s in My collection that I think about all the time. My Science Project is one of My favorite films of all. The first time I saw I it I loved it! Its still as great today as it was then! What I love about it is for one how it was made! The 80s allowed it to be a masterpiece! The special effects are spectacular and I still think they are as good as the ones used currently! I like the actors and the characters they play! Fisher Stevens is hilarious! John Stockwell played his part very good. Danielle von Zerneck and Raphael Sbarge put on good performances! I really liked Richard Masur in the movie. His character Detective Jack Nulty was really a bad @$$ and a ruthless one at that! His accent and attitude was just so cool! I always like to see Barry Corbin in the movie. Dennis Hopper's character Bob Roberts was colorful and intelligent! This may sound strange but I believe My Science Project could be arguably his best movie! The laughing bum character was funny! Look for RoboCop's Robert DoQui and Big Trouble In Little China's Al Leong! The budget of the film is big and I have always liked what it has in store! Another thing I love about My Science Project is the score by Peter Bernstein! The music fits the film perfectly and the theme it has is just phenomenally spooky! Its so great! In My opinion This movie has very good acting by the talented actors, a cool story, spectacular effects, a wonderful 80s feel, and just about anything that you could put in a movie! I don't know why this classic movie hasn't received the attention it deserves I mean with all of the things it has I would think this movie would be considered one of the greats but sadly that hasn't happened. I personally think My Science Project is a classic movie that I believe is one of greatest of all time! It is always great to watch. If anyone reads this and hasn't seen My Science Project before then I strongly recommend you go rent it and then buy it! Its a true classic!",
         "I was five-years-old when this movie first came to HBO. I haven't seen it in a while, but I still have a good impression of it. If you like cheesy sci-fi films, you'll like this one. <SPOILER ALERT> The premise of the movie is fantastic. A UFO crashes decades ago. What does the military do with it? They put it in a junkyard where high-schoolers have access to the strange craft's engine. Now Michael tries to pass off the alien time-warp engine as his own science project. Now, I've studied to be a teacher, and there's no way on The Good Lord's earth that ANY teacher would believe this was a student's own project. My favorite part was when they were trying to outrun the electric tendrils of the gizmo. Now let's see, electricity runs at THE SPEED OF LIGHT!!! According to Einstein, NOTHING but energy can go as fast as light. Yet, THEY OUTRUN THE TENDRILS! I don't care how good your car is, it can't run that fast! This is so cheesy, you have to love it. I would have to say that Dennis Hopper, the teacher, and Fisher Stevens, the best-friend Vince, give Academy Award winning performances, if the Academy had a sense of humor. The best line belongs to Stevens. As Vince is having his mug shot taken, the cop asks him why he's wearing sunglasses at night (How '80s is that?). He replies, \"When you're cool, the sun shines on you 24 hours a day.\" Great delivery. If you like cheesy films, you must, MUST, see this one.",
         "I just saw this on DVD for the first time in probably about 15 years. I used to love it when I was about 7 years old. I was amazed how many lines I remembered. Though often I didn't remember them from this movie. I just remembered them as lines my 2 brothers and I worked into our vernacular growing up. Especially the timeless \"Make my semesta!!!\" Besides all the great one liners, there were guns, explosions, gladiators, monster's from the future and past, a TREX, dynamite, and lot's of cool electricity effects. Everything a 7 year old boy would love. So I highly recommend it for a boy child. But for everyone else, only if you are bored or really like seeing cheesy 80's flicks."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Silver Screen Partners II",
         "Touchstone Pictures"
      ],
      "summaries": ["Michael and Ellie break into a military junkyard to find a science project for Michael's class, and discover a strange glowing orb which absorbs electricity. When the orb begins to blend past, present, and future, its up to Michael and Ellie to stop the orb and save mankind."],
      "budget": 0
   },
   "movielensId": 2615,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-08-09",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Jonathan R. Betuel"],
      "runtime": 94,
      "movieId": 2615,
      "title": "My Science Project",
      "mpaa": "PG",
      "actors": [
         "John Stockwell",
         "Dennis Hopper",
         "Danielle von Zerneck",
         "Fisher Stevens",
         "Richard Masur",
         "Raphael Sbarge",
         "Barry Corbin",
         "Ann Wedgeworth",
         "Candace Silvers",
         "Beau Dremann",
         "Pat Simmons",
         "Michael Berryman"
      ],
      "imdbMovieId": "0089652",
      "originalTitle": "My Science Project",
      "genres": [
         "Comedy",
         "Family",
         "Fantasy",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["msUrUTdPluw"],
      "plotSummary": "Michael and Ellie break into a military junkyard to find a science project for Michael's class, and discover a strange glowing orb which absorbs electricity. When the orb begins to blend past, present, and future, its up to Michael and Ellie to stop the orb and save mankind.",
      "tmdbMovieId": 18252,
      "avgRating": 2.93486,
      "releaseYear": "1985",
      "numRatings": 1090,
      "posterPath": "/fLknudxoi1qSNnvtOlNSYRYL8Hq.jpg"
   }
}