{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "illinois",
            "id": 1245
         },
         {
            "name": "father",
            "id": 5905
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "ireland",
            "id": 14985
         }
      ],
      "imdb_id": "tt0120865",
      "video": false,
      "title": "This Is My Father",
      "recommendations": [],
      "backdrop_path": "/hBeCKCVxyDFNuoRHIRsPQ1iKwl2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Kieran O'Day",
               "gender": 2,
               "credit_id": "5488bc0ec3a3684151002496",
               "name": "Aidan Quinn",
               "profile_path": "/fOiuJIBJUdiuqjQtGkffpSbRQ49.jpg",
               "id": 18992,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kieran Johnson",
               "gender": 2,
               "credit_id": "52fe44bfc3a368484e03471f",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Mission Priest",
               "gender": 2,
               "credit_id": "5488bc2bc3a3682d010008b9",
               "name": "Stephen Rea",
               "profile_path": "/taD1NngDbW8cyCuacAT3YaecSEG.jpg",
               "id": 9029,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Eddie Sharp",
               "gender": 2,
               "credit_id": "5488bc1d92514151ff002879",
               "name": "John Cusack",
               "profile_path": "/uKydQYuZ9TnCzvbQLtj6j98vWAT.jpg",
               "id": 3036,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Seamus, Owner of the Bed-and-Breakfast",
               "gender": 2,
               "credit_id": "52fe44bfc3a368484e034727",
               "name": "Colm Meaney",
               "profile_path": "/irPAowqDk7llCvm8uyCJuBClzJw.jpg",
               "id": 17782,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Garda Jim",
               "gender": 2,
               "credit_id": "5488bc399251415205001ff7",
               "name": "Brendan Gleeson",
               "profile_path": "/pUTBk2sqFgg4aFBXHckD0qKLUYP.jpg",
               "id": 2039,
               "order": 5
            },
            {
               "cast_id": 3,
               "character": "Jack, Kieran Johnson's Nephew",
               "gender": 2,
               "credit_id": "52fe44bfc3a368484e034723",
               "name": "Jacob Tierney",
               "profile_path": "/mAi8QMzrbcrgkpXjr5Wn42A9tXt.jpg",
               "id": 93396,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Mrs. Kearney",
               "gender": 0,
               "credit_id": "54802adc9251416e81001c02",
               "name": "Moira Deady",
               "profile_path": null,
               "id": 63361,
               "order": 7
            },
            {
               "cast_id": 6,
               "character": "Betty",
               "gender": 1,
               "credit_id": "54802ae39251416e74001d6c",
               "name": "Susan Almgren",
               "profile_path": "/dMVF5HwaFMYvkZER1qESrgmzGmD.jpg",
               "id": 61947,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bartender",
               "gender": 0,
               "credit_id": "59f51c08925141428200020b",
               "name": "Aiden Condron",
               "profile_path": "/8QJpX4MgGF9ADHpIiT1BgioshjK.jpg",
               "id": 1327313,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44bfc3a368484e03471b",
               "name": "Paul Quinn",
               "profile_path": null,
               "id": 93395,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5488bbd292514151ff00286d",
               "name": "Paul Quinn",
               "profile_path": null,
               "id": 93395,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.566854,
      "production_countries": [
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         },
         {
            "iso_3166_1": "IE",
            "name": "Ireland"
         }
      ],
      "id": 25232,
      "vote_count": 2,
      "budget": 0,
      "overview": "When schoolteacher Kieran Johnson (James Caan) discovers that his father was not a French sailor (as he had been led to believe) but rather an Irish farmer, Kieran looks to his mother (Moya Farrelly) for answers. When she refuses to provide any, Kieran travels to Ireland. In flashbacks, we watch a romance develop between Kieran's mother, a college girl, and his father (Aidan Quinn), an inarticulat",
      "similar": [
         11564,
         2142,
         3134,
         948,
         8810,
         298312,
         141,
         185,
         101,
         205,
         949,
         769,
         793,
         4771,
         241,
         550,
         281,
         339692,
         281957,
         395834
      ],
      "original_title": "This Is My Father",
      "runtime": 119,
      "poster_path": "/zsshQg6eGxrjqZ93NHVl6ZjIYSu.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Hummingbird Communications",
            "id": 40999,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmline International",
            "id": 40759,
            "origin_country": ""
         }
      ],
      "release_date": "1999-05-07",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "A Journey Of The Heart.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Ireland",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Quinn"],
      "runtime": 119,
      "synopsis": null,
      "writers": ["Paul Quinn"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120865/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzEyNjQ3MDY0NV5BMl5BanBnXkFtZTcwODgxMDIyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Aidan Quinn, James Caan, Jacob Tierney | See full cast and crew »"],
      "reviews": [
         "Paul Quinn, the director of \"This is my father\", shows a tremendous talent for bringing this fine layered story to the screen. Working on his own screen play, he was obviously the right person to be at the helm of this fine film. It appears that he got a lot of help, not only of his own brothers, but from a lot of well meaning people in this production. If you haven't watched the film, maybe you should stop reading. The film focuses on Kieran Johnson, the Chicago schoolteacher, ones encounters at the beginning of the movie with his students. His sick mother, Fiona, is being taken care at home by a daughter, and Kieran helps in his own, limited way. Watching his mother in her sick bed motivates him to go to Ireland in a voyage to discover a part of his life which he never knew. Upon arrival, accompanied by his nephew, they go to the rural area where his mother rears from. They get to stay at a modest bed and breakfast run by a greedy man. Seamus' old mother holds the key to the mystery surrounding how he came to be born and to know the truth about what happened to his mother. In the process we are taken in flashbacks to another era. Kieran O'Day, is a young man working in a small farm with the Meaneys. Beautiful Fiona is a local girl living with a widowed mother. It's obvious from the start these two like one another in more ways than meet the eye. The local town is dominated by the ruthless priests that see smut and lewdness in every one in the small town. In fact, most of what derails the lives of all of the people in the story seems to have been caused by the narrow mindedness of the clergy that held such a grip in the Irish society of the time. Kieran and Fiona eventually realize the love they feel for one another, but fate will come between them in unexpected ways. The film ends in tragedy, as Kieran Johnson gets to know that O'Day was his father and what became of him. In a lovely sequence, we watch as young Kieran and Fiona make a detour to a nearby beach because the car they've been traveling breaks down. While walking in the beach, they witness as a single engine plane come for a landing near them. They meet the American pilot, Eddie Sharp, a National Geographic photographer, who is taking pictures of Ireland. It's a lovely moment where the would-be-lovers interplay with the stranger and all seem to be at peace. Eddie is responsible for taking the only picture where Kieran and Fiona are seen together. That is the only clue left for their son to go on his search for their past. The amazing, largely Irish, cast do an outstanding job in recreating the people in the story. Moya Farrelly, the lovely young Fiona, is one of the best things in the film. Aidan Quinn, as Kieran, delivers a good performance in his portrayal of this lonely man of the country who finds love that proves to be fatal. James Caan, as Kieran Johnson, has some good moments, but of course, he is only seen in a few key scenes. John Cusack's contribution as the friendly aviator is one of the highlights of the movie. The supporting cast makes the film what it is. Colm Meany, Donald Donnelly, Gina Moxley, Brendan Gleeson, Stephen Rea, Moira Deady, among others, are the main reason for watching the movie. Most of them have had better opportunities in other movies, but as an ensemble they respond to Mr. Quinn's direction. Congratulations to Paul Quinn. We wish him well in whatever project he decides to direct!",
         "There aren't many films these days that bring a tear to the eye for legitimate emotional reasons. \"This is my Father\",happily, is one of them that should! Beautifully acted, imaginatively directed, this movie will undoubtedly have a short run. It doesn't meet today's standards of gore, brutality or computer generated non-realities. But if you want to see a movie that will tug at your heart and sensitivities,hurry down and see this heartbreaking ,yet heartwarming, story of requited ,yet unfulfilled, love.My test for a movie is very simple and timeworn. If I am sorry to see the credits roll, I know I've seen a fine movie.Man,was I sad to see those credits roll on bye.",
         "I just wanted to do a fancy Irish jig after watching this film. Coming in with little to no expectations, I was elated to sit back and actually watch a good old fashion romantic tragedy unfold. The Quinn brothers (Aidan, Paul, Declan) should be immensely proud of this hard won film achievement. It was a treat to watch. James Caan stars as a emotionally distant man who has little information on his past, more specifically, on who his father was. He travels to Ireland with his nephew to find his roots. The film is really a triumph of writing and acting. Aidan Quinn, who stars as the farmboy, gives his most powerful performance ever. After nearly sleepwalking through his entire career, it is this film that the actor truly digs deep and takes the audience through the wringer of emotions. It's an astonishing performance and will be remembered at the end of the year. Caan also brings something new to his table, restraint. Newcomer Moya Farrelly shines brightly as the young mother to be. I liked her spunk and her ability to make the role seem more believable than I suspect the page held. Director Paul Quinn has a steady eye for Ireland. While we've all seen the small village life in that country many times before, Quinn has the ability to make it all seem new and fresh. The screenplay isn't a joyous one. It's rather dark but the emotional impact is shattering. This is one solid movie in almost every way you can conceive. I hope more Irish tales are on the way from the brothers Quinn. --------------- 9",
         "Very well acted and well written. Beautifully filmed, with great music. But a sad tale. I am of Irish lineage, and I can see why my ancestors left Ireland. I wonder how many lives the Roman Catholic Church ruined with their meddling. Aidan Quinn and Moya Farrelly are terrific.",
         "Not many people will admit they saw, \"This Is My Father\", a touching, Romeo and Juliet looking film that has such warm sentimentality and such quiet dignity, that you have to defend yourself for seeing it. But defend you must. This is filmmaking at its gut level best, made by the Quinn family (Aidan, Paul, and Declan) no doubt to honor their Irish heritage as well as their father. The film does a nice job of splitting the scenes of present day, when Kieran is trying to find out about his father and the past, through the words of Mrs. Kearney retelling the ill-fated romance between Kiernan's mother Fiona and his father with the same name. The film details the harsh existence of country life and the stoicism of the Irish people suffering from both their poverty and an oppressive religion that does not recognize the meaning of love. The acting is commendable but my heart goes out to Moya Farrelly as the young Fiona - her screen presence is just as electrifying as the Greta Garbo she so much admires. One gripe with the Quinn brothers - why throw in the little nothing romance between Jack and Maria if you don't do anything with it. It could have served as a vehicle to show that the roots of the Fiona and Kieran tragedy run deep, even today, by showing lovers rejected because of where they come from. That aside, go see \"This Is My Father\" and don't be ashamed to say you saw it and enjoyed it.",
         "This story about a doomed romance begins when the professor Kieran(a serious James Caan) discovers photos from his mother's youth .He decides investigate his Irish roots but he wishes to know the authentic identity about his father . He travels along with his niece(a sympathetic Jacob Tierney)toward Irland where he believes his father resides. Meanwhile, the events are told in flashback with the romantic story of Kieran(a sensible acting by Aidan Quinn), a poor waif adopted by a good couple farmer and beautiful teenaged Fiona(Farrelly with similar countenance to Patricia Arquette). This dramatic film displays love and passion, but also hatred and tragedy. It portrays Irish customs, despotic priests, the class differences in rural Ireland in the 30s and the tragedies it originates . Casting is frankly excellent. Aidan Quinn is magnificent as affecting farmer tenant, Farrelly as wealthy young girl is gorgeous and James Caan as middle age teacher is nice . The secondary cast, Stephen Rea as authoritative priest, John Cusack as a ¨Life¨ review photographer-pilot and Bernard Gleeson as agreeable guard-man are very fine. This is a familiar film where all Quinn family have intervened . Evocative cinematography by Declan Quinn and Irish music score with folk sounds . Writing based on a story Theresa Quinn told her children. The motion picture is well directed by Paul Quinn. Rating : Good and better than average. The film will like to romantic drama buffs.",
         "Oh my God, I'm on a roll with these obscure movies I never heard of. Somebody please tell me how these movies had little if any press yet are so good. This gem takes place in both the modern day and back in Ireland in the late 1930's. It is a story of where one man came from. Who his father was and how he was connected to his mother. Gorgeous cinematography and solid acting make this a must see! Once again, it caters to my love of movies about people with flavor, zest, zeal and the bittersweet truths of life. Give it a watch, you'll be glad you did.",
         "I stumbled upon this movie last night on the tele and I was quite taken with it, for a while. The plot (s) are all fine, but it just felt like the writer was trying to stuff a whole lot of stuff into a pretty small bag. The main story- that of Ciaran and Fiona- is wonderful, fresh, and fun. Quinn and the girl are lovely together, and their scenes, particularly learning to dance and making love for the first time are infused with a reality and life that is rarely seen in film. There are a few mis-steps, I didn't really enjoy the 'modern' part of the film, it felt tacked on and not needed, like they didn't trust that their main story would be interesting enough to hold my attention. And John Cusack appears out of nowhere and all sense of reality flies out of the film for those five minutes, he's John Cusack in a plane! But for the most part it's a lovely story well acted.",
         "This Is My Father is a very honest film that touches the heart. The acting is flawless and the side-kick of a modern day love story compares different times in a nice way. James Caan plays this middle aged teacher that never had sought his origin in Ireland, but in doing so he discovers a new understanding to his mother's apparent depression after a stroke. Beneath there I sense a message to the ways of the Catholic Church and authority figures which unfortunately still applies today, in a way. This movie is a gem that deserves attention. - 8/10.",
         "Although this tragic valentine is mostly the labour of love of the Brothers Quinn (Aidan, Declan, and Paul), James Caan excels even more with what should have been a thankless role. As the teacher and uncle spurred on a search for his roots after discovering an old picture of his mother with an unknown man, Caan lends subtle dimensionality and nuances that ring true on every chord. The Irish countryside is lovingly filmed. But Paul Quinn never really decided whether this was a slice-of-life or an epic. He had many stories he wanted to tell, and ran out of time to conclude most of them while wasting far too much screen time reinforcing what we already knew about Fiona's stereotypical propertied widow mother and the kindly farmer with the somewhat shrewish wife who adopted Aidan Quinn's character, Kieron. The actor playing Father Morton also failed to supply new insights after his initial appearance. Stephen Rea is brilliant in a cameo as a fire-and-brimstone visiting priest. John Cusack adds a brief touch of magic, but adds nothing to the narrative. Moya Farrelly scores big in her cinematic debut as Quinn's love interest. Their chemistry is electric. All the townspeople are believably played and the music is marvelous. But it is annoying that the curses are colorfully bestowed and given interesting beginnings, but we never are let in on the final fate of the widow. More annoying still is being introduced to the nephew's turbulent yet loving familial relationships, watch a parallel develop, and then dropped. What effect does all this have on Kieren's sister, the boy's mother, who is equally entrenched emotionally in the search, but disappears without payoff? Overall, this is well worth seeing. It might have been better with more experienced editing and directing, and perhaps, a crisper script. Yet, flaws and all, it remains enjoyable on its own terms."
      ],
      "genres": [
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Father Productions (II)",
         "Filmline International",
         "Hummingbird Communications Ltd."
      ],
      "summaries": [
         "Widowed Kieran Johnson is a lonely, middle-aged, Chicago-based high school history teacher who feels disconnected to his life. He decides to take a trip to his mother's small old hometown of Kilronan, County Galway, Ireland after he discovers an old photograph of her, she who now cannot speak due to a stroke, with a man he has never seen. He suspects this man may be his biological father. On the urging of his sister, Kieran takes his teen-aged nephew Jack on the trip. In Kilronan, Mrs. Kearney, the innkeeper's mother and a bit of a gypsy woman who has lived in the area for the better part of her life, tells Kieran and Jack about life in the town in 1939 when a high-spirited Fiona Flynn, Kieran's mother, started seeing a peat farmer named Kieran O'Day. Kieran O'Day grew up a \"poorhouse bastard\", and as such he was always shy and considered an outsider amongst the townsfolk. Because of his standing in the community and the differences in their ages (she being only seventeen, he in his thirties), Fiona and Kieran's relationship was looked down upon by those considered the upstanding in town, including Fiona's widowed mother, Mary Flynn, and those associated with the church. Mrs. Kearney slowly tells the entire story of Kieran and Fiona's relationship, the tragedy that prevented their love for not being enough to endure the scrutiny, the stories of the \"curses\" that befell the Flynn family, and the truth behind the person Kieran Johnson knew as his father.",
         "A middle-aged teacher discovers photos from his mother's past that convinces him that she has not told the truth about his real father. Venturing into Ireland where he believes his real father to be, a past romance slowly unfolds."
      ],
      "budget": 0
   },
   "movielensId": 2620,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-05-07",
      "dvdReleaseDate": "1999-10-05",
      "directors": ["Paul Quinn"],
      "runtime": 119,
      "movieId": 2620,
      "title": "This Is My Father",
      "mpaa": "R",
      "actors": [
         "Aidan Quinn",
         "James Caan",
         "Stephen Rea",
         "John Cusack",
         "Colm Meaney",
         "Brendan Gleeson",
         "Jacob Tierney",
         "Moira Deady",
         "Susan Almgren",
         "Aiden Condron"
      ],
      "imdbMovieId": "0120865",
      "originalTitle": "This Is My Father",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["QvGkyqwCiyw"],
      "plotSummary": "When schoolteacher Kieran Johnson (James Caan) discovers that his father was not a French sailor (as he had been led to believe) but rather an Irish farmer, Kieran looks to his mother (Moya Farrelly) for answers. When she refuses to provide any, Kieran travels to Ireland. In flashbacks, we watch a romance develop between Kieran's mother, a college girl, and his father (Aidan Quinn), an inarticulat",
      "tmdbMovieId": 25232,
      "avgRating": 3.56589,
      "releaseYear": "1999",
      "numRatings": 258,
      "posterPath": "/zsshQg6eGxrjqZ93NHVl6ZjIYSu.jpg"
   }
}