{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "shakespeare",
            "id": 497
         },
         {
            "name": "fairy",
            "id": 2710
         },
         {
            "name": "lover",
            "id": 4320
         },
         {
            "name": "promise",
            "id": 6044
         },
         {
            "name": "luck",
            "id": 157904
         },
         {
            "name": "puck",
            "id": 209192
         }
      ],
      "imdb_id": "tt0140379",
      "video": false,
      "title": "A Midsummer Night's Dream",
      "recommendations": [
         2020,
         11630,
         10057,
         4587,
         10806,
         12596,
         11521,
         10763,
         12772,
         16379,
         15556,
         11632,
         9095,
         10480,
         10860,
         15992,
         18402,
         12187,
         1909,
         11557
      ],
      "backdrop_path": "/n3uSrGGYFmgsvnLWppc8oTsScUX.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Oberon",
               "gender": 2,
               "credit_id": "52fe43429251416c75009995",
               "name": "Rupert Everett",
               "profile_path": "/jGTaV5htTRo2T0aeM2eoHZcpLG4.jpg",
               "id": 4757,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Helena",
               "gender": 1,
               "credit_id": "52fe43429251416c750099c9",
               "name": "Calista Flockhart",
               "profile_path": "/5aakb4I8YROp58LbCtie23SylxB.jpg",
               "id": 49148,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Nick Bottom",
               "gender": 2,
               "credit_id": "52fe43429251416c750099c5",
               "name": "Kevin Kline",
               "profile_path": "/u9QXn3fL7zCC2c6HA2vFgH1JxZg.jpg",
               "id": 8945,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Titania",
               "gender": 1,
               "credit_id": "52fe43429251416c75009999",
               "name": "Michelle Pfeiffer",
               "profile_path": "/vyoJV5QYwIGZohrPpKFdKc7EpSP.jpg",
               "id": 1160,
               "order": 3
            },
            {
               "cast_id": 1,
               "character": "Puck",
               "gender": 2,
               "credit_id": "52fe43429251416c75009991",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Demetrius",
               "gender": 2,
               "credit_id": "52fe43429251416c750099d1",
               "name": "Christian Bale",
               "profile_path": "/2ocrTd8ChuUyJOzMuD4PsQw8eCB.jpg",
               "id": 3894,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Hippolyta",
               "gender": 1,
               "credit_id": "52fe43429251416c7500999d",
               "name": "Sophie Marceau",
               "profile_path": "/xrMvKw3bAuCyXKSc4IQIoOPBQZV.jpg",
               "id": 1957,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Theseus",
               "gender": 2,
               "credit_id": "52fe43429251416c750099d9",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Hermia",
               "gender": 1,
               "credit_id": "52fe43429251416c750099cd",
               "name": "Anna Friel",
               "profile_path": "/ccSUerm8OyftugbfsVdrrKKbBrv.jpg",
               "id": 58016,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Lysander",
               "gender": 2,
               "credit_id": "52fe43429251416c750099d5",
               "name": "Dominic West",
               "profile_path": "/56zmVMiuUhqas13xn700hvXUA32.jpg",
               "id": 17287,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Peter Quince",
               "gender": 2,
               "credit_id": "571f0eaac3a3686c99001745",
               "name": "Roger Rees",
               "profile_path": "/gOUeYKeHwYeFULO5SXFN8BSUjaW.jpg",
               "id": 16407,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Robin Starveling",
               "gender": 2,
               "credit_id": "571f0ec59251414df4001b75",
               "name": "Max Wright",
               "profile_path": "/2eFX28qQVvcN2uC5e8vTofJYdiG.jpg",
               "id": 106772,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Snug",
               "gender": 2,
               "credit_id": "571f0ed89251417cc4001775",
               "name": "Gregory Jbara",
               "profile_path": "/4vtI7sDySRsKuonG3iQbhRpaeuk.jpg",
               "id": 24360,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Tom Snout",
               "gender": 2,
               "credit_id": "571f0eeac3a368775b001680",
               "name": "Bill Irwin",
               "profile_path": "/zjvhlCC1LA5JUwfScQTwS1xLciP.jpg",
               "id": 58549,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Francis Flute",
               "gender": 2,
               "credit_id": "571f0efdc3a36856a70006a6",
               "name": "Sam Rockwell",
               "profile_path": "/mEH7nCaG75XNkoFbp3MIwCbIZb6.jpg",
               "id": 6807,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Egeus",
               "gender": 2,
               "credit_id": "571f0f1292514142e2001b68",
               "name": "Bernard Hill",
               "profile_path": "/fX9ggRFAZM7J8vPBdTWQphUNiRt.jpg",
               "id": 1369,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Philostrate",
               "gender": 2,
               "credit_id": "571f0f24c3a36833930027af",
               "name": "John Sessions",
               "profile_path": "/oLBcHRhah5FxyodfZECIHCrROwG.jpg",
               "id": 26860,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43429251416c750099a3",
               "name": "Michael Hoffman",
               "profile_path": "/xrMI8tNQgHws3o3Ku5cdH3ayXZx.jpg",
               "id": 52405,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c750099a9",
               "name": "Michael Hoffman",
               "profile_path": "/xrMI8tNQgHws3o3Ku5cdH3ayXZx.jpg",
               "id": 52405,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c750099af",
               "name": "Arnon Milchan",
               "profile_path": "/5crR5twLRcIdvRR06dB1O0EQ8x0.jpg",
               "id": 376,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43429251416c750099b5",
               "name": "Leslie Urdang",
               "profile_path": null,
               "id": 64179,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c750099bb",
               "name": "William Shakespeare",
               "profile_path": "/2z4njqosEQM4g26ttb9grG9rJUg.jpg",
               "id": 6210,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe43429251416c750099c1",
               "name": "Michael Hoffman",
               "profile_path": "/xrMI8tNQgHws3o3Ku5cdH3ayXZx.jpg",
               "id": 52405,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.117438,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 10210,
      "vote_count": 130,
      "budget": 11000000,
      "overview": "Shakespeare's comedy about two couples in love with the wrong partners, and how they are finally brought together rightly, thanks in part to the bungling work of Puck. It is completely in the language of the Bard, with Pfeiffer as the Fairy Queen and Kline as the one turned into her evening's lover with donkey ears.",
      "similar": [
         1934,
         11971,
         91745,
         10705,
         10688,
         261986,
         258775,
         261439,
         206863,
         247554,
         42605,
         233758,
         233409,
         47913,
         263025,
         319979,
         424897,
         106849,
         400389,
         454809
      ],
      "original_title": "A Midsummer Night's Dream",
      "runtime": 116,
      "poster_path": "/2pWSszXVEPPClWzy8yir1FVEveN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Taurus Film",
            "id": 20555,
            "origin_country": ""
         },
         {
            "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
            "name": "Fox Searchlight Pictures",
            "id": 43,
            "origin_country": "US"
         },
         {
            "logo_path": "/7PzJdsLGlR7oW4J0J5Xcd0pHGRg.png",
            "name": "Regency Enterprises",
            "id": 508,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-04-25",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Hold on to Your Heart. Cupid is Armed and Dangerous.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Hoffman"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "William Shakespeare",
         "Michael Hoffman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140379/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMTU2NTc1N15BMl5BanBnXkFtZTcwNDY1MjgxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Kline, Michelle Pfeiffer, Rupert Everett | See full cast and crew »"],
      "reviews": [
         "I'm a professional live theatre stagehand. People who are too centered on movies will have a hard time with this picture. If you could see the original first run performance of this play in Elizabethan England you would think you had stumbled into an over-costumed poetry reading. If the movie is hard to follow try & imagine what viewing that play would be like. It is the measure of Shakespeare's greatness that now 400 years later & in a medium born of photography that this greatest of fantasies still rings true. Try to show some respect; Shakespeare defined modern English. In comparing the lines to the original I thought that the adaptation was sensitive & well thought out. Simplified to fit the film medium but not sacrificing any of the truly great lines that actors drool over. The fairy world sets seemed cramped to me & reminded me of Cocteau's Beauty & the Beast. I personally found the setting of the movie in turn of century Italy kind of fun. Resetting Shakespeare in times & places other than he wrote is pretty much standard practice. The bicycles & the phonographs were amusing to me & generated some fun business for the actors. Kevin Kline was excellent as the ass. He got you to sympathize not pity or deride. In fact the whole amateur troop was memorable. Stanley Tucci was the quintessential Puck. Calista Flockhart threw everything including the kitchen sink into her part. Don't accuse her of overacting though; you'll only give away that you have never been deeply in love. Michelle Pfeiffer was radioactive beautiful, probably fatal closer than ten feet. Rupert Everett maintained perfect believability in a difficult part which is essentially support for Puck. As an answer to anyone who thought that things were a bit oversexed. The Renaissance was all about the rediscovery of the fact that people are noble & beautiful, not sinful & ugly. Shakespeare was one of the greatest products of the Renaissance. The movie is true to those Renaissance ideals. To sum up; a class act & class acts are not for everybody.",
         "I have seen criticism of this movie saying that the language should have been changed to our post-modern English instead of being the original late-middle/early modern English that Shakespeare used. But those who say that miss the point that what makes these plays so magnificent IS the language that Shakespeare used, and to change it would be to ruin the movie. Anyways, the acting is marvelous, as it should be from such a cast as this. Michelle Pfeiffer plays the part of Titania with the utmost perfection. Kevin Kline as Nick Bottom is equally as good, and the two end up having a chemistry that is unmistakable (even if he is an ass at this point). The directing is also great - almost as good as the acting, if not as good. Costumes, sets, everything with exception of there being headlights on the bicycles, is perfect. Michael Hoffman truly pulled of a great feat with this movie, and I would recommend it to anyone. Also, on a side note, if you have trouble understanding the language, though it be English, watch the DVD and turn on the subtext.",
         "As a general rule, I normally don't post comments unless I have enough time to write a thorough review, and have given it much thought before hand. I'm sorry, but even though it's 2am, I can't bear to go to sleep and let the review before me just sit there. Obviously the reviewer before me seems to have no idea that the complicities that arise from the various plots go back to Shakespeare himself - and it is a great achievement by this film to manage to keep all the plates spinning and all the stories interesting. I am amazed by this film. I am a life-long Shakespeare fan and it's great to see a faithful American production. The British/American cast all worked fantasically well together - Christian Bale, Anna Friel, Dominic West, and Calista Flockheart were all perfectly cast as the four lovers. The fairies and the actors both worked very well to frame the story - and the director has managed to keep it both visually unique and incredibly entertaining. I'm not quite sure why they decided to change the location from Greece to Italy, but in an age where Kenneth Branagh is trying to make a 1940s musical out of Love's Labour's Lost, I say, the changes could be a lot worse. All in all, this is a very impressive adaptation. I'm just happy to see that Shakespeare hasn't lost his appeal to modern audiences.",
         "Though some critics have dumped on this film, I was charmed by it. The movie literally sparkles. The settings are full of rich colors and magical lighting. The romantic classical music is all well chosen to help induce the hypnotic or dreamlike qualities. And the cast is an utter delight. This is a fluffy cloud of fairy dust -- just as Shakespeare intended.",
         "This is a wonderful film and an excellent version of the classic that was done so very, very well in 1935 and 1968. No, this is not the Royal Shakespeare Company, it's Hollywood but damn good Hollywood. Why? How can canned commercial movie-making compete with the Bard's best? Why does this version make that of the RSC three years before PALE? Well, there's the cast, for one. Stanley Tucci is delightful as a drole erring Puck carrying out the directives of Rupert Everett's pompous Oberon. The delightful Cast of Players, including Rockwell, Irwin, Rees, Wright and (tah-DAH!) Kevin Klein as Bottom. The scenes with the lovelier than lovely Michelle Pfeiffer's Titania are wonderful and poignant. It is delightful to see that gentle erotica can be suggested without nudity or slathering tongues, sucking lips as well as the usual grunts-pants-moans, etc. The lovers are likewise delightful with great, fun-packed performances by Christian Bale's Demetrius and Dominic West's Lysander in complete tune with Anna Fiel's Hermia and Calista Flockhart's Helena. Even David Strathairn's Theseus and Sophie Marceau's Hippolyta are wonderful. The story is moved from Athens Greece to Athens, Italy, at the turn of the 19th century with the lovers escaping on bicycles. Stanley Tucci's confrontation with the bike is a delight. This is a wonderful film with some new twists that depart from but do not detract from the Bard. The bit with Kevin Kline's wife, hard-looking but attractive Heather Parisi, works well with the setting of this fun-filled, joyful presentation.",
         "I admit, that I have not read the play, so probably all of the credit for the idea goes to Shakespeare himself. But I was also caught by the magic of the pictures. The actors and actresses were so pretty, the story so nicely recited, and the atmosphere somehow magically ravishing. I got a lot of positive feelings out of this movie, and when I walk through the forest now, I am reminded of them. Well, this film did leave a wonderful trace in my mind. Hopefully, it lasts for a couple of days. I give it an 8/10.",
         "I'm amazed at all of the negative critics out there. I guess there is no accounting for self-styled esoteric esoteric bozos. It is beautifully filmed with an outstanding and sensitive cast(Calista Flockhart has Shakespearian experience, and it shows). We need to remember that first ,last, and always Shakespeare is entertainment meant to be seen and enjoyed, not analysed to death.. When he is stylized into oblivion by myopic critics the very essence and greatness of his genius is lost. This is an extremely pleasant way to introduce yourself and/or children to the wondrous magic of Shakespeare and even better if you do a little plot research. Spectacular performance except for those with scales on their eyes.",
         "Having read other reviews of this film that whine about the scenery, Kevin Kline, etc., I have to say that I have no complaints. Obviously they do not remember that the sets that are unreal are supposed to be unreal -- this is supposed to be the realm of the fairies. The scenes that are supposed to be set in reality are VERY real -- and quite beautiful. The scenes that are set in unreality are VERY unreal --and quite beautiful. Calista Flockheart did an admirable job as the always forlorn Helena. Stanley Tucci as Puck was an absolute delight. Rupert Everett as the King of the Fairies..... well, it isn't exactly a stretch. Kevin Kline did NOT steal the movie -- he was but a part of an ensemble. With the exception of Michelle Pfeiffer every one in the cast knew what their lines meant and delivered them appropriately. Titania's first speech is simply words being repeated by rote -- could have been better. I truly enjoyed this film -- it is a good introduction to Shakespeare for those that are not familiar with him. ENJOY!",
         "A Midsummer Night's Dream is a very complicated play, and can get very silly at times, and this film is surprisingly faithful to the play. Yes, there was an attempt to partially modernise it, therefore the script wasn't as good as it could have been. The film itself is lovingly designed, with lavish costumes, stunning sets(my favourite being the wood set) and handsome cinematography. The music was lovely with clever use of music by the likes of Mendelssohn and Verdi. I thought the acting was very good indeed, Kevin Kline stealing the show as Bottom, most of the time hilarious, especially in the play scene, when we are shown what a bad actor Bottom really is. Michelle Pfeiffer is lovely also, and Rupert Everett is very charming also as Oberon. Callista Flockhart convinces also as Helena, and Stanley Tucci has a ball as Puck. The direction is competent, but my only other criticism is that the film is a little overlong. Overall, I genuinely enjoyed this film, not as good as Much Ado About Nothing(with Kenneth Branagh) or Macbeth (with Jon Finch), so I will happily award it 8/10. Bethany Cox.",
         "There have been many adaptations of Shakespeare plays over the last decade or so, most of them aimed squarely at younger viewers. You know the drill: The director picks out rocking, hip tunes to spice up the soundtrack and some hot, young stars to broadly interpret the Bard's work. That's not the case here. Kevin Kline gets to ham it up as Nick Bottom, the base mechanical with delusions of thespian grandeur, and Michelle Pfeiffer gets to show off her own acting chops as Titania, the Queen of the fairies. Okay, so maybe a little knowledge of the play itself would help the average viewer, but if you're not a fan of the play, you can still witness some absolutely sumptuous camerawork and some funny, funny scenes - many of them dealing with the spellbound Bottom, who's been turned into a jackass. Stanley Tucci underplays (somewhat surprisingly) his role as the mischievous Puck, and even Callista Flockhart turns in a solid performance as one of four human (non-fairy) lovers."
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Fox Searchlight Pictures",
         "Regency Enterprises",
         "Taurus Film"
      ],
      "summaries": [
         "Shakespeare's intertwined love polygons begin to get complicated from the start--Demetrius and Lysander both want Hermia but she only has eyes for Lysander. Bad news is, Hermia's father wants Demetrius for a son-in-law. On the outside is Helena, whose unreturned love burns hot for Demetrius. Hermia and Lysander plan to flee from the city under cover of darkness but are pursued by an enraged Demetrius (who is himself pursued by an enraptured Helena). In the forest, unbeknownst to the mortals, Oberon and Titania (King and Queen of the faeries) are having a spat over a servant boy. The plot twists up when Oberon's head mischief-maker, Puck, runs loose with a flower which causes people to fall in love with the first thing they see upon waking. Throw in a group of labourers preparing a play for the Duke's wedding (one of whom is given a donkey's head and Titania for a lover by Puck) and the complications become fantastically funny.",
         "Shakespeare's comedy about two couples in love with the wrong partners, and how they are finally brought together rightly, thanks in part to the bungling work of Puck. It is completely in the language of the Bard, with Pfeiffer as the Fairy Queen and Kline as the one turned into her evening's lover with donkey ears.",
         "Monte Atena, nella campagna toscana, agli inizi del Novecento. Egeo, notabile locale, vorrebbe che la figlia Ermia sposasse Demetrio, giovane benestante, ma la ragazza ama, ricambiata, Lisandro. Perciò i due giovani amanti decidono di fuggire nella foresta, dove si sono recati anche lo stesso Demetrio ed Elena, che lo ama inutilmente. Il tutto sullo sfondo dei preparativi per le nozze del duca Teseo con Ippolita. Le vicende si intrecciano con quelle di una scalcagnata compagnia di comici che spera di recitare alla presenza del duca e con le schermaglie fra Oberon e Titania, re e regina di elfi e fate della foresta. Le scorribande amorose si complicheranno maggiormente a causa del maldestro intervento del folletto Puck, paggio di Oberon. Alla fine, come nelle migliori tradizioni, tutto si aggiusta e le nozze celebrate.......saranno tre !",
         "Lovers lives are complicated by city law, feuding faerie royalty, and... love."
      ],
      "budget": 11000000
   },
   "movielensId": 2622,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-25",
      "dvdReleaseDate": "1999-11-30",
      "directors": ["Michael Hoffman"],
      "runtime": 116,
      "movieId": 2622,
      "title": "A Midsummer Night's Dream",
      "mpaa": "PG-13",
      "actors": [
         "Rupert Everett",
         "Calista Flockhart",
         "Kevin Kline",
         "Michelle Pfeiffer",
         "Stanley Tucci",
         "Christian Bale",
         "Sophie Marceau",
         "David Strathairn",
         "Anna Friel",
         "Dominic West",
         "Roger Rees",
         "Max Wright",
         "Gregory Jbara",
         "Bill Irwin",
         "Sam Rockwell",
         "Bernard Hill",
         "John Sessions"
      ],
      "imdbMovieId": "0140379",
      "originalTitle": "A Midsummer Night's Dream",
      "genres": [
         "Fantasy",
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["QYknOe7OluE"],
      "plotSummary": "Shakespeare's comedy about two couples in love with the wrong partners, and how they are finally brought together rightly, thanks in part to the bungling work of Puck. It is completely in the language of the Bard, with Pfeiffer as the Fairy Queen and Kline as the one turned into her evening's lover with donkey ears.",
      "tmdbMovieId": 10210,
      "avgRating": 3.29203,
      "releaseYear": "1999",
      "numRatings": 4241,
      "posterPath": "/2pWSszXVEPPClWzy8yir1FVEveN.jpg"
   }
}