{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "prom",
            "id": 10266
         }
      ],
      "imdb_id": "tt0160298",
      "video": false,
      "title": "Trippin'",
      "recommendations": [49471],
      "backdrop_path": "/51hztmb7yT7ksQzCtxQ7ScOyyDy.jpg",
      "revenue": 9016377,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gregory Reed",
               "gender": 2,
               "credit_id": "52fe487fc3a36847f816a4ab",
               "name": "Deon Richmond",
               "profile_path": "/edx02xKeswZCSHcpmNZFHnUURmU.jpg",
               "id": 35596,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "June Nelson",
               "gender": 2,
               "credit_id": "52fe487fc3a36847f816a4af",
               "name": "Donald Faison",
               "profile_path": "/j3YbuYlQgqLNY0YdtgFR6Jn5imo.jpg",
               "id": 49002,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Fish",
               "gender": 2,
               "credit_id": "52fe487fc3a36847f816a4b3",
               "name": "Guy Torry",
               "profile_path": "/aNpthnwYd2oHN8KhYBUAhzViNzT.jpg",
               "id": 828,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Cinny Hawkins",
               "gender": 1,
               "credit_id": "52fe487fc3a36847f816a4b7",
               "name": "Maia Campbell",
               "profile_path": "/6xYubfFkadme5IcRQD7xTOAr96v.jpg",
               "id": 54429,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Louise Reed",
               "gender": 1,
               "credit_id": "548607419251416a5d0038e9",
               "name": "Aloma Wright",
               "profile_path": "/50kyJVGDV5Oxsf0Izk2M284AgKw.jpg",
               "id": 49551,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54437f6b0e0a26633a004675",
               "name": "David Raynr",
               "profile_path": null,
               "id": 161858,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54860730c3a3686767001d28",
               "name": "Gary Hardwick",
               "profile_path": null,
               "id": 95458,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.304331,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53862,
      "vote_count": 4,
      "budget": 0,
      "overview": "Greg is near the end of his senior year in high school, wanting to go to the prom, eyeing Cinny (the school's beauty with brains) from afar, and regularly trippin', daydreaming about being a big success as a poet, a student, a lover. His mom wants him to apply to colleges, but Greg hasn't a clue. One of his teachers, Mr. Shapic, tries to inspire him, too. He finally figures out he can get close to Cinny if he asks her for help with college applications. But friendship isn't enough, he wants romance and a prom date. So, he tells a few lies and, for awhile, it seems to be working. Then, things fall apart and Greg has to figure out how to put the trippin aside and get real.",
      "similar": [
         19840,
         272693,
         10625,
         89185,
         10314,
         37725,
         2105,
         449176,
         9880,
         26123,
         9611,
         10206,
         15037,
         57214,
         4951,
         9655,
         9377,
         37735,
         2108,
         8193
      ],
      "original_title": "Trippin'",
      "runtime": 94,
      "poster_path": "/cR2rHbeUkTRe4UkzRldTEwWjgQQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Beacon Communications",
         "id": 919,
         "origin_country": ""
      }],
      "release_date": "1999-05-12",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "He's a legend in his own mind.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["David Raynr"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Gary Hardwick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0160298/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNTEzNDI3Ml5BMl5BanBnXkFtZTcwNjM4NjcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Deon Richmond, Donald Faison, Guy Torry | See full cast and crew »"],
      "reviews": [
         "This is one of my favourite comedies even though it is a little more low budget than most. I enjoyed it because of the hilarious characters in the movie like the grandfather, and Greg himself, also Greg's daydreaming scenes are hilarious. I found it to have a realistic portrayal of African American families,unlike some movies and tv shows that display black families differently and wrongly. This is another reason why I enjoyed the movie, I could relate to a lot of the characters in the movie and everybody was simple and down to earth. I will never get tired of watching this movie, it is great. It is not a comedy for everyone, that's for sure. To really enjoy this movie you would probably have to be able to relate to the characters, if not you won't find the humour in it. For a low budget movie, it is really funny!",
         "This movie is a funny teen comedy about a high school senior who is your typical loser. He daydreams about what he wants, but what he can't have. Then he mets Cinny, and he falls head over heels with her, but she's way out of his league. So he lies to her and tells her things to flatter himself to get her attracted to him, then she likes him, but finds out later he lied. Then dumps him, and then goes to the prom (major event in this movie) with her ex-boyfriend. The really sad part in this movie that is really painful is how he ends up going to the prom all alone, and on the bus too, and with no date either! That's gotta hurt! His family is supportive of him, but when he leaves the house for the bus stop, they feel pity on him. This movie may provoke bad memories for some people who had it hard in high school, but the ending is very nice.....like all movies in hollywood!",
         "This is a really funny movie. The acting of stars such as Donald Faison, Deon Richmond, and Guy Torry help this film alot. the best parts are the dream sequences. Now that's funny. I would recommend this movie to ghetto comedy or just comedy. Overall the movie is funny and people should lighten up on what they think. Rating 9 out of 10.",
         "A classic high school film in the mold of the John Hughes pics from the '80s. Decent story aided by good performances and some great jokes. You'll never look at fried eggs the same way again. Load granddad up with pork and enjoy.",
         "TRIPPIN' / (1999) ** (out of four) By Blake French: \"Trippin\" refers the daydreaming of a character as he fantasizes about being successful, popular, and having young, voluptuous, scantily clad women exposing themselves to him. The character's named is \"G,\" a slacker played by Deon Richmond, a high school senior with nothing better to do than imagine himself as being powerful and rich. The biggest problem in his life is finding a date for the upcoming senior prom, and getting some money so he can afford to go. His parents (characters recycled straight from \"The Nutty Professor,\" except not as funny) refuse to supply him with cash until he submits his college applications. \"G\" also has a teacher who tries to teach him to plan for the future, but he would rather waste his time with his two best friends, who waste most of their time. \"G\" falls in love with the smartest and most beautiful girl in his school. Her name is Cinny Hawkins (Maia Campbell), and \"G\" knows he does not have a chance in hell with her. He soon gets the idea that if he makes himself look good and impresses her by lying, she will find him irresistible. Although at first Cinny wants absolutely nothing to do with \"G,\" she soon finds him as an interesting young person and the two become friends. \"Trippin\" would not be bad if it had any point whatsoever. It does contain an underlying message, just be yourself, but the execution of the material is juvenile and too immature. There are a lot of light-hearted scenes, and the movie is clearly not to be taken seriously, but with more thought there could have been some potential considering the amusingly exaggerated characters and the clever performances. \"Trippin\" hits a few targets, but unfortunately they are the wrong targets. It knows how to develop romantic chemistry, and it is interesting to see a hopeless romantic become friends with the unlikeliest mate. There could be so much more though, if the characters were given more to do, and if they were better defined, and if the script provided more funny sequences rather than enlightening ones; this movie is about a nobody character in a shallow situation. Neither the tension nor stakes are high enough to hold attention. The film does manage to avoid falling into the contrived pitfall of clichés, standing on its own as an imaginative character study. You may not expect a movie like this to be too pushy on a moral theme, but that is exactly the case here. What keeps the movie somewhat interesting is G's realization of maturity and struggle with peer pressure. There is a consistent and imaginative point of view, but it is not supported with equally effective dialogue. The romantic elements between \"G\" and Cinny are chemistry-rich and charming; this is the most enjoyable thing in \"Trippin.\" The film also makes a good point about losers, but it feels as if the characters are following the script rather than making convincing choices on their own. In short, \"Trippin\" is an amusing romantic comedy with imagination and colorful elements, but ultimately fails to a lackluster script. Rating: C+",
         "This movie is truly funny, not a waste of time or overladen with cheese. There are horrible cliches in the plot and a totally worthless subplot but they don't drag on too long. The main character played 'Bud' on the Cosby Show way back in the day. There are a ton of laugh out loud jokes. The dream sequences are hilarious, especially the army dream, and the women in this movie are gorgeous and all that good stuff. Rent this bad boy and watch it with friends. If you're a pimp, watch it with your hoes.",
         "this movie is great I watched it three times in one day and I wasnt bored of it a funny movie like this is my type of movie. ok he day dreams a litle bit but most of the times thats what makes it funny. oh does enyone remember the bit where june tryes to hook fish up with some girl",
         "Everything in the movie was predictable and cartoonish. It kind of reminded me of a \"black\" \"Saved By The Bell\" movie. I got tired of the played sad/infatuated with beautiful-girl/day-dreamin' high school kid movies. I mean, this sort of story is just played out. Surprisingly, I liked \"Good Burger\" better than this movie, and that's by Nickelodeon!!!! I would wait until this movie appears on TNT, USA, or Comedy Central to see it again. I definitely wasted $13.50 on a date to see this movie. There were a lot of unnecessary plots, profanity, and scenes throughout the movie. They were so insignificant, the movie got off beat by a long shot. It deserves a Golden Raspberry Award for \"Worst Cheesiness.\" The only part I liked in the movie, was when they trying to feed his grandfather at the breakfast table. Now that was comedy. Overall the movie belongs in a dumpster, next to the used up Goodwill items."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Beacon Communications"],
      "summaries": ["Greg is near the end of his senior year in high school, wanting to go to the prom, eyeing Cinny (the school's beauty with brains) from afar, and regularly trippin', daydreaming about being a big success as a poet, a student, a lover. His mom wants him to apply to colleges, but Greg hasn't a clue. One of his teachers, Mr. Shapic, tries to inspire him, too. He finally figures out he can get close to Cinny if he asks her for help with college applications. But friendship isn't enough, he wants romance and a prom date. So, he tells a few lies and, for awhile, it seems to be working. Then, things fall apart and Greg has to figure out how to put the trippin aside and get real."],
      "budget": 0
   },
   "movielensId": 2623,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-05-12",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["David Raynr"],
      "runtime": 94,
      "movieId": 2623,
      "title": "Trippin'",
      "mpaa": "R",
      "actors": [
         "Deon Richmond",
         "Donald Faison",
         "Guy Torry",
         "Maia Campbell",
         "Aloma Wright"
      ],
      "imdbMovieId": "0160298",
      "originalTitle": "Trippin'",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["8G3aNrWzb3M"],
      "plotSummary": "Greg is near the end of his senior year in high school, wanting to go to the prom, eyeing Cinny (the school's beauty with brains) from afar, and regularly trippin', daydreaming about being a big success as a poet, a student, a lover. His mom wants him to apply to colleges, but Greg hasn't a clue. One of his teachers, Mr. Shapic, tries to inspire him, too. He finally figures out he can get close to Cinny if he asks her for help with college applications. But friendship isn't enough, he wants romance and a prom date. So, he tells a few lies and, for awhile, it seems to be working. Then, things fall apart and Greg has to figure out how to put the trippin aside and get real.",
      "tmdbMovieId": 53862,
      "avgRating": 2.39623,
      "releaseYear": "1999",
      "numRatings": 53,
      "posterPath": "/cR2rHbeUkTRe4UkzRldTEwWjgQQ.jpg"
   }
}