{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "grandparent grandchild relationship",
            "id": 1158
         },
         {
            "name": "cloud",
            "id": 3124
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "heaven",
            "id": 4116
         },
         {
            "name": "bell",
            "id": 9995
         },
         {
            "name": "teenage girl",
            "id": 10809
         },
         {
            "name": "memory",
            "id": 10937
         },
         {
            "name": "old man",
            "id": 10938
         },
         {
            "name": "videotape",
            "id": 177185
         },
         {
            "name": "eternity",
            "id": 188290
         },
         {
            "name": "disneyland",
            "id": 188291
         },
         {
            "name": "remembrance",
            "id": 188293
         }
      ],
      "imdb_id": "tt0165078",
      "video": false,
      "title": "After Life",
      "recommendations": [
         18872,
         15318,
         20525,
         54986,
         37288,
         25050,
         36872,
         31427,
         31140,
         45802,
         33205,
         41245,
         38047,
         55368,
         72933,
         50247,
         1050,
         27245,
         40427,
         28276
      ],
      "backdrop_path": "/mNRWXz3mtb0y0w0LimUOcleqXEP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Takashi Mochizuki",
               "gender": 2,
               "credit_id": "52fe47569251416c75095c39",
               "name": "Arata Iura",
               "profile_path": "/95AJsxMrzI0N9VLvhyawqL7EHEl.jpg",
               "id": 82540,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Shiori Satonaka",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c3d",
               "name": "Erika Oda",
               "profile_path": "/6KByCNQD5QLpNeAvthaPimDJHa6.jpg",
               "id": 82541,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Satoru Kawashima",
               "gender": 2,
               "credit_id": "52fe47569251416c75095c41",
               "name": "Susumu Terajima",
               "profile_path": "/oZPxC2TvOu9DeeVUg38P043ItpJ.jpg",
               "id": 4990,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Takuro Sugie",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c45",
               "name": "Takashi Naito",
               "profile_path": "/ljbNlt6v9a7E9uvnph2qAJ6ba55.jpg",
               "id": 19590,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kennosuke Nakamura",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c49",
               "name": "Kei Tani",
               "profile_path": "/yDIT9sUuS7uLS5fwF3ijiAmQJ1s.jpg",
               "id": 82542,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Kyoko Watanabe, Ichiro's Wife",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c77",
               "name": "Kyôko Kagawa",
               "profile_path": "/q47wPwySJvhj6HQoYb7ON1TjbcV.jpg",
               "id": 34374,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Gisuke Shoda",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c7b",
               "name": "Toru Yuri",
               "profile_path": null,
               "id": 1029304,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Yusuke Iseya",
               "gender": 2,
               "credit_id": "52fe47569251416c75095c7f",
               "name": "Yusuke Iseya",
               "profile_path": "/5GhcLQLicLe8xdJlnV7ic7Dtjr5.jpg",
               "id": 70209,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Kana Yoshino",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c83",
               "name": "Sayaka Yoshino",
               "profile_path": null,
               "id": 145913,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Nobuko Amano",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c87",
               "name": "Kazuko Shirakawa",
               "profile_path": null,
               "id": 1087690,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Kenji Yamamoto",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c8b",
               "name": "Kotaro Shiga",
               "profile_path": "/liwUPZ6RLPogEH6d51tL9Dcswo2.jpg",
               "id": 237324,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Kiyo Nishimura",
               "gender": 0,
               "credit_id": "52fe47569251416c75095c8f",
               "name": "Hisako Hara",
               "profile_path": null,
               "id": 134289,
               "order": 11
            },
            {
               "cast_id": 25,
               "character": "",
               "gender": 0,
               "credit_id": "54c3e0a6c3a368792c005a3b",
               "name": "Natsuo Ishido",
               "profile_path": null,
               "id": 1402854,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095c35",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095c4f",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47569251416c75095c55",
               "name": "Masayuki Akieda",
               "profile_path": null,
               "id": 1087687,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47569251416c75095c5b",
               "name": "Shiho Sato",
               "profile_path": null,
               "id": 1087688,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47569251416c75095c61",
               "name": "Yasuhiro Kasamatsu",
               "profile_path": null,
               "id": 1087689,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095c73",
               "name": "Hirokazu Koreeda",
               "profile_path": "/A77pQdT7DePbcjLy6yXyoGKN0TY.jpg",
               "id": 25645,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe47569251416c75095c95",
               "name": "Yutaka Shigenobu",
               "profile_path": null,
               "id": 553115,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47569251416c75095c9b",
               "name": "Hideo Gunji",
               "profile_path": null,
               "id": 1130133,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095ca1",
               "name": "Toshihiro Isomi",
               "profile_path": null,
               "id": 20703,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "56a8a07392514136310027da",
               "name": "Yutaka Yamazaki",
               "profile_path": "/gW8dR1Tb06MVqqG9e8Cayym4OBy.jpg",
               "id": 25646,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56a8a083c3a36828ac004dac",
               "name": "Masayoshi Sukita",
               "profile_path": null,
               "id": 1081006,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.216595,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 17962,
      "vote_count": 61,
      "budget": 11791,
      "overview": "After death, people have just one week to choose only a memory to keep for eternity.",
      "similar": [
         309809,
         10145,
         27932,
         334354,
         29987,
         26964,
         67060,
         338774,
         466979,
         264970
      ],
      "original_title": "ワンダフルライフ",
      "runtime": 118,
      "poster_path": "/5edwcfe4szCQU6Mq8rPS667Yv7g.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Engine Films",
            "id": 1141,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Sputnik Productions",
            "id": 12423,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TV Man Union",
            "id": 12424,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-11",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "What is the one memory you would take with you?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hirokazu Koreeda"],
      "runtime": 118,
      "synopsis": "Life is truly known only to those who suffer, lose, endure adversity and stumble from defeat to defeat. Anais Nin",
      "writers": ["Hirokazu Koreeda"],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0165078/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4MTg3OTIwMF5BMl5BanBnXkFtZTcwMjg1MDIyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Arata Iura, Erika Oda, Susumu Terajima | See full cast and crew »"],
      "reviews": [
         "The Afterlife is best thought of as a kind of thought experiment, perhaps in the same vein as Groundhog Day. The point is not that this may be what we experience after death; it is rather that we need to think more about what it is in this life that we'd really like to keep with us forever. This point needs emphasis. When asked what we want most in life, most of us will talk about our career, or a business venture perhaps, or some other accomplishment. This movie suggests that these kinds of things may not, at the end of the day, be so important as some other experiences we may have. In any case, it challenges us to rethink what it is we really value. Some reviewers complain about the quite ordinary surroundings and \"poor production values\" of the movie. I prefer to think of the choice of sets etc as humble and realistic. Could any movie, whatever its budget, ever possibly do justice to this subject matter? Much of this movie is devoted to explorations of the lives of a number of rather ordinary people, trying to identify their most cherished memories. Some reviewers have condemned The Afterlife as boring, boring, BORING on this account. It all depends on whether other people interest you. If all you want to see is car chases, sex, explosions, cool special effects,...avoid this movie. Only, it's worth noting that the lives and thoughts of others may help us to better understand ourselves. And nowhere more so than in this movie.",
         "\"When we come to the last moment of this lifetime and we look back across it, the only thing that's going to matter is 'What is the quality of our love?\" - Richard Bach One of the most commonly reported aspects of near-death experiences is the life review, the seeing and re-experiencing of major and trivial events of one's life, sometimes from the perspective of the other people involved. Most say that the single most important lesson they learned is that the actions we think are trivial and unimportant turn out to be the most important, especially ones that involve spontaneous acts of love. While not exactly a life review, in After Life by Hirokazu Koreeda, a group of recently deceased people are asked to look back at their life and choose only one memory from their life that they want to take with them to eternity. The process compels people to look at their life in its entirety and see what worked and what was missing. Set in a dreary barracks-like way station, civil servants meet with those just crossed over to help them choose the experience they want to hold on to. For some, the choice is easy, for others it is difficult. Those that will not or cannot choose are consigned to work in the substation with the newly deceased until they are ready to move on. The counselors work one on one with each individual telling them that they have three days to make their choice. Once a memory is selected, a film crew recreates the memory-- sets are built and the little touches of sights and sounds are selected until the deceased are satisfied that they are witnessing a perfect recreation of their experience. It is that film that they take with them, not the original memory. At first some choose things such as a trip to Disneyland, a sexual encounter, or a memorable bowl of rice but later gravitate toward experiences that are more meaningful. The center of the film revolves around those who are unable to choose. Ichiro Watanabe (Taketoshi Naito) is a 70-year old management consultant who has led an uneventful life and is challenged to find a memory he thinks is worth preserving for all time. To help him in this process, he is allowed to scan through piles of videotapes representing each year of his life. One young man wants to choose a dream instead of an actual event. Another wants to forget his past entirely, and an elderly woman is stuck in the mindset of a nine-year old girl. After Life is the story of the caseworkers as well. Takashi Mochizuki (Arata) has been stuck in limbo because he cannot find any happiness in his twenty-two years until he realizes how his short life deeply affected someone else. His perfect realization also affects a co-worker Shiori (Erika Oda) who has fallen in love with him. After Life is a beautiful and touching film that allows us to reflect on the things that brought us joy in our own life, and to recognize that true happiness lies, not in outward symbols of success, but in giving ourselves to others.",
         "Afterlife is another film offering an answer to the unanswerable question \"What happens after you die? \". Although this has been asked many times through cinema in the past, few films have answered as elegantly as Afterlife. Directly after dying the departed are received by a group of counsellors who assist them in finding what was, for them, the most beautiful and perfect, single experience of their lives. For some the choice is easy and they are instantly able to provide the moment, which, once recreated by technicians, they remain in forever but the majority of the film concentrates upon those who are unable to find their perfect moment, and need extra help to recall past loves and lost days of their youth. The institution has the perfect means to assist this choice, with the complete life of everyone on grainy home-video, perhaps a comment on the tehcnology and recording-obsessed Japanese. Many of the scenes are visually exceptional, especially those in the snow and everything seems very real, and, ironically, down-to-earth, especially the school building being used throughout the film giving an institutional feeling, but the interaction between the staff is where the film holds its true strength. Especially interesting is the relationship between Shiori, a newly employed worker, and Mochizuki, her mentor, which develops throughout. The film is slow to start due to the documentary style often used, but proceeds in an enveloping manner holding your attention to the end. Along with \"Heaven can wait\" and \"Beetlejuice\" this film offers another novel look at life, death and the hereafter. The Japanese title was \"Wandafuru raifu\" (wonderful life, after Frank Capra) and, even though the film is dealing with death, it is a statement of how wonderful life is. I loved this film and it stuck me stunningly and reminded me of how good films can be when they try.",
         "I really loved Kore-eda's first feature \"Maboroshi No Hikari\", so I had been looking forward very much to seeing \"Afterlife\" (named \"Wandafuru raifu\" in Japanese, after Frank Capra's movie \"It's a wonderful Life\") during its run in London. At first I noticed that the film is formally very different from its predecessor; while \"Maboroshi No Hikari\" owes much to the influence of Ozu, and especially Hou Hsiao-hsien, \"Afterlife\" draws more on the directors background as a documentary filmmaker. What the two films share, however, is the theme of memory (Note: also a theme with Hirokazu Kore-eda's documentary work - check out \"Without Memory\", about a man suffering of severe amnesia). In \"Maboroshi No Hikari\" Yumiko is not able to forget the memory of her dead husband, whereas in \"Afterlife\" the recently deceased must chose one memory that will accompany them into eternity. I feel that Kore-eda handles this entirely hypothetical premise in the best possible way, by steering completely clear of the stylistic superficialities with which so many other films about life after death desperately try to make themselves believable. The unspectacular old school building as a setting, the ceiling window with its interchangeable templates for the different stages of the moon, a character who himself has doubts as to whether this is really the best way of going to the next world and the absence of any religious connotations, among other things, all serve to keep the focus on the characters and their memories - many of whom are actually real. Apart from tongue in cheek humour, the lack of music also prevents over-sentimentalization and makes the memories the people recall the more sincere. The no-budget filming of the recollections of the deceased in order to trigger their personal memory, toward the end of the movie, also illustrates that the director is fully aware of his own limitations and possibilities as a film-maker. Rather than just trying to create the illusion of some half-baked version of the hereafter, he wants to challenge the viewer to reflect on what would be his/her most important memory - and succeeds in every way. This is a movie that surly can be appreciated by anyone who possesses at least a tiniest inkling of openness and willingness to experience cinema as more than mere entertainment. Top mark for this one!",
         "Every Monday morning, a team of advisors welcome in a facility a group of people that has just died with the mission of helping each one of them to select their best memory that will last for the eternity in the first three days. On Thursday, filmmakers begin to recreate the selected memory, and in the end of the week they screen it in a movie theater and he or she moves to Heaven. I bought \"Wandâfuru Raifu\", or \"After Life\" on DVD, since I was very intrigued with the summary on its cover. I saw this low budget movie spoken in Japanese with English subtitles and I found the story very original and provocative. The premise of rebuilding eternity along a week, like God created Earth, and Heaven be a projection of a movie of the best memory one could have, is fantastic. In spite of having unexplained points, like for example the need itself of lasting with only one single memory, and inconsistencies, like why the need of shooting the memory, if the staff can bring videotapes of the entire life, what matters is the originality of this unique movie. One point that has always impressed me in cinema is the fact the actors and actresses last forever in the eyes of the audiences along generations. In this movie, each one of us has the chance to be an actor or actress, and write our own screenplay. Further, I personally recalled many good moments of my life just because of the storyline of this movie, and I found how difficult it could be to select only one good moment of my life to last forever. My vote is seven. Title (Brazil): \"Depois da Vida\" (\"After Life\")",
         "One of the few masterpieces of the year, and a rare sighting of a new talent who will surely become one of the greats. Fantasy is once again shown to be the most flexible of all forms - it can sustain profound metaphysical questions as well as examinations into Japanese history, culture and society. But, most importantly, it is the true form to examine people - their hopes and desires, fears and failures. Despite the buff hue and downbeat tone, AFTER LIFE is a comedy, it celebrates life even as it ends, even as it disappoints. It also makes the strongest case for - and against - filmmaking in recent memory.",
         "I think this film is as much about film-making as it is about \"Heaven\". I think the previous comment about creating lasting illusion on limited budgets pointed to the heart of this film. It is about a love of cinema much like \"Cinema Paradiso\". A small crew of people have to create memories that last forever with shaky props and jury-rigged effects but it doesn't matter. The viewer is an active participant and memory can be revived with the barest of props and sets. Isn't that the ESSENCE of film, memory and active participation by the audience is why a film delights. The more you can relate to a film and understand it in terms of your own life, the more satisfying the whole experience is.",
         "Afterlife is without a doubt one of the greatest Japanese films I've ever seen. Visually it is truly stunning. Kore Eda is known for his own obsession with lighting and his skill for casting shadows and beams of white light are second to none. Combined with an innovative, creative and enjoyable story that takes on a slightly supernatural docu-drama and at the same time is set in a dull, down and out halfway house between Earth(life) and heaven(afterlife). Fascinating scenes take place as the deceased have one week to decide on a single memory from their lifetime that they can keep for all eternity. He also includes elements of documentary with talking head scenes of the deceased talking about their memories. Kore Eda throws around some extremely interesting ideas and themes on life and human emotions for our memories and he genuinely makes you think about what he's said once you've finished watching. This is a film that not everyone would enjoy due to its slow moving pace, mood orientated lighting and partly improvised script, but it is a creative masterpiece that is definitely worthy of high praise and attention.",
         "I saw this movie in the theatre. It is always a pleasure to be at a viewing where there is spontaneous applause at the end. This is one of those movies. It speaks to your very soul. I understand that quite a few of the cast were not professional actors, but spoke from their own lifetime experiences. There is a very simple premise: you get to choose the most favourite moment of your life after you are dead and then help to recreate it, staging, cast of characters, scene - and the total non-professional manufacturing of this moment I found very touching - so that it can be savoured for all eternity. The perfect heaven. Of course some recently dead people can't think of anything, some remember very simple things, some are given assistance, like the record of their entire life in video form to review and extract a memory, if they can. The cast and direction is brilliant. I shudder to think of what modern Hollywood would do with this (\"What dreams may come\" being a case in point). It was all extremely simple and believable and has certainly had me talking about it for quite a while since I have seen it. 8 out of 10.",
         "The movie is told in such a way that the people coming in reveals themselves in such a way that they all realize that there is a part of themselves in which it is truly good, even if it is deeply buried. The way it is filmed, as if it is a documentary, provides the cunning realism that you would not ordinarily achieve in regular film. Even at the end, we discover the true reason one of the counselor stayed around instead of moving on. Truly a touching and thought provoking film. It will make you try to think for yourself which memory you would cherish forever, even if it is single one."
      ],
      "genres": [
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Engine Film",
         "Sputnik Productions",
         "TV Man Union"
      ],
      "summaries": [
         "After people die, they spend a week with counselors, also dead, who help them pick one memory, the only memory they can take to eternity. They describe the memory to the staff who work with a crew to film it and screen it at week's end; eternity follows. 22 dead arrive that week, assigned to three counselors and a trainee. One old man cannot find a memory, so he watches videotape of his life. Others pick their memory quickly, and the film crew gets right to work. The trainee, 18-year-old Shiori, helps a teenage girl choose a memory other than Disneyland. The youthful staff have a secret and feelings, too, which play out, especially Shiori's affection for her mentor, Mochizuki",
         "Every Monday morning, a team of advisors welcome in a facility a group of people that has just died with the mission of helping each one of them to select their best memory that will last for the eternity in the first three days. On Thursday, filmmakers begin to recreate the selected memory, and in the end of the week they screen it in a movie theater and he or she moves to Heaven.",
         "After death, people have just one week to choose only a memory to keep for eternity."
      ],
      "budget": 0
   },
   "movielensId": 2624,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1998-09-11",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Hirokazu Koreeda"],
      "runtime": 118,
      "movieId": 2624,
      "title": "After Life",
      "mpaa": "",
      "actors": [
         "Arata Iura",
         "Erika Oda",
         "Susumu Terajima",
         "Takashi Naito",
         "Kei Tani",
         "Kyôko Kagawa",
         "Toru Yuri",
         "Yusuke Iseya",
         "Sayaka Yoshino",
         "Kazuko Shirakawa",
         "Kotaro Shiga",
         "Hisako Hara",
         "Natsuo Ishido"
      ],
      "imdbMovieId": "0165078",
      "originalTitle": "ワンダフルライフ",
      "genres": [
         "Fantasy",
         "Drama"
      ],
      "youtubeTrailerIds": ["DN9sr5wVkik"],
      "plotSummary": "After death, people have just one week to choose only a memory to keep for eternity.",
      "tmdbMovieId": 17962,
      "avgRating": 3.94982,
      "releaseYear": "1998",
      "numRatings": 827,
      "posterPath": "/5edwcfe4szCQU6Mq8rPS667Yv7g.jpg"
   }
}