{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120659",
      "video": false,
      "title": "Endurance",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4a77c3a368484e155063",
               "name": "Haile Gebrsellasie",
               "profile_path": null,
               "id": 1085098,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Haile's Mother",
               "gender": 0,
               "credit_id": "52fe4a77c3a368484e155067",
               "name": "Shawananness Gebrselassie",
               "profile_path": null,
               "id": 1018249,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Young Haile Gebrselassie",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e15506b",
               "name": "Yonas Zergaw",
               "profile_path": null,
               "id": 1018137,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Young Haile's Father",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e15506f",
               "name": "Tedesse Haile",
               "profile_path": null,
               "id": 1018138,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Himself (Haile's Father)",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e155073",
               "name": "Bekele Gebrselassie",
               "profile_path": null,
               "id": 1085099,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Herself (Haile's Wife)",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e155077",
               "name": "Alem Tellahun",
               "profile_path": null,
               "id": 1018140,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e15507b",
               "name": "Assefa Gebrselassie",
               "profile_path": null,
               "id": 1085100,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e15507f",
               "name": "Tizazu Mashresha",
               "profile_path": null,
               "id": 1085101,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e155083",
               "name": "Winishet Tesfaye",
               "profile_path": null,
               "id": 1085102,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4a78c3a368484e155087",
               "name": "Abinet Tedesse",
               "profile_path": null,
               "id": 1085103,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4a77c3a368484e155059",
               "name": "Leslie Woodhead",
               "profile_path": null,
               "id": 234358,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a800c9d0e0a262aac01c240",
               "name": "Bud Greenspan",
               "profile_path": "/G1fu7x1LZ5E4xipyNVGivDkGIl.jpg",
               "id": 222441,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.100471,
      "production_countries": [],
      "id": 122190,
      "vote_count": 2,
      "budget": 0,
      "overview": "The gold medal for the men's 10,000-meter race in the 1996 Atlanta Olympics is won by Ethiopian Haile Gebrselassie.",
      "similar": [],
      "original_title": "Endurance",
      "runtime": 83,
      "poster_path": "/aFOOg7ymKbdwfgtbWOvSbrKp5WL.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-05-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Leslie Woodhead",
         "Bud Greenspan"
      ],
      "runtime": 83,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120659/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUxMTQzNDk5Nl5BMl5BanBnXkFtZTcwNjEzNzgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Haile Gebrsellasie, Shawananness Gebrselassie, Yonas Zergaw | See full cast and crew »"],
      "reviews": [
         "I am surprised at the low rating and low number of votes for Endurance. I rented this movie recently and it truly moved me. I spent time in Tanzania in 2003 and it changed my life. The Ethiopian land and culture are quite different but the entire movie brought back emotional flashbacks to my time in Tanzania. The scenes of everyday African life in Endurance are the most realistic and gritty that I have seen in a popular movie. The fact that many of the actors are playing themselves only adds to it. This is the real Africa and you see home life, work, school, church and urban life. The music is also amazing. The movie is slow moving and you need some patience, but the running time is short. Do not shy away from this because it is a Disney movie, it is definitely for all ages. I shed a tear as Haile won his race, and that is rare for me.",
         "Unfortunately, this film is no longer on the big screen. For that matter, I don't ever remember it being in Toronto during it's initial run. Too bad. I had to watch this film on video, which I think detracted from the dramatic impact. It was very considerable, though, so I can only imagine what viewing the film in a theatre would be like. I kept thinking while watching \"Endurance\" how it compares with \"Chariots of Fire\" and \"Without Limits\", two dramatised running films of note. Quite honestly, it is the best of the three. I was in Ethiopia last spring (1999): seeing what I saw on the screen, as well as knowing first hand what the people of Ethiia have had to overcome to just stay alive, makes Mr. Sallassie's achievement more remarkable. In addition to chronicalling Mr. Sallassie's achievements at the Atlanta Games, \"Endurance\" also highlights the qualities of Ethiopia: it beauty, the gentleness of the people, and the deep history of the culture. Beautifully shot, and scored, this film elevates documentaries over the paucity of ideas and emotional depth of fictionalized films. Well worth seeing...take your children.",
         "Being an avid runner, I searched high and low to find a theater that was showing this film and rushed out to one on June 4th. I sat there with the very small audience and watched for 1 hour 22 minutes. By the time I left the theater, I was really aware of how little perseverance most of us have. When life hands you a bad hand, what do you do? I know what Haile did, he took his bad hand and made it work for him. Although I didn't really like the style used to tell the story (show me, don't tell me), it speaks volumes about the value of perseverance. Don't go expecting another Without Limits, just go. Go with an open mind and Endurance will definitely speak to you too.",
         "This movie made my list of top sports films -- along with Lagaan and Chariots of Fire. The story is simple and tells about the development of this particular writer. It starts with him as a little boy who develops a talent for running because he has to run to school every day. In addition, he has his daily chores. He grows up and wants to be a runner but his father disapproves. Those who like movies about other cultures will find it gentle and refreshing. Most adults should like it. And although the film is about running, it's also about spirituality, family, and running a spiritual race. Although the film has a documentary feel, and definitely marches to its own drum, most kids will identify with Haile as a child and will be as overjoyed at the Olympics scene as the runners family were. When I used to teach I used to bring in films for my students -- if they were good-- to show them what the rest of the world was like. As I watched this film, it occurred to me that both school teachers and religious teachers could use this film in their classes. The Ethiopian music on the soundtrack is wonderful.",
         "Having spent time in Ethiopia, this movie brings back so many memories. You truly can get a feel for the country in watching it. I can almost smell the smoke and the spicy plants. So many things are perfect, but I guess that is to be expected since it was filmed in Ethiopia. A friend asked why Haile was making a hiccuping sound when he was talking to the coach for the first time. That means he was listening intently and eagerly. The food his mother was cooking in the beginning is \"injeria\" which a kind of sourdough pancake/bread made from the grassy grain \"tef\". Makes me want to get on planning my next trip to Addis! A must see for anyone preparing for a trip there and also for those who love track and field sports.",
         "\"Endurance\" Making it a point to see every film that is released, It's always a drag when I dread seeing some of the new stuff. \"Endurance\" was not high on my list due to its' Terrence Malick connections and Disney origins, two things that make me sick to my stomach. After praying it would disappear after a week into the run, the film stayed longer, forcing me to reconsider whether or not to skip it. Let me now just remind myself and others the power of seeing everything that comes my way. \"Endurance\" tells the simple story of Haile Gebrsellasie, a meek Ethiopian farmboy who dreamed of a career in long distance running. The movie barely uses any dialog to tell it's story, instead relying on images and music for dramatic weight. Beginning, with real footage, at the 1996 Olympics where Haile competes for the gold medal, the film takes us back to show the runner's home life. This part of the film is recreated. We watch as Haile learns what it takes to overcome struggle in his life. He runs 6 miles to school everyday, takes a 3 hour trip to fetch water each afternoon, and he is the middle child of 10. We also see Haile's father try to sway him into other vocations and gently disapproves his son's dream to run. Comparing this to Malick's recent \"Thin Red Line\" is appropriate due to both film's insistence to tell the story through nature and the \"you are there\" camerawork. \"Endurance\" director Leslie Woodhead wins out simply because she knows when to stop. That's a gift Malick will never own. At 83 minutes, \"Endurance\" is winning is almost every way possible. Breathtakingly shot by cinematographer Ivan Strasburg , impossibly scored by personal fave Hans Zimmer, and as I said before, just the right pace and timing. It's thrilling to watch Haile grow up and become the success he is today (Running Magazine calls him \"The best long distance runner ever.\") Even though we know how the Olympic race comes out, I couldn't help but be overwhelmed with emotion at the result. This is a very delicate and beautiful picture, one of the few that believes in restraint and mood. Perfect for kids and bold enough for adults, just about as tidy as a film can be. I recommend this film highly. --------------- 10",
         "Most of you have never been to Africa, and for that reason alone, you should see this film. It will show you that the real Africa does not look a bit like the one in \"Abbott and Costello Lost in the Jungle\". In a way, it shows the real Africa the way Qiu Ju shows the real China. Having said that, I caution you not to choose this if you want vanilla movie fare. Save this for one of those times you are prepared to watch a film that unfolds in front you a life of very real and ordinary people a world away from you."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "Helkon Media AG",
         "La Junta"
      ],
      "summaries": ["The gold medal for the men's 10,000-metre race in the 1996 Atlanta Olympics is won by Ethiopian Haile Gebrselassie."],
      "budget": 0
   },
   "movielensId": 2627,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-05-14",
      "dvdReleaseDate": null,
      "directors": [
         "Leslie Woodhead",
         "Bud Greenspan"
      ],
      "runtime": 83,
      "movieId": 2627,
      "title": "Endurance",
      "mpaa": "",
      "actors": [
         "Haile Gebrsellasie",
         "Shawananness Gebrselassie",
         "Yonas Zergaw",
         "Tedesse Haile",
         "Bekele Gebrselassie",
         "Alem Tellahun",
         "Assefa Gebrselassie",
         "Tizazu Mashresha",
         "Winishet Tesfaye",
         "Abinet Tedesse"
      ],
      "imdbMovieId": "0120659",
      "originalTitle": "Endurance",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The gold medal for the men's 10,000-meter race in the 1996 Atlanta Olympics is won by Ethiopian Haile Gebrselassie.",
      "tmdbMovieId": 122190,
      "avgRating": 3.52155,
      "releaseYear": "1999",
      "numRatings": 116,
      "posterPath": "/aFOOg7ymKbdwfgtbWOvSbrKp5WL.jpg"
   }
}