{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love letter",
            "id": 3452
         },
         {
            "name": "misunderstanding",
            "id": 12541
         }
      ],
      "imdb_id": "tt0166252",
      "video": false,
      "title": "The Love Letter",
      "recommendations": [
         43079,
         44857,
         42176,
         48689,
         10034,
         25697,
         170400,
         51268,
         15346,
         50812,
         64523,
         61144,
         142385,
         79310,
         81994,
         303993,
         116008,
         342708,
         27977,
         58918
      ],
      "backdrop_path": "/vJe2dbLNt02dQ1YMZ8gbGqLdG3V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Helen",
               "gender": 1,
               "credit_id": "52fe44759251416c910117bf",
               "name": "Kate Capshaw",
               "profile_path": "/fR9ZNjuM67noFAXtZP4Ov5FzRPV.jpg",
               "id": 689,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lillian MacFarquhar",
               "gender": 1,
               "credit_id": "52fe44759251416c910117c3",
               "name": "Blythe Danner",
               "profile_path": "/vGv4EMRcy7xrRt8OvDzSuXohXjv.jpg",
               "id": 10401,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Janet Hall",
               "gender": 1,
               "credit_id": "52fe44759251416c910117c7",
               "name": "Ellen DeGeneres",
               "profile_path": "/wBB6C4IGsYlHzIEMW6Q3JIvNAfz.jpg",
               "id": 14,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jennifer",
               "gender": 1,
               "credit_id": "52fe44759251416c910117cb",
               "name": "Julianne Nicholson",
               "profile_path": "/iXjSXsYpb8GAehnLPKX74eXZE6H.jpg",
               "id": 86034,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Johnny",
               "gender": 2,
               "credit_id": "52fe44759251416c910117cf",
               "name": "Tom Everett Scott",
               "profile_path": "/5f85Hirx8TYIvb9irRtBSrqsq11.jpg",
               "id": 16857,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "George Matthias",
               "gender": 2,
               "credit_id": "52fe44759251416c910117d3",
               "name": "Tom Selleck",
               "profile_path": "/jCnmP0qYpCwWdVlZM4j9VNugmTj.jpg",
               "id": 15112,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Eleanor",
               "gender": 1,
               "credit_id": "52fe44759251416c910117d7",
               "name": "Gloria Stuart",
               "profile_path": "/fH9tJL2cgSqiKUOle5UWjCqx5FJ.jpg",
               "id": 8535,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Officer Dan",
               "gender": 2,
               "credit_id": "52fe44769251416c910117db",
               "name": "Bill Buell",
               "profile_path": "/yN1Z8yHnaODrTO0fqHF7lc7EFsh.jpg",
               "id": 76764,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Postal Clerk",
               "gender": 1,
               "credit_id": "52fe44769251416c910117df",
               "name": "Alice Drummond",
               "profile_path": "/f1O8suDhVloKdPvhyltj017SPTo.jpg",
               "id": 17488,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe44769251416c910117e3",
               "name": "Erik Jensen",
               "profile_path": "/ftksv6rvl3k8C32kQztkZUOx2Ls.jpg",
               "id": 71824,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Kelly",
               "gender": 1,
               "credit_id": "52fe44769251416c910117e7",
               "name": "Jessica Capshaw",
               "profile_path": "/pDTBPqckmOVgP7DseLG0cKNrmtU.jpg",
               "id": 2205,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44769251416c910117ed",
               "name": "Peter Chan",
               "profile_path": "/zg3cqkxlB4Ybm1yFbRD5N0CU9fM.jpg",
               "id": 56739,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe44769251416c910117f3",
               "name": "Maria Maggenti",
               "profile_path": "/3xTFdlQ4a7iblxtl8fAls0elnCM.jpg",
               "id": 86035,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44769251416c910117f9",
               "name": "Cathleen Schine",
               "profile_path": null,
               "id": 961023,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.037832,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31342,
      "vote_count": 22,
      "budget": 0,
      "overview": "A romantic comedy about a mysterious love letter that turns a sleepy New England town upside down.",
      "similar": [
         859,
         2039,
         796,
         11584,
         15037,
         688,
         2022,
         2110,
         10207,
         16520,
         6639,
         9582,
         22649,
         1829,
         42190,
         24742,
         51072,
         283827,
         34086,
         234284
      ],
      "original_title": "The Love Letter",
      "runtime": 88,
      "poster_path": "/fzu0xVGfi0yGEtAgVv8WoTLdToh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Sanford/Pillsbury Productions",
            "id": 40769,
            "origin_country": ""
         },
         {
            "logo_path": "/jCwNupLautLSk6iB28VXrDPUqD8.png",
            "name": "DreamWorks",
            "id": 7,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-05-21",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "No one knows who sent it. No one knows who it's for. But everyone's getting the same message.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Chan"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Cathleen Schine",
         "Maria Maggenti"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0166252/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMyOTcyNjk0Ml5BMl5BanBnXkFtZTcwNDc3NTkxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kate Capshaw, Tom Everett Scott, Tom Selleck | See full cast and crew »"],
      "reviews": [
         "Wow! I'm surprised to see so many negative and lukewarm opinions on this movie, which I had never heard of (apparently it was not highly promoted by the studio) but which I luckily stumbled upon on an international flight. I so thoroughly enjoyed it that now I'm interested in more by director Peter Chan and screenwriter Maria Maggenti. I did not know there was a book, either, but I've made a note of it for future reading, too. I admit I feel a bit defensive now, in the face of the other comments here on IMDB. So, what did I like and why did I like it? First of all, unlike some other viewers, I thought the movie WAS very funny. It takes sort of a Steve-Martinesque view of the tender absurdity of humans and their feelings about each other (OK, OK, I just saw a stage production of Picasso at the Lapin Agile, and the tone reminded me somewhat of this). Although there is physical humor, too, what I liked most were light touches, like how Ellen DeGeneres' character instantly, wordlessly went back to working for her boss (played by Kate Capshaw) as soon as she got the apology she felt she deserved -- after insisting with great finality that it was all over. I also felt this film was a celebration of the beautiful but almost lunatic breadth and diversity of the kinds of feelings we group together under the heading of \"love\": everything from young (and older) wide-eyed lust, to slow steady enduring commitment. As well as friendships, coworker relationships like the one just mentioned, family bonds . . . the list goes on. Most of all, I guess I appreciated the fond, loving tone of the movie. The artists seem really to like, and love, people. Yes, there ARE quite a few characters, and they're all different ages and different sexes, they're about different trials and tribulations, but they're all treated with light-hearted love and respect, for the sometimes silly but vulnerable beings we all are. So, if YOU like people, I think you'd like this movie.",
         "This film was panned by critics, all of whom were male. This is a wonderful little film with fun, funny and realistic characters, and an interesting, romantic story that will touch the inner romantic in all of us. It's not laugh-out-loud funny, but it is pleasant to watch these characters interact and is very fun to watch. And for the guys, Kate Capshaw isn't bad to look at, either.",
         "'The Love Letter' is quite a gentle breezy sort of romantic comedy- drama. It's about opportunities that are missed because people aren't more forward about their feelings. The humour isn't wacky like in most American films. Assuming the director's seat, Chan does quite a good job of portraying the small dockside town and introducing its quirky characters. The story interestingly intertwines the lives of the characters through a love letter. The dialogues are pleasant and the acting is quite good. Kate Capshaw does a good job of carrying the film and maintains a good chemistry with her co-stars. Tom Everett Scott fits the part.It was odd to see Danner play Capshaw's mother because the age difference did not seem believable enough. Tom Selleck was alright. Ellen Degeneres and Geraldine McEwan are scene stealers. In addition, I was amazed by the whimsical soundtrack that flows beautifully with the film, pumping some energy into it and would work well as a standalone score. IU felt the film would have benefited more had their been more comedic situations. At times it gets too serious and that needed to be toned down a little. I liked how it ended without showing the two lovers kissing (as has been evident in x number of rom-coms) but instead suggesting a promising future for them together. 'The Love Letter' was a pleasant watch, a kind of slice of life film.",
         "An exceptionally well-done film. Not Hollywood-ish, thus some mixed reviews. But I've viewed this 4 or 5 times, and love it. The editing and pacing are unusually synced to produce the feel of a special film. the music is a big plus. This is a gem to recommend to people who love good film, not those who want yet another blockbuster. Allow yourself the time and focus to move to the same pace, and you'll be rewarded. And the fact that the locus is a bookshop, the home of books which are similarly low-tech and rewarding is a fine match",
         "This is not typical Hollywood cookie cutter love story. The tone and style reek of French cinema (although it doesn't seem to be a remake). There are some lovely performances, and exquisite scenes. I found myself smiling a lot throughout this movie, and will look out for more of the directors work. Plus anything that gives Geraldine McEwan work is to be supported.",
         "This film shows up on the premium cable channels quite often and, I find that I keep watching it over and over again. The performances are wonderful, and the material has so much happening that there is always something new to take away from the film. Maybe I am too often distracted when watching films at home, you know the drill, the dogs bark, the phone rings, the popcorn finishes during the credits. But this film is about people and what motivates us, what enlivens us, what causes rifts between us, and what inspires us. For me, it is films like The Love Letter that keep me taking a chance on new films. Frankly, I am surprised that the film is not better known. I would love to see Blythe Danner and Geraldine McEwan in many more roles. They are a delight to watch. Kate Capshaw is wonderful and I had no previous idea that she would be. Ellen DeGeneres plays a role that is much more complex than simply being the comic relief. This film provides interesting visuals as a proper background to the characters and their interactions. I find it refreshing every time I take the time to watch it.",
         "Kate Capshaw stars in this charming story of a divorced book store owner who finds a love letter between the cushions of her couch. Who is it from? Therein lies the tale. Working for her in the book store are a handsome college student (Tom Everett Scott), a feisty store manager (Ellen DeGeneres), and a sweet young teenager (Juliane Nicholson). Waiting in the wings is Tom Selleck, the town fireman, who has held a torch for Capshaw all his life. These are all pleasant folks to spend a couple of hours with. The town is picturesque and the background score is romantic (by Luis Bacalov, composer of Il Postino). It's interesting to note that everyone does not end up with whom you expect. Supporting roles are ably, though too briefly, handled by Blythe Danner and Gloria Stewart (Titanic). Director, Peter Chan, who has been involved in the Hong Kong film world, has done surprisingly well with this material which is so American. I'm sure we'll be hearing from him again.",
         "We avoided watching this movie when it was released commercially, even though we had read Cathleen Schine's novel in which this movie is based on. Director Peter Chan's take on the story looks good on the screen; what with the picturesque setting of Rockford, Ma., as the background and all the cute houses where the story takes place. The result is a film that is easy on the eye, but alas, like eating a Chinese dinner, it leaves us hungry for more. Helen, the owner of a book store, finds a letter between the cushions of the couch of the shop. She reads it, and it sounds intriguing, because the writer goes to express how deeply he feels for the person the letter has been sent to. Since it has no name, Helen assumes it has been intended for her alone. She believes Johnny, the young assistant, has sent it to her. The young man, who likes the older Helen, is only too happy to tell her how he feels about her. Basically, \"The Love Letter\" is a story about missed opportunities. Helen who was in love with George, the local chief firefighter, married someone else, but her marriage failed. George also is getting a divorce. George confesses he had gone away to New York when he was younger to get away from Helen and his life in town and he had also sent her a postcard from New York, which Helen had kept, but had not read the message inserted within the card. It's at this moment when Helen comes to her senses when she realizes her affair with Johnny is only a summer fling. The film will be liked by the audience for which it was targeted. Kate Capshaw, who produced the movie, is fine as Helen. Tom Everett Scott plays Johnny. Blythe Danner, Geraldine McEwen, Julianne Nicholson, Tom Selleck, Ellen DeGeneres, and the rest of the cast do good work also. The film has an ironic twist at the end when the real recipient of this letter is revealed.",
         "Aside from the fact that this movie was filmed mostly in Rockport MA, which is a beautiful town where my mother once rented a small storefront and I spent many a pleasant summer as a child, it is fun and cute little film. I must admit that I had no desire to actually see this movie even though I have a weakspot for romantic comedies (I don't know why). The trailers I saw were not appealing, the cast did not look that interesting and I had no idea what the plot would be about. In the end I found it to be an interesting meditation on relationships and family. I thoroughly enjoyed myself and must admit that I thought that this film was one of the most overlooked gems of last year. I am disappointed that so few people seemed to have enjoyed the very \"human-ness\" that this movie presented the viewer with. I have read many bad reviews of this film, and must admit a certain level of shock at the cynicism that is prevalent in them. As a grad student I consider myself to be quite cynical, but this was a beautiful little film that deserves much better than it got.",
         "One of the greatest and most wonderful surprises of 1999, \"The Love Letter\" is a sparkling little film. Held back by a remarkably asinine trailer--which manages to combine the three or four dull, brief moments in the movie--the picture is a warm-hearted, eminently watchable tale. I had assiduously avoided the flick because of that very trailer, but ended up having to watch \"The Love Letter\" on an 11 hour flight from Seoul to Vancouver. I could easily have watched it three times--it's that much fun. Kate Capshaw is bent and broken-down but somehow manages to be both incredibly lovable and believable. Tom Everett Scott is absolutely priceless in his role as a confused young hunk. but any damage they may have done to the overall film is negated by the superb performances of Scott and Capshaw. Sure, it's not worthy of an Oscar. But neither was \"Shakespeare in Love\", and look what happened there."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "DreamWorks SKG",
         "Sanford/Pillsbury Productions"
      ],
      "summaries": ["The power of words and images to open hearts. Helen runs, miles a day, to burn off energy: she's an emotional celibate. Going through the post at her shop, she finds a romantic and poetic letter between the couch cushions, unsigned, and thinks it's for her. It melts her resistance to feelings, and soon she undertakes an affair with Johnny, a collegiate employee. (He sees the letter and thinks she wrote it to him; he quotes some of it, so she thinks he wrote it to her.) In the background are Helen's long-time friend, George, who loves her, and her mother who abruptly left on a long trip months' before. Discovering who actually wrote the letter brings insight and promise."],
      "budget": 15000000
   },
   "movielensId": 2629,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-05-21",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["Peter Chan"],
      "runtime": 88,
      "movieId": 2629,
      "title": "The Love Letter",
      "mpaa": "PG-13",
      "actors": [
         "Kate Capshaw",
         "Blythe Danner",
         "Ellen DeGeneres",
         "Julianne Nicholson",
         "Tom Everett Scott",
         "Tom Selleck",
         "Gloria Stuart",
         "Bill Buell",
         "Alice Drummond",
         "Erik Jensen",
         "Jessica Capshaw"
      ],
      "imdbMovieId": "0166252",
      "originalTitle": "The Love Letter",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["k29TkzQclH8"],
      "plotSummary": "A romantic comedy about a mysterious love letter that turns a sleepy New England town upside down.",
      "tmdbMovieId": 31342,
      "avgRating": 2.72021,
      "releaseYear": "1999",
      "numRatings": 940,
      "posterPath": "/fzu0xVGfi0yGEtAgVv8WoTLdToh.jpg"
   }
}