{
   "tmdb": {
      "original_language": "pl",
      "keywords": [
         {
            "name": "spain",
            "id": 514
         },
         {
            "name": "book",
            "id": 3096
         },
         {
            "name": "vorfahren",
            "id": 8093
         }
      ],
      "imdb_id": "tt0059643",
      "video": false,
      "title": "The Saragossa Manuscript",
      "recommendations": [
         28249,
         69559,
         112698,
         144425,
         43001,
         65722,
         169512,
         200905,
         144994,
         127759,
         189727,
         256650,
         148050,
         97035,
         8353,
         689,
         45698,
         32691,
         137037,
         83096
      ],
      "backdrop_path": "/7eS9a3oIYqXq5Uq4KXWd3htvlSY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Alfonse Van Worden",
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a697f",
               "name": "Zbigniew Cybulski",
               "profile_path": "/qkv3TbNEMUIYxPgqEGZ3lh6H5LJ.jpg",
               "id": 40914,
               "order": 0
            },
            {
               "cast_id": 14,
               "character": "Princess Emina",
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a6983",
               "name": "Iga Cembrzyńska",
               "profile_path": null,
               "id": 55979,
               "order": 1
            },
            {
               "cast_id": 15,
               "character": "Donna Frasquetta Salero",
               "gender": 1,
               "credit_id": "52fe44b9c3a36847f80a6987",
               "name": "Elżbieta Czyżewska",
               "profile_path": "/gM7zetX89BSHjm3grIklF2r9H5x.jpg",
               "id": 55980,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Don Pedro Velasquez",
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a698b",
               "name": "Gustaw Holoubek",
               "profile_path": "/5QPPJeWamb1qq0PMcwbxlqTUrkZ.jpg",
               "id": 55981,
               "order": 3
            },
            {
               "cast_id": 2,
               "character": "Count Pena Flor",
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a694d",
               "name": "Jan Machulski",
               "profile_path": "/rC6GpfyejIit2R5IxfASa45DB8B.jpg",
               "id": 55971,
               "order": 4
            },
            {
               "cast_id": 3,
               "character": "Don Pedro Uzeda",
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a6951",
               "name": "Adam Pawlikowski",
               "profile_path": null,
               "id": 40916,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Donna Rebecca Uzeda",
               "gender": 1,
               "credit_id": "52fe44b9c3a36847f80a6955",
               "name": "Beata Tyszkiewicz",
               "profile_path": "/37wfQXmfMj83mYUkqG7NByDjh7v.jpg",
               "id": 55972,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Condemned",
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a6959",
               "name": "Witold Pyrkosz",
               "profile_path": "/eUzBNATuLJEgKYE3g8L5TuFHNAk.jpg",
               "id": 54074,
               "order": 7
            },
            {
               "cast_id": 6,
               "character": "Hermit / Sheik",
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a695d",
               "name": "Kazimierz Opaliński",
               "profile_path": "/2IhcreENFSleYIw2HQ10qzYQa8j.jpg",
               "id": 7115,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Wedding guest",
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a698f",
               "name": "Wieslaw Golas",
               "profile_path": "/45OAgZXD5HZskSI0lQcZF1FyM9u.jpg",
               "id": 568272,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a6949",
               "name": "Wojciech Has",
               "profile_path": null,
               "id": 27002,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a6963",
               "name": "Tadeusz Kwiatkowski",
               "profile_path": null,
               "id": 55974,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a6969",
               "name": "Krzysztof Penderecki",
               "profile_path": null,
               "id": 55975,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b9c3a36847f80a696f",
               "name": "Mieczyslaw Jahoda",
               "profile_path": null,
               "id": 55976,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a6975",
               "name": "Krystyna Komosinska",
               "profile_path": null,
               "id": 55977,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b9c3a36847f80a697b",
               "name": "Jan Potocki",
               "profile_path": null,
               "id": 55978,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "571b8f51c3a36865240010e5",
               "name": "Tadeusz Myszorek",
               "profile_path": null,
               "id": 1609609,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "571b8f63c3a3682434001677",
               "name": "Jerzy Skarzynski",
               "profile_path": null,
               "id": 1609610,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "571b8f7ac3a368525f005c24",
               "name": "Leonard Mokicz",
               "profile_path": null,
               "id": 1537592,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "571b8f8bc3a3682434001680",
               "name": "Jerzy Skrzepinski",
               "profile_path": null,
               "id": 41402,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "571b8f9bc3a36823cb001642",
               "name": "Lidia Skarzynska",
               "profile_path": null,
               "id": 1609611,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "571b8faec3a368195b0030c0",
               "name": "Zbigniew Hartwig",
               "profile_path": null,
               "id": 1609612,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "571b8fc192514135ff00150a",
               "name": "Bohdan Bienkowski",
               "profile_path": null,
               "id": 1602831,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "571b8fd292514121a0003420",
               "name": "Zofia Chec",
               "profile_path": null,
               "id": 1609613,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "571b8fe39251414e97004d21",
               "name": "Zbigniew Dobracki",
               "profile_path": null,
               "id": 1544874,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 2.649041,
      "production_countries": [{
         "iso_3166_1": "PL",
         "name": "Poland"
      }],
      "id": 8785,
      "vote_count": 31,
      "budget": 0,
      "overview": "In the Napoleonic wars, an officer finds an old book that relates his grandfather's story, Alfons van Worden, captain in the Walloon guard. A man of honor and courage, he seeks the shortest route through the Sierra Morena. At an inn, the Venta Quemada, he sups with two Islamic princesses. They call him their cousin and seduce him; he wakes beside corpses under a gallows. He meets a hermit priest and a goatherd; each tells his story; he wakes again by the gallows. He's rescued from the Inquisition, meets a cabalist and hears more stories within stories, usually of love. He returns to Venta Quemada, the women await with astonishing news.",
      "similar": [
         34584,
         5951,
         2897,
         84306,
         34636,
         1417,
         27022,
         7461,
         203833,
         10020,
         121856,
         20504,
         207932,
         267192,
         622,
         955,
         4347,
         242224,
         364689,
         64
      ],
      "original_title": "Rekopis znaleziony w Saragossie",
      "runtime": 182,
      "poster_path": "/j3w1Jq3JdxsmmplUejAT1wpivnR.jpg",
      "spoken_languages": [{
         "name": "Polski",
         "iso_639_1": "pl"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Kamera Film Unit",
         "id": 2503,
         "origin_country": ""
      }],
      "release_date": "1965-02-09",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.thesaragossamanuscript.info/",
      "status": "Released"
   },
   "imdb": {
      "country": "Poland",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Wojciech Has"],
      "runtime": 182,
      "synopsis": null,
      "writers": [
         "Tadeusz Kwiatkowski",
         "Jan Potocki"
      ],
      "originalLanguage": "Polish",
      "imdbLink": "http://www.imdb.com/title/tt0059643/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTEyMjU1MDA0MzBeQTJeQWpwZ15BbWU3MDI5NDQwNTQ@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Zbigniew Cybulski, Iga Cembrzynska, Elzbieta Czyzewska | See full cast and crew »"],
      "reviews": [
         "\"The Saragossa Manuscript\" is a brilliant work, by turns (or simultaneously) mysteriously spooky and wildly funny. Its unusually long running time does not get tiring because it is so full of variety and unfailing inventiveness. The stories of a crowd of distinctive characters intermesh into a unity that is not obvious at first, but slowly grows clearer -- one of the ideas that can be gathered from the movie is precisely that of the interdependence of people who would seem to have little in common, whether Christian, Jew or Moslem. It's a profoundly humanistic idea. This theme is the contribution of the novelist Jan Potocki, a Pole living in France when he wrote \"The Manuscript Found in Saragossa\" at the beginning of the 19th century. One of the main strengths of the movie is also mainly Potocki's, the creation of a Spain of dreams, full of romance, mystery, lively humor, and eroticism (the novel found difficulty in being published originally, and the author was criticised for his libertinism). As vividly brought to the screen by Wojcech Has, this Spain is a place that a viewer will want to return to repeatedly. Has, however, strongly emphasized the phantasmagorical elements in the novel. The atmosphere that he creates, and the visual style that supports it, are another major asset of the movie. The images of the haunted Sierra Morena are consistently touched with strangeness but not overburdened. I think especially of one shot where the tumbled white rocks look just like bleached bones -- an effect that wouldn't have worked so well if the movie had been in color. In keeping with this shift of emphasis, the adaptation contributes a new ending to the story, which is entirely appropriate; it comes from a distinctly twentieth-century sensibility. Add to this a uniformly skillful cast (special recognition goes to Slawomir Lindner as the elder Van Worden) and you have a movie that I can't recommend strongly enough.",
         "Although I usually try to avoid very long movies, I was glad I took the time to watch this one. Based on Jan Potocki's marvelous, somewhat `enlightened Gothic novel', this is another congenial literary adaptation of Director Wojciech Has; it's a shame this is the only one of his movies easily available. The film tells of a young soldier traveling through Spain and meeting a lot of strange characters that all have their own stories to relate. Of course, the series of interlocked stories-within-stories may appear complicated, but there is always the opportunity to just lean back and enjoy the story being told right now; or to look at the diagram in the great DVD Edition to make things clear. And surely there doesn't seem to be a central thread if you don't watch the end of the movie. (How useful would a review of, say `The usual Suspects' be, if you didn't watch the ending?) And, by the way, there are a lot more stories and framing devices in the novel\u0085 It's no wonder that (Danger! Pretentious name-dropping ahead) this is one of Luis Bunuel's favorite movies, the structure of some of his later films, especially `The Milky Way' and `The Discreet Charm of the Bourgeoisie' bear a lot of resemblance. And there's a scene in `Monty Python's Life of Brian', in which the Pasheko \u0096 Character reappears. (It's too close to be a coincidence.) To cut a long story short: If you prefer films with a straight forward narration; this one's obviously not for you. But if you're open minded and like to see a highly original, imaginative epic, try it.",
         "Before I start gushing about this film, keep in mind that I rarely see European (let alone Polish) films, and I rarely see \"vintage\" films. The few \"art houses\" in Denver typically show films, like Crouching Tiger, which are intended for US audiences and distributed to regular first-run theaters in most major cities. Since I don't study the listings religiously, nor do I always have 10 bucks to blow on a film, I rarely encounter films that challenge the norms of either mainstream Hollywood or the recent Hollywood-controlled \"indie\" film industry. Needless to say, this film floored me. I was immediately amazed by the vividness of its black-and-white imagery. While b/w has become an overused technique to depict bleakness, this film reminded me just how little all the high-tech Hollywood production methods actually use the medium of film itself to its fully expressive potential. This film is visually stunning in its images' depth, textures, and light. The next thing that struck me was how outrageously funny the film is--funnier than I could have imagined a 40 year-old movie from a culture about which I know almost knowing. Three hours later, I didn't want the film to end. Its cycles of absurd story lines, surreal dialog, and engaging imagery were utterly new and engrossing to me. Despite my Luddite tendencies, I have vowed that when this film is released on DVD, I'll go out and get a player just to see this film over and over again. Perhaps then I'll have more critical comments--for now, just WOW.",
         "\"The Saragossa Manuscript\" is a very entertaining film that two or three viewings will eventually allow you to understand fully. Its style mixes an easy congeniality and libertine spirit à la \"Tom Jones\" (1963) with elements of sophisticated comedy and slapstick commedia dell'arte, all delivered by an expert cast and imbued with a tangible sense of fun and mystery. Its story centers around the efforts by a brave officer in mid-XVIIIth Century Spain to distance himself from ghosts or evil spirits that visit him every night and take the form of two charming Muslim sisters who want to be his lovers and bear his children, even in succubi form, and insist that he convert to Islam. Those erotic (and heretic) reveries also have something to do with devilry and all things forbidden and his encounters with those women are encouraged by the mysterious figure of the Cabalist (another forbidden science) and his sister Rebecca and severely repressed by roaming members of the Catholic Inquisition. This framing story is the pretext for a series of very involving and amusing moral tales told in flashback by several participants, who all echo each other and whose moral seems to be that all religious and social prohibitions and ghost stories should be taken with a grain of salt. In this ocean of mystery and gothicism stands the figure of Don Pedro Velasquez, a mathematician who befriends the hero and who seems the only character to believe in the cold light of reason (foreshadowings of Polanski's \"The Fearless Vampire Killers\"). After several viewings, the only point in the film which remains mysterious is why Frasqueta's lover (Pena Flor) should appear with a bloodied face when he climbs in her bedroom through a window, a fact the viewer has to provide his own backstory for and which could be evidence that the original film was even longer than the 182 minutes at which it clocks in on the restored DVD edition. (Personal theory: Pena Flor really was Frasqueta's lover and the band of thugs Frasqueta hired to deceive her husband into believing he had paid to have his wife's lover killed really did attempt to kill him before he paid them to kill her husband instead.) Well, that and the fact that Jerry Garcia of the Grateful Dead, an early fan of the film and one the persons responsible for its restoration, was fond of quoting a scene from the film that doesn't seem to exist anymore (a character's confrontation with Death at the foot of his bed, which, according to DVD Savant, could come from the 1960 Mexican film \"Macario\")... A WORD ABOUT THE DVD: This film was restored thanks to the efforts and money of Martin Scorsese, Francis Ford Coppola and the above-mentioned Jerry Garcia, and the collaboration of the director. It was shot in Dyaliscope, the French CinemaScope equivalent, which is always projected at a standard 2.35:1 ratio. This \"enhanced for widescreen TVs\" DVD shows an image with a ratio of 2:1, which means that the picture information is still squeezed by a ratio of 15 % in relation to the way it should be shown normally. In this presentation, the picture is \"fish-eyed\" and the characters and animals appear too slim. There is no way around this problem if you watch it on a 4:3 television set. However, if you own a widescreen TV, you can set-up your DVD player as for a standard 4:3 TV monitor and gently unsqueeze the resulting picture with any one of the \"cheater\" modes provided by your TV model to approximate a 2:35 presentation. There is no way of knowing if this drawback is the result of simple ignorance (mistaking the 2:1 squeeze of Dyaliscope with a 2:1 projection ratio) or of a compromise allowing to use the greater part of the TV screen in both 4:3 and 1.77:1 TV sets. It took me along time to figure out this problem and I am glad to share this little trick with you.",
         "I saw this one on TV many years ago and I was captivated! In the second change I had, I recored it on video and when my cassete was destroyed, I made a hopeless search in the internet, only to find that soon I could buy it on DVD. And I did. I just can't get away from this masterpiece of cinematography. Based on a book, clearly inspired from the 1001 nights, telling a story inside a story, inside a story (I love this), with a lot of Jorge Louis Borges magic I guess, celebrates the true joy of cinema, where nothing is more important that watch the film itself! The story is incredible, but just, doesn't matter! All I want with this one, is to see it again and again, not trying to understand the dark parts of it, or the connections between the stories, or to find my way out of the labyrinth that is build around you as you continue more inside its plot, but just to loose myself in it, be a part of it, and not wish to get out. Not for everyone, but probably a great choice if you don't like Chuck Norris too much!",
         "The comments on this film seem evenly distributed between favor and disfavor. At this date, I can't understand why anyone would not like it, but that's me. I first saw it in 1967, while I was in college. I loved it, and went so far as to locate and purchase the book(s) from which it was adapted. And that was before the internet, and Amazon, and Bookfinder. One of the books I didn't manage to get until I got to London. Reading it, I was amazed to realize that the film actually includes remnants of every story in the book(s): when, for example, Alphonso opens a door to find a bewigged scholar interrupted while declaiming \"...Then the first skeleton tore out his own arm-bone and began hitting me with it...\"-the whole story is there in the book, i.e., what the skeletons were doing there in the first place. The books, Manuscript Found At Saragossa and the New Decameron, are rightly considered Literary Treasures of Poland, along the lines of Notre-Dame á Paris in France, War and Peace in Russia, or Moby-Dick here. It's about stories and storytelling. By the end of the film, to say the least, the viewer has been presented with a convincing picture of sixteenth-century Europe from different angles, and it's safe to say that no other film, before or since, in color or Black-and-white, has done it better.",
         "Spoilers herein. By now, you already know that this is a collection of stories and what makes it novel is the relationship among those stories. Many stories have stories within them. Many stories are mirrored. Characters and sets in one story appear in another, sometimes in different roles. Most stories are about storytelling or truth in some form. Symmetries abound. Snakes and skulls are constant, as is the gallows. Another constant thread is the nature of of the character, whether he is `real' or a character from some further nesting. (This is a common theme in other films as well.) The metaphor of `birth' is used. Everything relates to the manuscript, which here is primarily composed of images, and which is written in at several levels. Superficially, it appears to be a cleverly constructed ramble, and its arbitrariness is part of the charm. That's why dopes like Jerry Garcia like it. But the story is far better than that. The writer of the book (which is both the book on which this is based and the book within the film) was a serious cabalist, student of the Jewish cabala as created in Spain and moved to Poland when the Jews were kicked out. There, at the end of the 18th century, it became christianized and simultaneously in France linked with Tarot. The core notion was that the world was a story told within a story with an story and so on for ten or eleven layers until you had nothing as the origin. A very specific geometric symbol related these storyworlds, primarily emphasizing various internal dualities. Scholars of this geometric cosmology recognize this as the first book to explore what was to become a common theme: a curious soul starting at the bottom of this `Tree of Life' and moving up in a specific way through the generators of each storyworld, ultimately reaching enlightenment. The stories presented in the book and rewritten here are not a random ramble, but highly structured based on this purportedly ancient geometric cosmology. This book and film has tremendous historical significance. It is a template used previously by Bulwer-Lytton (`Ernest Maltravers' and `Zanoni'), then Lewis Carroll and eventually James Joyce. It was copied by Fowles as `the Magus' and thence influenced the structure of the Beatles' `White Album.' In recent film history, it was restructured as a book and then a more successful film by the greatest Polish filmmaker, Roman Polanski, as `the Ninth Gate.' All of these follow the same precise structure. Cinematically, this is no masterpiece. It borrows its stance from `Seventh Seal' which has some of the same notions but without the strict structure. From that stance, a comic self-parody is adopted. The score is wonderful. Ted's Evaluation -- 4 of 4: Every visually literate person should experience this.",
         "i have a really low threshold for boredom, and while i saw this on the bigscreen, in a real theatre, i was spellbound. i didnt know what to expect, but it was mesmerising. i didnt try intellectualise it, but it was impossible to pick apart. just see it. put your head into the time period that the story is trying to convey. caveat: i think apocalypse now is an amazing film. redux was great. when i walked out of the theatre after seeing saragossa, i couldnt speak for hours. do yourself a favor and at least give this one a shot. try and see it on the big screen if you can.",
         "Oh boy. I first saw this about thirty years ago, and have caught it twice since. Other than a slight reservation concerning its length, I find it a delight, and would love to see it again. In form, it resembles the Gothic novel that was popular at the turn of the 19th century, with its nested plots and bizarre ambiances and characters. The novel on which it's based was recently published in an English translation, and proves to be a delight as well--literate, witty, and dizzying. The photography and design of this film are breathtaking, and I think it's definitely worth a viewing, if, as, and when it comes around. I advise strongly against looking for Inner Meaning. It's kind of like seeing an exhibition of Magritte paintings; sometimes a flaming tuba is just a flaming tuba.",
         "I last saw this film at the Electric Cinema Club in Portobello Rd London over 25 years ago, yet it had such an impact on me I can still remember it clearly and with great affection. It certainly is a film that can on each viewing reveal something new. Does anyone know if it would be available on video? After 25+ years of thinking about it I may be able to solve the mystery."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": ["Kamera Film Unit"],
      "summaries": [
         "In the Napoleonic wars, an officer finds an old book that relates his grandfather's story, Alfons van Worden, captain in the Walloon guard. A man of honor and courage, he seeks the shortest route through the Sierra Morena. At an inn, the Venta Quemada, he sups with two Islamic princesses. They call him their cousin and seduce him; he wakes beside corpses under a gallows. He meets a hermit priest and a goatherd; each tells his story; he wakes again by the gallows. He's rescued from the Inquisition, meets a cabalist and hears more stories within stories, usually of love. He returns to Venta Quemada, the women await with astonishing news.",
         "Upon finding a book that relates his grandfather's story, an officer ventures through Spain meeting a wide array of characters, most of whom have a story of their own to tell."
      ],
      "budget": 0
   },
   "movielensId": 2632,
   "movielens": {
      "languages": ["Polski"],
      "releaseDate": "1965-02-09",
      "dvdReleaseDate": "2002-03-26",
      "directors": ["Wojciech Has"],
      "runtime": 182,
      "movieId": 2632,
      "title": "The Saragossa Manuscript",
      "mpaa": "",
      "actors": [
         "Zbigniew Cybulski",
         "Iga Cembrzyńska",
         "Elżbieta Czyżewska",
         "Gustaw Holoubek",
         "Jan Machulski",
         "Adam Pawlikowski",
         "Beata Tyszkiewicz",
         "Witold Pyrkosz",
         "Kazimierz Opaliński",
         "Wieslaw Golas"
      ],
      "imdbMovieId": "0059643",
      "originalTitle": "Rekopis znaleziony w Saragossie",
      "genres": [
         "Comedy",
         "Drama",
         "Fantasy",
         "Mystery"
      ],
      "youtubeTrailerIds": ["esGa4jsJirs"],
      "plotSummary": "In the Napoleonic wars, an officer finds an old book that relates his grandfather's story, Alfons van Worden, captain in the Walloon guard. A man of honor and courage, he seeks the shortest route through the Sierra Morena. At an inn, the Venta Quemada, he sups with two Islamic princesses. They call him their cousin and seduce him; he wakes beside corpses under a gallows. He meets a hermit priest and a goatherd; each tells his story; he wakes again by the gallows. He's rescued from the Inquisition, meets a cabalist and hears more stories within stories, usually of love. He returns to Venta Quemada, the women await with astonishing news.",
      "tmdbMovieId": 8785,
      "avgRating": 3.66561,
      "releaseYear": "1965",
      "numRatings": 157,
      "posterPath": "/j3w1Jq3JdxsmmplUejAT1wpivnR.jpg"
   }
}