{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mummy",
            "id": 2904
         },
         {
            "name": "swamp",
            "id": 4551
         },
         {
            "name": "princess",
            "id": 7376
         },
         {
            "name": "remake",
            "id": 9714
         },
         {
            "name": "nursing home",
            "id": 155208
         },
         {
            "name": "hammer horror",
            "id": 155730
         },
         {
            "name": "tomb",
            "id": 156081
         },
         {
            "name": "ancient egypt",
            "id": 157894
         }
      ],
      "imdb_id": "tt0053085",
      "video": false,
      "title": "The Mummy",
      "recommendations": [
         3079,
         3104,
         3075,
         28752,
         29778,
         39891,
         17102,
         34479,
         24580,
         3077,
         23220,
         28667,
         3127,
         38006,
         29748,
         39044,
         30137,
         19201,
         28801,
         11791
      ],
      "backdrop_path": "/nxY6wthYExDuQobWRMXWBSNRYPL.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "John Banning",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2445",
               "name": "Peter Cushing",
               "profile_path": "/1qtKVu16REL2YLVrhayjVey4al.jpg",
               "id": 5,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kharis, the Mummy",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2449",
               "name": "Christopher Lee",
               "profile_path": "/aVzp6zflzedmdKPLxaPqcZ05PDK.jpg",
               "id": 113,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Isobel Banning / Princess Ananka",
               "gender": 1,
               "credit_id": "52fe47b19251416c750a244d",
               "name": "Yvonne Furneaux",
               "profile_path": "/azdNJ9qXwpKrdCohPXWu1xC4ts9.jpg",
               "id": 5962,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Inspector Mulrooney",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a245d",
               "name": "Eddie Byrne",
               "profile_path": "/mSwNawI6Ou8m99Y05WjctoTWYUK.jpg",
               "id": 69249,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Stephen Banning",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2461",
               "name": "Felix Aylmer",
               "profile_path": "/sfNcE9p956L9WjTGiNB6M6xjUdh.jpg",
               "id": 85345,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Joseph Whemple",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2465",
               "name": "Raymond Huntley",
               "profile_path": "/txL0IXHSd70qIAGsGytEjcSL9g2.jpg",
               "id": 87071,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mehemet Bey",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2469",
               "name": "George Pastell",
               "profile_path": "/q72ZOJdHT9305Dn99AoOOIwwDlq.jpg",
               "id": 9900,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Poacher",
               "gender": 2,
               "credit_id": "52fe47b19251416c750a246d",
               "name": "Michael Ripper",
               "profile_path": "/oEFxIrp1uYlkYsbwtnKZu9SJK22.jpg",
               "id": 24340,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2453",
               "name": "Terence Fisher",
               "profile_path": "/53YMKaZBJSEWvPAOAGJpWkttXee.jpg",
               "id": 29662,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2473",
               "name": "Michael Carreras",
               "profile_path": null,
               "id": 29664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b19251416c750a2479",
               "name": "Franz Reizenstein",
               "profile_path": null,
               "id": 1199563,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a247f",
               "name": "Jack Asher",
               "profile_path": null,
               "id": 29667,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2485",
               "name": "Alfred Cox",
               "profile_path": null,
               "id": 30702,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe47b19251416c750a2491",
               "name": "Bernard Robinson",
               "profile_path": null,
               "id": 30139,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe47b19251416c750a2497",
               "name": "Roy Ashton",
               "profile_path": null,
               "id": 29671,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 2,
               "credit_id": "55b13a83c3a3682ff4010b01",
               "name": "Jimmy Sangster",
               "profile_path": null,
               "id": 30700,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55b13a4bc3a368210a000aed",
               "name": "Anthony Nelson Keys",
               "profile_path": null,
               "id": 29665,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55b13a9b92514125da00e9bc",
               "name": "Henry Montsash",
               "profile_path": null,
               "id": 30182,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "55b13aacc3a368210a000af9",
               "name": "Don Weeks",
               "profile_path": null,
               "id": 1207591,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 5.075539,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 18990,
      "vote_count": 70,
      "budget": 0,
      "overview": "One by one the archaeologists who discover the 4,000-year-old tomb of Princess Ananka are brutally murdered. Kharis, high priest in Egypt 40 centuries ago, has been brought to life by the power of the ancient gods and his sole purpose is to destroy those responsible for the desecration of the sacred tomb. But Isobel, wife of one of the explorers, resembles the beautiful princess, forcing the speechless and tormented monster to defy commands and abduct Isobel to an unknown fate.",
      "similar": [
         1734,
         808,
         564,
         282035,
         10144,
         1735,
         10882,
         11224,
         10020,
         809,
         224141,
         9837,
         5393,
         38319,
         35552,
         39263,
         29243,
         168903,
         31498,
         13945
      ],
      "original_title": "The Mummy",
      "runtime": 86,
      "poster_path": "/w3XEtgi8W9tuPQnLVFCPVxtweyC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/pi7SHIi3CNAyDUCt6Jpr1q9UW3t.png",
         "name": "Hammer Film Productions",
         "id": 1314,
         "origin_country": "US"
      }],
      "release_date": "1959-09-29",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/iLmCaLaw9Tn8JeFtUbhlaNVFcga.jpg",
         "name": "The Mummy (Hammer Series)",
         "id": 138965,
         "poster_path": "/90f5SF3s02ndW498kGdm2lIVpYp.jpg"
      },
      "tagline": "Torn from the tomb to terrify the world!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Terence Fisher"],
      "runtime": 86,
      "synopsis": null,
      "writers": ["Jimmy Sangster"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053085/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BOTY3NjI3Nzk0OF5BMl5BanBnXkFtZTgwMTA4NTQ2MzE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Cushing, Christopher Lee, Yvonne Furneaux | See full cast and crew »"],
      "reviews": [
         "Far superior to the Brendan Fraser version, which relies too heavily on sterile computerized special FX. Comparing it to the classic 1932 Boris Karloff version, as so many people are doing, I feel is unfair. Karloff is not seen much in bandaged form choking people, but instead, in the Ardeth Bay persona. The Hammer Mummy has a lot more in common with the four Mummy movies Universal made in the 40's, (bandaged mummy chokes people out, the high priest out for revenge, etc.), and while those movies are fun, they don't compare to this one. Simply put, Tom Tyler and Lon Chaney, Jr. are not given the chance to pantomime with as much emotion as Christopher Lee, (kind of ironic when you consider the latter's father was the king of pantomime). Through all of the muddy bandages, there are still glimpses of human expression in Lee's eyes. Beautiful color and well paced, I highly recommend this movie..............",
         "The Mummy is the Rodney Dangerfield of classic monsters -- he gets no respect. But Hammer's sumptuous, beautifully filmed and acted treatment is as good as your going to find. It is also the most detailed mummy film around, with the recreation of its Egyptian tomb gorgeous and authentic. Christopher Lee is little short of brilliant in the thankless title role, actually managing to giving a compelling and at times touching performance through only his eyes and body language. Peter Cushing is superb as always (and was it a deliberate decision to make his character's lameness a wry twist on the fact that Kharis the mummy was always lame in the old Universal movies?), as is Hammer semi-regular George Pastell in the stereotypical mummy-controller-in-the-fez part. The supporting cast is also classier than usual for Hammer: Sir Felix Aylmer as Cushing's father is wonderful, aging amazingly convincingly and establishing himself as one of the great gibberers of the cinema; while Raymond Huntley is solid as Cushing's sensible uncle (and as London's first stage Dracula, one wonders what conversations he must have had on the set with Lee). Hammer regular Michael Ripper also has one of his best parts as a sodden eyewitness to the mummy's activities. Director Terrence Fisher (another Rodney Dangerfield) contributes many memorable touches, though probably none so effective as the agonizing sloooooooowwwwness with which the stone door of the secret chamber concealing the cursed Kharis closes, which emphasizes the horrific agony of living burial. Everything in this film works, and some elements, such as the photography and the excellent music score, exceed even Hammer's usually high standards. \"The Mummy\" might be the British studio's best film. It is certainly one of their best.",
         "England's Hammer Studios existed primarily as a distributor--until the low budget 1955 THE QUATERMASS EXPERIMENT suddenly put the studio on the map. Sensing an untapped market, Hammer began to develop similar titles and by the early 1960s developed a style that mixed Victorian sets and costumes with bouffant hairstyles, bared breasts, and lots of blood. The films were largely responsible for jolting the horror genre back to life on both sides of the Atlantic, as popular in the United States as they were in England. Released in 1959, THE MUMMY was among Hammer's earliest color films and helped lay out the visual style that come to dominate \"Hammer Horror\" for more than a decade. Drawing from Universal's 1932 THE MUMMY and 1940 THE MUMMY'S HAND, it opens with a band of Victorian-era archaeologists in Egypt, where they discover the lost tomb of Princess Ananka--and in the process unleash a mummy cursed to guard her throughout eternity. It is a curse that follows the men back to England, where they are stalked to their deaths one by one. Director Terence Fisher and cinematographer Jack Asher worked a number of Hammer films, including the earlier HORROR OF Dracula and REVENGE OF FRANKENSTEIN. Although some of the lighting may give you pause--judging from all the backlighting and colored filters it would seem the ancient Egyptians had mood lighting installed in their tombs--their efforts result in a series of truly arresting visuals; in their hands, bright color is no obstacle to moodiness. The cast plays it out extremely well, with the lovely Yvonne Furneaux a classic Hammer beauty, Peter Cushing as her archaeologist husband, and (yes, the posture and bearing really is unmistakable) Christopher Lee under wraps for the title role. The DVD contains no extras beyond the original trailer, and although the transfer is not pristine it is nonetheless very good indeed. Hammer Horror may not save the world, but it is often a lot of fun--and THE MUMMY is easily among the studio's best. Recommended. GFT, Amazon Reviewer",
         "The Mummy capped off an impressive initial run of horror movies from Hammer Studios. Believe it or not, it was mostly downhill from here; the company's subsequent efforts tended to be tackier and cheesier. But the \"big three\" (Curse of Frankenstein, Horror of Dracula, The Mummy) are all solid horror flicks with, oddly enough, some of the most crisp and colorful photography I've ever seen. There are some weaknesses here, though. The Egypt flashback waffles on for quite a while, and then we get ANOTHER flashback when Banning Sr. resurrects the mummy. However, the beginning and ending are well-paced and exciting, so most sins are forgiven. Lee's Mummy is spectacular; he's goddamn huge, and it's very impressive to watch him crashing through doors and French windows, absorbing shotgun blasts as if they were pinpricks (I hear Lee actually got injured several times making this movie; I can't say I'm surprised!) My favorite scene is the ideological debate between the Egyptian badguy (a very cool performance by George Pastell) and Peter Cushing's snooty archaeologist character. Their heated exchange adds a bit of texture to the story and even makes me sympathetic to the villain's POV. However, subtext goes out the window again for the violent final confrontation. On a side note, the exceedingly brilliant BBC show Doctor Who practically remade this movie twice. The episode \"Tomb of the Cybermen\" features Pastell as a guest star in a story involving an ill-fated archaeological dig, and \"Pyramids of Mars\" once again pits a hapless poacher against killer mummies. Just thought I'd mention it.",
         "This forgotten Hammer classic is wonderful. I like it better than the 1932 version and much better than the awful 1999 version. The start of and end of the movie are very solid. They did a great job building suspense by holding back the appearance of The Mummy until well in the movie. Christopher Lee's Mummy costume was a sight to see. It was very well done. Peter Cushing did a solid job as John Banning and Yvonne Furneaux was lovely. This movie was not very campy but it had just enough. I loved watching The Mummy's first appearance. The Egypt scenery was a nice touch to the film. It was clean and bright. This made it look almost like a fantasy sequence. The only negative is the flashback scene. That was way too long and got a little boring. This movie is a slight drop from Horror of Dracula and Curse of Frankenstein, but it is still very good and a worthy addition into the Hammer family.",
         "Director Terence Fisher and crew at Hammer Films revives life in the MUMMY. Horrific color and a much livelier and threatening wrapped menace is the modern slant on the 1930's original. Boris Karloff was almost mystic in the title role decades ago. Stealing some of his thunder is Christopher Lee. Lee is down right wicked and relentless. And in his own way, just as scary as Karloff. Peter Cushing brings a double whammy to this movie. More shakes and shivers. Also in the cast are Yvonne Furneaux, George Pastell, Raymond Huntley, David Browning and Michael Ripper. What a way to spend a rainy night. Curl up with this and the original. Yikes!",
         "Hammer Film Productions rework some of the classic Universal Studios mummy material to great effect. Directed by Terence Fisher, this is not a remake of the seminal 1932 movie of the same name. Starring Peter Cushing (John Banning), Christopher Lee (Kharis/The Mummy), Raymond Huntley (Joseph Whemple) and Yvonne Furneaux (Isobel Banning/Princess Ananka), the film is written by Jimmy Sangster and was filmed at Bray & Shepperton Studios in England. Tho listed as being filmed in Technicolor, it was actually shot in Eastman Color using the Technicolor process. I mention the latter because Eastman Color has a different hue to it, something that makes this movie all the more affecting as a horror piece. The plot sees three archaeologists (Stephen & John Banning & Joseph Whemple) desecrate the tomb of Egyptian Princess Ananka. This awakens Kharis, Ananka's blasphemous lover who was buried alive for his unlawful deeds. Taken from the tomb to London by Egyptian priest Mehemet Bey (George Pastell), the three archaeologists find they are being hunted down by the vengeful Kharis. The only salvation may come in the form of Isobel Banning who bears a striking resemblance to Princess Ananka. This Mummy is adroitly directed by Fisher, his choreography for the action scenes is stunning. Lee's incarnation as the mouldy bandaged one is swifter than most, thus Fisher has him stalking around Victorian England one minute, then the next he's crashing thru doors or windows with brute strength. With murder his (its) only goal. It's a top performance from Lee as he really throws himself into the role, with his dead eyes ominously peering out from gauze swathed sockets sending those little shivers running down the spine. Technically the film belies the budget restrictions that was a staple of Hammer productions. The sets are very impressive with the Egyptian tomb set original and authentic looking, and the swamp based set-up nicely constructed. The latter of which provides two genuine horror classic moments. As first we see the Mummy for the first time as he rises from a foul bubbling bog, and then for the dramatic swampy finale. It's also atmospherically filmed by Fisher, with Jack Asher's photography utilising the Eastman Color to give off a weird elegiac beauty. This is not about gore, Fisher and the makers wanted to thrive on atmospherics and implication. Something they achieve with great rewards. The Mummy would prove to be very successful in Britain and abroad, thus ensuring Hammer would dig up more Mummy's for further screen outings. None of which came close to capturing the look and feel of this first makeover. Crisply put together and with another in the line of great Christopher Lee monster characterisations', this Mummy is essential viewing for the creature feature horror fan. 8/10",
         "After their first successes with takes on famous stories, hammer's finest trio teamed up again to make this delightful take on the legend of an Egyptian mummy, imaginatively titled 'The Mummy'. Peter Cushing is an actor that needs no introduction as he has carried many a Hammer horror production and forever engraved himself in the minds of horror fans across the globe. His performance in this film isn't his finest ever (or even his finest under Terence Fisher), but it's more than solid and, to be honest, Peter Cushing is one of the few actors that could just spend the running time doing nothing and still have this horror fan riveted, such is the power of his screen presence. Christopher Lee has proved himself as the successor to both Boris Karloff and Bela Lugosi on a number of occasions with his portrayals of the classic monsters, and although he's never surpassed the great masters; this is another of those occasions. Of course, the one and only Terence Fisher direct the film. Fisher is an under-appreciated director in the horror genre as, although he hasn't done much outside of Hammer, the films he made for Hammer are what have gone on to be some of their most respected classics. This is another one. The film looks great, and despite the fact that it's low budget and was shot well over forty years ago, the colours and locations still bode well, and give the film a fresh feel. The Hammer style camp feeling is very much on display in The Mummy, and for the Hammer fan; that can only be a good thing. The Egypt setting marks a nice departure for the team, as up until this point, audiences had only seen them together in more urban settings. To be honest, aside from Boris Karloff's performance, I didn't much like the Universal classic. I don't hesitate, therefore, to label this film superior in every respect other than the lead. This version of the story is handled in a way that is much easier to like than Karl Freud's version. The story itself is a more than interesting one, and ties in the intrigue of the Egyptian civilisation, with themes of modern society breaking their sacred code to have a museum full of relics, which is really quite thought-provoking.",
         "Egyptian Mummies are fascinating creatures - yet I am sure that I'm not standing alone with the opinion that their representation in Horror cinema is a bit weak compared to other Horror creatures. And I don't mean to say that there were too few Mummy films made, but that great Mummy films are quite rare. The only Mummy film that I would really consider an absolute masterpiece is Karl Freund's brilliant \"The Mummy\" of 1932 starring Boris Karloff. While no other Mummy film has ever come close to the brilliance of the Karloff film, Hammer's 1959 re-telling of the story is easily my second-favorite of all Mummy films I've seen. After the success of \"The Curse Of Frankenstein\" (1957) and \"Horror Of Dracula\" (1958), two true Classics which revolutionized British Horror cinema, Hammer's dream-team, Horror-icons Peter Cushing and Christopher Lee, screenwriter Jimmy Sangster and director Terence Fisher reunited for \"The Mummy\" (aka. \"Terror Of The Mummy\") in 1959. And while this is not quite as brilliant as the two aforementioned films, in my opinion, \"The Mummy\" is definitely a great and wonderfully picturesque Horror film that can easily be considered a Hammer Classic. When British archaeologists, one of them John Banning (Peter Cushing) discover an ancient Egyptian tomb, they open the grave of a priestess who died 4000 years earlier. The desecration of the grave of the priestess unleashes a curse, which awakes the vengeful guard Kharis (Christopher Lee) who had been buried with the priestess... And what could be more entertaining for a lover of Gothic greatness than seeing a vengeful Egyptian Mummy haunt a Hammer-style Victorian England, even more so if this vengeful Mummy is played by none other than the all-mighty Christopher Lee? Lee himself once stated that this was his personal favorite of his Hammer films. It is hard to say why, as the role that initially earned him his status as one of Horror's all-time greatest was certainly that of Dracula; my guess is that he must have gotten tired of the Dracula role after a while. Yet it is more than understandable that Lee was fond of this film. \"The Mummy\" has a unique elegance in settings and colors, and some of the scenes, which I won't give away, are truly immortal moments of Gothic greatness. The equally great Peter Cushing is, as usual, brilliant in the role of the scientist John Banning. Director Fisher once again delivers the great trade-mark Hammer elements (foggy grounds, eerily luscious colors,...) in a particularly beautiful manner and Franz Reizenstein's score intensifies the gloomy atmosphere. All things considered out of Hammer's three original re-tellings of stories that had already been told in Universal Pictures in the 30s, \"The Mummy\" is not quite as essential as \"Curse Of Frankenstein\" and \"Horror Of Dracula\". It is, however, nonetheless a highly atmospheric, haunting, beautiful and downright great Gothic classic that no Horror fan can afford to miss!",
         "This is a rather forgotten horror film from Hammer . It's much better than the 1932 version from Universial Studios which was static , stilted and suffered from a cast who were either totally wooden or ridiculously over the top . It's also better than most of the films in Hammer's franchise featuring Dracula or Frankenstien It's obvious this version of THE MUMMY whether it be set in the deserts of Egypt or the fenland's of England were all filmed on a studio backlot but this isn't necessarily a criticism because it adds to its atmosphere . It's certainly a charming little film devoid of any gore that Hammer horror films were quickly gaining a reputation for . Of course the bar for \" gore \" has been raised highly over the past decades but atmosphere of whatever decade still remains intact to a degree and one wishes film makers would remember this One thing an audience might like to remember nowadays is the historical context that THE MUMMY was made in . Three years previously in 1956 an Anglo- French invasion of Egypt to secure the Suez Canal led to a political debacle for both nations with America forcing both countries to withdraw . It's easy to see the political subtext in the final third of the film as English gentleman John Banning visits the home of Mehemet Bey in a scene that almost screams \" You can't trust these Egyptian types at all . They'll stab you in the back \" which is what Bey literally does in a later scene . It's not so much racism , just a case of sour grapes that the Brits have lost an empire No one was expected to win any Oscars appearing in this movie but everyone manages professional performances . Peter Cushing was always excellent at playing mild mannered , affable gentlemen and he continues this type of role as John Banning . The underrated George Pastell as Bey is a striking contrast to Banning and that's deliberate but he never becomes a cartoonish villain . Christopher Lee unlike many of his Hammer roles gets a chance to do some acting and doesn't disappoint whilst the supporting cast do a fairly good job in thankless walk on roles This is certainly Hammer at their most restrained and ( Sorry to use the word again ) atmospheric . It's certainly one of their most enjoyable films and that the fact that it's so forgotten might have a lot to do with the historical context from when it was made"
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Hammer Film Productions"],
      "summaries": [
         "In the 1890s a team of British archaeologists discover the untouched tomb of Princess Ananka but accidentally bring the mummified body of her High Priest back to life. Three years later back in England a follower of the same Egyptian religion unleashes the mummy to exact grisly revenge on the despoilers of the sacred past.",
         "Three British archeologists discover the grave of an important Egyptian female priest who has died about four millenia ago. But when they open it a bad curse falls on them for having woken up the mighty guard of the grave who was buried with the priest.",
         "In 1895, a team of archaeologists uncover the tomb of Princess Ananka, an Egyptian high priestess. They are warned not to disturb the tomb but in doing so, inadvertently bring to life the mummy of Kharis, the high priest who loved the Princess. While in the tomb alone, something happens to frighten the leader of the expedition, Stephen Banning. Three years later an Egyptian, Mehemet Bey, transports the mummy to England to seek revenge against those who desecrated the Princess' tomb. It is left to Stephen Banning's son John to unravel the mystery and to protect his wife Isobel, who bears a striking resemblance to the Princess."
      ],
      "budget": 0
   },
   "movielensId": 2634,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1959-09-29",
      "dvdReleaseDate": "2001-10-02",
      "directors": ["Terence Fisher"],
      "runtime": 86,
      "movieId": 2634,
      "title": "The Mummy",
      "mpaa": "",
      "actors": [
         "Peter Cushing",
         "Christopher Lee",
         "Yvonne Furneaux",
         "Eddie Byrne",
         "Felix Aylmer",
         "Raymond Huntley",
         "George Pastell",
         "Michael Ripper"
      ],
      "imdbMovieId": "0053085",
      "originalTitle": "The Mummy",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "nTnkLTRR6v8",
         "0RT65h2yxr8"
      ],
      "plotSummary": "One by one the archaeologists who discover the 4,000-year-old tomb of Princess Ananka are brutally murdered. Kharis, high priest in Egypt 40 centuries ago, has been brought to life by the power of the ancient gods and his sole purpose is to destroy those responsible for the desecration of the sacred tomb. But Isobel, wife of one of the explorers, resembles the beautiful princess, forcing the speechless and tormented monster to defy commands and abduct Isobel to an unknown fate.",
      "tmdbMovieId": 18990,
      "avgRating": 3.07753,
      "releaseYear": "1959",
      "numRatings": 761,
      "posterPath": "/w3XEtgi8W9tuPQnLVFCPVxtweyC.jpg"
   }
}