{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "egypt",
            "id": 1160
         },
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "mummy",
            "id": 2904
         },
         {
            "name": "princess",
            "id": 7376
         },
         {
            "name": "sequel",
            "id": 9663
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "high priest",
            "id": 156243
         },
         {
            "name": "eqgyptian",
            "id": 229973
         }
      ],
      "imdb_id": "tt0035096",
      "video": false,
      "title": "The Mummy's Tomb",
      "recommendations": [
         18259,
         84719,
         3164,
         29243,
         56165,
         28426,
         29242,
         28590,
         31498,
         28365,
         39407,
         43014,
         32023,
         45322,
         30345,
         39408,
         48385,
         43342,
         30793,
         23014
      ],
      "backdrop_path": "/cznD61jpBcIg0JDcYsStEJ6RJ1X.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Kharis, the Mummy",
               "gender": 2,
               "credit_id": "52fe45d2c3a368484e070dab",
               "name": "Lon Chaney Jr.",
               "profile_path": "/cnuHF4xkziyAsS7IOCfpWbgdycu.jpg",
               "id": 4072,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Mehemet Bey",
               "gender": 0,
               "credit_id": "52fe45d2c3a368484e070dc3",
               "name": "Turhan Bey",
               "profile_path": "/pfTBURwKW19sTzdMcOZm7NOjKei.jpg",
               "id": 45380,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Dr. John Banning",
               "gender": 0,
               "credit_id": "52fe45d2c3a368484e070db3",
               "name": "John Hubbard",
               "profile_path": "/9zTAaXejiTGKEJfFIBUIhHo481t.jpg",
               "id": 33230,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Isobel Evans",
               "gender": 1,
               "credit_id": "52fe45d2c3a368484e070db7",
               "name": "Elyse Knox",
               "profile_path": "/rlh7BlAJomFPFhuRtKExr0bS4Am.jpg",
               "id": 123121,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Stephen Banning",
               "gender": 2,
               "credit_id": "52fe45d2c3a368484e070daf",
               "name": "Dick Foran",
               "profile_path": "/bOOhd2C58tafUadbbtKNHglyhKD.jpg",
               "id": 81168,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Babe' Hanson",
               "gender": 2,
               "credit_id": "52fe45d2c3a368484e070dbf",
               "name": "Wallace Ford",
               "profile_path": "/nfXCJAU3ddSn2K6SjwxXt2h1yQU.jpg",
               "id": 35849,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mrs. Ella Evans",
               "gender": 1,
               "credit_id": "52fe45d2c3a368484e070dc7",
               "name": "Virginia Brissac",
               "profile_path": "/At0bnWMBlJNqWKCg7uBe66nRdXL.jpg",
               "id": 2780,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Sheriff",
               "gender": 0,
               "credit_id": "580126f9925141300f0002b0",
               "name": "Cliff Clark",
               "profile_path": "/pSidj0mVZYQtXQzdszeTBgqGwj5.jpg",
               "id": 89728,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Jane Banning",
               "gender": 1,
               "credit_id": "58012708c3a36848e8000222",
               "name": "Mary Gordon",
               "profile_path": "/u4QD0zsgBgXTi3At0e0ow8VdiEi.jpg",
               "id": 2934,
               "order": 8
            },
            {
               "cast_id": 6,
               "character": "Andoheb",
               "gender": 2,
               "credit_id": "52fe45d2c3a368484e070dbb",
               "name": "George Zucco",
               "profile_path": "/hduZG2CH9UeGuBamxnohkd3DEVg.jpg",
               "id": 30417,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Jim, the Caretaker",
               "gender": 0,
               "credit_id": "58012719c3a36848f200025e",
               "name": "Paul E. Burns",
               "profile_path": "/7FVvu4kIg6vnU5i9LzAOLRAudBy.jpg",
               "id": 96302,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Professor Matthew Norman",
               "gender": 2,
               "credit_id": "5801272b925141300f0002d3",
               "name": "Frank Reicher",
               "profile_path": "/cKBUmGq3LUnR4BsaaNFDpbUTNCn.jpg",
               "id": 3245,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Coroner",
               "gender": 2,
               "credit_id": "58012737925141300c00028e",
               "name": "Emmett Vogan",
               "profile_path": "/cgahLkQCEDNyGyj39R3MiPeHWIO.jpg",
               "id": 34008,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d2c3a368484e070da7",
               "name": "Harold Young",
               "profile_path": null,
               "id": 103344,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d2c3a368484e070dcd",
               "name": "Neil P. Varnick",
               "profile_path": null,
               "id": 1172271,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d2c3a368484e070dd3",
               "name": "Griffin Jay",
               "profile_path": null,
               "id": 103912,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d2c3a368484e070dd9",
               "name": "Henry Sucher",
               "profile_path": null,
               "id": 1172272,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "58012756c3a36848ec000285",
               "name": "Ben Pivar",
               "profile_path": null,
               "id": 993407,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "5801276492514130160002d1",
               "name": "George Robinson",
               "profile_path": null,
               "id": 29635,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "58012770c3a36848e60002c2",
               "name": "Milton Carruth",
               "profile_path": null,
               "id": 1552,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5801277c925141300c0002e2",
               "name": "Jack Otterson",
               "profile_path": null,
               "id": 13958,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5801278bc3a36848e8000269",
               "name": "Russell A. Gausman",
               "profile_path": null,
               "id": 12348,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "58012798c3a36848f5000325",
               "name": "Jack P. Pierce",
               "profile_path": null,
               "id": 29813,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "580127acc3a36848f2000298",
               "name": "John P. Fulton",
               "profile_path": null,
               "id": 100762,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "580127b8925141300f00030e",
               "name": "Tim Baar",
               "profile_path": null,
               "id": 1585363,
               "department": "Crew",
               "job": "Special Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.689899,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29239,
      "vote_count": 9,
      "budget": 0,
      "overview": "A high priest of Karnak travels to America with the living mummy Kharis (Lon Chaney Jr.) to kill all those who had desecrated the tomb of the Egyptian princess Ananka thirty years earlier.",
      "similar": [
         357096,
         281957,
         281,
         979,
         21484,
         3134,
         123109,
         26390,
         8090,
         4771,
         1949,
         588,
         948,
         238636,
         395834,
         3597,
         12619,
         445954,
         276488,
         133805
      ],
      "original_title": "The Mummy's Tomb",
      "runtime": 60,
      "poster_path": "/wuaqpLGb5PHpUGUCmQwyS5EVLdw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
         "name": "Universal Pictures",
         "id": 33,
         "origin_country": "US"
      }],
      "release_date": "1942-10-23",
      "vote_average": 7.4,
      "belongs_to_collection": {
         "backdrop_path": "/9Hurk1iwEE3USJpBe48FChOSROC.jpg",
         "name": "The Mummy (Universal Series)",
         "id": 221544,
         "poster_path": "/AvNgVQAVU7glcRawxyXnyHMPPbk.jpg"
      },
      "tagline": "The FEAR of the Year!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Harold Young"],
      "runtime": 60,
      "synopsis": null,
      "writers": [
         "Neil P. Varnick",
         "Griffin Jay"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0035096/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM0Njg0MDYyNV5BMl5BanBnXkFtZTgwNjI1OTg5MTE@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Lon Chaney Jr., Dick Foran, John Hubbard | See full cast and crew »"],
      "reviews": [
         "Okay, so this is pretty familiar stuff once again--you know, mad Egyptian cult leader and his resurrection of a mummy to exact revenge on those who have desecrated ancient tombs. About the only big differences here are having Lon Chaney, Jr. play the mummy for the first time and the action is moved to America (despite this making little sense). While this is far from the best mummy film, it is good old fashioned fun and I enjoy this much more than the overly special effects enhanced mummy films of the last decade because of the fun factor. The campiness and the whole ambiance are just so wonderful--and they remind you that the term \"B-movie\" isn't such a bad thing. Watch it and let yourself go--and have FUN!",
         "Fun, typical Universal\"B\".. In what must've amounted to a cost-cutting measure, over 10 min. of the film's 60 min. running time, is made up of scenes from 1940's The Mummy's Hand\"!! This flick would mark Chaney's first of 3 appearances as Kharis. Look for Glenn Strange[Frankenstein's Monster from '44-'48]in an unbilled \"bit\" as a farmer calming a horse, during the Mummy's first attack sequence.",
         "This 61 minute sequel begins with roughly about 10 minutes of stock footage from the previous film (THE MUMMY'S HAND), and I'd like to get that out of the way right from the beginning because it seems to unnecessarily bother a lot of monster fans who didn't go to the theater in 1942 when THE MUMMY'S TOMB first premiered. It should be taken into account that these first two Universal installments were released a couple of years apart back in their day, and it was during a time in our history when we didn't even have the luxury of television, much less something as convenient or extravagant as a \"home video theater\". Today we can watch these films over and over, and back to back; but in the early '40s it wouldn't have been so easy to recall where the story of Kharis the mummy left off two whole years ago, and that's in the context that this repetitive footage should be considered. After being refreshed of the last films' Egyptian exploits of novice archaeologists Steve Banning and Babe Jenson (now mistakenly referred to as Babe \"Hanson\", an error which is NOT as easily excusable!) we move ahead 30 years where the mummy of Kharis (newly played by Lon Chaney) is stuck in America with current high priest Mehemet Bey (Turhan Bey). Why it's taken so long is anyone's guess, but Mehemet has a mission to unleash the mummy on Steve and Babe (Dick Foran and Wallace Ford, reprising their parts in senior citizen's makeup) for daring to defile Kharis' tomb three decades earlier. This is strictly a \"B\" level programmer without many trimmings, but it's still an entertaining one. Lon Chaney looks menacing in his dingy mummy outfit which properly shows some of the effects of the fire which consumed him once upon a time. Chaney absolutely hated playing the restrictive part of Kharis, yet he wound up grumbling through it for two more sequels following this one. Harold Young's pedestrian direction is nothing much to get excited about, but we do get some chilling sequences of Kharis creeping around modern-day Mapleton, Massachusetts on dark and windy evenings, which are a plus. Turhan Bey is perfectly cast as the mummy's foreign protector, and lovely Elyse Knox is easy on the eyes as the love interest to John Hubbard, who doesn't leave much impression as Steve Banning's son. One can nitpick on the inconsistency of these mummy sequels forever; for example, even though TOMB occurs thirty years after HAND and should therefore be set in 1970, everyone still dresses and acts like it's 1942. But what the hell -- taken for what it is, THE MUMMY'S TOMB is a fast and fulfilling hour of mindless fun. **1/2 out of ****",
         "Decent Mummy sequel that's fairly entertaining and well made. this is definitely an improvement over the rather weak Mummy's Hand due to the fact that's it's very well paced and only a couple of dull moments plus Lon Chaney Jr. played the best mummy since Christopher Lee Arnold Vosolo and Boris Karloff. the performances are a lot better this time around although it's a shame we only see George Zucco once in this film he is such a great actor. The script is also a lot better this time around and it does not feel so rushed and it had a couple of surprisingly suspenseful moments. The Acting is good. Lon Chaney Jr. as i said is the best mummy since Lee Vosolo and Karloff and is WAY better then Tom Tyler Chaney is such a versatile actor and can play any role that he is given. Dick Foran does well with his limited screen time. John Hubbard is good here as one of the main leads and is pretty likable. Elyse Knox is pretty and has good chemistry with John Hubbard and is also very likable. Wallace Ford is only there in flashback scenes (thankfully) from what i could see. Turhan Bey does what he has to do well. but does not compare to George Zucco. Overall this is worth the watch and i will probably watch it again sometime. **1/2 out of 5",
         "When I first watched this, some 4 years ago, I remember being very disappointed with it and recall labeling it a lazy overall effort, especially as it heavily borrowed footage not only from the previous film - THE MUMMY'S HAND - but also FRANKENSTEIN (1931), BRIDE OF FRANKENSTEIN (1935) and THE WOLF MAN (1941) for its mob scenes at the climax! However, coming back to it now - and despite having just watched the other \"Kharis\" films - I found it to be quite enjoyable, atmospheric and competently handled (especially during Chaney's various rampages and the fiery finale). It was nice to see Dick Foran, Wallace Ford and George Zucco (why on Earth did he wait 30 years to exact his revenge?!) reprise their roles from THE MUMMY'S HAND, if only briefly, as it was to have Mary Gordon - Mrs. Hudson of Universal's contemporaneous \"Sherlock Holmes\" series - as one of Chaney's victims. As for Chaney himself, I thought that his first stab at the role wasn't bad at all: suitably brutish when required but with a hint of emotion seeping through the wrappings on occasion to provide a balance (especially when Turhan Bey, yet another misguided High Priest of Karnak, is liable to jeopardize their 'mission' of restoring Princess Ananka to life by conveniently falling for leading lady Elyse Knox).",
         "THE MUMMY'S TOMB (Universal, 1942), directed by Harold Young, the third installment in the Mummy series, the second to feature Kharis and the first starring Lon Chaney Jr. as the living creature under wraps. A  sequel to THE MUMMY'S HAND (1940) released two years earlier, this legend of Kharis continues, set thirty years later, with Dick Foran, Wallace Ford and George Zucco reprising their original characters sporting middle-age makeup consisting of gray hairs, glasses and wrinkles. The story opens in a town of Mapleton in Massachusetts, with the middle-aged widow named Steve Banning (Dick Foran) relating his scientific expedition to his sister, Jane (Mary Gordon), son, John (John Hubbard) and Isobel (Elyse Knox), John's fiancé, on how he, his now deceased wife, Marta (played earlier by Peggy Moran) and his friend, Babe Hanson (Wallace Ford) encountered the ancient burial ground of Kharis, the mummy. The next scene shifts over to Egypt where High Priest Andoheb (George Zucco), who amazingly survived three bullet wounds shot into him by Hansen and his long plunge down the temple steps (told via flashback), assigns Mehemet (Turhan Bey), to guide Kharis (Lon Chaney Jr.) to America where his next assignment is to avenge the surviving members of the expedition, doing away with the Banning family and finally Babe Hansen, whose character arrives later in the story. Taking a new direction from its previous successors by shifting Kharis from Egypt to the United States, with similarities to Dracula (1931) where Kharis on board the ship, resting inside his tomb, bound for his destination with Mehemet as his guide in the similar fashion to Dracula's Mr. Renfield. Once in Massachusetts, Mehemet takes up residence as a cemetery caretaker with Kharis feeling right at home surrounded by tomb sweet tombs of buried beings. Like Dracula, Kharis stalks his victims at night and rests by day. While THE MUMMY'S TOMB tends to be original, it mostly borrows from other horror stories, including its predecessor where Mehemet captures Isobel to make her his bride as his predecessor Andoheb tried to do with Marta in THE MUMMY'S HAND. Besides resurrections and revisions, the film delivers towards its final half with chills and thrills, and Kharis meeting the same fate as the Frankenstein monster, who doesn't appear here. Supporting players include Frank Reicher (Professor Matthew Norman); Cliff Clark (The Sheriff); Virginia Brissac (Ella Evans); and Otto Hoffman (The Cemetery Caretaker). Strictly \"B\" material for the juvenile crowd, THE MUMMY'S TOMB is a fast-paced if not entirely incredible 62 minutes. Without the flashback and stock material from the previous film, this movie would have been ten minutes shorter. Minus the over abundance of comedy relief stressed out from THE MUMMY'S HAND, TOMB has all the familiarities from other Universal horror films from the 1940s, especially the stock musical score by Hans J. Salter. Although THE MUMMY'S TOMB did not become a top of the line Mummy show, it did lead the way to the next installment of THE MUMMY'S GHOST (1944), considered by many to be the best of all the \"Kharis\" thrillers. Footnote: For anyone paying close attention to detail, it should be noted that since the first Kharis film installment obviously takes place in 1940, then this sequel, which looks very much like modern-day 1942, is set thirty years into the future, namely 1970. Otherwise if this is 1942, then the earlier film should have taken place in 1912 with actors in futuristic 1940s attire. Other than local television presentations prior to 1985s Fright Night/Chiller theaters, and availability on video cassette and later DVD format, it's cable broadcast history consists of the Sci-Fi Channel (1990s) and American Movie Classics (2000-2002).(**)",
         "1940's \"The Mummy's Hand\" featured western actor Tom Tyler as the undead pile of bandages. Tyler (listed eighth in the credits of 'Hand') obviously wasn't being prepped to carry Universal's horror banner into the remainder of the decade. So, after the success of \"The Wolf Man\"--and much to his displeasure--Lon Chaney Jr. had to slouch through the gauze for a remarkable 'three' sequels--the remarkable part being that Universal could squeeze so much milk from this particular cash-cow. Tomb opens with an ample amount of stock footage from 'Mummy's Hand' recapping the important events from that chapter. Seeing old footage in these mummy flicks is no big surprise--the fact that the filmmakers were not shy about reusing the close-ups of Tom Tyler (in makeup) as Kharis did puzzle me. Exactly how thin was the budget for 'Tomb' that some new close-up shots of Chaney as Kharis couldn't be cut into the picture? George Zucco returns as high priest Andoheb, proving to be nearly as bulletproof as the mummy, having escaped the events of the last movie with 'only' a crushed arm & a full head of hair (maybe he rubbed some tana on his scalp). Also returning is what was already becoming a tedious plot device: The new priest put in charge of Kharis--apparently raging with suppressed libido--becomes enamored with some American skirt & usually suffers some violent (and well deserved) death. However, it all speeds along at a quickie pace (all of Chaney's mummy pictures barely eclipse the 60 minute mark) and it's supplied with the usual atmosphere & mood music that at this stage of the game make it a good enough occupier of one's time. Of the quartet of Kharis films, 'Tomb' would be my favorite. It's certainly a more atmospheric piece than its predecessor and not bogged down with any of the inane comic relief.",
         "\"The Mummy's Tomb\" takes place thirty years following the events of \"The Mummy's Hand\", recounting the events of that earlier film in a series of flashbacks as narrated by expedition leader Stephen Banning (Dick Foran), bearing an uncanny resemblance to Martin Mull. We also come to learn that the Mummy from the prior film was only \"seared\", and it's mentor Andoheb (George Zucco) was only shot in the arm and actually survived the first film. If you're ready to accept that, you'll be able to swallow the rest of the story, as the aging Andoheb entrusts the Mummy's safekeeping to a new caretaker Mehemet Bey (Turhan Bey). Now there's a great coincidence, the Boris Karloff character in the original \"The Mummy\" was known as Ardath Bey! Mehemet Bey's avowed mission is to bring the Mummy to Mapleton, Massachusetts to avenge the desecration of his holy tomb, by destroying the members of the original expedition and their families. But like his mentor before him, Mehemet is deterred from his mission by the sight of a pretty girl, in this case the fiancé of John Banning, Stephen Banning's son. Wallace Ford is on hand in this sequel as well, but without the comic nuance of the earlier film. In a continuity goof, Ford's character is called Babe Hanson, and not Babe Jenson as in \"Hand\". It was a rather dramatic oversight, as the name Hanson is given prominence in a newspaper headline following his demise in the film. The story writers also take liberty with the legacy of the tana leaves that are instrumental in keeping the Mummy alive. In \"Hand\", much was made of the fact that nine drops of liquid extracted from the leaves were necessary to resurrect the bandaged one; here three leaves keep him alive, and nine are needed to give him movement. I know, it's only a movie, but gee, let's keep our monster continuity intact. I've yet to research Lon Chaney's involvement in this and the subsequent Mummy sequels, but I question why a name actor would have been called upon to portray a character that's never seen in his real guise; why not save the bucks and have a starving newcomer take on the role? If the Chaney name was a hook to bring in the moviegoers, who would ever know the difference?",
         "Well, I like it anyway! As before, the first 10 minutes are spent in a series of flashbacks, this time out of a total running time of 57 minutes. 30 years on the Mummy and Zucco have actually \"survived\", Zucco enrols Bey to take the Mummy to Hicksville, America and eliminate the surviving tomb raiders. The plan is carried out but derailed by Bey's instant lusting for the heroine, much to the Mummy's disgust. It's an utterly preposterous (and monstrous) plot of course, and without the usual nominal Universal production values would not even have the charm I like in Golden Age movies. In 1952 this would have been an out and out clinker, a Plan 9 competitor. But with those production values also come the familiar nitrate film/atmosphere/sets/actors and decent photography that I love to watch over and over again. The crematorium in The Black Cat was used, and in this they even set fire to the Winslow house - would that Hugh Herbert's character had been inside! That was never Lon Chaney Jr playing the Mummy, and it was Tom Tyler in the flashbacks, they just used Chaney's name to help sell the picture. The local doctor examining the mould from a victim of the Mummy announced that they \"were in the presence of the living dead\" - sadly I get that feeling every time I trot an old Hollywood film out! Like I said, I like it but frankly I think I'm in a tiny minority!",
         "\"The Mummy's Tomb\" is a sequel to \"The Mummy's Hand\" (1940) and the first of three films featuring Lon Chaney as the Mummy. By now the mummy series as with other Universal horror series had degenerated to second feature \"B\" movie status. The story takes place thirty years after the earlier film. Stephen Banning (Dick Foran) is telling his son John (John Hubbard), his fiancé Isobel (Elyse Knox) and his sister Jane (Mary Gordon) the story of his encounter with the mummy so many years before. Meanwhile we find out that the High Priest Andeheb (George Zucco) survived being shot at the end of the previous film. He is nearing death and passes on the sacred medallion of the High Priest to Mehemey Bey (Turhan Bey). Bey becomes responsible for Kharis the 3,000 year old mummy (Lon Chaney) who magically survived a fiery death in the earlier film. The pair embark upon a journey to America to seek revenge on the surviving members of the Banning party and their families. Kharis kills Stephen Banning, his sister Jane and Babe Hansen (Wallace Ford) until only John Banning is left. Mehemet Bey decides to take Isobel for his own bride and has Kharis carry her off. The towns people finally convinced that a monster is in their midst and in classic Universal fashion, form a mob with flaming torches to seek out and destroy the mummy. The main fault with this film is its extensive use of footage from \"The Mummy's Hand\" in which Tom Tyler played the mummy. He can be clearly seen in the flashback sequences (which take up about a quarter of the movie's run time). Tyler and Chaney bore no physical resemblance even under all of those bandages. Chaney is not seen without the mummy makeup and has no lines. Mary Gordon may be best remembered for playing Mrs. Hudson in Universal's Sherlock Holmes series."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Drama",
         "Horror",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Universal Pictures"],
      "summaries": [
         "A high priest travels to America with the living mummy Kharis (Lon Chaney Jr.) to kill all those who had desecrated the tomb of the Egyptian princess Ananka thirty years earlier.",
         "Andoheb (George Zucco), by day a professor at the Cairo Museum and a high priest of Karnak by night, travels to America to wreak revenge on an archaeologist, Steve Banning (Dick Foran) who, thirty years earlier, on an expedition to find the sarcophagus of the ancient Egyptian Princess Ananka, instead unearthed Ananka's lover, Kharis (Lon Chaney Jr.), buried alive for sacrilege but kept from death for over 3000 years by tanna leaves administered over the centuries by the successive High Priests of Karnak. While the now-middle-aged Banning is telling his family of the trials and tribulations of dealing with Andoheb and Kharis in Egypt, the unexpected Andoheb, with Kharis in tow, looms ever closer. This does not bode well for the Banning family."
      ],
      "budget": 0
   },
   "movielensId": 2638,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1942-10-23",
      "dvdReleaseDate": "2001-08-28",
      "directors": ["Harold Young"],
      "runtime": 60,
      "movieId": 2638,
      "title": "The Mummy's Tomb",
      "mpaa": "",
      "actors": [
         "Lon Chaney Jr.",
         "Turhan Bey",
         "John Hubbard",
         "Elyse Knox",
         "Dick Foran",
         "Wallace Ford",
         "Virginia Brissac",
         "Cliff Clark",
         "Mary Gordon",
         "George Zucco",
         "Paul E. Burns",
         "Frank Reicher",
         "Emmett Vogan"
      ],
      "imdbMovieId": "0035096",
      "originalTitle": "The Mummy's Tomb",
      "genres": [
         "Drama",
         "Fantasy",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "b5NRPPDxZA4",
         "Usp62ys-zFQ"
      ],
      "plotSummary": "A high priest of Karnak travels to America with the living mummy Kharis (Lon Chaney Jr.) to kill all those who had desecrated the tomb of the Egyptian princess Ananka thirty years earlier.",
      "tmdbMovieId": 29239,
      "avgRating": 2.71026,
      "releaseYear": "1942",
      "numRatings": 195,
      "posterPath": "/wuaqpLGb5PHpUGUCmQwyS5EVLdw.jpg"
   }
}