{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ax",
            "id": 3598
         },
         {
            "name": "biography",
            "id": 5565
         },
         {
            "name": "sociopath",
            "id": 9740
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "mansion",
            "id": 12545
         },
         {
            "name": "docudrama",
            "id": 15061
         },
         {
            "name": "perfection",
            "id": 168196
         },
         {
            "name": "adopted child",
            "id": 185927
         }
      ],
      "imdb_id": "tt0082766",
      "video": false,
      "title": "Mommie Dearest",
      "recommendations": [
         18417,
         65014,
         55066,
         28940,
         42045,
         151848,
         41587,
         91217,
         19975,
         13903,
         51321,
         18856,
         73943,
         27458,
         31955,
         46925,
         38683,
         61418,
         150889,
         44895
      ],
      "backdrop_path": "/yIRqDvCzjJKUl9OgrJdyYKTfj5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Joan Crawford",
               "gender": 1,
               "credit_id": "52fe466f9251416c75078491",
               "name": "Faye Dunaway",
               "profile_path": "/sq12RJZ1HTXHHI48y31YIS2qp87.jpg",
               "id": 6450,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Christina Crawford",
               "gender": 1,
               "credit_id": "52fe466f9251416c75078495",
               "name": "Diana Scarwid",
               "profile_path": "/1Z11dGfpfJygcL0r3CYLFREEU8l.jpg",
               "id": 2958,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Greg Savitt",
               "gender": 2,
               "credit_id": "52fe466f9251416c75078499",
               "name": "Steve Forrest",
               "profile_path": "/rRuAgDKpPp2hF7sxiRyzHpenJ6K.jpg",
               "id": 44998,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Louis B. Mayer",
               "gender": 2,
               "credit_id": "52fe466f9251416c7507849d",
               "name": "Howard Da Silva",
               "profile_path": "/8KPykJ2sTNNNPXskNhpaJXHaWQ5.jpg",
               "id": 79247,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Christina Crawford (child)",
               "gender": 1,
               "credit_id": "52fe466f9251416c750784a1",
               "name": "Mara Hobel",
               "profile_path": "/l6fDNvtiVwWnzsqD3UKPadDblYv.jpg",
               "id": 150212,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Alfred Steele",
               "gender": 0,
               "credit_id": "52fe466f9251416c750784a5",
               "name": "Harry Goz",
               "profile_path": "/gFV24rWGxIZn35y3Qbxyzx0jYGo.jpg",
               "id": 171600,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Ted Gelber",
               "gender": 2,
               "credit_id": "52fe466f9251416c750784a9",
               "name": "Michael Edwards",
               "profile_path": null,
               "id": 75027,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Barbara Bennett",
               "gender": 1,
               "credit_id": "52fe466f9251416c750784ad",
               "name": "Jocelyn Brando",
               "profile_path": "/dqbWQp7CFIvWghZvZEX7dgooSGy.jpg",
               "id": 96283,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Mrs. Chadwick",
               "gender": 1,
               "credit_id": "52fe466f9251416c750784b1",
               "name": "Priscilla Pointer",
               "profile_path": "/rmT7Qje6YBG180d1hlY6zQpZmfv.jpg",
               "id": 11793,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Captain",
               "gender": 2,
               "credit_id": "52fe46709251416c750784b5",
               "name": "Joe Abdullah",
               "profile_path": null,
               "id": 274915,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe46709251416c750784b9",
               "name": "Gary Allen",
               "profile_path": null,
               "id": 129665,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Connie",
               "gender": 1,
               "credit_id": "52fe46709251416c750784bd",
               "name": "Selma Archerd",
               "profile_path": "/ySosWAFjVB7Hd0ZjE4OzeqAHb5u.jpg",
               "id": 152587,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Wedding Guest",
               "gender": 0,
               "credit_id": "52fe46709251416c750784c1",
               "name": "Adrian Aron",
               "profile_path": null,
               "id": 1168422,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Christopher Crawford (adult)",
               "gender": 2,
               "credit_id": "52fe46709251416c750784c5",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe466f9251416c7507848d",
               "name": "Frank Perry",
               "profile_path": null,
               "id": 113799,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46709251416c750784cb",
               "name": "Robert Getchell",
               "profile_path": null,
               "id": 53810,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 1,
               "credit_id": "52fe46709251416c750784d1",
               "name": "Tracy Hotchner",
               "profile_path": null,
               "id": 989077,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46709251416c750784d7",
               "name": "Frank Perry",
               "profile_path": null,
               "id": 113799,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe46709251416c750784dd",
               "name": "Frank Yablans",
               "profile_path": null,
               "id": 69878,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.071227,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15660,
      "vote_count": 67,
      "budget": 0,
      "overview": "In this biographical film, glamorous yet lonely star Joan Crawford takes in two orphans, and at first their unconventional family seems happy. But after Joan's attempts at romantic fulfillment go sour and she is fired from her contract with MGM studios, her callous and abusive behavior towards her daughter Christina becomes even more pronounced. Christina leaves home and takes her first acting role, only to find her mother's presence still overshadowing her.",
      "similar": [
         396371,
         11202,
         462,
         640,
         769,
         5915,
         318846,
         324786,
         389015,
         407445,
         363676,
         371638,
         323677,
         228970,
         274479,
         152532,
         300671,
         276907,
         152792,
         328589
      ],
      "original_title": "Mommie Dearest",
      "runtime": 129,
      "poster_path": "/vPwWgX1SzLRm6Tqhj9102Mg5kkz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1981-09-18",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "The meanest mother of them all",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Frank Perry"],
      "runtime": 129,
      "synopsis": "At the beginning of the film, we see Joan Crawford ( Faye Dunaway) as she rises very early in the morning to prepare for a work day at the MGM Studios. She engages in a slightly neurotic morning ritual where she scrubs her face vigorously with soap and hot water, then plunges it immediately into ice with alcohol in it to close the pores. We learn early on that Joan is obsessed with cleanliness and wants those around her to follow her instructions to the letter; when a new maid thinks she has Joan's living room in spotless condition, Joan finds one minute detail that the maid overlooked and momentarily loses her temper over it. She very clearly intimidates the maid, as well her new live-in personal assistant, Carol-Ann ( Rutanya Alda). Joan is in a steady romantic relationship with Hollywood lawyer Gregg Savitt ( Steve Forrest), but her career is in a bit of a downswing. She reveals to Gregg that what she really wants is a baby, but that she can't get pregnant; no less than seven pregnancies when she was married to actor Franchot Tone all ended in a miscarriage. When she is denied an application for adoption through a legal agency, she enlists Gregg's help to secure a baby through means which are not made clear. Finally Joan gets what she wants; a blonde haired, blue eyed little girl whom she names Christina Crawford. The film moves abruptly to when Christina is approximately eight or nine years old. Joan has adopted another child, a boy she calls Christopher, but the focus of the film remains on Christina ( Mara Hobel). Joan lavishes her with attention and luxuries such as an extravagant birthday party, yet enforces a strict code of denial and discipline as well. Joan makes the decision to donate all but one of Christina's birthday presents to an orphanage, making Christina take responsibility for the gesture, which has been documented in the press (presumably garnering publicity for Crawford). As Christina begins to rebel against her mother's stringent demands and standards, a series of confrontations emerges that forms the movie's core. Joan easily overtakes Christina in a swimming pool race, then becomes enraged at the young girl when she reacts with childish disappointment. When Joan discovers Christina putting on makeup at her dressing table and imitating her, Joan takes offense and cruelly hacks off Christina's hair with a pair of scissors. Quickly these tantrums grow even more bizarre and violent, as when Joan is asked to leave MGM by studio boss Louis B. Mayer ( Howard Da Silva). Presumably later that evening, she flies into a bitter rage and hacks down her prize rose garden with a pair of large gardening shears and an axe, dragging Carol-Ann, Christina, and Christopher into the madness. In the film's most notorious scene, Joan stalks into Christina's bedroom in the middle of the night, her face covered with white beauty cream, and discovers one of the child's dresses hanging on a wire hanger. Joan instantly becomes furious and launches into a frightening tirade, screaming at the girl that she had forbidden wire hangers, viciously tearing apart her closet, and then beating the girl with the hanger. The fight continues when Crawford stumbles into Christina's bathroom and feels that she has not obeyed her orders to scrub the floor that day. Furious that the child doesn't understand her notion of cleanliness, Joan destroys the bathroom as well, beating Christina with two cans of scouring powder and hurling the cleanser over everything. Finally she leaves the girl with an angry order to \"clean up this mess\" all by herself. Eventually Crawford sends Christina away to attend a boarding school, and the film makes another jump in time to when Christina seems to be about 16. Crawford claims to be losing her financial stability and works out an arrangement that allows Christina (now portrayed by Diana Scarwid) to perform chores around the school for her board and tuition. Meanwhile, Christina begins to realize that her mother's erratic behavior is fueled in part by her alcoholism. Christina's grades are excellent and she seems to be proud of her schoolwork, but things change drastically when she is caught in a compromising position with a boy. Although the encounter was innocent and the boy will be disciplined according to the rules of the institution, Joan arrives at the school furious and removes Christina permanently after screaming in rage at the school's headmistress, Mrs. Chadwick ( Priscilla Pointer), claiming the school is a den of iniquity. Joan brings Christina home with her, where Barbara Bennett ( Jocelyn Brando), a reporter from Redbook magazine, is in the house writing a puff piece article on Crawford's supposedly idyllic balance of career and home life. An argument erupts and Christina accuses Joan of adopting her children simply to give herself free publicity. Joan slaps Christina several times across the face and then becomes completely unhinged, dragging Christina to the carpet and attempting to choke her to death. Carol-Ann and Barbara witness the attack and intervene, but there are apparently no repercussions for Crawford, who sends Christina to a strict convent school against her will. The film's final act takes place after Christina matures and sets out on her own. Joan marries Alfred Steele ( Harry Goz), CEO of Pepsi Cola, and urges him to take on a great deal of debt to fund their lavish home and lifestyle. After his death, she remains on the company's board of directors, but not without a bitter confrontation with the all-male board. Christina and her mother enter into a somewhat amicable phase in their relationship, despite the fact that Joan seems to sabotage Christina's attempt to establish herself as an actress. In a disastrous move, when Christina is unable to attend the taping of a soap opera because of an illness, Joan takes her place, attempting to step into a role calling for a much younger actress. It comes as a complete shock to Christina and Christopher that, upon Joan's death at the end of the film, they are both disinherited in her will \"for reasons that are well known to them\". The final dialogue exchange hints that Christina has decided to write a book about her experiences growing up with \"Mommie Dearest\" and thus avenge Christopher and herself, saying that their mother doesn't have \"the final word.\"",
      "writers": [
         "Christina Crawford",
         "Frank Yablans"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082766/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMDI5NDEwNl5BMl5BanBnXkFtZTcwNTc4NzIzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Faye Dunaway, Diana Scarwid, Steve Forrest | See full cast and crew »"],
      "reviews": [
         "It seems almost pointless for me to add any comments here, since everyone else who's posted has done such a great job of summarizing this film's merits, but I can't resist. How do you rate a movie like this? On the one hand, it's one of the worst movies I've ever seen: completely lacking in coherence, shameful acting, writing so bad it seems to be making fun of itself. In fact, I'm still not convinced this movie isn't supposed to be a parody of Christina Crawford's book rather than a serious attempt to adapt it to the screen. On the other hand, it's such a rip-roarin' good time of a show that I'm tempted to give it 10 stars on the strength of its sheer entertainment value alone. Faye Dunaway gives the most jaw-droppingly mesmerizing freak out ever captured on screen, whose bizarreness cannot even be topped by Halle Berry's Oscar acceptance speech. Dunaway must have realized early on that she was a rat in a sinking ship, but instead of deserting, she decides instead to devour the crew. I don't know if her performance comes anywhere close to capturing the real Joan Crawford, but if Crawford was even a tenth of a percent as loony as Dunaway portrays her here, I would have been high-tailing it to Canada if I were either of her children. The fabulous lines, many of which are quoted on this site, can't really be done justice when removed from the context in which they appear, and you really have to see the faces of the actors as they're delivering them to get the full effect. The wire hanger scene is of course a classic, but it's really the floor scrubbing scene immediately following, with Dunaway in kabuki makeup squatting on the floor like a Sumo wrestler, that remains more memorable. Watching Joanie jog is a sight to behold, especially when she starts talking to herself and scrunching her face up as if she's imitating Alvin or one of his chipmunks. There's the \"I can handle the socks\" moment, one of the most seductive moments (hee, hee) in film history, and of course the coup de grace comes when Joanie tackles Christina across the coffee table and begins banging her head into the floor like she's in a women's prison movie. The editing in this film is atrocious. There's no sense of time; events follow each other in a loosely chronological fashion, but they don't make dramatic or narrative sense. Frank Perry, the director, must have been dozing off through much of this production; either that or his film crew carried out a mutiny, tied him up, threw him in a shed, and went ahead without him. But it seems churlish to criticize a film like this for its poor film making. It's like kicking a dead horse. All I can say is, if you watch this movie with the right people in the right frame of mind (i.e. with alcohol), you will be howling. I watched this with a group in college, and we had to periodically pause the movie in order to allow everyone to recover before continuing. Thank you, Ms. Dunaway, for giving us \"Mommie Dearest.\" The world will never be able to repay you for your kindness. Grade: F or A+ (depending on your perspective and level of sobriety)",
         "There is no doubt that Christina Crawford's scathing 1978 memoirs did much initial harm to her late mother's reputation. The subsequent 1981 film has eclipsed even the bestselling book to become the standard by which the real-life Joan is judged. However, I'm inclined to believe that those who dismiss Joan today as a psychotic harpy and nothing more never even saw the film version of \"Mommie Dearest,\" and only heard secondhand reports of the most infamous scene (\"No...wire...hangers!\"). Most tellingly, Christina Crawford reportedly hated the film version of her book, and wailed upon seeing it, \"They turned it into a Joan Crawford movie!\" She's right. With the exception of the two most graphic scenes (\"No wire hangers\" and the choking scene), Joan's \"abuse\" of Christina is not all that much different from what passed as \"discipline\" in those days--just ask your parents or grandparents--and despite Faye Dunaway's full-throttle acting, Joan always somehow comes off in a strangely sympathetic light. What we see is an insecure woman fighting for survival in an age-obsessed, male-dominated industry. Such scenes as Joan's heartless dismissal from MGM invite sympathy; while her snarling, veritable takeover of Pepsi Co. elicts cheers for her ballsiness and strength. Christina, on the other hand, is invariably depicted as either gratingly whiny or cardboard stiff. It's difficult to empathize with such an annoying character. \"Mommie Dearest\"'s grandest artistic achievement is through the impeccable art direction, which truly makes the audience believe they are watching a film unfold in the 1940's and 1950's. Its lasting legacy, however, is Faye Dunaway's career-ending performance, which, depending on your point of view, is either jaw-droppingly awful or unbelievably brilliant. Dunaway's acting \"choices\" are nothing if not idiosyncratic: clutching her bosom frantically as she cries, \"You...deliberately...embarass me in front of a REPORTER!\"; copying the real-life Crawford's facial expressions from the horror flick \"Strait-Jacket\" in the axe-wielding scene; and, most famously, her odd, cross-eyed pose that she strikes not once, or twice, but three times: holding baby Christina on the staircase, rubbing moisturizer on her elbows after hiding Christina's dolls, and following her wire hanger/cleansing powder attack. It is Dunaway's nostril-flaring, hair-pulling, bosom-clutching style that really sends this film into the camp stratosphere. On paper, such scenes as Joan swatting Christina on the butt for defying her orders, or Joan insisting that Christina finish her rare steak, would seem bland. In Dunaway's hands, they become something else altogether! Actually, Christina Crawford should thank Faye Dunaway; if not for her crazed, unforgettable portrayal, \"Mommie Dearest\" would have been just another trashy Hollywood memoir that eventually would've been forgotten (does anyone really care about B.D. Hyman's book about Bette Davis anymore?). And a film version without Dunaway would've been rightfully panned, forgotten, and relegated to cut-out bins at your local video emporium. Instead, Faye Dunaway has ensured its place in film immortality. It still stands alone among camp classics, but perhaps some re-evaluation of it (and of Joan Crawford herself) is due.",
         "Given the film's current cult movie status one is tempted to believe the 1981 MOMMIE DEAREST was a critical debacle and a box office fiasco. That is not really the case. It is true that critics generally considered the film a failure, but many of them admired certain elements of it; it is also true that box office fell below expectations, but it was not a box office disaster in the same sense as the 1980 HEAVEN'S GATE or the 1981 INCHON. It is also true, however, that audiences howled with laughter at the film when it debuted, and although leading lady Faye Dunaway received a number of critical accolades for her performance as Joan Crawford, she also received an equal number of devastating reviews--and it was these that caught the spotlight. It was a humiliating experience for an actress particularly noted for her perfectionism, and rumor has it that Dunaway feels the film ended her career as a major film star. Whatever the case, Dunaway quickly developed a strategic silence about the film that she has maintained for some two decades. Seen today, it is easy to identify the core problems of the film. The most obvious is the script, which is extremely inconsistent in quality and yet perversely consistent in a style that can only be described as soap opera hot-house to the nth degree. This is particularly true of the dialogue assigned to Dunaway. Infamous lines such as \"No More Wire Hangers Ever,\" \"Tina! Bring Me The Axe,\" and \"I'm Not Mad At You, I'm Mad At The Dirt\" have become a staple of every drag queen from Maine to California. But the ultimate disaster here is director Frank Perry. Joan Crawford was a larger-than-life personality; the role is written to reflect this; Dunaway plays the role as it was written. But it would seem Perry sought to heighten the effect: the rest of the cast is extremely, extremely restrained. This must have seemed like a good idea in theory, but it proves a terrible mistake in actual fact. No matter what Dunaway does with it, she can NEVER seem less than wildly overwrought in comparison to the rest of the cast, and the effect is very peculiar indeed. The designs and the cinematography also clash in an incredibly bizarre way. There is absolutely no doubt that everything about the film is exactingly accurate: that is indeed the look of the period, right down to the very last detail. But the photography is extremely flat, and you are constantly aware that the sets are indeed movie sets, the costumes are movie costumes, and so on. Yes, it is all beautifully rendered, but you can't buy into it as anything real. The Hollywood Royalty Edition DVD edition offers a good but by no means flawless print of the film and several bonuses. It is unfortunate that they are not particularly illuminating. While director John Water's commentary is enjoyable, he approaches the film only as a fan. Even so, Water does make several telling points: many of the things that Crawford does which seem so odd (bathing the face in ice, for example) are actually commonplace cosmetic necessities for movie stars; many of the things the film treats as abuse were, although carried to wild extremes in the story, typical of child-rearing practices of the 1940s and 1950s. There are also three short documentaries featuring a number of cast members, most notably Diana Scarwid; these are actually entertaining for the fact that those who appear still seem to regard the film as \"a good movie.\" The only really significant interview is with Lypsinka, an artist who has driven Crawford impersonations to the level of wicked satire and high art, and who offers a number of interesting personal insights into the iconography involved. Like the film itself, the bonus package has two great failures. The first is that Faye Dunaway does not appear in interview or commentary; it would be very interesting to have her own take on the film, its failures, and its afterlife. Given her sentiment, it is an understandable non-involvement; less understandable, however, that there is not so much as a potted biography of the actress--or indeed of any member of the cast, for there are no written notes of any kind. The second great failure of the bonus package is that it contains no factual information on either Joan or Christina Crawford. There is no indication here that those who knew both women are sharply divided over the accuracy of the portraits both here and in the book by Christina Crawford from which the film is drawn. A number of people, including actresses Betty Hutton and June Allyson, supported Christina Crawford's accounts, but an equal number, including actress Myrna Loy and Christina's younger siblings, flatly stated that Christina's accusations were largely fictitious. When all is said and done, and in spite of performances and moments that are actually extremely good in isolation, MOMMIE DEAREST is a film that falls under the \"so bad it's good\" category of cult films. While I am taken aback by the bizarre nature of the movie, I personally find the amusement involved almost as dark as the movie's plot; it is not among my cult film favorites. Even so, I can understand the appeal it has for others, and I give it five stars on that basis. GFT, Amazon Reviewer",
         "Indisputable classic of the highest order, 'Mommie Dearest' just SCREAMS cult hit every chance it gets, and just about ruined Faye Dunaway's reputation in the process. Mind you, there's nothing WRONG with Dunaway's performance, as a matter of fact, it's really good, but what's so good about it is how she plays every scene with fearless abandon, whether it's the wirehanger scene, the departure from MGM or chokeslamming Christina through a glass table, Dunaway gives 100% percent! And you should too! The first half is MUCH more frenetic then the 2nd half (aka young Christina vs Old) and the first part has all the best bits, but not to say the 2nd part is good too, it really starts to mellow out and (gasp) you start to feel SOME compassion to the old broad. Diana Scarwid is good too, although her playing what looks to be a 13 year old girl looks a bit too much. This wasn't my first time at this rodeo (I'd seen this before) and I enjoyed it as much as I had the first time!",
         "Oh Lord, Here it comes..... This is the big one. Never before has there been (and probably never will there be again) a camp monstrosity as huge as this. An over-the-top \"true story\" about Christina Crawford being adopted, raised and tormented by the legendary film star Joan Crawford, the film is an amazing exercise in excess. Virtually every line in the film is a quotable hoot (and legions of people can almost recite the script!) It is an overabundance of comedic riches. It's almost impossible to pick a favorite scene. First, though it is likely that certain aspects of this film have a seed of truth, there is no way that this is an authentic film biography.......NO WAY. So, while a few incidents are loosely derived from fact, most of it is guilt-free hilarity. Christina's book was striking, but contained nothing as wild and vicious as this film presents. And it's entirely probable that some of Christina's memories were exaggerated by childhood perspective (although there's no denying that her mother was an obsessive, neurotic, steamroller of a woman.) Even Tina explained, in her book, certain aspects of the bad behavior which shed some light on Joan's actions. None of that is presented here. For example, the infamous rare meat scene...the film doesn't disclose that Joan paid high black market prices for the beef (during wartime rationing) and was appalled that Tina turned her nose up at it and wasted it. Also, the violent night raid scene is actually a compilation of two different occasions, etc.... The film tries to maximize and sensationalize everything and over-do everything to the point where it turns comic. Dunaway (who has, herself, described her mesmerizing and ferocious performance as \"Kabuki\") is beyond fascinating to watch. She imbues the role with an intense, stunning magnetism which blows everyone else off the screen. It's amazing that the sets were left intact! Despite an explosive, unforgettable performance, Faye actually looks almost nothing like the real Joan Crawford. Her eyes are not nearly large enough and nothing is done to make them appear so, her eyebrows are ridiculous, her chest is not as pronounced as Joan made hers and her hair is almost never the way the real Joan wore it! And both women have HIGHLY unique voices, but which are not alike at all. Still, she radiates all the necessary star quality for the role. Anne Bancroft would have LOOKED the part more, but who knows what the film would have been like? Better? Duller? It certainly could not have been wilder! Highlights of the Faye Dunaway circus act include: the legendary cold cream-faced night raid with the iconic screech, \"No Wire Hangers!\", her tirade with the scissors when she catches Tina mocking her, her showdown with the boarding school principal, the resultant wrestling match with Tina back home and the magnificent face-off with the Pepsi Board of Directors. It would be impossible to list the many quotes which make this film required viewing (only the surface has been scratched in the Memorable Quotes section.) \"I fought worse monsters than you for years in Hollywood. I know how to win the hard way\" immediately followed by \"Don't F*CK with me fellas!! This ain't my first time at the rodeo\", isn't a bad start. Too hilarious! Young Hobel really holds her own as Tina and though Scarwid is less successful as grown Tina, she still gets in a few good licks. In any case, the film has provided untold hours of enjoyment and allowed for some instant bonding whenever people start spouting off the hilarious lines. WHEN is someone going to adapt this into a stage show?!",
         "In Mommie Dearest, we watch Faye Dunaway portray Joan Crawford as portrayed in Crawford's adopted and later disinherited daughter Christina's (necessarily?) one-sided and tendentious memoir. That was less a story than a payback about growing up in a Hollywood hothouse with a headstrong and possibly unhinged star as mother. Where the precise balance lies between truth (obviously, some) and spite owing to being read out of the will is not, or no longer, the point. The point is what justice the movie does to the legendary Crawford - how accurately it reproduces her public façade and private dysfunction (where it's open to skepticism), and how well it evokes the way stars lived and were expected to live under the mid-20th-century studio system (where it fares well). The movie opens at 4 a.m., the wake-up call for a star operating under the punishing regimen that was then the norm when shooting was underway. Dunaway/Crawford scrubs and steams herself, then closes her pores by plunging her face into rubbing alcohol on the rocks. Then she steps into a limo idling in the dark, where she learns her lines and signs glossies for doting fans. Noblesse oblige, Southern California style. Crawford had been in movies since the last days of the silents (her first roles, uncredited or as Lucille LeSueur, were in 1925), and had since achieved a blue-and-ivory showplace in Brentwood, two ex-husbands, and entrée to the privileged circle of `Hollywood royalty'. All she wants to round out her life is a baby (or two); Steve Forrest plays an attorney and current paramour who helps her to acquire them, like a pair of occasional tables. The rest of the movie depicts the ambivalent - almost bipolar - relationship between Joan and Christina (the actual Crawford adopted four children, whom the script cuts to two - just one, really, for son Christopher is seen only a few times tethered to his bed and once again, at the fateful reading of the will). So the plot's main thrust is Christina vs. Joan, and the semi-psychotic episodes that made the movie a cult/camp classic focus on this David and Goliath tug-of-war (`Tina, bring me the axe!' and `What's wire hangers doing in this closet?'). Several episodes, however, weren't witnessed by the skulking, passive-aggressive young Tina (Mara Hobel) or by the wilful and defiant teen-ager and woman she would become (Diana Scarwid, with a growling contralto that brings to mind Joan's adversary Mercedes McCambridge in Johnny Guitar). No little pitcher with big ears was nearby when Joan, in gingham apron and high-heeled white work shoes, scrubs the floor and bellows to the maid `I'm not mad at you, I'm mad at the dirt' or when, in one of Dunaway's rip-the-envelope-open scenes, emasculates the entire board of directors of Pepsico. Dunaway's impersonation of Crawford is in many ways unforgettably overripe (and her performance been received as both extraordinary and execrable; she herself is on record as regretting that she did the movie at all). Yet despite an at times almost uncanny resemblance provided by makeup and costume, we seldom forget it's Dunaway on camera. The specific Crawford qualities that gave her unparalleled longevity in Hollywood elude Dunaway - they aren't quite there. (Under all the honeyed diction there's little of the tough broad from east Texas.) Maybe Dunaway was right in doing Crawford her own way, rather than resorting to mimicry. But she - and the script - lose too much of her prototype. The script hews to known chronology in only the most slapdash way. There's a signpost at the beginning - Ice Follies of 1939 (why not the better known and just plain better The Women of the same year?) - and another at the time of her Academy-Award performance in Mildred Pierce (1945). But Crawford's subsequent vehicles, many of them hits, are ignored - and much of Mommie Dearest suggests she was a washed-up has-been. So it's never clear what juncture of her career she's reached - the late '40s and early '50s when she was still going strong, the Grand-Guignol '60s or, near the end, the '70s (Trog and TV)? It's a crucial lapse of basic narrative skills. But Mommie Dearest eschews many of those skills, seemingly by choice. No longer, as in the movies Crawford made famous, does scene unfold into scene, does motivation shape the story line. True, real life seldom observes the dramatic unities, but events here come so haphazardly that they're baffling. A triumph like winning the Oscar or the humiliation of being fired from MGM by Louis B. Mayer (Howard Da Silva in a memorable cameo) both lead straight into full-tilt rampages. Do they occur the same day, or weeks or months later? The time-line's too shaky to tell. Nor do the drastic mood-swings ever get explained (maybe they can't be explained), though Crawford's ever-present flask of vodka threads through the movie more as a colorful eccentricity than a central fact of her life. And in expressing this instability, Dunaway plucks not from Crawford's roles but from Gloria Swanson in the last, loony half of Sunset Blvd. Her eyes turn inward while fleeting emotions flicker across her face, hinting at something dreadful dredged up from her psyche. Yet Crawford held on to her star power in a ruthless industry for close to four decades, then snagged Pepsi-Cola CEO Alfred Steele and proved to be a savvy businesswoman. Nothing in Mommie Dearest accounts for those facts, which makes its accounting practices a little bit suspect. It's not a very good movie, but, thanks to Dunaway and her subject, mesmerizing nonetheless.",
         "\"Because I am NOT one of your FANS!\" Simply said, this is superb trash. Enjoyable b.s. Faye Dunaway lobbied hard for the role of Joan Crawford (Christina Crawford wanted Anne Bancroft) and she admirably sinks into the part with relish. I loved the opening montage of \"Joan\" preparing for her day early in the morning: scrubbing her hands and nails, numbing her face in ice cubes, leafing through a script in her car, getting made-up, and then whirling around in her chair and letting loose with a breathy, \"Let's go!\"... Sadly, Frank Perry's direction is awkward and unsure, cutting off some sequences before they're allowed to build and letting other scenes ramble on. The movie doesn't do justice to the riveting book by Joan's adopted daughter Christina, committing to film the book's highlights, the talked-about bits where Crawford freaked out, but skimping on the details. We learn absolutely nothing about Christina's many tormented years in an L.A. Catholic Boarding School (we see her check in and we see her check out). Joan's marriage to Pepsi czar Alfred Steele and her three other adopted kids are also given the short shrift. What we do get with \"Mommie Dearest\" is pure, unadulterated Faye. She acts up a storm and revels in these primal opportunities. It's one of the highlights of her spotty career. **1/2 from ****",
         "Every so often there comes a movie that is so over-the-top it actually saves itself from total oblivion by the sheer force of the laughably bad performances. This one was one of the first movies to sweep the Razzies, not that Faye Dunaway was thrilled to do so, having just won an Oscar in 1977 for her brutal performance in NETWORK, but the same way that little gold guy can be a blessing, it can be a curse. If not, look at Halle Berry's career choices after her win for MONSTER'S BALL. She may still re-bound; her career is still not at a point of no return and her acceptance speech at the Razzies may be the cold water splashing on her face that will take her back to the roles she's supposed to be doing, not the ones which will garner her the \"first black woman to...\" status. But not to digress. MOMMIE DEAREST was and is a camp classic de rigeur, right up there with VALLEY OF THE DOLLS. It is the CITIZEN KANE of camp. Producers must have decided that Christina Crawford's tell-all book about her mother -- in case you didn't already know it's Joan Crawford, movie star, Oscar winner, glamor girl, alleged child beater -- would make a brilliant film, and why? Well, for once, biopics featuring stars at their absolute worst weren't that common at the time this film was released, and certainly a book as sordid as this might make for a dark look into a respected actress, recently defunct. And so the casting of an actress who would embody those excesses to the hilt -- and wouldn't you know, the actress who stated years before she admired Crawford stepped into the task of turning herself to Joan from head to toe: not only physical, but in mannerisms, gowns, diction. Faye literally became \"Joan Crawford\" in image and style. The problem is, the script was so unabashedly exploitative and poorly written, her Crawford became a caricature, a cliché of poses that Crawford herself had created in many of her film credits. There is no real Joan Crawford here: only a repetition of lines that seem to be lifted almost directly from other movies. This Joan as a matter of fact seems to also live in her own time capsule. No mention of her 1920s or 1930s career, no mention of her marriage to Philip Barry, no mention of her later return to MGM to film TORCH SONG or her horror movie period, not even any back story of what happened behind sets in Mildred Pierce or the fact that she had to audition several times before getting that particular part (which won her her only Best Actress Oscar. No mention of her rivalry of Bette Davis (who? not in this film), either, and their one movie together, WHATEVER HAPPENED TO BABY JANE? This is all fantasy, seen even more clearly with the inclusion of a completely fictional lover (played awfully by Steve Forrest) and housekeeper Carol Anne (an equally bad Rutanya Alda) and not to mention the horrific performance of Diana Scarwid as Christina Crawford who has some sublimely bad scenes filled with beyond terrible lines. (It made me wonder, was the actual Christina there as a consultant, and if she was, how does one explain how moronic she becomes as the movie progresses to the point that we actually side with Joan?) Then again, this not being an autobiography nor a book of accounts of actors who knew and worked with Crawford but an amateur attempt at writing, huge inaccuracies were bound to happen. And to portray interminable, disjointed scenes of Crawford gone mad, brutalizing Christina for no other reason than being wigged out -- well, I'm not sure what the director is trying to say here. So if there's no real Crawford (older and younger), then this is all a mindless exercise in glossy excess. It's the TV biopic of the month that never was; its existence predates future biopics of similar awfulness (if not, check recent tell-all bio-pics that ABC, Lifetime, and other channels have been churning out lately on TV stars clawing each other's eyes out). It's also the precursor of trash TV: if anyone recalls DYNASTY or MELROSE PLACE or even Jerry Springer, all they have to do is rent this baby and enjoy the sublime scene when Dunaway tries to body slam and strangle Diana Scarwid (Christina as an adult) as a reporter watches in horror. Now that's entertainment!",
         "Mommie Dearest is such a fantastic anomaly that it almost feels blasphemous to critique it. Many people are confident in saying that it is a \"bad\" movie, or even that it's one of the \"worst\" ever made. I prefer to think of it as divine. It cannot be fully understood, only subjectively experienced. I do, however, agree with its critics that, no, it doesn't prioritize a coherent narrative structure. And no, it doesn't proffer class in its dialog, performances, or even its cinematography. I would like to label it as camp, but I can't. Mommie Dearest transcends camp. Faye Dunaway's priceless performance is truly mesmerizing. Somehow she conveys a character that is a perfect amalgamation of insanity, heroism, tragedy, tackiness, audacity, comedy, and utter strangeness. When I first saw this film I screamed when Dunaway's Crawford seduced her lover in the shower. Nothing has ever been so creepy and wrong. I shuddered when she eerily ascended her dramatic Hollywood staircase carrying her newly adopted baby. I cheered when she refused to be marginalized out of her rightful engagement as CEO of Pepsi Cola. And when she chopped up her garden in the middle of the night, wearing an evening gown. And when she mercilessly out-swam her six year old daughter in the pool race. I cheered a lot during this movie actually. And I have found, upon repeat viewings, that Mommie Dearest never fails to provoke such a clamorous succession of reactions. It may be low art. But it is brilliant just the same. I guess my review can be summed up as follows: there are people who get it and people who don't. Those who don't tend to say it's unsophisticated, trashy, and wasteful of money, talent, and time. Sadly, those who do get it must frequently disclaim their enthusiasm by saying things like, \"I know it's a really bad movie, but\u0085\" Even Faye Dunaway, so I've heard, takes little pride in the critically panned, allegedly career ruinous, Razzie-winning work. Which is too bad since there really is so much to appreciate about it. Like the fact that it was based on Christina Crawford's slanderous tell-all, but ends up making Joan look kind of sympathetic and \"Tina\" look like a petulant jerk (ha). And after all, there are too few movies that have provided so much fun to so many people.",
         "Some of the behavior of the real Joan Crawford (Lucille LeSueur) was symptomatic of what we nowadays refer to as obsessive-compulsive disorder (OCD), a mindset that fixates on ultra-cleanliness and perfection. Such bizarre behavior as needlessly scrubbing clean floors and clean hands helps reduce one's fears and anxieties. Over-reaction to minor problems is one result. There's a tendency to expect oneself and others to be perfect. If what is being judged is not perfect, then the OCD mindset perceives it to be the opposite of perfection; that is, ruin. There's no in-between. Character behavior that is weird to begin with, combined with poor film direction, and an exaggerated, over-the-top performance by Faye Dunaway results in plot sequences that are campy and outlandish, thus robbing the story of subtle truths that may be buried under all that bombast. Excise the rose garden sequence, the wire-hangers/bathroom cleaning sequence, and several other embarrassing parts, and we \"might\" have a film that could be taken seriously. But, of course, then we couldn't laugh at it. And I do think the film, as is, is good for some laughs. Having a film protagonist who is such a blatant villain with no character arc is unusual, and helps make this film so bizarre. At least Godzilla, and the great white shark in Jaws, could be forgiven their cruelty, given their inability to be human. Apart from the bizarre main character in \"Mommie Dearest\", the film's plot does not flow well. The dialogue also is bizarre and lacks subtext. \"Helga, I'm not mad at you, I'm mad at the dirt\", says Joan as she spots dirt hiding under a potted plant. And as an out-of-control, angry Joan proceeds to punish a tree in her rose garden, in frustration with Louis B. Mayer, she yells to Christina: \"Bring me the ax\". How can the viewer not laugh? Lucille LeSueur undoubtedly was an ambitious woman, a hard worker, and had both genuine talent and a healthy ego. But her human relations with others, especially her adopted daughter, were disasters. We may never know the extent to which \"Mommie Dearest\" mirrors the real Joan Crawford, or is merely a gross exaggeration by a vengeful \"heirless\" heir. Regardless, Joan Crawford left us some terrific films. She had a memorable, unique personality, and will remain a stunning Hollywood legend for as long as Hollywood exists."
      ],
      "genres": [
         "Biography",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Based on the book about Joan Crawford, one of the great Hollywood actresses of our time, written by her adopted daughter Christina Crawford. Joan decides to adopt children of her own to fill a void in her life. Yet, her problems with alcohol, men, and the pressures of show business get in the way of her personal life, turning her into a mentally abusive wreck seen through the eyes of Christina and her brother Christopher, who unwillingly bore the burden of life that was unseen behind the closed doors of \"The Most Beautiful House in Brentwood.\"",
         "It is 1939, Joan Crawford is one of Hollywood's biggest stars. But she tells boyfriend lawyer Greg Savitt that she isn't content living in her Brentwood mansion with just her devoted secretary Carol Ann and housekeeper Helga. Greg arranges for Joan to adopt a baby girl. Joan names her Christina and promises \"to give her all the things I never had.\" But Joan is obsessed with perfection, and Christina finds it impossible to live up to her mother's standards.",
         "Mommie Dearest, best selling memoir, turned motion picture, depicts the abusive and traumatic adoptive upbringing of Christina Crawford at the hands of her mother...screen queen Joan Crawford."
      ],
      "budget": 5000000
   },
   "movielensId": 2639,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-09-18",
      "dvdReleaseDate": "2001-07-17",
      "directors": ["Frank Perry"],
      "runtime": 129,
      "movieId": 2639,
      "title": "Mommie Dearest",
      "mpaa": "PG",
      "actors": [
         "Faye Dunaway",
         "Diana Scarwid",
         "Steve Forrest",
         "Howard Da Silva",
         "Mara Hobel",
         "Harry Goz",
         "Michael Edwards",
         "Jocelyn Brando",
         "Priscilla Pointer",
         "Joe Abdullah",
         "Gary Allen",
         "Selma Archerd",
         "Adrian Aron",
         "Xander Berkeley"
      ],
      "imdbMovieId": "0082766",
      "originalTitle": "Mommie Dearest",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["HfFS0vrB8zY"],
      "plotSummary": "In this biographical film, glamorous yet lonely star Joan Crawford takes in two orphans, and at first their unconventional family seems happy. But after Joan's attempts at romantic fulfillment go sour and she is fired from her contract with MGM studios, her callous and abusive behavior towards her daughter Christina becomes even more pronounced. Christina leaves home and takes her first acting role, only to find her mother's presence still overshadowing her.",
      "tmdbMovieId": 15660,
      "avgRating": 3.15111,
      "releaseYear": "1981",
      "numRatings": 1307,
      "posterPath": "/vPwWgX1SzLRm6Tqhj9102Mg5kkz.jpg"
   }
}