{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0109731",
      "video": false,
      "title": "L'Enfer",
      "recommendations": [
         1998,
         27102,
         43000,
         112822,
         80476,
         8286,
         26152,
         64310,
         76200,
         49462,
         42131,
         42463,
         47840,
         230528,
         48346,
         1785,
         39967,
         41464,
         146522,
         76772
      ],
      "backdrop_path": "/kIISaLncJM7hDJWJZHmpZ7sxai3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nelly",
               "gender": 0,
               "credit_id": "52fe47569251416c75095bc1",
               "name": "Emmanuelle Béart",
               "profile_path": "/dICNGDe2Sgz73Febl0TJZpEKO9f.jpg",
               "id": 4885,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Paul Prieur",
               "gender": 0,
               "credit_id": "52fe47569251416c75095bc5",
               "name": "François Cluzet",
               "profile_path": "/rE7utJuaZiR9NLjxmtQJZET0q4d.jpg",
               "id": 33161,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Marylin",
               "gender": 1,
               "credit_id": "52fe47569251416c75095bdb",
               "name": "Nathalie Cardone",
               "profile_path": "/aOBX8soHhv0AQvSAKeixtJWKH3f.jpg",
               "id": 55926,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Doctor Arnoux",
               "gender": 2,
               "credit_id": "52fe47569251416c75095bdf",
               "name": "André Wilms",
               "profile_path": "/88PXqnQjPxG0MDjlcnl9YlrSyND.jpg",
               "id": 20853,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Martineau",
               "gender": 2,
               "credit_id": "52fe47569251416c75095be3",
               "name": "Marc Lavoine",
               "profile_path": "/vGrhvHW4X6p9YckFGShigzeSfd3.jpg",
               "id": 47336,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mme Vernon",
               "gender": 1,
               "credit_id": "52fe47569251416c75095be7",
               "name": "Christiane Minazzoli",
               "profile_path": "/dSywirQyiFdGaUxVp61OsIK8Dhv.jpg",
               "id": 28149,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Mme Chabert",
               "gender": 1,
               "credit_id": "52fe47569251416c75095beb",
               "name": "Dora Doll",
               "profile_path": "/uEosUxO9KXng6ru4l2owh0HuILh.jpg",
               "id": 25166,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Duhamel",
               "gender": 0,
               "credit_id": "52fe47569251416c75095bef",
               "name": "Mario David",
               "profile_path": "/qOg1Wx5p6GRGnTulRxv6UZ81ilA.jpg",
               "id": 28189,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "M. Vernon",
               "gender": 2,
               "credit_id": "52fe47569251416c75095bf3",
               "name": "Jean-Pierre Cassel",
               "profile_path": "/yWIAIvRdx0omV9ZOUwLINzHKois.jpg",
               "id": 19162,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095bcb",
               "name": "Claude Chabrol",
               "profile_path": "/tsG0YNUREk7fGVaDKpwvuFBi59O.jpg",
               "id": 19069,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095bd1",
               "name": "Claude Chabrol",
               "profile_path": "/tsG0YNUREk7fGVaDKpwvuFBi59O.jpg",
               "id": 19069,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe47569251416c75095bd7",
               "name": "José-André Lacour",
               "profile_path": null,
               "id": 177276,
               "department": "Crew",
               "job": "Additional Dialogue"
            },
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095bf9",
               "name": "Matthieu Chabrol",
               "profile_path": null,
               "id": 19167,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47569251416c75095bff",
               "name": "Henri-Georges Clouzot",
               "profile_path": "/nhwGnyQSoC3HhCM6SSACdZnysAK.jpg",
               "id": 2559,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 3.031854,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 17961,
      "vote_count": 31,
      "budget": 10000000,
      "overview": "Paul, an irritable and stressed-out hotel manager, begins to gradually develop paranoid delusions about his wife's infidelity...",
      "similar": [],
      "original_title": "L'Enfer",
      "runtime": 100,
      "poster_path": "/9ACPvC1XFRta8SXA816C0my32TG.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "MK2 Productions",
         "id": 6274,
         "origin_country": "FR"
      }],
      "release_date": "1994-02-16",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Claude Chabrol"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Claude Chabrol",
         "Henri-Georges Clouzot"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0109731/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2OTI1MDYzM15BMl5BanBnXkFtZTcwMjk3MzUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Emmanuelle Béart, François Cluzet, Nathalie Cardone | See full cast and crew »"],
      "reviews": [
         "Among all the directors labelled \"nouvelle vague\",Claude Chabrol was arguably the one who had more affinities with the precedent generation so despised by a lot of his sixties colleagues.And the generation before Chabrol included the genius Henri-George Clouzot.So,to film \"les diaboliques\"'s director lost screenplay,Chabrol was ideal.Both he and Clouzot mix detective stories,social satire and psychological studies. \"L'enfer\" might be one of Chabrol's finest achievements.François Cluzet,in a lifetime performance,portrays a jealous man-recalling Bunuel's hero in \"El'(1952)-,but his jealousy verges on madness.Little by little,with small touches,we see this maleficent obsession grow like a cancer,destroying everything,his wife's sincere love(well played by Emmanuelle Béart),his personality,his job.And see how Chabrol masters space.At the beginning,the action takes place in a wonderful lake setting.Then we do not get out of the hotel owned by Cluzet,with its dangerous corridors .And in the final sequences ,the director confines his two characters to a doctor office or their bedroom. Cluzet's madness and its inexorable progression are masterfully shown too.First,only some gestures,some voice inflexions.Then he begins to follow her everywhere .Then come the hallucinations:the amateur movie projected onto a small screen in the restaurant is the film's apex and should be part of a Chabrol anthology.Interior voices obsess the unfortunate hero,and every time he looks himself in a mirror,he sees an irrational world,this world he lives in,this world he believes in.No longer able to communicate with the normal one,he forces the other ones (his wife being first in line)to enter his.And we are not sure,at the end of the movie,that Béart is not on the other side of the mirror too. Two private jokes: In the first sequence,Béart puts her hair in braids,and she resembles Vera Clouzot in \"les diaboliques\".When the young couple comes back to the restaurant after the wedding,the little accordion tune \"les couleurs du temps\" that you hear was written by Guy Béart,Emmanuelle's father a long time ago. NB.Clouzot's version,which he began to film circa 1963,featured Romy Schneider and Serge Reggiani.(although the film was never completed,it has a page on IMDb)",
         "Reality, or fantasy is the immediate question posed in Claude Chabrol's L'Enfer. The man who carries the mantel the 'French Hitchcock' Chabrol delivers a taut, bare to the bones thriller. When husband Paul (Francois Cluzet) begins to believe his beautiful, flirtatious wife Nelly (Emmanuelle Beart) is fooling around, his psychological demise is quick, and intense. Chabrol brings us the story primarily from Paul's point of view, leaving many of the ambiguities, as well as the uncertainties of this tale to our own imagination. From a script of Henri-Georges Clouzot (Diabolique, Wages of Fear) written in 1964, Chabrol updates the original (Clouzot never finished his version due to failing health, he died in 1977) giving it the contemporary setting and dialogue, but maintaining a style of presentation consistent with the thrillers of that era. I love this early exchange: Nelly: \"You're following me, Paul.\" Paul: \"Why would I, is there any reason?\" Nelly: \"No, but if you keep it up, there will be.\" Emmanuelle Beart shows why she is one of the world's great stars. American audiences have yet to have the best of Beart, who's English speaking debut (Mission:Impossible) seemed uneven, almost clumsy. But here she delivers on all cylinders: a beautiful seductress. Calculating? Unfaithful? We'll see. Highly recommended.",
         "Quite interesting film on obsession (an obsession of jealousy, in the specific case) and on the observation that hell is man-made. I liked the very solar performance of Emmanuelle Béart, while I expected something more from François Cluzet. In order to frame the film properly, however, one must consider that the original script is from 1964 and that Chabrol went to a certain length not to let us lose sight of this fact: the film is shot in a very 60's technicolor; one of the hotel guests uses a camera rather than a video-camera, and the scene he shoots have an unmistakably 60's flavor; the water-ski scene (the key moment of the whole film) has a 60's pace and framing,... We are obviously supposed to read the film in a 1960's perspective. And, considering the political climate in France in the 60's, and the nature of Paul Prieur occupation (he is a hotel owner, therefore a businessman), I find it impossible not to read this film as a statement of the impossibility of the bourgeois ideal of happiness. The bourgeois values make people equipped to strive for more, but don't give them the emotional tools to deal with their life once they are \"arrived.\" The feeling that there must be something more, and that this can't be the perfection of life is too easily translated in the feeling that there *is* something wrong (a cheating wife: the greatest shame for the latin male), and in the creation of a personal hell. It is very significant, I think, that the film was released at the dawn of the \"new economy\" which, even more that the traditional bourgeois values, leads people to a life of continuous movement, and makes them emotionally unprepared to deal with being finally arrived.",
         "Paul, an owner of a lakeside hotel and his naturally flirtatious and beautiful wife, Nelly seems to have it all, yet beneath the rosy facade there lurks a rotting jealousy, eating away inside Paul's unbalanced mind. This is the basic premise of Claude Chabrol's adaptation of Henri-Georges Clouzot 1964 script. The film hinges on two interrelated questions. Was Nell really unfaithful with many men, or was it all in Paul's unbalanced mind? Chabrol projects these anxieties from Paul's point of view,leaving the viewer to judge if there is any substance to Paul's jealousy. The film is compelling and the acting is excellent, but we never know the real, underlying cause of Paul's frightening descent to madness because Charbol complacently skips through the early years of their marriage within the first six minutes. yet all of the sudden Paul is talking with an inner voice in his head, out of nowhere. This was one of the film's biggest weaknesses and perhaps Clouzot's original story was not \"psychological\" enough for Chabrol to work through in his usual, thorough fashion.Moreover, we also never know if Nelly really was unfaithful, thus compounding the ambiguity of Paul's jealousy. Sometimes the direction is deliberately vague in projecting Paul's point of view, blurring the distinction between reality and fantasy. Moreover, the 1960s feel of the script is retained by Chabrol in his modern-day remaking of the values of that era in the early 1990s. as a result, L'enfer is strangely old-fashioned in its portrayal of women and men. The sets and costumes feel anachronistic, esp Nelly and her flirty friend. Only Paul and his doctor seem to exist in the early 1990s. The open-ended existentialist non-ending,was the only way out for Chabrol and Cluzot, but perhaps by negating the climax, Chabrol did himself a disservice in not resolving the film's many ambiguities. But perhaps that's what Clouzot's intention was. All in all, the film is a celluloid embodiment of Satrte's famous line \"Hell is other people\".",
         "Surprisingly good, in fact rather splendid late Chabrol. We start with a young couple full of love and optimism as they bounce about running their hotel, bringing up baby and making eyes at each other. The wife seems to naturally do this semi flirting semi friendly stuff with everyone and gradually her husband begins to become jealous. We are never 100% certain but what at first seems six of one and half a dozen of the other descends into the 'hell' of the title as the green eyed monster truly comes to fruition. Initially delightful, this movie gets as dark as it possibly could and we are gripped, even perhaps more than with a Hitchcock as the terrible finale awaits.",
         "If this film represents a faithful adherence to Clouzot's original script, one would have to say that the story may be regarded as the absolute apex/exemplar of Clouzot's understanding of psychology. At the same time, L'Enfer is absolutely a Claude Chabrol film, and the fact that it rests comfortably in either canon attests to the lasting parallels between the two masters. As with all of Chabrol's foremost creations, this is incisive social commentary masquerading under the banal tag of \"psychological thriller\". Though the film can be enjoyed without any deeper engagement with or meditation on its themes of Othello-esquire obsession/jealousy, I think some thought will reveal it to be a far more rewarding film than a superficial viewing might suggest. Situating/contextualizing the film in Chabrol's vast corpus of work, one finds in \"L'Enfer\" another nightmarish journey into the hazards of bourgeois sterility. Though one might say that the work is naturalistic in some respects (the intense violence that simmers beneath the genteel exterior is revealed in his disdainful disparagement of the neighboring competition), that the overreaching, emotionally volatile and profoundly sensitive husband is particularly prone to this type of neurosis, the telling proclamation of \"sans fin\" that closes the film suggests that the narrative is not one of isolated particulars, but a general affliction, a self-perpetuating tragedy engendered by flawed social mechanisms. Throughout his career, Chabrol has been especially critical of the life-denying entropy and suffocating claustrophobia of bourgeois marriage, a plight where the insatiably voracious woman feels her haplessness and subordination most acutely. This, in some respects, might be his finest evaluation of marriage and erotic love in general. The tensions explored throughout the film are far from novel, again we bear witness to the irresolvable Romantic preoccupation, the desire to possess and identify with a subjective other. Again, as with \"Les Bonnes Femmes\", we see the carnivorous, destructive male principle, eager to subdue, asphyxiate, smother and ultimately devour irrepressible femininity. Yet lest we distance ourselves from Paul's evident psychosis, Chabrol implicates marriage as an institution endorsed by society at large. Note Paul's perverse, masochistic pleasure in fabricating these outlandish fantasies, particularly the wild reverie of Emanuelle Beart entertaining the entire hotel in the attic. Is this the only way to preserve erotic love in the nauseating ennui of marriage, to continually reinvent the Other and, through wild imaginings, make him/her a stranger so as to escape the concreteness of conjugal reality? On another level, the film might be read as an Adlerian representation of modern neurosis, of a nervous man who is inadequately equipped for the rigours of social expectation, whose overreaching demand for absolute order and unity invariably drive him to dementia and a flight from reality. Chimeras of success and masculine authority elude him, undermined by personal insecurities and a willful, independent wife. How then, does he compensate for his lack of control? Refuge in the sadistic alternate reality that he manufactures throughout the movie. Technically, this movie is almost immaculate, featuring outstanding performances (Emmanuelle Beart is a force of nature) and repeated viewings affirm that it is a movie of great understanding. I'm not sure if this review made any sort of sense at all, but at the end of the day all I can do is urge you to immerse yourself in \"L'Enfer\".",
         "I still think of L'Enfer as a great film, rife with psychological torment and anguish. It may not be Chabrol's best (as others have pointed out), but it is nonetheless very good. This is in my opinion also one of Beart's best performances. The cinematography is terrific, with wonderful contrasts between the idyllic, sun-drenched locale and the dark, tormented and claustrophobic emotional dimension. The plot is somewhat predictable, but the \"meat\" of the movie is on the psychological development of the main characters, not on \"what happens next\". Overall, I highly recommend this film to any fan of cinema.",
         "The owner of the Hotel Du Lac, Paul Prieur (François Cluzet), gets married with the beautiful and sexy Nelly (Emmanuelle Béart) and they have a boy. Nelly loves Paul and is pleasant with guests, and the insecure Paul feels that she is a woman out of his league. When Nelly spends some time with the handsome guest Martineau (Marc Lavoine), Paul follows her and becomes paranoid and delusional believing that she is unfaithful to him. His increasing obsession turns into madness that ends in an announced tragedy. \"L'Enfer\" is a dramatic tale of insecurity, paranoia and madness by Claude Chabrol, with the story of a man that lives in hell with his jealousy and brings this hell to the life of his wife. Last time that I had seen this film was on 23 April 2000 and the story is timeless and has not aged. The tragic conclusion is predictable and my only remark is the attitude of Doctor Arnoux, who should have foreseen that the safety of Nelly was in danger with the insane Paul. Emmanuelle Béart is wonderfully cast to justify the obsession of Paul. My vote is eight. Title (Brazil): \"Ciúme - O Inferno do Amor Possessivo\" (\"Jealousy \u0096 The Hell of the Possessive Love\")",
         "Chabrol will always be Chabrol - sometimes less, rarely if ever more (maybe in La Femme Infidele...). But he's Chabrol, God bless him: love, lakes, bourgeoisie, jealousy, sex, meals, bonhomie, kids who appear and disappear, murderous thoughts, weird surrealism right before the end. You can set your watch by him. Emmanuel Beart is unbelievably sexy. And the film is a perfect illustration of some (dimly understood by me) Lacanian theories: sexual intercourse's dream of fusion is impossible, for example. Having possessed the ideal object, Cluzet knows that, in fact, one possesses nothing. Everything that makes Beart alluring also makes her dangerous in that she freely chooses...whatever she freely chooses. Freely choosing fidelity means that any moment you can freely choose infidelity. So a guy just can't win. That's why DeCordova in Bunuel's El (adroitly cited by another one of the readers here) pulls out the needle and thread. This film has none of the humor and acuity of Bunuel's neglected masterpiece. But it's Chabrol, and he's doing his thing. That ain't nothing...As a study of a man's descent from jealousy into madness, however, the film is powerful and well made but not super subtle.",
         "I just finished watching the stunning film L'Enfer and I couldn't wait to review it. The movie was written by one of my favorite French writers, Clouzot, so it was bound to be a good movie. Well, not exactly. In fact it was not just good but exceptional and is one of the better films I have seen in some time. With my background as a psychotherapist, I have to say that it was a brilliant psychological study of madness. All too often, films don't get it right--here, it's perfect. The story is about a jealous husband. At first, he shows signs of anxiety--trouble sleeping, irritability and distractability. Later, this slowly evolves to include paranoia, as he begins to suspect his lovely wife of infidelity. Well, at this point it MIGHT be that the husband is mildly mentally ill or perhaps he just has a very active imagination. However, very slowly the paranoia becomes more and more delusional and it's obvious this is no mild illness. In fact, it becomes increasingly obvious he is exhibiting strong symptoms of paranoid schizophrenia. However, his wife refuses to believe--thinking instead that he is just a jerk and not potentially dangerous. However, he ultimately becomes violent and accusatory--and the violence continues to escalate. So far, this is a magnificent portrait of mental illness, as this SLOWLY developed and evolved. Unfortunately, one inexplicable part of the movie keeps it from getting a score of 10. When he ultimately beats and rapes her, she goes to the doctor. When the husband is confronted by the doctor, the husband VERY QUICKLY and CONVINCINGLY decompensates. It is obvious to anyone with an IQ greater than 14 that he is VERY dangerous and MUST be hospitalized as soon as possible to protect himself and others. BUT, the doctor sends them home--to come back in the morning!!! While it is VERY clever of the doctor to convince the paranoid husband the it is the wife who will be hospitalized, I can't imagine any doctor not calling for an immediate ambulance or the police to apprehend and forcibly commit him. Despite this flaw, what happens next and the absolute uncertainty of the ending is remarkable--you really aren't sure exactly what happened because it is all shown through the eyes of the husband and his own reality ultimately disintegrates and he is uncertain exactly what has occurred. This blending of paranoid schizophrenia with signs of disorganized schizophrenia was brilliant, as some people diagnosed with paranoid schizophrenia later become MUCH more more fragmented and irrational. A WONDERFUL JOB BY THE WRITER, DIRECTOR and the MARVELOUS ACTOR PLAYING THE TROUBLED HUSBAND--WOW, what a great and convincing job! Too bad there was that little slip-up with the way the doctor behaved."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "MK2 Productions",
         "CED Productions",
         "France 3 Cinéma"
      ],
      "summaries": [
         "Paul, an irritable and stressed-out hotel manager, begins to gradually develop paranoid delusions about his wife's infidelity. As he succumbs to green-eyed jealousy, his life starts to crumble. Each step on his downward spiral to madness seems to accelerate, driving him further along the path to a personal hell. Finally, the former shell of his personality cracks completely, with tragic consequences.",
         "The owner of the Hotel Du Lac, Paul Prieur, gets married with the beautiful and sexy Nelly and they have a boy. Nelly loves him and is pleasant with guests, and the insecure Paul feels that she is a woman out of his league. When Nelly spends some time with the handsome guest Martineau, Paul follows her and becomes paranoid and delusional believing that she is unfaithful to him. His increasing obsession turns into madness that ends in a tragedy."
      ],
      "budget": 0
   },
   "movielensId": 264,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1994-02-16",
      "dvdReleaseDate": "1998-06-10",
      "directors": ["Claude Chabrol"],
      "runtime": 100,
      "movieId": 264,
      "title": "L'Enfer",
      "mpaa": null,
      "actors": [
         "Emmanuelle Béart",
         "François Cluzet",
         "Nathalie Cardone",
         "André Wilms",
         "Marc Lavoine",
         "Christiane Minazzoli",
         "Dora Doll",
         "Mario David",
         "Jean-Pierre Cassel"
      ],
      "imdbMovieId": "0109731",
      "originalTitle": "L'Enfer",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Paul, an irritable and stressed-out hotel manager, begins to gradually develop paranoid delusions about his wife's infidelity...",
      "tmdbMovieId": 17961,
      "avgRating": 3.32471,
      "releaseYear": "1994",
      "numRatings": 174,
      "posterPath": "/9ACPvC1XFRta8SXA816C0my32TG.jpg"
   }
}