{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "giant spider",
            "id": 3888
         },
         {
            "name": "deformation",
            "id": 8379
         },
         {
            "name": "laboratory",
            "id": 10124
         },
         {
            "name": "giant monster",
            "id": 11100
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "desert",
            "id": 18034
         },
         {
            "name": "napalm",
            "id": 177275
         },
         {
            "name": "animal horror",
            "id": 223059
         }
      ],
      "imdb_id": "tt0048696",
      "video": false,
      "title": "Tarantula",
      "recommendations": [
         40761,
         52196,
         43715,
         53949,
         28763,
         18990,
         29570,
         58997,
         36089,
         31682,
         30793,
         34593,
         3103,
         28650,
         35073,
         29959,
         41020,
         3077,
         11071,
         30137
      ],
      "backdrop_path": "/ccjSeVoh3ZPXoiFSkFmZZM1HmsC.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "540b5ff70e0a2633360000df",
         "content": "Can all mankind escape the terror of its dread embrace...\r\n\r\nProfessor Gerald Deemer has been working on a special nutrient that will help offset a predicted food shortage, the serum he has created escalates growth in his lab animals at an alarmingly quick rate. Deemer quickly loses control of the experiment and during a fight at his lab a fire breaks out and a Tarantula that is already 50 sizes bigger than it should be, escapes, and soon all species are on the menu!\r\n\r\nTarantula is a big personal fave of mine from this particular genre, so I make no apologies for my uncontrolled bias! The film opens with a facially malformed man running through the desert until he collapses, and from then on in we are treated to a story involving acromegaly (a disease that causes gigantism), and a gigantic tarantula eating everything that gets in its path, its pure sci-fi/horror hokum for sure. However, Tarantula has that knack of spinning the story with only minor glimpses of the spider until we are positively sensing the dread that is about to be unleashed. Using a real spider inserted onto the screened landscape, and then having it crawling over smartly moulded miniature sets, really adds to the creepy fun unfolding. Directed by genre hero Jack Arnold, and starring stoic actors like John Agar & Leo G Carroll, Tarantula is 80 minutes of pure genre entertainment. 8/10",
         "url": "https://www.themoviedb.org/review/540b5ff70e0a2633360000df"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 13,
               "character": "Dr. Matt Hastings",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaad",
               "name": "John Agar",
               "profile_path": "/9fKJvICRu2KS6Q70R7plPUkCkTY.jpg",
               "id": 103071,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Stephanie 'Steve' Clayton",
               "gender": 1,
               "credit_id": "52fe44d9c3a36847f80ada73",
               "name": "Mara Corday",
               "profile_path": "/63qDJTMIkVJPlS5huXjg9wba8Bx.jpg",
               "id": 56923,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Prof. Gerald Deemer",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80ada77",
               "name": "Leo G. Carroll",
               "profile_path": "/xTxzUMrwj00ZXa3iWOqP5w1xgO5.jpg",
               "id": 2642,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Sheriff Jack Andrews",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80ada7b",
               "name": "Nestor Paiva",
               "profile_path": "/9QB3l3jN6npImyMvCHKWTMd7H8Y.jpg",
               "id": 56924,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Joe Burch",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adaa9",
               "name": "Ross Elliott",
               "profile_path": "/tYEwSVPt29T6vd1lYNM3dRiehP0.jpg",
               "id": 112722,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Lt. John Nolan",
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80adab7",
               "name": "Edwin Rand",
               "profile_path": "/4y9mRpDutBMTMM04moO91KdlA8r.jpg",
               "id": 143453,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Dr. Townsend",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adabb",
               "name": "Raymond Bailey",
               "profile_path": "/f27gMhRJhKdC99Ti2cloU7P5fLs.jpg",
               "id": 5737,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Josh",
               "gender": 2,
               "credit_id": "56c7d9ad925141172f001251",
               "name": "Hank Patterson",
               "profile_path": "/zbBtW94jdZkNKJjSfpyMBw7N9sx.jpg",
               "id": 1213238,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Barney Russell",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adac3",
               "name": "Bert Holland",
               "profile_path": null,
               "id": 161452,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Andy Andersen",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adac7",
               "name": "Steve Darrell",
               "profile_path": "/kvLRjB508zaE11X5c2qncODz71R.jpg",
               "id": 109725,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Pilot",
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adacb",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80ada81",
               "name": "Robert M. Fresco",
               "profile_path": null,
               "id": 56926,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80ada87",
               "name": "Martin Berkeley",
               "profile_path": null,
               "id": 56927,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80ada8d",
               "name": "William Alland",
               "profile_path": "/5cnNirYmNRxXRtovuAnka8exirR.jpg",
               "id": 11030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80ada99",
               "name": "Herman Stein",
               "profile_path": null,
               "id": 56928,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80ada9f",
               "name": "George Robinson",
               "profile_path": null,
               "id": 29635,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d9c3a36847f80adaa5",
               "name": "William Morgan",
               "profile_path": null,
               "id": 56929,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d9c3a36847f80adab3",
               "name": "Jack Arnold",
               "profile_path": "/3iuVO7TDbAI4TpUmgNgZyrnj6ch.jpg",
               "id": 33883,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56e2de10c3a368701300317e",
               "name": "Alexander Golitzen",
               "profile_path": null,
               "id": 12346,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56e2de24c3a3687013003185",
               "name": "Alfred Sweeney",
               "profile_path": null,
               "id": 936638,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56e2de4ac3a368700500314e",
               "name": "Joseph Gershenson",
               "profile_path": null,
               "id": 342032,
               "department": "Sound",
               "job": "Music Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "56e2de63c3a368354600000b",
               "name": "Joan St. Oegger",
               "profile_path": null,
               "id": 29640,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56e2de74c3a368353e000008",
               "name": "Bud Westmore",
               "profile_path": null,
               "id": 14498,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.335236,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9077,
      "vote_count": 74,
      "budget": 0,
      "overview": "A lone-wolf scientist sequestered in a mansion near a small desert town arouses the suspicion of the town's doctor when his lab assistant is found dead from a case of acromegaly which took only four days to develop.  As the doctor investigates, aided by the scientist's new, and very female, assistant, they discover that, far worse, something much larger and hungrier than it ever should be,  is devouring local cattle - and humans - in increasingly large quantities.",
      "similar": [
         124905,
         1927,
         7191,
         9426,
         4961,
         11071,
         3035,
         9738,
         5876,
         135397,
         126889,
         588,
         336843,
         339967,
         384521,
         3034,
         929,
         39256,
         339530,
         46261
      ],
      "original_title": "Tarantula",
      "runtime": 80,
      "poster_path": "/gPjlVSys2CJP1aQKXnhj4kKDxrB.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
         "name": "Universal International Pictures",
         "id": 10330,
         "origin_country": ""
      }],
      "release_date": "1955-12-14",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "More terrifying than any horror known to man comes a creeping crawling monster whose towering fury no one can escape!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Jack Arnold"],
      "runtime": 80,
      "synopsis": "When a mysteriously deformed man, Eric Jacobs (Eddie Parker in an uncredited role), is found dead in the desert, Dr. Matt Hastings (John Agar), a family doctor in the tiny neighboring town of Desert Rock, is called in to examine the body. Jacobs, a research scientist, worked with Prof. Gerald Deemer (Leo G. Carroll), a reclusive scientist who's conducting mysterious experiments at an out of the way mansion near the town. Dr. Matt is baffled by the cause of Eric's death. His distorted features suggest acromegaly, a disorder of the pituitary gland, but since Eric was fine just days earlier, Matt can't understand why he would deteriorate so quickly. When Professor Deemer insists that it is acromegaly and refuses to authorize an autopsy, Matt is both annoyed and confused. The local Sheriff, Jack Andrews (Nestor Paiva) takes the Professor's side. Later, Deemer returns to his lab, where it's revealed he's working on creating a food nutrient to feed the world's increasing population. He has injected the nutrient into lab animals, which have grown at astonishing rates. A caged tarantula is several times normal size. Suddenly, Deemer's other assistant, Paul Lund (Eddie Parker in an uncredited role) stumbles into the lab, his face as hideously distorted as Jacobs'. Delirious, Paul attacks Deemer and busts up the lab, setting the tarantula loose. He also injects the unconscious Deemer with the nutrient, then dies as the lab begins to burn. Deemer awakes in time to put out the fire, then buries Paul's body without notifying authorities. The following day, beautiful Dr Stephanie \"Steve\" Clayton (Mara Corday) arrives in Desert Rock, having been hired by the late Jacobs. Matt gives her a ride to Deemer's, informing her of Jacobs' death. When they reach Deemer's house, the Professor pretends the damaged lab was an accident. Deemer explains how he is making the nutrient using the power of the atom to bind the solution. Stephanie becomes an able assistant to Deemer, helping him with his experiments. She also gets to know Matt, who shows her the town and desert scenery. Meanwhile, something odd is going on in the desert. Something unknown is devouring the horses, their skeletal remains found by local ranchers. Two human beings appear to have been devoured after an apparent car accident. Matt notices huge pools of a mysterious substance near the accident. After lab analysis, he discovers that it's insect venom û but in an enormous quantity. At the lab, Stephanie becomes concerned about Deemer, whose face is gradually becoming distorted, much like Jacobs and Paul. When Deemer finally confesses to Matt and Stephanie that Paul went on a rampage and released the tarantula, Matt becomes suspicious, making a connection to the recent phenomena. Meanwhile, the tarantula continues its rampage, killing two old prospectors in the desert. While studying in her bedroom that night, Stephanie doesn't see that the tarantula is approaching in the distance, visible from her bedroom window. Once the tarantula begins wrecking the house, a horrified Stephanie tries to save Deemer, who's convalescing in his room, his face now completely distorted. Unfortunately, the tarantula kills Deemer before Stephanie can save him. Matt drives up to the house as it collapses, but Stephanie gets out alive, rushing to Matt's car. They drive off into the desert, notifying the State Police and Sheriff, who gives orders to evacuate the town. Efforts to kill the approaching tarantula with machine guns fail, and the monster kills two cops in the bargain. Another effort to kill the monster with dynamite also fails. With the tarantula headed for town, fighter planes approach, with Clint Eastwood in an undredited minor role as the jet squadron league. They drop bombs on the monster as it reaches Desert Rock. When traditional bombs fail, the planes drop napalm, setting the tarantula on fire as a relieved Matt, Stephanie and various officials look on.",
      "writers": [
         "Robert M. Fresco",
         "Martin Berkeley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048696/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk2ODgzMDEyOV5BMl5BanBnXkFtZTcwMjgwMDMyMQ@@._V1._CR0,0,260,429_SX214_AL_.jpg",
      "actors": ["Stars: John Agar, Mara Corday, Leo G. Carroll | See full cast and crew »"],
      "reviews": [
         "I watched this movie a hundred times while growing up and I've seen it at least a hundred more times as an adult! Great story. To me it's the greatest big bug movie ever made. Interesting side story of the effects of the nutrient on humans, also. I fell in love with Mara Corday after the first time I saw this as a young child and I still think she was one of the great beauties of the screen. I think the main reason the film holds up today is the special effects are still quite impressive and there is nothing that todays audience would find hokey or cheesy. The only thing that \"Bugs\" me is the sound effect of the tarantula growling as it attacks. But thats just nit-picking. Its also fun spotting a young Clint Eastwood. Great sci-fi and great entertainment! A film viewing must!",
         "This one has a special place in my memories ! I grew up in New Mexico near the desert, and whenever they showed this one on the late night science fiction Saturday night TV thriller show, I was afraid to walk to school and back on Monday! As I have grown up over the last forty years, I have come to appreciate it as a well crafted science fiction near classic! Jack Arnold directed many good sci-fi movies in the 1950's, but there is no doubt this was the creepiest! Next to the superior \"THEM\", released the year before (at a different studio), this UNIVERSAL STUDIOS chiller was , for my money, the second best of the giant bug movies of that decade! You will never look at the desert the same way again. Actress MARA CORDAY impressed me so much in this one, that I named one of my daughters after her! JOHN AGAR gave a great performance, and this one led to him doing a string of more horror and sci-fi movies for the next decade or two! It helped that they used a real Tarantula (named TOMORROW), instead of a fake one, and Clifford Stine's special effects will convince you that spider is really 100 feet tall! Another plus is Henry Mancini wrote some of the music score! So, I recommend this one to all those that hate creepy crawlers of any kind! Get out the can of RAID! But, you had better make it a really big can !!! Signed, Baron Beast",
         "As someone who'll kill a common house spider on sight, and as a resident of one of the the cooler regions of the United States, I try to watch the fifties sci-fi movie Tarantula whenever it's on. Maybe I do it as therapy. I dunno. Or maybe I'm trying to convince myself that it really is better living in a city that has been known to have blizzards in April. Whatever. But enough about me. This Jack Arnold-directed movie was made for the old Universal-International at a time that studio wasn't nearly the behemoth it is today. But U-I, or rather its management, wanted to be big, and were aiming to grow. Kind of like the eight-legged creature in this film. The movie is set in an Arizona desert town whose handsome young Dr. John Agar is trying to solve the mysterious death of a man from a condition known as acromegaly (or acromegalia, as it's called in the film). His quest takes him to the laboratory of research scientist Leo G. Carroll, who, though outwardly polite, clearly doesn't want to be bothered. He doesn't want his beautiful young assistant, Mara Corday, to be bothered, either, least of all by the romantic Dr. Agar. As luck would have it, Carroll and his former associate and friend,--let's call him the acromegaly man, and leave it at that--were working on a nutrient that they hoped would cure world hunger. To make a long story short, one of the creatures they were experimenting on, a tarantula already the size of a Volkswagon, escaped from the lab when the acromegaly man set it on fire, as he had gone mad. He also injected Dr. Carroll with the formula that would in time give him acromegaly, too. Some friend. In a brief period of time the spider has grown to the size of a house, then an office building. He's either very shrewd or very lucky to avoid being spotted, feasting mostly on ranchers and men in remote areas where he won't be seen by others. Guns are useless against the big guy. Dynamite can't kill him, either. He just ambles on right through it. The Air Force has to be called in. I won't tell you any more because I don't want to spoil the ending for you. As big bug movies go, this one's near the top of my list. It's very well photographed, and the life of the small town is presented with just enough credibility so that even when the story gets a tad weird, the people seem real. I especially liked Nestor Paiva's extremely (to put it mildly) aggressive performance as the sheriff. Forceful as he is, he's never obnoxious, just assertive. Mara Corday doesn't have much to do but look pretty, which she does superbly. The late John Agar is quite good as the town doctor. No, this isn't George C. Scott we're talking about, but Agar is competent. Also, there's something about his looks, the eyes and cheekbones especially, that give him an alien, almost unreal aspect. It's a perfect face for a fifties sci-fi hero. Slightly android. Leo G. Carroll is his usual diffident self, and he does make a convincing scientist. There's something about Carroll's manner and delivery of dialog that makes you want to hear more. I wish he'd have more to say and more to do, and not just in this movie, in all the movies he appeared in. This isn't exactly a star vehicle for him, but his role is substantial, and in a way it's his low-key underacting that keeps the movie anchored in something that resembles reality. Put a more flamboyant type in the part, a Rathbone or a Lugosi, and the film would be over the top.",
         "This is one of those films which starts off with a bang, slows down with a big lull in the middle section, and then finishes strong. Kudos to the special-effects people to make the giant tarantula scenes look pretty good, even by today's standards some 50 years after this was made. Many times, the huge spider looks real while it's crawling down the road. I would like to have seen one or two more scenes of it in that middle section which would have kept viewers on edge throughout the film. Instead, it got a bit talky in spots. Anyway, it still entertained and it was fun for me to see Leo G. Carroll, a guy I saw each week growing up watching \"Topper\" on television. Carroll played, by far, the most interesting character in this movie. The acting was good in here, too, once again above '50s sci-fi standards. It was one of the better entries in the recently-released Sci-Fi Ultimate DVD set, offered at Best Buy. A pretty good transfer, too.",
         "This is a top-of-the-line Sci-Fi thriller from the studio that did 'em best in the 1950s - Universal-International. Produced by William Alland (who also produced \"Creature From the Black Lagoon\" and \"It Came From Outer Space\", and directed by Jack Arnold (who directed those films) it has an intelligent script and good acting all the way around. Arnold does a great job of building suspense as he cleverly keeps the titular monster mostly off-screen for the first 2/3 of the film until it's simply too big to hide. And then --- watch out, folks! As in many another sci-fi story, the road to hell is paved with good intentions, and if there's a villain of the piece, it's the Nuclear Age - the spider of the title is merely doing it's natural thing: searching for food. Except that, thanks to Leo G. Carroll's well-meaning experiments (to increase the world's supply of food), this is one BIG spider with an equally BIG appetite! Universal's special effects department just about out-did themselves here - the matte work is almost flawless (check out Leo G. Carroll's house after the spider's visit), and the make-up department did excellent work as well. This is one of the best of it's kind, and great fun on a rainy Saturday afternoon.",
         "This is a great horror movie. The story is excellent and the pace is swift and entertaining. The special effects are convincing, and so is the acting. Universal studios did a good job with there early monster movies, like \"THE LAND UNKNOWN\" and \"THE DEADLY MANTIS\". Very good horror movie that I highly recommend. 4/5.",
         "Only slightly less classic than \"Them!\" \"Tarantula\" still manages to stand on its own as a strong entry in the Giant Bug movies of the 50s. Technically, its not a bug movie as tarantulas are arachnids and not insects, but movie-going audiences of the 50s didn't care. They just wanted to see big ugly bugs crushing everything in their path, and this film certainly delivers in that respect. Taciturn scientist Leo G. Carroll is a man bent on finding a cure for world hunger. He invents a serum which enlarges whatever animal or insect (or arachnid) it is injected into. Unfortunately, when injected into a human, it causes acromegalia, a disorder marked by progressive enlargement of the head, face, hands, feet, and thorax, due to the excessive secretion of growth hormone. When one of Leo's human guinea pigs comes looking for revenge, he not only destroys the lab and injects the doctor with his own serum, but he shatters the glass cage of a puppy-sized tarantula, which quickly scurries out into the night. Enter Mara Corday and John Agar. Mara Corday is the new lab assistant for Leo, and John Agar is the country doctor who takes an interest in the dark haired beauty. But there's not much time for romance as the tarantula, now roughly the size of the Goodyear blimp, begins terrorizing the desert. Farm animals are munched upon, and so too are human victims who are found in pools of venom, their bodies literally filled with enough poison to kill ten more men besides. Leo G. Carroll slowly turns into the Elephant Man, the giant spider peeks through the window at Mara in her nightie and Clint Eastwood shows up at films end to fire napalm at the eight legged menace. Forget about \"Earth vs. The Spider\" and whatever you do, avoid \"The Giant Spider Invasion\" at all costs. This is the definitive Giant Spider film. It's smart and fast and well acted, and the spider itself is pretty cool looking, considering the fact that no furry robotic arachnids were constructed for this film, but instead film footage of a real tarantula was blown up and rear projected. It looks pretty good, considering the time. If you liked \"Them!\" you'll definitely want to check this one out as well.",
         "Ostensibly a quickie b-flick targeted at matinée audiences, \"Tarantula\" certainly isn't High Art but it does take a refreshingly serious tack on its story. Mad scientist in small desert town experiments with growth serum, accidentally unleashing one humongous spider on the terrified locals. Very nice atmosphere, decent special effects, not-bad performances. John Agar is the stalwart hero, and of course he's coupled with a pretty girl prone to screaming (Mara Corday as Stephanie, whom Agar affectionately calls 'Steve'). Probably more fun today for nostalgic adults than modern preteens, and certainly not as gripping as \"Them!\", but still a well-enough produced creep-show. Look fast for Clint Eastwood in an uncredited bit. ** from ****",
         "In Desert Rock, Arizona, a disfigured man is found dead and identified by Professor Gerald Deemer (Leo G. Carroll) as his assistant and friend Dr. Eric Jacobs, who would suffer from acromegalia. The country doctor Matt Hastings (John Agar) is puzzled with the mysterious disease and decides to investigate further about acromegalia. Professor Deemer omits that Dr. Eric Jacobs and Dr. Paul Lund were researching with him a nutrient to increase the food supply in the world and they have been affected by the experiment. Soon Paul Lund, who has also been affected and is mad, breaks and sets the laboratory on fire and a huge tarantula escapes. Meanwhile, the gorgeous Stephanie \"Steve\" Clayton (Mara Corday) arrives in town to work with Dr. Jacobs, and Dr. Hastings drives her to Professor Deemer's house in the desert. She is hired by Deemer and she finds that he is sick. When cattle bones are found in a farm, Hastings collects material and flies to a laboratory, where he learns that the sample is of tarantula's venom. But the scientist does not believe that one tarantula could ever produce such quantity of venom. The doctor returns to Desert Rock sure that the species is part of Prof. Deemer's experiment and the locals are threatened by the dangerous tarantula. \"Tarantula\" is a typical sci-fi of the 50's and a surprisingly good film. The screenplay is very well written and the movie is supported by good direction, performances, cinematography and special effects. My vote is seven. Title (Brazil): \"Tarântula!\" (\"Tarantula!\")",
         "I was eight when I saw Tarantula on the not-so-big screen. My youthful fear of death led me to a greater concern for the disease caused by the \"nutrient\" than by a very large spider. It contains a classic moment found in many 50's big monster \"movies.\" Two guys are left behind in a car (which, of course, is in bad need of a tune-up and won't start) with a couple of puny rifles. They, of course, provide an evening meal for the spider. This was probably most people's first exposure to napalm as well."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Universal International Pictures (UI)"],
      "summaries": [
         "In the Arizona desert, Professor Gerald Deemer is experimenting with growth hormones in the hopes of finding a way to increase the world's food supply. His partner in the project was recently found dead in the desert, suffering from a disease that normally takes years to advance but in his case seems to have afflicted him in only a few days. The local doctor, Matt Hastings, is puzzled by the strange case and with Deemer's recently arrived - and very pretty - assistant Stephanie Clayton tries to figure out what is going on. When cattle remains are found in the countryside, the evidence points to a giant tarantula as the culprit.",
         "In Desert Rock, Arizona, a disfigured man is found dead and identified by Professor Gerald Deemer as his assistant and friend Dr. Eric Jacobs, who would suffer from acromegalia. The country doctor Matt Hastings is puzzled with the mysterious disease and decides to investigate further about acromegalia. Professor Deemer omits that Dr. Eric Jacobs and Dr. Paul Lund were researching with him a nutrient to increase the food supply in the world and they have been affected by the experiment. Soon Paul Lund, who has also been affected and is mad, breaks and sets the laboratory on fire and a huge tarantula escapes. Meanwhile, the gorgeous Stephanie \"Steve\" Clayton arrives in town to work with Dr. Jacobs, and Dr. Hastings drives her to Professor Deemer's house in the desert. She is hired by Deemer and she finds that he is sick. When cattle bones are found in a farm, Hastings collects material and flies to a laboratory, where he learns that the sample is of tarantula's venom. But the scientist does not believe that one tarantula could ever produce such quantity of venom. The doctor returns to Desert Rock sure that the species is part of Prof. Deemer's experiment and the locals are threatened by the dangerous tarantula.",
         "Professor Gerald Deemer has been working on a special nutrient to help ease a predicted food shortage that is expected to come with the increase in human population. His experiments have been moderately successful but there have been some failures as a result. One day while he is gone two of his colleagues inject themselves with the nutrient with disastrous results and die a few days later. One however goes mad and injects Deemer with the formula. During a struggle, a giant tarantula injected with the formula escapes its cage and grows even larger and starts to attack cattle as well as human beings.",
         "When a tarantula which has been injected with a special nutrient formula escapes from a scientist's laboratory, it grows into a 100-foot beast that menaces the Arizona countryside.",
         "A spider escapes from an isolated desert laboratory experimenting in giantism and grows to tremendous size as it wreaks havoc on the local inhabitants."
      ],
      "budget": 0
   },
   "movielensId": 2656,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-12-14",
      "dvdReleaseDate": "2008-05-13",
      "directors": ["Jack Arnold"],
      "runtime": 80,
      "movieId": 2656,
      "title": "Tarantula",
      "mpaa": "",
      "actors": [
         "John Agar",
         "Mara Corday",
         "Leo G. Carroll",
         "Nestor Paiva",
         "Ross Elliott",
         "Edwin Rand",
         "Raymond Bailey",
         "Hank Patterson",
         "Bert Holland",
         "Steve Darrell",
         "Clint Eastwood"
      ],
      "imdbMovieId": "0048696",
      "originalTitle": "Tarantula",
      "genres": [
         "Horror",
         "Science Fiction",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "NU5Ohipxhak",
         "NwQ8QKv2kUI"
      ],
      "plotSummary": "A lone-wolf scientist sequestered in a mansion near a small desert town arouses the suspicion of the town's doctor when his lab assistant is found dead from a case of acromegaly which took only four days to develop.  As the doctor investigates, aided by the scientist's new, and very female, assistant, they discover that, far worse, something much larger and hungrier than it ever should be,  is devouring local cattle - and humans - in increasingly large quantities.",
      "tmdbMovieId": 9077,
      "avgRating": 2.78734,
      "releaseYear": "1955",
      "numRatings": 395,
      "posterPath": "/gPjlVSys2CJP1aQKXnhj4kKDxrB.jpg"
   }
}