{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "spy",
            "id": 470
         },
         {
            "name": "cold war",
            "id": 2106
         },
         {
            "name": "flying saucer",
            "id": 3243
         },
         {
            "name": "secret agent",
            "id": 4289
         },
         {
            "name": "alaska",
            "id": 9880
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "espionage",
            "id": 11134
         }
      ],
      "imdb_id": "tt0042469",
      "video": false,
      "title": "The Flying Saucer",
      "recommendations": [
         263554,
         56767,
         43249,
         27144,
         76418,
         36501,
         29065,
         29057,
         82807,
         50800,
         73772,
         47632,
         30396,
         59566,
         29474,
         51787,
         40716,
         32585,
         53314,
         37441
      ],
      "backdrop_path": "/5vxe5U7tbhGTI7EQSq56CHyJMar.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Mike Trent",
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5809",
               "name": "Mikel Conrad",
               "profile_path": null,
               "id": 106608,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Vee Langley",
               "gender": 0,
               "credit_id": "52fe4644c3a36847f80f580d",
               "name": "Pat Garrison",
               "profile_path": null,
               "id": 131031,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Hank Thorn",
               "gender": 2,
               "credit_id": "55a131d5c3a3681ce300178c",
               "name": "Russell Hicks",
               "profile_path": "/hRRM5ni87mxjlDV2G9jr4GCxFew.jpg",
               "id": 13969,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Col. Marikoff",
               "gender": 2,
               "credit_id": "55a131c8c3a3681cf30017ac",
               "name": "Lester Sharpe",
               "profile_path": null,
               "id": 975881,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hans",
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5811",
               "name": "Hantz von Teuffen",
               "profile_path": null,
               "id": 131032,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Nanette",
               "gender": 0,
               "credit_id": "55a13218c3a3681ce70016fc",
               "name": "Virginia Hewitt",
               "profile_path": null,
               "id": 214626,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Matt Mitchell",
               "gender": 2,
               "credit_id": "55a131e19251412979001677",
               "name": "Frank Darien",
               "profile_path": "/y2ZwI7fYSxJK12N4vOqqRX2Uq3n.jpg",
               "id": 116661,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "Alex Muller",
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f5815",
               "name": "Earle Lyon",
               "profile_path": null,
               "id": 29325,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Turner",
               "gender": 2,
               "credit_id": "55a131ed92514129800016c8",
               "name": "Denver Pyle",
               "profile_path": "/cnO648FW7r1NQqHZsPkJBACfXal.jpg",
               "id": 6462,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dr. Carl Lewton",
               "gender": 0,
               "credit_id": "55a131fcc3a3681ce3001791",
               "name": "Roy Engel",
               "profile_path": "/baUCRIrcK6KyRPb2ZMl7d9iYrIp.jpg",
               "id": 100582,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Bartender at Ernie's",
               "gender": 0,
               "credit_id": "55a1320c925141297d0017df",
               "name": "Garry Owen",
               "profile_path": "/mnRNfqFfQAUNxqfotr6T32iWWf2.jpg",
               "id": 117772,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Fred Burnside",
               "gender": 2,
               "credit_id": "55a1322592514129710016db",
               "name": "George Baxter",
               "profile_path": null,
               "id": 97176,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Dreamland Bartender",
               "gender": 2,
               "credit_id": "55a13234925141297400169e",
               "name": "Philip Morris",
               "profile_path": null,
               "id": 1023934,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Barge Captain",
               "gender": 2,
               "credit_id": "55a132469251412977001686",
               "name": "Robert Boon",
               "profile_path": null,
               "id": 26149,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4644c3a36847f80f57f9",
               "name": "Mikel Conrad",
               "profile_path": null,
               "id": 106608,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "55a13277925141297d0017e6",
               "name": "Howard Irving Young",
               "profile_path": null,
               "id": 1071180,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "55a1328e925141296b00162b",
               "name": "Mikel Conrad",
               "profile_path": null,
               "id": 106608,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55a13259c3a3681ce7001701",
               "name": "Mikel Conrad",
               "profile_path": null,
               "id": 106608,
               "department": "Writing",
               "job": "Original Story"
            },
            {
               "gender": 0,
               "credit_id": "55a13299c3a3681ce7001707",
               "name": "Morris M. Wein",
               "profile_path": null,
               "id": 1486308,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "55a132a492514129710016e4",
               "name": "Darrell Calker",
               "profile_path": null,
               "id": 111193,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "55a132b0925141296e00173c",
               "name": "Philip Tannura",
               "profile_path": null,
               "id": 34326,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "55a132ba925141296b00162f",
               "name": "Robert O. Crandall",
               "profile_path": null,
               "id": 140282,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55a132c7c3a3681cf0001741",
               "name": "Charles D. Hall",
               "profile_path": null,
               "id": 3945,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "55a132d392514129710016e7",
               "name": "Murray Waite",
               "profile_path": null,
               "id": 4087,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "55a132e092514129740016a9",
               "name": "Harry Ross",
               "profile_path": null,
               "id": 1343517,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "55a132f4c3a3681cec001514",
               "name": "Lincoln A. Widder",
               "profile_path": null,
               "id": 1486309,
               "department": "Production",
               "job": "Production Manager"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.827001,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 43391,
      "vote_count": 8,
      "budget": 0,
      "overview": "The CIA sends playboy Mike Trent to Alaska with agent Vee Langley, posing as his \"nurse,\" to investigate flying saucer sightings. At first, installed in a hunting lodge, the two play in the wilderness. But then they sight a saucer. Investigating, our heroes clash with an inept gang of Soviet spies, also after the saucer secret.",
      "similar": [
         27576,
         341013,
         954,
         681,
         49517,
         818,
         37724,
         36955,
         213,
         646,
         956,
         296098,
         298312,
         36669,
         691,
         1247,
         56288,
         37834,
         206647,
         203801
      ],
      "original_title": "The Flying Saucer",
      "runtime": 69,
      "poster_path": "/fk2sVtesehLfp0jL01joPBEcJhJ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Colonial Productions",
         "id": 57825,
         "origin_country": ""
      }],
      "release_date": "1950-01-04",
      "vote_average": 2.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Mikel Conrad"],
      "runtime": 69,
      "synopsis": null,
      "writers": [
         "Mikel Conrad",
         "Howard Irving Young"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0042469/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMTE1Nzc1OF5BMl5BanBnXkFtZTcwMTY5ODEyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Mikel Conrad, Pat Garrison, Hantz von Teuffen | See full cast and crew »"],
      "reviews": [
         "Folks, there are no words; hyperbole fails us. This movie is so incredibly bad, so stultifyingly boring, that it has to be seen to be believed. Granted, it was made in 1950, and, granted, there obviously wasn't much of a budget, but really. . .! Yes, we will allow that it was, after all, one of the first films to deal with the subject of UFOs (and CIA cover-ups, and Russian hoaxes, and a Canadian connection) but, after a mildly promising start, the film plays largely as if it were funded by the Alaska Board of Tourism - ENDLESS tableaux of glaciers, and wildlife, and rivers, and more glaciers, but precious little action, and even less in the way of FX. The saucer, when FINALLY seen, looks like something out of \"Killers From Space.\" The fact that this cowflop of a film was made in 1950 doesn't really save it, either: both \"The Thing\" and \"The Man from Planet X\" were made right around the same time, and are far better efforts. In the case of \"The Man from Planet X\", that one was made for around $50,000.00 and was shot in six days on borrowed sets, and it was still better! In short, \"The Flying Saucer\" isn't just crummier than you think, it's crummier than you CAN think! If you really want to see early UFO films, see the above mentioned pair; don't - repeat, DON'T - waste your time with \"The Flying Saucer\".",
         "THE FLYING SAUCER is the first feature film about UFO's. The first screen depiction of \"flying saucers\" was in the serial BRUCE GENTRY: DARE DEVIL OF THE SKIES. Other than being a first, this film about a FBI agent sent to Alaska to find a flying saucer is pretty minor. Not much flying saucer in this film, but a lot endless shots Alaska's natural wonders, and scenes of FBI agent Mike Trent wandering around from one bar to another. The saucer is shown airborne for about a total of 30 seconds. There is also an interesting full scale mock up of the saucer, but it looks very different from the airborne one. Also the writers of this film seemed to think that there was always only one flying saucer that everybody was spotting back then. One thing that disappoints a lot of people is that the saucer isn't even from outer space. This is not so odd considering when this movie was made. Back in 1949 about 80% of Americans thought flying saucers were real but did not automatically believe in E.T.s. Some thought they were from outer space, others thought they came from the U.S.S.R, while most thought they were American secret weapons (the Navy was often sighted as the ones who were testing them.) However in this film the subject of the flying saucer being from Russia is brought up, but no one mentions the idea of the saucer being from outer space. Also at the start of the film Mikes boss mentions that the saucer works on some totally new scientific principal. When the film wraps up, we are never told how the flying saucer works. I suspect the writers could not come up with one.",
         "A scientist in the wilds of Alaska has created a flying saucer and both the CIA and KGB are interested in the new technology. Such is the premise of The Flying Saucer, and if you were looking for aliens, a creative spaceship, or anything which might resemble good film-making - sorry you lose! This is one abysmal film. Mikel Conrad wears the hats of producer, screenwriter, director, and leading man; none fit too well - or at all. It seems that the CIA and the United States government is so hard up for help that they must enlist the aid of a \"two-fisted\" drinking playboy in New York who just happens to have roots in Alaska. So off goes Mike Trent with his \"nurse\" Vera Langley. Vera is played by the very forgettable Pat Garrison whose acting range is no range at all. She looks so disinterested through much of the film playing matron to tough guy Trent. Tough guy, yeah right! Mikel Conrad looks like he just left his barcolounger and got another piece of pie as he stumbles through this dreck. I have to be pretty harsh on Conrad here, because he is responsible for so much of the film. How he ever got backing for this project God only knows. Conrad's inept, stoic stumbling on camera is his worst fault in The Flying Saucer, but closely following its heels are his \"abilities\" as a director. His choice of music to accompany all the action in the movie just about put me to sleep. It sounds like something you might hear in one of those 50s movies made about putting out forest fires or how to avoid catching venereal diseases. Not to be outdone are some of the special effects as well. How about that glacier blow-up and what happens to one man screaming as he falls or the Russians who look like old veterans from the black and white version of Northern Exposure. And let's not forget that spaceship. All you see is it bounce across a very dark sky a few times and then rest in the ground looking like the smallest cast member from Willow MIGHT be able to get in. The acting is just horrible as previously stated with Conrad showing a range of no emotion flying a plane across the Alaskan wilderness with at least three possible engine failures looming. Now, that takes guts to just sit and look like you are waiting in a deli line for your sandwich to be made. After Conrad and Garrison, Hantz von Teuffen stars as - Hans, the mysterious caretaker of the lodge who looks like he wants to kill our two protagonists but waits to do so for the worst possible moment. Yes, Denver Pyle is in this and he is not able to rise above this material. This is a truly bad film that promises some kind of science fiction and delivers nothing. In that regard it is a disappointment. But if you like bad movies that are funny because they are bad, then The Flying Saucer is just up your avenue. It will deliver the goods with gut-wrenching laughs as the incompetence ensues. That is if you are able to stay awake through it.",
         "Whenever I think about this movie, the scene that comes to mind is when the head bad-guy machine-guns one of his own henchmen to get the hero who is using the poor sap as a shield, figuring that the Evil Russian won't kill his own lackey. The E.R. than proceeds to pump about fifty rounds into the poor chump, but the hero is not hit once. Anyone with military or police experience knows that a human body will not serve as protection against a Thompson sub-machine gun shot from less than ten feet away. In real life, the hero would have been a sieve. Now, the fact that this is what stuck with me about this movie is actually too bad. The shots of Alaskan scenery are terrific and the basic story was not too badly conceived. The plot as it is played out and dialog however are in the poor to horrid range. Not bad enough to be funny, disjointed and entirely unacceptable as to the actions of the hero and heroine who are supposed to be high level secret operatives, the abrupt ending typifies the entire movie.",
         "The Flying Saucer started life as a documentary on Alaska -and indeed some of the B&W photography and scenery are not only spectacular, they are beautiful. Then, according to Hans de Meiss-Teuffen \"the Big Brains in Hollywood re-wrote the story and made me, without the loss of a single foot already shot, into a villainous Russian spy\". As an aside, Hans de Meiss-Teuffen was one of the great adventurers of the XXth cy, singlehanded-sailor, mining engineer, hotel owner, lion hunter, double-spy... (his \"Winds of Adventure\", 1953, is a wonderful read) As a grade-B movie of minimal budget, The Flying Saucer is much better than most. Continuity, that some have criticized her, is actually decent for its period (and immensely better than in the famed \"Flash Gordon\"); and it is much less incredible than John Wayne's \"Jet Pilot\". Definitely worth seeing.",
         "I tried to like The Flying saucer...I really did, but this low budget thriller simply didn't work for me. (It didn't \"take off\", if you will.) For one thing the black and white photography is so bleak and cold that it actually works against the film. The acting ranges from bland to overwrought and the dialog is stilted and lifeless. Here's the thing; all of these shortcomings taken together still might mot torpedo the overall enjoyment of this film, but its' boneheaded polemic (even for 1950) left me flat. I did like the location shooting ( the film is set in Alaska) but that didn't stop me from wanting the movie to be over--soon. The Flying Saucer is disappointing on all levels.",
         "I can't really add much more to what's already been said about this Alaska travelogue, but I will offer some praise to the unknown actress Pat Garrison, who plays the phony nurse Vee Langley. There is one sequence in which she goes swimming in a one-piece bathing suit, displaying an admittedly fine figure (she gets my choice for Anatomy Award Winner). There are some notable actors involved, all of them totally wasted (especially Denver Pyle and Earle Lyon), but veteran Frank Darien (Uncle John in \"The Grapes of Wrath\") has a better than usual role. Mikel Conrad is a total failure as a dramatic director, the action scenes are ineptly staged in what seems to come across as slow motion, and his own failings as an actor are maximized. He plays a two-fisted drinker who smokes constantly throughout the film (have to ward off boredom somehow), and the success of his secret mission (and the leading lady falling in love with him) boggles the mind; upon meeting the suspicious Russian caretaker for the first time, he blithely inquires as to whether or not he's noticed any Russian spies in the area! \"The Flying Saucer\" (1949) remains nothing more than a publicity stunt and vanity film for director-producer-star Mikel Conrad, notable chiefly as an historical footnote (being the first saucer movie), but effective only as a showcase for the Alaskan wilderness (I wonder if Sarah Palin ever saw this?)",
         "I only looked this up on IMDb because they used a clip of this movie in a Discovery Science show called \"The Real Flying Saucers\" made in 2004 (I think an English Production). The show ties up all the possibilities of extra terrestrial flying saucers and shows that at first Nazi Germany, than both the USSR and the USA later, actually had invested billions in real aircraft shaped as round \"saucers\". It was a very eye opening show to watch and it all seemed very very plausible, that these aircraft have existed as at least prototypes. On that Discovery Science show, they use archival footage of a formally classified film from the Avro corporation showing Project Y2 or Weapons System 606A powered by 6 jet engines. It was clearly a real film and thats all the facts I need to set that monkey to rest. Maybe some day I'll see this as it sounds like the \"The Flying Saucer\" is more plausibly truthful than all the other saucer movies are.",
         "The Flying Saucer was the first movie to deal with this subject and was one of the first sci-fi movies of the 1950's. Despite reading a lot of bad reviews about it, this isn't actually too bad. A journalist and his \"nurse\" are sent to Alaska to investigate strange sightings of flying saucers over there. His \"nurse\" is with him because as he is undercover, he is in Alaska \"recovering from a nervous breakdown\". Not surprisingly, he falls in love with her during the movie. They make a hunting lodge as their home during their stay but the man who suppose be helping them to do odd jobs is actually a Russian spy and tries to kill the woman a couple of times. He has something to do with the saucer, which appears eventually. The spies are caught out at the end and one of them takes off in the saucer, which then explodes into thousands of little pieces. There is some nice scenery in The Flying Saucer and the music score is quite good for a low budget movie. The cast is mostly made up of unknowns with Mikel Conrad and Pat Garrison as the too main stars. Conrad also wrote the story and produced. He also appeared in another sci-fi B movie - Untamed Women in 1952. Though not brilliant, The Flying Saucer is worth having in any sci-fi collection. Enjoyable. Rating: 2 and a half stars out of 5.",
         "I've seen this film a few times, I must confess, and I like it. My favorite part is Mike Trent's bender in the bars of the Juneau waterfront. For my money, it is the centerpiece of the film and also where Denver Pyle appears. I love McCarthy era portrayals of Soviet operatives. Hantz is a first class strange character with voyeuristic and other kinky tendencies. The official-type Americanos are very fifties. People often expect all films to be realistic and can't seem to appreciate the interesting little views we can get into the past from off beat, low budget stuff like \"The Flying Saucer\"."
      ],
      "genres": [
         "Thriller",
         "Sci-Fi"
      ],
      "productionCompanies": ["Colonial Productions"],
      "summaries": [
         "The CIA sends playboy Mike Trent to Alaska with agent Vee Langley, posing as his \"nurse,\" to investigate flying saucer sightings. At first, installed in a hunting lodge, the two play in the wilderness. But then they sight a saucer. Investigating, our heroes clash with an inept gang of Soviet spies, also after the saucer secret.",
         "Both the CIA and KGB investigate UFOs in Alaska: friend or foe?"
      ],
      "budget": 0
   },
   "movielensId": 2658,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1950-01-04",
      "dvdReleaseDate": "2006-02-21",
      "directors": ["Mikel Conrad"],
      "runtime": 69,
      "movieId": 2658,
      "title": "The Flying Saucer",
      "mpaa": "",
      "actors": [
         "Mikel Conrad",
         "Pat Garrison",
         "Russell Hicks",
         "Lester Sharpe",
         "Hantz von Teuffen",
         "Virginia Hewitt",
         "Frank Darien",
         "Earle Lyon",
         "Denver Pyle",
         "Roy Engel",
         "Garry Owen",
         "George Baxter",
         "Philip Morris",
         "Robert Boon"
      ],
      "imdbMovieId": "0042469",
      "originalTitle": "The Flying Saucer",
      "genres": [
         "Thriller",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["J7sWqwLzaHI"],
      "plotSummary": "The CIA sends playboy Mike Trent to Alaska with agent Vee Langley, posing as his \"nurse,\" to investigate flying saucer sightings. At first, installed in a hunting lodge, the two play in the wilderness. But then they sight a saucer. Investigating, our heroes clash with an inept gang of Soviet spies, also after the saucer secret.",
      "tmdbMovieId": 43391,
      "avgRating": 2.87209,
      "releaseYear": "1950",
      "numRatings": 43,
      "posterPath": "/fk2sVtesehLfp0jL01joPBEcJhJ.jpg"
   }
}