{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "movie business",
            "id": 886
         },
         {
            "name": "narration",
            "id": 2398
         },
         {
            "name": "b movie",
            "id": 11034
         }
      ],
      "imdb_id": "tt0084156",
      "video": false,
      "title": "It Came from Hollywood",
      "recommendations": [
         16150,
         276122,
         95511,
         3149,
         63091,
         90030,
         89762,
         15800,
         38020,
         61702,
         14348,
         25111,
         62472,
         70351,
         3166,
         250577,
         21710,
         40034,
         180935,
         291540
      ],
      "backdrop_path": "/b3brzY31gcwajpzIbNRcCeZxDVc.jpg",
      "revenue": 2091037,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe44029251416c91001efd",
               "name": "Dan Aykroyd",
               "profile_path": "/lV7t37Dla8SILS1G7KpOplmviPg.jpg",
               "id": 707,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe44029251416c91001f01",
               "name": "John Candy",
               "profile_path": "/a53ilUnwQ4q7sM0F0h14dbunKA7.jpg",
               "id": 7180,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe44029251416c91001f05",
               "name": "Cheech Marin",
               "profile_path": "/efuXbXg7JpORy5hPDU7Zityq3k3.jpg",
               "id": 11159,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe44029251416c91001f09",
               "name": "Tommy Chong",
               "profile_path": "/9wdlcc5JS36OYd05XBuo8r6F1aq.jpg",
               "id": 63208,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe44029251416c91001f0d",
               "name": "Gilda Radner",
               "profile_path": "/emQLbSIFi8ggCQetkXfvWVhZJ95.jpg",
               "id": 46949,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44029251416c91001f13",
               "name": "Dana Olsen",
               "profile_path": null,
               "id": 26978,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44029251416c91001f1f",
               "name": "Andrew Solt",
               "profile_path": null,
               "id": 81186,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44029251416c91001f25",
               "name": "Malcolm Leo",
               "profile_path": null,
               "id": 108128,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "571fb5dfc3a3686241001663",
               "name": "Fred J. Koenekamp",
               "profile_path": "/yxTbBWproHj24o8yrTLEjtzlF9u.jpg",
               "id": 19102,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 1.851086,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 30168,
      "vote_count": 13,
      "budget": 5000000,
      "overview": "Dan Ackroyd, John Candy, Gilda Radner and Cheech and Chong present this compilation of classic bad films from the 50's, 60's and 70's. Special features on gorilla pictures, anti-marijuana films and a special tribute to the worst film maker of all-time, Ed Wood.",
      "similar": [
         254,
         7446,
         856,
         522,
         1581,
         27581,
         703,
         2294,
         509,
         112160,
         371638,
         74643,
         319,
         44826,
         9325,
         599,
         9480,
         14,
         426,
         273248
      ],
      "original_title": "It Came from Hollywood",
      "runtime": 80,
      "poster_path": "/7MEflXzbne5jzOalnM7Q3LY1Cgj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1982-12-10",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "We're going to make you LAUGH.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Malcolm Leo",
         "Andrew Solt"
      ],
      "runtime": 80,
      "synopsis": null,
      "writers": ["Dana Olsen"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084156/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzkxNTg4ODE4NV5BMl5BanBnXkFtZTcwNDE1MjUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Dan Aykroyd, John Candy, Cheech Marin | See full cast and crew »"],
      "reviews": [
         "It's just sad how little this movie is recognized and how it has been recalled for DVD. You have some of the biggest stars of the time taking about bad B movies of the 50's 60's and 70's like A.p.e the giant claw Earth vs the flying saucers the Colossal man. I can only imagine a movie like this today stars like johnny Depp Leonardo Dicaprio Jake Gyllenhaal Taking about old B movies of the past including ones from the 80's like Hobgoblins the Abomination Deadly spawn Lobster man from mars and bad shot on video movies. This is a classic that more people should know about all the stars do a good job the clips are great it never takes it self seriously. I first saw this on HBO way back in 92 or 93 and i will never forget the first time seeing it this any fan of John Candy Gilda Radner Dan Aykroyd or b movies should see it.",
         "A film that I always enjoyed. Various comedians host tributes to some really bad movies. There's one whole section just for Ed Wood. If you like MST3K, you'll like this. In fact, look for Phantom of Krankor in a cameo!",
         "This film still has me rolling whenever I see it. This film not only makes fun of the grade Z stinkers, but in it's on weird way, pays tribute to these films at the same time. The only problem I have with it is the fact that it includes two classic sci-fi films, \"The Incredible Shrinking Man\" and \"War of the Worlds\". Other than that this is one funny film, especially Cheech and Chong's look at the anti-drug films like \"Reefer Madness\" and \"High School Confidential\".",
         "I've always enjoyed this hodge-podge of \"bad\" movie scenes and previews. But only for the previews themselves. Unfortunately, this movie takes a very smug and pompous attitude toward its subject matter, largely due to the fact that Golden Turkey Award creator Michael and Harry Medved were \"advisors\" on the project. Anyone who is a real fan of these movies enjoys them for the silly schlock that they are. The Medveds revel in ridiculing and lampooning them with no appreciation for them at all. Surprisingly, this is the sense one gets from hosts Dan Aykroyd and John Candy, two performers one would think would have a special place in their hearts for these classics. Only Cheech and Chong and Gilda Radner seem to get into the spirit of things. While Candy and Aykroyd poke fun and insult the movies, Cheech, Chong and Radner play along with them, and create some genuine laughs. But the real stars are the clips themselves, which are great fun and great nostalgia. Oddly, amid these \"bad\" movies are such recognized classics as THE INCREDIBLE SHRINKING MAN, WAR OF THE WORLDS and THE DAY THE EARTH STOOD STILL. Scenes from outrageously over-the-top cautionary films about sex and marijuana are utterly hilarious. Highlights are Chong ordering a truckload of candy at the concession stand and Radner doing her little girl schtick from Saturday night live.",
         "Good intentions aside, at times I had trouble really getting into this pleasantly interactive, short-lived little documentary/Mystery Science Theater 3000 style arrangement that presents a variety of random clips from supposedly old b-grade to z-grade Hollywood features (though its hard to grasp why \"War of the Worlds\", \"The Incredible Shrinking Man\" and \"The Day the Earth Stood Still\" made its way in) that are set-up through specific genders (monsters, gorillas, animals going berserk, brains, troubled teenagers, Ed Wood, Aliens, giants and musicals) with them being wittily dissected/or informatively discussed by comedians Dan Aykroyd, John Candy, Gilda Radner, Cheech and Chong. The thing was I thought the best moments actually involved the crazy movie clips themselves, than that of it focusing on its mugging stars and the wraparound sequences. The problem was that I found most of the remarks (which at times were surprisingly sparse) not to be all that funny, well Cheech and Chong came across more so genuinely smooth in their humour within the cinema (especially Chong at the candy bar and sitting their watching the films) and it came across an inspired choice for them to rip on the eccentrically pitched cautionary drug movies. However some of those scenes with the other stars in between the collection of clips just didn't gel, as for one Aykroyd really did get on my nerves. Some skits were better implemented than roughly penned others, but the feature does feel like one big trailer (or movie preview) for bad schlock movies\u0085 some which are hard to believe you're actually seeing it on screen. Nothing is safe in the wryly tongue-in-cheek \"It Came from Hollywood\".",
         "I've read a lot of negative reviews of IT CAME FROM HOLLYWOOD since it was first released, but I have to admit, I think it's hilarious. The film is broken into several sections, each introduced by one or more of the comedians. for example, John Candy pays tribute to Ed Wood (Including a remake of the \"coming out\" scene from GLEN OR GLENDA with Dan Aykroyd), Cheech and Chong introducing clips from the likes of THE COCAINE FIENDS, etc. Some of the clips drag, some clips have been \"doctored\" to seem even sillier then they really are, but with the likes of PLAN 9 FROM OUTER SPACE and MARS NEEDS WOMEN on display, there are some great moments.",
         "One of the reasons I liked this film so much was because it actually featured Guilala. Dan Aykroyd and John Candy make comments about the best and worst Sci-Fi movies like Plan 9 from Outer Space and other films by Ed Wood. It also features Attack of the Mushroom People and X from Outer Space. I loved it. Recommended to everybody.",
         "As advertised, this is truly a documentary with scenes from early, and poor budgeted, 'B' movies dealing mainly with cheap horror films from the 50's. I would not say that this film is outstanding but it was humorous to see the sets and costumes worn in the golden era of 'B' type films with the narrative performed by comedy actors from the early 80's. I really do not understand how people can say that it was a 'Gem' since the entire film consist mainly of footage from non-classic films with added commentary by the hosts. It was a nice look back at early low-budget films but not much else in the form of entertainment. The best thing is that nearly all the cheap, low-budget, corny 'B' type movie scenes are now in one place. Other than that not much to see here. But again it is a documentary and as documentaries go-- it was interesting.",
         "This isn't as much a movie as it is a loose assembly of B- to Z-grade movies that have been produced between the 1940's and late 1970's (and not only did they come from Hollywood but Japan as well), narrated by numerous \"Saturday Night Life\"-comedians. We're talking movies like \"Mars Needs Women\", \"Reefer Madness\" (who but Cheech and Chong would be more likely to make fun of that one?), \"The Incredible Strange Creatures who stopped living and became mixed up Zombies\"; indeed, we're talking the works of Edward D. Wood Jrn. It's nice to see some of your favorite 80's comedians, some which have passed on since (John Candy, Gilda Radner), others which have fallen into obscurity (Dan Akroyd, Cheech and mainly Chong). Granted the gags and jokes are all rather silly, definitely not especially gifted (and considering that this is from 1982 and that we are used to a little sharper, even cynical humor these days, they haven't aged very well), but then again, we're dealing with bottom-of-the-barrel films, hence let's just call them appropriate. It's also interesting to reflect, 30 years down the road, how many truly awful movies have been produced since then and the path that the industry in general has taken. Movies like \"Battlefield Earth\" or M. Night Shyamalans \"The Last Airbender\" (well, actually every Shyamalan picture since \"The Sixth Sense\") would certainly not be out of place if they ever remade \"It Came from Hollywood\". However, there is one exception: while \"It Came from Hollywood\" focuses on films that were generally generated by a shoe-string budget, the more recent cinematic train-wrecks have swallowed millions upon millions of dollars. Seven from ten points out of sheer curiosity value \u0096 wait; make those six points for having included \"The Incredible Shrinking Man\" and \"War of the Worlds\".",
         "It came from Hollywood features clips from some of the best b movies ever featuring;plan 9 from outer space,attack of the 50 foot woman,the killer shrews,glen or Glenda,son of Godzilla,the thing with two heads, Frankenstein meets the space monster,horror of party beach,and much more.but some of the movie clips shown are a list movies like day the earth stood still,war of the worlds,and the incredible shrinking man. hosted in segments by;Gilda radner,Dan ackroyd,john candy,and cheech and chong(they host getting high in the movies)its a fine hodgepodge of classic movie clips.it was put together very well and hopefully soon they will release this to DVD.i remember them showing this in place of Saturday night live once and they chopped it up.the getting high segment was missing of course and the racy clip from sunny side up with AL Jolson in black face was snipped.if you never seen this and you love Hollywood's b movies and some a list movies you will enjoy it came from Hollywood.and like john candy says in the beginning there's dirty parts too,not really its pg rated and there's no nude scenes.some adult language but thats it.bevare of the scene from glen or Glenda with bela Lugosi its a trip.some of the other films are i married a monster from outer space,mars needs women,amazing colossal man,cyclops,crawling eye,the manster,incredible melting man,attack of the mushroom people,Santa Claus vs the martians(with Pia zadora)beginning of the end,the giant claw,reefer madness,marijuana,and many others i didn't list.i recommend it came from Hollywood.its fun and its funny.10 out of 10."
      ],
      "genres": [
         "Documentary",
         "Comedy"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Dan Ackroyd, John Candy, Gilda Radner and Cheech and Chong present this compilation of classic bad films from the 50's, 60's and 70's. Special features on gorilla pictures, anti-marijuana films and a special tribute to the worst film maker of all-time, Ed Wood.",
         "Popular comedians watch and give comments about the worst and silliest films from Hollywood."
      ],
      "budget": 5000000
   },
   "movielensId": 2659,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-12-10",
      "dvdReleaseDate": null,
      "directors": [
         "Andrew Solt",
         "Malcolm Leo"
      ],
      "runtime": 80,
      "movieId": 2659,
      "title": "It Came from Hollywood",
      "mpaa": "PG",
      "actors": [
         "Dan Aykroyd",
         "John Candy",
         "Cheech Marin",
         "Tommy Chong",
         "Gilda Radner"
      ],
      "imdbMovieId": "0084156",
      "originalTitle": "It Came from Hollywood",
      "genres": [
         "Comedy",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Dan Ackroyd, John Candy, Gilda Radner and Cheech and Chong present this compilation of classic bad films from the 50's, 60's and 70's. Special features on gorilla pictures, anti-marijuana films and a special tribute to the worst film maker of all-time, Ed Wood.",
      "tmdbMovieId": 30168,
      "avgRating": 3.23864,
      "releaseYear": "1982",
      "numRatings": 264,
      "posterPath": "/7MEflXzbne5jzOalnM7Q3LY1Cgj.jpg"
   }
}