{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "submarine",
            "id": 339
         },
         {
            "name": "san francisco",
            "id": 582
         },
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "radiation",
            "id": 1618
         },
         {
            "name": "u.s. navy",
            "id": 4410
         },
         {
            "name": "water monster",
            "id": 7994
         },
         {
            "name": "stop motion",
            "id": 10121
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "environmental change ",
            "id": 185218
         },
         {
            "name": "giant octopus",
            "id": 201956
         },
         {
            "name": "animal horror",
            "id": 223059
         },
         {
            "name": "submarine commander",
            "id": 239750
         },
         {
            "name": "woman scientist",
            "id": 239751
         }
      ],
      "imdb_id": "tt0048215",
      "video": false,
      "title": "It Came from Beneath the Sea",
      "recommendations": [
         210198,
         28650,
         15096,
         29570,
         42699,
         39043,
         3117,
         43248,
         26316,
         3104,
         43321,
         85237,
         52230,
         26243,
         18274,
         31244,
         26857,
         43109,
         43010,
         64378
      ],
      "backdrop_path": "/pC9aW4Ljth1ULgWbeG2dzwOL9PZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Cmdr. Pete Mathews",
               "gender": 2,
               "credit_id": "52fe4607c3a368484e07cc13",
               "name": "Kenneth Tobey",
               "profile_path": "/eDD3rIv203f48tnu7ONwfjXQW7J.jpg",
               "id": 103069,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Prof. Lesley Joyce",
               "gender": 1,
               "credit_id": "52fe4607c3a368484e07cc17",
               "name": "Faith Domergue",
               "profile_path": "/aKtclDdmAcUuBsD3CqeSFqVpFfK.jpg",
               "id": 85740,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Dr. John Carver",
               "gender": 2,
               "credit_id": "52fe4607c3a368484e07cc1b",
               "name": "Donald Curtis",
               "profile_path": "/tW9pHQ3GlfLgbDup4Q70p0QPfoK.jpg",
               "id": 35847,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Lt. Griff, USN",
               "gender": 0,
               "credit_id": "52fe4607c3a368484e07cc27",
               "name": "Chuck Griffiths",
               "profile_path": null,
               "id": 105367,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Adm. Burns",
               "gender": 2,
               "credit_id": "52fe4607c3a368484e07cc1f",
               "name": "Ian Keith",
               "profile_path": "/19ADvpSyq79YBa2p0vNTgBzuu6g.jpg",
               "id": 84230,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Adm. Norman",
               "gender": 0,
               "credit_id": "52fe4607c3a368484e07cc23",
               "name": "Dean Maddox Jr.",
               "profile_path": null,
               "id": 105366,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Deputy Bill Nash",
               "gender": 0,
               "credit_id": "52fe4607c3a368484e07cc2b",
               "name": "Harry Lauter",
               "profile_path": "/w5KvkNYqp7bmihoITnKgxPvfIYB.jpg",
               "id": 40577,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Capt. Stacy",
               "gender": 0,
               "credit_id": "52fe4607c3a368484e07cc2f",
               "name": "Richard W. Peterson",
               "profile_path": null,
               "id": 105368,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4607c3a368484e07cbfd",
               "name": "George Worthing Yates",
               "profile_path": null,
               "id": 30969,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4607c3a368484e07cc09",
               "name": "Charles H. Schneer",
               "profile_path": "/2HUfWC6uXFy7ed3eciHwORt6aVm.jpg",
               "id": 66759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4607c3a368484e07cc0f",
               "name": "Sam Katzman",
               "profile_path": null,
               "id": 34112,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4607c3a368484e07cc35",
               "name": "Robert Gordon",
               "profile_path": null,
               "id": 192827,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "574a5dd1c3a3682fd6001940",
               "name": "Jack Erickson",
               "profile_path": null,
               "id": 1176364,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "574a5dc5c3a3683024002176",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "575aae54c3a36841880011b5",
               "name": "Harold Jacob Smith",
               "profile_path": null,
               "id": 69320,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "575aafac92514128fa00174c",
               "name": "Henry Freulich",
               "profile_path": null,
               "id": 34174,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "575aafc79251411548001b92",
               "name": "Jerome Thoms",
               "profile_path": null,
               "id": 34439,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "575aafd8c3a3686bcf000e49",
               "name": "Paul Palmentola",
               "profile_path": null,
               "id": 1176363,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "575aafe892514128fa001755",
               "name": "Sidney Clifford",
               "profile_path": null,
               "id": 34115,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 2,
               "credit_id": "575ab01bc3a3686ad8001a33",
               "name": "J.S. Westmoreland",
               "profile_path": null,
               "id": 961298,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "58f9b5b6925141588100696f",
               "name": "George Worthing Yates",
               "profile_path": null,
               "id": 30969,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "58f9b6329251415892007204",
               "name": "Leonard Katzman",
               "profile_path": null,
               "id": 172983,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 2,
               "credit_id": "58f9b699c3a3687c73006bf6",
               "name": "Mischa Bakaleinikoff",
               "profile_path": null,
               "id": 18577,
               "department": "Sound",
               "job": "Conductor"
            },
            {
               "gender": 2,
               "credit_id": "58f9b6e6925141588d006f02",
               "name": "Leon Chooluck",
               "profile_path": null,
               "id": 8344,
               "department": "Production",
               "job": "Unit Manager"
            }
         ]
      },
      "genres": [{
         "name": "Science Fiction",
         "id": 878
      }],
      "popularity": 2.36988,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29959,
      "vote_count": 28,
      "budget": 0,
      "overview": "A Giant Octopus, whose feeding habits have been affected by radiation from H-Bomb tests, rises from the Mindanao Deep to terrorize the California Coast.",
      "similar": [
         124905,
         39256,
         7191,
         1927,
         3160,
         11071,
         5876,
         9738,
         9426,
         44833,
         135397,
         929,
         373571,
         15767,
         9077,
         293167,
         4961,
         315011,
         9825,
         1678
      ],
      "original_title": "It Came from Beneath the Sea",
      "runtime": 79,
      "poster_path": "/wTFPbEWY1zQxU92qCl8Exx3WpKS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Clover Productions",
            "id": 3458,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1955-07-01",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "IT CRUSHES! KILLS! DESTROYS!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Gordon"],
      "runtime": 79,
      "synopsis": "A nuclear submarine is going through its shakedown cruise. The subs sonar operator picks up a contact dead astern heading straight for them at high speed. The captain orders the vessel to flank speed and sends the sub to battle stations while beginning evasive maneuvers. As the sub dives away from the object, something hits the vessel, and radiation warning sounds throughout the ship. Inspecting the detectors the crew realizes the source of the radiation is outside the sub. With a jolt the boat comes to a complete stop. The commander immediately orders the sub to surface; this cant be dome due to something fouling the diving planes. After a number of unsuccessful attempts the sub breaks free and manages to reach the surface. During an inspection the stern of the vessel is radioactive and some sort of organic material, possibly part of a fish is jammed in one of the control planes. Puzzled, the captain elects to return to Pearl Harbor for repairs and to give a detailed report of the incident. At Pearl harbor the sample has been delivered and a team lead by Dr John Carter (Donald Curtis) and Prof Lesley Joyce (Faith Domerque) begin their investigation reporting to Cmdr Peter Mathews (Kenneth Toby) Prof Joyce is in a very negative mood about the investigation, she fears her own lines of research are going to be affected. Mathew informs her that she has effectively drafted for the investigation and she will be expected to stay involved as long as required and she will be compensated for her efforts. 12 days later, the investigation is ongoing but really achieving very little. Mathews has begun to show a definite interest in Joyce. Initially she is cool to Mathews advances, considering him her intellectual inferior. Oddly she is not forthright in telling Mathews to leave her alone. The next day Prof Joyce makes a breakthrough and discovers what the specimen is. Mathews immediately contacts his superiors and a number of high ranking navy officials are heading to Hawaii to hear the answer. With everyone gathered Joyce explains the specimen is a piece of giant squid. Normally found in very deep areas of the sea, she has a theory that hydrogen bombs have upset its habitat. This causes the beast rise to the surface to find sources of food. It is noted that in recent times a number of Japanese fishing vessels have gone missing and the Siberian seal hunting season has failed due to a lack of animals. The naval investigation team is unconvinced by the findings A few days later a tramp steamer encounters the squid. The captain orders the crew to abandon ship as the radio operator sends an SOS. In a matter of minutes the ship is engulfed in giant tentacles and dragged under. Unaware of the latestest incident, Joyce and Carter attend a farewell dinner with Mathews. As the evening progresses Joyce seems to accept Mathews advances by allowing a long kiss to occur on a quiet balcony. Mathews becomes confused and a little upset when Joyce decides not to change her travel plans. A naval officer interrupts dinner to advise the scientists their travel plans have been cancelled. Reports have arrived of the tramp steamers sinking, and a rescue mission has been launched. Survivors are found and returned to Pearl Harbor. Each man is interviewed and repeats the story of the destruction of the ship. Even after crew accept lie detectors and interviews by psychologists the authorities remain unconvinced about the event Doctor Joyce interviews one of the survivors and secretly records the conversation for the navy. On hearing his story first hand, the navy are convinced there is something behind the story, they mobilizes their forces, and close the western Pacific to all ships A further 10 days pass and Joyce and Carter argue that even if the navy find the creature they have little or no hope of destroying it. To narrow the search an alert is sent out for any unusual events, the scientists will investigate these events and see if they can narrow down the search area. From Astoria Oregon a strange report comes through, Joyce and Mathews investigate a strange set of markings found on a beach and reports of a very strange car accident. They also continue to explore their relationship. It is suggested the beach be closed to avoid any further chance of further attacks. A local sheriff thinks the whole thing is a waste of time and decides to explore the beach for himself. In short order he is killed. The navy sees this as strong evidence of the creatures movement and begin to narrow their search around San Francisco, even deciding to lay a series of minefields around the bay. A trap is set using dead sharks as bait. Aircraft patrol overhead waiting for any sign of the beast. It has been decided the only way to be sure of destroying the creature is to damage the brain. Amid the tension Dr Joyce reveals a new jet propelled torpedo that might be successfully deployed against the creature. A command center set up by the military reports that an unknown contact is moving towards San Fran harbor. As planned they begin detonating the mine fields in hope of driving the creature off. The mines have no effect and the second stage of the defense is put into action. An electrical current is run through the Golden Gate bridge and into the water. Enraged the creature surfaces. Joyce and Mathews rush to the bridge to get a firsthand look at what they are fighting. Carter understands that unless he shuts the power off there is a serious risk to the bridge. To succeed he has to go out onto the deck and expose himself the outraged squid. The creature continues attacking the bridge and Mathews sees Carter is trapped and drives out to rescue him. Carter finally shuts the power down and the beast slips beneath the waves. The creature surfaces near the Market Street docks and begins destroying everything in its path. Mathews rejoins his sub with orders to attack the creature. From the shoreline soldiers armed with flame throwers force the creature back into the water. This give Mathews the clear shot he is looking for. The attack is successful but in its thrashing around the creature pins the sub on the bottom of the harbor. Mathews cant detonate the torpedo until the submarine is clear or he risks killing the crew. Mathews dons scuba gear and goes out to attack the creature. Although partially successful he himself is badly wounded and sinks to the bottom. Carter then replicates Mathews efforts, however he aims for the creatures eye. The attack works and the creature convulses from the injury and releases the sub. Carter finds Mathews on the sea floor and races him to the surface before the sub detonates the explosive. After the explosion the submarine surfaces to find the two alive and floating on the surface The creature has been destroyed and everyone lives happily ever after",
      "writers": [
         "George Worthing Yates",
         "Harold Jacob Smith"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048215/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIwMzI0NDI2NV5BMl5BanBnXkFtZTgwNjU5MzU5MTE@._V1._CR10,11,1020,1574_SX214_AL_.jpg",
      "actors": ["Stars: Kenneth Tobey, Faith Domergue, Donald Curtis | See full cast and crew »"],
      "reviews": [
         "Ray Harryhausen wonderfully creates a giant octopus ravaging the Pacific Coast and then rooting itself in San Francisco Bay. The octopus is quite stunning and a marvel of stop-motion animation. Viewers are treated to it actually climbing on the Golden Gate Bridge(a model of course), squeezing a submarine, literally bringing a ship down to the depths, and throwing tentacles all over pedestrians in the San Francisco harbour. My only regret is that this is all too infrequent and most of it arriving at the end of the film. The rest of the story centers around Kenneth Tobey, Faith Domerge and Donald Curtis trying to discover what it is that held Tobey's submarine. There is also a weird love triangle among the three as well which enhances the story I believe. All in all this is a fine piece of classic science fiction entertainment.",
         "It Came From Beneath The Sea was the first of many movies involving the partnership of producer Charles H Schneer and Ray Harryhausen. A giant octopus makes its way to San Francisco and attacks several ships and submarines on the way. When there, it brings down the Golden Gate Bridge and destroys several other landmarks before being attacked by flame throwers to send it back into the sea, where is it blown to bits by a torpedo. The stop-motion animation by Ray Harryhausen is excellent, despite the fact that the movie's low budget made the octopus have six tentacles instead of eight. The cast is lead by 50's sci-fi regulars Kenneth Tobey (The Thing From Another World, The Beast From 20,000 Fathoms), Faith Domergue (This Island Earth) and Donald Curtis (Earth vs the Flying Saucers). A love triangle develops with these stars to keep the movie going. I enjoyed this movie and is a must if you are a fan of 1950's sci-fi and Ray Harryhausen like me. Rating: 4 stars out of 5.",
         "When an atomic-powered submarine runs afoul of something most bizarre on their radar, its Commander Pete Matthews decides not to risk the $ 55 million dollar naval submarine he commands and tries to head out of the area but suddenly the submarine is unable to move while something outside them is emitting radiation. Eventually after a considerable struggle, they do escape and later discover that what had held them down was in fact a giant Octopus! From scientists Dr. John Carter (Donald Curtis) & Dr. Leslie Joyce (Faith Domergue), working along with the military's Commander Matthews, we learn that this Octopus has undergone an atomic mutation and has now come to prey on man instead of fish and is all set to ravage the West Coast of America. Eventually it surfaces and attacks the Golden Gate Bridge while San Francisco panics in fear! Can It be stopped? The real star of this film is Harryhausen's Giant Octopus, who even with only six tentacles, manages to make a more lasting impression on the viewer than most of the cast. That said, the theme of feminism is also an important undercurrent of this story and I felt Faith Domergue did a wonderful job with what she was given to work with. The moments she coaxes the trans-steamer survivor into admitting it was a giant Octopus that attacked his ship is a great one for her. While this movie is much too slow getting to its eventual pay-off for most viewers, it's never bothered me as much because I felt Domergue and Tobey had a great chemistry on screen together and I actually liked the addition of their romance here. Still this has to be one of the first disaster films really considering how a giant Octopus nearly does in San Francisco...and well that's a cool and fun premise for a movie in my book (even if one does have to swallow one's disbelief).",
         "In the 1950s and 60s, there were practically zillions of giant radioactive monster films. Giant shrews, ants, spiders, dinosaurs and whatnot scared audiences and were immensely popular throughout the world. For example, THE BEAST FROM 20,000 FATHOMS (1953) clearly led to Japanese films such as Godzilla (1954) and its many spin-offs. In general, these films were super-cheesy--having pretty second-rate special effects (even for the time) and lousy dialog. Godzilla was a guy in a reptile suit, TEENAGERS FROM OUTER SPACE used a lobster and THE KILLER SHREWS used hairy costumes placed on dogs--all very high on the \"cheese-o-meter\". However, a very small number of these films did have decent special effects for the time period and tried to be serious entertainment--and IT CAME FROM BENEATH THE SEA is one of them. Unlike many giant monster films, IT CAME FROM BENEATH THE SEA looked like it had a larger budget. Much of this was because they had the cooperation of the navy and because they used GOOD stock footage--not the usual grainy and irrelevant filler used in many of these films. It also looked big budget because of the work of Ray Harryhausen. Now, in the 21st century, his work appears rather crude and old fashioned, but for the mid-1950s it was state of the art and still holds up reasonably well if you aren't an idiot who expects CG and state of the art effects. Sure, the giant octopus looks a bit odd and is obviously controlled through stop-motion, but it is very well integrated into the scenes and still impresses. It's obvious that they really cared and wanted to make a quality picture. As far as the romance and dialog goes, I will admit it has a lot of clichés--such as the brainy but sexy female scientist. However, it was handled a bit better than usual and at least Faith Domergue (a perennial in 50s sci-fi) was pleasant looking. I know it's weird, but I really get turned on by the \"brainy scientists\" in these film. In fact, I married one myself--though she has no experience, so far, with giant monsters! Don't worry folks--I showed this review to my wife and I am NOT in the dog house! For lovers of the genre, this film is a must. For those who think giant monsters attacking mankind are stupid, then at least one is better than most of the rest!!",
         "It Came From Beneath the Sea was one of the better monster films from the Fifties as Hollywood cinema was desperately trying to compete with the small picture box gradually invading American homes. One of the answers was large screen special effects and this film was one of the best in that department. Ray Harryhausen's name so far is still the only special effects man that I know who's name will actually encourage people to buy a movie ticket. He created some marvelous film monsters and this was one of his best. The octopus we are told comes from the Mindinao Deep, a spot on our planet still not totally explored because it is the deepest part of our ocean's bottoms. Presumably there are a whole lot more like him around and in point of fact to this day we don't know all the creatures of the sea. That perennial villain of Fifties Science fiction, atomic testing and/or radiation has made this big guy move out of the depths and try to capture Captain Kenneth Tobey's submarine. He barely gets away and Tobey's is the first of several incidents involving the creature. Scientists Faith Domergue and Donald Curtis are also on the job and the creature ends up in San Francisco Bay. He does a number on the Golden Gate bridge and then tries to beach himself at the Embarcadero. Army flame throwers see that doesn't happen. Faith Domergue was a really beautiful woman who became known again through the Howard Hughes biographical film, The Aviator. She was at one time Hughes's main squeeze. This is probably the film she's most known for though. There's one scene where Domergue uses her best asset to convince a merchant seaman whose ship has been sunk by the octopus, but is afraid of being given a section 8, to fess up about the monster. Kind of campy, but fun. The monster's no villain here as in some films. He's just a creature whose habitat man has disturbed that's trying to survive. Unfortunately we can't have him roaming the Pacific destroying all kinds of civilian and military activity. So he has to be killed. For me it was a bit sad seeing the outcome. I think other viewers will feel the same way.",
         "Ray Harryhausen's giant octopus is a stop-motion MASTERPIECE! An excellent film & story! Trivia: The producer's budget wouldn't allow the creation of an 8-tentacled octopus, so it only has SIX legs (this isn't noticeable, 'cos u think the other two are under water!). And, the City of San Francisco didn't want the \"landmark of their city\", the Golden Gate Bridge destroyed (even in miniature!), so the cameras & crew had to be \"smuggled\" on the actual bridge! A MUST-SEE film from the 50's !",
         "Greatly enjoyed viewing this film in the 1950's and all the audiences were thrilled at seeing this sea monster tackle the Golden Gate Bridge and terrify all the people in San Francisco. This film cannot compare to the films being made in 2000, however, in 1955 it was a great B Film and is presently and always will be a great Classic. Kenneth Tobey, who was a submarine captain, \"Body Shot\",'93 gave an outstanding performance along with Faith Domerque,\"The House of Seven Corpses\",'74 who was a beautiful young actress and acted like a very strong willed woman who was hard to charm off her feet. Unfortunately, Faith had a short career due to her struggle with cancer. This is truly a great Classic Film of the 50's. Enjoy!",
         "Having already starred in 'The Thing from Another World' (1951) and 'The Beast from 20,000 Fathoms' (1953), Kenneth Tobey completed a memorable treble of classic Sci-Fi films with this offering. Make no mistake, 'It Came from Beneath the Sea' is one of the classics of the genre and as such is above the mundane criticism about poor script, narrative, performances etc. We all know that these monster-flicks from the 50's and 60's had their shortcomings, but they were made to a formula for a target audience and in this respect there is little to fault and much to commend. Here we have a giant octopus, disturbed from it's Pacific lair by atomic testing, heading for San Francisco in a foul mood. The Harryhausen effects are great, the narrative follows a course of some scientific logic and Faith Domergue, if a little too old, looks good enough in her tight blouse. Director Robert Gordon did little else of note which is surprising - he did a good enough job here and whilst not up to the standard of '20 Million Miles to Earth' (1957), 'It Came from Beneath the Sea' is still superior for its type. BEST SCENE - no contest; the octopus trashing the Golden Gate Bridge.",
         "I've been a fan of Ray Harryhausen since I was old enough to appreciate movies, so I bought the DVD of \"It Came From Beneath the Sea\" even though I hadn't seen the film in many years. Having rewatched it, I have to admit that it's perhaps the least of his film accomplishments. Once again, the atomic bomb provides the justification for another giant monster, though, despite what has been inaccurately reported elsewhere, the octopus in the film has not been mutated by radiation. It's simply a very large example of its kind that was living at the bottom of a deep ocean trench. When atomic testing made it radioactive, it couldn't effectively hunt because other sea creatures could somehow sense its presence. Therefore, it came to the surface in search of food. One of the major problems with this film is that while an octopus makes a decent giant monster, it completely lacks the personality of some of Harryhausen's other creatures. Furthermore, it is confined to the sea--and, by extension, the shoreline--limiting its ability to go on a proper rampage. Even at 79 minutes, the film moves very slowly until the climax. The opening sequence, in which the beast attacks a submarine captained by Kenneth Tobey's character, goes on for several very long minutes of inconsequential naval dialogue. The lethargic pacing extends to the plot as well. The team of scientists assigned to determine what attacked the sub take a full two weeks to identify it as an octopus. An odd love triangle of sorts pads the running time. Faith Domergue--who is presented as a modern feminist despite her tendency to scream on cue--seems just as interested in Tobey's navy man as she does in her fellow scientist. The two men acknowledge the triangle, but neither seems at all competitive about it. Domergue is one of the best things about the film. She's credible as both scientist and sweater gal, and is a good example of the increasing role of female characters in science-fiction films of the period. Once the octopus attacks in earnest, things pick up quite a bit, and Harryhausen's effects--including stop-motion-animated building demolition--are quite effective. While this is definitely a lesser effort for him, he still shows what he can do with a small budget and a relatively uninteresting monster.",
         "In the 1950s cinema was subjected to (graciously in my case) a number of things that came to wreak havoc on mankind. Be it nuclear enhanced spiders and ants marching forth from the desert or various beings from outer space come to deliver alien fury. Hell we even had giant water snails laying slimy waste to all in their way. But what of the ocean? So much potential down there. Rhedosaurus and Gojira had come from the sea to lay a marker down for the big lizard, but what of the natural creatures? Sharks? Well Spielberg's genre daddy was some 20 years away. Whales? Crabs? Squids? Ah what about a giant Octopus? Now there is scope for a riot. Lets make him a product of atomic blasting, awoken from the Mindanao Deep, keep it sympathetic 9it's just being natural after all), set up an attack on a bastion landmark of Americana and get stop-mo genius Ray Harryhausen to work his wonders. So they did. It Came from Beneath the Sea, if you pardon the pun, holds its head above water in the creature feature, sci-fi schlockers genre. Starring Faith Domergue (This Island Earth), Kenneth Tobey (The Beast from 20,000 Fathoms) and Donald Curtis (Earth vs. The Flying Saucers), it has safe and solid genre credentials. Though guilty of being over talky, in that the science being offered up isn't worthy of such meanderings, the script does allow for a feminism angle that should be applauded for the time it was made. Even if it's almost smothered by the love tryst shenanigans of our three central players that is. Filmed on location in San Francisco to add some level of authenticity to the story and having a running time that doesn't let it outstay its welcome. It Came from Beneath the Sea is a fine genre piece worthy of yearly revisits. 7/10"
      ],
      "genres": [
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Clover Productions"],
      "summaries": [
         "After an encounter at sea with an unknown underwater creature, a naval commander works with two scientists to identify it. The creature they are dealing with is a giant, radioactive octopus that has left its normal feeding grounds in search of new sources of replenishment. As the creature attacks San Francisco, the Navy tries to trap it at the Golden Gate Bridge but it manages to enter the Bay area leading to a final confrontation with a submarine.",
         "A Giant Octopus, whose feeding habits have been affected by radiation from H-Bomb tests, rises from the Mindanao Deep to terrorize the California Coast."
      ],
      "budget": 0
   },
   "movielensId": 2663,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-07-01",
      "dvdReleaseDate": "2003-05-06",
      "directors": ["Robert Gordon"],
      "runtime": 79,
      "movieId": 2663,
      "title": "It Came from Beneath the Sea",
      "mpaa": "NR",
      "actors": [
         "Kenneth Tobey",
         "Faith Domergue",
         "Donald Curtis",
         "Chuck Griffiths",
         "Ian Keith",
         "Dean Maddox Jr.",
         "Harry Lauter",
         "Richard W. Peterson"
      ],
      "imdbMovieId": "0048215",
      "originalTitle": "It Came from Beneath the Sea",
      "genres": ["Science Fiction"],
      "youtubeTrailerIds": [
         "0nmOjIUR9kA",
         "9_zaBMZ1WcM"
      ],
      "plotSummary": "A Giant Octopus, whose feeding habits have been affected by radiation from H-Bomb tests, rises from the Mindanao Deep to terrorize the California Coast.",
      "tmdbMovieId": 29959,
      "avgRating": 3.01464,
      "releaseYear": "1955",
      "numRatings": 239,
      "posterPath": "/wTFPbEWY1zQxU92qCl8Exx3WpKS.jpg"
   }
}