{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "washington d.c.",
            "id": 521
         },
         {
            "name": "flying saucer",
            "id": 3243
         },
         {
            "name": "u.s. army",
            "id": 4595
         },
         {
            "name": "stop motion",
            "id": 10121
         },
         {
            "name": "alien invasion",
            "id": 14909
         },
         {
            "name": "u.s. space program",
            "id": 184993
         },
         {
            "name": "scientist hero",
            "id": 191519
         },
         {
            "name": "global threat",
            "id": 206959
         },
         {
            "name": "ray harryhausen",
            "id": 236321
         },
         {
            "name": "property destruction",
            "id": 238057
         },
         {
            "name": "land-air battle",
            "id": 239335
         },
         {
            "name": "ray weapons",
            "id": 239336
         },
         {
            "name": "sonic weapon",
            "id": 239337
         },
         {
            "name": "foo lights",
            "id": 239338
         },
         {
            "name": "rocket launch site",
            "id": 239339
         }
      ],
      "imdb_id": "tt0049169",
      "video": false,
      "title": "Earth vs. the Flying Saucers",
      "recommendations": [
         36089,
         831,
         43715,
         28763,
         19483,
         34276,
         41516,
         41020,
         29959,
         29570,
         52745,
         35073,
         31244,
         6974,
         28667,
         93115,
         9077,
         3593,
         43109,
         100307
      ],
      "backdrop_path": "/tM6PeD6pKCxgTTmXMGJ4ca97KV9.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "540b5fcec3a36879a5001ca6",
         "content": "Restrained but still an effective piece of sci-fi pie.\r\n\r\nReports of flying saucers start coming in thick and fast until sure enough alien invaders begin to attack the Earth. Focal point of their attack is the U.S. Space Programe, can hero in waiting Russel Marvin conjure up a defence weapon to save the day?\r\n\r\nObviously a template for many an alien invader film since its release, Earth Vs The Flying Saucers never quite reaches the heights that perhaps it should have. Bogged down by maudlin scripting and restricted by its budget, it often hints at what a great picture it could have been. The lead cast are poor and this hurts the film even more, Hugh Marlowe as Russell Marvin bores us with the scientific speak when really he should be fascinating us, whilst scream queen duties fall to poor Joan Greenwood who forgets that she is actually supposed to emit some sort of terror when the alien hordes attack! However, on the plus side the aliens themselves are certainly creepy enough to grab your notice, Ray Harryhausen's flying saucers animation is of course top dollar for its time, whilst the final battle across Washington DC is classic gold, an all buzzing assault with splurges of death rays at every turn.\r\n\r\nAn important film in the pantheon of the genre for sure, but it's just a tad too restrained for its own good. 6/10",
         "url": "https://www.themoviedb.org/review/540b5fcec3a36879a5001ca6"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Russell A. Marvin",
               "gender": 2,
               "credit_id": "52fe47639251416c75097a49",
               "name": "Hugh Marlowe",
               "profile_path": "/z0OHigEHpORu2Dle1lhM5MeG0xn.jpg",
               "id": 10609,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Carol Marvin",
               "gender": 1,
               "credit_id": "52fe47639251416c75097a6b",
               "name": "Joan Taylor",
               "profile_path": "/j8cdMGRigVbNABoSBMeUKUl2VWS.jpg",
               "id": 106017,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maj. Huglin, Liason Officer",
               "gender": 2,
               "credit_id": "52fe47639251416c75097a4d",
               "name": "Donald Curtis",
               "profile_path": "/tW9pHQ3GlfLgbDup4Q70p0QPfoK.jpg",
               "id": 35847,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Vice Adm. Enright",
               "gender": 0,
               "credit_id": "52fe47639251416c75097a59",
               "name": "Thomas Browne Henry",
               "profile_path": "/2TVfKY4IcY9C7J8kXx3bCdCUVLX.jpg",
               "id": 82748,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Brig. Gen. John Hanley",
               "gender": 2,
               "credit_id": "52fe47639251416c75097a51",
               "name": "Morris Ankrum",
               "profile_path": "/vLlnpSWAParcYOFMKL0nrNCYW3o.jpg",
               "id": 81182,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gen. Edmunds",
               "gender": 0,
               "credit_id": "52fe47639251416c75097a5d",
               "name": "Grandon Rhodes",
               "profile_path": "/llcaHJsyLM45W4gETYJri4a0qKW.jpg",
               "id": 82749,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Prof. Kanter",
               "gender": 2,
               "credit_id": "52fe47639251416c75097a55",
               "name": "John Zaremba",
               "profile_path": "/AjH1gao2p6ZcuI6GwNm6H3f9j31.jpg",
               "id": 82747,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Motorcycle cop",
               "gender": 2,
               "credit_id": "52fe47639251416c75097a61",
               "name": "Larry J. Blake",
               "profile_path": "/cDpE64sWON2AYpXPawPvUE2Kp9L.jpg",
               "id": 82750,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47639251416c75097a67",
               "name": "Fred F. Sears",
               "profile_path": "/ykdb4pl0VWlhc9moPPWXdcrf4pQ.jpg",
               "id": 82751,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe47649251416c75097a71",
               "name": "Donald E. Keyhoe",
               "profile_path": null,
               "id": 1188928,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe47649251416c75097a77",
               "name": "Curt Siodmak",
               "profile_path": "/pJTXFWsOB5MX5umPBgyD3qrxZ6U.jpg",
               "id": 5028,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "52fe47649251416c75097a7d",
               "name": "George Worthing Yates",
               "profile_path": null,
               "id": 30969,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe47649251416c75097a83",
               "name": "Bernard Gordon",
               "profile_path": null,
               "id": 84938,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57277836c3a3680e61000dea",
               "name": "Ray Harryhausen",
               "profile_path": "/nxsvHuPnWQBFuGOq6Gs100kh74R.jpg",
               "id": 66758,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 2,
               "credit_id": "5793bcd89251410d1200dc5c",
               "name": "Fred Jackman Jr.",
               "profile_path": null,
               "id": 52759,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5793bdb392514156800012ea",
               "name": "Paul Palmentola",
               "profile_path": null,
               "id": 1176363,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5793bdd792514156e600129f",
               "name": "Danny B. Landres",
               "profile_path": null,
               "id": 1120749,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5793be1bc3a36828a600c6da",
               "name": "Sidney Clifford",
               "profile_path": null,
               "id": 34115,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "5793be4ec3a3683fb00013b0",
               "name": "Gene Anderson Jr.",
               "profile_path": null,
               "id": 1539050,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "5793beabc3a368631c00b777",
               "name": "Russ Kelley",
               "profile_path": null,
               "id": 1655090,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "5793bee7c3a368403d001409",
               "name": "J.S. Westmoreland",
               "profile_path": null,
               "id": 961298,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 2,
               "credit_id": "5793bf7b92514169c500af11",
               "name": "Jack Erickson",
               "profile_path": null,
               "id": 1176364,
               "department": "Production",
               "job": "Production Coordinator"
            },
            {
               "gender": 2,
               "credit_id": "5793bfc0c3a368403d00148a",
               "name": "Leon Chooluck",
               "profile_path": null,
               "id": 8344,
               "department": "Production",
               "job": "Unit Manager"
            },
            {
               "gender": 2,
               "credit_id": "5793bffec3a3683fb0001489",
               "name": "Charles H. Schneer",
               "profile_path": "/2HUfWC6uXFy7ed3eciHwORt6aVm.jpg",
               "id": 66759,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5793c039c3a368403d0014c1",
               "name": "Sam Katzman",
               "profile_path": null,
               "id": 34112,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 5.584012,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18158,
      "vote_count": 49,
      "budget": 0,
      "overview": "Test space rockets exploding at liftoff and increased reporting of UFO sightings culminate in a direct attempt by alien survivors of a dead, extra-galactic civilization to invade Earth from impervious flying saucers, using ray-weapons of mass destruction.",
      "similar": [
         7453,
         601,
         607,
         608,
         47933,
         299687,
         137113,
         228161,
         2675,
         16866,
         840,
         9982,
         4858,
         10122,
         10513,
         11954,
         8741,
         16442,
         11549,
         80035
      ],
      "original_title": "Earth vs. the Flying Saucers",
      "runtime": 83,
      "poster_path": "/2uZiDKBAfBYGvJwJDgFaeY3szSh.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Clover Productions",
            "id": 3458,
            "origin_country": ""
         },
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         }
      ],
      "release_date": "1956-07-04",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The terrifying truth about flying saucers!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Fred F. Sears"],
      "runtime": 83,
      "synopsis": "Opening scene We see a montage of UFO sightings including Air force pilots, farmers and civilians. After collecting and examining these reports the military decides they are a threat and orders a shoot on sight order Then Dr. Russell Marvin (Hugh Marlow) and his recently married wife Dr. Carol Marvin (Joan Taylor) are driving through the desert to a rocket testing ground - Project Skyhook, when they are buzzed by a UFO. Although they don't realize it at the time, a recorder used to dictate research notes has picked up and recorded the UFO encounter. General John Hanley (Morris Ankrun) arrives at the rocket range and begins trying to postpone the launch. However Marvin and other scientists advise it is too late to abort the launch. During this conversation we discover that Carol Marvin is his daughter, and although pleased for the couple was unaware of their recent marriage. Rocket 11 launches without incident That evening over dinner the General discusses with the Marvins the failure of the previous 10 rockets launched in the program. Dr. Marvin surmises that UFOs might have shot the rockets down; he then reveals the recording he made during his encounter with the UFO. As dinner is finishing the three of them see glowing lights in the sky, Carol explains they are fog lights, and no one knows what they are. A few seconds later the wreckage of rocket 11 enters the atmosphere and burns up. Against everyone's better judgment, it is decided to launch rocket 12. During preparations for the launch a UFO is seen buzzing the rocket range before landing in the middle of the facility. Three suited occupants emerge and are fired upon by soldiers. The aliens retaliate, as one of their group is killed. Returning to their ship with their fallen comrade the aliens take off and begin to systematically destroy the rocket test area, kidnapping General Hanley in the process Trapped below ground by fires started during the attack, the Marvins begin to consider rescue unlikely. With their air running out, they decide to make a recording of the events that led up to the alien attack. The tape recorder they are using starts to lose power slowing the playback down. Rewinding the tape the Marvins realize the noise they heard was greatly sped up message from the aliens asking them to meet at the rocket installation. Dr. Marvin understands that a terrible mistake has occurred and fears what might come of it. To their surprise the Marvins are rescued and race to Washington to reveal what they have learned. The authorities expressly forbid Dr. Marvin from making contact with the aliens. Ignoring this, Marvin does contact them and gets new instructions for a meeting place: a beach on the California coast. Carol and Major Huglin (Donald Curtis) discover his plan and try to stop him, racing to the rendezvous point, where the aliens have already landed. Marvin ignores them and approaches the ship. A voice explains it is safe to enter, which they do. Once inside the ship a disembodied voice explains the aliens' mission. They come from a dying star and need to find a new place to live. They demand that Earth surrenders and let them control of the planet. The aliens then admit they have Carol's father onboard and have sucked all memories out of his brain, reducing him to a zombie-like state. Finally, they give Earth an ultimatum of two lunar months to surrender or they will attack with their fleet. Once this is understood, the humans are released, except General Hanley. Back in Washington, the group is debriefed over events on the ship. Further debate breaks out over exactly how to handle the situation. Dr. Marvin explains given his interactions with the aliens he might have an idea for a weapon that could stop the attack. The military embraces the idea of a weapon that uses sound to disorientate UFOs causing them to crash. With only sixty days to the attack the military begins talking to other nations to help speed up and build enough weapons to fend off the attack. Weeks pass and the development is better than expected. During a final test of the weapon a spy drone sent by the aliens is spotted. During a final test of the weapon, an alien spy drone is spotted observing the area, the scientists destroy the drone, but fear the aliens now have valuable information regarding the weapon and its location. The scientists evacuate but during the final stages of the process an alien ship arrives. Seeing an opportunity the weapon is deployed against the ship. The ray works and the aliens are driven off, but not before one of them is killed and left behind. Opening the alien's suit reveals a highly atrophied corpse, it is thought that the aliens are quiet fragile and need the suits to survive. In a matter of minutes the corpse rots and disappears to nothing. Before any more can be done the UFO returns and destroys the installation where the weapon had been housed. As the UFO leaves after the successful attack, two bodies are seen falling from the craft. One of them is Carol's dead father, General Hanley The next day further examination of the suit reveals a communication device, with which the military is able to interpret the attack plan of the aliens. It also appears to be able to amplify both sight and hearing. Examining how the attack succeeded the day before, a disadvantage is discovered in that the ray only has a range of 1500 yards. The aliens interrupt the discussion with a worldwide broadcast threatening to manipulate the sun in such a way as to cause severe meteorological convulsions in eight days . The aliens insist that all the world leaders should meet in Washington to discuss surrender terms The military believes rather than discussing anything the aliens intend to destroy Washington. As predicted, the solar eruption takes place. It is further realized that there are only nine days to prepare, and those preparations are going to suffer due to worsening weather conditions. We now see a montage of the increasing disruption by the weather. This causes delays evacuating civilians, and there is still 60% of the population still in the city when sirens begin to sound indicating the attack has begun. The aliens brush past a combined aircraft and artillery attack and three crafts begin to assemble over Washington. Dr. Marvin fires the sound weapon and downs one of the alien craft. Artillery batteries open fire again to distract the remaining ships as Dr. Marvin repositions his weapon to attempt a further attack. The aliens respond by opening fire on various buildings around the White House and Capitol building. Dr Marvin races with their team to re-deploy and defend the White House. A second ray unit is destroyed and the aliens land. Local soldiers attempt to slow down the invaders as the second machine deployed. The two remaining ships are brought down in quick order. On the other side of Washington more ray units deploy and yet another ship is brought down crashing into the Washington monument. A running battle breaks out around the Supreme Court trapping the Marvins amid the wreckage. An emergency broadcast announces that more saucers are landing in front of the Capitol building. A battle intensifies as more ships appear and the aliens leave their craft in one final assault. This is beaten back with a combination of ray machines and infantry. Suddenly everything goes quiet and slowly the realization comes that the battle is over and the aliens have been repelled. Some time has passed and we now find the Marvins relaxing on a beach. Mrs. Marvin reads a newspaper article that her husband has been placed in charge of rebuilding Project Skyhook and that the United Nations is going to award him a gold medal. The two go for a swim in the ocean as the final credits roll.",
      "writers": [
         "Donald E. Keyhoe",
         "Curt Siodmak"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049169/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjM1NTY2MTUzNF5BMl5BanBnXkFtZTgwMjMyMjkyMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Hugh Marlowe, Joan Taylor, Donald Curtis | See full cast and crew »"],
      "reviews": [
         "Ray Harryhausen should have received top billing in this film, since his superb stop-action animation is the real star here. None of this nonsense about wise and benevolent aliens a la \"The Day the Earth Stood Still\"! Here, the aliens are nasty and mean business. The mass saucer attack on Washington is a classic scene; swiped by everything from \"Independence Day\" to a TV commercial for a nationwide chain of fast-food restaurants. Although the saucer's \"magnetic propulsion\" is scientific balderdash (Earth's magnetic field is just about strong enough to swing a compass needle.); still it's thrilling to see the military and the scientists racing around D.C. in 1-and-a-half ton trucks with diesel generators and \"magnetic disruptor's\" mounted on the truck beds. (They look a bit like an out-sized Maxim machine gun.) When these are fired at an alien ship, it starts to wobble wildly until it falls and crashes. At one point, a saucer lands on the White House lawn in an attempt to kill or capture the President (Eisenhower) (gasp!) The aliens step out clad in silver spacesuits that act as powered exoskeletons that enable them to walk while under Earth's gravity. Fortunately, these are magnetically powered like their ships and Hugh Marlowe (who played Patricia Neal's lunkhead boyfriend in \"The Day the Earth Stood Still\") arrives on the scene with one of those disruptor's and drives them off. There is an interesting scene earlier in the film where an alien is subdued and the helmet wrenched off of his suit. Before crumbling to dust in our atmosphere, you can see out-sized black eyes, no nose, and a slit-like mouth set in a light-bulb shaped head. I didn't think this idea of an alien occurred to anybody until the 1970's. Despite perfunctory acting and scientific howlers, this movie is still endearing, not only for the fine special effects (CGI is a bit too slick for me.), but also for an innocence that would soon be lost. For the following year after this film was made, the Soviet Union would shock America by launching the first artificial satellite (Sputnik I) into Earth orbit using the first ICBM. This meant that the Soviets could launch a nuclear warhead at the United States. From then until the Cuban Missile Crisis persuaded both sides to back down from hair-trigger postures, fears of nuclear war would put possible interplanetary war very much in the shade.",
         "While \"War of the Worlds\" is probably the most heralded of the 1950s alien invasion films, this one is a lot more fun. There are none of the heavy-anded quasi-religious sub-texts that weighed down WOTW. There are no pretensions of any kind. \"Earth\" gets right down to the business at hand...aliens coming to Earth with the sole purpose of kicking our asses. Throw in the always fun Harryhausen effects, in which real life monuments are destroyed (later incorporated in the equally dumb and equally fun \"ID4\"), and what's not to like?",
         "There are no dull frames in this remarkable saucer invasion film set directly in the center of the fifties. Harryhausen met the challenge of animating flying machines. Sure enough, they whiz, spin, even wobble when need be. Saucers even have a protruding ray-gun device. The action begins during the credits and never lets up. Admittedly, it's fifties. But it was impressive enough to heavily influence Tim Burton's Mars Attacks. You can't miss the references. Film is packed with clever and creative touches such as the tape recording including aliens speaking at a speed natural for them, but not for us on Earth. If you are not terribly put off by 50's, black and white, and (god forbid) stop motion, you can't go wrong with this quintessential sci-fi extravaganza.",
         "Ray Harryhausen developed the flying saucers for this film, and they are worth seeing to be sure. The story is about how a space creature has contacted a professor on Earth, played nicely by Hugh Marlowe, and wants him to talk to his leaders. When there is a communication problem, the aliens destroy a rocket base. In short time, the aliens let the Earth and its people know that their intent is to take over the planet. Marlowe, working in conjunction with the military, develops a machine which renders the space ships incapable of straight flight. The film is a prime example of what good science fiction is all about. It has tension, extraterrestrials, fast pacing, and good special effects for its day. This film is very suspenseful and well worth a look.",
         "I always wondered how they managed to pick the name of the main character in this movie (Dr. Russell A. Marvin). That is my name, and it is very uncommon. When I saw the credits in the IMDB, I realized the answer. The inspiration for this movie was a book by Donald E. Keyhoe, who was consulted on this film. In 1956, Keyhoe started an organization called NICAP (National Investigations Committee on Aerial Phenomena). In 1956, I was a real flying saucer enthusiast, and was one of the very first people to join NICAP. I believe that they picked my name off of Keyhoe's membership list. I was 14 years old at the time. Anyway, it's a good flick with some great special effects (done the old fashioned way) by the legendary Ray Harryhausen.",
         "A model of restrained, professional film making, EARTH VS. THE FLYING SAUCERS would be one of the best 50s sci-fi efforts had Columbia studios provided more of a budget. Hugh Malowe plays a scientist attempting to launch earth satellites. After repeated failures, he discovers that flying saucers are destroying his satellites. After the destruction of Cape Canaveral by the \"saucermen,\" Marlowe discovers a method of \"toppling\" the anti-gravity saucers. From there the story pretty much unravels. The \"saucermen\" give Marlowe and his team plenty of time to develop a weapon capable of defeating them. Worse, the final assault on Washington is as senseless and ineffectual as the typical US Presidential debate. The aliens pick virtually no targets of tactical or strategic importance. Ray Harryhausen's flying saucers, the alien's \"exoskeletons\" and sound effects in this movie are especially standout.",
         "This is a terrific older sci-fi movie. It has all the elements to make it a sold movie; a good variety of characters, an interesting plot, and a solid script. The great special effects are just icing on the cake. Much of the movie is told in documentary style with a voice-over of someone, which adds to the realism. You can feel connected with the main characters and what goes on in the movie. Even most of the characters that don't have much of a role seem realistic, not two-dimensional (like some in Spider-man). The plot has many viable twists and the movie comes to a exciting and feasible conclusion (un-like Independence Day). Many/most people will find it more entertaining than the \"classic\" sci-fi invasion movie War of the Worlds. This movie, even though it was a relatively mid-budget movie made in the 1950's, should serve as a message to modern day Hollywood. It shows how a movie if made with a lot of thought and heart, as opposed to just violence and/or sensualism, can produce a real winner.",
         "Certainly, the renowned/redoubtable Ray Harryhausen's special effects are absolutely superb in this 1956 sci-fi film. As several of the previous posters have already pointed out, the late Maj. Donald E. Keyhoe (one-time director of the National Investigations Committee on Aerial Phenonema, based in Washington, D.C.) served as technical adviser to this film. In fact, Maj. Keyhoe always maintained that alien (?) spacecraft HAD buzzed our nation's capital, during the summer of 1952. Veteran actors Hugh Marlowe, Morris Ankrum and Donald Curtis (who, I believe, portrayed \"Prince Barron\" in one of the final Flash Gordon serials) appear in the film. However, the wonderful and voluptuous Joan Taylor also appears as Carol Marvin (Hugh Marlowe's new bride in the film). Now, Ms. Taylor also appeared as the medical student granddaughter (?) of a scientist in another 1950s sci-fi flick, \"20 Million Miles to Earth.\" And, I MUST say that Ms. Taylor looked terrific in those shorts of hers, as she and her granddad were conducting scientific research in sunny Sicily, when that U.S. space ship returned, rather abruptly, to Earth. (Seeing her perambulate through the verdant Sicilian countryside, I felt like singing Dean Martin's \"That's Amore!\") Yet, my favorite scene in \"Earth Versus the Flying Saucers,\" was at the film's conclusion, when, Ms. Taylor and Mr. Marlowe are sitting on a beautiful beach as the sun is starting to set, and she says to Mr. Marlowe: \"Do you think that the aliens will ever return to Earth?\" To which, Mr. Marlowe (looking at his beautiful bride, attired in her extremely-flattering one-piece bathing suit) dreamily replies: \"Not on such a beautiful day as this.\" And, hands held-together, they both happily and somewhat, \"saucily\" scamper into the water!",
         "This was fairly interesting and nicely low-key for a 1950s sci-fi flick....which usually means one thing: hysterical women shrieking and screaming. Well, there's none of that nonsense here. Ray Harryhausen's special-effects were lauded and justifiably so for his era, but you can imagine how they look today 50 years later! They look pretty primitive. The acting is respectable considering the three stars - Hugh Marlow, Joan Taylor and Donald Curtis - are anything but \"stars.\" I do think the story could have used a bit of humor to spice it up a bit, but you can't always get everything. At least this one was one \"flying saucer movie\" that had some intelligence. It might have had too much, because it had very little excitement.",
         "The last time I saw this movie was April the first 1982 which was the day before my younger brother was born . Maybe this is the reason why this movie stuck out in my mind and I certainly remember enjoying EARTH VS THE FLYING SAUCERS ( I've always been a fan of this type of cheesy movie ) though I did recall their being some unlikely occurrences like the hero leaving a tape recorder running which sets up the plot for the movie . !!!! SLIGHT SPOILERS !!!! After seeing the movie again for the first time since 1982 I was struck as to how ridiculous everything about it is now . The aliens land at a secret rocket base . Fair enough , and I have to point out that the reason the troops at the base open fire without asking about the aliens intention ( as one fellow reviewer was confused by this ) is to do with the cold war paranoia at the time , aliens in 1950s movies with a few notable exceptions ( The QUATERMASS trilogy for example ) are surrogate communists so it's entirely logical for American troops to blast away at flying saucers . What is entirely unlikely is that the aliens are able to destroy the rocket base and kill absolutely everyone who isn't connected to the plot ie Washington is entirely unconvinced that the base was destroyed by saucer men due to the lack of eyewitness accounts . What ? The flying saucers didn't show up on radar etc . It's also ridiculous that if the flying saucers have powerful ray guns the aliens needed to land in the first place . Like I said this is not an entirely plausible movie . In fact it's a very silly one Despite this EVTFS still remains a very enjoyable movie as long as you take it for what it it - A 1950s B movie . There's an over reliance of stock film footage , plot holes galore , not very good acting and special effects that don't really stand up to the test of time , but it does contain some entertaining moments like the stranded alien stalking humans in a woodland and the final invasion , and despite some of the technical flaws the sound editing and sound effects are very good . If you also want to be pretentious you could point out the phallic symbolism of the aliens weapons but I wouldn't bother"
      ],
      "genres": [
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Clover Productions"],
      "summaries": [
         "While driving through the desert with his wife Carol Marvin to a military base to send the eleventh rocket into Earth orbit to assist the exploration of outer space in Operation Sky Hook, Dr. Russell A. Marvin and Carol see a flying saucer and accidentally records a message on their tape recorder. Once in the base, Dr. Russell is informed by his father-in-law and general that the ten first satellites mysteriously fell back to Earth. When Dr. Russell decodes the message, he encounters the aliens, who ask him to schedule a meeting with the leaders of Earth in Washington in 56 days in order to invade Earth without panicking the population. Dr. Russell develops an anti-magnetic weapon that becomes the last hope of the human race against the hostile aliens.",
         "Dr. Russell Marvin heads up Operation Skyhook, which is tasked with sending rockets into the upper atmosphere to probe suitability for future space flights. Unfortunately, all the rockets somehow disappear. While investigating this strange occurrence, Russell and his new wife Carol are abducted by a flying saucer. The aliens demand to meet with certain people in order to negotiate... but it is a trick, and the Martains only want to kill them. The invasion has begun and if Russell and Carol can't find a way to stop these creatures by getting past their defenses, it may be the end of the human race.",
         "Extra-terrestrials flying in high-tech flying saucers contact scientist Dr. Russell Marvin as part of a plan to enslave the inhabitants of Earth."
      ],
      "budget": 0
   },
   "movielensId": 2665,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-07-04",
      "dvdReleaseDate": "2002-09-17",
      "directors": ["Fred F. Sears"],
      "runtime": 83,
      "movieId": 2665,
      "title": "Earth vs. the Flying Saucers",
      "mpaa": "NR",
      "actors": [
         "Hugh Marlowe",
         "Joan Taylor",
         "Donald Curtis",
         "Thomas Browne Henry",
         "Morris Ankrum",
         "Grandon Rhodes",
         "John Zaremba",
         "Larry J. Blake"
      ],
      "imdbMovieId": "0049169",
      "originalTitle": "Earth vs. the Flying Saucers",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "2o4fdX8gUMY",
         "eSur4b3iGBg"
      ],
      "plotSummary": "Test space rockets exploding at liftoff and increased reporting of UFO sightings culminate in a direct attempt by alien survivors of a dead, extra-galactic civilization to invade Earth from impervious flying saucers, using ray-weapons of mass destruction.",
      "tmdbMovieId": 18158,
      "avgRating": 3.10662,
      "releaseYear": "1956",
      "numRatings": 408,
      "posterPath": "/2uZiDKBAfBYGvJwJDgFaeY3szSh.jpg"
   }
}