{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mushroom",
            "id": 333
         },
         {
            "name": "expedition",
            "id": 1963
         },
         {
            "name": "sacrifice",
            "id": 2858
         },
         {
            "name": "earthquake",
            "id": 3521
         },
         {
            "name": "ritual",
            "id": 4720
         },
         {
            "name": "glacier",
            "id": 7330
         },
         {
            "name": "prologue",
            "id": 11005
         },
         {
            "name": "creature",
            "id": 13031
         },
         {
            "name": "archaeologist",
            "id": 41586
         },
         {
            "name": "albino",
            "id": 163531
         },
         {
            "name": "hidden civilization",
            "id": 195394
         },
         {
            "name": "mesopotamia",
            "id": 225468
         }
      ],
      "imdb_id": "tt0049516",
      "video": false,
      "title": "The Mole People",
      "recommendations": [
         29324,
         26923,
         31280,
         52196,
         34077,
         43716,
         110336,
         86191,
         30342,
         52745,
         126487,
         29067,
         39154,
         3164,
         112481,
         43135,
         28073,
         31244,
         28586,
         85498
      ],
      "backdrop_path": "/hcQooF44BCjm5r1JGZxsr8VwYJi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dr. Roger Bentley",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbc87",
               "name": "John Agar",
               "profile_path": "/9fKJvICRu2KS6Q70R7plPUkCkTY.jpg",
               "id": 103071,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Adad",
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbc8b",
               "name": "Cynthia Patrick",
               "profile_path": "/kDeSAeOlRkp2MK0E11O4N1drelG.jpg",
               "id": 131005,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Dr. Jud Bellamin",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbc8f",
               "name": "Hugh Beaumont",
               "profile_path": "/xxFBaW9yzC8gvEKN8gr1UBOVhzt.jpg",
               "id": 38232,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Elinu, the High Priest",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbc93",
               "name": "Alan Napier",
               "profile_path": "/mmOemlQeMp0ViF4cy8QL1bArm4y.jpg",
               "id": 6933,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Prof. Etienne Lafarge",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbc97",
               "name": "Nestor Paiva",
               "profile_path": "/9QB3l3jN6npImyMvCHKWTMd7H8Y.jpg",
               "id": 56924,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Dr. Paul Stuart",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbc9b",
               "name": "Phil Chambers",
               "profile_path": "/sBNj3t6wID28T6h0mtoUCfxTOEo.jpg",
               "id": 153443,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Nazar",
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbc9f",
               "name": "Rodd Redwing",
               "profile_path": "/5wn7aA8Ql7ADBOZlpIsyInbGtmB.jpg",
               "id": 102328,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "First Officer",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbca3",
               "name": "Robin Hughes",
               "profile_path": "/ijqdY3bsmcInA5fFSAQgnEyKyVw.jpg",
               "id": 87518,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbca7",
               "name": "Frank Baxter",
               "profile_path": "/2A2WTmar5x4MXIaglVzMpCjc0nR.jpg",
               "id": 121217,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Mole Person",
               "gender": 2,
               "credit_id": "52fe45d0c3a36847f80dbcab",
               "name": "Eddie Parker",
               "profile_path": "/ncw2uHEi2GdVsojhCpRTMt86GtP.jpg",
               "id": 34103,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbc7d",
               "name": "Virgil W. Vogel",
               "profile_path": null,
               "id": 12345,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbcb1",
               "name": "William Alland",
               "profile_path": "/5cnNirYmNRxXRtovuAnka8exirR.jpg",
               "id": 11030,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbcb7",
               "name": "Ellis W. Carter",
               "profile_path": null,
               "id": 117001,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45d0c3a36847f80dbcbd",
               "name": "Irving Birnbaum",
               "profile_path": null,
               "id": 1047190,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "553d3341c3a3685cf8007d6c",
               "name": "László Görög",
               "profile_path": null,
               "id": 1459440,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "557f25fe9251411e54000967",
               "name": "Bud Westmore",
               "profile_path": null,
               "id": 14498,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "557f260b9251415c4f00006d",
               "name": "Joan St. Oegger",
               "profile_path": null,
               "id": 29640,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "557f2619c3a36821b3002adf",
               "name": "Alexander Golitzen",
               "profile_path": null,
               "id": 12346,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "557f2625c3a3682198002950",
               "name": "Robert Emmet Smith",
               "profile_path": null,
               "id": 1110377,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "557f26359251410a2f0028d2",
               "name": "Jay A. Morley Jr.",
               "profile_path": null,
               "id": 936639,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "572f28d9c3a3687c34000796",
               "name": "Heinz Roemheld",
               "profile_path": null,
               "id": 30268,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "572f28e592514118d300119d",
               "name": "Hans J. Salter",
               "profile_path": null,
               "id": 30130,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "572f28f1c3a3682f5b00030b",
               "name": "Herman Stein",
               "profile_path": null,
               "id": 56928,
               "department": "Sound",
               "job": "Original Music Composer"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.77598,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41516,
      "vote_count": 19,
      "budget": 0,
      "overview": "A party of archaeologists discovers the remnants of a mutant five millennia-old Sumerian civilization living beneath a glacier atop a mountain in Mesopatamia.",
      "similar": [
         1995,
         1996,
         6637,
         85,
         87,
         89,
         217,
         2059,
         9326,
         9838,
         10303,
         10973,
         9710,
         32613,
         267852,
         32567,
         54112,
         31397,
         197259,
         98116
      ],
      "original_title": "The Mole People",
      "runtime": 77,
      "poster_path": "/utOyyOn1KQ47ONwtAlC8M9i7zmW.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/nY62adzeba5GVK8LJYD6yd9R8H4.png",
         "name": "Universal International Pictures",
         "id": 10330,
         "origin_country": ""
      }],
      "release_date": "1956-12-01",
      "vote_average": 4.5,
      "belongs_to_collection": null,
      "tagline": "...a savage civilization a million years old, raging with blood-lusting fury!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Virgil W. Vogel"],
      "runtime": 77,
      "synopsis": "The film opens with a brief lecture by Frank Baxter. He is a Professor of English at the University of Southern California. He explains that there are just a few areas left on Earth that are unknown and briefly describes a few theories that postulate there may be places deep under the surface of the Earth where man can survive. In Asia an archeological dig has discovered something. Dr. Roger Bentley (John Agar) and Prof. Etienne Lafarge (Nestor Paiva) expose a stone tablet. They take it back to their tent to clean and examine it. We are introduced to Dr. Jud Bellamin (Hugh Beaumont) and Dr. Paul Stuart (Phil Chambers) who ask Bentley to translate the find: it may be related to the story of Gilgamesh and Ishtar. An earthquake rattles the area and the tablet is broken. This puts their work a month behind schedule. A small boy discovers something the earthquake brought down a mountain and brings it to Bentley. He cleans it and it is revealed to be an ancient oil lamp. The inscription is translated as a pre-biblical Noah's Ark story. The party of scientists set off for the mountain where the artifact originated before it was dislodged by the earthquake. They set up base camp and plan their final assault on the mountain the next day. A storm hits the base camp that evening. As they set off the next morning an avalanche brings down an arm from a statue. They continue climbing and discover the ruins of an ancient Sumarian civilization on a small plateau. They estimate the ruins are 5,000 years old. While Dr. Stuart walks around the ruins he falls down through an opening. The rest of the party goes down on ropes to save him. Bentley leads the way, followed by Lafarge, who is much older than the rest. Bellamin is third down the opening followed by Nazar (Rodd Redwing). After dropping down about 200 feet Bentley finds Stuart, but he died in the fall. Nazar notices a loose piton and hammers it secure, but that triggers a rockfall and he is killed and the three archeologists are trapped. They start searching for a way out, but Lafarge is experiencing breathing problems. He is also claustrophobic, They wander through the cave and discover a light source, which reveals a large underground city. They notice a very large tablet that informs them they have discovered the temple of Ishtar. They bed down for the night, but a lizard creature (a mole person?) digs up to the surface to spy on the three. A short time later, the party is attacked, sacks are placed over their heads, and they are pulled underground. They awake in a cave and Lafarge has claw marks on his chest. Two very pale white representative of the human underground civilization suddenly appear and direct they follow them. The scientists are escorted back to the city and presented to the High Priest, Ilinu (Alan Napier) who is performing a ritual. Ilinu immediately suspects the strangers and tells the king that they are evil. The king questions the three archeologists. At the conclusion of the questioning the high priest sentences them to death. The three escape into a cave, with guards in hot pursuit. Bentley shines his flashlight in the face of the First Officer (Robin Hughes) who cringes and retreats. It seems the light hurts their eyes. The three return to the city and shine their flashlight on the King and High Priest and they also retreat. The inhabitants of the city are albino, adapted to a world without sunlight. A lizard creature pulls the body of one of the guards underground. Seeing this, Lafarge panics and runs back into one of the caves. Bentley and Bellamin follow and discover a slave labor camp where the lizard creatures are forced to cultivate the food source--mushrooms. The guards whip their charges, which particularly incenses Bentley. Laforge is attacked and killed by a lizard creature, but is driven off by the flashlight before he can eat Laforge. Bentley and Bellamin return to the city and are met by the high priest along the way who tells them that they are welcome back to the city since they \"possess the divine fire of Ishtar\". The King is convinced they are holy messengers and are invited to a feast. One of the servers, Adad (Cynthia Patrick) drops her bowl of mushrooms, and is ordered whipped by the king. Bentley stops the punishment and is told not to interfere by the High Priest. Bentley helps her to her feet and notices she is not albino, but normally pigmented. The King presents Adad as a gift to Bentley. The High Priest explains that she is not human (like them) but a \"marked one\". The King and Priest further explain that when the population gets too large the excess are sacrificed in the fire of Ishtar. Bentley and Adad talk about their respective worlds as the High Priest spies on them. The next day Bentley and Bellamin tour the city. Meanwhile the High Priest meets with his fellow priests and plots to get the flashlight. This will show the king that the strangers are not divine, but mere mortals. Bentley and Bellamin intercede when three lizard creatures are being beaten, but their flashlight batteries begin to fail. They free the lizard creatures. Food production has been reduced because the lizard creatures are rebelling against their mistreatment. The High Priest schedules another sacrifice. After a ritual dance three women are escorted into a brightly lit chamber, enter, and are locked in. When they open the chamber later, the charred remains are carried out on stretchers. The High Priest is shown the dead body of Laforge. The High Priest was told by Bentley that Laforge was called back to Ishtar, reinforcing the story of his divinity. The High Priest shows the body to the king and explains that he is mortal and asks the King for permission to kill Bentley and Bellamin. The King agrees. Bentley and Bellamin are drugged and arrested. Elinu takes possession of the flashlight. Adad escapes and is captured by the lizard creatures. Bentley and Bellamin are taken to the lighted sacrifice chamber and locked in. The lizard creatures attack the city in force and kill the inhabitants, including the King and High Priest. The lizard creatures break open the sacrifice chamber, but the light repels them. Adad isn't afraid of the light and joins Bentley and Bellamin on their ascent back to their world. They reach the top and get into warmer clothes. Another earthquake strikes the area, and Adad is killed when a stone pillar crushes her. The underground city is buried.",
      "writers": ["László Görög"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0049516/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NjQ3NjI5N15BMl5BanBnXkFtZTcwOTQ3NjAzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Agar, Cynthia Patrick, Hugh Beaumont | See full cast and crew »"],
      "reviews": [
         "I can't help feeling that everyone is jumping on the bandwagon saying this is the worst film ever made etc. I viewed this film for the first time on laserdisc on a video projector in a darkened room with some mates and we found it to be entertaining different atmospheric in parts. John Agar for once has some good lines and does well. The script is a fairly complex one far more than other film of its vintage and budget. We thought the writers should be commended for using such plot devices as intolerance to light and the sub-culture within a sub-culture. Even the ending is unexpected and different. It even has an opening prologue which is a lot of fun. While this film does not hit its target on everything it tries to do, we thought the creators had a pretty good go at it. I do not honestly understand why so many people think this film is so bad. Maybe seeing it projected on a big screen in a darkened room made a difference, I don't know, but if you have never seen the film before try it with an open mind you may well enjoy it as much as we did.",
         "I've seen this movie several times over the years. It's a real semi classic, great example of 50s sci-fi monster movies. You do get a good look at the actual mole monsters and see quite a bit of them. As good as the mole monsters are, they are only a small part of this film. It's also an adventure movie about exploring for a lost civilization. Most of the plot involves this civilization which also happens to include the Mole People. This is good stuff. The stuff that used to scare and entertain in the 50s. The thing is, if you've seen a decent amount of horror/sci-fi films from the 50s and early 60s and haven't found much that you liked, \"The Mole People\" is not for you. If you're a fan of 50s B movies, you'll love this one. It's a real must see.",
         "Coming from 1956 is another of Universal-International's science-fiction pleasures. They made about twenty of them in the 1950s, brought on by the enormous successes of \"It Came From Outer Space\" (1953) and \"Creature From the Black Lagoon\" (1954). An interesting prologue with a real professor on the Earth's interior cores is followed by a great title sequence accompanied by a superb score. John Agar leads an archaeological expedition in Himalayan mountains to search for an underground lost civilization. Eventually they find them, an albino tribe, who have trained the half-human \"Mole People\" to be their slaves. Agar falls in love with the lone pigmented character, lovely blonde Cynthia Patrick, who invokes a bit of Kim Novak. Sacrifices, revolt and chaos ensue, with the Mole People actually the sympathetic characters, an unexpected ending, shadowy photography, and solid direction by Virgil Vogel, make this enjoyable.",
         "I remember seeing 'The Mole People' when it first came out and I haven't seen it since - it's never been shown on TV and has never had a video release over here in England. So my memories of it are those of an 8 year old. It's the only film I've ever seen that gave me nightmares - real, waking up screaming that the molemen are going to get me, nightmares. 'The Exorcist', 'Texas Chainsaw Massacre' and all the rest had no effect on me whatsoever, but 'The Mole People' remains for me the scariest film ever made.",
         "Yeah, yeah, yeah. So it's cheesy bw 50's sci fi. But it's GREAT cheesy bw 50's sci fi! The Mole People would be campy if it weren't so earnest. It takes itself so seriously it even begins with a pseudodocumentary prelude explaining the hollow Earth theory. Part of the fun is seeing future TV faves Hugh Beaumont (Beaver's dad), and Alan Napier (Alfred the butler) teamed with legendary 50's hack actors John Agar and Nestor Paiva. Mystery Science Theater 3000 gave Mole People the full treatment and it was one of the funniest MST3K episodes ever. For the full effect I'd suggest you view the straight version first and then try to find the MST3K episode.",
         "There is just enough 'oomph' to \"Mole People\" to mark it as a minor classic (50's Universal B flick division). The idea of an lost ancient civilization sealed away from the modern world by time and catastrophe and buried far underground is a powerful one (dating back to the Greek Hades/River Styx days), and there are elements of interest in the exposition and the plot - a slave race of mutants, a decadent people so accustomed to the dark that a flashlight is a source of overpowering pain, a society that must limit its numbers due to the limited food supply and sacrifices its youngest (and heretics) to the mysterious power found in a mystery chamber. Too bad this heady brew, which could have made for a powerful, disturbing experience in the hands of someone like Neil Gaiman or Alan Moore, was handled with the usual manner of an under-budgeted 50's B flick. It's not that the lead actors (Agar, Beaumont and Paiva) are so bad...well they ARE bad, but they are at the mercy of the script (which sinks the plot with indigestible wads of exposition) and direction (long dull sequences where nothing much happens and over-packed action sequences where nothing believable happens.) The actors do their best, but to no avail. BTW, I can accept the idea that this lost civilization is declining and decadent, but judging by the fight sequences, their soldiers and enforcers have the muscle tone and fighting skills of prepubescent girls. This tends to undercut the dramatic value of the scenes where Agar and company make a break for freedom, or the revolt scenes where the mutant mole people finally rise up against their overlords. And someone needed to educate the film makers that \"decadent\" is not the same thing as \"effete\". In \"Mole People\"'s favor: the first shot of the huge cavern our heroes emerge into is very nicely done indeed, one of the best matte effects of its day. The \"surprise\" twist which reveals the truth of the iconic symbol worshiped by the lost society and the sacrificial chamber is a nice little bit of writing. The cruelly ironic fate suffered by Agar's love interest made me wince a bit (she deserved better). And a nice closing shot that writes \"Finis\" to the move wraps things up nicely. Worth seeing once, if only for the historical interest. You just KNOW that a modern remake is being developed somewhere right now, but production values aside, it won't have the classic factor this one does.",
         "Now this movie gave me nightmares when I was about eight years old. But when I saw it again in my thirties, it still kinda creep-ed me out, but it also gave me a laugh attack. Though no doubt innovative for it's time, it has lost some...OK a lot...of that now. Still, I recommend this movie because it does evoke an atmosphere of delicious creepiness, laced with just the right amount of claustrophobia (it takes place down under...everything), and afraid-of-the-dark-jitters. Strictly low budget fare, but interesting ideas, cool camera work, along with effective lighting make it work. I don't remember the music, but I am sure it is pretty standard for such a flick of the mid 50's. When the Mole Men come up out of the...well I don't want to spoil it for you, but it really scared me as a child for weeks on end. Nearly drove my parents crazy with that one. It has a pretty decent ending unlike most B-flicks of that era. Check it out if you can find it, and have plenty of snacks on hand. You may want to throw some popcorn at the screen to try and distract Wally and The Beav's dad, Hugh Beaumont, so the Mole Men will thankfully get him, and relieve you from his, now this is where I clear my throat, acting. James Van Pelt from Tulsa, Oklahoma",
         "The film is quite fun to watch and the Mole People are a little on the wired side but nonetheless they looked good especially for the 50s!If you like the Universal Monsters movies then check this out soon!I think you'll like it!",
         "Although The Mole People isn't the best of Universal's 50's sci fi movies, I rather like it. A group of Archaeologists discover a strange world while exploring in a part of India. They discover a race of albinos living here and they use a strange life form as slaves, mole men. They are afraid of light and a torch is used as a weapon to scare them away. As the movie progresses, most of the team gets killed and one of the survivors falls in love with a woman who happens to be down there as well, but this proves short lived as she is killed in the earthquake at the end in which the world is destroyed. The movie stars 50's sci fi regular John Agar (Tarantula, The Brain From Planet Arous) and Hugh Beaumont, Cynthia Patrick and Alan Napier. This movie is worth checking out. Rating: 3 stars out of 5.",
         "I picked this up at a car-boot sale on VHS for a £1 purely because I remember seeing it advertised in the back of \"Famous monsters of film land\" in the 1960,s and wondered what it would be like, Well! it,s a lot better than I thought it was going to be.It stands up pretty good when compared to other 50,s shockers like \"Tarantula\" .\"it came from beneath the sea\" etc and has some genuine spooky moments .If you like 50,s monster / sci fi films .I recommend you give this one a chance although to my knowledge Universal have not released it on DVD,you may have to check out e bay for a copy or setttle for a VHS version.Well a lost classic in my opinion ,well worth hunting down!"
      ],
      "genres": [
         "Adventure",
         "Fantasy",
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Universal International Pictures (UI)"],
      "summaries": [
         "On an archaeological dig in Asia, Dr. Roger Bentley find a cuneiform tablet referring to an ancient society, the shadow dynasty, that was destroyed. An earthquake soon after reveals an ancient artifact and the scientists discover the ruins of an ancient temple world on a remote mountain site. It leads them to an underground world, lost in time and where people have adapted to low light. The High Priest Elinu doesn't welcome the presence of the new arrivals and wants them eliminated.",
         "Archaeologists stumble upon a race of albinos living under the earth. They are afraid of light of any kind and keep mutant humanoid mole men as their slave",
         "So it starts out with an archaeological team in the 50's that stumbles upon this underground civilization of a lost dynasty of sumerians, who have apparently failed to evolve over the past 5,000 years. The plot becomes a but fuzzy here, but pretty much only three people survive. The albinos decide to sacrifice these three survivors, but they escape. One of them dies, but the other two (Dr. Bentley and Dr. Belamin) escape by shining a flash light in the albinos and mole people's faces. Wait- who are these mole people? They are mutant humanoid mole-type creatures that are the mistreated slaves of the albinos and resemble the sand people from Star Wars. Just like the albinos, living underground has made them highly sensitive to light. Anyways, the sumerian priest believes that the flashlight is the sacred fire of their goddess, Ishtar. They come to believe that Bentley and Belamin are messengers of Ishtar. They give Bentley a slave, a beautiful woman named Adad who is shunned by the albinos because of her tan skin. Of course, she and Bentley fall in love and he says she can come with him if they ever get out.",
         "A party of archaeologists discovers the remnants of a mutant five-millennia-old Sumerian civilization living beneath a glacier atop a mountain in Mesopatamia."
      ],
      "budget": 200000
   },
   "movielensId": 2667,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1956-12-01",
      "dvdReleaseDate": "2008-05-13",
      "directors": ["Virgil W. Vogel"],
      "runtime": 77,
      "movieId": 2667,
      "title": "The Mole People",
      "mpaa": "",
      "actors": [
         "John Agar",
         "Cynthia Patrick",
         "Hugh Beaumont",
         "Alan Napier",
         "Nestor Paiva",
         "Phil Chambers",
         "Rodd Redwing",
         "Robin Hughes",
         "Frank Baxter",
         "Eddie Parker"
      ],
      "imdbMovieId": "0049516",
      "originalTitle": "The Mole People",
      "genres": [
         "Adventure",
         "Fantasy",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "4gbcUCC7vxQ",
         "oBxiDwrluFc"
      ],
      "plotSummary": "A party of archaeologists discovers the remnants of a mutant five millennia-old Sumerian civilization living beneath a glacier atop a mountain in Mesopatamia.",
      "tmdbMovieId": 41516,
      "avgRating": 2.61317,
      "releaseYear": "1956",
      "numRatings": 243,
      "posterPath": "/utOyyOn1KQ47ONwtAlC8M9i7zmW.jpg"
   }
}