{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dc comics",
            "id": 849
         },
         {
            "name": "swamp",
            "id": 4551
         },
         {
            "name": "based on comic",
            "id": 9717
         }
      ],
      "imdb_id": "tt0084745",
      "video": false,
      "title": "Swamp Thing",
      "recommendations": [
         19142,
         23730,
         11298,
         27475,
         11954,
         15762,
         24038,
         13555,
         33061,
         40095,
         12521,
         18498,
         11503,
         29787,
         11415,
         3980,
         29343,
         8973,
         40969,
         17898
      ],
      "backdrop_path": "/bcnajlCha6NzKRSMEGhwHtvBiST.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "HoundCat",
         "id": "59a0c14d925141779a01d192",
         "content": "This movie was so awful, I loved it! \n\nI saw this film in the theater when I was in high school and couldn't get enough of the cheesy horror flick, sci-fi, and all that was in-between, and \"Swamp Thing\" was just the right kind of movie I needed to see at the right time to enjoy it as I did.  **Adrienne Barbeau** had the right assets for a high school boy, and to this day I love any movie or TV show with **Ray Wise**.  \n\nThe effects were pretty cool for that time, though not too sophisticated as they really didn't need do be. As long as you had some dry ice, food coloring, water, beakers and such, and a green rubber suit that looked a bit like a walking bean stalk, this was the movie to make following in the tradition of bringing the comics we read and collected to life on the big screen. Sure, I had Swamp Thing comic books (DC) (I guess they're called 'Graphic Novels' now). A few more prosthetics and **Wes Craven** writing and directing and you have \"Swamp Thing\" the motion picture. \n\nRent it, buy it, stream it, just watch it, and grab a bag of popcorn if you love these movies like I do. In other words, just enjoy!",
         "url": "https://www.themoviedb.org/review/59a0c14d925141779a01d192"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Anton Arcane",
               "gender": 2,
               "credit_id": "52fe47529251416c7509544b",
               "name": "Louis Jourdan",
               "profile_path": "/qRFaub1dgsdARpNzE85Lrop0nVX.jpg",
               "id": 10508,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alice Cable",
               "gender": 1,
               "credit_id": "52fe47529251416c7509544f",
               "name": "Adrienne Barbeau",
               "profile_path": "/vKZpJlrGLK4qFTTnWFa6LMH2FMc.jpg",
               "id": 11782,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Doctor Alec Holland",
               "gender": 2,
               "credit_id": "52fe47529251416c75095453",
               "name": "Ray Wise",
               "profile_path": "/z1EXC8gYfFddC010e9YK5kI5NKC.jpg",
               "id": 6719,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Ferret",
               "gender": 2,
               "credit_id": "52fe47529251416c7509546b",
               "name": "David Hess",
               "profile_path": "/pn6IiRB1teWfmxkeVtIHRnOlFfB.jpg",
               "id": 101575,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bruno",
               "gender": 2,
               "credit_id": "576adcc49251416e65000413",
               "name": "Nicholas Worth",
               "profile_path": "/ohKOmHwBEyIrAUYSNQY2uNbSznN.jpg",
               "id": 100461,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Ritter",
               "gender": 2,
               "credit_id": "576addad925141706300044f",
               "name": "Don Knight",
               "profile_path": null,
               "id": 152673,
               "order": 5
            },
            {
               "cast_id": 4,
               "character": "Charlie",
               "gender": 2,
               "credit_id": "52fe47529251416c75095457",
               "name": "Al Ruban",
               "profile_path": null,
               "id": 11415,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Swamp Thing",
               "gender": 2,
               "credit_id": "52fe47529251416c7509545b",
               "name": "Dick Durock",
               "profile_path": "/5hdL18WGSGGgjQMxSVZ9DOvFMza.jpg",
               "id": 82507,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Arcane Monster",
               "gender": 0,
               "credit_id": "576ade1d9251417063000485",
               "name": "Ben Bates",
               "profile_path": null,
               "id": 1232000,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Dr. Linda Holland",
               "gender": 0,
               "credit_id": "576ade39c3a36822bd000580",
               "name": "Nannette Brown",
               "profile_path": null,
               "id": 1639886,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Jude",
               "gender": 0,
               "credit_id": "576ade5292514170630004ac",
               "name": "Reggie Batts",
               "profile_path": "/cMQB20NWzF7rj37cXILririzF3i.jpg",
               "id": 1639887,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Arcane's Secretary",
               "gender": 1,
               "credit_id": "576ade6cc3a36822bd00059e",
               "name": "Mimi Craven",
               "profile_path": null,
               "id": 13662,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Arcane's Messenger",
               "gender": 0,
               "credit_id": "576ade85c3a36823a70004bd",
               "name": "Karen Price",
               "profile_path": null,
               "id": 1639889,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Young Agent",
               "gender": 0,
               "credit_id": "576ade93c3a36822bd0005aa",
               "name": "Bill Erickson",
               "profile_path": null,
               "id": 1536529,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Commando",
               "gender": 0,
               "credit_id": "576adea9c3a36823a70004db",
               "name": "Dov Gottesfeld",
               "profile_path": null,
               "id": 1639890,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Little Bruno",
               "gender": 2,
               "credit_id": "576adebac3a36822e80004e0",
               "name": "Tommy Madden",
               "profile_path": null,
               "id": 107080,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47529251416c75095461",
               "name": "Wes Craven",
               "profile_path": "/vffssPtgNn2ZwoMfLCCDJAxlXGI.jpg",
               "id": 5140,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47529251416c75095467",
               "name": "Wes Craven",
               "profile_path": "/vffssPtgNn2ZwoMfLCCDJAxlXGI.jpg",
               "id": 5140,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "570edf94c3a368536d001043",
               "name": "Michael Uslan",
               "profile_path": "/lJ8n7Z9JB0XH4dxdgI48HG9jX1o.jpg",
               "id": 10949,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "576adf299251416e65000551",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "576adf41925141706300051a",
               "name": "Robbie Greenberg",
               "profile_path": null,
               "id": 18257,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "576adf67c3a36822bd000608",
               "name": "Richard Bracken",
               "profile_path": null,
               "id": 41412,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "576adf7e9251416e6800063a",
               "name": "Benjamin Melniker",
               "profile_path": null,
               "id": 10951,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "576adf8fc3a36822bd00061e",
               "name": "Robb Wilson King",
               "profile_path": null,
               "id": 21640,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "576adfa4c3a36823ea000557",
               "name": "David Nichols",
               "profile_path": null,
               "id": 1521767,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "576adfd2c3a36822b500050d",
               "name": "Patricia Bolomet",
               "profile_path": null,
               "id": 1639895,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "576adfe3c3a36823a700056b",
               "name": "Bennett Choate",
               "profile_path": null,
               "id": 1639896,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "576adffbc3a368244d00059e",
               "name": "Charlene Webb",
               "profile_path": null,
               "id": 1639897,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.957701,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17918,
      "vote_count": 114,
      "budget": 10000000,
      "overview": "Dr. Alec Holland, hidden away in the depths of a murky swamp, is trying to create a new species - a combination of animal and plant capable of adapting and thriving in the harshest conditions. Unfortunately he becomes subject of his own creation and is transformed. Arcane, desperate for the formula, attempts to capture the Swamp Thing. An explosive chase ensues that ultimately ends with a confrontation between Holland and a changed Arcane...",
      "similar": [
         1924,
         1452,
         49521,
         141052,
         8536,
         287947,
         9531,
         13640,
         1724,
         415,
         1927,
         99861,
         297802,
         298618,
         272,
         155,
         297762,
         209112,
         14011,
         65291
      ],
      "original_title": "Swamp Thing",
      "runtime": 91,
      "poster_path": "/MQG0XuWjfdsPm9upD5aZ0atMAx.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/2Tc1P3Ac8M479naPp1kYT3izLS5.png",
         "name": "DC Comics",
         "id": 429,
         "origin_country": "US"
      }],
      "release_date": "1982-02-19",
      "vote_average": 5.4,
      "belongs_to_collection": {
         "backdrop_path": "/w0jv6vdKe3TGOLaCgPbZOu85gas.jpg",
         "name": "Swamp Thing Collection",
         "id": 87228,
         "poster_path": "/niEEDNB366pMOI5RRcw36QGaGDm.jpg"
      },
      "tagline": "Science changed him into a monster. Love changed him even more!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Wes Craven"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Wes Craven",
         "Len Wein"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0084745/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEwNzE5NjQzMF5BMl5BanBnXkFtZTcwMzYyMTM3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Louis Jourdan, Adrienne Barbeau, Ray Wise | See full cast and crew »"],
      "reviews": [
         "This reminded me of the 1950s science-fiction/horror films with its primitive dialog, hokey action scenes and laughable makeup for the monsters. Oh, man, does this look bad as time goes on and we have been treated to 25 years of great special-effects since this was made. What makes this more attractive to watch than those '50s films, however, are great swamp photography, Adrienne Barbeau's body and a story that moves fast. Barbeau, as she was prone to do, appears to be only this is to show off her massive chest. However, it's pretty harmless fun, very tame compared to the horror movies of the past generation regarding gore and profanity. It's also pretty tame for a Wes Craven-directed film. In the end, it's a good Class B film, usually fun to watch for a number of reasons.",
         "\"Swamp Thing\" isn't what one might call a standard horror picture. It tries to play it a bit lighter than what you would expect, given the mechanics of the story. What you end up with is a fun and campy film, that sometimes lessens it's darker edge by trying too hard for a bit of humor. Based from the comic series from DC Comics, the tale is about a scientist, Dr. Alec Holland (played by Ray Wise), who is transformed into a marsh-layered creature of immense power, after his experiment to create a way to make a more abundant food supply, causes him to run afoul of a man bent to use it for his own ends... a man named Arcane (played by Louis Jourdan). I've noted before I am a big time comic reader, so I'm quite well versed with the history of the title character. Wes Craven, who both wrote and directed this film, takes quite a few liberties with the characters and their source material, but still manages to keep it true enough, so that they are easy to relate to and familiar. I liked Ray Wise's approach to the character, as he brought a great deal of altruistic idealism to him, which rang true to the character from the comics. Also well cast is Louis Jourdan as Arcane, as he gave him just the right amount of arrogant egotism and flamboyant self-aggrandizement, like the typical madman who thinks they know how to rule the world would have. Of course, Adrienne Barbeau is the real standout here, not just for the obvious physical attributes (which were obviously one of the reasons she was cast in the role of Holland's/Swamp Thing's love interest), but she manages to elevate herself from being more than just the usual damsel in distress, as watching her fight off attackers and shoot a gun, shows she's no weak-willed school girl. But it was her ability to make you believe that the chemistry she shared with Holland, was strong enough for her to accept him after his change into the Swamp Thing (which was played wonderfully by Dick Durock), that really cinched her performance with me. And let's face it, she don't look bad in soaking wet clothes, either. In fact, almost all of the cast do very good jobs with material that, at times, comes off a bit overly cheesy. If there were any negatives to the film, I'd have to say that it was in the pacing and dialog. Granted, this isn't Shakespere, but the script sometimes seems to just strive too hard to stay closer to humor than horror. It results in some scenes losing some of the dramatic punch they might have had, if they would have allowed things to go just a touch darker. The pacing of the film is quite quick, though a bit too quick, in some cases. We never really got to see Holland actually transform into Swamp Thing, nor did we get much time spent on him trying to adjust to his new situation. I would have liked to see more of a struggle for him in dealing with what he had become and his loss of his physical humanity, as he just seems to accept it too quickly. The special effects aren't very special here, although the Swamp Thing outfit does pretty closely resemble the character in the comics, so long as you don't focus on the close-ups, when the rubbery look is very obvious. Of course, this is just a limitation of the times and can't really be counted as detriment to the film. \"Swamp Thing\" is like a film that bridges the gap between the old 50's-60's horror films, with their poor special effects and unintentional cheesiness, and the more modern horror films that were to come. It does feel a bit like a throwback in a lot of ways, but the film has got a lot of heart and I think its charm ultimately won me over. It's not a very scary horror film, but it is an enjoyably fun film, nonetheless.",
         "In a secret research facility in the middle of the swamp, Dr. Alex Holland is working on an experiment to combine plant and animal DNA. Alice Cable (Adrienne Barbeau) has been sent by the government to help with security. But when the evil Dr. Arcane's men storm to lab trying to get hold of Dr. Holland's work, the results are explosive, literally. Through a chemical reaction, Dr. Holland is transformed into the Swamp Thing. Now, Cable, with the help of the Swamp Thing, must keep the formula out of Dr. Arcane's hands. I don't know why I insist on re-watching this movie every few years. It's not going to get any better. In fact, I enjoy it less and less with each successive viewing. Once you've seen the laughable creature design, once you've seen Barbeau being captured, once you've seen Dr. Arcane's transformation, once you've seen Barbeau run through the swamp in a wet t-shirt, and once you've seen the final showdown (which happens to be one of the most ridiculous things ever caught on film), there's really no reason to watch it again. One viewing should be enough for any masochist. The biggest problem with Swamp Thing is the plot \u0096 or should I say the lack of a plot. The whole \"keep the formula from Dr. Arcane\" idea is merely window dressing for what I see as the main theme running through the movie \u0096 the rescue of Barbeau. At least 90% of the movie's runtime is devoted to the Swamp Thing rescuing Barbeau from Arcane's men. And Barbeau's rescue is repeated over and over and over\u0085. It's a bit like the bad, humid version of Groundhog Day. So, why don't I rate it lower? There are a few set pieces that really work. The first 15 minutes or so (the period before Barbeau needs to be rescued) is nice. Also, the movie is beautifully shot. You can compare it with another of Craven's films, think of The Hills Have Eyes \u0096 only in reverse. Where that movie was shot in such a way that you could almost feel the dry, hot California desert, with Swamp Thing, you can all but feel the humid, dank swamp.",
         "Wes Craven, who's normally known for his horror films that bring terror and fright, here with this 1982 entry he toned it down a lot. 1982's \"Swamp Thing\" is certainly campy as you can tell from the scenes it's cheap made and the sets look unrealistic and finally the costume of the creature is much to be desired. Still for a 1982 film well before the big computer and special effects graphic boom it held up pretty good and it's still a fun little watch and it was nice to be treated to Adrienne Barbeau's performance. Set in the muggy and swamp land of the deep southern US a scientist Alec Holland(Ray Wise)meets up with a sexy federal government agent Alice Cable(Adrienne Barbeau)and they develop a cure thru chemicals that is supposed to end hunger. A bad guy nemesis Arcane(Louis Jourdan)plans to steal the serum potion and use it for his own deadly benefits, yet it backfires one day and Holland becomes Swamp Thing a half man and half plant superhero. From then like your typical comic book fashion the good guy against bad guy chase and adventure starts with the hero saving mankind, the planet, and the damsel. Overall good yet nothing great, an extra treat is the lake river bath of Adrienne when she gets topless! A good sexy performance from Barbeau that freshens up the dull camp and cheesy feel of this sci-fi cult film.",
         "I really have an affection for this truly campy, cheaply-made, cheesy film from the early 80's. Wes Craven, before he hits it real big, obviously has some directorial flair, but there is a lot here that is atypical of his work. The special effects are really cheap, I mean, aside from the Swamp Thing outfit, everything else is very badly done from the hideous, cowardly midget to the overblown, terrible outfit of another \"fearsome\" monster that personifies the very essence of evil - or so we are told. It would be very easy to dissect this film for all of its obvious faults, but what I do like is that it has that feel of an old sci-fi film from years gone by - good vs. evil. It has some decent acting and set locations. Louis Jourdan plays the suave villain as well as anybody and David Hess(Last House on the Left fame) plays a despicable henchman with few peers. And Adrienne Barbeau? She bares it and is beautiful in all forms of undress as her cleavage barely manages to stay on as she runs through swampland. She plays Alice Cable, a love interest for the Swamp Thing, a creation of serendipity and scientific experimentation. The story, loosely based on a comic book, is liberally dosed with action, inane dialog, and what you would expect for a film of this ilk, but all enjoyable. I enjoyed the character of Jude too, played with an innocence to acting(and perhaps talent) that few films would allow but comes off I think. Besides, Adrienne Barbeau is in it - this is one of the few times I really would like to have Cable!",
         "It's too bad about the last third of this movie, because it really works pretty well as a comic book movie before the bad guys start drinking the serum and transforming. It takes place in a swamp and throughout most of the movie looks exactly like some of those stupid, stupid exploitation films like Gator Bait and Day of the Woman, but it completely loses track of itself in the third act. The story concerns a scientist who has created a serum that allows stupendous plant growth, which he plans to use to help feed the world, \"say by the year 2001 when there are 6 ½ billion people on the planet.\" Needless to say, his desire to do good with something so powerful is not going to fly in a Wes Craven film, so it's not long before a lot of trashy rednecks barge in heavily armed in full fatigues to take it away from him and deliver it to their evil boss. The best parts of this movie are the scenes at the beginning that show the discovery of what the serum does. At first it looks like some kind of explosive liquid that looks exactly like the serum that Herbert West created in Re-Animator, but soon one scientist notices that the spots on the floorboards where it was flung to show its explosive properties have begun to grow branches. The interest level at this point in the movie is on a step uphill, so it's almost heartbreaking when the last half hour or so gets so bad. The Swamp Thing himself never looks like anything but a man wearing a rubber suit, but I'm willing to accept that because he was a human being before being affected by the serum, so let's not pick the movie apart because of him. The Day the Earth Stood Still had a great explanation for why the alien that stepped off of the space ship was a well-dressed man, and this movie has a good reason for the humanoid appearance of it's monster, and I have to admit that the special effects were fairly well done for 1982. I also really liked the character of Jude. He is a really easy kind of character to criticize because he is just some kid that pops up in the movie, running a roadside liquor store, of all things, and operates as some pretty goofy comic relief. But his character is well written, if not tremendously well acted. I've seen this kind of character done badly before, such as in Gator Bait, I Spit on Your Grave, and Wrong Turn. There are times that the creature in this movie reminds me of King Kong (such as when he's saving the damsel in distress from harm and lavishing affection on her in the wilderness) and there are times when it reminds me of Frankenstein's monster (such as when it reaches for the flowers in the trees, either pleasantly astounded by their beauty or, lest we forget, noting the species of flower that they are since, of course, he is a scientist underneath all of that rubber. I mean plant life). Where the movie really goes wrong is when it tries to show how the serum affects different people, like what they did (with much better affect) in The Mask years later. Evidently the serum does not make everyone big and strong, but only amplifies their essence. It magnifies what they already are, so if they are a big strong man with no inner strength, apparently they turn into pig-headed midgets in turtlenecks, whereas if they are a big bad guy (like the badly written and badly acted big bad boss man in this movie), they will turn into some kind of photosynthetic werewolf. Ugh. But even worse, the movie switches from the swampy wilderness to a nightclub that makes absolutely no sense. Craven has already by this point inserted uncharacteristic and completely unnecessary nudity into the movie, but this place is the ridiculous combination of a high-class black tie restaurant and a trashy strip club. Half the patrons are wearing fancy clothes and half are dirty rednecks still wearing the fatigues that they were crawling around the swamp in. And then, of course, there's Alice Cable, there heroine, tied to a chair. This movie describes the true nuts and bolts of human life as \"a million messy miracles,\" and it believes in that statement in the design of its characters. The swamp thing is not a glorified superhero, he is a man that has been reduced to a plant-like creature, with some human properties and some plant properties, but without the full capabilities of either. This is not exactly what I have come to know and love from Wes Craven (although not quite as uncharacteristic as Music of the Heart, where did THAT come from), but for the most part this movie is able to stand on its own and is a fairly entertaining comic book movie from the early 80s. And here's something interesting and a little disturbing \u0096 according to the credits at the end of the film, the sound effects were created by \"Jay's Meat & Provision Co.\"",
         "Not a masterpiece by any means but still an entertaining film with a couple of postives. One, the appearence of Adrienne Barbeau who shows here why she was a mainstay in American horror films during the late 70s to early 80s. Two, the humorous but slightly dark appoarch of the material. Now for the negatives of the films. One, the acting goes from being very good to very bad in seconds. Two, the inconsistency of the film's sequences and story. Swamp Thing(1982) is what I consider a transitional film that bridges his early films of Last House on the Left(1972), and The Hills Have Eyes(1977) to his mid 1980s films like A Nightmare on Elm Street(1984). A very satifying performance is given by Last House on the Left(1972) actor, David Hess. Its too bad that Craven never worked with David Hess after this film because Hess added a true feeling of screen villainly in his performances for LHOTL & Swamp Thing(1982). Swamp Thing(1982) belongs in the category of cult classic status and as a middle of the road type of film for Wes Craven.",
         "\"Swamp Thing\" is beautifully photographed in authentic swamps, and directed with a nice comic-book sensibility by Wes Craven, but the script is flat, boring and (eventually) silly, and the title creature is too human-like to inspire much awe. However, Louis Jourdan is enjoyable as the suave, cultivated villain, David Hess is in his element as one of his goons, and there is also a black kid who's the epitome of \"coolness\". (**1/2)",
         "From the mastermind behind such disturbing horror classics as \"The Hills Have Eyes\" and \"Last House on the Left\" comes a new dimension in terror\u0085 \"Swamp Thing!\" Yes, \"Swamp Thing.\" For real. Wes Craven really directed a \"Swamp Thing\" movie. Showing the world that he was capable of handling more than just mutants and lowlifes, Craven set to adapting the comic series of the same name to film. The results? Well, let's just say there's some mutants, some lowlifes and a topless Adrienne Barbeau. Not a bad mix if one may say so. Meet Dr. Alec Holland. Holland, played by the great Ray Wise, is a scientist who likes spending his free time bogged down in the swamp. On the verge of an ecological breakthrough, he is tragically transformed into a hideous yet unstoppable mutant. Treading water and stomping through the bayou, it's up to him to help save a beautiful colleague (Barbeau) from certain danger while trying to come to terms with his rubber suit\u0085I mean his new body. The film is mostly harmless fluff. Craven has his heart in the right place, and even when the film misfires (as it so often does) it's hard not to love it regardless. Barbeau absolutely steals the show and runs with it, although it must be noted that in the short time he spends on film, Ray Wise delivers a charming and wholly human performance. David Hess also pops in to do what he does best: playing a merciless thug. There's also a score by Harry Manfredini at hand that evokes images of Crystal Lake, but for the purposes of this film, let's just call it Crystal Marsh. Also, look out for a cameo from the elusive Manbearpig towards the end of the film. In the end, \"Swamp Thing\" is far from the finest comic adaptation, but then again, it's not the worst either. Fact of the matter is that it's a harmless and enjoyable affair, provided one is in the appropriate state of mind. Filled to the brim with oddball characters (Jude deserves his own spin-off) and goofy monster antics, \"Swamp Thing\" is an odd creature that you can't help but adore.",
         "Brilliant and kindly scientist Dr. Alec Holland (a fine Ray Wise) is working on a special growth formula in a laboratory that's located in a secluded swampland area. Holland mutates into a half-man, half-plant hybrid creature called Swamp Thing (amiable Dick Durock in a nifty rubber suit) after being drenched with his serum by suavely wicked arch nemesis Anton Arcane (delightfully played with lip-smacking hammy relish by Louis Jourdan). Swamp Thing protects brassy CIA agent Alice Cable (a marvelously tough and sassy portrayal by Adrienne Barbeau) from Arcane and his nasty flunkies. Writer/director Wes Craven handles the cheerfully silly premise in a suitably garish comic book style, keeps the pace snappy throughout, stages the plentiful action with rip-roaring brio, delivers a strong and vivid evocation of the murky marshland setting (the authentic South Carolina locations are a major plus), does a sound job of creating a hugely entertaining tongue-in-cheek tone, and tops things off with a welcome sense of self-mocking humor. Moreover, Swamp Thing makes for a strangely moving and sympathetic protagonist; there's a real sense of heart evident in the depiction of his lonely plight that's both touching and surprising. The cast have a ball with their broadly drawn roles: Barbeau is a brash treat as the fiercely self-reliant heroine, Jourdan chews the scenery with eye-rolling gusto, David Hess excels in one of his standard sleazy villain parts as the vicious Ferret, Nicholas Worth likewise does well as the doltish Bruno, and Reggie Batts almost steals the whole show with his very natural and amusing deadpan performance as hip, but laid-back black teenage gas station attendant Jude. In addition, this film comes through with a few inspired outrageous touches: Bruno becomes a pathetic midget monster after drinking the formula, Swamp Thing has one of his arms chopped off, but grows a new one in its place, and Arcane transforms into a crazed werewolf lizard beast that engages in a lively to-the-death climactic fight with Swamp Thing. Robbie Greenberg's cinematography makes nice use of elaborate fades and wipes. Harry Manfredini supplies a rousing, spirited score. An enormously enjoyable romp."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["Swampfilms"],
      "summaries": [
         "Dr. Alec Holland, hidden away in the depths of a murky swamp, is trying to create a new species - a combination of animal and plant capable of adapting and thriving in the harshest conditions. Unfortunately he becomes subject of his own creation and is transformed . . . Arcane, desperate for the formula attempts to capture the Swamp Thing. An explosive chase ensues that ultimately ends with a confrontation between Holland and a changed Arcane . . .",
         "After a violent incident with a special chemical, a research scientist is turned into a swamp plant monster."
      ],
      "budget": 3000000
   },
   "movielensId": 2668,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-02-19",
      "dvdReleaseDate": "2000-08-01",
      "directors": ["Wes Craven"],
      "runtime": 91,
      "movieId": 2668,
      "title": "Swamp Thing",
      "mpaa": "PG",
      "actors": [
         "Louis Jourdan",
         "Adrienne Barbeau",
         "Ray Wise",
         "David Hess",
         "Nicholas Worth",
         "Don Knight",
         "Al Ruban",
         "Dick Durock",
         "Ben Bates",
         "Nannette Brown",
         "Reggie Batts",
         "Mimi Craven",
         "Karen Price",
         "Bill Erickson",
         "Dov Gottesfeld",
         "Tommy Madden"
      ],
      "imdbMovieId": "0084745",
      "originalTitle": "Swamp Thing",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["kzbqK4nw3R8"],
      "plotSummary": "Dr. Alec Holland, hidden away in the depths of a murky swamp, is trying to create a new species - a combination of animal and plant capable of adapting and thriving in the harshest conditions. Unfortunately he becomes subject of his own creation and is transformed. Arcane, desperate for the formula, attempts to capture the Swamp Thing. An explosive chase ensues that ultimately ends with a confrontation between Holland and a changed Arcane...",
      "tmdbMovieId": 17918,
      "avgRating": 2.55469,
      "releaseYear": "1982",
      "numRatings": 1545,
      "posterPath": "/MQG0XuWjfdsPm9upD5aZ0atMAx.jpg"
   }
}