{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "korean war",
            "id": 3264
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "infantry",
            "id": 11106
         },
         {
            "name": "1950s",
            "id": 208611
         }
      ],
      "imdb_id": "tt0053183",
      "video": false,
      "title": "Pork Chop Hill",
      "recommendations": [
         43161,
         26296,
         53016,
         52717,
         45939,
         227245,
         32052,
         14677,
         39519,
         87884,
         29237,
         25914,
         35068,
         78229,
         68247,
         69321,
         40546,
         253259,
         15807,
         35284
      ],
      "backdrop_path": "/3Zgga09C6ufIcyOob7xdR03LSl5.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Lt. Joe Clemons",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc8b",
               "name": "Gregory Peck",
               "profile_path": "/ycs6o0UoohQ7nV7A6VWaTkoIkCQ.jpg",
               "id": 8487,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Pvt. Forstman",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc8f",
               "name": "Harry Guardino",
               "profile_path": "/qksCRl4Od7Jq6ZcwPIoHhlTR7iM.jpg",
               "id": 14785,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lt. Walter Russel",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc93",
               "name": "Rip Torn",
               "profile_path": "/rzGaoGikjMuLDruABKdLcQLtkZk.jpg",
               "id": 9626,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Cpl. Chuck Fedderson",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc97",
               "name": "George Peppard",
               "profile_path": "/4a0pbvG693RXAzuMgPGLOH0ZqbD.jpg",
               "id": 1933,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Cpl. Jurgens",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc9b",
               "name": "James Edwards",
               "profile_path": "/57hJbLy1mYXMcwYl3n13Tdpv0TW.jpg",
               "id": 3342,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Col. Kern",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc9f",
               "name": "Bob Steele",
               "profile_path": "/g1CoefIHZ5erkMV6fql0KEM1UE9.jpg",
               "id": 88649,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "American Admiral at Peace Conference",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dca3",
               "name": "Carl Benton Reid",
               "profile_path": "/chrIve3bPl3eBpq0W1J47z1T2lm.jpg",
               "id": 81180,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Pvt. Franklin",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dca7",
               "name": "Woody Strode",
               "profile_path": "/hL6mQBnCxBxhUeG5rjx9SfO7AXM.jpg",
               "id": 4963,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Lt. Suki Ohashi",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dcab",
               "name": "George Shibata",
               "profile_path": null,
               "id": 117393,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Sgt. Coleman",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dcaf",
               "name": "Norman Fell",
               "profile_path": "/dRXygz30GtDPswkF59iJUSJCBT7.jpg",
               "id": 14064,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Pvt. Velie",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dcb3",
               "name": "Robert Blake",
               "profile_path": "/fA9Zg9OprSMxjy54KuH1WDiCMvq.jpg",
               "id": 9287,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Cpl. Payne (radio operator)",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dcb7",
               "name": "Cliff Ketchum",
               "profile_path": null,
               "id": 117395,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Pvt. Boven",
               "gender": 0,
               "credit_id": "52fe463c9251416c9104dcbb",
               "name": "Biff Elliot",
               "profile_path": "/zygnbK6CJlQSXDhryUBfu8YUQkO.jpg",
               "id": 41719,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Lt. Harrold",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dcbf",
               "name": "Charles Aidman",
               "profile_path": "/cZqacx2pDq0CKYYO2ZDGURSHaCb.jpg",
               "id": 61150,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "Lieutenant, Division Public Relations",
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dcc9",
               "name": "Lew Gallo",
               "profile_path": "/u0Xk4KW8FFMP2TckXOV5ZnRV2Th.jpg",
               "id": 32894,
               "order": 15
            },
            {
               "cast_id": 25,
               "character": "Kindley",
               "gender": 0,
               "credit_id": "574d97e992514101560018c4",
               "name": "Abel Fernandez",
               "profile_path": "/dixVGcJKExA1KJpjNhl4Kec7zzw.jpg",
               "id": 170567,
               "order": 16
            },
            {
               "cast_id": 26,
               "character": "Lt. Marshall",
               "gender": 2,
               "credit_id": "574d97f89251414ead000111",
               "name": "Martin Landau",
               "profile_path": "/ylT7pqkcPNsHloe2dJsePFSoIkE.jpg",
               "id": 2641,
               "order": 17
            },
            {
               "cast_id": 27,
               "character": "U.S. Soldier with BAR (Browning Automatic Rifle) (uncredited)",
               "gender": 2,
               "credit_id": "59087b3ac3a36858a700d38b",
               "name": "Harry Dean Stanton",
               "profile_path": "/fkl5iJYpKxSFGixyvAsBpLdDmqN.jpg",
               "id": 5048,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe463c9251416c9104dc81",
               "name": "Lewis Milestone",
               "profile_path": "/qBEYKHYyjbMoaJBZtQgVe6fVa5v.jpg",
               "id": 2000,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe463c9251416c9104dc87",
               "name": "James R. Webb",
               "profile_path": null,
               "id": 69104,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe463c9251416c9104dcc5",
               "name": "S.L.A. Marshall",
               "profile_path": null,
               "id": 117396,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55c76544c3a368104500126c",
               "name": "Sy Bartlett",
               "profile_path": null,
               "id": 69105,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "55c76556c3a3682488002615",
               "name": "Leonard Rosenman",
               "profile_path": null,
               "id": 2027,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "55c76569c3a3682496002493",
               "name": "Sam Leavitt",
               "profile_path": null,
               "id": 870,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "55c7657a92514105c3002486",
               "name": "Lynn Stalmaster",
               "profile_path": "/rhyzo2qgsGAXIpGTN5OabbZU95U.jpg",
               "id": 1263,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "55c7658e92514105c3002488",
               "name": "Nicolai Remisoff",
               "profile_path": null,
               "id": 1111050,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "War",
            "id": 10752
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.700838,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37305,
      "vote_count": 19,
      "budget": 0,
      "overview": "American GI's must retake a barren hill in Korea that has been overrun by Red Chinese troops. The ensuing battle becomes a meat grinder for American and Chinese alike.",
      "similar": [
         324786,
         374720,
         8741,
         746,
         12162,
         1369,
         22972,
         4421,
         600,
         676,
         137113,
         227306,
         228150,
         369885,
         6415,
         9667,
         9331,
         1911,
         10592,
         252178
      ],
      "original_title": "Pork Chop Hill",
      "runtime": 97,
      "poster_path": "/3EJmYJyj2eyDArf36EXttVak3I3.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Melville Productions",
            "id": 3077,
            "origin_country": ""
         }
      ],
      "release_date": "1959-05-29",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Bold! Blunt! Blistering! The battle picture without equal!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lewis Milestone"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "S.L.A. Marshall",
         "James R. Webb"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053183/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYyMDU0MTQ3Nl5BMl5BanBnXkFtZTcwMjcwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Gregory Peck, Harry Guardino, Rip Torn | See full cast and crew »"],
      "reviews": [
         "I think when movies like Saving Private Ryan or Platoon came out people thought that these represented \"new\" insights on the war movie. Unfortunately, I guess they'd never seen a number of classic old films, such as Hell Is For Heroes (Steve McQueen), Sahara (Humphrey Bogart), or, indeed, Pork Chop Hill, starring Gregory Peck. I've seen Pork Chop Hill three or four times. It is, from what I understand, a historically accurate account of one of the last fifty years' most famous battles, based on the book by famous military historian Gen. S. L. A. \"Slam\" Marshall. The scene is at the end of the Korean War. Negotiations between the combatants have stalemated. LT1 Joe Clemons (played by Gregory Peck) is ordered to take Pork Chop Hill, a basically worthless piece of territory to demonstrate to the Chinese and North Koreans that resolve had not flagged. So a night attack is ordered. Fog of war messes the whole thing up repeatedly and Clemons is left holding the bag, with his company of men stuck in the assault without the backup they expected to happen. The story is very human, particularly the interaction between Clemons and his second in command, Ohashi. You see men determined to win even though they know they might die (and for what?), men on the verge of breaking only to be rallied or not, the utter confusion of battle. The movie's got a lot of then-unknowns, but later stars, e.g., George Peppard, Rip Torn, etc.",
         "I love Gregory Peck and have seen many of his movies. He can't save a bad movie but he always adds a star in my book. Fortunately he does not need to save this one. I am also a fan of classic war movies (lately that's about all I've been watching as I slowly work my way through the local video store's collection). So I really liked this one. The B&W filming was really gritty and captured the whole pointlessness of the battle that was Pork Chop Hill, right before the 1953 Armistice. We take it, the Chinese take it, we decide to take it back.... You really get a sense of the tactics employed by the troops on both sides and the tough job that is the infantryman's assaulting a hill, amid confusion, snafus, and the ever-present risk of death.",
         "On the very short list of Korean War films, `Pork Chop Hill' has many admirable features. Lewis Milestone's direction is never sluggish, yet allows for introspective moments. His orchestration of combat scenes is effective, while not memorably exciting. There is much beauty in the cinematography, and several shots have a spare, otherwordly feeling that underscores the plight of the GIs in this true story. The musical score, by the underrated Leonard Rosenman, contributes to the mainly grim tone of the circumstances. Actors are all at, or near, their best: Peck, Edwards, Strode, Guardino, Shibata, a very young Robert Blake.. Closeups are rare, and group scenes so full of motion, that it is easy to miss many well-known names in supporting roles: Harry Dean Stanton, Charles Aidman, Paul Comi, Kevin Hagen. While some characters besides Peck's lieutenant are singled out-Woody Strode's Franklin, in particular-most are only given very brief scenes to establish their individuality. With all its fine qualities, `Pork Chop Hill' somehow misses greatness. The build toward the climax lacks the thrust it should have in a film of modest length and dimensions. And when the climax arrives, it does not have the impact that was surely intended. Nevertheless, this film honorably commemorates a singular operation in `the forgotten war' and the men who died carrying it out.",
         "Friend of mine who fought in that area during the korean war felt it was very accurately portrayed as to fighting conditions,landscape,confusion in battle. Believe it was the best war movie when it comes to depicting what it was like for a ground pounder in korea.",
         "War movie? Anti-war movie? For you to judge on this one. Fact is that this is a crude depiction of what happened a bit everywhere in the Korean war. Gregory Peck, a gentleman of an actor, delivers a very strong performance as an officer tasked to take that darn hill. His conflict goes both ways. He has to order his men to \"get out there and take the Hill at all costs\" and at the same time he has to keep their spirits together before they totally crack-up. In fact, you actually can feel the bombs and the mortars shelling you throughout the movie. Imagine how you would feel if you had actually been there... This is probably a good companion to \"M*A*S*H\" (the Movie and/or the TV series). It's just on the other side of those Hills. It's these boys who were delivered on Hawkeye's operation table. Never forget that! It's honest, well played and has much less war-glorifying aspects than one would imagine or expect. The DVD edition is a bit better than its VHS counterpart and is in the correct 1.85:1 aspect ratio. Now, if some producer is still able to make a 90 minute movie with a similar gripping story nowadays, then you may call me Santa Claus!",
         "Pork Chop Hill is to films about the Korean War (when more than 50,000 men die, it is a war, not a \"conflict\") what Go Tell the Spartans is to the Viet Nam War. Neither of them are artificially dramatic, both are understated, both tell the story pretty much as it was, or, at least, as close as Hollywood gets. This entire movie represents the Korean War very well including the posturing at the peace talks. Some people are now calling Korea \"the forgotten war.\" This is regrettably true. More people should see Pork Chop Hill.",
         "One of the finest (anti)war movies ever made is undoubtedly the 1930 epic All Quiet On The Western Front, directed by the incomparable Lewis Milestone. 29 years later, Milestone once again turned his attention to the waste and futility of war with Pork Chop Hill. This powerful and well-made Korean War drama is not quite in the same league as Milestone's earlier classic, but it still paints a vivid picture of the harsh realities of combat, and conveys a palpable sense of the pointlessness of war. Lieutenant Clemons (Gregory Peck) is a honest, dependable American soldier fighting in the Korean War. He believes in carrying out orders whatever they may be, but his attitude is put to the ultimate test when he is instructed to lead an attack on a tactically insignificant hill in the dying days of the war. Issuing orders which he knows will lead to pointless loss of life, Clemons leads his men up the titular hill into a maelstrom of enemy gunfire, looking on in horror and dismay as his boys are gunned down or blown to bits in their futile quest. After the film had been shot, Milestone was somewhat irritated to discover that the studio had tampered with his intentions, adding a misleading last-scene voice-over which tried to suggest that the victory on Pork Chop Hill made a significant difference to the future of millions of Koreans. The film is at its best when delivering its anti-war sensibilities, especially the bitter scenes showing honest young soldiers losing their lives for no particular reason. In historical terms, the capture of Pork Chop Hill was both costly in lives and irrelevant in consequence. The performances are generally first-rate. Peck is excellent as the man who tries to justify the insanity of what his platoon have been ordered to do. He gives his best performance since Twelve O'Clock High a decade earlier. Giving memorable supporting turns are familiar character actors like Harry Guardino, Rip Torn, George Peppard and Martin Landau, all of them resisting the urge to appear as gung-ho heroes to add to the film's stance that war is a meaningless and expensive pursuit. There have been few genuinely worthy Korean War films but this one and M*A*S*H - released 11 years later - are recommended titles for anyone looking for authentic film treatments about the subject.",
         "I like this movie and while it lacks the realistic and detailed gore of modern war films, and it does have its glitches and goofs, it did not do a bad job for a 1959 production.The attention to detail given to King Company's organizational structure, and many other technical aspects of the platoon and company level combat operation portrayed was outstanding thanks to Captain Joseph G. Clemons Jr., the movies' technical director and actual commander of King Company during the battle. In addition, there was also an in your face, down in the dirt grittiness about the film that many other war films even to this day lack. One of my favorite parts of this movie was the on going confrontation between Lieutenant Clemons and Private Franklin. The way the conflict played out in the movie brought out the motivational traits from Clemons that makes a great leader and the final acceptance of Franklin of his obligation as a soldier and his willingness to share the fate of his brother in arms, what ever it may be; I love Woody Strode. As one living in the real world, I shaped my views of this film not from the anti-war intent of director Milestone, but from a war movie fan, and real life Grunt perspective. While it does have anti-war overtones courtesy of director Milestone and others, Pork Chop Hill was based on an actual Korean War battle, and book of the same title by U.S. Army historian S.L.A. Marshal, and the movie does contain many factual events such as the friendly fire incident at the command post. I like Pork Chop Hill for the Hollywood production that it is, and would recommend that its critics be ignored, and enjoy the movie.",
         "Take a look at the jagged line that represents the boundary truce line between North and South Korea on a map. You'll then have some idea of what Pork Chop Hill is all about. While the armistice talks are going on in Panmunjom, both sides are jockeying for position on both sides. The truce line will be on a prescribed latitude parallel, but owing to various hills and valleys, adjustments are in order. Those adjustments are costing lives though. While the talks are in their final stages the Communists prove intransigent about a particular piece of real estate called Pork Chop Hill that really has no significant value. But as Carl Benton Reid at the talks says it's value is it has no value. The Communists are just using it as a test of wills, filed for future reference. Gregory Peck as Lieutenant Joe Clemons gets the dirty task of leading his men into battle for no real discernible reason. How he keeps his men going is the real story here. Joe Clemons was a real army lieutenant who wrote a book on his real experiences on literally the last day of the Korean War. Peck is an inspirational Clemons and I'm sure the real Clemons must have liked it. Scattered in the cast are such future movie and television names as George Peppard, Harry Guardino, Gavin McLeod, Robert Blake, and Norman Fell. But the best performance in the film without a doubt belongs to Woody Strode. He's fully conscious of the racism he's feeling at home just before the civil rights revolution and can't really come up with a reason to die for Korea or do time in the army stockade for desertion. His scenes with Peck and with fellow black GI James Edwards just crackle with heat and talent. I'm surprised no one considered Strode for Best Supporting Actor. Lewis Milestone who directed THE anti-war film, All Quiet On the Western Front is at the top of his game in Pork Chop Hill. A really good film about a sadly forgotten conflict.",
         "One of the few classic films about the Korean war, Pork Chop Hill is a genuinely good specimen of a nitty gritty war film in the pre-blood and guts era. What the movie lacks in realistic language and violence it more than makes up for in intensity. Peck is amazing, as usual, as Lt. Joe Clemons, the man leading the charge on the hill. His performance of a man on the edge is very believable. Sympathizing with his plight to try and get reinforcements or the heck outta there is an easy task. The early civil rights-era film seems to also touch on some social issues, showing a camaraderie between all ethnicities. Overall, this is a fine example of a classic war film with one of the finest American actors of all time in the lead role...you can't go wrong."
      ],
      "genres": [
         "War",
         "Drama",
         "Action"
      ],
      "productionCompanies": [
         "United Artists",
         "Melville Productions"
      ],
      "summaries": [
         "Grim story of one of the major battles of the Korean War. While negotiators are at work in Panmunjom trying to bring the conflict to a negotiated end, Lt. Joe Clemons is ordered to launch an attack and retake Pork Cop Hill. It's tough on the soldiers who know that the negotiations are under way and no one wants to die when they think it will all soon be over. The hill is of no particular strategic military value but all part of showing resolve during the negotiations. Under the impression that the battle has been won, battalion headquarters orders some of the men withdrawn when in fact they are in dire need of reinforcements and supplies. As the Chinese prepare to counterattack and broadcast propaganda over loudspeakers, the men prepare for what may be their last battle.",
         "American GI's must retake a barren hill in Korea that has been overrun by Red Chinese troops. The ensuing battle becomes a meat grinder for American and Chinese alike. This story of a an actual battle is all grit."
      ],
      "budget": 0
   },
   "movielensId": 2669,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-05-29",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["Lewis Milestone"],
      "runtime": 97,
      "movieId": 2669,
      "title": "Pork Chop Hill",
      "mpaa": "",
      "actors": [
         "Gregory Peck",
         "Harry Guardino",
         "Rip Torn",
         "George Peppard",
         "James Edwards",
         "Bob Steele",
         "Carl Benton Reid",
         "Woody Strode",
         "George Shibata",
         "Norman Fell",
         "Robert Blake",
         "Cliff Ketchum",
         "Biff Elliot",
         "Charles Aidman",
         "Lew Gallo",
         "Abel Fernandez",
         "Martin Landau",
         "Harry Dean Stanton"
      ],
      "imdbMovieId": "0053183",
      "originalTitle": "Pork Chop Hill",
      "genres": [
         "Action",
         "War",
         "Drama"
      ],
      "youtubeTrailerIds": ["XPaEECzwUxI"],
      "plotSummary": "American GI's must retake a barren hill in Korea that has been overrun by Red Chinese troops. The ensuing battle becomes a meat grinder for American and Chinese alike.",
      "tmdbMovieId": 37305,
      "avgRating": 3.52687,
      "releaseYear": "1959",
      "numRatings": 521,
      "posterPath": "/3EJmYJyj2eyDArf36EXttVak3I3.jpg"
   }
}