{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "submarine",
            "id": 339
         },
         {
            "name": "captain",
            "id": 1316
         },
         {
            "name": "world war ii",
            "id": 1956
         },
         {
            "name": "pacific theater",
            "id": 161246
         }
      ],
      "imdb_id": "tt0052151",
      "video": false,
      "title": "Run Silent, Run Deep",
      "recommendations": [
         36554,
         29882,
         31938,
         18780,
         4820,
         43355,
         15876,
         44736,
         37921,
         37214,
         11463,
         5927,
         45874,
         18771,
         24774,
         42500,
         17720,
         11605,
         42738,
         17599
      ],
      "backdrop_path": "/8ZdPqz9Qo55mgHu0340eLABoarx.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Cmdr, Richardson",
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f4e9",
               "name": "Clark Gable",
               "profile_path": "/cebtqK6Ydrhi5ip0V12MDj3bDvd.jpg",
               "id": 11492,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Lt. Jim Bledsoe",
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f4ed",
               "name": "Burt Lancaster",
               "profile_path": "/bpAkekuIvKhh9L9Rean3fBznSy5.jpg",
               "id": 13784,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Yeoman 1st Class Mueller",
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f4f1",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Cartwright",
               "gender": 2,
               "credit_id": "5552f0bec3a368634d000d22",
               "name": "Brad Dexter",
               "profile_path": "/4IJA7Ne7V79VZHjGn5U2FjWwHzW.jpg",
               "id": 14529,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Quartermaster 1st Class Ruby",
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f4f5",
               "name": "Don Rickles",
               "profile_path": "/h5BcaDMPRVLHLDzbQavec4xfSdt.jpg",
               "id": 7167,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Russo",
               "gender": 2,
               "credit_id": "5552f0d2c3a368634d000d27",
               "name": "Nick Cravat",
               "profile_path": "/xZ1QfYvzOgZhiEqWryIxT0daQoi.jpg",
               "id": 69934,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Kohler",
               "gender": 2,
               "credit_id": "5552f0ecc3a3686341000cc5",
               "name": "Joe Maross",
               "profile_path": "/zuLt9iOXkJlcnObwAz5ZR0LzxJd.jpg",
               "id": 160541,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Laura Richardson",
               "gender": 0,
               "credit_id": "5552efe2c3a368634d000cfa",
               "name": "Mary LaRoche",
               "profile_path": "/pJa5OCJM2lHV9vB7a5vBxKRDk46.jpg",
               "id": 91707,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Larto",
               "gender": 0,
               "credit_id": "5626f2e792514137bd000a5a",
               "name": "Eddie Foy III",
               "profile_path": null,
               "id": 1104967,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Sonarman 1st Class Cullen",
               "gender": 2,
               "credit_id": "5626f2fcc3a368277c000bb6",
               "name": "Rudy Bond",
               "profile_path": "/wNpO0orqR8rWz7tf11iKN0UhvGg.jpg",
               "id": 3143,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Jessie (uncredited)",
               "gender": 0,
               "credit_id": "5552f0fec3a368634d000d32",
               "name": "Jimmy Bates",
               "profile_path": null,
               "id": 1242456,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Bragg (uncredited)",
               "gender": 2,
               "credit_id": "5552f11992514162d100098d",
               "name": "Joel Fluellen",
               "profile_path": "/r8Vno7WxBENXDzbZMCkKX290ftb.jpg",
               "id": 86370,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Frank (uncredited)",
               "gender": 2,
               "credit_id": "5552f10d925141499a000b35",
               "name": "Ken Lynch",
               "profile_path": "/6zrOWruN0LoolGOSNdzKdJMiVkd.jpg",
               "id": 2652,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Corpsman Hendrix (uncredited)",
               "gender": 2,
               "credit_id": "5626f3b6c3a368278f000b0d",
               "name": "H.M. Wynant",
               "profile_path": "/jB6p70n3P6ScGVboT7zJVNDcwmj.jpg",
               "id": 19435,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f4fb",
               "name": "Robert Wise",
               "profile_path": "/6EPkRgYsDMQOYmE9s1vZt2O470R.jpg",
               "id": 1744,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f507",
               "name": "Harold Hecht",
               "profile_path": "/jjqEnjTfsHLP8zlhdcdWTzYcCRf.jpg",
               "id": 13780,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe479a9251416c7509f50d",
               "name": "John Gay",
               "profile_path": null,
               "id": 19573,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe479a9251416c7509f513",
               "name": "Edward L. Beach Jr.",
               "profile_path": "/1DWeqc9ytPlrXkeJVqmDRmWiIdg.jpg",
               "id": 1180349,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "56d4c743c3a3682cef003e8d",
               "name": "Russell Harlan",
               "profile_path": "/yDYlBTYPEMARI8sKwPjnleqQvFL.jpg",
               "id": 4308,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5818c1d29251413c8a0075c7",
               "name": "William Schorr",
               "profile_path": null,
               "id": 9101,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5818c1f0c3a3683830006f53",
               "name": "James Hill",
               "profile_path": null,
               "id": 14568,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5818c1f6c3a36838c2006ad8",
               "name": "Franz Waxman",
               "profile_path": null,
               "id": 8619,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "5818c2009251413cc9007d71",
               "name": "Edward Carrere",
               "profile_path": null,
               "id": 7127,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "5818c21ac3a3683689006a72",
               "name": "Ross Dowd",
               "profile_path": null,
               "id": 224395,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 6.21662,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18784,
      "vote_count": 40,
      "budget": 0,
      "overview": "The captain of a submarine sunk by the Japanese during WWII is finally given a chance to skipper another sub after a year of working a desk job. His singleminded determination for revenge against the destroyer that sunk his previous vessel puts his new crew in unneccessary danger.",
      "similar": [
         424,
         423,
         9045,
         5925,
         14574,
         228150,
         637,
         289222,
         15764,
         369885,
         21876,
         803,
         821,
         1771,
         16869,
         2253,
         853,
         857,
         409,
         203833
      ],
      "original_title": "Run Silent, Run Deep",
      "runtime": 93,
      "poster_path": "/ulxNcQuQ0ERdfLYE8aopUgVUmAw.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "日本語",
            "iso_639_1": "ja"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jeffrey Pictures Corp.",
            "id": 82943,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hill-Hecht-Lancaster Productions",
            "id": 14269,
            "origin_country": ""
         }
      ],
      "release_date": "1958-03-27",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "Gable and Lancaster make the seas boil in the battle adventure that hits like a torpedo!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Robert Wise"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "John Gay",
         "Edward L. Beach"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052151/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMjU3MjczMV5BMl5BanBnXkFtZTcwNjA4ODkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Clark Gable, Burt Lancaster, Jack Warden | See full cast and crew »"],
      "reviews": [
         "After his submarine is sunk by a Japanese Akikase destroyer in the Bongo Straits off the coast of Japan in a 1942 encounter, Commander 'Rich' Richardson (Clark Gable) is put behind a desk for a while at Pearl Harbor... During a year, the vessel that destroyed his battleship, sinks three other American subs that dare to enter Area Seven home of the Bungo Straits... Richardson is seen, reliving his Bungo failure, with one target in mind: Hunting down and destroying the Imperial Japanese Navy's Submarine... His chance comes when the captain of another sub, the U.S.S. Nerka, reaches retirement... Richardson eventually convinces the Navy top brass for another chance and is given command... The crew he inherits is antagonistic, as is his new executive officer, Lt. Jim Bledsoe (Burt Lancaster), who had hoped for the command himself... Richardson cannot forget the Akikase and his nightmares about it... Determined to sink it, he puts his ship and crew through many difficult training maneuvers anticipating the inevitable encounter... When he learns of the destroyer's whereabouts, he deliberately announces that the Nerka is going into the Bongo Straits in direct defiance of orders to knock out the Japanese ship... The pairing of Gable and Lancaster as incompatible but mutually respectful naval officers is at the head of Robert Wise's motion picture... Later, of course, the destroyer against sub action reappears, but the most interesting sequences are when Wise stresses the human emotion of two screen icons, one on the ascent, and the other near the end of his career... 'Run Silent Run Deep' has little resemblance to the book written by Capt. Edward R. Beach, who served on the personal staff of General Omar Bradley during Bradley's tenure as Chairman of the Joint Chiefs of Staff, and as naval aide to President Dwight D. Eisenhower... The motion picture isn't particularly a great underwater action film, but with Lancaster and Gable in top form\u0097 and ably supported by Jack Warden, Don Rickles, Brad Dexter and Lancaster's frequent sidekick Nick Cravat\u0097it remains an interesting study of submariners and their dedication to duty under fire in World War II... The hate-your-enemy attitude remains undiluted however...",
         "This was the second of two films that Burt Lancaster's Hecht-Hill-Lancaster company produced with a co-star from the earlier generation of film icons. Lancaster got the services of Gary Cooper for Verz Cruz and for Run Silent Run Deep, Clark Gable signed on for a hitch in as a submarine captain with a mission that isn't in the orders. Clark Gable has been desk bound for a year after losing his submarine in the Bungo Strait in Japanese waters. He hears of another submarine coming into Pearl Harbor with a wounded captain who will be on medical leave. So with a little back channel influence playing naval politics, Gable gets command of the U.S.S. Nerka. He inherits a resentful crew and an executive officer in Burt Lancaster who thinks he should have inherited the job. Gable's going back to the Bungo Stratis to nail the Japanese battleship that sank his former submarine and it's against orders. The conflict already existing between Gable and Lancaster and the one some in the crew would like to make is what gives the film its spark. Though this is a submarine film, you can see plot elements of Flying Leathernecks and The Caine Mutiny here. Brad Dexter is in the Fred MacMurray role. If Humphrey Bogart on the Caine had had at least one confidant on board he might not have cracked up. Gable's confidante on the Nerka is Jack Warden who is desk bound with him and transferred with him to the Nerka when Gable got command. Both Warden and Dexter are the best in a good supporting cast. By the way what Gable is drilling his men in doing is shooting with precise speed and accuracy into the bow of an oncoming enemy ship and then diving for cover in split seconds. Quite a maneuver. And quite a good film as well.",
         "\"Run Silent, Run Deep\" featured the only pairing of two screen giants-Clark Gable, in the twilight of his career, and Burt Lancaster, whose best performances were still ahead of him. Sad to say that they couldn't be used in a joint effort again, as the on-screen chemistry was on a supreme height. Gable plays the commander of a WWII submarine that has recently been sunk in an ara referred to as the Bunko Straits, or Area 7. He has been assigned to a desk job back at Pearl Harbor, and even after a year, is still brooding over the loss of his crew and his boat. Lancaster has a good part, that of the Executive Officer of a sub called the USS Nerka. This boat has just had a command change, Lancaster desires that position, but is passed over in favor of Gable, who senses a chance to return to the Straits and extract revenge on the Japanese destroyer which he feels certain sank his old command. The clash between the two men is obvious, but they put their personal differences behind them, and head for a long lasting combat mission, which against orders, will include Gable's return visit to the forbidden area 7 of the Bunko Straits. Besides the pairing of two of Hollywood's screen legends, the film features the realism of using an actual ship of the line, the USS Redfish, for many of the shots. Also, the viewer has a chance to feel a part of the underwater tensions and claustrophobic conditions that submariners experienced during times of combat underwater. A must-see, or even better, a must buy film for those that enjoy films of this genre.",
         "WOW! is all I can say. This is the most realistic submarine film of it's day. I don't think anybody equaled this film in this genre until Das Boot was released nearly 30 years later. Clark Gable and Burt Lancaster star in this epic about a submarine and a mission. Others have commented at length on the basic story, so I'll leave that alone. Only a couple of details bothered me. The men were all too clean and well-shaven to be sub sailors. Some of the last WWII US Subs built had air conditioning, so that could explain the cleanliness and lack of condensation in the boat. Still, the entire crew should have been growing beards for the entire length of the cruise since water was too precious to be used for shaving or bathing while at sea. The only shipboard scene that I felt was unrealistic was one scene in the crew's mess. The space shown is far too large to have been aboard a US Fleet boat. Otherwise, I found the film to be a great depiction of the way life was aboard a US sub during WWII. The acting is superb by the entire cast, but it should be with names like Gable, Lancaster and Warden. This is one of the greats!",
         "This is a wonderful movie depicting the experience of one United States Navy submarine during the Second World War. The \"Silent Service\" never looked better. It is filmed in black and white, which is (possibly) a salute to the \"Victory at Sea\" series of a few years before, but this film would not work as well in color (in contrast with \"Das Boot,\" which would not work as well in black and white). Like \"Das Boot,\" the sets are realistic and give the viewer an intimate feeling of the claustrophobia that existed on these small subs. The script is excellent, although I have one recommendation: Try to watch this film in a \"closed caption\" mode. I hear fine, but when I watched it a second time in closed captioned, I picked up even more, particularly the names of the crew. Gable and Lancaster are a little too old for the roles they are playing. But, this is a small complaint in comparison to their remarkable performances. It's easy to think of Gable as \"Rhett Butler,\" no more and no less, but this film illustrates what a very fine actor he was. Lancaster is excellent, and gives a preview of his Oscar-winning turn in \"Elmer Gantry,\" just a year or two later. This is an old-fashioned film made with the able assistance of the U.S. Navy, and one cannot help but feeling a little pride in our nation and gratitude for our brave WW II veterans, after watching it. Highly recommended.",
         "A submarine story that sticks to a simple \"clash of wills\" storyline without the inclusion of sub-plots and worn-out clichés that existed in so many WWII war stories is RUN SILENT, RUN DEEP. It proves without a doubt that CLARK GABLE and BURT LANCASTER were not only genuine classic stars but extremely good actors when given a solid script. And under Robert Wise's no nonsense direction, the cast of submarine sailors delivers the goods in realistic fashion, avoiding the sort of stereotypes often seen in these kind of war stories. The main action involves Gable's revenge motif. He's like a Captain Ahab, fervently determined to sink the Japanese destroyer that took the lives of his former crew members a year earlier, just as Ahab ran after the whale. His motives are questioned by the man originally selected to be Captain, his second in command Burt Lancaster. It's the clash of wills between these strong personalities that gives the film its punch and keeps the situation tense and taut until the final battle. Franz Waxman's score is almost non-existent, one of the chief shortcomings for me, as I always expect great things from Waxman. Here he opted for silence on the soundtrack when the situations get tense, as when the depth charges are sinking to the bottom of the ocean, barely missing the submarine. Perhaps this was a wise decision, since the sounds we do hear are those the sailors aboard the sub are experiencing while waiting tensely in their claustrophobic surroundings. It's an admirable war film, graced by two excellent performances from Gable and Lancaster, both convincing in their display of authority and command. Although models are used in the battle scenes, all of the action looks very realistic thanks to some excellent B&W photography. Kudos to Robert Wise for keeping the whole story brisk and supercharged. It never drags for a moment, as some of the other big wartime movies like DESTINATION TOKYO did. The script is taut and concise without resorting to any arbitrary love interest or humorous shenanigans which would have weakened the drama--and it's all told in a tense running time of 94 minutes.",
         "After watching the great \"Crimson Tide\", I sought out to see more legendary submarine flicks. And while I was in Blockbuster, I saw \"Run Silent, Run Deep\" on the shelf and I remembered that movie being mentioned in \"Crimson Tide\" during the whole \"submarine movie trivia\" sequence on the bus. And the question that was asked was who the submarine commander in this movie was. And the guy answered \"That guy with the ears and the mustache, Cary Grant.\" For those of you don't know what the answer was, it was really Clark Gable, and those massive ears and the thin 'stache were his trademarks throughout his career. And once I picked up the DVD case, I showed it to my mother and she immediately saw the two actors on the front (Gable and Burt Lancaster) and told me how famous those two were. But the truth is, I didn't even know who those two guys were, obviously because of my young age at 17. But after I decided to rent it since it couldn't do any harm, my mother told me about the kind of acting legends that Gable and Lancaster were on the ride back home. But of course, it was a bunch of romance flicks that she told me about (Gone with the Wind, Elmer Gantry etc.), but I knew that if Gable and Lancaster were practically legends, and that this was a submarine film, I knew I might've started loving this. And strangely enough, I did. And I didn't even care for the fact that it was black and white, and the fact that it's 51 years old. When it came to movies, I realized for the first time that my mother was right about Gable and Lancaster. Those two had real acting skill and were 2 of the best I've ever seen. But now in Hollywood we get too many male/female models who act and they have no talent. But I get to see what it was like in the old days when Hollywood cared about talent over money, fame and hotness. Clark Gable is the submarine commander named P.J \"Rich\" Richardson. Rich is haunted by his memories of a Japanese battleship that destroyed his sub and his crew. For over a year, he dwells on that memory and wants vengeance more than anything. And then when a younger guy named James Bledsoe (Lancaster) heads a new sub that would be heading out into the Pacific to combat the Japanese, Rich abruptly takes command after convincing his superiors. And of course, Bledsoe isn't too happy about it but keeps his cool. And during the mission, Rich disobeys orders just to get the sub into the restricted areas which pushes the crew to planning on a mutiny, and causes tensions to rise between the two commanding officers (and I guess this is how Crimson Tide got that idea\u0085\u0085). The acting is excellent, thanks to Gable and Lancaster, we can feel the tension going on between these two. Oscar-winning acting in the 1950's was no different than it is today, and Gable and Lancaster could exhibit powerful human emotion especially when the 2 men clash over the safety and lives of the crew. And you're gonna find yourself siding with the both of them; you might side with Rich because of his quest for revenge even though he has to be doing the unethical to achieve his goal and Bledsoe just cares about the lives of the crew and even risked the sub being spotted when he ordered them to rise up to prevent a crew member from drowning. But by the end, the 2 men basically become each other when Rich realizes that revenge might not be worth it and when Bledsoe decides to go after the Japanese destroyer even when they're on their way home. Excellent character development to go along with the great story. The action was, for its time, very well done. To be honest I expected much worse from the special effects, but you can still see what's going on with all the torpedoes and the subs underwater. And especially the explosions of the ships, while they were black and white, they still captured the grim reality of warfare on the ocean. Also the thrills will make your heart pound like it did to mine and if the thrills were any more thrilling, I would've fainted. The scene at the end when the two subs face-off is among the best underwater battles I've seen in my life. The suspenseful part came when the fighter planes were dropping the bombs onto the sub underwater, and when one of the bombs hits the top of the sub and rolls over to explode and barely misses is when I nearly bit my fingernails off. And this was all perfectly edited and directed by the genius Robert Wise. And another thing, that pin-up girl that the crew slaps on its back-side before battle is a total icon to me and it's hilarious. I wish that I had a poster like that at home, haha, but that's just the boy in me talking. And I think that was even referenced in \"Die Hard\" when John McClane pats a similar poster of a girl on the wall, and given Die Hard's reputation, that has clearly gotta be saying a lot about \"RSRD\". And I'm gonna remember that part forever because it displays the crew's humanity as men. I'll admit that I said before that \"Crimson Tide\" was my favorite submarine movie of all time, but now I'm on the fence, because \"Crimson Tide\" took the idea of two submarine superiors clashing, from RSRD. And I'm not sure when I'm gonna decide. But anyway, this is a classic in its own right with two legendary actors and a great story about vengeance set in World War II.",
         "When it comes that particular sub-genre of \"military drama\" movies that take place aboard submarines, the canon cannot be considered complete without \"Run Silent Run Deep.\" It's not a flawless film, but nevertheless a very powerful one, and arguably seminal for the genre. This may well be the film which introduced the phrase \"Ah-OOOO-gah! Dive, dive!\" into the collective consciousness. Plot synopsis: At the start of the film, it's late 1942, and Commander \"Rich\" Richardson (Gable) is commanding a submarine attacking Japanese shipping in the Bungo Strait. One of the escorting vessels, an Akikaze-class destroyer, counter-attacks and sinks the submarine with consummate skill. We skip ahead to mid-1943 and find Richardson in a desk job at Pacific Fleet headquarters at Pearl Harbor, obsessing over how to take revenge on the destroyer, which he has nicknamed \"Bungo Pete,\" and which has sunk another three American submarines in the interim. When the position of commanding officer of the submarine Nerka becomes vacant, Richardson manages to wangle the job on the basis that the Nerka's next assignment will be to Japanese coastal waters, an area with which Richardson is well familiar. This, however, sets him at odds with the boat's executive officer, Lieutenant Bledsoe (Lancaster), who had originally been slated to take over command of the Nerka. Due to the losses incurred in the Bungo Strait, Richardson's orders are to avoid that waterway, but it is readily apparent to the viewer that Richardson fully intends to return to the Strait and sink \"Bungo Pete.\" However, \"Bungo Pete\" is not the only threat that the Nerka faces... The film's primary flaw is that it places emphasis on the significance of certain facts without explaining why these are significant. This is likely a result of being adapted from a novel. It would be helpful to know, for example, that the Bungo Strait is the waterway separating the Japanese islands of Kyushu and Shikoku, and is one of the two exits from the Inland Sea into the Pacific. It is the obvious route for shipping to and from the military logistics center at Hiroshima, among others, and would therefore be a \"target-rich environment\" for American submarines. Another commentator on this site asks why a Momo-class destroyer \"merely serves as target practice\" while the Akikaze-class is considered a serious threat. The answer is that the Momo is a \"2nd class\" destroyer, older, slower and more lightly armed than the Akikaze. Most importantly, 2nd class destroyers did not have depth charges, and were thus unable to harm a submerged submarine. (It should be noted, incidentally, that what is referred to as the Akikaze-class in this film is more correctly known as the Minekaze class. \"Bungo Pete\" could not be the historical Akikaze, as this vessel was in the South-West Pacific at the time this film takes place.) As to the question why Richardson opts not to dive when attacked by aircraft, the answer is that a submarine IS visible from the air if it's only at periscope depth, while at the same time, being submerged forces it to run on electric (battery) power instead of its diesels, resulting in less speed and maneuverability. For the Nerka to gain protection from diving, she would have to go so deep that she could not continue the attack against the Akikaze. The pacing in the film is very good, and the story carries no unnecessary ballast. It was probably to maintain this that much of the exposition was cut. However, this does cause certain events in the film to come off as contrived to the casual viewer, which is unfortunate, because actually the story is very consistent. Like a good detective story, the film gives you clues to future events instead of springing them on you (per the dictum attributed to Chekov that a gun fired in Act III should be visible on the wall in Act I). Gable and Lancaster may, strictly speaking, be too old for their characters, but they play them convincingly, and their interaction--especially Bledsoe's grudging but increasing respect for Richardson--is very credible. There are some war movie clichés, and you can plainly see the wires used on the sub and torpedo models in the underwater scenes, but this was, after all, 1958. If you like submarine movies, you'll love this one.",
         "A good story and good performances from good actors leads inevitably to a really good movie, and that's what you get with this movie set on an American submarine patrolling Japanese waters during World War II. Clark Gable plays Commander P.J. Richardson, reduced to a desk job at Naval headquarters in Pearl Harbor after the submarine he commanded was sunk by the Japanese. After another sub returns to base needing a new captain, Richardson convinces the brass to give him another shot, and he sets out on a quest for revenge, seeking the ship that shot his first sub out from under him. Among other challenges, Richardson has to put up with the wounded ego of his Executive Officer, Jim Bledsoe (Burt Lancaster) who believed the command should have been given to him, and with the hostility of the crew, who would have preferred Bledsoe. The story of Richardson's quest for revenge, of his efforts to gain the trust of his crew and of his ultimate fate is full of suspense and you will not find your attention wandering at any point of this movie. It is an excellent story, well worth watching. 8/10",
         "The interaction between Gable and Lancaster is something to behold. That and the story, the tension and the realism of men under attack. Yes, the special effects are not to the \"high\" standards of today, but they serve the story well and do not detract from the important drama. As one poster said, this movie would be ill served in color as would Das Boot in B&W. An overall excellent adaptation of the book and as far as the points not explained, all the better. I hate movies that stop the action to then explain to a character what that character is about to experience/see/do, etc. Give the movie goer credit for being able to fill in the gaps. A must have for any WWII movie collection."
      ],
      "genres": [
         "War",
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Hill-Hecht-Lancaster Productions",
         "Jeffrey Pictures Corp."
      ],
      "summaries": [
         "The captain of a submarine sunk by the Japanese during WWII is finally given a chance to skipper another sub after a year of working a desk job. His singleminded determination for revenge against the destroyer that sunk his previous vessel puts his new crew in unneccessary danger.",
         "A U.S. sub commander, obsessed with sinking a certain Japanese ship, butts heads with his first officer and crew."
      ],
      "budget": 0
   },
   "movielensId": 2670,
   "movielens": {
      "languages": [
         "English",
         "日本語"
      ],
      "releaseDate": "1958-03-27",
      "dvdReleaseDate": "2000-11-13",
      "directors": ["Robert Wise"],
      "runtime": 93,
      "movieId": 2670,
      "title": "Run Silent, Run Deep",
      "mpaa": "",
      "actors": [
         "Clark Gable",
         "Burt Lancaster",
         "Jack Warden",
         "Brad Dexter",
         "Don Rickles",
         "Nick Cravat",
         "Joe Maross",
         "Mary LaRoche",
         "Eddie Foy III",
         "Rudy Bond",
         "Jimmy Bates",
         "Joel Fluellen",
         "Ken Lynch",
         "H.M. Wynant"
      ],
      "imdbMovieId": "0052151",
      "originalTitle": "Run Silent, Run Deep",
      "genres": [
         "Drama",
         "War"
      ],
      "youtubeTrailerIds": ["TKM7CzLytxc"],
      "plotSummary": "The captain of a submarine sunk by the Japanese during WWII is finally given a chance to skipper another sub after a year of working a desk job. His singleminded determination for revenge against the destroyer that sunk his previous vessel puts his new crew in unneccessary danger.",
      "tmdbMovieId": 18784,
      "avgRating": 3.88331,
      "releaseYear": "1958",
      "numRatings": 1384,
      "posterPath": "/ulxNcQuQ0ERdfLYE8aopUgVUmAw.jpg"
   }
}