{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0126859",
      "video": false,
      "title": "The Loss of Sexual Innocence",
      "recommendations": [
         27444,
         44412,
         49471,
         1608,
         47452,
         17993,
         36094,
         55306,
         44941,
         25221,
         41807
      ],
      "backdrop_path": "/gZkYHyYnc9uPP5ES6h5y65twYRC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Adult Nic",
               "gender": 2,
               "credit_id": "52fe46359251416c75070c3f",
               "name": "Julian Sands",
               "profile_path": "/hDb4UlbeTvvVK53Cmh7W0Ijo41h.jpg",
               "id": 6104,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "English / Italian Twin",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c43",
               "name": "Saffron Burrows",
               "profile_path": "/1X9gJnDIYE4N52UtPZ9qM3Bi2TM.jpg",
               "id": 9825,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Flash Man",
               "gender": 2,
               "credit_id": "52fe46359251416c75070c47",
               "name": "Justin Chadwick",
               "profile_path": "/zrKoTfiSU7yhCmIKVWbkfLgnLWy.jpg",
               "id": 71570,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Luca",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c4b",
               "name": "Stefano Dionisi",
               "profile_path": "/qV9KyDhb0AuxHYMUr1UqhbBPhb.jpg",
               "id": 16240,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Susan",
               "gender": 1,
               "credit_id": "52fe46359251416c75070c4f",
               "name": "Kelly Macdonald",
               "profile_path": "/ncpSRbNH44itdir2FLJHsD0nGVV.jpg",
               "id": 9015,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Susan's Mother",
               "gender": 1,
               "credit_id": "52fe46359251416c75070c53",
               "name": "Gina McKee",
               "profile_path": "/pyPapwCdP9rL7PGnD1MRjHZg4Nd.jpg",
               "id": 18022,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Nic, aged 16",
               "gender": 2,
               "credit_id": "52fe46359251416c75070c57",
               "name": "Jonathan Rhys Meyers",
               "profile_path": "/A6RyyQ4GeXl0ugnGrqGqBMQIgKh.jpg",
               "id": 1244,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Susan's Father",
               "gender": 2,
               "credit_id": "52fe46359251416c75070c5b",
               "name": "Bernard Hill",
               "profile_path": "/fX9ggRFAZM7J8vPBdTWQphUNiRt.jpg",
               "id": 1369,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Blind Woman",
               "gender": 1,
               "credit_id": "52fe46359251416c75070c5f",
               "name": "Rossy de Palma",
               "profile_path": "/3IH9ZBUcFNwBr8IcS1RZhMKTpeg.jpg",
               "id": 25258,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Nic, aged 5",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c63",
               "name": "John Cowey",
               "profile_path": null,
               "id": 77833,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mixed Race Girl",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c67",
               "name": "Nina McKay",
               "profile_path": null,
               "id": 77834,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Wangi",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c6b",
               "name": "Dickson Osa-Omorogbe",
               "profile_path": null,
               "id": 77835,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Old Colonial Man",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c6f",
               "name": "Jock Gibson Cowl",
               "profile_path": null,
               "id": 77836,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Adam",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c73",
               "name": "Femi Ogunbanjo",
               "profile_path": "/AnAPVdoieyl3j6auif1hPpZNXwY.jpg",
               "id": 77837,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Eve",
               "gender": 0,
               "credit_id": "52fe46359251416c75070c77",
               "name": "Hanne Klintoe",
               "profile_path": null,
               "id": 77838,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46359251416c75070c35",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46359251416c75070c3b",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "554cc897c3a3685e4e004e18",
               "name": "Mike Figgis",
               "profile_path": "/nIaxYZkNX6j70VQyHwzed1QxOXD.jpg",
               "id": 6111,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "554cc8ad925141400b001ddd",
               "name": "Annie Stewart",
               "profile_path": null,
               "id": 6116,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "554cc8d3925141400b001de5",
               "name": "Benoît Delhomme",
               "profile_path": "/qa2h6tyIG4iIc700VN7acYnhU4v.jpg",
               "id": 21655,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "554cc8ebc3a3685e55005358",
               "name": "Jina Jay",
               "profile_path": "/rMuj07hjZnT0zMC1kiBOs6IWCdO.jpg",
               "id": 474,
               "department": "Production",
               "job": "Casting"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 1.836321,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 15059,
      "vote_count": 10,
      "budget": 4000000,
      "overview": "The story of the sexual development of a filmmaker through three stages of his life.",
      "similar": [
         103686,
         11985,
         18499,
         27419,
         36457,
         66488,
         113782
      ],
      "original_title": "The Loss of Sexual Innocence",
      "runtime": 106,
      "poster_path": "/ddrayzMrXTng8WgzhVHEu30247f.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Red Mullet Productions",
            "id": 24827,
            "origin_country": ""
         },
         {
            "logo_path": "/rUp0lLKa1pr4UsPm8fgzmnNGxtq.png",
            "name": "Summit Entertainment",
            "id": 491,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Newmarket Capital Group",
            "id": 506,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-29",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Figgis"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Mike Figgis"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0126859/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwOTc3NjY2MV5BMl5BanBnXkFtZTYwMDk1Nzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Julian Sands, Saffron Burrows, Stefano Dionisi | See full cast and crew »"],
      "reviews": [
         "At what point do we lose our innocence? Is it the one moment of actually having sex, or is it a build up of smaller things through life that slowly take it away? This film has the effect of juxtaposing two views on the question: with Adam & Eve, we have complete innocence up to the moment of having sex ..then they are thrust out into the modern adult world and expected to somehow automatically know how to survive in it. The discovery of Sex does not give you the automatic knowledge of how to deal with all its possible consequences. Interweaved with that, Figgis puts scenes from a man's developing life. Events shown that each eat away a little bit of innocence we may not have even realized we still have. The slow disintegration of Innocence through time. The effect of both instances is numbing. The most amazing scene for me involves two twins, unaware of each other's existence (both played by Saffron Burrows), who one day cross paths with each other in an airport. The set up is stunning. This scene begs the question: if you met up with another version of yourself, a version with a different background & different formative events --would you even be recognizable to yourself? Would you be able to relate to that other you as a person? How much have the events in our lives formed us, and how much really is biological? The only quarrel with this film I have is a series of scenes in which Mr. Figgis employed a slow fade-in/fade-out method. This was very eye-painful to watch, the fade is at such a rate you feel as though you are just slow-blinking before falling asleep. Thankfully, this is only done briefly in the film. Over all, excellent filmmaking!",
         "This is not a film for someone who wants to \"sit back\" and be mindlessly entertained. It is a challenge to watch and an even bigger challenge to decipher. However, this film is such a demonstration of where film can go (beyond a linear storyline and literal constructions). It is patient and relaxed in its pace, is free to navigate through time and place. At first glance it appears to be a random compilation of shorts, but it really is a powerful interconnection of dreams, memories, archetypes, and life. What is most admirable about this film, though, is its confidence in its imagery (some of which is extremely powerful) and its minimal dialogue. This is not a film that \"spoon feeds\" theme and gives us chatterbox characters to walk us through what is happening. To be honest, I have seen the film three times and still am not sure about what is happening at every point, but it does leave room for personal meaning that makes it priceless and so rich. How many films can it be said of that even after a third viewing you have not even begun to realize its full meaning? There is much more said in the silence of \"Loss of Sexual Innocence\" that is ever said in any of its verbose contemporaries.",
         "This is a true \"art\" film, it has great depth and insight, but doesn't give the viewer a clear story-line to follow or any help at all such as side comments or scene setters. The film is a virtual feast of expert filmmaking in all its facets, especially the fine framing of the scenes, truly natural acting and sound work second to none. How many filmmakers could make a short scene in a plane and the subsequent landing on the runway a filmic event of such beauty it will be long remembered. I think this film is one not to be missed",
         "The LoSI may have been my favourite movie from 1999. To help set the scene for that comment, my favourite movie from 1998 may have been The Thin Red Line. It seems that movies that I love generally split the audience into two groups. Those that lose interest or are disgusted, and those that find these manifestations of the possibilities offered by film making exciting. I enjoy films that are told through cliche as much as the next person. High production values, non-innovative camera work, predictable characterizations (even within complex plot lines) are fun. But I also like to see the breadth of cinema challenged. Occasionally, films are able to appeal to both the audiences that want familiar story telling methods, and those that want to be challenged. It's great when that happens, but both the LoSI and the TRL have failed to do this for a significant portion of the audience (blue vs red America?). Some of the best parts of LoSI have to do with capturing moments that distill those things that we share. For example, the fumbling teenage living room scene hit some parts of the give and take of early sexual experience perfectly. A frustrated car ride captures family dyamics, and the everyday moments of getting along/by better than any other film I've seen. A distant viewing of domesticity (including putting a child to bed and love making over chopped vegetables) through a window precisely underscore more cliches of everyday living that are cliches because they happen to us. Perhaps because these scenes don't inform a simple story narrative, they fail to hold the interest of those looking for escape FROM life (again, as everyday lived). But I'm not looking for that. I'm looking for a celebration of identity, and those things that create it, and I am willing to work my way through what is, I think, essentially a character piece. This movie does, I think, a very good job of giving us, in two hours, a short examination of the develpment of one character's sexuality. How that development is a loss of sexual innocence, and how this loss ties in to larger ideas in our society (adam and eve), is something that I have both an academic (reflective) and an aesthetic (less relfective) interest in. As such, this movie appeals to me. It won't appeal to everyone. I think that a good way to judge whether you should see this movie or not is if you _LOVED_ Saving Private Ryan and _HATED_ The Thin Red Line. If so, do NOT see this movie. If you liked both, or liked only the thin red line, you'll probably be more interested in watch LoSI. The audience probably splits similarly in regards to the Figgis Filmography. Much of his early (mass market) work appeals to the first set (but not exclusively). His later work, the second (exclusively).",
         "Mike Figgis is an innovative director. This film was made before his other, more daring movie, \"Timecode\" in which he worked with a split screen in which the action could be seen happening at all times in all four sections. This film is also full of symbolism that will elude viewers. We don't think the director wanted to lose, no pun intended, the audience. The action in this film is seen through the eyes of Nic at different stages of his life. As the movie opens, he appears in the form of a child Nic and he makes another visit at the end of the movie, perhaps to watch our reaction. The child has intelligent eyes; he appears to be looking at our soul, or perhaps he is telling us this was his own story. The film that doesn't follow a linear narrative. Mr. Figgis composed the incidental music. He also includes well known piano pieces from composers like Beethoven and Chopin that plays well with the images on the screen. The real coup of the director was to employ Benoit Delhomme as the cinematographer of this droll story that follows Vic from childhood. Mr. Delhomme photographs the natural locations with such care that it might prove a distraction for the viewer. Some interesting actors were engaged to give life to this sophisticated look about the loss of innocence. This is a sensual movie that relies on the openness in which the director wanted to show. Julian Sands is Vic, the young boy of the story, now an adult and a film director. Saffron Burrows is seen in a double role; she is a ravishing woman! Jonathan Rhys Meyers plays Vic as a young man. Kelly MacDonald is seen as Susan. Hanne Klintoe and Femi Ogumbanjo are seen as Adam and Eve as they are placed on the garden of eden and when they are thrown out from it after having taste the forbidden fruit. John Cowey is Vic as a child in a non speaking but highly effective part. Rosie DePalma, a Spanish actress with an amazing face, is seen as a blind woman in a riveting scene. Like it or not, Mike Figgis is not a director to dismiss easily because he is an original.",
         "Well, I have to say that the comments on this movie are everywhere from \"I'd give this a 0/10 if I could\" to \"10/10 masterpiece\". Yes, this movie is all over the place. Confessed, I expected it to be that way when I decided to watch it. I would bear a non linear movie, and rather demented symbolism, if the theme is something that appeals to me, or better still - FITS the form of the movie. Sadly this did not. It's just art-cinema's answer to the hype around sex for pleasure nowadays. In a good movie, (just as with a good book) the theme should dominate the form. Sadly, the form was having epileptic fits here while the theme just sat there being generic and straightforward. This is rather like telling a story and structuring it like a poem. Why try to make the story of a (rather uninteresting, however handsome) man's sexual life up to his mid 40's subject to an artsy attack? The story (or the little that there IS) behind it is not deep, and not particularly meaningful, but the form (the way it's shot / the random scenes and flashbacks) didn't really help it to more seriosity and were hence, rather laughable. Triviality cloaked in 'artistry' really isn't down my street. If the theme would have been something very meaningful or complex or tragic, the form might have worked a little better (Why not give it an American Gothic touch, rather like McGrath or Brockden Brown in film version?) It would have raised the seriosity of the movie (and believe me... this movie is taking itself very seriously). I just cannot love a movie with such a trivial and generic theme (sex for pleasure) because it isn't really new or, as I said before, all too meaningful or deep in itself. Goes to show that you need a story that actually deserves to be wrapped in the cloak of stilted artistry. In its credit however, I will say that some of the camera work was stunning, and some visuals were quite breathtaking. I can't say I relate to the characters, but then with an artsy movie it's really hit or miss if you'll relate to them, since they must appeal to you personally to start off with, since they don't usually say much in their favor throughout the movie. Last but not least I'd like to say that even though I didn't particularly enjoy this movie doesn't mean that I don't enjoy art house movies. It's funny how people say \"if you didn't like this you can go watch some generic love comedy in the cinema\"... there's something in between too, you know! This isn't \"either ultra-artsy or generic to an extreme degree\" - there's some very good art-house flicks that realize that being alternative doesn't mean having to resort to obscure camera angles and a scattered plot.",
         "This film was so painful to watch that I turned it off about halfway through. It was excruciatingly bad. The lack of dialog was annoying, the same piano sonata playing constantly in the background was even more annoying, and the \"story\" was practically nonexistent. It was trying very hard to be arty, but it was just laughable instead. Nothing in the film was connected. What on earth did the story of the twins have to do with Nic's story? What did that ridiculous Adam-and-Eve sequence have to do with anything? The answer is nothing. Nothing in this film has anything to do with anything else. Mike Figgis should be embarrassed about making this movie, which is like a bad senior thesis from an untalented film-school student. I've got news for him: Taking a bunch of pretty images and setting them to music does not a film make.",
         "Mike Figgis' \"Loss of Sexual innocence\" is another of his undertakings into the world of film art. It's not quite art, and it's not quite entertaining. The film is expressed in a series of vignettes concerning the sexual maturity of a character called Nic intertwined with other bits that are supposed to represent Adam and Eve and the beginnings of sexual discovery and other bits that either mean something or not. The problem, though, is that the bits don't really add up to anything, not schematically, not thematically. Every time the Nic character reappears at a different age, you don't even get a sense of it being the same person; it always feels like Figgis is starting from scratch all over again with a new set of players. Figgis is a talented filmmaker, though. He knows how to build a segment for dramatic impact and how to compose a shot for effect, and in those rare moments, it feels like it's not all worthless and Figgis is getting across to the audience on some level. The sketch of Nic and his family stopping at a roadside gas station is a good piece, as is the woman in the see-through cotton dress at the train stop. There is an implied sexuality there, the sexuality that hums all around us, that we experience without really feeling. That's when the movie scores, when it's not just another lame coming-of-age story. But those moments are all too few. On the other hand, the Adam and Eve bits are trite, and one scene where a man carries a shopping bag with a liquor bottle spout protruding (obviously a metaphor for the male penis) is kid stuff, junkyard symbolism at its worst. Where this movie fails is not is in its structure on the screen, but in the mind. One postscript: After watching it, I put on the director's commentary on the DVD to get maybe a better understanding of what he was trying to do. Figgis narrates with a not-exactly-arrogance but with a tone certainly descending from the mountain. When he spoke the words \"we trucked in a load of red clay to recreate the Kenya of my youth\", I knew I was done for. I turned it off and switched back to my Sunday Sports Center. 1 1/2 * out of 4",
         "This movie is a strange one. It is difficult to work out the meaning the film maker is trying to convey. The story is very disjointed, you don't know who is who or more importantly what they are doing and why they are there. There movie flicks between totally different scenes which for me had no link whatsoever. I think the message trying to be delivered was totally obscure and I for one couldn't work it out. It seemed to be too \"artsy\". Perhaps the maker should next time try to project their message in a more straight forward way so normal people can understand.",
         "Oh my, what a piece of c***. This movie feels like something a freshman in film school would do when he was trying to be \"artsy.\" The Adam and Eve thing was so cliche. I didn't learn anything from this film. There were no new insights into life, or new ways of looking at things. Through the most basic symbolism (that a college kid would be embarrassed to use) the director tries to say something about sex I guess. The film was shot beautifully, but so what. Britney Spears albums are recorded beautifully by talented producers but the music underneath still sucks, and that's what happened here. Figgis would be a great cinematographer, that's about it. He really does do some inventive and passionate work visually, unfortunately, the rest of the movie is total garbage and you need MORE than just visuals to make a quality film. His story ideas are hackneyed and cliche. He tries to tie together different times of a man's life, yet he uses a blond haired, big-headed kid as a young child; a fat brown haired kid as a pre-teen; and then a blond stick-thin man as an adult. If you are going to show different stages of someone's life, especially not in sequence, you should at least have the actors bear some minimal resemblance to each other. Don't tell me this movie is sooo abstract that you can have totally physically differing looking actors playing the same person. I can't fathom how or why they would do this. Totally ridiculous casting. By the way, Why is Eve a thin white woman and Adam a strapping black man (who looks like there must have been a solo-flex in Eden)? There was absolutely no point in those scenes. Oooh, I get it, a snake. At one point I thought the whole movie was just one long Diesel Jeans commercial--all pretension with no substance. I have no problem with non-linear film, in fact I have loved some and gotten a lot out of them, but this movie manages to at once be incredibly obvious and predictable and at the same time totally incongruent and non-sensual."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Newmarket Capital Group",
         "Red Mullet Productions",
         "Summit Entertainment"
      ],
      "summaries": ["Confused, non-linear film tells the sexual story of a film director from his life at age 5, age 12, age 16, a man embarking on his first film in 1950's Tunisia, and finally to his current life. Along the way he has sexual exploits with an older woman as a teen, gets involved with an Italian couple Tunisia that culminates in the killing of a local boy and the brutal revenge murder of the woman, and ultimately is married to a cold woman."],
      "budget": 4000000
   },
   "movielensId": 2674,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-29",
      "dvdReleaseDate": "1999-12-07",
      "directors": ["Mike Figgis"],
      "runtime": 106,
      "movieId": 2674,
      "title": "The Loss of Sexual Innocence",
      "mpaa": "",
      "actors": [
         "Julian Sands",
         "Saffron Burrows",
         "Justin Chadwick",
         "Stefano Dionisi",
         "Kelly Macdonald",
         "Gina McKee",
         "Jonathan Rhys Meyers",
         "Bernard Hill",
         "Rossy de Palma",
         "John Cowey",
         "Nina McKay",
         "Dickson Osa-Omorogbe",
         "Jock Gibson Cowl",
         "Femi Ogunbanjo",
         "Hanne Klintoe"
      ],
      "imdbMovieId": "0126859",
      "originalTitle": "The Loss of Sexual Innocence",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of the sexual development of a filmmaker through three stages of his life.",
      "tmdbMovieId": 15059,
      "avgRating": 2.82995,
      "releaseYear": "1999",
      "numRatings": 197,
      "posterPath": "/ddrayzMrXTng8WgzhVHEu30247f.jpg"
   }
}