{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "ex-girlfriend",
            "id": 1595
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "friends",
            "id": 9713
         },
         {
            "name": "destiny",
            "id": 40850
         },
         {
            "name": "spanish",
            "id": 157194
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "actor",
            "id": 207716
         }
      ],
      "imdb_id": "tt0138590",
      "video": false,
      "title": "Twice Upon a Yesterday",
      "recommendations": [],
      "backdrop_path": "/xgHLT8T3YCH0nQWJqlLZdFlUIxZ.jpg",
      "revenue": 258464,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Sylvia Weld",
               "gender": 1,
               "credit_id": "52fe48e5c3a36847f817f367",
               "name": "Lena Headey",
               "profile_path": "/wcpy6J7KLzmVt0METboX3CZ0Jp.jpg",
               "id": 17286,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Victor Bukowski",
               "gender": 0,
               "credit_id": "52fe48e5c3a36847f817f36b",
               "name": "Douglas Henshall",
               "profile_path": "/ofbU3w8hlafOJfQ1uiAwjL1QSRw.jpg",
               "id": 35862,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Louise",
               "gender": 1,
               "credit_id": "52fe48e5c3a36847f817f37b",
               "name": "Penélope Cruz",
               "profile_path": "/dcPSUfxMa791NZvrFiBc3ReDdpU.jpg",
               "id": 955,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Alison Hayes",
               "gender": 1,
               "credit_id": "52fe48e5c3a36847f817f37f",
               "name": "Charlotte Coleman",
               "profile_path": "/tMJLpQaCeoqa4taaPpXpL8TS6b.jpg",
               "id": 10729,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Rafael",
               "gender": 2,
               "credit_id": "5488b737c3a368414b002034",
               "name": "Gustavo Salmerón",
               "profile_path": "/8LlO2Rl4iuLYpCjakOeAKS01TUX.jpg",
               "id": 1036581,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dave Summers",
               "gender": 2,
               "credit_id": "5488b747c3a3684148001de4",
               "name": "Mark Strong",
               "profile_path": "/svq7VWJqKN4Fq8ZJK1Yd8W711rn.jpg",
               "id": 2983,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Diane",
               "gender": 1,
               "credit_id": "5488b75192514151fd0020e0",
               "name": "Elizabeth McGovern",
               "profile_path": "/egt1d836NcYDTeiokz5Im8gHU4r.jpg",
               "id": 4513,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe48e5c3a36847f817f371",
               "name": "María Ripoll",
               "profile_path": null,
               "id": 102329,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e5c3a36847f817f377",
               "name": "Rafa Russo",
               "profile_path": null,
               "id": 148766,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.348821,
      "production_countries": [
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         }
      ],
      "id": 55912,
      "vote_count": 9,
      "budget": 0,
      "overview": "Victor Bukowski is an out-of-work actor with problems. He's got a lousy agent, he has a habit of falling out with directors and he's still in love with his ex-girlfriend. However, Victor is about to embark on an unexpected emotional journey which will make him confront his future and his past mistakes.",
      "similar": [
         290762,
         1903,
         226,
         1024,
         9576,
         862,
         38,
         19913,
         28178,
         858,
         489,
         13,
         281,
         50544,
         51828,
         109414,
         72105,
         272693,
         153,
         68718
      ],
      "original_title": "The Man with Rain in His Shoes",
      "runtime": 91,
      "poster_path": "/ssK6ZiyE1OdMuF8misIMDl1SMX5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "HandMade Films",
            "id": 20076,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CLT",
            "id": 40996,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Escima",
            "id": 40997,
            "origin_country": ""
         }
      ],
      "release_date": "1998-11-27",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "For anyone who needs a second chance at once upon a time.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Spain",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Maria Ripoll"],
      "runtime": 91,
      "synopsis": null,
      "writers": ["Rafa Russo"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0138590/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3ODU1MDI0Ml5BMl5BanBnXkFtZTYwNDU2MzE5._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Lena Headey, Douglas Henshall, Penélope Cruz | See full cast and crew »"],
      "reviews": [
         "1st watched 10/9/2001 - 8 out of 10(Dir-Maria Ripoll): Compelling romantic fantasy which keeps you interested all the way to the end. Believable characters played by little known British actors with Penelope Cruz playing the love interest near the end of the Movie. The story is basically about love gone bad, but is given a second chance by some interesting characters at a junkyard similar to the theme of the TV show `Twice in a Lifetime.' What is different in this movie is that we are never quite sure who to cheer for. It starts out being a weeper where we are routing for the dumped male character played by Douglas Henshall, then by the end were routing for the forgotten female character played by Lena Heady. It seems to be about how life gives us many chances to redeem ourselves despite our mistakes, with the two characters from the junkyard representing that `entity' that gives us the second chance. Definitely not a Hollywood-made romantic comedy because of the way that we are twisted from one character to the other in our loyalty and we are made to think about real life rather than just smiling about the played out fantasy-type life that never really happens(Aka - American made romantic comedies). These are the kinds of movies that made me a movie buff but they seem to be hard to find these days in our predictable Hollywood-glamorized video stores(look for this one in the comedy racks despite it's multi-faceted themes and multi-genred experience.)",
         "This is a charming romantic drama about a guy who has an affair on his girlfriend, confesses and is faced with the misery of being alone. He gets a chance to try again when he is sent back in time. The acting is very well done. The plot is interesting - similar to Sliding Doors. I like the story of redemption and discovering one's self in the process. This plot plays that story out quite well. While there's nothing terribly original here, I found the movie to be quite entertaining. All of the characters were endearing and three dimensional. There was no \"bad guy\"; just people going through life as best they can. I rated this movie an 8 out of 10.",
         "Twice upon a yesterday, also known as The man with rain in his shoes, is a charming movie about various relationships in sweet chaos during the beginning of autumn in London. In this movie the classic theme of given a second chance looks at all relationships with such universally unbiased attitude, that one can't help but feel good. And Penelope Cruz is completely captivating. (I first saw her in High-Low Country where she played a jilted girlfriend, and all you could think was \" maan that guy is STOO PID\"). Although the movie leans towards the possibility of destiny and determination, it really seems to want to tell something more essential: relationships, no matter how perfect they seem and how much you think you love, are still incidental and never unparalleled or even unique. So it's just the way one looks at things: the attitude, the joy and responsibility of loving someone, and the strength to let go when it's time.",
         "I watched this movie not really expecting very much and was pleasantly suprised! Realising too late that he has thrown away his life, Victor gets a second chance to change things. Although Mr. Fate sticks his oar in and things don't quite go to plan, you go with Victor as he realises his mistakes and appears to grow up in front of our eyes. If you like 'Sliding Doors' or 'Vanilla Sky' you'll appreciate this romantic 'If Only' film.",
         "I saw Twice Upon a Yesterday last night at a screening. My expectations were really low because I had not heard of this picture before and I didn't recognize any of the stars. On top of this, when I went to the theatre last night a special preview of Star Wars Episode 1 was playing on the same floor (I tried to sneak in but 20th Century Fox posted security at the exits). So a bit disappointed, I headed over to the screening for Twice Upon a Yesterday. And I must say I was very surprised. The acting performances were pretty terrific and the story/writing was pretty good as well. The story kinda reminded me of \"Sliding Doors\" in a way but I feel that this film is actually a much better fable. I don't want to give too much away but there are quite a few funny surprises and twists that make this movie an interesting experience. And if you are into philosophy, you will love the questions this picture raises about life and love. There is also a terrific breakout star in this, Penelope Cruz who plays Luisa is drop dead gorgeous (she has a role in Billy Bob Thornton new picture). My only criticism would be that the filmmakers did not use its London locale to its fullest, you almost feel as if this picture was shot on a backlot. More shots of the London scenery would have given the picture much more of a storybook feel. But all in all, I would recommend this movie (at the very least if your searching for a good video a few months from now and see Twice Upon a yesterday go ahead and rent it).",
         "This is a cute film which is very enjoyable to watch. I wondered though if I formed part of a very select group of people who would enjoy it as much as I did. I saw it in Spain (in original version of course), where I was living at the time, which added to my appreciation of its \"Spanishness\". I am, nevertheless, English and enjoyed something peculiarly English about the whole thing, the self-deprecating humour as well as the great shots of London, (NOT the Tower or Big Ben, just ordinary real London) including the Notting Hill Carnival. And I think only the English can truly appreciate how near the bone the parodied BBC sitcom in which the main character becomes embroiled is. I felt that to enjoy the film as I did, you have to bring together a number of different strands. For example, personal experience of both English and Spanish culture. And, speaking of culture, it helps if you are familiar with \"Don Quijote\". Add to this a penchant for both romantic comedy and bizarre fantasy worlds (for any fans of \"Stig of the Dump\" this has a scene a little like that for grown-ups) and you can really enjoy this film. A peculiar title in English, by the way. In Spanish the title means \"Rain in your shoes\" (more or less) which emphasises the time travel element less and makes it a little more mysterious, I feel. The English sounds a bit hackneyed in my opinion. I thought I had read somewhere that it was called \"The man with rain in his shoes\", though this is a bit of a mouthful I must admit.",
         "I sat down to watch this last night, expecting to see the movie with Jennifer Love Hewitt (this one is called \"If Only\" on this side of the pond), and almost turned it off in the first 10 minutes. I'm glad I didn't. Douglas Henshaw looks so shambolic that its difficult to believe he pulled a poppet like Lena Headley, but he is a very good actor and gradually the movie draws you in, taking you on a whimsical ride in the style of Richard Curtis, albeit rather more subdued. My guess is that Penelope Cruz was there to provide American audiences with a familiar name, and she does an reasonable job without ever setting the screen alight. What I'd really like to know though is whether the characters of the Spanish garbagemen came about as a result of casting her, or vice-versa. Either way, it works well, and the resulting story of love, choices, fate and moving on is nicely told, without preaching. Unfortunately, I worked out what was going to happen about half an hour before the end, and for that reason can only give it 8/10; but it was a good enough film to watch it out, and I'm sure it'll provide canoodling couples with a pleasant way to spend a couple of hours for many years to come.",
         "I wrote a review for this movie, it got lost somehow and never showed up. I like this movie so much I have to rewrite it again. First of all, I do not agree that this is a depressing movie. It's rather charming and fun, the story is unpredictable, great acting and beautiful girls. Many of us have lost someone important because of our own mistake and wish to be given a second chance to make things right. This movie give me a new prospective, to move on with live with new enthusiasm and not to dwell on the past, as Victor said \"I am not stuck anymore\".",
         "Twice Upon a Yesterday is a truly unique movie. It is not your typical romantic comedy - rather it is a truly mind provoking exercise. While it may not appeal to all, it certainly has a certain charm that even the most vocal critics of the genre will find appealing.",
         "In short, this movie is well written, well acted but not well directed. It's well written because on an already seen basis (back in time to have a second chance), the story offers a new direction: there can't be a second chance because if things can change, the result is still the same. So it's the total opposite of \"Back of future trilogy\" for example. The final twist with Don Quichotte is interesting as well because it opens a larger perspective as it seems that finally our life is in the hands of powerful entities. It's a bit Lynchian or karma inspired as in \"Groundhog day\". The cast is excellent: Lena is totally British, Strong is the usual bastard, and the unknown hero is sympathetic (he reminds me a bit of Michael Youn's buddy, Alexandre Desagnat). And, for sure, Penélope is the usual light even if she's still a newcomer at the time. However, the directing isn't to the level: first, the pace is a bit slow and sometimes looks into useless matters. The production is a bit ugly as orange keeps popping in each frame and this color isn't very cinematic."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "CLT",
         "Escima",
         "HandMade Films"
      ],
      "summaries": [
         "Victor, an out of work actor, tries to stop his ex-girlfriend, Sylvia, from marrying another man. When she refuses him, Victor is miraculously given a second chance to go back and correct the mistake which led to their break-up.",
         "Unfaithful, out-of-work actor Victor is desperate to win back the affection of his ex-girlfriend Sylvia before she marries another man, Dave Summers, but she is resolutely against this. Unexpectedly, he meets two very strange Spanish dust-men who, by means unknown, turn back time and allow him another chance to correct his mistake. However, fate again plays a hand and Dave and Sylvia meet, this time via Sylvia's best friend Alison, and again fall in love. This time around Sylvia is the unfaithful one and eventually leaves Victor to be with Dave. Desolate Victor can't believe his luck until he meets the beautiful Louise. Is this Victor's destiny of does fate have more tricks to play?",
         "A shambling, out-of-work actor, desperate to win back the affections of his ex-girlfriend, unexpectedly stumbles upon a way to turn back the clock."
      ],
      "budget": 0
   },
   "movielensId": 2675,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-11-27",
      "dvdReleaseDate": "1999-10-26",
      "directors": ["María Ripoll"],
      "runtime": 91,
      "movieId": 2675,
      "title": "Twice Upon a Yesterday",
      "mpaa": "R",
      "actors": [
         "Lena Headey",
         "Douglas Henshall",
         "Penélope Cruz",
         "Charlotte Coleman",
         "Gustavo Salmerón",
         "Mark Strong",
         "Elizabeth McGovern"
      ],
      "imdbMovieId": "0138590",
      "originalTitle": "The Man with Rain in His Shoes",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Nr2OySYxnsU"],
      "plotSummary": "Victor Bukowski is an out-of-work actor with problems. He's got a lousy agent, he has a habit of falling out with directors and he's still in love with his ex-girlfriend. However, Victor is about to embark on an unexpected emotional journey which will make him confront his future and his past mistakes.",
      "tmdbMovieId": 55912,
      "avgRating": 3.28365,
      "releaseYear": "1998",
      "numRatings": 104,
      "posterPath": "/wGSj8B6NbrPxzHlY4t6JPESpckA.jpg"
   }
}