{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bomb",
            "id": 258
         },
         {
            "name": "fire",
            "id": 657
         },
         {
            "name": "explosive",
            "id": 1653
         },
         {
            "name": "fbi",
            "id": 1812
         },
         {
            "name": "quarantine",
            "id": 6898
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "water park",
            "id": 14913
         },
         {
            "name": "bonfire",
            "id": 157775
         },
         {
            "name": "ice cream cone",
            "id": 185227
         },
         {
            "name": "four-wheelers",
            "id": 192705
         },
         {
            "name": "soda",
            "id": 192706
         },
         {
            "name": "aqueduct",
            "id": 192707
         },
         {
            "name": "beer bong",
            "id": 192708
         }
      ],
      "imdb_id": "tt0126261",
      "video": false,
      "title": "Desert Blue",
      "recommendations": [
         110761,
         77073,
         48833,
         83105,
         47874
      ],
      "backdrop_path": "/qgouRMlaauSWmgD6pAmiUUaR8g2.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Pete Kepler",
               "gender": 2,
               "credit_id": "52fe45d9c3a36847f80de175",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Skye Davidson",
               "gender": 1,
               "credit_id": "52fe45d9c3a36847f80de179",
               "name": "Kate Hudson",
               "profile_path": "/87SBjReNEW8PFiGbPSTS68H39LT.jpg",
               "id": 11661,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Blue Baxter",
               "gender": 2,
               "credit_id": "52fe45d9c3a36847f80de17d",
               "name": "Brendan Sexton III",
               "profile_path": "/kQsOIQuGcqwdpolSEzLV7RfYVsV.jpg",
               "id": 2839,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Ely Jackson",
               "gender": 1,
               "credit_id": "52fe45dac3a36847f80de18d",
               "name": "Christina Ricci",
               "profile_path": "/dzB58d6fNrTEi7nBAU1tySJc2at.jpg",
               "id": 6886,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Cale",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de191",
               "name": "Ethan Suplee",
               "profile_path": "/tdfUFBwYm9rjwD2YtVl9LYoyoE2.jpg",
               "id": 824,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Sandy",
               "gender": 1,
               "credit_id": "52fe45dac3a36847f80de195",
               "name": "Sara Gilbert",
               "profile_path": "/pNimJ9cfqe9OeOLFl0k1pXkQ7SY.jpg",
               "id": 3282,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Billy Baxter",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de199",
               "name": "Peter Sarsgaard",
               "profile_path": "/dGoUlDEJumPY0CFlT7eM6KVdLUu.jpg",
               "id": 133,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Prof. Lance Davidson",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de19d",
               "name": "John Heard",
               "profile_path": "/rz9E9VyZXeyspfCshXFKHIy5rP0.jpg",
               "id": 11512,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Haley Gordon",
               "gender": 0,
               "credit_id": "52fe45dac3a36847f80de1a7",
               "name": "Isidra Vega",
               "profile_path": "/rR4WfwWhHCQSTg9RzniQlDtg6LR.jpg",
               "id": 1189668,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Dr. Gordon",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de1ab",
               "name": "Rene Rivera",
               "profile_path": "/twP6dw9iKtPY3PcR8fO1Zi1aLpS.jpg",
               "id": 101026,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Deputy Keeler",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de1af",
               "name": "Lee Holmes",
               "profile_path": "/gbYXVzZicgcfOZ4CNNOhavHKxwN.jpg",
               "id": 137417,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Caroline Baxter",
               "gender": 1,
               "credit_id": "52fe45dac3a36847f80de1b3",
               "name": "Lucinda Jenney",
               "profile_path": "/nhKWN1oWThSgz0AnUDOcQTubh3r.jpg",
               "id": 5148,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Sheriff Jackson",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de1b7",
               "name": "Daniel von Bargen",
               "profile_path": "/fFiiZCvBCqQ4xmCzYpMJQ7xboP3.jpg",
               "id": 1473,
               "order": 12
            },
            {
               "cast_id": 17,
               "character": "Agent Frank Bellows",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de1bb",
               "name": "Michael Ironside",
               "profile_path": "/i3HkCGEnQGJeD0U8WDumO4VH5fU.jpg",
               "id": 11086,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Agent Summers",
               "gender": 1,
               "credit_id": "52fe45dac3a36847f80de1bf",
               "name": "Aunjanue Ellis",
               "profile_path": "/xo8wv5fhpxAPnNA7HS7WH8psguQ.jpg",
               "id": 53923,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "KBLU Radio DJ (voice)",
               "gender": 0,
               "credit_id": "52fe45dac3a36847f80de1c3",
               "name": "Fred Schneider",
               "profile_path": "/drVHx9UMCmYLSKKypct8xMsQpxa.jpg",
               "id": 203660,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Mickey Moonday (voice)",
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de1c7",
               "name": "Liev Schreiber",
               "profile_path": "/qFn3npmqd1qaYOk6yohmi3FbPhc.jpg",
               "id": 23626,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de183",
               "name": "Morgan J. Freeman",
               "profile_path": "/sahczLXjQ9b9zPHfASuRRrINgHQ.jpg",
               "id": 66800,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de189",
               "name": "Morgan J. Freeman",
               "profile_path": "/sahczLXjQ9b9zPHfASuRRrINgHQ.jpg",
               "id": 66800,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45dac3a36847f80de1a3",
               "name": "Enrique Chediak",
               "profile_path": null,
               "id": 17598,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.963355,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 41730,
      "vote_count": 11,
      "budget": 0,
      "overview": "An academic obsessed with \"roadside attractions\" and his tv-star daughter finally discover the world's largest ice cream cone, the centerpiece for an old gold-rush town struggling to stay on the map. They end up staying longer than expected because of an accident that spilled an unknown cola ingredient all over the highway. They spend the next few days with the various residents of the town which include a teenage girl who loves to blow things up and a boy trying to keep alive his fathers dream of building a beachside resort in the middle of the desert.",
      "similar": [
         2142,
         273481,
         395834,
         261023,
         4349,
         429733,
         3134,
         8810,
         1572,
         562,
         298312,
         8836,
         2253,
         186,
         205,
         12162,
         769,
         4771,
         137094,
         281
      ],
      "original_title": "Desert Blue",
      "runtime": 90,
      "poster_path": "/bHsLvpsTU5VI96YDCdJMmGz2M0o.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ignite Entertainment",
            "id": 15460,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "HSX Films",
            "id": 15461,
            "origin_country": ""
         }
      ],
      "release_date": "1999-06-06",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "Once You Get There, You'll Never Want To Leave",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Morgan J. Freeman"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["Morgan J. Freeman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0126261/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4Nzk3MTA1NF5BMl5BanBnXkFtZTcwNDk5MzgxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Casey Affleck, Brendan Sexton III, Kate Hudson | See full cast and crew »"],
      "reviews": [
         "It took awhile to get going, but I ended up loving \"Desert Blue\" quite a bit. It was nice to see Sexton play a character without the need for anger-management, and I also liked Kate Hudson also. It wasn't the greatest, funniest or most touching movie I ever saw, but it was certainly better than most. I liked practically every character on some level, and I can't say that about a lot of movies. It made me think of \"What's Eating Gilbert Grape\" & \"Bagdad Cafe\" with a touch of \"Firestarter\".",
         "I enjoyed this movie thoroughly. This movie, led by an ensemble cast of young and rising actors (Brendan Sexton, Kate Hudson, Casey Affleck, Christina Ricci), starts slowly but gathers momentum nicely. Skye (Hudson), an up-and-coming actress with her own cable comedy, gets trapped in a small California town well off the highway when a chemical spill shuts down the only road in and out of town. Stuck far from her world -- in a town without cable or cell phones -- Skye is befriended by Blue (Sexton) and meets the local \"gang\" -- five kids without much to do. Over two days punctuated by explosions -- the results of Ely's (Ricci) love for illicit bomb making -- the group bonds together in unexpected ways.",
         "\"Desert Blue\" With \"Hurricane Streets\". director Morgan J. Freeman burst onto the film scene with a sharp portrayal of bored inner city kids. Motivated by stealing, disarmed by love, the film was highly entertaining if a bit flawed. \"Desert Blue\" is Freeman's second film and represents his attempt to reach the opposite end of the spectrum. This time, instead of a population of millions, we now get a population of 97. The film is set in fictional Baxter, California, the home of the world's largest ice cream cone and the factory of burgeoning cola company Empire Cola. When a truck carrying Empire's secret ingredient has a massive accident and subsequent spill, the town in quarantined and put on alert for possible toxic contaminants. The town locals, who never thought about leaving their boring town before, now become antsy and think about life outside of Baxter. Kate Hudson (\"200 Cigarettes\") and John Heard play two travelers who were passing through Baxter during the spill. They become part of the quarantine and befriend the locals. Brendan Sexton III (\"Hurricane Streets\"), Casey Affleck (\"Good Will Hunting\"), Christina Ricci (Everything independent), and Ethan Suplee (\"Mallrats\") play the local kids. The ride around all day in ATVs and spend their nights drinking by the long aquaduct. Each kid harbors a long standing resentment to Baxter, and each kid expresses that uniquely. Ricci by anarchy, Affleck by ATV racing, Suplee has a long dream of becoming a deputy, and Sexton tries to keep the family business alive, thought it died a long time ago. \"Desert Blue\" is somewhat a comedy, somewhat a drama, and somewhat a commercial for poor actors. While it's nice to see old faces like Sara Gilbert (\"Roseanne\") and Michael Ironside (\"Total Recall\") in small supporting roles, the rest of the cast is laughably bad. I do understand that they might be trying to conveying boredom, but they do it just a touch too realistically. That leaves the film with a very awkward static atmosphere. The best moments of the film come when Freeman lets his actors and the plot get a bit silly. The film comes alive in scenes of Orange baseball, potato guns, and an ad-lib by Casey Affleck that made me laugh the rest of the picture. \"Desert Blue\" could have worked better if Freeman would have lit a fire under the plot. Too many scenes include drunken ramblings, proof that a film isn't trying. While I came out of the film with a good feeling about it, I wished the movie could've taken more advantage of it's possibilities. ------- 6",
         "I just finished seeing Desert Blue for the first time and my first impressions for this movie are good. I liked this movie for it's simplicity and well written monologues which entangle you in it's story line enough to take you through the entire movie. It's young cast is good enough to portray somewhat lost teenagers in what would be best described as \"small town U.S.A.\" All except for the sometimes over played, but not this time, \"kid star/rich girl\" portrayed by Kate Hudson. I did though have a problem with the way the movie develops as it seems to leave as hanging awaiting for a \"ad they lived happily ever after\" tag Line but then again I guess that was implied in the movie itself. I'd definitely recommend it. I just finished watching it and I can't wait to see it again.",
         "What I truly love about Desert Blue, not only is it an all star cast, but it was definitely well thought up. It has mystery. It has dramatic moments. There is not much action, but I feel that it has the perfect amount. Desert Blue also has several amounts of comedy mixed in to bring it all together. If a sequel was to be made of Desert Blue, I would like to see a lot of the same actors and actresses in it. As well as the same director and producer. Since there was just a slight bit of romantic involvement with some of the characters, perhaps the sequel could go in a little deeper into that yet still have all the other elements that a great movie like Desert Blue has. I hope that if there is a sequel, that it will live up to its predecessor. If there wasn't going to be a sequel, perhaps now there will be.",
         "Wow. What a great film. The acting is awesome. The story is original but familiar enough for you to become invested in. The characters are original and quirky in a very real way. The best thing is that, as a teen, I never felt insulted by what I was seeing. Of course, I am not like these people, but I definitely can relate to them and can say I know a few like them. A believable, intriguing film that is both very funny and very dramatic. Go see it.",
         "This film was much better than I was expecting and much better than most Quirky films with a youthful cast. Sexton, Ricci and Hudson are all really great. John Heard is adorable as the shaggy pop culture prof. Really a nifty little film!",
         "i really did like this movie. it's totally cheesy and teeny-bobberish, but it's cute. casey affleck is great and so is kate hudson. i rented this movie and watched it like 5 times over the course of my 5-day rental. gotta get my money's worth and i feel like i did.",
         "I'd like to preface any comments with the fact that i liked this movie. It was a good watch, and i really enjoyed it. I was never much of a kate hudson fan, but after watching this one it's impossible not to love that girl :o) I can't stand the people on imdb that write these over-analytical, hollywood bullsh*t analyses; so i'll keep this one simple and to the point: Solid romantic plot, fun dialogue, and interesting characters. I also had fun recognizing some of the people in this film who play lesser roles, who are more notable from other movies/tv shows (i.e. \"darlene\" from roseanne, peter mcallister--the dad from home alone, and the head fbi agent--from starship troopers just to name a few). I don't want to brand any of these actors with these roles; it's just that i'd find myself watching and go: I know that person! Well, that's all i got here...give it a watch :o)",
         "\"Desert Blue\" has virtually everything a film can offer; a skillfully evoked setting, characters who imbed themselves in your consciousness, passion and scope. Freeman did a brilliant job directing. This will be in my Top 10 - to watch again and again"
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Ignite Entertainment",
         "HSX Films"
      ],
      "summaries": ["An academic obsessed with \"roadside attractions\" and his tv-star daughter finally discover the world's largest ice cream cone, the centerpiece for an old gold-rush town struggling to stay on the map. They end up staying longer than expected because of an accident that spilled an unknown cola ingredient all over the highway. They spend the next few days with the various residents of the town which include a teenage girl who loves to blow things up and a boy trying to keep alive his fathers dream of building a beachside resort in the middle of the desert."],
      "budget": 2000000
   },
   "movielensId": 2678,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-06-06",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["Morgan J. Freeman"],
      "runtime": 90,
      "movieId": 2678,
      "title": "Desert Blue",
      "mpaa": "R",
      "actors": [
         "Casey Affleck",
         "Kate Hudson",
         "Brendan Sexton III",
         "Christina Ricci",
         "Ethan Suplee",
         "Sara Gilbert",
         "Peter Sarsgaard",
         "John Heard",
         "Isidra Vega",
         "Rene Rivera",
         "Lee Holmes",
         "Lucinda Jenney",
         "Daniel von Bargen",
         "Michael Ironside",
         "Aunjanue Ellis",
         "Fred Schneider",
         "Liev Schreiber"
      ],
      "imdbMovieId": "0126261",
      "originalTitle": "Desert Blue",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["J3HNzMiNpbY"],
      "plotSummary": "An academic obsessed with \"roadside attractions\" and his tv-star daughter finally discover the world's largest ice cream cone, the centerpiece for an old gold-rush town struggling to stay on the map. They end up staying longer than expected because of an accident that spilled an unknown cola ingredient all over the highway. They spend the next few days with the various residents of the town which include a teenage girl who loves to blow things up and a boy trying to keep alive his fathers dream of building a beachside resort in the middle of the desert.",
      "tmdbMovieId": 41730,
      "avgRating": 2.99254,
      "releaseYear": "1999",
      "numRatings": 201,
      "posterPath": "/bHsLvpsTU5VI96YDCdJMmGz2M0o.jpg"
   }
}