{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt1736049",
      "video": false,
      "title": "A Place at the Table",
      "recommendations": [
         21843,
         36130,
         257614,
         9951,
         53296
      ],
      "backdrop_path": "/2HXHzW8QaR8ueZj8biQE0TXRrdh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48e09251416c9109b351",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48e09251416c9109b355",
               "name": "Tom Colicchio",
               "profile_path": "/qXqrw8OU8GKrF9OzOe7GkMX7IVV.jpg",
               "id": 219917,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b359",
               "name": "Mariana Chilton",
               "profile_path": null,
               "id": 1155683,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b35d",
               "name": "Ken Cook",
               "profile_path": null,
               "id": 181789,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b361",
               "name": "Barbie Izquierdo",
               "profile_path": null,
               "id": 1155684,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b365",
               "name": "James McGovern",
               "profile_path": null,
               "id": 1155685,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b369",
               "name": "Marion Nestle",
               "profile_path": null,
               "id": 1018909,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b36d",
               "name": "Raj Patel",
               "profile_path": null,
               "id": 1155686,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Herself",
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b371",
               "name": "Janet Poppendieck",
               "profile_path": null,
               "id": 1155687,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe48e09251416c9109b347",
               "name": "Kristi Jacobson",
               "profile_path": "/7vM3pi4cnULXKtbV02U2DLfBDOx.jpg",
               "id": 638550,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48e09251416c9109b34d",
               "name": "Lori Silverbush",
               "profile_path": "/rpA4olYv788AmQJHDxIgkE1PLfk.jpg",
               "id": 930628,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.76196,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 84198,
      "vote_count": 7,
      "budget": 0,
      "overview": "Using personal stories, this powerful documentary illuminates the plight of the 49 million Americans struggling with food insecurity. A single mother, a small-town policeman and a farmer are among those for whom putting food on the table is a daily battle.",
      "similar": [
         258480,
         27586,
         401898,
         244772,
         3981,
         858,
         112160,
         141,
         634,
         297762,
         376867,
         394117,
         437557,
         242224,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "A Place at the Table",
      "runtime": 84,
      "poster_path": "/jn8L1QdWWX5c0NUOLjzaSXtZrbt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "2012-03-22",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "One Nation. Underfed.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tanya Wexler"],
      "runtime": 95,
      "synopsis": null,
      "writers": ["Kim Powers"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0124555/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNzE5ODg3Ml5BMl5BanBnXkFtZTYwNDY1NTc4._V1_SY225_CR57,0,214,225_AL_.jpg",
      "actors": ["Stars: Wendy Makkena, John Benjamin Hickey, Jonathan Walker | See full cast and crew »"],
      "reviews": [
         "I enjoyed this movie, particularly John Benjamin Hickey's work. He is natural, relaxed, and did not force emotions, given the topic of the surviving partner of a gay man who had died of AIDS. It dealt with the tremendous emotional loss, the lack of social validation of his relationship (not considered a husband/widow) in a poignant way. Hickey's character's attempt at suicide is not far-fetched. At the height of the initial wave of gay men dying from AIDS, their surviving partners/ spouses were often cut-out or barred from funeral services, denied access to homes they co-owned or rented, and had joint bank accounts emptied by hateful family members of the deceased. While the bank teller character is more caricature, she lends the right humorous twist to this 'road trip/love story'. The various Texas characters are on-the-money, well-cast, and sweet. I have watched this movie a number of times and enjoyed it very much, each time.",
         "Most heterosexuals won't \"get\" this movie, because they insist that gay marriages are somehow inferior to theirs. But there is no difference, so they won't understand why the main character in this film is so devastated by loss of his husband (to AIDS) that he wants to end his own life. This film is a lovely story, nicely done, so it is tragic that it may be 30 years in the future before straight people will finally appreciate the veracity of it.",
         "OK, it's not Shakespeare. Gay man repeatedly meets lonely single woman. He is an asshole. She is a magnet for verbal abuse. His lover has died. She is 30 today and still lives at home, has been fired, and dreams of freedom from her parents--irritating Italian NY mother and father who rarely opens his mouth. His boyfriend has left strict instructions via tape to take a trip to Denton, Texas, north of Dallas (hence the title), and bury his childhood belongings which are with an aunt who was like a mother. Sentimental. Charming. Certainly quirky. Both lead performers are excellent. Some of the supporting cast members are not really actors and are less than trained and talented, which gives one a convincing feel of small Texas towns people and New Yorkers who live simple lives. I liked this movie. It is low budget and high quality, fun and frustrating, silly and serious. One character just disappears: a motel owner's hunky son who is seeking freedom from his own mother and finding himself in bed with our heroine seeking freedom of hers. He could have had more of a role at the end. The ending is a surprise and is somehow perfect. Robin Fletcher",
         "In the course of 90+ minutes, \"Finding North\" manages to never develop or execute more than 1-2 believable scenes. While you can sympathize with Travis' grief and Rhonda's frustration, the script is so poorly written and full of nonsensical situations (a male stripper performing in the middle of a bank branch lobby???) that it's impossible to take any part of the film seriously. Wendy Makkena is way too broad as Rhonda (her Brooklynese belongs in a freshman college acting class), while the talented stage actor John Benjamin Hickey (of \"Love, Valour, Compassion!\") tries his best to wring something worthwhile out of the increasingly tiresome Travis. Only Molly McClure as Aunt Bonnie (Travis' dead partner's guardian as a child) strikes a note of authenticity in her performance. Her brief appearance has more impact than the rest of the film combined.",
         "Wow! What an excellent film! It's honesty is so touching. The relationships depicted here are what we need more of in movies today! The unlikely friendship that develops between these two is absolutely beautiful! SEE THIS MOVIE!",
         "This movie owes much to the Screwball Comedy genre. A gay man retraces his newly deceased (AIDS) partner's footsteps in Denton, Texas with an unmarried, living at home at 30, kooky female bankteller who \"can't say 'No.'\" It's a sort of road movie/screwball comedy. I didn't think it was a bad movie at all, and I laughed several times. I thought the character of Travis was a bit wooden and 2-D. I'm not sure why someone who just lost his love would not even cry, but be slightly angered at their death (brooding). There should have been a little more depth in his character. The movie is sad and silly, touching and corny. Wolfe usually puts out decent movies, and this is another in their DVD stash. It's great to see another movie where AIDS plays a role in the plot, but, by 1998 (and now), the disease does not have the impact that it should in this movie, like it did in movies like \"Longtime Companion,\" \"Philadelphia,\" and \"It's My Party.\" The fact that the men are gay is almost secondary to this movie (unfortunately). I don't have a reason for why this is the case in this movie. It certainly dulls the impact of the story. I give it 7 of 10. Funny, engaging, and well-made for the most part. ------ E. SIDENOTE: Also, to be demeaning and saying that heterosexuals won't \"get\" this movie is condescending and wrong. I am not gay, and neither is my wife, and we both very much \"got\" this movie. One of the main problems with this statement by the gay/lesbian community goes back to the 70s and 80s way of thinking about movies and who they are \"made for.\" This is wrong in every case. Wexler, the director, did a fine job showing that movies with queer themes should be viewed as universal, something the \"old school thinkers\" tend to want to negate.",
         "The script could have been more deftly handled. The story was slow in developing at the beginning and the acting was not as wonderful as one might have liked. The actors are young and need time to develop their craft. In contrast, the script for \"Green Plaid Shirt\" touches one deeply. In \"Finding North\" one is not quite as fond of the characters portrayed. Hopefully a second viewing of \"Finding North\" will give a better impression of what the writer intended to convey.",
         "Good portrayal of loss and reaffirmation of life. Existential comment on having a direction - NORTH. Keeps you guessing and has a really sweet ending. The location in Denton, TX was great. Straights are not ALL homophobic. Normal is normal. This film shows a friendship which is better than normal!",
         "This film, a chronicle of road trip combining a despondent gay man who has lost his lover to AIDS with a bossy Brooklyneese woman who still lives with her overbearing parents, is calculated to bring chuckles and tears. Unfortunately, the film is riddled with improbable coincidences, hokey sentimentality, and amateurish acting and filming. One hopes to like the film, and I do commend its portrayal of a gay male in reasonably unstereotypical fashion. The blatancy of the script's contrivances, however (they \"meet cute,\" he just happens to come into her bank the day after she saw him almost leap to his death from a bridge - and she's carrying the shoe he left behind, she pursues him all the way to Texas with no encouragement or realization that he's gay, they learn \"life lessons\" after meeting his dead lover's crusty surrogate mother, etc.), just sabotaged the film for me. It made me squirm in uneasiness, and I never found myself relaxing in the hands of a filmmaker who believed in her material. Thumbs down here.",
         "This was such a hokey story and worse yet, badly acted by it's leading lady, Wendy Makkena, who just didn't take no for an answer. She truly got on my nerves with her phony accent and if you can imagine just walking into someone's home, unannounced and uninvited, and then proceeds to poke her nose into his closet and such. Follow this with her trailing after him onto a plane to Texas. She just won't give up. I'd have had the police lock her up. Sorry, to me, she was so obnoxious I just wanted to take the tape off. But John Benjamin Hickey, as Travis, one of my favorite actors [\"Love, Valour, Compassion\"] did what he could to salvage the trite dialogue. He made most of the moments believable as only a good actor can. Why it took him so long to tell the female intruder he was gay, puzzled me. She would have pushed off had he done this. But, then, I guess there wouldn't have been a film had he done so. Then there's Aunt Bonnie, excellently played by Molly McClure, who also salvaged a bad movie with her simplicity and honesty as an actress [Wendy take note]. I loved her. I loved the scenes with her and Travis. They were quiet and filled with such sensitivity. Of course, Rhonda [Makkena] had to intrude once more. She should have stuck with that beautiful hunk Ben, played with sexy appeal by Jay Michaelson [loved the accent] who was very gentle with her when she turned him down [foolish girl]. Let's see more of this good looking guy. So in summary, Kim Powers' script lacked the necessary depth needed to carry this film and director, Tanya Wexler [why are there so many female gay film directors?] did the best she could with the exception of casting Makkena in the role of Rhonda. You had the feeling she would end up just like her mother, who was a mess. Add the nice acting jobs by Hickey and McClure and the gorgeous looks of Michaelson and it's worth watching for them alone, if you can bear hearing Makkena talk."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Redeemable Features",
         "SoNo Pictures"
      ],
      "summaries": ["Screwball romance involving a woman (Makkena) who gets fired from her job as a bank teller when her friends arrange for a stripper to appear at the bank for her birthday. She then meets a man (Hickey) whom she had earlier seen jump off a bridge and had assumed had committed suicide. With nothing else to do, she follows him to Texas. Along the way she slowly comes to realize he is gay and is despondent over the AIDS-related death of his former lover."],
      "budget": 0
   },
   "movielensId": 2679,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-06-11",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Tanya Wexler"],
      "runtime": 95,
      "movieId": 2679,
      "title": "Finding North",
      "mpaa": null,
      "actors": [
         "Wendy Makkena",
         "John Benjamin Hickey",
         "Jonathan Walker",
         "Anne Bobby",
         "Rebecca Creskoff",
         "Angela Pietropinto",
         "Freddie Roman",
         "Molly McClure",
         "Jay Michaelson",
         "Yusef Bulos",
         "Garrett Moran",
         "Lynn Metrik",
         "Phyllis Cicero",
         "Spiro Malas",
         "Jesse Plemons",
         "Steven Jones"
      ],
      "imdbMovieId": "0124555",
      "originalTitle": "Finding North",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In madcap road movie Finding North, Rhonda (Wendy Makkena, Sister Act), a big-haired bankteller from Brooklyn, encounters Travis (John Benjamin Hickey, Love! Valour! Compassion!), naked, suicidal and about to jump off the Brooklyn Bridge. Mistaking him for her perfect man, she stalks him all the way to Danton, Texas. An alliance, and eventually true friendship, is formed between this extremely odd couple as they embark upon a 'treasure hunt' - with clues provided from beyond the grave...",
      "tmdbMovieId": 84198,
      "avgRating": 2.71311,
      "releaseYear": "1999",
      "numRatings": 61,
      "posterPath": "/byDBpPQ3G8Krgw3iHSLetd1JpKV.jpg"
   }
}