{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "brother",
            "id": 5301
         },
         {
            "name": "russian mafia",
            "id": 8045
         },
         {
            "name": "dysfunctional family",
            "id": 10041
         }
      ],
      "imdb_id": "tt0110365",
      "video": false,
      "title": "Little Odessa",
      "recommendations": [
         34921,
         42514,
         52726,
         64832,
         64382,
         39787,
         2036,
         26269,
         39125,
         63888,
         40509,
         36288,
         94917,
         53151,
         22828,
         31618,
         38981,
         32060,
         26268,
         32068
      ],
      "backdrop_path": "/mahTDxXAHXmA3BSi1OG3rhtMDsu.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Reuben Shapira",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129545",
               "name": "Edward Furlong",
               "profile_path": "/o7x6XcLSZSJygjYKLMcElEehmkr.jpg",
               "id": 820,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Joshua Shapira",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129549",
               "name": "Tim Roth",
               "profile_path": "/hgaIXIW9GKnZhrweplBonG7uhhP.jpg",
               "id": 3129,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Alla Shustervich",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f812954d",
               "name": "Moira Kelly",
               "profile_path": "/pQstHxjYadJBlwD0ifXFRS0xUT5.jpg",
               "id": 20005,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Irina Shapira",
               "gender": 1,
               "credit_id": "52fe4736c3a36847f8129551",
               "name": "Vanessa Redgrave",
               "profile_path": "/hGxsPCZkwa30UE0XQdGTB9yT0jz.jpg",
               "id": 13333,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Arkady Shapira",
               "gender": 2,
               "credit_id": "589d85cac3a3685f80005bff",
               "name": "Maximilian Schell",
               "profile_path": "/xhjyQpOmwDwU48Kq2b1XCEO9G7E.jpg",
               "id": 12150,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Boris Volkoff",
               "gender": 2,
               "credit_id": "52fe4736c3a36847f8129555",
               "name": "Paul Guilfoyle",
               "profile_path": "/vQRNg8D5jeUHGKeFzMuwFaAFnzZ.jpg",
               "id": 925,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Sasha",
               "gender": 2,
               "credit_id": "589d85e3c3a3685f8b005b28",
               "name": "David Vadim",
               "profile_path": "/bvwt3dtEqCmZBPfxTCuDTCPPFEk.jpg",
               "id": 37205,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "58cd4079c3a368508c00c302",
               "name": "Kevin Thompson",
               "profile_path": null,
               "id": 19755,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "589d86409251412cc3006366",
               "name": "James Gray",
               "profile_path": "/26NM43boSYspJiKeRc0gy41g9sA.jpg",
               "id": 20561,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "589d86d1c3a3685f83005cc0",
               "name": "Dorian Harris",
               "profile_path": null,
               "id": 75626,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "589d8670c3a3685f8b005b69",
               "name": "Paul Webster",
               "profile_path": "/fze6uF1oCdDYJFA5tbVhKX9nwW3.jpg",
               "id": 21378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "589d867cc3a3685f9300556b",
               "name": "Kerry Orent",
               "profile_path": null,
               "id": 38082,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "589d86899251412ccc005e04",
               "name": "Claudia Lewis",
               "profile_path": null,
               "id": 1755011,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "589d869b9251412cbe006119",
               "name": "Rolf Mittweg",
               "profile_path": null,
               "id": 69228,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "589d86b99251412cd0005e81",
               "name": "Nick Wechsler",
               "profile_path": "/1HeDC5sNgXBN09SiyoPs3VcUQsH.jpg",
               "id": 6468,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58c7b9b6c3a3683dbd00a967",
               "name": "James Gray",
               "profile_path": "/26NM43boSYspJiKeRc0gy41g9sA.jpg",
               "id": 20561,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58cd3fd89251415a8b00ca68",
               "name": "Tom Richmond",
               "profile_path": null,
               "id": 7034,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58cd3fecc3a368508c00c273",
               "name": "Dana Sano",
               "profile_path": null,
               "id": 91147,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58cd3ff59251415a3900ca7f",
               "name": "Douglas Aibel",
               "profile_path": null,
               "id": 5669,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58cd40069251415a7d00cda8",
               "name": "Michael Clancy",
               "profile_path": null,
               "id": 1471022,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "58cd40839251415a7400ce91",
               "name": "Judy Rhee",
               "profile_path": null,
               "id": 9547,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "58cd40989251415a8b00cb13",
               "name": "Charles Ford",
               "profile_path": null,
               "id": 1779034,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "58cd40a69251415a6100d492",
               "name": "Julie Oppenheimer",
               "profile_path": null,
               "id": 1209612,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 0,
               "credit_id": "58cd40b09251415a3900cb34",
               "name": "Prashant Gupta",
               "profile_path": null,
               "id": 1559464,
               "department": "Camera",
               "job": "Still Photographer"
            },
            {
               "gender": 2,
               "credit_id": "58cd40c1c3a36850e900bd50",
               "name": "Roy Farfel",
               "profile_path": "/6Zal8hlLvn1mK7yCDbUwngrFvk4.jpg",
               "id": 1372092,
               "department": "Crew",
               "job": "Stunt Coordinator"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.971348,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 47504,
      "vote_count": 43,
      "budget": 0,
      "overview": "The film follows the personal relationship between a father and his two sons, one of whom is a hit-man for the Russian mafia in Brooklyn.",
      "similar": [
         4170,
         8272,
         1587,
         9679,
         73,
         4538,
         2064,
         334541,
         164457,
         13813,
         8293,
         10731,
         10683,
         1578,
         1429,
         1892,
         873,
         1904,
         2034,
         4951
      ],
      "original_title": "Little Odessa",
      "runtime": 98,
      "poster_path": "/80zDn3oanRMWDSDX1cPKZVIi8OO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": "/78ilmDNTpdCfsakrsLqmAUkFTrO.png",
            "name": "Fine Line Features",
            "id": 8,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Live Entertainment",
            "id": 285,
            "origin_country": ""
         }
      ],
      "release_date": "1994-10-27",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "Brothers in blood. Partners in crime.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["James Gray"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["James Gray"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110365/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2MzUyNzc5OV5BMl5BanBnXkFtZTcwODc4OTUyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tim Roth, Edward Furlong, Moira Kelly | See full cast and crew »"],
      "reviews": [
         "This is without a doubt the best debut by a filmmaker in the last decade. James Gray has directed with a sure hand, exerting amazing control over a wide variety of performers and flawlessly maintaining a haunting and menacing mood in his tale of crime and punishment among Russian immigrants in Brooklyn. Vanessa Redgrave is superb, as usual, and Maxmillian Schell has been kept from the unrestrained emotionalism to which he is prone (see JUDGMENT AT NUREMBERG), so that he gives one of his very best performances in years. As for Edward Furlong and Tim Roth, both of whom can be very good or very bad, lets just say they haven't been this good before or since. Gray's command over such aspects of the film as pacing and visual style is impressive. The whole thing builds to a stunning climax.",
         "I saw this movie at a quite low age, I consider it one of the films that evoked my passion for this art form. This film is very bare, very raw yet somehow harmonious, as well. The violence is very well depicted, in a very cold & frightful way. This is a film without any greater hope, without any greater optimism of our future. A rapid & haunting way of showing the true face and consequences of brutal violence. Intensively and artistically this film displays a chaotic & desperate family, a destiny very honest and very haunting. Cinematography is stunning, as is the environment, which very well defines the fundamental characteristics of this film, cold, naked, intense & raw. Great debut by the very promising James Gray.",
         "A stunning debut by this young writer-director -- Dostoyevskian themes, an exact sense of place, and a lyricism touched by few of his peers. And now six years' wait! While most U.S. indie filmmakers spent the 1990s studiously copying Tarantino, Gray in this overlooked gem created something entirely different: a character study of tragedy among the unhip and uncool. Torn by illness and the return of a prodigal son, a Russian immigrant family in New York tries to outlast the omens promising its destruction. The film owes something to Coppola, but you might feel the presence of Bergman, too. Unsentimental, unsparing, with brilliant performances by the principal cast. A must see.",
         "Writer/director James Gray's (We Own the Night) first film was critically acclaimed for it's cinematography and for performances by Vanessa Redgrave and Maximilian Schell. It is not an action film, even though the main character is a hit-man. It is a drama about family and shame. Mr. Orange, Tim Roth (Reservoir Dogs, Pulp Fiction, The Incredible Hulk) plays a son who has been disowned for bringing shame on the family by his behavior. He returns to Brighton Beach to do a job, and reunites with his family as his mother lays dying. He also reunited with Moira Kelly, much to the delight of movie viewers. About the only one happy to see him was his younger brother Rueban, played by Edward Furlong (Terminator 2: Judgment Day, Pecker). Well, mom was happy, but moms are always happy no matter how bad their children are - trust me on that. Violence was at a minimum for a Russian Mafia/hit-man picture, and the focus was on the family. Maximilian Schell was excellent as the father that made piece just for a moment to allow Redgrave to see her son. Gray's first film has nuance and subtlety not often seen in a film featuring the mafia.",
         "I'm a long time fan of Tim Roth, who doesn't do nearly as much as I'd like him to, these days. The other British stalwart in this, the equally excellent Vanessa Redgrave was another point of interest for me. There's a real brutal efficiency to this film that makes it unlikeable but also demands respect and our attention. Roth is the roving assassin who is forced to do his next job in his old neighbourhood and that means getting reacquainted with his family: dying Mum (Redgrave), hateful and abusive Father (Maximilian Spiel), as well as impressionable younger brother (Edward Furlong). 24 year old débutant director James Gray comes up with - and scripts - a surprisingly mature piece of crime cinema that is both poignant, moving and shocking. To my mind, the violence should rate the film at 18, not 15; the cold- blooded unfeeling of Roth's callous and unflinching \"jobs\" don't even give us time for any bad taste to form in our mouths. I can see that some would find this a barrier to their enjoyment in what is mostly a character- driven drama of some depth. The winter-set scenes of back street Brooklyn are chillingly authentic and bleak and these help remind us of the family's Russian roots. The father, a devout Jew, who's also having an affair often speaks Russian still, hanging to his identity the best he can, in an alienating, changing and disintegrating world. There are also some tender moments between assassin son and brain-tumour suffering mother, and of him lovemaking with his girlfriend, who wants to try to understand him and his motives. His younger brother tries to keep his own feet on the ground, whilst his sibling gradually but surely steals his innocence. Yes, it is sad - and savage but strangely rewarding, too.",
         "I enjoyed the movie. Tim Roth, who is apparently British, sounded to me (a Texan) as a perfect second-generation Russian Jew. He was so coldly efficient in this character that I did not even recognize him as the hapless robber in Pulp Fiction. Kudos also to Moira Kelly, Edward Furlong, and Maximilian Schell. Good direction and photography. The use of the Russian choral music throughout set the mood on medium-creepy, even when that was the only clue. I've never been to Brighton Beach, or even Brooklyn, but the film really brought home the gritty reality of that immigrant community. (I really just mean the day-to-day atmosphere of the place, not the mobster story plastered on it.) Worth checking out if you don't mind a slower, more cerebral sort of hit man movie.",
         "this film totally transcends its derivative storyline and machismo-charged genre. avoiding predictable characterisation (which some of the previous commentators seem to desire)and melodrama, the film may seem (and is at least visually) cold, but its warmth is built through nuance, not cliche. Great soundtrack too, with Arvo Part.",
         "Little Odessa, also release under the title \"Contract killer\" is a very effectively and realistically told mobster movie, from the Russian community. It's a take on the prodigal son, here as a cold contract killer. A great watch for connoisseurs of films, and mobster film in particular. The movie stands out for great acting, directing and photography, being James Gray directorial debut. Music is excellent as well. The actors are making this a great watch. The whole film is stuffed with fabulous acting. Tim Roth and Edward Furlong is both fabulous as the brothers, as Vanessa Redgrave and Maximillian Schell is as the mother and the abusive father. I think this is some of the best I've seen from them all. The film starts up with the contract killer, being the older brother Joshua Shapira coming back to his hometown of Brooklyn after being away for years, to do a contract job. He fled town after committing a killing, which obviously is not forgotten. He meets his younger brother, Reuben, which tells him that their mother is terminally ill with brain tumor. Joshua wants to see the mother, but are not welcomed by the father, being a danger to the whole family since wanted by the mobsters. It's bleak, cold, gritty, effective and what I believe very realistic told. I was immediately sucked into the story, which is following the younger brother more than the older hit-man. it's no action movie, but a mobster movie told in the way we've seen many times. This does not stand back from these. The film builds slowly up to great scenes. It's powerful on emotions, far more than on the action. However the persons are quite cold, and so is the violence. And there isn't much hope to see in the dreary days of this family. The quote \"We'll wait 10 seconds and see if God saves you\" is said by Tim Roth's character before he does a killing. I would regard this is a must-see for mob film lovers, and a classic in the genre. I would likewise recommend the brilliant and effective \"Eastern promises\" by David Cronenberg, telling a story from the Russian mafia in Great Britain.",
         "James Gray's \"Little Odessa\" stars Tim Roth as Joshua Shapira, a hot-headed hit man working for the Russian mafia in Brooklyn. The film takes the format of a \"prodigal son returns\" narrative, the exiled Roth returning home to find that he is still unwanted by his family. They all abhor him, with the exception of little Reuben Shapira (Edward Furlong), who idolises his older brother. The film ends, as most \"prodigal son\" tales do, with Reuben dying, paying for his brother's sins. \"Little Odessa\" was Gray's debut. It's a very good crime-film, well acted by the always electric Tim Roth, but the film's ethnic details are at times unconvincing and Gray falters in his final act with an obvious, overblown set piece in which little Reuben is accidentally gunned down. Gray followed \"Odessa\" up with \"The Yards\", a crime drama set in the commuter rail yards of New York City. The film's structure is similar to \"Odessa\", and sees Mark Wahlberg playing an ex-convict who returns home after a short stint in prison. Wahlberg attempts to stay clean, to keep his nose out of crime, but is drawn back into the criminal underworld by a friend played by Joaquin Phoenix. The film retains the \"brotherhood dynamics\" of \"Odessa\", Wahlberg playing the \"good son\" (they're not related) who eventually turns on his suffocating sibling. Once again the film ends with a ridiculously over-the-top death scene. While \"The Yards\" has a certain, smothering pretentiousness about it, convinced about its own importance (it's lit like Rembrandt, street fights are filmed like Visconti's \"Rocco and His Brothers\" and it's reaching for the tone of Coppola's \"The Godfather\"), Gray nevertheless cooks up some wonderful strokes, like a beautifully sensitive welcome-home party, a wordless assassination attempt and a fine, aching performance by Wahlberg. It's a great mixed bag. Gray then directed \"We Own The Night\", arguably his best crime picture. The \"good brother/bad brother\" motif returns, this time with Mark Wahlberg and Joaquin Phoenix playing a pair of brothers on either side of the law. Phoenix's a perpetually high playboy who owns a nightclub frequented by drug-runners and mafia types, and Wahlberg's a straight-arrow cop trying to keep the streets clean. When the mafia unleashes an assassination campaign on local cops, Phoenix switches allegiances, goes undercover and attempts to take down the mob. There are touches of \"Donnie Brasco\", \"Rush\", \"Point Break\", \"Serpico\", \"State of Grace\", \"Infernal Affairs\" and every other \"undercover cop\" movie you can think of, but the film is beautifully lit, is atypically straight-faced and features a superb, rain-soaked car chase. Some have suggested that Gray's trilogy should be celebrated for working in a \"classical\", almost conventionally Greek mould. That his conventionality suggests that all his characters are at the mercy of already in place contours, their fates forgone. This may be true, but the larger issue here is that Gray's crime trilogy highlights the way in which contemporary artists struggle to conceive of a response to post-modernism. The crime movies of, say, Tarantino and Scorsese, are unashamedly post-modern, toying with and regurgitating clichés from 1930s Warner machine gun operas and MGM crime flicks. They aren't about \"crime\", so much as they're pastiche jobs, jazzed up films about crime films. As a response to this aesthetic, artists who deem themselves \"serious\", who rightfully ask \"what exactly comes after post-modernism?\", tend to look backwards at what came before, as though modernism, by virtue of being modernism, is intrinsically \"the solution\". This leads to classically shot and written but wholly regressive fare like Gray's trilogy, which essentially unscrambles the world's Scorseses and Tarantinos and puts you right back in the 1930s. But you can't go backwards in this way; the audience will always be ten steps ahead of you and there will always be a huge chasm between your solemnity and the tired insights your film delivers. This is why true progressive works in the genre, fare like \"The Wire\", which actively attempts a cognitive mapping of both the world and crime, are neither modernist or postmodern, whilst possessing the vital traits of both. Philosophers have alternatively coined this new movement \"neoprimitivism\", \"pseudomodernism\", \"participatism\", \"post-post modernism\", but the one that seems to be sticking is \"new modernism\". So on one hand \"The Wire\" is modernist in the sense that it rejects post-modern nihilism (nothing matters, there is no \"truth\", it's just a film) and posits a world in which it is possible and necessary for individuals to make value judgements, take stands, approach objectivity, and back facts up. It is modernist in its desires to \"understand\", \"teach\", \"decipher\" and \"make better\" the world, in its emphasis on culture, society, technology and politics, and in the way it actively co-opts postmodern tropes, bending them to suit its aims. On the other hand, the series is resolutely post-modern in that it is a \"television series\", has multiple authors, questions agency and has a tendency toward a certain fragmentation. But though it moves away from the dictatorship of the cinema screen, \"The Wire's\" television format allows for a scope that may be said to be authoritative precisely because it offers a consideration and weighing of \"subjectivities\" and multiple perspectives. In a way, if TV comes after film, \"The Wire\" comes before the internet. The internet, a medium that is slowly supplanting film's reign, is of course the ultimate postmodern device. It's a shared simulacrum - tactile and interactive - but is notable in the way it simultaneously creates a postmodern environment of junk, noise and static whilst fostering a new type of modernist artist akin to a decoder. As William Gibson said way back in the 80s, future great artist will function like search engines, mapping and making sense of the detritus. \"The Wire\" maps, Gray goes backwards to when there was less noise. 8/10 - Worth one viewing.",
         "The settings are located to some Russian hole in Brooklyn. The snow is falling and people are poor. We meet a family that seems quite normal - and the lost son comes home... He is a killer with some bad folk after him. It´s one more hit before good-bye. The lost son meets up with the youngest brother in the family. The mother is sick. Father is cheating her with another. And so the trouble begins with the father and son. Family problems, crime syndicate, a fast running past... The acting is great a la Truffant (loss of feelings) and the tension is well conveyed in the stark camera work and cold violence that culminates with great effect in the ending. This is not a truly original film, but it doesn´t (like so many others) fall into some melodrama...so it is good. Well, rent it alone and think about your family."
      ],
      "genres": [
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Fine Line Features",
         "Live Entertainment",
         "New Line Cinema"
      ],
      "summaries": ["This film tells a bitter tale of a dysfunctional family. Joshua, a cold-blooded professional killer, returns to his Brighton Beach boyhood home for a \"job.\" He knows it will be difficult to return to the Russian-immigrant community of his youth--in his eyes, we see anticipation of the inevitable emotional pain and psychic turmoil that seeing his forsaken family and estranged companions will bring him. To do his job, and try to maintain some semblence of sanity, he has had to wall off his humanity from even himself. Seeing his kid brother, who adores him, talking with his dying mother, who still loves him, and yes, arguing with his abusive father, begins to wreak havoc with his personal defenses. As his steely demeanor begins to dissolve, we are shown the soul of a hit-man crumbling away, piece by piece. Finally, all that he now allows himself to admit that he loves is agonizingly torn away from him and he is left with the ultimate punishment for his transgressions."],
      "budget": 2300000
   },
   "movielensId": 268,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-10-27",
      "dvdReleaseDate": "2002-08-27",
      "directors": ["James Gray"],
      "runtime": 98,
      "movieId": 268,
      "title": "Little Odessa",
      "mpaa": "",
      "actors": [
         "Edward Furlong",
         "Tim Roth",
         "Moira Kelly",
         "Vanessa Redgrave",
         "Maximilian Schell",
         "Paul Guilfoyle",
         "David Vadim"
      ],
      "imdbMovieId": "0110365",
      "originalTitle": "Little Odessa",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["LkGY1-IvSmU"],
      "plotSummary": "The film follows the personal relationship between a father and his two sons, one of whom is a hit-man for the Russian mafia in Brooklyn.",
      "tmdbMovieId": 47504,
      "avgRating": 3.30489,
      "releaseYear": "1994",
      "numRatings": 756,
      "posterPath": "/80zDn3oanRMWDSDX1cPKZVIi8OO.jpg"
   }
}