{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0139216",
      "video": false,
      "title": "Floating",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Van",
               "gender": 2,
               "credit_id": "52fe49dcc3a36847f81aa5cd",
               "name": "Norman Reedus",
               "profile_path": "/dtnLzCWTVOE57ELwDwp4hmIXxrW.jpg",
               "id": 4886,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Doug",
               "gender": 2,
               "credit_id": "52fe49dcc3a36847f81aa5d1",
               "name": "Chad Lowe",
               "profile_path": "/mvx2M5w5hycqrI6ITcMBPJLCQoL.jpg",
               "id": 21549,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Van's Father",
               "gender": 2,
               "credit_id": "52fe49dcc3a36847f81aa5d5",
               "name": "Will Lyman",
               "profile_path": "/xYU1FSeQhXLyg6VskqRBofFyoU8.jpg",
               "id": 163671,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Julie (as Sybil Temchen)",
               "gender": 0,
               "credit_id": "52fe49dcc3a36847f81aa5d9",
               "name": "Sybil Temchen",
               "profile_path": null,
               "id": 62384,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Prep #1",
               "gender": 2,
               "credit_id": "57690eb5c3a368094a000031",
               "name": "Casey Affleck",
               "profile_path": "/kPNMpiZHsAzeQar4DiNsrekwHBU.jpg",
               "id": 1893,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe49dcc3a36847f81aa5c9",
               "name": "William Roth",
               "profile_path": null,
               "id": 1085268,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5a89d1569251417593069f24",
               "name": "Michael E. Phillips",
               "profile_path": null,
               "id": 566691,
               "department": "Crew",
               "job": "Post-Production Manager"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.440844,
      "production_countries": [],
      "id": 100568,
      "vote_count": 4,
      "budget": 0,
      "overview": "Floating is the story of a young man's struggle to come of age during a violent period of emotional and financial bankruptcy. The film stars Norman Reedus as Van, a son shouldering the responsibility of his embittered father, with no one to nurture him through his own pain. Van's father is so engrossed in his own troubles that he fails to emotionally support his son. As Doug, Chad Lowe provides Van with friendship, but more importantly, with the knowledge that a \"perfect life\" isn't always what it seems. After Van and Doug engage in a crime spree that ends in tragedy, father and son finally come together for the first time to transcend mourning.",
      "similar": [],
      "original_title": "Floating",
      "runtime": 90,
      "poster_path": "/yY2aX3m4gRwUyg5DAmpONJLh0bQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-10-08",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "One tragedy destroyed his life. Another one saved it.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["William Roth"],
      "runtime": 90,
      "synopsis": null,
      "writers": ["William Roth"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0139216/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjk3OTUyNDYxM15BMl5BanBnXkFtZTcwODc2NjEyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Norman Reedus, Chad Lowe, Will Lyman | See full cast and crew »"],
      "reviews": [
         "I liked most of this film and loved parts of it. Enough to forgive its weaknesses. The Troubled Youth (Van) is depicted as a leader of his peer group in the small lake community and I felt it was a very positive thing to have him befriend the gay guy. At first, we were not sure of his intentions. Is Van bisexual? We see him with his girl friend. The scene where Van sleeps over at Gay Doug's house is particularly ripe with suspense and sexual tension. I was on the edge of my seat. Later when Doug is totally embarrassed over Van finding his porn and laughing at it I thought the movie excelled in Van's sensitive treatment and acceptance of the gay character. Van is tough, Van is cool, Van probably cares about his image. To depict him caring A LOT about Doug, really as the centerpiece and emotional climax of the film, is a breakthrough in gay-friendly cinema. My hat's off to you. Keep it up.",
         "One of the more realistic \"coming-of-age\" films I've seen. A well-acted film in which sympathetic and complex characters drive the story. There's nothing fancy here in way of cinematography, but anyone who enjoys films that handles heavy emotional issues in a nuanced, unforced way will find this film worthwhile. There's a very interesting \"trick\" that the film plays on you that makes you rethink the main character's perspective on the events at the very end of the film.",
         "This was an excellent movie. There was some bad acting but it certainly did not come from Norman Reedus who I hope to see more from soon! This is a movie that makes you long for those great summers when you had nothing to do but be young.",
         "I'm still trying to figure out what 'Floating' is about, other than a homoerotic tale of misfit children and their dysfunctional families that live \"down by the river.\" Guys running around, swimming \u0096 sometimes naked, almost always half-naked \u0096 wrestling, sweating, male bonding, etc, etc. Other than having a higher budget than an A&F ad it is, there really wasn't much left. We have kids yearning to get out of town (not original,) broken homes (not original,) and aimless pot-smoking partiers bend on destruction and theft of other people's properties (not original.) The main actor, Reedus, appears to do what he can with the source material while his BFF Lowe completely over acts in his (also unoriginal) role. It didn't have bad production (aside from horrible lighting at times,) especially for a low budget indie and it was great to finally see a gay-themed film that two guys can be best friends when only one is gay and the other is not only straight, but stays that way. Far too often, per the writer's fantasies, I suppose, the straight man will get seduced and succumbs to the gay man, all of a sudden gay by association. So, I liked that about this film, but in the end, nothing new jumped out at me, except for beautiful shots of the lake and some eye candy. The movie's thin plot revolves mostly around kids getting high, hating their parents and robbing neighbors. Newcomer to town, Lowe, is befriended by the leader of the pack, Van, who sees him as not only a ticket out, but a chance for redemption. Aside from the huge problem with the closing tragedy, these kids leave evidence everywhere of their thefts, not to mention this is a small town and they pick really close neighbors. Seriously?",
         "This movie starts off very slow. After watching a couple minutes, I thought to myself, if this movie doesn't get super exciting soon, I'm going to turn it off. However, I found myself getting into it. It's not a super thrilling or exciting movie. It's simple. It's just about a young man and how he's dealing with life. He's had some bad things happen to him and this movie just shows you how he's trying to deal with it. It's a simple drama. It starts off boring but, by the end you feel like you've watched something real. People dealing with real problems in mostly real ways. It's very easy to relate to the characters, especially Van (Norman Reedus) and Doug (Chad Lowe). It won't be the best movie you've ever seen but, it's definitely worth watching at least once. Definitely a must watch if you're a Norman Reedus fan.",
         "This is a coming of age drama centering around Van (Norman Reedus), a teen taking time off between high school and college. He is floundering between his old would-be hoodlum buddies who do B@E's in the local neighborhood and college friends who along with his soon-to-be ex-girlfriend are leaving him behind. His alienation from both crowds is reinforced by the recent death of his mother and the need to care for his handicapped double amputee, alcoholic, domineering father who caustically discourages Van from any pathway out of his dilemma. Van finds out that his buddies have been stashing their break in loot and weed in the cellar of Van's mother's up for sale house. When unexpectedly, a family moves into the house, the gang ponders what to do, but soon enough they all meet Doug (Chad Low), the teenage son who they befriend and bond after smoking some dope. It should be mentioned that the gang excluding Doug comes off like a slightly evil stupid version of the happy days crowd. When they try to grab their loot from Doug's cellar, he catches them \u0096 but it's all cool. Van a swimmer in high school learns that Doug swims for \"State\" (college) and his Dad is the coach of the team. As you might expect, Doug and his father encourage Van to pursue his education and swimming. Doug's father comes off as a hard ass coach who snipes away at his masculinity, with all sorts of meaningful looks around the table, particularly after Van wins an arm wrestle with the father who says: \"there's finally someone who's man enough to beat him\". At a sleepover Van sleeps Doug's bed, while Doug sleeps on the couch. Van finds a gay magazine that slips out from under the Doug's mattress, (do boys still hide stuff there????) when Doug is in the room. Even though Van, who as far as we know is straight, say's \"it's cool\", Doug freaks out, saying \"Get the f#*k out of here\u0085.\" etc. Up to this point the film is engrossing. It then becomes rushed and somewhat contrived. The ending, not a happy one, is real enough but suffers from the sense (my guess) that scenes that would have made it all fit together, were cut.",
         "I enjoyed this quiet film. It'll reward you if you pay attention. The dark twists of the surprising script when compared to mainstream college stories like American Pie II makes me glad these film makers had the passion and dedication to bring their melancholy story of two swimmers to the screen. They did kill off the gay guy so the straight guy could grow. But do gay characters always have to die in a politically correct way? Gay teen suicide is still common in small towns so it's not unrealistic to have the gay guy die, and gays are still fodder for the growth of plenty of straight folks. A make out scene with the two swimmers would have made this a cooler film (and more commercial with gay audiences). The characters were almost there when they wrestled, straight guys make out all the time, why not give the audience some merging man flesh? This is a film about an ordinary summer. With neither violence of Basketball Diaries, nor the over the top gross out of American Pie to titillate audiences these cinema artists offered instead a calm lake, a beautiful male body and two characters struggling to break free of their fathers. Making a subtle understated film like this is risky, thankless work in Hollywood. We should be grateful for their efforts.",
         "I only found out about this film after watching The Walking Dead and deciding I had to see more of Norman Reedus' films. I discovered that this was one of his first acting credits, so I figured it would be a good one to watch. And I was right! The film is slow moving , so it might not appeal to everyone, but what it lacks in action it more than makes up for with drama and family dynamics. The acting was top notch from everyone- I personally thought the two best turns came from Norman Reedus and Will Lyman as son and father respectively. Chad Lowe didn't do a bad job either. The characters were believable and had their own flaws, making every character sympathetic but not above criticism for their actions. Also, the location was beautiful and provided a serene, constant backdrop for the emotional turmoil that forms the basis of the plot. The film is not without its faults though- I think it would have benefited from being a bit longer in order to examine the consequences of the events of the final act. However, for me the rest of the film was of such a high standard that I can forgive it for this, hence the 10 star rating. It isn't a bad ending- far from it in fact (I teared up!)- I just think it would have benefited from showing a bit more of Van's story. I would definitely recommend this film- it is difficult to find on DVD for a decent price, which is a shame because it deserves more recognition. However it is easy to watch over the internet, and it is really worth the watch.",
         "The movie was a creative plot. However, the plot could have been developed more with the two main characters sharing about their reactions to their fathers and Chad Lowe's character's being gay. The strength of the movie was that it was innovative. Wish I could rewrite it and remake it. I would encourage anyone with an eclectic, esoteric and creative mind to see it. It's a must see!! I rated it 10!!!",
         "\"Floating\" starts off with some promise, showing glimpses into the life of Van, an angry young man sliding into slacker-hood while his once-friends go off to university. Van slowly becomes friends with a new kid, a college swimming champ who has at one level has the life that Van wants, but who in turns seems to want the life that Van has. Unfortunately, the director takes the easy way out at the end, coming up with a predigested and unsatisfyingly pat ending. Gay viewers should be warned that the director suddenly and inexplicably kills off the one gay character just so Van can learn a lesson -- making yet another in the too-long series of dead gay movie characters."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Arclight Partners"],
      "summaries": ["Floating is the story of a young man's struggle to come of age during a violent period of emotional and financial bankruptcy. The film stars Norman Reedus as Van, a son shouldering the responsibility of his embittered father, with no one to nurture him through his own pain. Van's father is so engrossed in his own troubles that he fails to emotionally support his son. As Doug, Chad Lowe provides Van with friendship, but more importantly, with the knowledge that a \"perfect life\" isn't always what it seems. After Van and Doug engage in a crime spree that ends in tragedy, father and son finally come together for the first time to transcend mourning."],
      "budget": 0
   },
   "movielensId": 2680,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-10-08",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["William Roth"],
      "runtime": 90,
      "movieId": 2680,
      "title": "Floating",
      "mpaa": "",
      "actors": [
         "Norman Reedus",
         "Chad Lowe",
         "Will Lyman",
         "Sybil Temchen",
         "Casey Affleck"
      ],
      "imdbMovieId": "0139216",
      "originalTitle": "Floating",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Floating is the story of a young man's struggle to come of age during a violent period of emotional and financial bankruptcy. The film stars Norman Reedus as Van, a son shouldering the responsibility of his embittered father, with no one to nurture him through his own pain. Van's father is so engrossed in his own troubles that he fails to emotionally support his son. As Doug, Chad Lowe provides Van with friendship, but more importantly, with the knowledge that a \"perfect life\" isn't always what it seems. After Van and Doug engage in a crime spree that ends in tragedy, father and son finally come together for the first time to transcend mourning.",
      "tmdbMovieId": 100568,
      "avgRating": 2.94595,
      "releaseYear": "1999",
      "numRatings": 37,
      "posterPath": "/yY2aX3m4gRwUyg5DAmpONJLh0bQ.jpg"
   }
}