{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "dream",
            "id": 1566
         },
         {
            "name": "gathering",
            "id": 4432
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "space opera",
            "id": 161176
         }
      ],
      "imdb_id": "tt0141105",
      "video": false,
      "title": "Free Enterprise",
      "recommendations": [
         26477,
         49332,
         90360,
         187790,
         22672,
         44591,
         140873,
         15768,
         31280,
         31258,
         19324,
         33782,
         25111,
         44470,
         74836,
         36530,
         47364,
         31114,
         16387,
         9771
      ],
      "backdrop_path": "/azCH1to3VpVM7jYe0s27ZpiNgfk.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Mark",
               "gender": 2,
               "credit_id": "52fe45779251416c750577b3",
               "name": "Eric McCormack",
               "profile_path": "/9M2KmcpValdAa1NAxMQzCpBXCDN.jpg",
               "id": 29298,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe45779251416c750577c3",
               "name": "William Shatner",
               "profile_path": "/4byp8PsbRkC3UQVuvMAh4bcj7E2.jpg",
               "id": 1748,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Mort Berg",
               "gender": 0,
               "credit_id": "52fe45779251416c750577b7",
               "name": "Carl Bressler",
               "profile_path": null,
               "id": 56166,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Young Mark",
               "gender": 2,
               "credit_id": "57678bb6c3a3683cb90004d4",
               "name": "Ethan Glazer",
               "profile_path": null,
               "id": 179646,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Ticket Taker",
               "gender": 0,
               "credit_id": "52fe45779251416c750577bf",
               "name": "Phyllis Franklin",
               "profile_path": null,
               "id": 45395,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "57680c9ec3a3686d6200069b",
               "name": "Robert Meyer Burnett",
               "profile_path": null,
               "id": 262055,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "57680cee92514109310004c7",
               "name": "Mark A. Altman",
               "profile_path": null,
               "id": 62578,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.632239,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 13533,
      "vote_count": 14,
      "budget": 0,
      "overview": "Young filmmakers trying to hawk a movie titled \"Bradykillers\" about a serial killer who goes after victims Marcia, Jan, and Cindy meet their screen idol, William Shatner. The two young men, who idolize him and in their fantasies have seen him as a shadowy fairy godfather figure, are alarmed at the reality of the middle-aged non-Captain Kirk man that they meet.",
      "similar": [
         3134,
         1894,
         298312,
         8810,
         281,
         948,
         1903,
         68,
         4638,
         2142,
         1891,
         1586,
         1892,
         4771,
         431,
         10285,
         23483,
         81188,
         11,
         18
      ],
      "original_title": "Free Enterprise",
      "runtime": 113,
      "poster_path": "/3GCMZDhvtrUcUK3FaZS3aEkyj8j.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Triad Studios",
            "id": 78324,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mindfire Entertainment",
            "id": 8068,
            "origin_country": ""
         }
      ],
      "release_date": "1998-06-04",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Love long and party",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Robert Meyer Burnett"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Mark A. Altman",
         "Robert Meyer Burnett"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0141105/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAyMjg4NDk4OF5BMl5BanBnXkFtZTcwMDQ5MzIzMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Rafer Weigel, Eric McCormack, William Shatner | See full cast and crew »"],
      "reviews": [
         "\"Free Enterprise\" is so giddily goofy in its charm and appeal that you just can't help but love it. The plotline concerns the trials and tribulations of two friends, bonded together by science fiction and \"Star Trek\" inparticular, having a chance meeting with their idol; William Shatner. This chance meeting develops into a business relationship for one and a friendship for the other. Eric McCormack (TV's Will and Grace) stars as Mark, the slightly older and far and away more mature of the two friends. He will be 30 in a couple days and is having panicked \"Logan's Run\" flashbacks in his head as he wonders what his life had been worth so far. Mr. McCormack plays this role so well, the \"I'm better than you\" attitude just drips off the screen. Rafer Weigel is Robert, the other half of this friendship tandem. He is more \"damn the torpedoes\" and lives life by a thread. Losing girlfriend after girlfriend because a rare collectible action figure is more important than rent or utilities, his character is constantly falling in and out of love. Nice role here as well, played with almost maddening indifference. You get the impression that's the way this guy is in reality as well. All that means of course, is that he really sold the part. William Shatner is himself, clearly poking holes in his \"Star Trek\" facade. Shatner reveals \"himself\" to be a heavy drinking, porn reading but sincere guy. He plans to do a musical production of \"Julius Caesar\" with himself playing all the parts. The ending sequence concerns this,and has to be seen to be truly appreciated. Several faces from the past dot the background, Deborah Van Valkenburg (\"The Warriors\", \"Too Close For Comfort\"), Ellie Cornell (\"Halloween 4\" & 5). Nice to see Ellie is still acting. I liked her \"Halloween\" performances. \"Free Enterprise\" shows that indie films have a life beyond \"My Life As a Bar of Soap\". That indie filmmakers have a wonderful sense of humor and direction, and that they can churn out \"mass-pleasing\" films. 4 out of 5",
         "I really enjoyed this film. Even though I had never heard of any of the lead actors, except of course for William Shatner, I thought they did an incredible job of portraying their characters. Intellectual, devoted, neurotic, and erotic are just a few of the qualities they were asked to convey. And William Shatner is a revelation revealing that his hopes, dreams, and fears are closer to those of his committed fans than they could ever have imagined. Since I have seen most of the Star Trek episodes and movies and the other films alluded to by the characters, I was able to appreciate all the wonderful in-jokes. I highly recommend this hilarious film even if you are not a Star Trek fan, 9/10.",
         "I had a different idea of what this movie was about when I chose to watch this. I thought it would parody \"Star Trek\", sci-fi, and William Shatner. While it covered a vast amount of science fiction trivia, I think this is the kind of movie anybody could enjoy. In watching this, I can see my friends and I being like this as we hit our 30+ marks in a few years, and hey, it looks like the best is yet to come. It goes to show that \"fan boys\" have real life problems and responsibilities just the same as anyone else. Of course, there are a few more, er, \"dedicated\" to the cause than others.... William Shatner was a lot of fun in this movie, and he deserves to get credit for this film. He lives up to all of the \"Shatner stereotypes\" in being larger than life, but he also lets go and enjoys the ride. I cheered Shatner just for being Shatner, and his \"Julius Caesar\" rap is as funny as can be without breaking the tone of the film and entering the \"camp\" zone. This is a movie that is more fun for those who get the majority of the film references, but it doesn't require it. I'd like to see what else these guys will put out. For a first film, it's excellent.",
         "I stumbled across this movie on TV today and was really blown away. Who would have thought of a romantic comedy about two Trekkies(or Trekkers, not sure what the term is these days)? The movie appears to be at least somewhat autobiographical, and the story rings true. Shatner comes through with the performance of a lifetime. His portrayal of himself is vulnerable and believable. His obsession with creating musical version of William Shakespeare's \"Julius Caeser\" is hilarious and it's really funny to see Shatner poking fun at himself. All in all, this movie is surprisingly good and although really aimed at sci-fi fans, it is accessible to anyone. I highly recommend this lighthearted film.",
         "This movie spoke to me like no movie has since CLERKS or CHASING AMY. Filled with outright humorous usage of, reference to, and plenty of in-jokes surrounding the entire STAR TREK, STAR WARS, comicbook sub-culture, FREE ENTERPRISE also crafts a well-made movie of love, friendship and dreams coming true. FREE ENTERPRISE is probably not for the chick who'd rather see the latest Julia Roberts romance flick, but absolutely targets the Generation X crowd that is hitting that magical age of 30. FREE ENTERPRISE establishes the fact, and goes on to prove it in case there is any remaining doubt, that there is no one cooler in SF than Captain Kirk. Mark Altman and Robert Burnett, who obviously filled the script with personal experiences, go on to prove that even s/f comicbook movie geeks still have love in the hearts and, with sufficient help from assorted alcoholic beverages and the spiritual guidance of Captain Kirk himself, have the power to change the galaxy... or at least their own personal world.",
         "Robert Meyer Burnett's `Free Enterprise' is several movies all at once-unfortunately only one of them is interesting. Film #1: The original and witty masterpiece. Two aspiring yet unsuccessful filmmakers run into William Shatner in a Hollywood bookstore. The two pop culture-obsesses slackers have both been Star Trek fanatics since birth and are appropriately awestruck by the realization of their dreams. They soon find out, however, that the real William Shatner is a pathetic, wacked-out loser who befriends the pair only because he thinks they can help him get backing for his latest film project, a 5-hour musical version of William Shakespeare's `Julius Caesar' in which he will play every role. And, in a very clever plot twist, it is not Captain Kirk who helps the two Trekkie nerds get their lives together, but the other way around. Everyone eventually finds love and fulfillment, and it all ends with William Shatner performing a kickass rap version of Marc Anthony's soliloquy. Film #2: The painful movie. A tedious rip-off of `Swingers' in which two single guys and their friends experience the joys and anguish of dating, mating, growing up, and trying to hang onto their youth, yadda, yadda. ZZZZZZzzzzz. The twist is that in this version the hip CocktailVegasMoneyBabyHoneyDaddy culture has been replaced with the PopCultureComicBookMovieNerdStarWarsStarTrek fanboy culture. In fact, if not for this trading of Sinatra for Captain Kirk, the film would border on plagiarism. Film #3: The Fantasy. In which guys who hang out in comic book stores also date myriad gorgeous Hollywood actress-models. Unfortunately for those sucked in by the copy on the video and DVD packaging, the `Film #1' part of `Free Enterprise' only takes up about 10 or 12 total minutes of screen time. Apparently, the people who marketed this film on video and dvd were the only ones involved in this project smart enough to know that the Shatner subplot, `film #1,' was the move that `Free Enterprise' really should be. Obviously the majority of the film's storylines and amusing incidentals should have been relegated to subplots in support of `film #1'-ie, the relationship between the Nrrrds and William Shatner. An hour of Shatner, and maybe twenty minutes with the boys and their love problems, and we would have had a potentially fantastic movie. And I don't want to sound like everything non-Shatner in the film is bad-it's not. It is amusing in spurts, and much better acted than most ultra-low budget flicks. Some of the dialogue is witty, with lots of funny pop culture references for thirty-sumpthin's. There is much goodness for those with a quick remote control finger. But I also have to say that a lot of the dialogue-and I mean a LOT-is dull, repetitious, and amateurishly unnecessary (I mean, really-after the scene in which the boys meet the real William Shatner only to find out he's a pathetic wacko, do we really need to hear this kind of dialogue in the following scene: `Hey, I get fired from my job, my girlfriend bails on me, I finally meet my childhood hero Captain Kirk, and he turns out to be a pathetic wacko! I can't believe my life!' This kind of sub-sitcom yak should have been left for the trailer.). Then again, the sight and sound of the William Shatner rapping Shakespeare while a crew of homies gits jiggy wit it behind him honestly is the height of brilliance. A lot can be forgiven for the filmmakers who made that happen. So, someone in the biz needs to make Robert Meyer Burnett rich by purchasing the remake rights to `Free Enterprise' before William Shatner dies of old age. Maybe someone will even give Burnett the money to do it himself. But this time they need to go with `film # 1.'",
         "When this movie was in theaters I thought I might watch it because I was a Star Trek Fan, but decided not to put much effort into it because it appeared to be about lonely geeks obsessed with Sci-Fi. I was wrong. Free Enterprise is a remarkably funny film featuring interesting, respectable characters who are professionals, AND love Star Trek. This movie is for all those guys out there who have girlfriends, who don't dress as Mister Spock, or live in their parents' basement amid tons of old comic books, but are still Star Trek fans. But fans aside, this is a really well crafted comedy. It's not for kids, but just about anyone else will be able to find something to like in it. It's a very atypical screwball comedy with a lot of intelligence within it. Whether you're a Sci-Fi fan or a Sci-Fi detractor, it makes no difference. This is a smart, funny film with something to love. Give it a shot.",
         "I think the average viewer would be left cold by this movie, but for those who have guys like this in their lives and perhaps have been the 'geek'y female in their circle it's pretty cute. Also, Shatner rules. As a chick who has spent part of the rent money on an original 12\" Boba Fett and spent adolescence keeping the one and only Captain as her personal lord and savior, I totally recommend it. Its place in film lore perhaps best belongs on Comedy Central on a rainy Sunday afternoon, but sometimes that's enough. I would have liked to seen more (or anything) done with the female counterparts of these types of guys - many are not model types like Claire but are interesting people in their own right. We're out there searching for these guys while these guys are searching for models who have our brains and sensitivities. (A wry, ironic, LOL here.)",
         "Short review: It has been my experience that, when any film generates so much reaction and that reaction is so sharply polarized, you simply have to see it for yourself. Longer review: The details of this film have been covered elsewhere. But in examining this film, I feel there are still some areas upon which we might expand. 1) Free Enterprise is as much about Los Angeles and a particular culture as it is about Star Trek and its fans. LA is simply full of guys just like Mark and Robert -- lower-to-middle level in the film industry, always hoping to get the chance to make the film they've always wanted to. They love film, but are struggling to maintain that affection in the face of the hard realities of the film biz (having seen far too many associates become jaded and bitter.) They hang out in cafes and all-night restaurants, and bars take the place of the living rooms they don't have because their apartments are too small. Most of them have unpublished manuscripts and screenplays, their conversation is dialogue, and they automatically pepper it with pop culture and film references new and old. In the case of Free Enterprise their focus is Star Trek and SF films, but it could just as easily be Hitchcock, James Bond or (for the coming generation) Kevin Smith. This film perfectly captures these guys, a dead-on representation of those living and working in the midst of The Dream Factory. Sure, the folks in the film are \"prettier\" than some might expect, but that's show biz -- movies are a glossed-up version of reality. 2) Speaking of expectations, much of the reaction to this film seems to orbit around not the film itself, but rather around how folks think the film addresses the stereotype of the Star Trek fan. Which shows that everyone needs to take another look at that stereotype as they hold it. So, Mark and Robert are not the fanboy extremists given such colorful treatment in \"Trekkies\" (which came out about the same time as FE, got much wider release, and actually kept some people away from FE because they assumed it was more of the same.) Our boys don't wear Star Fleet uniforms (well, not as adults), they aren't unusually shaped, they date... So some people label the characters as \"unrealistic\". I say, re-examine your own assumptions. Life is a continuum -- people do not always gravitate to extreme poles. 3) I have several times seen Robert Burnett and Mark Altman \"perform\" in person, and I can assure you that the \"semi-autobiographical\" characters in the film are in no way an exaggeration -- they are just as witty off-the-cuff as their characters are in the script, just as reference-saturated, just as opinionated. Think of the screenplay as excerpts drawn from a constantly-running tape recorder present when they are together with friends: the \"greatest moments\". Trust me, the characters in the film are dead on -- these guys talk like that. 4) Far from being the poor example of indie production some have labeled it, I feel FE *very* successfully overcomes low-budget considerations. Excellent use of practical lighting, imaginative usage of sets (and re-dressing of sets), and the LA-is-our-whole-world feel all add up to a veritable handbook for the low-budget director. (The excellent commentary track supports how carefully thought out these elements were, especially the discussion of overcoming lens restrictions.) 5) FE is also very successful for having overcome a very shaky release, to enjoy new life on DVD. Partly this is due to word-of-mouth, and partly it's due to the excellent usage the producers made of the DVD format. The alternate \"reference\" track is great fun, and the commentary track is one of the best out there. I think the longest break in the discussion is 8 seconds -- the rest of the time the guys are falling over each other to reveal details in the rich background they have created. It would be a crime to watch this film without also watching the commentary. 6) Many have pointed at the love story as the weakest element in PE, and I must say I agree with reservations. Right off, I'll say that I often feel that love stories are \"spliced into\" films -- you can almost hear someone say: \"It won't sell unless there's a love story in it\". And there's a bit of that here. But the love story does serve to help us examine the bonds between the guys; their group unity is challenged, their stability threatened. -- POSSIBLE SPOILER AHEAD -- Some folks feel that Claire is \"too pretty\" to be a comic book fan -- again, with the stereotypes! -- and that her character is unrealistic. The only main problem I have with the Robert-Claire relationship is when she takes him back, saying, \"I don't care about all your negatives, I love you because you will risk everything to achieve your dream!\" (This is the point where my wife and I always turn to each other and chorus, 'Fantasy Alert'!) Well, actually, Robert does not risk everything to achieve his dream of making a movie -- he in fact screws off and gives up and relies on the charity of his friends to keep him afloat, and no sensible Claire would dream of putting up with him. So this bit must be chalked up to \"Happy Hollywood Ending\" and the fact that this is Mark & Robert's movie and if they want to indulge in a bit of wish fulfillment then they can do so. My wife and I \"discovered\" this film for our friends, and have turned so many people on to it that we could fill a theater. Most folks have been *very* enthusiastic about it (their most common response: \"Why haven't I seen this before?\"). We have watched it going on 2 dozen times, and it just keeps getting better for us. Partly because we know these guys, these types, know the LA settings and atmosphere. But mostly just because it is a very well made, heartfelt, and entertaining production. I have to say a word here about Shatner. Back to stereotypes, and assumptions... I have to admit that I, like much of the world, had come to believe that William Shatner was egocentric, vain, and condescending to his fans. And in my defense, a case can be made for each of those points. (See \"Meeting of Minds\" for some indication of how genuinely clueless he is regarding why his costars might resent him.) But Free Enterprise turned my (our) head around -- Shatner's willingness to lampoon himself shows a whole new side of the man. His admonition to \"tear me down!\" (view the commentary track) shows a sincere desire to examine the nature of hero worship and stardom (as does his appearance in the film in the first place), and his \"it was then I realized that I'm not Captain Kirk\" monologue is actually quite touching. One comes away with a new respect for the man as an actor, and as a man. I can see why some people might not find Free Enterprise to their taste. But for those who do frequent this kind of restaurant, it is mighty tasty indeed.",
         "If you aren't a hard core Trek/sci fi fan, you'll be bored to limbo by this film, so don't even bother reading on. But if you are, there isn't a better fan movie for you than this. Right from the beginning, the jokes and references fly so fast and furious (from young Mark's flying leg kick and \"no, I won't kill him!\" line, straight to the end) that you'll be kept on your toes all the way through. The writing is very clever for the entire film, including Robert's set-up for the surprise at the end. The interactions are witty and excellent. And even if you think the jokes get a bit repetitive at some point, that's not all this film has to offer. You can look it also as a semi-serious autobiography (which it partly is) about two sci fi nerds very much like the rest of us with faults very much like our faults (though played to the extreme) trying to fulfill their dreams; Robert is a brash womanizer, but living too deeply in his fantasy world and irresponsible to the point where he leeches off friends more shamefully than any of us would dare (the scene where he meets Claire a prime example), and chooses to go without telephone or electricity so he can line his shelves with mucho expensive collectors' action figures. Mark is responsible and loyal to his friends, yet his narcissus complex (he won't even talk to people in his office unless they're sitting down!) and fear prevents him from dating any woman he cares about. While the film is packed with our favorite geek humor, their problems are very real, as are their deeper interactions and how they are affected by them. Free Enterprise is a wonderful story of friendship, struggle and ultimate achievement that people like us can all very strongly relate and aspire to, with important lessons underneath the jokes."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Mindfire Entertainment",
         "Triad Studios"
      ],
      "summaries": [
         "Young filmmakers (Rafer Weigel, Eric McCormack) trying to hawk a movie titled \"Bradykillers\" about a serial killer who goes after victims Marcia, Jan, and Cindy meet their screen idol, William Shatner. Shatner, appearing as himself, has fun poking fun at his own image. The two young men, who idolize him and in their fantasies have seen him as a shadowy fairy godfather figure, are alarmed at the reality of the middle-aged non-Captain Kirk man that they meet. However, their relationship helps anchor the two more into reality.",
         "Two less than successful film producers, approaching mid-life crisis and clinging to their nerdy sci-fi obsessions, suddenly meet their idol: William Shatner."
      ],
      "budget": 0
   },
   "movielensId": 2681,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-04",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["Robert Meyer Burnett"],
      "runtime": 113,
      "movieId": 2681,
      "title": "Free Enterprise",
      "mpaa": "",
      "actors": [
         "Eric McCormack",
         "William Shatner",
         "Carl Bressler",
         "Ethan Glazer",
         "Phyllis Franklin"
      ],
      "imdbMovieId": "0141105",
      "originalTitle": "Free Enterprise",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Young filmmakers trying to hawk a movie titled \"Bradykillers\" about a serial killer who goes after victims Marcia, Jan, and Cindy meet their screen idol, William Shatner. The two young men, who idolize him and in their fantasies have seen him as a shadowy fairy godfather figure, are alarmed at the reality of the middle-aged non-Captain Kirk man that they meet.",
      "tmdbMovieId": 13533,
      "avgRating": 3.34144,
      "releaseYear": "1998",
      "numRatings": 473,
      "posterPath": "/3GCMZDhvtrUcUK3FaZS3aEkyj8j.jpg"
   }
}