{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0164085",
      "video": false,
      "title": "Limbo",
      "recommendations": [
         44641,
         53408,
         148168,
         47582,
         51145,
         214952,
         189587,
         209677,
         194039,
         249638,
         132378,
         190725,
         179000,
         72785,
         196396,
         110733,
         222918,
         32716,
         98914,
         42595
      ],
      "backdrop_path": "/pPNMOPcoiWQ8zH3UZf06PqB44J7.jpg",
      "revenue": 1997807,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Donna De Angelo",
               "gender": 1,
               "credit_id": "52fe4688c3a368484e095cc5",
               "name": "Mary Elizabeth Mastrantonio",
               "profile_path": "/jNIGODCEy216bbPnj28ky5E4L3Q.jpg",
               "id": 1161,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "'Jumpin' Joe Gastineau",
               "gender": 2,
               "credit_id": "52fe4688c3a368484e095cc9",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Noelle De Angelo",
               "gender": 1,
               "credit_id": "52fe4688c3a368484e095ccd",
               "name": "Vanessa Martinez",
               "profile_path": "/dCMompNhK7IwLtVs6dVAjOeOzxL.jpg",
               "id": 235782,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "'Smilin' Jack Johannson",
               "gender": 2,
               "credit_id": "54ebdf039251417961000673",
               "name": "Kris Kristofferson",
               "profile_path": "/hiGkNoiAwnUgY9XZ3YhiWMvKngi.jpg",
               "id": 10823,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4688c3a368484e095cc1",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5680595c9251412e5200c0e5",
               "name": "John Sayles",
               "profile_path": "/849CWBxvBFWYQ6FmWirWgs9TQSa.jpg",
               "id": 102445,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "56805967c3a3684be300e6ab",
               "name": "Haskell Wexler",
               "profile_path": "/k3JSEg2tildKuFl6F6T1gLQSwgf.jpg",
               "id": 7067,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.671963,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 62676,
      "vote_count": 22,
      "budget": 8000000,
      "overview": "Unconventional narrative about the interactions amongst a group of people in a small town in Alaska, each of whom has guards a secret.",
      "similar": [],
      "original_title": "Limbo",
      "runtime": 126,
      "poster_path": "/dQOjALrOYmnM81yCiQDvRKX1KBf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/bz6GbCQQXGNE56LTW9dwgksW0Iw.png",
         "name": "Screen Gems",
         "id": 3287,
         "origin_country": "US"
      }],
      "release_date": "1999-06-04",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "The Only Thing More Dangerous Than Death... Is Survival.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Sayles"],
      "runtime": 126,
      "synopsis": null,
      "writers": ["John Sayles"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0164085/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MTQ3Mzg2NF5BMl5BanBnXkFtZTcwNDQ0MzMyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: David Strathairn, Mary Elizabeth Mastrantonio, Vanessa Martinez | See full cast and crew »"],
      "reviews": [
         "Once again, as do all John Sayles films, this is no Hollywood fare. There are no easy answers or solutions to the questions raised or problems illustrated. John Sayles gives his insightful subtle approaches to another aspect of life and living, of ordinary people tackling everyday encounters and challenges. Nothing spectacular (yet it is quietly spectacular). It's another multi-character study, and Sayles is very good at telling the story and providing the different premises and details in a seemingly casual manner. Sayles fans know it will not be a boring journey - life lessons will be assimilated. In LIMBO, photography is skillfully delivered by veteran cinematographer Haskell Wexler (the unforgettable \"Medium Cool\" 1969, which he also wrote and directed; \"The Thomas Crown Affair\" 1968 with director Norman Jewison; two with Sayles: \"Matewan\" 1987, \"The Secret of Roan Inish\" 1994). Here, graphic detail shots are included on fishing, informing us of the intricacies involved - it's Sayles ingredients to the core. Mary Elizabeth Mastrantonio, as always, a tour de force. She gets to demonstrate what a wonderful singer she can be. She did a terrific job - she sings so well that it sounds like Judy Collins at times! David Strathairn, for once, is not in a supporting role. He is in the male lead role and as expected, a quiet sensitive delivery of his character as a fisherman incognito. There is mother and daughter tension at play here. Vanessa Martinez played the teenage daughter and what a superb performance - hers is no easy role. The segment by the campfire where she reads from a diary book, her subtle expressions and poignant portrayal complete this triangle of complex emotional cauldron a-brewing\u0085yet she held her own in capturing our attention on her touching delivery. This is not an easy film to consume - it provides mind probing and requires reflective thinking. A John Sayles fan MUST-SEE, or anyone who's ready for a different movie and a change of pace. Music is by Mason Daring. As usual, the film is written, directed, and edited by John Sayles himself.",
         "I don't know all of Sayles work, but I plan to. This film really impressed me. What I look for is a few things, that if done well will really satisfy. Among them are: --daring use of the cinematic medium --transporting me to a conceptual space that I otherwise wouldn't have experienced --self reference CINEMATIC: Sayles is a storyteller, who thoroughly understands what it means to build a narrative scaffold using film. This is theater completely recast for the unique strengths of film, and only possible when the same person writes, directs and edits. This camera is literally introduced as a character when noelle offers it an `hoordoov.' The camera participates, the lights participate. We have overlapping dialog, overlapping cuts, multiple views of the same scene. We have long panning multithreaded scenes. We have a dramatic pacing which starts slow, sets a lot of potential threads and convincingly fools you into relying on certain expectations. Then narrative commitments are made before you are ready, and then come faster and more unexpectedly until the very gutsy end. Sayles knows in real storytelling, there's a game between teller and listener, each trying to outwit the other. A masterful storyteller teases but plays by the rules, allowing the reader to take risks. It takes craft to do this in the written word, and is extremely rare using the more intimate but external and slippery experience of cinema. TRANSPORTING: Alaskan wilderness as theme park where stories are safely refined for casual visitors. That would be enough given this level of craft. But Sayles takes us into Noelle's diary world. That's the center of this film's world, the world of the mystical Shefox. Deep imagery here -- superficially referenced in the `real' action. I do not expect to ever forget that visit. The self-reference is in both. Much has been made of the actors, and I think that a mistake since the creative force here is clearly Sayles. But this girl Martinez has some magic. Who will write parts for her?",
         "After seeing this movie on DVD, I found that I admired Sayles as a director, actress Mastrantonio as a talented singer, and David Straithern as an actor. Earlier I was only familiar with the above-average work of Mastrantonio but here she is remarkable. It is indeed sad that such interesting and well-made movies never fetch an Oscar, if not major Oscars. It is indeed \"Ox-bow incident\" revisited. Every aspect of the film is well crafted and rivetting for any intelligent viewer. The DVD commentary is a great one for movie enthusiasts.",
         "With its leisurely pace, unusual structure, and highly ambiguous ending (not to mention a nonexistent marketing campaign), Limbo will quite likely divide the small audience that sees it. This is a terrible shame, as John Sayles is at the top of his game. Set in Alaska, Limbo comments incisively on a variety of complex issues concerning the vast state -- the relentless tourism, the scarcity of meaningful employment for the working class, and the careless abuses of irreplaceable natural resources by the wealthy, to name a few. All of these interesting themes, however, are discarded half-way through in favor of a thought-provoking story of human survival that will undoubtedly light a fire for some while irritating and alienating others. Sayles has not always connected with me, but I was deeply moved by Limbo (especially the rich characterizations provided by Martinez, Mastrantonio, and Sayles regular Strathairn) -- and I absolutely loved the gutsy ending, which continues to occupy my thoughts.",
         "\"Limbo\" continues John Sayles travels around the continent to find distinctive regionalisms and he portrays small town Alaska with a real authentic feel. The audio and video were out of synch for the first 15 minutes so I missed some of a key scene where the singer breaks up with her boyfriend through a song, which was too bad as the cover songs are terrific, from Tom Waits to Richard Thompson's \"Dimming of the Day.\" The acting was excellent, particularly, Vanessa Martinez as a very believable teenager. David Strathairn was both restrained and passionate. I just wasn't completely convinced that Mary Elizabeth Mastrantonio's character had gone through changes to be at peace with herself. Kris Kristofferson again does a bad guy scarily convincingly. But the surprise \"limbo\" conclusion ruined the film for me and virtually everyone else in the audience also groaned. (originally written 7/12/1999)",
         "I'd suggest that viewers watch 'Limbo' on DVD with the voice-over narrative by John Sayles, the director. A lot of insights provided there, including a lot of little details which give you insight into movie-making--the reason for multiple takes, visual effects, the importance of 'continuity', and even a lot about sound, which was a big issue in the making of this film. I was amazed to learn that Mary Elizabeth Mastrantonio is such a terrific singer--she sang all the songs and, in fact, her voice was recorded live while shooting the scenes, not dubbed in later in post-production. Sayles describes this in his narrative. Sayles had less to say in the narrative about the ending, but based on the comments he DID make it was all quite intentional--not the result of studio politics or a screenwriter (Sayles himself) who couldn't decide on a final ending. In fact, I would suggest that it is Sayles' standing in the business that permitted this film to be produced & released without answering the question of what becomes of those characters, though it also occurs to me that it could be the reason why this film didn't get much of a marketing push. Clearly the audience is left hanging in--dare I say it--a state of limbo. Sayles has no intention, based on his comments, of a sequel, though he invites anyone else to dream one up if they wish. But aside from all this, it was a terrific film, with interesting characters, shot in unusual and often stunning locations (\"Insomnia\" comes to mind when thinking of recent films shot in Alaska with its scenic backdrops). The cast was generally quite good--Mastrantonio and Strathairn were terrific, and Kris Kristofferson was a great choice as the likable but edgy local, Smilin' Jack Johannson. Vanessa Martinez was, for me, less convincing as the daughter until the boat trip and beyond, but that is when her character becomes truly important to the story and her work was quite good when it mattered most; up to then it was all teenage angst. Overall, I enjoyed 'Limbo' a great deal, and the limbo in which the audience is left with such abruptness was, for me, almost a slap in the face--a welcome one--in striking contrast to the 'Star Wars' series in which George Lucas took 6 movies and nearly 30 years to tell us how Darth Vader came to be. Note: I am NOT slamming Lucas or 'Star Wars' by that comment, only making a point.",
         "Having finally caught us with John Sayles' \"Limbo\", it must be said that the king of the indie scene can still surpass any genre. Casting his friend (and movie veteran) David Strathairn as an Alaskan fisherman with an emotional crisis is one of the film's many pluses. Strathairn brings an everyman quality to every role he's in. The film is also not unlike Strathairn's own \"The River Wild\". At least, without the contrivances. Mary Elizabeth Mastrantonio is also good as a bar singer (she sings pretty well too) hauling her teenage daughter (Vanessa Martinez, very good in her debut) through gig after gig. The film also has some thriller elements; but, this of course, is Sayles, who wisely pushes for character development and dialogue ladened with truth. As he proved with EIGHT MEN OUT, MATEWAN, CITY OF HOPE, and PASSION FISH, Sayles is a truly gifted writer/director. Keep it coming.",
         "[possible spoiler] Oh dear. I guess I have to be the turd in the punchbowl again and offer a contrarian view to the encomia of praise for this portentous exercise. What we have here appears to be a rather mundane soap opera about troubled people with dark secrets which, halfway through, transforms itself presto-chango into a survival-movie-cum-crime-drama. Another flick which, forgive me, can't seem to decide what it wants to be. And the truncated, I'm-not-going-to-tell-you-what-happened ending is to me an egregious abuse of the filmmaker's power and an affront to the viewer. Maltin must have been on drugs when he gave this one 3.5 stars. Hey, call me a philistine, but save your money and rent Cool Hand Luke again.",
         "If you are a film student, or a John Sayles devotee, I recommend you buy or rent the DVD version. As compelling as the film was, the director/author's running commentary was equally fascinating. This movie sweeps you along at a leisurely pace, till you are not sure whether or not you are interested at all. When the plot twist begins, you will be swept under like a whirlpool. Four stars, two thumbs up. Better than Lone Star. And if you didn't like the ending, you didn't understand the movie. This isn't entertainment, this is art.",
         "I enjoyed this movie tremendously, and although I agree with previous posters that the 'mother' is a monster, I thought that helped the film, particularly since she was portrayed sensitively-ish (she's definitely the least sympathetic of the 3 main characters). The self-absorption and the amazingly flamboyant failed attempts at good parenting are all part of the title: Limbo. Mastroantonio's character is in perpetual limbo, and as a result, so is her daughter. Straithairn is simply trying to live, in limbo due to an accident for which he feels responsible (but isn't). The community is in limbo, as well, as industries close and local officials try to find a way to keep the economy afloat (and their own pockets full). Although one could argue that the crisis - Straithairn's brother's 'situation' - is a little manipulative, I didn't mind it, and I loved the fact that the crisis led the trio to a 'time-out' - limbo within a limbo. It was filmed so beautifully, acted so amazingly well and was so nice and slow that I almost felt envious of the characters for their situation - who, in real life, gets to put their life into a perspective while bonding with other truly caring souls? Of course, being hunted by killers, starving to death and worrying about dying in the Alaskan winter are no picnic...but, there was a strong sense of togetherness and of honesty, even painful and inappropriate honesty. As for the ending --- well, I, too, shouted 'NO!' at the screen, but only because I ended up loving these characters so much I wanted to see them do well - to get out of limbo, as they all so ardently wish for (the final scene itself was so expressive, both in the staging and the acting, that it tore me up). Of course, I didn't want them to die, either! A perfectly formed movie. I will watch it again, for sure."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Green/Renzi"],
      "summaries": [
         "Limbo tells the story of people trying to reinvent themselves in the Southeastern islands of Alaska. The story revolves around Joe Gastineau, a fisherman traumatised by an accident at sea years before, singer Donna de Angelo and her disaffected daughter Noelle who come into Joe's life. When Joe's fast-talking half-brother Bobby returns to town and asks Joe for a favor, the lives of the characters are changed forever.",
         "In an economically devastated Alaskan town, a fisherman with a troublesome past dates a woman whose young daughter does not approve of him. When he witnesses the murder of his shady brother, he, the woman and the kid run to the wilderness."
      ],
      "budget": 8000000
   },
   "movielensId": 2682,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-06-04",
      "dvdReleaseDate": "1999-11-23",
      "directors": ["John Sayles"],
      "runtime": 126,
      "movieId": 2682,
      "title": "Limbo",
      "mpaa": "",
      "actors": [
         "Mary Elizabeth Mastrantonio",
         "David Strathairn",
         "Vanessa Martinez",
         "Kris Kristofferson"
      ],
      "imdbMovieId": "0164085",
      "originalTitle": "Limbo",
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["0hS5BrNBgJk"],
      "plotSummary": "Unconventional narrative about the interactions amongst a group of people in a small town in Alaska, each of whom has guards a secret.",
      "tmdbMovieId": 62676,
      "avgRating": 3.80075,
      "releaseYear": "1999",
      "numRatings": 803,
      "posterPath": "/dQOjALrOYmnM81yCiQDvRKX1KBf.jpg"
   }
}