{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0156820",
      "video": false,
      "title": "The Red Dwarf",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Lucien L'Hotte",
               "gender": 0,
               "credit_id": "52fe48dd9251416c750b5b1f",
               "name": "Jean-Yves Tual",
               "profile_path": "/kQjyRDZVl6Me7DxG6W90lIh6dpL.jpg",
               "id": 980224,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Paola Bendoni",
               "gender": 1,
               "credit_id": "52fe48dd9251416c750b5b23",
               "name": "Anita Ekberg",
               "profile_path": "/6cVesMXxY4dRO4K87Ni7msNdTPh.jpg",
               "id": 5961,
               "order": 1
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe48dd9251416c750b5b1b",
            "name": "Yvan Le Moine",
            "profile_path": null,
            "id": 980223,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.113989,
      "production_countries": [],
      "id": 91598,
      "vote_count": 3,
      "budget": 0,
      "overview": "Lucien is a dwarf, who works hard in a large legal office. His only friend is trapeze circus artist Isis. One day he gets the attention of singer Paola Bendoni and falls in love with her.",
      "similar": [],
      "original_title": "Le nain rouge",
      "runtime": 100,
      "poster_path": "/a3W2wBqq9OAoSm1ea4KsFZ13SYU.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-05-16",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "Life begins when you snap.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Belgium",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Yvan Le Moine"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Yvan Le Moine",
         "Michel Tournier"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0156820/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg0ODQxNTU3MF5BMl5BanBnXkFtZTcwOTg0NDMyMQ@@._V1_SY317_CR0,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Yves Tual, Anita Ekberg, Dyna Gauzy | See full cast and crew »"],
      "reviews": [
         "I saw this film during the 22:nd Gothenburg Film Festival. I chose to see it since the title reminded me of Red Dwarf, the TV series, and started to read about the film in the festival program. I didn't need to read more than 2 two lines of text before I knew I wanted to see it. And it was certanly no disappointment, I was amazed throughout the entire film. And just loved it. That it was in black and white helped the feeling in the film. I don't know exactly what to say except that if you haven't already seen it, DO SO !",
         "Enjoyed this film which had fantastic realistic scenes of drama, murder and both male and female nudity along with plenty of clowns and circus acts. This film is about Jean-Yves Thual, (Lucien L'Hotte) who works in a law office and gets involved with a rich older lady, Paola Bendoni,(Anita Ekberg) and eventually goes to bed with her and enjoys his sexual romance. However, Lucien L'Hotte really loves a very young girl in the circus and hopes someday to join her in the circus and have a great act together. There is a scene where Lucien jumps up on the desk of his boss in the law firm and proceeds to do a dump on his desk. There is lots of laughs along with a very entertaining film which is rather drawn out and very very slow. Enjoy",
         "Watching this film is a lot like watching a David Lynch film, but without the \"Hey, look at me! I'm doing weird stuff here!\" attitude that ruined \"Wild at Heart,\" \"Lost Highway,\" and the \"Twin Peaks\" theatrical film. Jean-Yves Thual is Lucien, a dwarf who works at a law firm. His job is to write incriminating letters to divorcing spouses in order to break up their marriages. He meets little Dyna Gauzy, who is Isis, a child trapeze artist in a local traveling circus. They become friends, as Isis sees Lucien as her guardian angel and not a freak of nature. Lucien also meets Paola, played by '60's sexpot Anita Ekberg (who has REALLY let herself go). Paola and Lucien start sleeping together, and Lucien falls in love with her, ignoring Isis after a while. Eventually Paola and her husband, the goofy Bob, get back together. In the films creepiest scene, Lucien, wearing some of Paola's makeup and a wig, strangles his lover to death and blames it on Bob, who has fled the country. Between the sex and the murder, Lucien now has a new found confidence that eventually gets him in trouble at work. Lucien quits, and does something on his boss' desk that we all have wanted to do to our employers at one point or another. Lucien joins Isis' circus, but Bob shows up. He is on the run, and he and Lucien become friends and perform together as clowns. Isis is jealous, and has some very touching scenes sobbing as the crowd doubles over at Lucien and Bob. Lucien and Isis do team up for an act, and this leads to the final ambiguous ending, with director Le Moine leaving us wanting more. This is a weird film full of weird scenes: Lucien's clandestine bath at Ekberg's house, the smoking cab driver, the law office run more like a cruel boarding school, and the circus performances. I compare this favorably to early David Lynch films like the idiotic \"Eraserhead\" and the incredible \"The Elephant Man.\" Le Moine shoots in black and white, which brings out a bleakness that adds to the French locales. The entire cast is great, professionally playing parts that must have read as impossible on paper. Le Moine draws you into this bizarre vision of his, and uses his camera to uncover things as opposed to being hit over the head with plot points every ten minutes. Jean-Yves Thual is brave as Lucien, he has a revealing nude scene, love scenes, and yet he is someone you want to succeed (except for that small matter of murder). He looks a little like a miniature version of Christopher Reeve, and holds his own against this cast. The film is French language with excellent, readable English subtitles. If you fancy yourself a patron of the bizarre, you must rent this film. I highly recommend it. This is rated (R) for physical violence, some gore, strong profanity, female nudity, male nudity, sexual content, sexual references, some drug use, and adult situations.",
         "Several times I asked myself where the story was heading but hung in and was rewarded with an answer although not a completely satisfying one. The main character really makes you feel what it is like to be a small person in a big world. The character Isis is irresistible and made you cheer for her and her loving understanding of L'Hottel. Anita Ekberg's appearance as the countess was somewhere between drama and high camp. The scenes she plays with L'Hottel were way \"over the top.\" While not a satisfying film it is worth a look just to better understand that all people have feelings and deserve to be treated with some sort of dignity.",
         "slices from Fellini, drops from Michel Tournier novel. and a mount of good intentions. result - not a movie. but a game. feelings in large clothes, Anita Eckberg as axis of interest, a Jean - Yves Thual isolated in a too long story about life, friendship, hopes, rage, emotions, a dwarf, a girl and circle of small things.in fact, nothing convincing. only drawing of a large fresco and fear to finish the work. few basic solutions, far from real emotion. and some nuances of gray. not enough. but it is difficult to say - it is a bad film. it is only an exercise to present a tale. and a mountain of good , beautiful intentions.",
         "The first third of this film was very interesting, but mainly because of the good black-and- white closeup photography in that first 30-45 minutes. Then the story began to get very distasteful with characters I could not care about, and I doubt most people could. The story is a bit disjointed and sordid about a dwarf who has some sort of relationship with a older, fat and married woman, all the while he is serving divorce papers....at least that's what it sounded like. It wasn't all that clear after an hour, and by then I had lost interest trying figure everything out. In the meantime, the dwarf also was attracted to this little girl at the circus. It's all very strange....and not a satisfying story. One review I read somewhere said this film reminded him of early David Lynch movies, and I think that's an apt description. I love a couple of Lynch films, but some of his stuff stinks, too. (i.e. Eraserhead, Lost Highway, to name two).",
         "It is impossible to understand what the filmaker was trying to convey. Two worthwile scenes in the entire movie, but they were not worth the money for the rental. The description on the backcover says that the movie is about the main character's rage and a path to redemption. However, I simply did not feel his \"rage\" and his redemption was in plain sight since the beginning. Perhaps the only salvation came that the DVD had trailers of \"Character\" and \"City of the Lost Children\" movies far more worth the rental money.",
         "I saw this film on the filmfestival in Rotterdam and to be quite honest, I thought it was a terrible film. It was full of cliches and I think the director had an overdosis Fellini. But the Master wouldn't like the film at all. There are absolutely no sympathetic characters, the story makes no sense and actors are no good (except for Anita Ekberg and Arno Chevrier in the hilarious part of Bob)."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "A.A. Les Films Belge",
         "Canal+",
         "Classic"
      ],
      "summaries": ["Lucien is a dwarf, who works hard in a large legal office. His only friend is trapeze circus artist Isis. One day he gets the attention of singer Paola Bendoni and falls in love with her."],
      "budget": 0
   },
   "movielensId": 2685,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-05-16",
      "dvdReleaseDate": "2000-04-18",
      "directors": ["Yvan Le Moine"],
      "runtime": 100,
      "movieId": 2685,
      "title": "The Red Dwarf",
      "mpaa": null,
      "actors": [
         "Jean-Yves Tual",
         "Anita Ekberg"
      ],
      "imdbMovieId": "0156820",
      "originalTitle": "Le nain rouge",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Lucien is a dwarf, who works hard in a large legal office. His only friend is trapeze circus artist Isis. One day he gets the attention of singer Paola Bendoni and falls in love with her.",
      "tmdbMovieId": 91598,
      "avgRating": 3.29688,
      "releaseYear": "1998",
      "numRatings": 64,
      "posterPath": "/a3W2wBqq9OAoSm1ea4KsFZ13SYU.jpg"
   }
}