{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0122541",
      "video": false,
      "title": "An Ideal Husband",
      "recommendations": [
         28519,
         9465,
         24071,
         45609,
         37345,
         50474,
         17589,
         14799,
         20024,
         38718,
         18701,
         11777,
         37753,
         56821,
         34873,
         63888,
         36912,
         38583,
         36758,
         43535
      ],
      "backdrop_path": "/kZoDC3rPgtjVkzYVCV3464uiMMD.jpg",
      "revenue": 18535191,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lady Gertrude Chiltern",
               "gender": 1,
               "credit_id": "52fe4485c3a368484e027af5",
               "name": "Cate Blanchett",
               "profile_path": "/5HikVWKfkkUa8aLdCMHtREBECIn.jpg",
               "id": 112,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Miss Mabel Chiltern",
               "gender": 1,
               "credit_id": "52fe4485c3a368484e027af9",
               "name": "Minnie Driver",
               "profile_path": "/iWqTeFmdoY8V8RLcH89K75AKeQN.jpg",
               "id": 6613,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Lord Arthur Goring",
               "gender": 2,
               "credit_id": "52fe4485c3a368484e027b0f",
               "name": "Rupert Everett",
               "profile_path": "/jGTaV5htTRo2T0aeM2eoHZcpLG4.jpg",
               "id": 4757,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mrs. Laura Cheveley",
               "gender": 1,
               "credit_id": "52fe4485c3a368484e027b13",
               "name": "Julianne Moore",
               "profile_path": "/v2FcWGiiuvl6P7NV0966jNL09uh.jpg",
               "id": 1231,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Sir Robert Chiltern",
               "gender": 2,
               "credit_id": "52fe4485c3a368484e027b17",
               "name": "Jeremy Northam",
               "profile_path": "/8NkPuXeJ8nXXIhgrmS8g7kcaTOS.jpg",
               "id": 18325,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Phipps",
               "gender": 2,
               "credit_id": "52fe4485c3a368484e027b1b",
               "name": "Peter Vaughan",
               "profile_path": "/z9ZplbTA1ojYhgZ8kJUKKhsJ7Gs.jpg",
               "id": 386,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Tommy Trafford",
               "gender": 2,
               "credit_id": "59fc3296c3a3681a83024f85",
               "name": "Ben Pullen",
               "profile_path": null,
               "id": 48968,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Countess",
               "gender": 1,
               "credit_id": "59fc32a2c3a3681a83024f8e",
               "name": "Marsha Fitzalan",
               "profile_path": "/rQ6HyhDKPcaAyUgyh2yJVJ3EWsd.jpg",
               "id": 112439,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Lady Markby",
               "gender": 1,
               "credit_id": "59fc32b092514113a6025643",
               "name": "Lindsay Duncan",
               "profile_path": "/ddjjwMEHLBvzkZzZ5frEvJyWnZ6.jpg",
               "id": 30083,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Lord Caversham",
               "gender": 2,
               "credit_id": "59fc32c3c3a3681a3f023a1c",
               "name": "John Wood",
               "profile_path": "/bWt4JT9eGxFtu3q0iCAKFtNv5XK.jpg",
               "id": 8937,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Sir Edward",
               "gender": 2,
               "credit_id": "59fc32d8c3a3681aa502936a",
               "name": "Simon Russell Beale",
               "profile_path": "/sCWLiTESdpjNahOj2jy0H4IWbp9.jpg",
               "id": 57461,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Jack",
               "gender": 2,
               "credit_id": "59fc32eb92514113bb0264e6",
               "name": "Charles Edwards",
               "profile_path": "/qcAysQnmu7Pi96IV85u4YjgqzkQ.jpg",
               "id": 281527,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Sir Hugo Danforth",
               "gender": 2,
               "credit_id": "59fc330ac3a3681a83024fe7",
               "name": "Oliver Ford Davies",
               "profile_path": "/7fpNxQYZ85oRdnKWxPzQfURFkFT.jpg",
               "id": 31923,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Young Mother",
               "gender": 1,
               "credit_id": "59fc331d92514113e702680a",
               "name": "Susannah Wise",
               "profile_path": "/k4uhlnrCsRLke4VogWeNWmC86LI.jpg",
               "id": 1399148,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4485c3a368484e027aff",
               "name": "Oliver Parker",
               "profile_path": "/3qdUN7qhcQn4P3tEOTKJgTUdCIr.jpg",
               "id": 56710,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4485c3a368484e027b05",
               "name": "Oliver Parker",
               "profile_path": "/3qdUN7qhcQn4P3tEOTKJgTUdCIr.jpg",
               "id": 56710,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4485c3a368484e027b0b",
               "name": "Oscar Wilde",
               "profile_path": "/5e4dEOQM7o4niRageovpPosslxn.jpg",
               "id": 56712,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.818145,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 24137,
      "vote_count": 61,
      "budget": 14000000,
      "overview": "Sir Robert Chiltern is a successful Government minister, well-off and with a loving wife. All this is threatened when Mrs Cheveley appears in London with damning evidence of a past misdeed. Sir Robert turns for help to his friend Lord Goring, an apparently idle philanderer and the despair of his father. Goring knows the lady of old, and, for him, takes the whole thing pretty seriously.",
      "similar": [],
      "original_title": "An Ideal Husband",
      "runtime": 97,
      "poster_path": "/5EaU1ttO7C8wmLpmdRHRthKcgxq.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pyramide Productions",
            "id": 186,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-15",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "He just doesn't know it yet.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Oliver Parker"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Oscar Wilde",
         "Oliver Parker"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0122541/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU3MTkyNTQxM15BMl5BanBnXkFtZTcwNDA2NTAyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Rupert Everett, Julianne Moore, Peter Vaughan | See full cast and crew »"],
      "reviews": [
         "As I left this movie, someone said \"How nice to see an intelligent movie!\" The risk going in was that it would be ONLY an intelligent - or at least clever - piece, all period manners and costumes. In fact, with all the Oscar Wilde wit which sounds wonderfully fresh here, there are also rich moments of emotional depth throughout this amusing but also quite moving film. One theme here - touching in hindsight - is how little it can take to destroy a reputation - Wilde was later to have some of the most painful possible firsthand experience of this. But the central question here, which anchors the humor and beauty that decorate it, is the cost of rigorous, even rigid, honesty. And the growth of the central characters on this point shines through, even through the dance of wit and farce. Underpinning this is a surprising faith in human nobility, quite in contrast to the ironic persona Wilde maintained. It struck me while watching it both that Wilde had very French characteristics - a continental finesse, the love of repartee - and yet was profoundly an English writer by virtue of his faith in fair play and the bonds of (platonic) male friendship. In fact, Lord Goring, whose world-weary ways make him something of a surrogate for Wilde, is a distant cousin to Sidney Carton in coming to the defense of a 'nobler' friend even at great (possible) sacrifice to himself. His very lack of seriousness is what makes his efforts on behalf of his friends so moving. With this, the pure visual beauty of actors like Cate Blanchett and Rupert Everett, matched by sumptuous costumes and sets, adds a sensuous element which, in a lesser film, might have dominated the movie. They, with Minnie Driver in cheeky comic form and Julianne Moore sweetly evil and superbly English, make it a delight both to watch and to savor later as tart food for thought.",
         "To say that this film is a filmmaking tour de force would be a great injustice. It is far better than that. Oliver Parker's revitalizing of Oscar Wilde's classic play is filmmaking at its finest. Every element of this film is superlative. Wilde's story as adapted to the screen by Parker is witty, intelligent and engaging from start to finish. Seldom can you find a story that attempts to be a romantic comedy, a tale of duplicity blackmail and betrayal, and a drama of political intrigue, and succeeds so well on all counts. The intricate weave of deception, manipulation and double entendre along with comic misperception, irony and rapier witted dialogue are delicious and classic Wilde. This is a film you will want to see again and again, just to discover all the lines within the lines. I cannot say enough about the brilliance of Oliver Parker's direction in this film. He has captured late 19th Century aristocratic England with vivid and rich images that put the viewer right into the period. David Johnson's cinematography is fantastic, with every scene working well as to lighting and color. The beautiful blend of colors in the costumes and the set always looked like they belonged together. Parker also provides numerous interesting camera angles that help dramatize the scenes. It serves to remind us that glorious films can still be made relying on the creative eye of the director rather than special effects. The acting was delightful. Rupert Everett, as the self absorbed Lord Arthur Goring, delivers an exquisite performance as the unscrupulous rogue upon whom the mantle of truth and honor is laid. Julianne Moore was delightful as the evil and cunning Mrs. Cheveley. As cold, manipulative and heartless as she is with Chiltern and Lady Chiltern, she is that vulnerable and helpless with Lord Goring, for whom she has long held a flame. Moore handles this emotional juggling act with great skill and you find yourself simultaneously loving her ingeniousness and hating her treachery. Cate Blanchett turns in another wonderful performance as the oh-so-perfect, Lady Gertrud Chiltern. Jeremy Northam is also excellent as Robert Chiltern, the man of untouchable character with a scandalous secret in his past. Even Minnie Driver is charming as Robert's sister. This is a terrific film for the refined viewer who appreciates all aspects of filmmaking. Even for those not into the art of filmmaking, it is simply great entertainment. I can think of no negative criticism of it. It is well written, directed, photographed and acted. It is filmmaking the way it was meant to be. A perfect 10.",
         "If I weren't so lazy, I would have checked the original play to see if my favorite line from the movie was in it: Goring's father: I use nothing but my common sense. Goring: So my mother tells me. Even if was concocted for the film, that line still contains the essence of Wilde and the essence of all modern British humor, for which, I should say, I'm a major sucker. While watching An Ideal Husband, I didn't object to the lack of suspense as long as Rupert Everett was working his way around those Wilde lines, which he does as well as anyone I've ever heard. I used to think Stephen Fry was Wilde on earth, but Fry is something wonderfully different -- Everett is Wilde on earth, or at least the actor that Wilde should have had around to deliver those lines when he wrote them. I first saw Everett in The Madness of King George, for which he put on weight. Every review of that film mentioned this; I thought the attention excessive, but when I saw him lying shirtless in a sauna, I understood. The man is, shall we say, cut. I can only imagine the effect of that scene on straight women or gay men -- probably something akin to the effect Greta Scacchi's \"I think we're alone now\" smile at the end of The Coca-Cola Kid has on me. An Ideal Husband is full of good performances, with one glaring exception: the usually great Julianne Moore. Her scenes are curiously leaden, and Parker -- whose fault this may be -- has the camera linger over her as though the exposure will convince us how evil she is. The one exception is her scene with Everett, which has a real \"Will he sleep with the enemy?\" tension. It may be that Moore was just outclassed by the Brits, who are born to this stuff. Cate Blanchett, whom I've seen in three movies, two of which were British period pieces, continues to amaze me with her range. The unsung hero of the movie is Jeremy Northam, who takes a thankless role -- the man in the play who isn't the Oscar Wilde figure -- and makes it emotionally compelling. He is responsible for the play's only real suspense and emotion, since the rest is word games, more or less. All of which leads me to blame the production's shortcomings on its writer/director, Oliver Parker. He seems to have squandered an outstanding cast. The play's final scene is played as a series of French scenes -- a film term for a series of different scenes in the same location -- and this kills any momentum that scene might have had. Three out of four stars, I say, which makes it better than 90% of the movies out there.",
         "One of the principal sources of humour in Wilde's plays comes from pricking at the inflated egos, pious humbug and ignorance of the upper classes. There is always a Wildean character to reverse a clicheed expression or invert conventional 'wisdom.' Unfortunately, by stripping most of his characters of their stiff formality and rigid social code, the writer and director have removed the butt of the joke and Wilde's comments on absurdity are left without a punchline. The attempt to work in anachronistic social relevance leaves us with a set of feeble characters who fall in love with each other for no obvious reason. Because Wilde's language has been sterilised the actors have to use mugging to express the personalities Wilde created. Result, a charmless and dated 'political' drama as credible as a Jeffery Archer novel. Gertrude is insecure and fretful where she should be smug and priggish- Mabel is arch where she should be caustic- Poor Oscar - gets no 'Oscar'!",
         "An Ideal Husband - **** In 19th Century London, Sir Robert Chiltern (Jeremy Northam,) is a successful member of parliament married to the virtuous, fabulously popular Lady Gertrud Chiltern (Cate Blanchett.) Sir Robert's sister Mabel (Minnie Driver) is infatuated with Sir Robert's friend, Lord Arthur Goring (Rupert Everett.) The dashing Lord Goring, the wealthy son of the Earl of Caversham, is an inveterate bachelor who lives a life of leisure. Into this already crowded picture drops Mrs. Laura Cheveley (Julianne Moore,) an Austrian socialite with two ex-husbands and a convoluted past. Not only was she briefly engaged to Lord Goring, but it seems that she possesses evidence that the noble Sir Robert once committed a terrible indiscretion. Mrs. Cheveley uses this explosive evidence in her attempt to blackmail Sir Robert into voting against his conscience on the floor of Parliament. What ensues is a fascinating examination of honor and idealism. We learn that the noble Sir Robert is less than perfect, while the rakish bachelor Lord Goring possesses a surprising level of honor and insight. If Shakespeare in Love deserved an Oscar, this film deserves the Nobel Prize. It is simply outstanding in every respect. The first thing one notices is the dialogue. It is a bit stiff and stilted, as was the custom in London at the time, but it also possesses a razor sharp wit and sly sense of humor. Every last character speaks with intelligence and humor. The verbal fireworks, particularly as provided by Lord Goring, illuminate character and motivation while simultaneously producing guffaws from the audience. The plot structure is a marvel. There are no explosions, fireballs, or car chases, but the picture achieves a certain breathlessness simply through its intricate layering of multiple characters, all with intertwining motivations, interests, and connections with one another. A prime example of this is the scene in which poor Lord Goring receives multiple visitors at his home in a single night. All of the visitors have conflicts with one another, so Lord Goring must segregate them and move from room to room, listening to their problems and providing insights. The costumes and locations are all excellent. I particularly liked the manner in which Sir Robert's bright home is contrasted with Lord Goring's dark and cavernous bachelor pad. The one complaint I have is with the film's music; it seemed too light and frivolous, overplaying the \"madcap shenanigans\" element of the picture. But this is a minor quibble indeed. The acting is first rate across the board. Jeremy Northam (yes, he could play James Bond) is well suited to the role of Sir Robert. He exudes intelligence, honor, and duty. Julianne Moore, as Mrs. Cheveley, seems to relish the conniving and scheming of her character. Cate Blanchett and Minnie Driver capably bring depth and intelligence to their limited roles. But the true star of the film is Rupert Everett as Lord Arthur Goring. Mr. Everett has had a promising career to this point, but An Ideal Husband is his breakout role. In this film he is witty, charming, caring, wise, devilish, and childish all at once. Lord Goring is the kind of man that makes women swoon and men flock around to hear funny stories. He reminded me of Cary Grant - only better. Someone give that man an Academy Award.",
         "As we prepare to enter the 21st Century, An Ideal Husband allows us to see the world, England in particular, as we enter the 20th Century, and who better to guide us than Oscar Wilde. The story is not unfamiliar --- politics, blackmail, love, and friendship. What is different however is how these are viewed thru the prism of the Victorian Era, the centerpiece of the film. The cast was superb from Jeremy Northam, Sir Robert Chiltern the title character, to Cate Blanchett, Lady Gertrud Chiltern his wife, to Minnie Driver, Mabel Chiltern his sister, to Rupert Everett, Lord Arthur Goring his friend, and Julianne Moore, Mrs. Cheveley. The minor characters of Lord Goring's father and butler were good as well. Although all were very good, Rupert Everett stole the show. His character is the one who connects all the others and does so with grace, charm, and wit. Which brings me to my final point, the film is filmed filled with witty dialogue and double-entendre a la Oscar Wilde. I went to see this movie twice. It was that good and appreciated it more the second time. I can not see how this movie could have been better. Four stars!!!",
         "\"An Ideal Husband\" is a charming though contrived little 19th century English period comedy with the subtly sardonic sense of humor typical of Oscar Wilde. The film, which deals with the politics of society first, the politics of the heart second, and the politics of the state last, features all the trappings of the period, a solid cast, and a clever script. An amusing and enjoyable watch for those into 19th century English period films.",
         "I saw \"An Ideal Husband\" at the Old Vic theater in London, and was surprised at the time how timely a 100 year old play could be. When I saw the trailers, TV ads and posters for this version, it seemed like an entirely different story--will Rupert Everett get married off. That's certainly a thread in the movie, but in the marketing of this version, they made it appear as if it was the entire wardrobe. I didn't see the film when it was in theaters because these ads, with their very modern music and fast cutting, made the film look like a joke. But when it came out on video, I decided to try it, and am glad I did. The film itself is excellent. Beautifully shot and paced, with an expert cast. Wilde's humor shines through, and the writer-director has done a wonderful job \"opening\" up the play into a film, without changing anything important. It's a masterful job of translating from stage to screen. It's really so crisply done, and very funny. In years to come people will realise that this is a fine movie version of this play. And by then, hopefully, they will have either forgotten about the marketing campaign, or hopefully learned from it. I recommend the film.",
         "Trite, precious, rote, hackneyed, tired, terrible. I can't summon enough pejoratives to disparage this period-piece mess. First off, I didn't appreciate the obvious digital trickery employed to make this moderately budgeted production \"handsome.\" Lots of mathematically blatant composites -- foreground too crisp, background too Gaussian-fuzzy -- and simulated crowd scenes. The whole film has this peculiar, hermetically sealed quality -- as if nothing contained within it has any causative relation to the world at large. Indeed, the forced drollery of the script made my eyes roll back into my head. It was painful to watch perfectly wonderful actors -- Julianne Moore, Cate Blanchette, Rupert Everett, Minnie Driver -- gesticulate their way through the wildly unfunny material, and even more painful to witness the usually insipid Jeremy Northam get way too much screen time. Pass.",
         "Must admit that on balance I prefer my own reading of the play rather than this version. Wilde's humour seemed less than sparkling. Julianne Moore was OK as the scheming, obnoxious, red-haired Mrs Cheeveley but the rest of the cast seemed to have their minds elsewhere. The incidental music was especially annoying as was the angle Rupert Everett kept carrying his hand, flaring his nostrils would have been enough."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Arts Council of England",
         "Canal+",
         "Fragile Films"
      ],
      "summaries": [
         "Sir Robert Chiltern is a successful Government minister, well-off and with a loving wife. All this is threatened when Mrs Cheveley appears in London with damning evidence of a past misdeed. Sir Robert turns for help to his friend Lord Goring, an apparently idle philanderer and the despair of his father. Goring knows the lady of old, and, for him, takes the whole thing pretty seriously.",
         "Another of Wilde's social satires, 'An Ideal Husband' revolves around the lives of two men, successful political figure Sir Robert Chiltern and his friend the uninspired but utterly charming Lord Arthur Goring. Chiltern's life is perfect thanks to the help of his loving and brilliant wife Gerturde and the support of his quick witted sister Mabel. Goring's life is one of lounging, flirting with Mabel, and avoiding his father's instance that he should marry. The world of these men is turned upside down by the arrival of old acquaintance Mrs. Laura Cheveley who has come with blackmail in mind. Chiltern could lose everything including Gertrude. It is up to his wife and Goring to confront this dilemma, but it could risk Goring's chances to finally win over Mabel. As the comments and lies begin to fly about, it's revealed that the man thought to be perfect is flawed, the man with all the flaws must do something right, and the question remains: what makes an ideal husband?"
      ],
      "budget": 14000000
   },
   "movielensId": 2690,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-04-15",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Oliver Parker"],
      "runtime": 97,
      "movieId": 2690,
      "title": "An Ideal Husband",
      "mpaa": "PG-13",
      "actors": [
         "Cate Blanchett",
         "Minnie Driver",
         "Rupert Everett",
         "Julianne Moore",
         "Jeremy Northam",
         "Peter Vaughan",
         "Ben Pullen",
         "Marsha Fitzalan",
         "Lindsay Duncan",
         "John Wood",
         "Simon Russell Beale",
         "Charles Edwards",
         "Oliver Ford Davies",
         "Susannah Wise"
      ],
      "imdbMovieId": "0122541",
      "originalTitle": "An Ideal Husband",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["ST4ne1nVK0w"],
      "plotSummary": "Sir Robert Chiltern is a successful Government minister, well-off and with a loving wife. All this is threatened when Mrs Cheveley appears in London with damning evidence of a past misdeed. Sir Robert turns for help to his friend Lord Goring, an apparently idle philanderer and the despair of his father. Goring knows the lady of old, and, for him, takes the whole thing pretty seriously.",
      "tmdbMovieId": 24137,
      "avgRating": 3.74269,
      "releaseYear": "1999",
      "numRatings": 3113,
      "posterPath": "/5EaU1ttO7C8wmLpmdRHRthKcgxq.jpg"
   }
}