{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "pop culture",
            "id": 1740
         },
         {
            "name": "fan culture",
            "id": 9818
         },
         {
            "name": "documentary",
            "id": 10073
         },
         {
            "name": "science fiction",
            "id": 10568
         },
         {
            "name": "space opera",
            "id": 161176
         },
         {
            "name": "fan convention",
            "id": 208663
         },
         {
            "name": "fandom",
            "id": 220266
         }
      ],
      "imdb_id": "tt0120370",
      "video": false,
      "title": "Trekkies",
      "recommendations": [
         24703,
         276122,
         30168,
         16509,
         14641,
         113219,
         250577,
         21710,
         78083,
         45115,
         20468,
         36912,
         19433,
         52017,
         287940,
         63091,
         3149,
         89762,
         42284,
         90030
      ],
      "backdrop_path": "/5JqfbGd425PRS6BQ5MMfzT3g1Wy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe467e9251416c7507a077",
               "name": "Denise Crosby",
               "profile_path": "/swsAGvviqh4PfDzjKpnR8sd3rx2.jpg",
               "id": 1743,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe467e9251416c7507a07b",
               "name": "Barbara Adams",
               "profile_path": null,
               "id": 91375,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe467e9251416c7507a07f",
               "name": "Majel Barrett",
               "profile_path": "/6esZeIlIdrCnoGkAggRAJ8FWs7Z.jpg",
               "id": 1755,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a083",
               "name": "James Doohan",
               "profile_path": "/um8EusLMoUzId8mbfhIXx0J3M82.jpg",
               "id": 1751,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe467e9251416c7507a087",
               "name": "DeForest Kelley",
               "profile_path": "/fUL1BY8XjLsQihueDD1UUAm0Qy6.jpg",
               "id": 1750,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a08b",
               "name": "Leonard Nimoy",
               "profile_path": "/rTQulQ5WMehA3SSBnGTmayTsF0m.jpg",
               "id": 1749,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a08f",
               "name": "Michael Dorn",
               "profile_path": "/d89cHhByE4kpzQcUB7z51YV3EjA.jpg",
               "id": 2391,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a093",
               "name": "LeVar Burton",
               "profile_path": "/C3Jj0fNoPxZXDyDapm8lHyUh7o.jpg",
               "id": 2390,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a097",
               "name": "William Shatner",
               "profile_path": "/4byp8PsbRkC3UQVuvMAh4bcj7E2.jpg",
               "id": 1748,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a09b",
               "name": "George Takei",
               "profile_path": "/5eBSvAPy6DnWsMX61IlJyjUzCRJ.jpg",
               "id": 1752,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a09f",
               "name": "Wil Wheaton",
               "profile_path": "/1lrCjrsazL3O82DsP7ICfMHWJTU.jpg",
               "id": 3033,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe467e9251416c7507a0a9",
               "name": "Brent Spiner",
               "profile_path": "/gYaOWwycKcSEPQzUOITt9DA5AcY.jpg",
               "id": 1213786,
               "order": 11
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe467e9251416c7507a0a5",
            "name": "Roger Nygard",
            "profile_path": null,
            "id": 63983,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 2.029679,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 15800,
      "vote_count": 24,
      "budget": 0,
      "overview": "A hilarious look at the universe's most fervent fans.",
      "similar": [
         81899,
         142988,
         75311,
         24703,
         91356,
         55194,
         187808,
         34126,
         305346,
         87520,
         35028,
         148453,
         13532,
         258837,
         251471,
         77597,
         278468,
         160220,
         256315,
         94761
      ],
      "original_title": "Trekkies",
      "runtime": 86,
      "poster_path": "/bXfxkQnoq9xDegq7dmJpJXSMRYf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1997-10-18",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Trekkies Collection",
         "id": 509686,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Roger Nygard"],
      "runtime": 86,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120370/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc0NjU1NzI0OV5BMl5BanBnXkFtZTcwOTIwMzMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Denise Crosby, Frank D'Amico, Barbara Adams | See full cast and crew »"],
      "reviews": [
         "Trekkies IS a very funny movie, whether you are a Star Trek fan or not. It shows a wide variety of fans in a variety of situations, and there are no voice-overs to tell you how to feel about the characters presented. I notice that one prominent review is as horrified by Trekkies as one might be if one found a dead prostitute in their father's closet. The filmmakers may have been laughing at the people on the screen, but they weren't making fun of them. They were merely filming them. If I get in front of a camera and walk blindly into traffic, is it the fault of the person behind the camera if I get run over? No, because I would have been fully aware of my actions. So are the fans presented in Star Trek. Trekkies won't make a non-fan like ST, nor will it make a rabid fan feel as though they've wasted their lives. This is a slice-of-life documentary. If you feel, like some people who have \"tsk-tsked\" this movie, that the filmmakers should be ashamed of themselves, I would contend that you protest too much; could it be that you pity the fans on the screen, yet find yourself compelled to laugh at them? Such a conflict may well cause you to feel shame, and you would naturally project that outrage onto the film itself. But documentaries, by definition, can only \"tell\" you so much. It's up to the viewer to evaluate the material; blaming the filmmakers for a poor interpretation is ridiculous. These people ARE laughable. But so am I, sometimes. It's okay, because I don't take myself too seriously. And these fans take their hobby very seriously, but many, like the dentists, are aware that ST is a very geeky hobby. And no matter how many times I see James Doohan describe his encounters with the woman who wrote him those fan letters, I break down completely. How is that bad? How have the filmmakers presented him in a bad light? I can't say for sure, but I believe the filmmakers ARE fans of ST, and I believe that they're aware of the absurd lengths to which some ST fans will go (paying $1500 for a piece of latex, drinking a sick man's water). So what? It's entertainment. And if you can't laugh at yourself, who can you laugh at? (But that smarmy 14-year-old with the mullet still needs to be slapped....)",
         "I've read many reviews before I actually saw Trekkies and I must admit that I was pleasingly surprised! It isn't as bad as many people want to make you believe... actually I find it very interesting and entertaining. True, there are some really weird people in it, but weird also means NOT boring. And I don't mean only in the film, I also mean in live! I think, only StarTrek fans who take themselves too much serious, believe that the people who are shown in Trekkies were portrayed as freaks. I agree that they picked up some real extreme examples of StarTrek fandom, but as mentioned by Peanuthead before, that's what makes the film so interesting: \"It's capacity to make you think!\" And anybody who thinks that they better had shown some \"cooler\" fans is missing the point! StarTrek fandom isn't about being cool or stylish, it's about enthusiasm, about devotion and about being what you want to be. It's about being yourself and enjoying it, to stay to yourself and not denying what you are or what you love. Not every fan has to live it out like that, but everybody who wants to, is free to do! Sometimes people actually want to be different, not necessarily to be someone special, just to be not like everyone else... Sometimes this can cause extreme examples, but think about it, where does the term \"fan\" come from? ...right, it's the short form of fanatic! (And that's not necessarily always a negative term.) At one or two occasions of the film I had to bear in mind the StarTrek/X-Men-Crossover-Novel \"Planet X\", where the character Archangel is pushing it over the edge with Captain Picard to test this unknown community of the future, which claims itself to be so liberal and tolerant... Think about it and you probably think about yourself. Greetings LoganSan P.S.: Don't mind my bad English... :)",
         "Finally, something new and fresh. This documentary needed to be made. It's very funny, scary, weird, touching and always interesting. Although the pace drags at times, it's entertaining and *gasp!* educational. I'm no trekkie, I do enjoy the movies though. Although I can't relate to the trekkies featured here, one can't help but admire their devotion. Oh sure, we laugh when we see some klingon's going to a fast food restaurant, get a tad freaked out by a transvesite in a Starfleet uniform, and shake our heads at \"Spinerfems\". But guess what, they aren't hurting anybody! In fact, from what I saw, local Trekkie chapters do a lot of good for their community. Klingons even visit children's hospitals! Is it weird to see someone in public wearing a phaser and a star fleet uniform? Yes, to so-called 'normal' people. Yet it's considered perfectly acceptable for an armchair jock to wear major-league baseball caps and jerseys of their favorite players in public. Hey, if a trekkie married couple has a succesful dental practice, do they need to \"get a life\"? Maybe the guy who spends his Sundays at the bar watching football all day needs to get one. Hey, I laughed at it most of the time. I admit it. The candid interviews of some of the ex-cast members are a riot! And near the end of the video, there was one interview with a Radio-Shack-Trekkie (the worst kind, I think) where I could not stop laughing. I mean it, he was such a GEEK. But then, this guy has invented something useful, I haven't. There you go.",
         "When my friend and I rented this movie, we sat down with the intent that it was going to make fun of trekkies. But after watching it, my opinion actually changed about them. And for the better. This movie not only shows the fans, but it talks about the culture itself. I ended up actually respecting the Gene Roddenberry trekkies because Roddenberry wanted an upbeat future. Something where humanity was actually better over all. And the fans that followed his idea are very friendly and accepting. Even the ones that emulate the war like Klingons are still a lot more friendly than other sci fi fans you will meet. I'm not saying all of the fans are like this. I've met some of the more egotistical ones, but that is mainly on the inet where you have a tendency to run into people that have very little social skills. But the people in this movie are actually quite normal! As for the movie, Denise Crosby does a great job as both host and interviewer. She asked questions in a non-biased way, which is the most we could want in a reporter. I liked Star Trek: The Next Generation but not the other series in the franchise so I wouldn't call myself a trekkie. I never went to a convention and don't plan on ever. So this movie was an eye opener. I'll deal with theses Roddenberry fans over any other TV show fanatics any day of the week. In fact, I'll take these fans over sports fans as well. Trek may be dorkie, but I never heard of a trekkie booing the first black Star Trek actor like Philly fans did to Jackie Robinson in baseball. Oh, and as a side note. During the Klingon language class scene, my friend and I had to stop the tape and rewind to watch it again. The one woman in the class was hot. We were dumbstruck by the fact that an attractive female was trying to learn Klingon :P",
         "I am not a fan of Star Trek, but I thought this movie was hilarious, and very well made. I never realized how much Star Trek fans loved that show. Some wear Star Trek uniforms to work. Some wear \"phasers\" every day. Some are fluent in Klingon. There's a full translation of Hamlet in Klingon language. A dentist has outfitted his entire office as if it were aboard the Enterprise. Who knew? This is wacky and funny. Trekkies doesn't relentlessly mock its subjects, but shows them sympathetically. Still, it's hilarious. I recommend it to anyone at all familiar with Star Trek. It is NOT only for Star Trek fans.",
         "I thought the storytelling in this doc. was incredible. Never does the narration, the interviewing, or the framing poke fun at the bizarre, unconventional -- you know, I'm not even sure what other word works to describe these people -- fans who have made incredible adjustments in their lives in order to pay homage to Star Trek. Yes, they are strange. Yes, they seem to sometimes proclaim the supremacy of Star Trek with a vehemence that only suggests the alternative is enough to topple their worlds. But at the same time, this film, I think, takes a gentle, even respectful look at their strange personal universes. If you want to laugh, that is your prerogative. But I think this doc. is motivated more by fascination than by indignation or disgust. Trekkies (and Trekkers) are a cultural phenomenon. One that deserves the care and depth used in the presentation of this documentary.",
         "The execution of a movie that HAD to happen could of so easily misfired. Thankfully, its execution was pretty good. Somewhat respectful of the series and the fans, it doesn't shy away from the kooks. Watchable by Trekkie, Trekker, or civilian was a tough trick to pull off. Granted, it is difficult to feel the tone of the movie at times. Maybe because the movie itself never knows what it wants to be. I guess the big cause of the identity crisis is Denise Crosby. Possibly I am just jealous seeing someone who CAN have her cake AND eat it too. Making money while making fun of the fools giving her loot AT THE SAME TIME would make any producer or director schizophrenic. It sure filled me with awe and envy. She should get into politics were such defects of character would be an absolute boon. Oddly enough, that does not take away from the movie. Out of all the cast members, Brett Spiner comes across as the most 'down to earth' (pun intended) and likable. I sure hope the crazy red- head never tries anything BAD. George Takei is always gracious and unflappable, even on the Howard Stern show. But what about the titular \"Trekkies\"? Fear not. Barbara Adams, the transvestite, and the mullet- kid using the biggest words he can think of are a blast to watch. The prize for most irritating is a three way tie between the smarmy jerk who allegedly created the Klingon language, the goofs who actually attend a Klingon language workshop, and the group of 'Klingons' featured in the film. A scene where I suppose they are supposed to be intimidating is so bad, it is embarrassing. Get real, wannabe toughs. They make Paul Lynde seem downright tough. Too bad, the Klingons of both series are pretty interesting. 2nd place goes to the cat who plays \"Q\". He does not come off as particularly likable or even moderately talented. Speaking of minuscule talent, the radio morning show guys were a living parody. The machine on the Simpsons could easily replace that duo. Finally, to the stooge who purchased the \"Q\" virus*, hangovers are not communicable. It is hard to determine who deserves more contempt. The huckster who put it up for sale, or the unnamed, & thankfully unknown moron* who bought it? If you watch it, that statement will make sense. BY ALL MEANS, check out \"Trekkies\". Before the haters start dogging this review, I watched ST:TOS in 1974. As an 12 year old paperboy I had to buy a 13\" b&w because the reruns were on the same time as the news. And ST:TNG was about the ONLY thing worth watching on SPIKE-TV. There are so many things that could of been dropped, especially Janeway interviews and 60% of the alleged fans. *You know who you are, doofus. PS James Doohan lost his finger on D-day. The dentist and Denise's joking about it is aggravating to this veteran. Gardening accident? ggrrrr",
         "As I sat reading the other reviews about this film it occurred to me how much it is a case study in human perception. Everyone who sees this film will view the same material, but they will all see it differently. Some viewers feel that the people who where shown in the film where exploited and I can see there point. Some of the people shown in the film do come off as weirdoes, oddballs, and nut cases, but I don't feel that is necessarily the film makers fault. Some of these people may really be weirdoes, oddballs, and nut cases. That is why I say the film is a study in perception. For every person who thinks the people shown in the film are crazy, there is another who feels that they are perfectly normal. The film presents these people as they are and lets you decide whether or not they are abnormal in their love of Star Trek. After having seen the film a few times myself I am still trying to figure it out myself. Although I do think some of these people cross the line from fandom to insanity, I can't tell you who does and who doesn't. That is what makes the film so interesting. It's capacity to make you think. As a Star Trek fan myself it made me look at my collection of Star Trek action figures and wonder \"How far am I from the guy who wants Spock ears implanted in his skull?\" So whether the people in this film make you laugh, think, or just give you the creeps you must admire there passion for Star Trek and there willingness to share that passion. In a world where there are so many violent things people can be passionate about, being passionate about Star Trek is a pretty benign thing. So as far as I am concerned this is a solid film, that gets 6 out of 10 stars from me. \"Live Long and Prosper\".",
         "I've known a number of sci-fi geeks over the years, and it is fascinating to see a whole movie about them. I've never been able to develop that sort of all-encompassing passion for anything, be in the New York Mets or The Grateful Dead, but it's fascinating to see what this obsessiveness produces. I think Trekkies and sci-fi fans in general consist of people who have been pushed so far out of mainstream society - these are almost invariably the people (like me) who were tortured and marginalized growing up - that they have an almost insane attracting to alternate societies. So they go to sci-fi conventions, joining the Society for Creative Anachronisms (you'll also find that there is a major overlap between fans of Lord of the Rings and Star Trek with people who are into S&M or polyamourous relationships. I wish someone would make a documentary about the whole alternate geek lifestyle thing). Anyway, this movie is very funny and covers a lot of ground in a pleasantly chaotic fashion, jumping from merchandising to fan fiction to people making it through hard times via their obsession with the show. It is very much worth watching.",
         "A documentary for Trekkies, made by Trekkies, about Trekkies. Trekkies are Star Trek fans, usually very obsessed fans (there is a brief segment on the debate between what are 'Trekkies' and 'Trekkers', but no conclusions are reached). The film, hosted by Crosby (who played Tasha Yar on the Next Generation TV series), who's also a producer, focuses on the whole gamut of far-flung Trek fans, including, famously, the juror who showed up in Trek uniform, and the dentist who converted his office into a Trek starbase. Then there's the guy who recreated a motorized life-support chair (from an early classic Trek episode) and rides around in it on his town's streets, only his head visible poking up from the top. Most of the fans come across as harmless eccentrics who are actually fairly intelligent (the one exception is a guy who, for some reason, seems to be wearing a female wig and lipstick - kinda creepy - I think he thinks he's Troi of the TNG series). The central message conveyed is a hope for a better future, without prejudices or other social problems. It that sense, these fans are, indeed, more advanced than the average citizen, who is still stuck with the 20th-century's petty squabbling and short-sightedness. There are also short interviews with several of the classic and Next Generation cast members,including (poignantly) DeForest Kelley, who died in '99, and Leonard Nimoy(Spock), Jimmy Doohan(Scotty), Walter Koenig(Chekov), Nichelle Nichols(Uhura), Brent Spiner(Data), Michael Dorn(Worf), Jonathan Frakes(Riker) and Kate Mulgrew(Capt.Janeway). Some relate very touching stories about how the show literally changed someone's life for the better, including a suicide prevention by Doohan, who died recently. It also touches briefly on the fringe element of Trek worship, the pornographic fantasy trade. The end credits contain clips from some stand-up comics doing Trek jokes, which are pretty funny. All in all, pretty comprehensive; it just fails to wrap it all up smoothly and almost seems to end with an unspoken question. Hm, but there was a sequel last year."
      ],
      "genres": ["Documentary"],
      "productionCompanies": ["NEO Motion Pictures"],
      "summaries": [
         "From a television series that barely lasted three seasons in the 1960s, Star Trek has grown into a multibillion-dollar industry involving several spin-off series, numerous movies, and countless merchandise items. This phenomenon is due to the series' legions of rabidly devoted fans, popularly known as \"Trekkies\". Star Trek actress Denise Crosby provides an affectionate and humorous look at some of these people, who demonstrate how Star Trek has affected and even shaped their lives. Several members of the series' cast and creative team also describe what the series and its fans mean to them.",
         "Get ready to beam up to a galaxy where autograph hounds abound, dentists drill in Federation garb and the debate over \"Trekkies\" vs. \"Trekkers\" rages on. Denise Crosby of Star Trek: The Next Generation hosts this often-hilarious documentary about the Star Trek \"fan-nomenon\". Interviewing hundreds of devoted fans and such Star Trek cast members as Leonard Nimoy, DeForest Kelley, Nichelle Nichols, Walter Koenig, Kate Mulgrew and Brent Spiner, the film creates an entertaining and endearing portrait of the landmark series that has touched the lives of people around the world.",
         "Denice Crosby takes a first look at the huge fans of Star Trek and how the series from around America has affected and shaped their lives."
      ],
      "budget": 375000
   },
   "movielensId": 2693,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1997-10-18",
      "dvdReleaseDate": "1999-11-09",
      "directors": ["Roger Nygard"],
      "runtime": 86,
      "movieId": 2693,
      "title": "Trekkies",
      "mpaa": "PG",
      "actors": [
         "Denise Crosby",
         "Barbara Adams",
         "Majel Barrett",
         "James Doohan",
         "DeForest Kelley",
         "Leonard Nimoy",
         "Michael Dorn",
         "LeVar Burton",
         "William Shatner",
         "George Takei",
         "Wil Wheaton",
         "Brent Spiner"
      ],
      "imdbMovieId": "0120370",
      "originalTitle": "Trekkies",
      "genres": ["Documentary"],
      "youtubeTrailerIds": ["T3STZ1aLRO0"],
      "plotSummary": "A hilarious look at the universe's most fervent fans.",
      "tmdbMovieId": 15800,
      "avgRating": 3.64301,
      "releaseYear": "1997",
      "numRatings": 1909,
      "posterPath": "/bXfxkQnoq9xDegq7dmJpJXSMRYf.jpg"
   }
}