{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "fool",
            "id": 5090
         },
         {
            "name": "tax inspector",
            "id": 7851
         }
      ],
      "imdb_id": "tt0119038",
      "video": false,
      "title": "The Dinner Game",
      "recommendations": [
         14645,
         33701,
         11183,
         11687,
         15152,
         17350,
         21435,
         8265,
         2899,
         15097,
         8290,
         11479,
         10353,
         21778,
         15588,
         37653,
         13043,
         112198,
         11444,
         9317
      ],
      "backdrop_path": "/oEkMYIWyCB4jSA6LgSWTwZ30VUA.jpg",
      "revenue": 78599508,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Pierre Brochant",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4319",
               "name": "Thierry Lhermitte",
               "profile_path": "/eudPlDQKVfowLzxw0PzrxKagvru.jpg",
               "id": 21177,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "François Pignon",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b431d",
               "name": "Jacques Villeret",
               "profile_path": "/sUFW2BIZc4wUpfKWznbk8S9CKqN.jpg",
               "id": 35323,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Juste Leblanc",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4321",
               "name": "Francis Huster",
               "profile_path": "/vR8HqZw7rYoHf50kYkiF0n2U3r0.jpg",
               "id": 26887,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Lucien Cheval",
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4325",
               "name": "Daniel Prévost",
               "profile_path": "/sOtamnTQsNi3TL4P1c6WutjZOst.jpg",
               "id": 24832,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Christine",
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b4329",
               "name": "Alexandra Vandernoot",
               "profile_path": "/yqAN3NyIRLHIuB7aOhxEmN37Ovx.jpg",
               "id": 53425,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Marlène Sasseur",
               "gender": 1,
               "credit_id": "52fe44f5c3a36847f80b432d",
               "name": "Catherine Frot",
               "profile_path": "/18d10YaqZlGPzYjaUjMIiSMfs8E.jpg",
               "id": 20080,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Jean Cordier",
               "gender": 0,
               "credit_id": "52fe44f5c3a36847f80b4331",
               "name": "Edgar Givry",
               "profile_path": "/cziKgVgRDOcKvI5dPhIY4AMcJ8Z.jpg",
               "id": 53201,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Dr Sorbier",
               "gender": 0,
               "credit_id": "52fe44f5c3a36847f80b4335",
               "name": "Christian Pereira",
               "profile_path": "/VX3SUrKER5Gbl1mBvIfxAd90yb.jpg",
               "id": 145738,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Host 1",
               "gender": 0,
               "credit_id": "549aaa87c3a3682f21001769",
               "name": "Benoît Bellal",
               "profile_path": null,
               "id": 1403436,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Host 3",
               "gender": 0,
               "credit_id": "549aaaac925141312600178d",
               "name": "Jacques Bleu",
               "profile_path": null,
               "id": 1403437,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Tanner (boomerang thrower)",
               "gender": 2,
               "credit_id": "549aaad1925141312c0014e3",
               "name": "Philippe Brigaud",
               "profile_path": "/53XO45oLt2hn3g7Wz6CQSYlB4tW.jpg",
               "id": 145197,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Guest 1",
               "gender": 0,
               "credit_id": "549aaaed925141312f0018e3",
               "name": "Michel Caccia",
               "profile_path": "/jkwB8gNP4nCO30YleMCi6izsjL2.jpg",
               "id": 146640,
               "order": 11
            },
            {
               "cast_id": 21,
               "character": "Louisette Blond, la collègue de François",
               "gender": 0,
               "credit_id": "5921aece9251414ab1057ac4",
               "name": "Pétronille Moss",
               "profile_path": "/wpL6SAU5YdfHxfcWyNiQq4bVrkp.jpg",
               "id": 1429797,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b42f7",
               "name": "Francis Veber",
               "profile_path": "/hEeR4kyKecepNaEb4sdK0pAQKzf.jpg",
               "id": 38507,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b42fd",
               "name": "Francis Veber",
               "profile_path": "/hEeR4kyKecepNaEb4sdK0pAQKzf.jpg",
               "id": 38507,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f5c3a36847f80b4303",
               "name": "Alain Poiré",
               "profile_path": null,
               "id": 1962,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b4309",
               "name": "Luciano Tovoli",
               "profile_path": null,
               "id": 49069,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44f5c3a36847f80b430f",
               "name": "Vladimir Cosma",
               "profile_path": "/ikwjkuMpSWcIwZPUt7u0lsVyUuA.jpg",
               "id": 1965,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44f5c3a36847f80b4315",
               "name": "Georges Klotz",
               "profile_path": null,
               "id": 24723,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 8.859685,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 9421,
      "vote_count": 527,
      "budget": 12500000,
      "overview": "Each week, Pierre and his friends organize what is called as \"un dîner de cons\". Everyone brings the dumbest guy he could find as a guest. Pierre thinks his champ -François Pignon- will steal the show.",
      "similar": [
         10545,
         11846,
         10628,
         11718,
         12770,
         12776,
         8056,
         283701,
         11839,
         59050,
         42254,
         224569,
         61643,
         6979,
         8417,
         263964,
         265966,
         43110,
         13174,
         262900
      ],
      "original_title": "Le Dîner de cons",
      "runtime": 80,
      "poster_path": "/n57PfOOjoAzBBGJ87QJNkO40YzE.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": "/weCaiLyIQXuN7T5SH7zQEjQgUFs.png",
            "name": "Gaumont",
            "id": 9,
            "origin_country": "FR"
         },
         {
            "logo_path": null,
            "name": "EFVE",
            "id": 11037,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TF1 Films Production",
            "id": 3823,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TPS Cinéma",
            "id": 884,
            "origin_country": ""
         }
      ],
      "release_date": "1998-04-15",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": "FRF ",
      "directors": ["Francis Veber"],
      "runtime": 80,
      "synopsis": "The Dinner Game, or Le diner de cons, follows the efforts of a group of judgmental businessmen to find the most dense, strange, idiotic people imaginable to invite to a secretly competitive dinner datea date in which they will be asked to talk about themselves and their hobbies. This occasion isnt meant to be informative or charming; mean spirit and black comedy drive this social manipulation forward. Hilarity ensues when Monsieur Brochant is tipped off to a particularly eccentric matchstick artist, the bumbling but good-natured Pignon. Excited and naïve, Pignon is hoodwinked into joining the dinner gamethe promise of a book deal on his matchstick models is offered as baitbut when Brochant throws his back out the buffoon arrives, becoming the sole caregiver to the incapacitated would-be predator. In Pignons incompetent care Brochant is hurt, over and over again, physically, romantically, and emotionallyan ironic twist in the fact that he was supposed to be the one dishing out the pain. With a wrecked romantic life, a luxurious apartment up for unintentional audit, a hurt back, and an irate disposition, Brochants life cant seem to get any worstuntil he hears word his wife was in an accident. This unfortunate situation presents him with a final attempt to reconcile with his wife, though she wont take his calls. In desperation he enlists the divorced Pignon to share his true story of betrayal, heartache, loss, and depression with Mrs. Brochantan act that nearly succeeds, but like most things with Pignon, are obliviously unintentionally foiled.",
      "writers": ["Francis Veber"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0119038/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM5NTQ2MjkwOV5BMl5BanBnXkFtZTcwNzM2NjcxMQ@@._V1._CR0,1,299,427_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Thierry Lhermitte, Jacques Villeret, Francis Huster | See full cast and crew »"],
      "reviews": [
         "This is a very intelligent, hilarious, and slightly poignant movie. The 'dinner' of the title is a regular gathering at which some smug young Parisian gentlemen compete to invite the most amusingly ridiculous character as their guest. Pierre Brochant (Thierry Lhermitte) believes he has a sure winner in François Pignon (played brilliantly by Jacques Villeret) whose passion is the construction of intricate models from matchsticks. Ironically, it is Brochant who ends up looking the fool, morally if not intellectually. And it is the slightly sad but hilarious antihero Pignon who emerges as far the wiser of the two. Despite the premise, which seems to offends some delicate souls, this is a very humane, as well as witty, movie.",
         "This movie is really incredible. I laughed from the beginning to the end. I watched it in french and i dont know if it has been translated, but if you know french, you must go watch this movie. It contains so many jokes and crazy situations that nobody would like to be in. The actors are great and the \"con\" looks like a real one ;) FUNNY FUNNY FUNNY, if you want to laugh all the night go see this!! this is not only a recommendation, this is almost an order!",
         "A group of well-to-do snobbish and obnoxious professionals have dinner parties every Wednesday to which each of them is required to bring an \"idiot\" as a guest. The victims have no idea that they are invited merely to be humiliated and their boorish \"sponsors\" compare their notes later to determine whose \"idiot\" was the best. Pierre Brochant( Thierry Lhermitte), the smug publisher thinks that he's got a winner in the tax accountant François Pignon (Jacques Villeret, sadly passed away in January 2005 - great French Comedian whose performance in \"Robert and Robert\" I enjoyed very much) who reproduces the famous landmarks with the matchsticks and would talk about them with never ending enthusiasm. Unfortunately for Pierre (but fortunately for us, the viewers) he throws his back just before the dinner and has to rely to Pignon's sincere generosity. The tables are turned and look who is an idiot after all... With the modest running time of 80 minutes, the \"Dinner Game\" is a delightful and very funny comedy. I would not expect anything else from Francis Veber, the director of Le Jouet, (1976) aka The Toy , La Chèvre, (1981) aka Knock On Wood, Les Compères, (1983) ... aka ComDads, and Les Fugitifs, (1986) and the writer for Le Grand blond avec une chaussure noire, (1972) ... aka The Tall Blond Man with One Black Shoe.",
         "\"Le dîner de cons (Dinner Game)\" is one of the funniest movies I have ever seen. I have been watching it for more than twenty (20) times, and every time I could capture new details and see it under new angles, making me laugh again and again. Jacques Villeret (aka Francois Pignon) and Thierry Lhermitte (aka Pierre Brochant) both play great roles and I particularly liked a couple of scenes (plus many others): 1) where Francois Pignon has been asked to call Just Leblanc and received very confusing explanation from Pierre Brochant about how someone's name could be \"just\" Leblanc and 2) of course the phone discussion itself where finally Francois Pignon makes a movie production deal with Just Leblanc, but eventually forgot to mention Pierre's wife... Lots of hilarious situations and true overall Chef d'Oeuvre!",
         "\"Le Diner de Cons\" is one of those great comedies that the French know really well how to produce: The action is fast, the scenes are hilarious, and the viewer just can't stop laughing as totally extraordinary things happen in totally ordinary circumstances. The mastery in this type of films is that they need not be big-budget productions (\"LDdC\" has been actually shot mostly inside a single apartment), while they manage to achieve a very high rating for their impeccable viewing pleasure they bring to us. \"LDdC\" is about a group of rather cruel friends, who have fun by organizing dinners in which they invite idiots and get amused by them. The winner is the one who will bring the biggest idiot, and Pierre (Lhermitte) thinks he was found the world champion in the face of Francois Pignon (Villeret). He therefore decides to invite him in his house for a drink, and then take him to the dinner. However, things do not go as planned, as during Pignot's stay in Pierre's house unbelievable things begin to happen... Villeret is simply amazing in his role as Pignon, standing above everyone else in this film. This should not mean that the other performances are not good, however: In fact, everyone does a good job, despite the fact that most actors perform very short appearances. \"LDdC\" is a movie that will make you laugh, but in fact, it will also make you think; behind the fun, the film conveys a very humane and meaningful message. Don't miss it! 9/10.",
         "The wealthy editor Pierre Brochant (Thierry Lhemitte) and his friends have a competition: every Wednesday, each one of them invites the dumbest jackass he can find for a dinner, where each one of the guests is invited to talk about himself as much as possible. Later, after the guests say goodbye, the group of friends makes fun and elects the more stupid and imbecile guest. Pierre invites François Pignon (Jacques Villeret), a man that works in the Internal Revenue Service (IRS) and makes \"maquettes\" of matches to forget his beloved wife, who had went away with a friend of him two years ago, for the dinner. However, a tough pain in one vertebra of his spinal column does not allow Pierre to meet his friends for the game and he stays alone with solicitous, but clumsy and stupid François in his apartment. Every attempt of François helping Pierre goes wrong, becoming the night of Pierre a terrible nightmare. \"Le Diner de Cons\" is a witty theatrical movie, practically set in the room of an apartment. However, on the contrary of what a reader may think, it is one of the best comedies I have ever seen, and I do not recall the last time I have laughed this way. The work of Jacques Villeret as an authentic jackass, with a stupid grin and trying to help Pierre, is amazing. The dialogs and situations are very intelligent and hilarious. I highly recommend this film, awarded with three \"César\" and two \"Lumiere Award\", for one of those days when the viewer is upset or stressed, for a perfect relaxation. My vote is eight. Title (Brazil): \"O Jantar dos Malas\" (\"The Dinner of the Jackasses\")",
         "I'll keep it short and sweet. This movie was hilarious - even if you've never watched a French movie in your life, this is one of the quirkiest movies you'll ever see. I was laughing the entire time. The acting was good and the directing average. But the writing and screenplay were absolutely fantastic. You don't need to know French to watch it as long as you can get your hands on a copy with subtitles. Many foreign movies require you pay attention to the imagery, etc., thus making it hard for those needing subtitles. In this one the script carries the movie. I watched Le Diner de cons about 5 or 6 years ago, and it definitely sparked my interest in foreign movies 10/10",
         "Before this film was released in 1998, it was, originally, a play. This play was performed on stage in 1993 and had a huge success. Francis Weber felt like adapting his play (he was the author) for the screen and he had a good idea. The action takes place in a beautiful Parisian flat. Pierre Brochant (Thierry Lhermitte) lives there and each week, he and his friends take part in a special dinner: a \"dîner de cons\". They've got to invite someone silly and the one who has found the best dumb is the winner of the evening. Brochant has chosen François Pignon (Jacques Villeret) and before going to the dinner, Brochant has invited him in his flat. Then, in a few minutes, everything's wrong: his wife's leaving him, he's got a backache, he's got to face his mistress etc.... and Pignon is a bit responsible for this! There are two main types of comic in this film: on one hand the comic comes from the dialogues which are very funny with a lot of successful puns. Moreover they're never vulgar. On the other hand, the comic comes from the situation where Brochant is: not only has he got to face Pignon but he's got to face unexpected events like the arrival of a fiscal inspector (Daniel Prévost). Above all, the film is worth watching for its incredible main actors: Lhermitte who is the perfect hypocrite and Villeret who is full of goodwill and kindness in spite of its idiocy and its naivety (in 1999, he won the Oscar for the best actor in France and he deserved it). Moreover, the other actors are very well used, especially Francis Huster and Daniel Prévost who are both excellent. The only weaknesses of this film are the moment where Prévost comes in Brochant's flat and then the plot is resolved very laboriously. The other moment is when Pignon is calling Mrs Brochant to tell her his real thoughts about her husband: you've got a quite conventional dialogue. Nevertheless, if you want to have a good time, watch this comedy it's worth watching!",
         "Pierre Brochant and his friends have a weekly dinner party where each invites an idiot they meet to attend. They then let the `idiots' talk and laugh at them - each week the winner is the one who brings the biggest idiot. However this week Brochant's idiot, François Pignon arrives at his house to find that he has injured his back and cannot go. About to leave, Pignon stops when the answer-phone reveals a message that Brochant's wife is leaving him. He tries to help the situation and Brochant sort of needs him to, but he can't help but make things a little worse every time. The premise of this film made it sound like it was set at the dinner party of the title and it put me of a little as I didn't like the cruel sound of it. However the actual plot occurs in Brochant's flat, but it does still have a cruel streak that is a little unpleasant. Because Pignon is such a nice little man it is hard to see him so openly reviled and mocked by Brochant, I know the plot requires it but it was done with more than a little malice and at times left a bitter taste in the mouth. However, for the majority the film is actually very funny in a slight way. The laughs generally come from buffoonery from Pignon at Brochant's expense! The plot does turn around to be one of lessons towards the end which is good, and the story does have a good message of acceptance through it. The actors do pretty well with their broad characters, although they are allowed a little expansion towards the end of the film. Lhermitte's cold hearted bastard is a little to hard and cruel without enough in the way of being judged by the film. Villeret makes the film and perfectly makes Pignon a likeable and warm little fellow but still undeniably makes him the type of person who you would cross the road to avoid. The beauty of this is that, when Brochant learns his lesson, we as the audience also learn something too. Support roles are good but this film is mostly a double-hander which the two leads carry well. Light and funny despite the slightly cruel nature of the plot, this film is well worth a watch. The humour is very much situation based and relies on plot devices to move it on, but it's quite fresh and amusing and makes for an enjoyable 90 minutes.",
         "«Le dîner de cons» is one of the best film by Francis Veber. Funny, witty and intelligent, the movie tells the story of a group of men who are playing a strange game. The winner is the one who can find the perfect «con», the king of idiots! From beginning to end, this movie makes you laugh. Excellent performances by Thierry Lhermitte (one of the top French actor today) and Jacques Villeret. Watch it again, you'll laugh more than the first time! 7 out of 10."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Gaumont",
         "EFVE",
         "TF1 Films Production"
      ],
      "summaries": [
         "Each week, Pierre and his friends organize what is called as \"un dîner de cons\". Everyone brings the dumbest guy he could find as a guest. Pierre thinks his champ -François Pignon- will steal the show.",
         "The wealthy editor Pierre Brochant and his friends have a competition: every Wednesday, each one of them invites the dumbest jackass he can find for a dinner, where each one of the guests is invited to talk about himself as much as possible. Later, after the guests say goodbye, the group of friends makes fun and elects the more stupid and imbecile guest. Pierre invites François Pignon, a man that works in the Internal Revenue Service (IRS) and makes \"maquettes\" to forget his beloved wife, who had went away with a friend of him two years ago, for the dinner. However, a tough pain in one vertebra of his spinal column does not allow Pierre to meet his friends for the game and he stays alone with solicitous, but clumsy and stupid François in his apartment. Every attempt of François helping Pierre goes wrong, becoming the night of Pierre a terrible nightmare.",
         "Every wednesday night a few guys have a meal together. There is a game coupled with the meal: each one of them has to bring an \"idiot\". The game consists in making the idiots talk about there ideas and passions so that the hosts can have a good laugh. At the end they will choose the \"idiot of the evening\". One of the hosts has invited his idiot home so they could go to the dinner together, but unfortunately he gets a severe pain in his back due to an accident that day and can't go to the \"meal of idiots\". Even worse is the fact that the idiot tries to help him all the time, and naturally does everything wrong and aggravates every situation."
      ],
      "budget": 82000000
   },
   "movielensId": 2696,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-04-15",
      "dvdReleaseDate": "2000-04-28",
      "directors": ["Francis Veber"],
      "runtime": 80,
      "movieId": 2696,
      "title": "The Dinner Game",
      "mpaa": "",
      "actors": [
         "Thierry Lhermitte",
         "Jacques Villeret",
         "Francis Huster",
         "Daniel Prévost",
         "Alexandra Vandernoot",
         "Catherine Frot",
         "Edgar Givry",
         "Christian Pereira",
         "Benoît Bellal",
         "Jacques Bleu",
         "Philippe Brigaud",
         "Michel Caccia",
         "Pétronille Moss"
      ],
      "imdbMovieId": "0119038",
      "originalTitle": "Le Dîner de cons",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["4KazXRcB3uU"],
      "plotSummary": "Each week, Pierre and his friends organize what is called as \"un dîner de cons\". Everyone brings the dumbest guy he could find as a guest. Pierre thinks his champ -François Pignon- will steal the show.",
      "tmdbMovieId": 9421,
      "avgRating": 3.82093,
      "releaseYear": "1998",
      "numRatings": 1438,
      "posterPath": "/n57PfOOjoAzBBGJ87QJNkO40YzE.jpg"
   }
}