{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0149964",
      "video": false,
      "title": "Broken Vessels",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe4ac0c3a368484e16514b",
               "name": "Todd Field",
               "profile_path": "/34lDArSwBjHFXIfYnLQZWKTTab3.jpg",
               "id": 5010,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe4ac0c3a368484e16514f",
               "name": "Jason London",
               "profile_path": "/z4eSvvH51WsZppswHVHcqFJJm6L.jpg",
               "id": 52474,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Elizabeth",
               "gender": 1,
               "credit_id": "52fe4ac0c3a368484e165153",
               "name": "Roxana Zal",
               "profile_path": "/1vyPjvwNR9al6c8PzcisFWhJSj.jpg",
               "id": 112693,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Susy",
               "gender": 1,
               "credit_id": "52fe4ac0c3a368484e165157",
               "name": "Susan Traylor",
               "profile_path": "/A3ZpoAui1ure4Nx2b83wUMI8lvv.jpg",
               "id": 4158,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Mr. Chen",
               "gender": 2,
               "credit_id": "57f348c39251410c25006a89",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Gramps",
               "gender": 2,
               "credit_id": "57f348cd9251410c25006a8f",
               "name": "Patrick Cranshaw",
               "profile_path": "/onUKpczej5fMG84mLs3aLgQAnDJ.jpg",
               "id": 58513,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jed",
               "gender": 2,
               "credit_id": "57f348d6c3a368333a005eee",
               "name": "Brent David Fraser",
               "profile_path": null,
               "id": 42140,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Jill",
               "gender": 0,
               "credit_id": "57f348e3c3a368333f005f9f",
               "name": "Stephanie Feury",
               "profile_path": null,
               "id": 1688899,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Bo",
               "gender": 2,
               "credit_id": "57f348f29251410c28006bf8",
               "name": "William Smith",
               "profile_path": "/rlO5RpMwYgyLmD9QsePedpsS8Dq.jpg",
               "id": 98102,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Ginger (as Charley Spradling)",
               "gender": 1,
               "credit_id": "57f348ffc3a368333a005f02",
               "name": "Charlie Spradling",
               "profile_path": "/siWhm3sZFFpSyFPwpn0DostNhka.jpg",
               "id": 147396,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Karen",
               "gender": 1,
               "credit_id": "57f349089251410c310069f7",
               "name": "Ashlie Rhey",
               "profile_path": "/m0dEhK2TrNlLkBlTsSO5tdfGx2l.jpg",
               "id": 99619,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Marcia Gray",
               "gender": 1,
               "credit_id": "57f3491b9251410c220066ac",
               "name": "Shanna McCullough",
               "profile_path": "/cmCYntRgmbKpPM1ObMDg5XgopAe.jpg",
               "id": 45011,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Ron Jeremy",
               "gender": 2,
               "credit_id": "57f34924c3a368334a0069d7",
               "name": "Ron Jeremy",
               "profile_path": "/l4aDQlLafsG3N4pJ3W6YjpMXWI3.jpg",
               "id": 42545,
               "order": 12
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4ac0c3a368484e165147",
            "name": "Scott Ziehl",
            "profile_path": null,
            "id": 43439,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.076951,
      "production_countries": [],
      "id": 125263,
      "vote_count": 2,
      "budget": 0,
      "overview": "A young Pennsylvania man moves to Los Angeles to begin work for an ambulance service. There he is teamed with a supremely confident vet who seemingly has gone through a large number of partners. Initially the novice is awed by the more experienced man's capabilities to deal with the high pressure situations they encounter. However, gradually he discovers that all is not as it seems. While the vet is ice on the surface, he actually gets through the ordeals by heavy drug use and avoids commitments. Soon the younger man finds himself pulled into the same world and has to decide what direction he wants to take.",
      "similar": [],
      "original_title": "Broken Vessels",
      "runtime": 90,
      "poster_path": "/bpBPflXZD1GlNhpYQ5Nu8gftPkG.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1998-04-18",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Over the edge and out of control.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Scott Ziehl"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "David Baer",
         "Brent David Fraser"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0149964/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MTIxNDI5M15BMl5BanBnXkFtZTcwMzA2NzUyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Todd Field, Jason London, Roxana Zal | See full cast and crew »"],
      "reviews": [
         "This is a film that once seen, the viewer will never forget. I'm at a loss for the low score here at IMDb. The performances are riveting and the depiction of generational drug abuse is something of which to take notice. Those that think this dumps on the EMT profession, need to get real. What? You think that there are no abusers in this field of work? In fact, the one time I had to ride in a \"bus,\" the EMT was starting an IV and I said \"you guys haven't been cruising the park before coming here, have you?\" He started laughing and told me how much he loved this film. Of course, these guys could have been in any profession, but the superior irony would have been lost. This is one drug film I can recommend without hesitation, as it is chilling and stark. It in no way \"glamorizes\" drug use or the culture.",
         "After Having huge expectations for Scorcese's \"Bringing Out The Dead\" I was somewhat disappointed. But where the hell did BROKEN VESSELS come from? This film is everything the other one promised to deliver but didn't. My brother sent me a DVD saying \"This is the best Indie film of the year.\" The art work on the cover was dreadful. It looked like a stupid B horror film. The back of the thing had some awards listed and kudos for the actors. I watched it last night. What a ride! Who is Scott Ziehl? Who is Susan Traylor? And who is Todd Field? Field should have been nominated for this performance. I can only guess that the film went straight to video. Too bad more people won't see it. The film accurately depicted the decline of two young men into self delusion and drug abuse. Far better (dare I say) than \"Trainspotting.\"",
         "I was floored by this movie. Having spent seven years in various Washington state prisons alongside the disenfranchised casualties of the idiotic and doomed \"war on drugs\",I am no stranger to the deleterious effects of drug abuse and I thought this movie was one of the very few anti-drug movies that really got the message across without preaching or appearing to glamorize drugs. Jason London quite impressed me with his portrayal of a small town innocent corrupted by big city vices. But the film belongs to Todd Field; he gives an Oscar-worthy performance.This is a classic, really. Right up there with Dugstore Cowboy.",
         "this film came out about the same time as \"bringing out the dead\". with all due respect to Martin and Nick-this is the movie they could have made if hollywood hadn't warped the way a story is told. style over substance. with that said-this is a tough film to watch. the performances are dead solid perfect. the voice over is a difficult device to pull off and it doesn't always work here, but... there was a truth that i wanted to watch play out.",
         "Shortly following an unfortunate incident in Pennsylvania, naive young Tom (the boyishly charming Jason London of \"Dazed and Confused\") moves to Los Angeles and gets a job working as a paramedic so he can put his past behind him. He's partnered with weary, burnt-out, sardonic veteran medic Jimmy (a mesmerizing performance by Todd Field), a blithely blasé cynic who alleviates the stress of his unsparingly high pressure job by having sex with prostitutes, swilling booze, and smoking dope. Jimmy inducts the callow Tom into his manic, edgy, drug-fueled lifestyle and pretty soon both guys are spinning on a downward spiral to serious premature oblivion as the increasingly desperate pair resort to theft and dealing to support their ever-worsening habits. A strikingly amoral and keenly observed seriocomic feature about guilt, denial, redemption and drug addiction that scores strongly with its breathlessly quick pace, fractured editing, beautiful, sometimes hallucinatory visuals, dark, despairing tone, wickedly black sense of humor, and a dizzyingly constant, frenzied, hopped-up bustling vitality which deftly captures both the exciting highs and distressing lows of being wired on narcotics, director/co-screenwriter Scott Ziehl takes the viewer on an exhilaratingly frantic cinematic trip that's thrilling and harrowing in comparable measure. What's most impressive about this extraordinary film is its admirable refusal to offer any easy way out for its strung-out protagonists and refreshing lack of heavy-handed moralizing. Moreover, the performances are uniformly superb: London and Field are outstanding in the lead roles, with excellent secondary turns by Roxanna Zal as Tom's sweet, concerned nurse girlfriend, Susan Traylor as an annoyingly loquacious speed freak, James Hong as Tom and Jimmy's irascible, overbearing jerk boss, William Smith as a loud, antagonistic biker patient, and especially the late, great Patrick Cranshaw as Jimmy's rascally, regretful dope fiend grandfather. Nervy, intense, and ultimately quite powerful, this remarkable knock-out rates highly as one of the great indie sleepers of the 90's.",
         "In my job as a guitar teacher, I come in contact with many kids who are at the place in their lives where they are very impressionable and often have a glamorized view of drug use. I have shown this movie to several kids as an example of how drug abuse can get out of control in a hurry and ruin lives. I point out that the main character, Tom, had no intention of becoming an addict, but before he knew it, he had become one, and it was a short ride to hell from there. This movie makes this point without seeming like a health class documentary. The kids I've shown it too seemed to get the message. I give this movie a high rating, if for no other reason, because it helps me to possibly save the kids from becoming what I myself had once been.",
         "OK, the story here is some kind of cliche, but it is shot with style and also shows some good acting performances. It has some parralels with Trainspotting. The soundtrack is fantastic, also the photography. There is a bit of disappointment that such good elements are not used in more remarkable way. This movie really deserved better screenplay. Nonetheless, it is an event to watch. Strongly recommended.",
         "I just saw this film on cable. It's fantastic. Why was it not in theaters? Jason London and Todd Field are amazing together. Scott Ziehl certainly has a future as a filmmaker. I guess it's true that great films are discovered as \"Cable Classics.\" The fact that Broken Vessels is so superior to Bringing Up The Dead, and did still not get released, says alot about the state of independent film. I missed the first few minutes and so I stopped by my local BlockBuster to see if a copy was in. They never heard of it. Remember this film is only three years old. Anyway, finally I tracked it down at my local specialty store. My God, the art work on the cover was enough to make me sick. It looked like some perverse horror film. The company that distributed this film are IDIOTS!!!",
         "This is a neat little movie with a lot of energy and control - it's not overly flashy or gimmicky and doesn't indulge in excessive Tarantino-aping; the Field character is truly sleazy, but the movie keeps everything within plausible limits of degradation and loss of control, so that his pull on London is easy to understand without losing moral perspective. It's a two-hander at heart, but through various secondary characters - especially Field's Gramps, a hopeless drug addict - it manages to carve out a plausible broader social base (even if you wonder how the guys ever manage to get through any of their shifts intact). Some of the specific exposition is tedious, or overly familiar and dutiful, or just marginally amusing, but the meat of it lies simply in colourful incident, and in that regard it has real panache and sense of character.",
         "***WARNING: POSSIBLE QUASI-SPOILER IF YOU HAVE ABSOLUTELY NO IDEA WHAT THIS FILM IS ABOUT. I had never, ever heard of this film before I happened to catch it on cable recently. It starts off like some kind of hip, offbeat coming-of-age comedy about a guy from Pennsylvania who moves to Los Angeles. You don't want to believe it when, early on, the flash-forward narration says there are bad things ahead. The characters are too cool and too likable; you're pretty sure it'll all work out (whatever it is) and be a fun, light-hearted romp on the way. But this is a serious film about drug addiction, and there's really no place to go, except straight down to hell. Even so, it's an interesting ride up to a point--it's all pretty believable in a colorfully seamy way, and the acting is great. At the very end, there's a pointless revelation about the Pennsylvania guy's past--maybe it explains some things about the character, but it detracts from the \"message\" (if there is any) that almost anyone could get slowly sucked into a destructive lifestyle. There actually isn't much of an end, which is perhaps true to the film's realism, but is cinematically unsatisfying. Nevertheless, this movie is a neat little flawed gem to discover in the jungle of cable TV."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Ziehl & Zal"],
      "summaries": ["A young Pennsylvania man moves to Los Angeles to begin work for an ambulance service. There he is teamed with a supremely confident vet who seemingly has gone through a large number of partners. Initially the novice is awed by the more experienced man's capabilities to deal with the high pressure situations they encounter. However, gradually he discovers that all is not as it seems. While the vet is ice on the surface, he actually gets through the ordeals by heavy drug use and avoids commitments. Soon the younger man finds himself pulled into the same world and has to decide what direction he wants to take."],
      "budget": 600000
   },
   "movielensId": 2703,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-04-18",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["Scott Ziehl"],
      "runtime": 90,
      "movieId": 2703,
      "title": "Broken Vessels",
      "mpaa": "",
      "actors": [
         "Todd Field",
         "Jason London",
         "Roxana Zal",
         "Susan Traylor",
         "James Hong",
         "Patrick Cranshaw",
         "Brent David Fraser",
         "Stephanie Feury",
         "William Smith",
         "Charlie Spradling",
         "Ashlie Rhey",
         "Shanna McCullough",
         "Ron Jeremy"
      ],
      "imdbMovieId": "0149964",
      "originalTitle": "Broken Vessels",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A young Pennsylvania man moves to Los Angeles to begin work for an ambulance service. There he is teamed with a supremely confident vet who seemingly has gone through a large number of partners. Initially the novice is awed by the more experienced man's capabilities to deal with the high pressure situations they encounter. However, gradually he discovers that all is not as it seems. While the vet is ice on the surface, he actually gets through the ordeals by heavy drug use and avoids commitments. Soon the younger man finds himself pulled into the same world and has to decide what direction he wants to take.",
      "tmdbMovieId": 125263,
      "avgRating": 2.8,
      "releaseYear": "1998",
      "numRatings": 40,
      "posterPath": "/bpBPflXZD1GlNhpYQ5Nu8gftPkG.jpg"
   }
}