{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0167925",
      "video": false,
      "title": "Late August, Early September",
      "recommendations": [
         147196,
         255647,
         8772,
         57811,
         18381
      ],
      "backdrop_path": "/9rh6IZWsNL3kFPVDFCsv87Bhpw.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Gabriel",
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136af1",
               "name": "Mathieu Amalric",
               "profile_path": "/yJlm02FobTETwbyaCTOOU26OfmS.jpg",
               "id": 8789,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe49a7c3a368484e136af5",
               "name": "Virginie Ledoyen",
               "profile_path": "/t9TdJUerLsUD766Q2dN9tJ4dRCG.jpg",
               "id": 19163,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Adrien",
               "gender": 0,
               "credit_id": "52fe49a7c3a368484e136af9",
               "name": "François Cluzet",
               "profile_path": "/rE7utJuaZiR9NLjxmtQJZET0q4d.jpg",
               "id": 33161,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Jenny",
               "gender": 1,
               "credit_id": "52fe49a7c3a368484e136afd",
               "name": "Jeanne Balibar",
               "profile_path": "/LkVjqDNX857fXYvqzttiCR38i1.jpg",
               "id": 77191,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Jérémie",
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136b01",
               "name": "Alex Descas",
               "profile_path": "/9G3pM5Kj1YSg8E2ixweCXu10WM8.jpg",
               "id": 13609,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Lucie",
               "gender": 1,
               "credit_id": "52fe49a7c3a368484e136b05",
               "name": "Arsinée Khanjian",
               "profile_path": "/7N76v1poYcmHqz1rvkraPt2AZvJ.jpg",
               "id": 7708,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Véra",
               "gender": 0,
               "credit_id": "52fe49a7c3a368484e136b09",
               "name": "Mia Hansen-Løve",
               "profile_path": "/mzDbolDfvD0DvVXxk6BoLZlvn4c.jpg",
               "id": 222686,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Maryelle",
               "gender": 1,
               "credit_id": "52fe49a7c3a368484e136b0d",
               "name": "Nathalie Richard",
               "profile_path": "/xIPFn1tutGeW3Q4900o5IWRfCip.jpg",
               "id": 6019,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Thomas",
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136b11",
               "name": "Eric Elmosnino",
               "profile_path": "/a9Lh5oY7YfzCb1SJNvU1w5PTH1j.jpg",
               "id": 24465,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "l'éditeur d'Adrien",
               "gender": 0,
               "credit_id": "52fe49a7c3a368484e136b15",
               "name": "Jean-Baptiste Malartre",
               "profile_path": null,
               "id": 131982,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136aed",
               "name": "Olivier Assayas",
               "profile_path": "/ySOOBOK7qSPlmSeLmcFsQaULcwY.jpg",
               "id": 21678,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136b1b",
               "name": "Olivier Assayas",
               "profile_path": "/ySOOBOK7qSPlmSeLmcFsQaULcwY.jpg",
               "id": 21678,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe49a7c3a368484e136b21",
               "name": "Georges Benayoun",
               "profile_path": null,
               "id": 72669,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136b27",
               "name": "Philippe Carcassonne",
               "profile_path": null,
               "id": 50516,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136b2d",
               "name": "Denis Lenoir",
               "profile_path": null,
               "id": 23464,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe49a7c3a368484e136b33",
               "name": "Luc Barnier",
               "profile_path": null,
               "id": 23397,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.715723,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 78568,
      "vote_count": 5,
      "budget": 0,
      "overview": "A story about the transition from late youth to early maturity, the film follows several friends and lovers as they come to make decisions on how to live their lives--getting a job more in harmony with ones ideals, committing to a lover, giving up a lover that no longer loves you: a film about grown-ups growing up.",
      "similar": [],
      "original_title": "Fin août, début septembre",
      "runtime": 112,
      "poster_path": "/pBIcJIwqKl9DpStlg5rL33yYTQe.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Cinéa",
            "id": 874,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-09-14",
      "vote_average": 7.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Olivier Assayas"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Olivier Assayas"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0167925/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzMDQzNDY3NF5BMl5BanBnXkFtZTcwOTY2MjUxMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mathieu Amalric, Virginie Ledoyen, François Cluzet | See full cast and crew »"],
      "reviews": [
         "Slow-paced, nuanced portrait of the friends surrounding a dying man. Wonderfully subtle and insightful, with outstanding acting and a marvelous script. Director Assayas' skill behind the camera is evident in every shot, despite lack of variety in locations and little action. Lots of conversation but the best moments come when the camera begins to wander. The kind of film you need to throw yourself into to truly appreciate. Very, very french.",
         "In many ways, FIN AOUT is a dismaying and disappointing experience. Assayas' IRMA VEP is the best French film of the last quarter century: thematically rich, stylistically remarkable, emotionally devastating. FIN AOUT is, in comparison, a rather drab, handheld take on Eric Rohmer, filled with dull, aimless, middle-class intellectuals who have such 'financial problems' that they get their uncle to lend them his country villa; they whinge and emote in the most banal terms, in a plot that says nothing and goes nowhere. This very aimlessness seems to be the film's theme. Although the title is very specific about time and the seasons, the film itself seems to exist in a timeless vacuum. Each episode has a temporal subtitle (eg 'six months later'), but no month is ever specified, and could therefore be any or none. This is not the film's failing, but that of the characters, who are locked in their own solipsism, flailing desperately, but unable to escape. Gabriel says of Adrien, the writer, that he was minor because he could only see the world from his limited viewpoint, but this is a much more general malaise - all the talk about friendship can't hide the fact that each character is fatally limited in perception of others, because of obsession with self (figured in the cramped interiors. The trips to the country are literally bursts of fresh air). This doesn't mean that Assayas isn't generous with his characters; he is probably kinder than some of them deserve (Gabriel, in particular, needs a good shaking). The search for an apartment, therefore, is not a trite subject - these rootless characters, forming their own community, are so desperate for a sense of place, home, that they search everywhere for it: the country, abroad, the past, death. FIN AOUT has in common with IRMA VEP a concern with the crisis of expression in this era of post-modernism. The crucial figure here is Adrien, significantly a receptacle of death (the funeral is becoming a recurring motif in modern French cinema, as in THOSE WHO LOVE ME TAKE THE TRAIN); focus for all the other characters. The question is: in an age of pastiche and reprodution, is it possible to insist on authentic personal expression (the film's structure focuses on a shifting series of pairs: uneasy doublings and reproductions)? And does it matter that the person making an art of the personal (both the director in IRMA VEP and the writer here) is rather objectionable as a human being? Is the insistence on the personal elitist and restrictive? In IRMA VEP these questions were urgently juggled up to the end, with no clear answers. Here the writer is unrecognised until he dies, perhaps confirming our decadent dependence on the past, and our inability to come to terms with and express the present (although even this is undermined; as his publisher remarks on Adrien's perceived success, 'I wouldn't go that far'). Unlike the director in IRMA VEP, we get no example of Adrien's work, save a self-serving and cliched letter (significantly breaking up a relationship of the May/December variety that has nearly stifled French cinema). There is no transcendental moment, like the final sequence of IRMA VEP; in essence an archetypal post-modern artefact - a fragmentary, abandoned, incomplete, distorted, scratchy, uncontextualised piece of film; a haunting palimpsest from another age (a call to return to the beginnings of cinema, when possibilities were endless, before ossifying into the codes we are stuck with now?); it is also the locus for Assayas' faith in cinema, personal expression and emotion. This issue is left rather vague here, because we have no evidence with which to judge. Well, except this film of course. It is this that raises FIN AOUT - Assayas' complete, mature mastery of the medium. Although his material is banal, he electrifies and enlivens it with his style: the fluidity of his camera movements and editing; his emotional use of colour, light and space; his mastery of the techniques of melodrama (many scenes echo the godlike Nicholas Ray); his intimate ability to capture and make profound every seemingly trivial gesture; his enlarging every detail to convey and enrich meaning. Chris Darke has called FIN AOUT a cubist work, but it seems to me more like an obsessive Monet serial: the characters and place, for all the narrative perambulations, never seem to change, or resolve the problems that opened the film (even if they leave a place, it's back to somewhere they've been before), but Assayas' impressionistic eye, in capturing the moment, asserts the beauty and depth of the transitory. In fact, the film's nearest peers, for all its cinematic brilliance, might be literary - especially Proust and Beckett, in its avoidance of the dramatic (the main death occurs off-screen) in favour of the phatic, the continuous and the elliptical, giving a truer account of lives dominated by lack (the film's credits have the actors' names split apart, figuring the personality crises depicted within). I have been using a lot of superlatives, and here's another. Assayas is now, along with Tim Burton, Takeshi Kitano and Wong Kar-Wai, the greatest director in the world; he has often been compared to the latter, although he hasn't yet quite reached Wong's offhand, melancholy poetry. This film, then, is his HAPPY TOGETHER, an absolutely astonishing example of cinematic authority, wasted on a rather monotonous psychodrama.",
         "Late August, Early September is a movie that will stay with me because it didn't make me obsessed over it right after i saw it. In fact, as time passed, I realized 'gee, the last best time I had with a movie was Fin Aout\". So I saw it again, took a deep breathe, and realized it really was a rare, marvelous movie that I feel lucky and nourished to see. I'm suprised that noyone was asking where the music in the movie came from. Well, in case you just saw it and wondered really hard like i did, all the music that was thematiclly featured are by a south African music group called Ali Farka Toure, all the songs are from their album \"The Source\", and the songs are---(for the opening and the motorbike) \"Goye Kur\", (for Virginie Ledoyen's threesome scene) \"Hawa Dolo\", (for Vera's theme, the closing and many parts, the essential theme) \"Cinquante Six\". I'm utterly moved at seeing Olivier Assayas accomplishment. The lingering, graceful, and intricate portrayal of modern people, throughly, relevantly modern. His water-color painting, which it's moods unexpectedly stay with you after seeing the film. The chosen characters and the bold realities of their conceptions sort of leave me caring about things again. The film showed me processes of natural acceptances and natural complications in life, not mimicking it, just tip toeing through it, yet the character's lives seems to always be existing and experiencing itself in between or before the time frames of the film and so on, so forth. I took that swift, bitter-sweet feeling inside me and kept thinking about the beautiful credits. I kept feeling pleased at how I get to see charcters having been so tormented but keeping so much in, a state that uncannily comforts a lot of my trivial, constant, day to day basis state of mind. Assayas is an auteur, in a really modern sense. He writes his own things, which guarantees his vitality. I have utter faith in him and I'm grateful that his films are made, just there, living.",
         "STYLIZED REALISM A tremendous and moving depiction of friendship and love whose dialogue is obviously French and whose camera-verite is very Dogme 95. Through a hand-held whirl we see stunningly candid and enticingly bare portraits of the goings on and thoughts of a group of friends including all the nuances of relationships. In this regard, Assayas's film is very similar to \"La Promesse\" and the Dogme 95 films. But the dialogue is extremely French in that it is very dramatic and a little too perfect to be real: dialogues feature characters who engage in dialogue's where they listen and think rather than argue. Yet even this works in the films favor, making you all the more taken in by characters demonstrate such depth. The performances are remarkable and for the most part, the characters brilliantly faceted. The movie is a bit longer than it needs to be, but the subtlety of the scenes requires patient development. If you like Robert Bresson, Hal Hartley, Lars Van Trier, or Thomas Vinterburg, go see this. The style of the camerawork and the lushness of some of the lighting makes this a must see for the screen",
         "I was attracted to this film because of Virginie Ledoyen (The Valet, * Women), and to a lesser extent because it was written and directed by Olivier Assayas (Boarding Gate, Demonlover, Paris, je t'aime). I was not thrilled, but I was not terribly disappointed either. Ledoyen, as were all the characters in the film was self-obsessed. Probably none more so than Gabriel (Mathieu Amalric - The Diving Bell and the Butterfly), who seemed to need a constant reaffirmation from his friends, but rejected any criticism of his aimless life. The film revolved around Adrien (François Cluzet), a writer that lived on the margins while composing novels that no one read. In fact, most all of the characters lived on the margins in meaningless jobs. They just floated instead of trying to build something. I guess if I wasn't fascinated with helping someone who seems to live a similar life, I wouldn't have found this film as interesting. But the acting rose above the story and it was, indeed a pleasure to watch.",
         "The style of the film, described elsewhere as in the 'Dogme 95' genre, really works well for this story, especially on the cinema screen; on video, the transfer was made from a slightly poor-quality print, which is too bad - the photography in the movie is excellent. For the technically-oriented, \"Fin Aout, Début Septembre\" was filmed in Super-16mm, and in my opinion this sort of plot is perfectly suited to the S16, or the DV-originated type of storytelling technique. It's true there was no murder or gratuitous violence, no rape or incest, no endless spurting of tears and confessions, which is frankly the reason I love this film. The dialogues are believable, the characters are very real, with that feeling of people we've known and maybe not always loved or cared to be around, but who are part of life nonetheless...I admire a filmmaker who is willing to present characters that are based in life, not in movie clichés, and Assayas pulls it off here wonderfully in my opinion.",
         "Late August, Early September (1998) Olivier Assayas created a wonderful movie about emotions about feelings, love friendship and death. How can he develop so many multidimensional characters in just one movie, show such a complexity of emotions? We are far from the mediocre habitual (French) movie that piles up betrayal and flat pretty faces. Maybe because the places, the light are familiar to me, it all feel so real, the situations are realistic and the characters exist outside the field of the camera. Beautiful music by Ali Farka Touré and amongst an excellent cast Virginie Ledoyen performs like we could never have suspected from her mediocre acting in 'The Beach' or 'Bon Voyage' Most people will not like that movie but this is the best I have seen this year.",
         "In many ways, FIN AOUT, DEBUT DECEMBRE is a dismaying and disappointing experience. Assayas' IRMA VEP is the best French film of the last quarter century; thematically rich, stylistically remarkable, emotionally devastating. FIN AOUT is, in comparison, a rather drab handheld take on Eric Rohmer, filled with dull, aimless, middle-class intellectuals who have such 'financial problems' that they get their uncle to lend them his country villa; they whinge and emote in the most banal terms, in a plot that says nothing, and goes nowhere. This very drabness seems to be the film's theme. Although the title is very specific about time and the seasons, the film itself seems to exist in a timeless vacuum. Each episode has a temporal subtitle (e.g. 'six months later'), but no month is ever specified, and could therefore be any or none. This is not the film's failing, but that of the characters, who are locked in their own solipsism, flailing desperately, but unable to escape. Gabriel says of Adrien, the writer, that he was minor because he could only see the world from his limited viewpoint, but this is a much more general malaise - all the talk about friendship can't hide the fact that each character is fatally limited in perception of others, because of obsession with self (figured in the cramped interiors. The trips to the country are literally bursts of fresh air). This doesn't mean that Assayas isn't generous with his characters; he is probably kinder than some of them deserve (Gabriel in particular needs a good shaking). The search for an apartment, therefore, is not a trite subject - these rootless characters, forming their own community, are so desperate for a sense of place, home, that they search everywhere for it: the country, abroad, the past, death. FIN AOUT has in common with IRMA VEP a concern with the crisis of expression in this era of post-modernism. The crucial figure here is the writer, significantly a receptacle of death (the funeral is becoming a recurring motif in modern French cinema, as in THOSE WHO LOVE ME TAKE THE TRAIN); focus for all the other characters. The question is: in an age of pastiche and reproduction, is it possible to insist on authentic personal expression (the film's structure focuses on shifting series of pairs: uneasy doublings and reproductions). And does it matter that this person (both the director in IRMA VEP, and the writer here) is rather objectionable as a human being? Is the insistence on the personal elitist and restrictive? In IRMA VEP, these questions were urgently juggled up to the end, with no clear answers. Here, the writer is unrecognised until he dies, perhaps confirming our decadent reliance on the past, and our inability to come to terms with and express the present (although even this is undermined; as his publisher remarks on his perceived success, 'I wouldn't go that far'). Unlike the director in IRMA VEP, we get no example of Adrien's work, save a self-serving and cliched letter (significantly breaking up a relationship of the May/December type that has nearly killed French cinema). There is no transcendental moment, like the final sequence of IRMA VEP; in essence an archetypal post-modern artefact - a fragmentary, abandoned, incomplete, distorted, scratchy, uncontextualised piece of film; a haunting palimpsest from another age (a call to return to the beginnings of cinema, when possibilities were endless, before ossifying into the codes we are stuck with now?), it is also the locus for Assayas' faith in cinema, personal expression and emotion. This issue is left rather vague here, because we have no evidence with which to judge. Well, except this film, of course. It is this that raises the film - Assayas' complete, mature mastery of the medium. Although his material is banal, he electrifies and enlivens it with his style: the fluidity of his camera movements and editing; his emotional use of colour, light and space; his mastery of the techniques of melodrama; his intimate ability to capture, and make profound, every seemingly trivial, gesture; his enlarging every detail to convey and enrich meaning. Chris Darke has called FIN AOUT a cubist film, but it seems to me more like an obsessive Monet serial: the characters and place, for all their narrative perambulations, never seem to change, or resolve the problems that opened the film (even if they leave somewhere, it's back to somewhere they've been before), but Assayas' impressionistic eye, in capturing authentically the moment, asserts the beauty and depth of the transitory. In fact, the film's nearest comparisons, for all its cinematic brilliance, might be literary - especially Proust and Beckett - in its avoidance of the dramatic (the main death occurs off-screen) in favour of the phatic, the continuous and the elliptical, giving a truer account of lives dominated by lack (the film's opening credits have the actors' names split apart, figuring the personality crises that make up its content). I have been using a lot of superlatives, and here's another. Assayas is, along with Tim Burton, Takeshi Kitano and Wong Kar-Wai, the greatest director in the world: he has often been compared to the latter, although he can't quite reach Wong's offhand melancholy poetry just yet. FIN AOUT, than, is his HAPPY TOGETHER, an absolutely astonishing example of cinematic authority wasted on a rather monotonous psychodrama.",
         "I still didn't like this as much as \"Demonlover\" by a long stretch, but I thought it was a bit more well-executed than Irma Vep. The various aspects of Assayas's style are more fully integrated here, but I still find he has a tendency toward extended intellectual coffee shop dialogue (a la Godard) at times that I'm not crazy about, and which still doesn't mesh well with his penchant for moody visuals (in my opinion still is greatest strength). The film reminds me quite a bit of Michael Winterbottom's \"Wonderland\". Like that film, neither the characters nor the situations of the story are really that remarkable or interesting, but rather the movie derives it's strength from little fleeting moments. And also like Winterbottom, Assayas has an unfortunate tendency here to cut those moments slightly short. I found a number of times wanting scenes to continue longer than they did, building up more of that improvisational sense of intimacy, instead of frequently fading to black while the scene is still underway (similar to Winterbottom's \"9 Songs\"). Still, there are enough of those moments to make the film more than worthwhile. I definitely think it is Assayas's most approachable, warm film that I've seen. Not that I find he is necessarily a particularly cold or detached filmmaker (\"Demonlover\", if anything, may very well be a masterpiece of pure detachment and inhumanity, but I think that comes more from the concept of the film rather than the filmmaker, and \"Irma Vep\" was nothing if not a gushing love letter to his ex-wife, after all), but there seems to be a deliberate attempt in this film to capture something real and immediate, even if Assayas gets side tracked by the unfortunate boats of cerebral, intellectual café chatting.",
         "This is a pretty stereotypical French film in that involves a lot a not-terribly-interesting, very bourgeois French people talking endlessly about their personal relationships and the meaning of life (I wasn't expecting Hollywood-style gun fights and car crashes, but there has to be a happy medium somewhere). The bland lead is dealing with his failed relationship with his long-time ex-girlfriend and his inability to commit to his present lover (Virginie Ledoyen)as he also comes face-to-face with his unrealized literary ambitions and the imminent death of his older and slightly more successful mentor. The dying mentor, meanwhile, is a published but still obscure author. Although he is middle-aged, he has taken on an unusually precocious fifteen-year-old as a mistress--why? because this a French movie, the country that gave us Eric \"Claire's Knee\" Rohmer and was the first to publish Vladimir Nabokov's scandalous novel \"Lolita\"--making borderline pedophilia look vaguely classy seems to be a longstanding French cinematic tradition. The best reason to watch this movie is for Virginie Ledoyen who is most familiar to American audiences as Leonardo DeCaprio's girlfriend in \"The Beach\" and for her appearance on the cover of a number of lowbrow men's magazines like \"Maxim\". She is actually a pretty good actress though and the movie shows some signs of life whenever she is on screen (which is all too infrequently I'm afraid). The only other remarkable things about this movie is the relative dearth of sex scenes (although there is one memorable very one with Ledoyen near the end)and the fact that many of these characters actually seem to have jobs(!)and are not just lounging on the beach or in the countryside as is usually the case in French movies. Other than that this film is very stereotypical. If you like talky French movies in general, you'll probably like it, but if not, I wouldn't bother."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Dacia Films",
         "Cinéa",
         "Canal+"
      ],
      "summaries": ["A story about the transition from late youth to early maturity, the film follows several friends and lovers as they come to make decisions on how to live their lives--getting a job more in harmony with ones ideals, committing to a lover, giving up a lover that no longer loves you: a film about grown-ups growing up."],
      "budget": 0
   },
   "movielensId": 2705,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-09-14",
      "dvdReleaseDate": "2003-05-27",
      "directors": ["Olivier Assayas"],
      "runtime": 112,
      "movieId": 2705,
      "title": "Late August, Early September",
      "mpaa": "",
      "actors": [
         "Mathieu Amalric",
         "Virginie Ledoyen",
         "François Cluzet",
         "Jeanne Balibar",
         "Alex Descas",
         "Arsinée Khanjian",
         "Mia Hansen-Løve",
         "Nathalie Richard",
         "Eric Elmosnino",
         "Jean-Baptiste Malartre"
      ],
      "imdbMovieId": "0167925",
      "originalTitle": "Fin août, début septembre",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A story about the transition from late youth to early maturity, the film follows several friends and lovers as they come to make decisions on how to live their lives--getting a job more in harmony with ones ideals, committing to a lover, giving up a lover that no longer loves you: a film about grown-ups growing up.",
      "tmdbMovieId": 78568,
      "avgRating": 3.37594,
      "releaseYear": "1998",
      "numRatings": 133,
      "posterPath": "/pdo6ZVmBAx1QwHjGqQsTq1ZFmiv.jpg"
   }
}