{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "women",
            "id": 515
         },
         {
            "name": "southern france",
            "id": 2335
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "lonely hearts ad",
            "id": 5444
         },
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "wine",
            "id": 6563
         },
         {
            "name": "winegrower",
            "id": 7755
         },
         {
            "name": "french countryside",
            "id": 198856
         }
      ],
      "imdb_id": "tt0137439",
      "video": false,
      "title": "Autumn Tale",
      "recommendations": [
         122683,
         65040,
         33356,
         28213,
         54898,
         21967,
         36090,
         222226,
         39543,
         124491,
         54140,
         88302,
         202768,
         50950,
         37621,
         263112,
         147306,
         134220,
         110761,
         99600
      ],
      "backdrop_path": "/x2EAE7s57zQi4daOobsXPjKL3Xi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Isabelle",
               "gender": 0,
               "credit_id": "52fe43479251416c7500a539",
               "name": "Marie Rivière",
               "profile_path": "/pmh1N1xJWN5hkxTV27blTZvF64e.jpg",
               "id": 26101,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Magali",
               "gender": 1,
               "credit_id": "52fe43479251416c7500a535",
               "name": "Béatrice Romand",
               "profile_path": "/44XNrVHZWwgoCWDdWGM7Km5Tjkh.jpg",
               "id": 28611,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gérald",
               "gender": 0,
               "credit_id": "52fe43479251416c7500a53d",
               "name": "Alain Libolt",
               "profile_path": "/e1tWOgNk2W5JhucO30vthXIQKeR.jpg",
               "id": 39349,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Étienne",
               "gender": 0,
               "credit_id": "52fe43479251416c7500a541",
               "name": "Didier Sandre",
               "profile_path": "/a1TBexyudjDIELIZa5nE8FrRi9C.jpg",
               "id": 64215,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Rosine",
               "gender": 0,
               "credit_id": "548745d9c3a368580f000156",
               "name": "Alexia Portal",
               "profile_path": "/yjLcbl1Q5n1v6EvqySEeABGfgnV.jpg",
               "id": 26402,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43479251416c7500a531",
               "name": "Éric Rohmer",
               "profile_path": "/4VUnQk2yA6m58uak9LguIAzZ8Re.jpg",
               "id": 28615,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43479251416c7500a547",
               "name": "Éric Rohmer",
               "profile_path": "/4VUnQk2yA6m58uak9LguIAzZ8Re.jpg",
               "id": 28615,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43479251416c7500a54d",
               "name": "Françoise Etchegaray",
               "profile_path": null,
               "id": 28754,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43479251416c7500a553",
               "name": "Diane Baratier",
               "profile_path": null,
               "id": 67526,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe43479251416c7500a559",
               "name": "Mary Stephen",
               "profile_path": null,
               "id": 67527,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe43479251416c7500a55f",
               "name": "Margaret Ménégoz",
               "profile_path": null,
               "id": 6100,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.250106,
      "production_countries": [{
         "iso_3166_1": "FR",
         "name": "France"
      }],
      "id": 10239,
      "vote_count": 16,
      "budget": 0,
      "overview": "Magali (Béatrice Romand), forty-something, is a winemaker and a widow: she loves her work but feels lonely. Her friends Rosine (Alexia Portal) and Isabelle (Marie Rivière) both want secretly to find a husband for Magali.",
      "similar": [
         19913,
         28178,
         489,
         13,
         50544,
         68718,
         394117,
         277547,
         310121,
         397422,
         13523,
         226,
         862,
         72105,
         8839,
         1024,
         9726,
         109689,
         297222,
         44564
      ],
      "original_title": "Conte d'automne",
      "runtime": 112,
      "poster_path": "/bTTclRpu2tK8KhTd5xe0C7FUsz.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Rhône-Alpes Cinéma",
            "id": 1666,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept Cinéma",
            "id": 16366,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Les Films du Losange",
            "id": 223,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-07",
      "vote_average": 7,
      "belongs_to_collection": {
         "backdrop_path": "/cbG4r8Xc0ZOILiCeiHipyhotr9p.jpg",
         "name": "Tales of the Four Seasons",
         "id": 104068,
         "poster_path": "/hfKh2kHAHLuLleJjPiVjPYu16IS.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Eric Rohmer"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Eric Rohmer"],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0137439/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0NjM4NTU5OV5BMl5BanBnXkFtZTYwMjM4MTk5._V1_SY311_CR1,0,214,311_AL_.jpg",
      "actors": ["Stars: Marie Rivière, Béatrice Romand, Alain Libolt | See full cast and crew »"],
      "reviews": [
         "When we first meet Isabelle, she is discussing the upcoming wedding of her daughter. She wants to get the wine from her friend Magali, whom her daughter thinks doesn't care for her. Isabelle reassures her it's not so, then goes out to meet her friend. Magali, a wine maker and a widow, has a lot going for her, yet, she hasn't been able to attract a man to share her life after the death of her husband. As old friends from childhood, we can see that Isabelle and Magali look more like sisters. Magali, who has strong opinions, tells Isabelle she would never put a personal ad in the paper to meet a man. Magali has nothing to fear, the well intentioned Isabelle, decides to pass herself for Magali when she places an ad in their local newspaper. It doesn't take long before Gerald, a handsome middle aged man, answers the advertisement. Isabelle describes herself as though she were Magali. After all, if there is anyone that knows her friend, it's Isabelle! Gerald likes what he hears, although Isabelle's type has never done anything for him. In the meantime, Rosine, also a well intentioned admirer of Magali, who is her son's girlfriend, decides she would like to introduce her to Etienne, a local teacher. Things get a bit complicated when Etienne, who has a reputation for falling for his female students, and Rosine, see Gerald and Isabelle, as they are talking. Rosine, who thinks something is going on, asks Etienne to wait, so Isabelle doesn't see them. Isabelle, who during her third meeting with Gerald, decides to tell him the truth, gets a weight lifted from her conscience. Gerald, who sees a picture of Magali, senses a kind soul and doesn't take it against Isabelle for meddling and deceiving him. She invites Gerald to attend the wedding, where Magali is also invited. Everything comes together at the wedding of Isabelle's daughter. The truth finally emerges as Magali realizes Isabelle's intentions to bring her and Gerald together. As with old friendships, Magali and Isabelle's will not be broken. Eric Rohmer, who also wrote the screen play, finishes his cycle of films with a season as a theme. He created a work of great sensitivity as a friendship is put to a test. Sometimes even a well intentioned person's meddling in another's affair can suffer if taken the wrong way. There is no such danger here. Isabelle and Magali have so much in common that all will be forgotten. Isabelle, who is a happily married woman, wants her friend to find someone and be as happy as she is. The film is typical of the director. He presents the story straight, without any embellishments. The result is a lovely story about friendship. Marie Riviere and Beatrice Romand, who appear as Isabelle and Magali, respectively, do excellent work for the director. Both actresses give a great account of their characters. Alain Libolt, who plays Gerald, makes an impression as the sophisticated Gerald, a man who longs for a love that has been denied to him. The others in the cast are also effective in the film. Diane Baratier's cinematography captures that area of France lovingly. Mr. Rohmer, as usual doesn't believe in too much music. In here it comes at the end, at the wedding celebration. Eric Rohmer directed this sweet tale with great style.",
         "(Note: Over 500 of my movie reviews are now available in my book \"Cut to the Chaise Lounge or I Can't Believe I Swallowed the Remote!\" Get it at Amazon.) And he knows how to write dialogue that is revealing, engaging and realistic, no small feat; and it is perhaps this talent more than anything else that has made Eric Rohmer the great director that he is. Here uses France's Cotes du Rhone wine country as a backdrop and symbol to help him explore not only autumn love, but the enduring friendship of two very different women. Isabelle (Maire Revière) is an elegant, tall, fair haired, blue-eyed haute bourgeoisie and her friend Magali (Beatrice Romand) is a short, earthy, dark-haired petite winemaker originally from Tunisia. Isabelle is happily married; Magali is divorced. They are both forty-something. Isabelle's daughter is to be married. But the focus of the film is not on the bride and groom, but on the older generation, on Isabelle and Magali. In this way Rohmer combines the warm and enchantment of the celebration of autumn life, when the grapes are ripe for harvest, when love has its last chance, when Dionysus has his festival, when the heat of summer is over and we are ready to reflect and realize what is really important before it's too late. Isabelle feels this strongly and wants her friend to find happiness before another winter comes. But Magali, because of the vineyard, doesn't have much of an opportunity to meet men, although she allows that she would like to. She is at that delicate age when one can try again or shrug it off. Isabelle intervenes by going to a dating service and placing an ad. She meets Gerald (Alain Libolt) and they have lunch (she insists on lunch) two or three times and she evaluates him. He is modest, somewhat suave and amazingly diplomatic. They share a certain attraction. Meanwhile, Rosine (Alexia Portal) who is dating Magali's son and who is very close to Magali, perhaps more so that she is to her son, also wants to find a mate for Magali. She proposes her philosophy professor, Etienne (Didier Sandre), who is in fact sweet on her. He is the kind of man who, as Magali observes, likes them younger as he grows older. But maybe she will be the exception. Maybe he will finally grow up. Both arrange for their choices to meet Magali at the wedding. As usual Rohmer explores humanity and how we relate to one another, and finds both love and a kind of sweetness that is liable to bring us to tears. The resolution of the film is followed by a most endearing anticlimax in which there is a dance of joy.",
         "It is autumn in the Rhone valley and grapes are being harvested. Magali (Beatrice Romand), the owner of a small vineyard inherited from her parents, lives alone and attends to her vineyard with the same care she gives to her frizzy black hair. She tells her best friend Isabelle (Marie Riviére), a librarian, that she has no interest in meeting men. \"At my age,\" she says, \"it's easier to find buried treasure.\" Isabelle, however, has her own ideas on the subject and takes out an ad in the local paper to find a suitable partner for her friend. Winner of won the award for Best Screenplay at the Venice Film Festival, Eric Rohmer's An Autumn Tale, the final film in his Four Seasons series, is about matchmaking but this time it is about the need for companionship of older women with grown children. Like many Rohmer films, a complex web of events and relationships arise from seemingly simple acts of friendship. Isabelle meets Gérald (Alain Libolt), a courteous and laid back salesman through her ad and goes to lunch with him a few times enjoying the idea that she can be still be seductive. After toying with the notion of keeping him for herself, she finally confesses that she is happily married and the whole seduction routine was simply a ploy to introduce him to her best friend Magali. The situation becomes further complicated by the desires of Rosine (Alexia Portal), her son Leo's (Stephane Damon) girlfriend, to set her up with her ex boyfriend Etienne (Diedier Sandre) a philosophy teacher with a penchant for younger women. Unaware of the others matchmaking efforts, in a true Shakespearean twist, both Gerard and Etienne are invited to the wedding reception for Isabelle's daughter Emilia (Arelia Alcais) and the way it works itself out is delightful to observe. None of this of course unfolds according to plan but the beauty of the film is not the plot but the gradual development of complex three-dimensional characters through typically Rohmerian intelligent and witty dialogue. An Autumn Tale, though it contains some fanciful romantic intrigue, unfolds in a spirit of playful adventure, without guile or mean-spiritedness. Like the conclusion of Lindsay Anderson's O Lucky Man, we smile for no reason and Rohmer leaves us with a dance of joy and a final song: \"If life is a journey, we hope your weather's fair, wild flowers are green and blue, travel safely, all of you\".",
         "\"Autumn Tale\" is one of those movies where the viewer is asked to eavesdrop on normal people doing normal things. Europeans, notably the French, seem to do it best. It's a tricky approach to movie making; the margins for success are so narrow. Luckily, Mr. Rohmer, the director, is spot-on in this movie. The plot is a trifle; Isabelle and Magali are middle-aged women and livelong friends. Both are content with their families and careers. But Isabelle thinks that the widowed Magali needs a man, as does Magali's son's girlfriend. Independently, and unknowing to Magali and to each other, they conspire to set her up with a romantic interest. That's it. Mr. Rohmer, his screenwriter, and the top-notch actors brew up an enjoyable movie that's a treat to watch. I recommend it highly.",
         "This was a little film with a simple plot and likable characters. In fact, Hollywood would learn a lot from films like this. It's not the dynamic plot, special effects or big name stars that often make a film exceptional, it's the writing and the acting! And this movie is written so lovingly and acted so honestly that I couldn't help but like it. This, despite the notable absence of the sensational elements in the movie, made for a wonderful film. Think about it--the basic plot is an older woman who owns her own small winery is lonely. So, her friend tries to find a man for her and so does her grown child. Talk about your simple plot! And yet it works! So if you are in the mood for something different, give this movie a try.",
         "For this, the last of his Tales of the Four Seasons, Eric Rohmer chose the somewhat pastoral setting of a vineyard in French wine country. It's the story of a middle aged winemaker who wants to find a man but isn't willing to look for one; essentially she hopes to encounter the perfect man by chance but she severely limits the likelihood of a meeting because she rarely ventures away from her work/home. Her two friends (who always visit her, never vice versa) each try to set her up with a man. Her older friend attempts to deceive her into thinking the man she has picked is a chance encounter while her younger friend, who happens also be dating her son, makes her intentions clear. Essentially what Rohmer is saying with this film is that passively expecting things to happen without working for them in any way is foolish. Faith is a key theme in Rohmer's work and this might be taken as a sort of critique of blind faith. When the winemaker is thrust into these romantic entanglements she reacts like a petulant child instead of a mature adult. The logical plans of her wordly friends are a sharp contrast to her own naivety. Still, this isn't some cold rejection of her character; in spite of her flaws the winemaker still has some admirable traits and things work out well for her. This is the difference between Rohmer and certain other directors who attempt to analyze human nature: he never lets his ideas overcome the realistic boundaries of human behavior and thus avoids the all too common pitfalls of misanthropy and didacticism. Like almost every Rohmer film I've seen, An Autumn's Tale expresses some truths about human nature with a captivating realism. However, this film didn't really speak to me the way some of his films do because I ultimately don't have much in common with the winemaker. It's still well worth watching, especially for people who have more in common with the central character.",
         "One of the original French New Wave directors, Eric Rohmer completed the last and most cheerful of his \"Four Season\" series \"Autumn Tale\" when he was 79 years young (at 84 he made \"Triple Agent\" and showed no sign of tiring). One most interesting thing about \"Autumn Tale\" is that two professional critic said what appear to be opposite things about the place of plots in Rohmer's films, but actually meant the same thing. One said, \"Plot is typically one of the least important elements of a Rohmer movie\", while the other \" His films are heavily, craftily plotted, and yet wear their plots so easily that we feel we're watching everyday life as it unfolds.\" \"Autumn Tale\" plays almost like a stage play, with two multi-scene acts. The first act sets up the stage and develops the characters. The second act is a wedding party where two matchmaking efforts collide. The object is a widowed vineyard owner who tries to convince herself that she is happily occupied with her work. Scheme number one comes from a good friend (who is happily married and has a daughter who is getting married) who put up a \"lonely heart\" ad for her, interviews the applicant and tries to bring the two together at the wedding party. Scheme number two comes, brilliantly and unexpectedly, from her son's lovely girlfriend who is very fond of her. The candidate here is the young lady's ex, a professor who can \"talk philosophy\". This is a ridiculous idea in the son's view, \"You're trying to make your ex my stepfather\". So much for the plot, which is described above in its bear minimum, without its various hints of subtleties. The beauty of the movie is really in the acting. Never over-directed, it allows the absolutely top-notch cast to take the audience into a happy two-hour party. At the end, you don't feel like having watched a movie with phoney characters, but rather like having spent an evening with some good friends, who are real people. We are charmed and delighted, as well as gently probed into thinking more about relationships between people, particularly how they click. In a way, it's quite similar to \"Sideways\" but comes even more naturally. Like \"Sideways\", it has an open ending which is the nearest you can come to a happy ending.",
         "I wish I understood French better---I feel that this must have been a masterpiece of comfortable, unforced dialogue. Even the English subtitles left me feeling that these were real people having real conversations. OPne thing that usually turns me off in a film is the sense that a conversation is a forced device of exposition---like Deborah Kerr's soliloquies. Everyone pulled this off very well. They just chatted comfortably through the film, and the audience caught enough of it to follow the story. And a decent enough story it was, with the delights and disappointments very well played through body language.",
         "I was working on my computer with the tv nearby, and I happened upon a French film on cable. I didn't think I was particularly in the mood to read subtitles, but as I glanced at the screen, bits of the story began to pull me in. Before I knew it, over an hour and a half had passed. I wasn't familiar with any of the actors, which probably made the story of two very good friends and their loved ones even more compelling to me. Now I'd be interested in seeing anything else featuring Marie Rivière or Béatrice Romand. Rivière was engaging as a vulnerable yet capable business woman, and Romand had a quiet and powerful energy as a widow who seems to have retreated into the \"safety\" of working on her vineyard. Romand made me laugh at times with her moments of \"attitude\" and temper, and Rivière kept me guessing what was coming next. The story unfolded nicely. I found myself on the edge of my seat much of the time. The story is somewhat of a cautionary tale in some ways, yet very realistic in terms of human nature and relationships. There were some actions and situations I found to be less than appropriate, but in some ways the screenwriter seems to possibly have the same view... This movie is a must-see for people interested in the politics of dating, match-making, romance, and friendship.",
         "Eric Rohmer is very well known all around the world; He was one of the directors who formed the French New Wave in the late 50's - early 60's, but after that he found his own path. The path he went through with more determination than anyone. Autumn Tale is the last film of his last series: The Tales of The Four Seasons. Before this series of four he made two series of six films; The Moral Tales and Comedies & Proverbs. Autumn Tale is a very beautiful film cinematographically as it is narratively, from the 78-year-old master. Through his whole career, Eric Rohmer had the ability of making much from little ingredients. His films always had a low-budget, he often used the same cast & crew for his own production company Les Films du Losange. He never worked with mainstream actors/actresses and he used real filming locations with his own scripts. Eric Rohmer always tried to reach to as realistic dialog as possible. He sometimes recorded his actresses' discussions on their free time, to get to know the way, that certain aged people talked in the time. Rohmer usually wrote the dialogs himself, but it many have told that much had been left on the level of improvisation. Autumn Tale is about two women, who have been best friends for decades; Isabelle (Marie Rivière) and Magali (Béatrice Romand). Magali, a widow, has isolated in her countryside house where she works as a wine producer. She has given up hope in finding new love. Her friend Isabelle has been married for 25 years and wants to help Magali. This is the basic plot the film builds around, on misunderstandings and coincidences. Because Rohmer wrote a lot of surveys, articles and books about the state of film, one shouldn't watch his films without paying attention to this. Autumn Tale is about wine harvest, this can easily be reflected to the plot. The characters live in a beautiful countryside town, which landscapes they adore. But all of them are aware and keep an eye on the modernization of it. This reflects to Magali's way of respecting the old ways of wine production. Autumn Tale is a beautiful story of friendship, loneliness, searching and finding the love and joy in one's life. An interesting perspective on this story is to compare it with Rohmer's earlier films. As I mentioned earlier he often used the same actresses and the thing why one can compare these characters with others is because they are very much alike. Marie Riviere (Isabelle) plays similar roles in Eric Rohmer's The Aviator's Wife (1980) and The Green Ray (1986). Then Beatrice Roman (Magali) in Claire's Knee (1970) and Wonderful Marriage (1981). What makes these characters similar is that they all are looking for men. For something new in their lives. Even that Eric Rohmer did some films in the 21st century it's quite interesting to watch Autumn Tale as a reflection of his career. Since it is his last film in the 20th century. Thank you for reading and I hope you'll enjoy Autumn Tale, a beautiful film about harvesting and finding something new."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "La Sept Cinéma",
         "Les Films du Losange",
         "Rhône-Alpes Cinéma"
      ],
      "summaries": ["Magali, 45, is a wine producer in the south of France. She's a widow, and her best friend, Isabelle, decides to find her a new husband. She puts an ad in the local newspaper and finds a nice man, Gérald. At Isabelle's daughter's wedding, Magali eventually meets Gérald. But there's another man around, Etienne..."],
      "budget": 0
   },
   "movielensId": 2708,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-09-07",
      "dvdReleaseDate": null,
      "directors": ["Éric Rohmer"],
      "runtime": 112,
      "movieId": 2708,
      "title": "Autumn Tale",
      "mpaa": "",
      "actors": [
         "Marie Rivière",
         "Béatrice Romand",
         "Alain Libolt",
         "Didier Sandre",
         "Alexia Portal"
      ],
      "imdbMovieId": "0137439",
      "originalTitle": "Conte d'automne",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["V3siFqyoovM"],
      "plotSummary": "Magali (Béatrice Romand), forty-something, is a winemaker and a widow: she loves her work but feels lonely. Her friends Rosine (Alexia Portal) and Isabelle (Marie Rivière) both want secretly to find a husband for Magali.",
      "tmdbMovieId": 10239,
      "avgRating": 3.71298,
      "releaseYear": "1998",
      "numRatings": 601,
      "posterPath": "/bTTclRpu2tK8KhTd5xe0C7FUsz.jpg"
   }
}