{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "mother",
            "id": 456
         },
         {
            "name": "child abuse",
            "id": 516
         },
         {
            "name": "single parent",
            "id": 641
         },
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "smoking",
            "id": 919
         },
         {
            "name": "baby",
            "id": 1009
         },
         {
            "name": "social work",
            "id": 1751
         },
         {
            "name": "drug addiction",
            "id": 1803
         },
         {
            "name": "adoption",
            "id": 2393
         },
         {
            "name": "liberation",
            "id": 2434
         },
         {
            "name": "social worker",
            "id": 2438
         },
         {
            "name": "self-abandonment",
            "id": 2488
         },
         {
            "name": "court case",
            "id": 3012
         },
         {
            "name": "custody battle",
            "id": 4056
         },
         {
            "name": "son",
            "id": 5153
         },
         {
            "name": "looking for  birth parents",
            "id": 6230
         },
         {
            "name": "surrogate mother",
            "id": 7638
         },
         {
            "name": "racist",
            "id": 7856
         },
         {
            "name": "interracial relationship",
            "id": 10131
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0113691",
      "video": false,
      "title": "Losing Isaiah",
      "recommendations": [
         63587,
         93263,
         77530,
         29461,
         41820,
         44664,
         34941,
         87358,
         38509,
         341,
         54752,
         30817,
         20328,
         77246,
         42257,
         63020,
         48677,
         32075,
         40628,
         33430
      ],
      "backdrop_path": "/ka6XI7YVBSHTsL1YLACBeDIP9yN.jpg",
      "revenue": 7603766,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Margaret Lewin",
               "gender": 1,
               "credit_id": "52fe458ac3a368484e0614f3",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Khaila Richards",
               "gender": 1,
               "credit_id": "52fe458ac3a368484e0614f7",
               "name": "Halle Berry",
               "profile_path": "/w7HRZh4UhimZO2F6GywkYhjgAX3.jpg",
               "id": 4587,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Charles Lewin",
               "gender": 2,
               "credit_id": "52fe458ac3a368484e0614fb",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kadar Lewis",
               "gender": 2,
               "credit_id": "52fe458ac3a368484e0614ff",
               "name": "Samuel L. Jackson",
               "profile_path": "/AvCReLikjzYEf9XjTQxbv3JWgKT.jpg",
               "id": 2231,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Eddie Hughes",
               "gender": 2,
               "credit_id": "52fe458ac3a368484e061503",
               "name": "Cuba Gooding Jr.",
               "profile_path": "/yu8Q3ImFu3RJne585jjgeQO2Boo.jpg",
               "id": 9777,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Hannah Lewin",
               "gender": 1,
               "credit_id": "5857436692514146c9043316",
               "name": "Daisy Eagan",
               "profile_path": "/5c5d8t5ZWBvmtAuDnA6VRXQMTDp.jpg",
               "id": 204122,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "Isaiah",
               "gender": 2,
               "credit_id": "58574374c3a36806a7046f19",
               "name": "Marc John Jefferies",
               "profile_path": "/zpsC9yA8TzJFFtoSokZvbgcUiAY.jpg",
               "id": 62646,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Marie",
               "gender": 1,
               "credit_id": "585743839251411a46056186",
               "name": "Joie Lee",
               "profile_path": "/oWREZ1vjXxycfdwV5wlDwqZnODo.jpg",
               "id": 13602,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Gussie",
               "gender": 1,
               "credit_id": "585743919251416f100568ff",
               "name": "Regina Taylor",
               "profile_path": "/9lydQYDtczgSqu80wlr8SbeZvVj.jpg",
               "id": 21848,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Caroline Jones",
               "gender": 1,
               "credit_id": "5a8b8bc30e0a2653db08f829",
               "name": "LaTanya Richardson Jackson",
               "profile_path": "/obb4rUjV9hBMi075Cr9iOSCbDSu.jpg",
               "id": 61010,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe458ac3a368484e06150f",
               "name": "Naomi Foner Gyllenhaal",
               "profile_path": "/uiMV7Sr2lQ0GHnl8r34GBK8KlXj.jpg",
               "id": 100388,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe458ac3a368484e061515",
               "name": "Hawk Koch",
               "profile_path": null,
               "id": 13017,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe458bc3a368484e06151b",
               "name": "Sharon Owyang",
               "profile_path": null,
               "id": 100391,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe458bc3a368484e061521",
               "name": "Stephen Gyllenhaal",
               "profile_path": "/sGBf5Pz5Mxwd2eLWZemCxSe6mQX.jpg",
               "id": 15912,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe458bc3a368484e061527",
               "name": "Naomi Foner Gyllenhaal",
               "profile_path": "/uiMV7Sr2lQ0GHnl8r34GBK8KlXj.jpg",
               "id": 100388,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe458bc3a368484e06152d",
               "name": "Seth Margolis",
               "profile_path": null,
               "id": 100398,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "569aa34b9251410cd60009ad",
               "name": "Kimberly Brent",
               "profile_path": null,
               "id": 100387,
               "department": "Production",
               "job": "Associate Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 5.893604,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28313,
      "vote_count": 31,
      "budget": 17000000,
      "overview": "Khaila Richards, a crack-addicted single mother, accidentally leaves her baby in a dumpster while high and returns the next day in a panic to find he is missing. In reality, the baby has been adopted by a warm-hearted social worker, Margaret Lewin, and her husband, Charles. Years later, Khaila has gone through rehab and holds a steady job. After learning that her child is still alive, she challenges Margaret for the custody.",
      "similar": [
         37135,
         819,
         627,
         322,
         595,
         76494,
         334543,
         180863,
         205220,
         10320,
         293768,
         343674,
         2539,
         27066,
         245,
         41210,
         284293,
         10137,
         14748,
         1259
      ],
      "original_title": "Losing Isaiah",
      "runtime": 106,
      "poster_path": "/h0IjNfD1D7WVR70JpvMMWhNVx4N.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1995-03-17",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "Who decides what makes a mother?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Stephen Gyllenhaal"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Seth Margolis",
         "Naomi Foner"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113691/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg4NjM0MTExMl5BMl5BanBnXkFtZTcwNjY4MjEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jessica Lange, Halle Berry, David Strathairn | See full cast and crew »"],
      "reviews": [
         "Let's be clear on this one, this is a good film to watch. Picture quality is more than adequate and the characters are very well developed. The first prize has to go to the boy Isaiah himself who really was cute, no other word to describe him. The story is well executed and of course does not fail to raise emotion. What I query in the film is its political correctness. Any normal person would expect the boy to remain with his adoptive mother, as his biological mother had left him for, and even considered him, to be dead. That his biological mother, on finding out he's alive, tries to reclaim him seems normal. What is not normal, however, is that the courts give any creedence to the idea that he should be given back to her, as it is implied, on the sole grounds that he has the same colour skin as her !!! The rubbish spoken by her lawyer to the effect that \"black babies should be with black mothers\" should have been shown to be the rubbish it is, but it seems to come across as being the only argument that influenced the court's decision as, no other factor seems to have warranted the baby being returned to its biological mother. I am sure that if the roles and been reversed and that it was a white baby abandoned in a trash can adopted by a black family, the courts would have left it with its adoptive family on the basis that \"skin colour had no importance, only the love of a stable family\". This last hypothesis is, in my opinion, the just one, but it should be applied in all cases, whatever the colour of the baby and whatever the colour of the family. One get's the impression the director wants to \"be good to the blacks at all costs\" even when the well-being of the child in this case would dictate otherwise and I call this being a victim of political correctness. Of course, the ending is \"diluted\" and we see Khaila calling back Jessica Lange to look after the child when she realises that she can't cope. Her behaviour throughout the film is quite plausible and quite understandeable. What is not, it the behaviour of her attorney and the courts. I am not an American but one of the great things about that country is the mixture of origins which has gone to forge it - people of all colours and races but all American. Once you go down the line of wanting to make a black child have a black doll, read obligatorily books about black characters, have black parents etc etc, you are starting down the same path as the Ku Klux Klan many years ago and it's not better but more of the same. To get back to the film, though, I would highly recommend it but would warn viewers of its failing as described above.",
         "My comments have nothing to do with the obvious good acting skills, it's the plot that bothers me. Maybe it's because I'm from Canada where I don't believe that racial issues play as important a part as in the United States(of course racist attitudes exist in Canada), but I was completely astonished that the colour of someone's skin was the deciding factor of where a child belongs - that's completely unrealistic to me and that was the ONLY point the biological mother's lawyer made. Give me a break! As a mother, I understand that the only reason you have a child is to give life to that child for it to be happy and \"your ownership\" never plays a feeling moment because when you really love and care for a child, you're ultimate feeling is for that child to be happy and you, as the loving mother, always comes second - that child comes first! This particular movie explained the baby to be thrown in the garbage and that fact was never brought out in court. It's not about race/money - this movie was unrealistic and for those who think the biological mother was right -- ask yourself if you're thinking of the child or a selfish adult who cannot grow up and admit a mistake and try and make it better by considering the child's feelings at this point. Wouldn't it be better if the biological mother introduced herself slowly into the child's life and not turned his world upside down at an age where he only looks for security??? And, the biological mother never once thanked the adopted mom for saving her baby's life and taking care of him. Again, I found this movie unrealistic and disturbing that the torment of a child would be allowed, especially by someone who says they \"love\" them - that's not love, that's selfishness! As for the ending -- the biological mother shouldn't have won, period. ---imagine, the poor kid never would have went through the torment. -- a mother even gradually brings their child to daycare before they leave their child for just a couple hours!",
         "Try watching this movie sometime with a white woman who is the adoptive mother of an African-American child. I happen to baby-sit such a family and watched the movie with the kids' mother. I don't know how she sat through it without throwing something at the screen-not that this is necessarily a criticism. This film is very thought-provoking, though I think for the wrong reasons. The main focus is all about color and whether people should raise children of different races. Jessica Lange's character had a small speech in the courtroom about how love makes a family more than race, but it was just glossed over and the focus of the film went right back to race defining families. Maybe I just see this differently because of my close association with a family where the parents and one child are white and the other child is not, but family is not about race-corny as this may sound, it really is about love and support. The ending, as some other reviewers have said, is very wishy-washy. My viewing companion and her husband, who joined us at the end, liked it because they want to have a good relationship with their daughter's birth mother. I agree with them on that, but if the movie is going to deal with legalities so much, it should resolve those legalities at the end of the movie.",
         "I come from a family of 3 children, 2 adpoted and have to applaud this movie for doing a good job of pointing out that being a parent isn't about giving birth or \"donating\" sperm. A child always belongs with a family that loves him- it shouldn't be about color, or wealth or any other irrelevant factors. It's about responsibility and love. Any one can have a baby, not everyone can be a parent. There are certainly some stereotypes and the movie goes to the extreme point of a mother who literally throws away her baby to a family that is white, wealthy and kind to the child. The movie does this for dramatic purposes and succeeds in provoking a response from the many viewers who have seen this movie, as reviews will show. The movie also manages to enrage without even engaging the color issues. When Khaila's character tells her lawyer, \"but I'm his mother\" and insists on her \"parental rights\" it isn't even about color but about what is important about being a mother. Her character thinks that giving birth gives her rights over this tiny human being, (well played by Marc) when even children should be viewed as human beings with rights themselves. Parents who view children as possesions are wrong. I am \"white\" my husband is Mexican- does our child belong with one or the other? Khaila's lawyer says, \"black babies belong with black mothers.\" Is that what we want to teach? Segregation? Doesn't work for me. Babies of any color belong with the people who take care of them and love them. That's what being a parent is.",
         "I hesitated in seeing this movie for a long time because I knew that, whatever the outcome, I would be unsatisfied. However, I am willing to admit that I was wrong and the movie is a fairly accurate account of unconditional love and by the end, I was in tears. Fine acting all around.",
         "Losing Isaiah is a movie that attempts to deal honestly with the issues of interracial adoption. Its portrayals are most always right on the mark. Halle Berry is almost unrecognizable (of course, her natural beauty gives her away) in the first part of the film. She is compelling as the \"gone straight\" crack addict that threw her son away. Jessica Lang gives a strong performance as the social worker who dotes on Isaiah to the point that she almost forgets her own daughter. The best part of this movie, however, is the ending, when love for the child pushes all other differences to the side. For all the movies that waste our time, this one helps to make up for it.",
         "Seth Margolis' novel becomes middle-of-the-road drama about a white woman and her husband fighting a black woman in court over the custody of the black woman's baby son, whom she left in a dumpster two years prior to cleaning up her life as a homeless crack-addict. Uninventive presentation plays like a dulled-out TV-movie, and the two leading actresses (Jessica Lange and Halle Berry), while well cast, can't do much more than fill these stock roles with their individual charisma and personalities (they can't invest much heart into the proceedings when the screenplay is all processed emotion). The outcome of the case (and the reasons for the outcome) seem dated already, and the concluding events are standard, predictable scenes of coming to terms. ** from ****",
         "LOSING ISAIAH is a moving and well-acted drama that takes a hot-button issue to an emotionally manipulative level but will involve you to the point of taking sides. Halle Berry plays a crack addict who, one night desperate to get high, leaves her newborn baby in a pile of garbage and when she returns after her mission, finds the baby gone. The baby is rescued and is eventually taken home and raised by a sensitive social worker (Jessica Lange) who decides to raise and adopt the hyper-active, crack-addicted baby as her own. In the meantime, Berry gets clean, wants her baby back and takes Lange to court to regain custody of her son. This is an involving story that provides a balanced account of an emotional issue and if you're really paying attention, you will find your alliance with the protagonists in this story switching from time to time. Lange is solid, as always, and Halle Berry works hard at being convincing as a reformed junkie. Strong support is provided by Samuel L. Jackson and LaWanda Richardson (the real-life spouse of Jackson)as Lange and Berry's attorneys, David Straithern as Lang'es husband, and Daisy Prince as Lange's daughter. No matter how hard you try to remain neutral, this film will suck you in and find you taking sides.",
         "I think the plot of this movie was unrealistic though the acting was excellent and it made me cry towards the end. In reality, you can see that the Lewins were better fit to raise Isaiah than Khaila. I don't think a real court would ever give a child like that to its biological mother considering her background! Maybe if she found a job good enough to support a child before taking the case to court I would've rooted for her more. In real life a woman like Khaila can't compete with parents like the Lewins. The only thing I saw wrong with the Lewins was that they didn't read to him multicultural books or showed him any real pictures of people of different skin color so he could learn more about himself.",
         "After seeing this I had mixed feelings about it. Nobody could argue with the acting and Halle Berry Fans who may not be aware of this film(it's from awhile ago) may want to see it but (and I have to stop here and out) MAJOR ENDING SPOILER!!!!! The movie kind of lacks credibility because of the unreal quality of the ending. In real life it just usually would not happen like this. While it's perfectly OK for movies to be unrealistic in this case the movie starts off to gamely tackle a very important REALISTIC issue that a lot of humans go through. The ending was not only unrealistic it was almost implausible. I was quite young when I first saw this and at the time I was glad it ended as it did because the movie was heartbreaking enough so being young I WANTED a nice cut and dried Hollywood ending. But now being all grown up and seeing the agony real people go through in this situation I'm not sure the ending was as good as I thought then. Of coarse it would be really REALLY difficult for the writers to end it any other way and thus appear to take sides. So they chose to play it safe. I think the movie would, however have been taken more seriously had it maybe been done a little differently though of coarse that would have come with it's own set of problems. Maybe Losing Isaiah was a movie that was just to ahead of its time."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "An African-American baby, abandoned by his crack addicted mother is adopted by a white social worker and her husband. Several years later, the baby's mother finds out her son is not dead, as she thought before and goes to court to get him back.",
         "The natural and adoptive mothers of a young boy are involved in a bitter, controversial custody battle."
      ],
      "budget": 17000000
   },
   "movielensId": 271,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-17",
      "dvdReleaseDate": "2003-09-09",
      "directors": ["Stephen Gyllenhaal"],
      "runtime": 106,
      "movieId": 271,
      "title": "Losing Isaiah",
      "mpaa": "R",
      "actors": [
         "Jessica Lange",
         "Halle Berry",
         "David Strathairn",
         "Samuel L. Jackson",
         "Cuba Gooding Jr.",
         "Daisy Eagan",
         "Marc John Jefferies",
         "Joie Lee",
         "Regina Taylor",
         "LaTanya Richardson Jackson"
      ],
      "imdbMovieId": "0113691",
      "originalTitle": "Losing Isaiah",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["-ZXnvEun0sc"],
      "plotSummary": "Khaila Richards, a crack-addicted single mother, accidentally leaves her baby in a dumpster while high and returns the next day in a panic to find he is missing. In reality, the baby has been adopted by a warm-hearted social worker, Margaret Lewin, and her husband, Charles. Years later, Khaila has gone through rehab and holds a steady job. After learning that her child is still alive, she challenges Margaret for the custody.",
      "tmdbMovieId": 28313,
      "avgRating": 3.33181,
      "releaseYear": "1995",
      "numRatings": 1311,
      "posterPath": "/h0IjNfD1D7WVR70JpvMMWhNVx4N.jpg"
   }
}