{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "inventor",
            "id": 1436
         },
         {
            "name": "british",
            "id": 6731
         },
         {
            "name": "estate",
            "id": 155881
         }
      ],
      "imdb_id": "tt0120899",
      "video": false,
      "title": "My Life So Far",
      "recommendations": [
         99754,
         71034,
         52741,
         57012,
         70180,
         64523,
         15041
      ],
      "backdrop_path": "/hVQtxvDBppLGmBFgNDOEnDIzrhI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Edward Pettigrew",
               "gender": 2,
               "credit_id": "52fe477dc3a36847f813886d",
               "name": "Colin Firth",
               "profile_path": "/lKUq407IhFF6CQoJbUgbEyfS9JA.jpg",
               "id": 5472,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Gamma MacIntosh",
               "gender": 1,
               "credit_id": "52fe477dc3a36847f8138871",
               "name": "Rosemary Harris",
               "profile_path": "/dd7DX4FJwLAfxBdWarYMcWuLyYO.jpg",
               "id": 18998,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Aunt Heloise",
               "gender": 1,
               "credit_id": "52fe477dc3a36847f81388ab",
               "name": "Irène Jacob",
               "profile_path": "/vjlwVgbpb22S4rriqkfOd9H4kmU.jpg",
               "id": 1350,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Moira 'Mumsie' Pettigrew",
               "gender": 1,
               "credit_id": "52fe477dc3a36847f8138875",
               "name": "Mary Elizabeth Mastrantonio",
               "profile_path": "/jNIGODCEy216bbPnj28ky5E4L3Q.jpg",
               "id": 1161,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Uncle Morris MacIntosh",
               "gender": 2,
               "credit_id": "52fe477dc3a36847f8138879",
               "name": "Malcolm McDowell",
               "profile_path": "/lnVJ6J8szi86ssDTfyvZSl8lnlr.jpg",
               "id": 56890,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Fraser Pettigrew",
               "gender": 0,
               "credit_id": "52fe477dc3a36847f813887d",
               "name": "Robert Norman",
               "profile_path": null,
               "id": 218148,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Gabriel Chenoux",
               "gender": 2,
               "credit_id": "52fe477dc3a36847f8138881",
               "name": "Tchéky Karyo",
               "profile_path": "/9rMF25F5r3Giix9jkwfuUz2utHv.jpg",
               "id": 10698,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Elspeth Pettigrew",
               "gender": 1,
               "credit_id": "52fe477dc3a36847f8138885",
               "name": "Kelly Macdonald",
               "profile_path": "/ncpSRbNH44itdir2FLJHsD0nGVV.jpg",
               "id": 9015,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Rollo",
               "gender": 0,
               "credit_id": "52fe477dc3a36847f8138889",
               "name": "Roddy McDonald",
               "profile_path": null,
               "id": 218173,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Finlay",
               "gender": 0,
               "credit_id": "52fe477dc3a36847f813888d",
               "name": "Daniel Baird",
               "profile_path": null,
               "id": 218175,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Brenda Pettigrew",
               "gender": 1,
               "credit_id": "52fe477dc3a36847f8138891",
               "name": "Jennifer Fergie",
               "profile_path": null,
               "id": 218181,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Meg",
               "gender": 0,
               "credit_id": "52fe477dc3a36847f8138895",
               "name": "Kristin Smith",
               "profile_path": null,
               "id": 218183,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Andrew Burns",
               "gender": 2,
               "credit_id": "52fe477dc3a36847f8138899",
               "name": "Sean Scanlan",
               "profile_path": null,
               "id": 210715,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Uncle Crawford",
               "gender": 2,
               "credit_id": "52fe477dc3a36847f813889d",
               "name": "John Bett",
               "profile_path": "/vsLiXbdc8SGzeA7LqCGLYr7vI4f.jpg",
               "id": 218186,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Aunt Eunice",
               "gender": 0,
               "credit_id": "52fe477dc3a36847f81388a1",
               "name": "Anne Lacey",
               "profile_path": null,
               "id": 151793,
               "order": 14
            },
            {
               "cast_id": 25,
               "character": "Jim Menzies",
               "gender": 2,
               "credit_id": "5aac353f0e0a26782d005276",
               "name": "Brendan Gleeson",
               "profile_path": "/pUTBk2sqFgg4aFBXHckD0qKLUYP.jpg",
               "id": 2039,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe477dc3a36847f81388a7",
               "name": "Hugh Hudson",
               "profile_path": null,
               "id": 58220,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe477dc3a36847f81388b1",
               "name": "Simon Donald",
               "profile_path": null,
               "id": 78993,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5853156b92514146c90164ff",
               "name": "Howard Blake",
               "profile_path": null,
               "id": 33319,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58531572c3a3682f5802657d",
               "name": "Bernard Lutic",
               "profile_path": null,
               "id": 24846,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "58531582c3a3682fb802e23a",
               "name": "Patsy Pollock",
               "profile_path": null,
               "id": 2485,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "585315af9251416fad02738a",
               "name": "Andy Harris",
               "profile_path": null,
               "id": 17255,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "585315b59251411a46027c8c",
               "name": "John Frankish",
               "profile_path": null,
               "id": 41848,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "585315bcc3a36806a701a1af",
               "name": "Gillie Delap",
               "profile_path": null,
               "id": 1723073,
               "department": "Art",
               "job": "Set Decoration"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.609118,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 48958,
      "vote_count": 14,
      "budget": 0,
      "overview": "Memoir of the lives of a family growing up on a post World War I British estate headed up by a strong disciplinarian, her daughter, her inventor husband, their ten year old son, and his older sister. Through the household comes a number of suitors hoping to impress the young woman, including an aviator. When the elder woman's son shows up at the estate with his French fiancé, everything gets thrown into turmoil. The young boy takes a sudden interest in her sexual allure and his father is disturbed by his own non-Victorian feelings.",
      "similar": [
         105,
         165,
         196,
         2024,
         19,
         162,
         65057,
         342473,
         9928,
         274479,
         6972,
         9354,
         50456,
         36643,
         36670,
         77949,
         158852,
         199,
         394823,
         65086
      ],
      "original_title": "My Life So Far",
      "runtime": 98,
      "poster_path": "/fMeIRG7klgqXWpUrneqnbe4i4NV.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Enigma Productions",
            "id": 7049,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Hudson Film",
            "id": 20043,
            "origin_country": ""
         },
         {
            "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
            "name": "Miramax Films",
            "id": 14,
            "origin_country": ""
         }
      ],
      "release_date": "1999-08-25",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Imagine a summer in paradise with nothing to do except everything your heart desires.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Hugh Hudson"],
      "runtime": 98,
      "synopsis": "\"My Life So Far\" is the story of how the Pettigrew family, living in their family estate Kiloran House in Scotland, deals with changes brought by the end of WWI, told through the point of view of one of the Pettigrew children, Fraser (Robert Norman). The family is headed by the maternal grandmother MacIntosh (Rosemary Harris), affectionately known as \"Gamma\", who's decisions are to be obeyed without question. Gamma's son Morris (Malcolm McDowell) left home to build a career for himself and succeed as a well-to-do businessman; while her younger daughter Moira (Mary Elizabeth Mastrantonio) followed the traditional route - she fell in love with Edward Pettigrew (Colin Firth), gave up a promising chance at becoming an opera singer, settled down at her family estate and raised a big family. Edward is a typical country gentry of his time - owns a minor business (turning sphagnum moss into medical dressings), a pious man and defender of traditional values (gives a speech at every Sunday service), loves and listens only to Beethoven, and has a passion for inventions and mechanical improvements all over the estate. All of which are laughed at by Morris, who lives in London but comes back to visit often, as he is competing with Edward to inherit the estate after Gamma passes away; the two could barely conceal their loathing for each other. Edward does not appreciate and resists waves of new changes in the world, but the harder he tries, the more things fall apart. Morris and his beautiful and charming French fiancee Heloise (Irène Jacob) introduce jazz to the children (\"the sound of devil speaking\" according to Edward). An emergency landing brought the eldest daughter Elspeth's (Kelly Macdonald) first suitor - a French show pilot Gabriel Chenoux (Tchéky Karyo). Fraser discovers grandfather MacIntosh's book collection in the attic, as an act of rebellion against Edward, took interest in reading them all. Without guidance, he misunderstood the definition of \"prostitution\", believing it to be a business term, suggests to all guests at Morris and Heloise's engagement party that Moira, Heloise and Gamma should go into prostitution to enhance the moss business. Worst of all, Edward finds himself drawn to Heloise, and having a brief affair with her prior to the wedding. While passing out food during a curling game held in her husband's honor, Gamma fell into the lake. Although she was pulled up immediately, she died of pneumonia soon after. Gamma left the estate to Edward, leading to the ultimate altercation between Edward and Morris at her wake. Edward boasts about that Morris has lost more than the estate to him, causing Moira to finally confront him and tell him that she is aware of his affair with Heloise all along. It took months before Edward's efforts finally won back Moira, and the family settles back to its old routine. On a Sunday morning, all Pettigrews are heading toward the church, except Fraser. Edward finds him relaxing in a chaise lounge in the library, a cognac glass filled with milk in one hand, a lit cigar in the other, swaying his head and body to Louis Armstrong's \"On the Sunny Side of the Street\" (a secret gift from Heloise). Instead of thrown into a fit of rage, he smiles and closes the door, leaving Fraser to enjoy himself.",
      "writers": [
         "Denis Forman",
         "Simon Donald"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120899/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI2NDk3MDc1M15BMl5BanBnXkFtZTcwOTUwMzgxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Colin Firth, Rosemary Harris, Irène Jacob | See full cast and crew »"],
      "reviews": [
         "This is a delightful movie. It's based on a man's nostalgic look backward at a slice of his childhood spent on a Scottish country estate in the 1920s. Narrated by the author as a ten-year-old boy, it recounts a period in which both he and his capricious father learn some important lessons about themselves and about each other. There is little plot to speak of--just life unfolding variously in its sweetness and pain, often tinged with a delicious whimsy. Be warned, though, that much as you may be disposed to like the father, he is a flawed man; his pathetic and childish attitudes are often painfully embarrassing to the viewer. Also, sexual references permeate this film, and there is a strong suggestion that youthful sexual curiosity ought to be given free reign. Parents with a contrary view might wish to give it a look before showing it to their children. The cinematography is excellent, deftly making the most of the fine Scottish landscape. But the music--ah! The music is wonderful, from the first folk-tinged strain, through Beethoven and Saint-Saëns, to the Louis Armstrong ending. Few films are so musically satisfying. The role of the childish and inarticulate father, Edward Pettigrew, is nicely developed by Colin Firth. Rosemary Harris is his aristocratic, but good-natured mother-in-law, who actually owns the estate inhabited by her daughter and Edward and their progeny; Harris handles her part with great understanding and humour. The children are natural and believable, and the servants are well-picked and quirky--their kitchen conversations add much warmth to this work. For me, the ending credits revealed a lovely surprise: that the reflections of the boy, Fraser Pettigrew, actually come from a memoir written by Sir Denis Forman. I know that name well; Forman is also the author of my favorite opera guide, a cleverly designed, but funny and irreverent book appropriately titled, \"The Good Opera Guide.\" (But don't be put off by the U.S. title, \"A Night at the Opera\"; it's a wonderful book by any name.) Small wonder, then, that this movie has such a fine soundtrack. Rating: 8 for the movie, 10 for the opera book.",
         "Many summaries have described this film's plot as a love triangle that occurs in turn-of-the-century Scotland. Nonsense. What is this tendency to pigeonhole films by the time and place in which they occurred? Maybe its because of Hollow-wood's tendency to create shallow \"costume dramas.\" If a film has any merit at all, it is because it TRANSCENDS its setting, and speaks to its audience, whoever and wherever they are. \"My Life So Far\" is a story of the intellectual development of a very bright child. His piecing together and puzzling out of the complex emotions of the people around him, in addition to his own feelings and experiences, and the information he receives via overheard conversations, books, music and so forth are interesting and original and seem totally spontaneous. It is a joy to experience what he experiences. The ensemble acting is effortless, especially the child actor, who is so spontaneous and self-absorbed, you feel you are a member of the family, not an onlooker. Production values are sterling. The shots of the huge Scottish castle and its beautiful lands are somehow comforting. (This is neither a child's film, nor an adult's film. \"My Life So Far\" doesn't really have a niche, and that may be why it has not been widely distributed). It is a film to see to renew your memories of being a child and to cause you to meditate on what daily life can be like for a child who is alert, intelligent, and surrounded by love and a good home.",
         "My husband and I just watched this beautifully performed movie. It is an old fashioned movie with wonderful scenery of the Highlands of Scotland. Of a life that is no more. Robert Norman as Fraser the little boy is perfect for the part. He is very curious and causes no end of trouble. This movie takes place after World War I and is based on the novel \"Son of Adam\" by Sir Denis Forman. It is a gentle movie and I highly recommend it to those people who want spend an hour and a half in a time that will not come back. Rosemary Harris as Gamma, as always, is perfect. ColinFirth as Edward the dreamer, inventor and father plays the part to perfection. Both Irene Jacob and May Elizabeth Mastrantonio are beautiful and a pleasure to watch. Do see it.",
         "It is rare to see a sweet and lovely movie but this is one ... a great way to spend the afternoon. A nice family story, although with really young kids you might have to explain some of the things \"Wee Fraser\" discovers up in his Grampa's attic. (Should you find your attention wandering and this not being your kind of movie, just fast-forward to the dinner scene and the very final scene: those two scenes should go down in movie history as the most adorable ever made! (A Family Dinners will never be the same when you consider a little bit of knowledge gets a little out of hand --- and maybe dad does know best!)",
         "I saw My Life So Far at a preview screening and loved it. It's a small, modest movie; don't go expecting \"Saving Pvt Ryan.\" But for what it is it's wonderful--like escaping from a fetid city and diving into a clear cool lake. It's one of those comedies of family life that both adults and (older) children can enjoy--the kind \"they used to make.\" The ten-year-old narrator doesn't understand a lot of what he sees going on around him (mainly sex), but the audience does. Set in the Scottish highlands in the mid-thirties, it evokes the kind of idyllic life that vanished after the War--a large extended family living in a big ramshackle house on old family property with dogs, servants, neighbors and occasionally an unexpected visitor or two. There's not much story to the film; it's mainly about the rather eccentric characters who inhabit it, and the way they relate to each other. The ensemble cast of British, French and American actors is perfect. Especially fine is Colin Firth, who plays the narrator's boyish, sexy and definitely oddball father. Every time I see this actor I marvel at how he manages to display so many conflicting emotions and thoughts while seeming never to move a muscle. And he's gorgeous to look upon, too. Rosemary Harris gives one of her typically fine performances as the boy's grandma, and Mary Elizabeth Mastrantonio manages to do a great deal with rather little as the boy's mother. Malcolm McDowell is the wealthy uncle with the child bride (Irene Jacob) who is everything that Firth isn't. The tension between them is almost palpable and erupts into a fistfight before the film's end. My only reservation about the acting is with Robbie Norman as the kid; he is cute in a freckle-faced way but not very expressive (especially set beside Firth). All in all, I give this film a 9. There's still something to be said for modesty, humor and charm. I wish there were more films like it.",
         "This is one of the least know, but most charming films I have ever scene.seen. Every child deserves to have a father like Edward Pettigrew (Firth). As Frazier describes his father, \" Father is an inventer and a genius!!!\" The film begins with a toddler Frazier, disliking his rest time, decides to have an adventure by crawling around the roof of the family castle in Argyll, Scotland. Father climbs down the steep roof with a rope attached to his waist and rescues wee Frazier, all the while barking like a dog. Frazier, (who makes comments throughout the film), observes that at that time in his life, he and his father ONLY communicated in DOG, the language they both spoke best. Naturally the film has a romantic and potentially explosively moment between Father and his brother-in-law's fiance- a 24 year old French muscian who is quite beautiful and charming. She is also very wise for her years and managed to defuse the situation before it blows up. Never-the-less, the wife, played beautifully by Mary Elizabeth Mastreontonio, finds out at a crucial moment in the film and those rock-solid marriage nearly ends at a most tragic time in young Frazier's life. But father, being a genius, finds a way to heal the wounds caused by his split-second decision to give in to his baser instincts. The WAY he gets his wife to forgive him and laugh again is pure magic. Colin Firth never looked so handsome. Not even his glorious Mr. Darcy is so appealing. This role gives him the opportunity to show all his sides. His glorious, looney sense of humor as well as his gift for drama without words. Here he is active, leaping into a freezing cold Locke, running up and down stairs, inventing things, saving his son, dancing with his wife. He gets to laugh and cry and be HUMAN. For those who discovered Colin Firth as Mr. Darcy, My Life So Far is the glorious update! My Life So Far in DVD has a place on honor in my collection of over 500 DVD's and VHS' One of my favorites, and, I hope soon to be yours.",
         "Beautiful music fills the theater, and a view of a lovely castle, the light all brown and gold, then a children's room, curtains drawn for nap time, or \"rest time, \" a Gamma calls it. Fraser hates rest time. He pulls his bed over to the window, parts the curtains, climbs out the window and starts out on his housetop journey - the journey that brings his father, resplendent in tennis white and cream bounding up the stairs, long legs moving fast. And ends with Dad barking like a dog, and little son barking back until he is safely swept up into Edward's arms and hoisted high on the roof for all to see. It is a wonderful beginning to a family saga. It manages to tell us almost everything about the kind of child Fraser is, and the kind of father he has -- Almost everything, but not all. In the course of the film we see that Edward Pettigrew is many things, an inventor of hair brained gadgets, an exuberant dad to his children, a lover to his wife, a trial to his mother-in-law, a fool to his brother-in-law, a kind employer to the house staff. But most of all, he is a man with the heart of a child. There are times when the child Fraser is more mature than Edward the dad. I never felt the film was fragmented, because the central theme, Edward's lust for Heloise, held the movie together, and gave it shape. And he DID lust for her, did something to her in the sphagnum moss storage room, something unwanted, and aggressive enough to take her choker from her neck, leave them both with moss clinging to their hair -- something to cause us to hear one wild scream from Heliose. Edward's jealousy of Fraser's friendship with the beautiful Frenchwoman is a child's jealousy. Edward tries to push Fraser to the side; he vies with his son for Heloise's attention, and by his boorish, childlike actions, he opens himself to her public ridicule of him at table. Colin Firth has one of his best roles here. He allows us to see a man with so many warring degrees of character - kindness and cruelty, foolishness and intelligence. And the man is funny too. There is a scene where he attempts to tell the facts of life to Fraser that is priceless. A perfect place for the stammer. For the Firth fans of us, he is rugged of face and the liquid brown eyes have never been more expressive. There is one particular scene where you could drown in them! He is trim of body, walks the walk all over the heather, wears clothes to die for. There is one suit that he wore for hunting that I loved - dark brown with knickers, and with the most fetching brown slouch hat. And that Scottish accent! Divine! Best of all, is a scene in pajamas, alone by the fire, the light playing on his face, his head back, a bit of suprasternal notch showing. Sighs were heard all up and down our row. Yes, I liked it. Everyone was excellent in it. I particularly loved Mary Elizabeth Mastrantonio's sweet expressive face, and her singing voice is lovely. Robert Burns never sounded more haunting or romantic. McDowell was hard edged, not a likeable man, but one that loved his mother very much -- and his young wife. You could especially see that when Edward taunts him in the climatic scene. Young Fraser is a natural, and I thought his discoveries in his grandfather's attic, and his obsession with \"sins of the flesh,\" very real for a bright ten year old in 1920 who was never told any of the things he really wanted to know. The Louie Armstrong/jazz/cigar/brandy snifter scene shown in the trailer becomes much sweeter and sadder when you see the film. There is an extra ingredient that makes it so. I wanted to be a guest in that house where smokes billows from the lawn, the master rides around in tiny inflatable boats, or tank like vehicles, where lovers waltz in their nightclothes in the rain. Where eccentricity is treated with forbearance -- until Eve enters the scene and changes the family forever. *************",
         "My Life So Far is a charming film, sweet without being syrupy, endearing but not bland, pointed yet not preachy. It is a gently meandering memoir of an idyllic age and place which probably never really was, but which we wish to believe existed once upon a time, populated by people we would be happy to know. Mostly, it is the joyous celebration of a devoted, loving, though imperfect, family, which not only survives its crises, but is, one feels, strengthened by them. The cinematography is breathtaking, making the most of the lush landscape, the opulent sets and the expressive actors. The screenplay is filled with poignant moments, both humorous and dramatic, while the acting is quietly beautiful and detailed, from Rosemary Harris' superb Gamma to Robert Norman's refreshing 10-year old Fraser. Colin Firth's stunningly rich, yet understated, performance as Edward, the complex father, by turns madcap inventor, loving husband, hypocrite, fool and life-embracing dreamer is a wonder. My Life So Far provides a delightfully rewarding escape from our rude, crude world to a paradise which, if not perfect, is perfectly enchanting.",
         "\"My Life So Far\" is based on a true account of life in a Scottish family between WWI and WWII. It was filmed around Argyll, Scotland, and is certainly a beautiful movie to watch. The story is told from a 10-year-old boy's point of view. His rather large family (8 or 10 children) live on the estate of his mother's mother. His dad is a bright man but is a somewhat impractical inventor. The single, rich uncle is threatening to evict them all when the matriarch dies. The story unfolds nicely, the father comes to grips with some of his faults, relationships are examined. Music is well-integrated throughout the movie. It ends in a very satisfactory manner. This basically \"slice of life\" movie holds your interest and is overall very entertaining. Not an earth-shaker, I give it a strong \"7\" of \"10\", meaning for me that it is better than 70% of the movies out there.",
         "This is a personal story, through the eyes of an innocent Scottish child. The movie follows the tradition of pearls like My Life As A Gog, and When Father Was Away On Business (Emir Kusturica). Hugh Hudson that had quite too few movies (maybe due to the unsuccessful Revolution. In this movie Hudson returns to the Scottish Highlands that he treated so well in Chariots of Fire. This Scottish delight is dedicated to the late Ian Charlson of the Cariots, who portrayed so well the Christian spirit that is evident in this one."
      ],
      "genres": [
         "Biography",
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Enigma Productions",
         "Hudson Film",
         "Miramax"
      ],
      "summaries": ["Memoir of the lives of a family growing up on a post World War I British estate headed up by a strong disciplinarian, her daughter, her inventor husband, their ten year old son, and his older sister. Through the household comes a number of suitors hoping to impress the young woman, including an aviator. When the elder woman's son shows up at the estate with his French fiancé, everything gets thrown into turmoil. The young boy takes a sudden interest in her sexual allure and his father is disturbed by his own non-Victorian feelings."],
      "budget": 0
   },
   "movielensId": 2711,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-08-25",
      "dvdReleaseDate": "2000-01-25",
      "directors": ["Hugh Hudson"],
      "runtime": 98,
      "movieId": 2711,
      "title": "My Life So Far",
      "mpaa": "PG-13",
      "actors": [
         "Colin Firth",
         "Rosemary Harris",
         "Irène Jacob",
         "Mary Elizabeth Mastrantonio",
         "Malcolm McDowell",
         "Robert Norman",
         "Tchéky Karyo",
         "Kelly Macdonald",
         "Roddy McDonald",
         "Daniel Baird",
         "Jennifer Fergie",
         "Kristin Smith",
         "Sean Scanlan",
         "John Bett",
         "Anne Lacey"
      ],
      "imdbMovieId": "0120899",
      "originalTitle": "My Life So Far",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["sP3KI7_pbkc"],
      "plotSummary": "Memoir of the lives of a family growing up on a post World War I British estate headed up by a strong disciplinarian, her daughter, her inventor husband, their ten year old son, and his older sister. Through the household comes a number of suitors hoping to impress the young woman, including an aviator. When the elder woman's son shows up at the estate with his French fiancé, everything gets thrown into turmoil. The young boy takes a sudden interest in her sexual allure and his father is disturbed by his own non-Victorian feelings.",
      "tmdbMovieId": 48958,
      "avgRating": 3.53561,
      "releaseYear": "1999",
      "numRatings": 337,
      "posterPath": "/fMeIRG7klgqXWpUrneqnbe4i4NV.jpg"
   }
}