{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0120878",
      "video": false,
      "title": "The Velocity of Gary",
      "recommendations": [17447],
      "backdrop_path": "/ki82FUhmzh7QMZ9af9QIjDwQo9V.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Valentino",
               "gender": 2,
               "credit_id": "52fe4bb7c3a368484e1963e1",
               "name": "Vincent D'Onofrio",
               "profile_path": "/lUEn7f7xCLuT1kRCHoxMTRnYKXW.jpg",
               "id": 7132,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Mary Carmen",
               "gender": 1,
               "credit_id": "52fe4bb7c3a368484e1963e5",
               "name": "Salma Hayek",
               "profile_path": "/u5mg73xKVqm8oT93HoMmsgQHyoK.jpg",
               "id": 3136,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Gary",
               "gender": 2,
               "credit_id": "52fe4bb7c3a368484e1963e9",
               "name": "Thomas Jane",
               "profile_path": "/xAES23Ll0JT0lJADA1SIdTAN0bf.jpg",
               "id": 11155,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Veronica",
               "gender": 1,
               "credit_id": "52fe4bb7c3a368484e1963ed",
               "name": "Olivia d'Abo",
               "profile_path": "/l7m7nw7wQFvc2ROXOTa4Flblh4M.jpg",
               "id": 46423,
               "order": 3
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4bb6c3a368484e1963d7",
               "name": "Dan Ireland",
               "profile_path": null,
               "id": 69099,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4bb7c3a368484e1963dd",
               "name": "James Still",
               "profile_path": null,
               "id": 110562,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.671096,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 133575,
      "vote_count": 5,
      "budget": 4000000,
      "overview": "Gary is in love with Valentino. So is Mary Carmen. Their life changes when Valentino is hit with a deadly disease and is slowly dying in their hands. They tear each other off to end up re-uniting upon their love for the same man.",
      "similar": [],
      "original_title": "The Velocity of Gary",
      "runtime": 100,
      "poster_path": "/pAnuN0JCZci5mn8aH7oq1hjpaQz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ventanarosa Productions",
            "id": 689,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cineville",
            "id": 2832,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dan Lupovitz Productions",
            "id": 80578,
            "origin_country": ""
         },
         {
            "logo_path": "/nLVD1WEr9ej0if7mIsonSOnUdaQ.png",
            "name": "Columbia TriStar Home Entertainment",
            "id": 10202,
            "origin_country": ""
         }
      ],
      "release_date": "1999-07-16",
      "vote_average": 4.2,
      "belongs_to_collection": null,
      "tagline": "*(Not His Real Name)",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dan Ireland"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["James Still"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120878/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MDIzNjY2MF5BMl5BanBnXkFtZTcwNzY0MTUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Vincent D'Onofrio, Salma Hayek, Thomas Jane | See full cast and crew »"],
      "reviews": [
         "Let's just say, this movie was pretty boring when we weren't hunting for man kisses. It had its moments, there were some pretty sad/funny parts, but the highlights of the movie were (SPOILER ALERT!) the opening scene with Tommy Jane showering in the street and then strutting like its gay 1985 in wet jeans (He struts for a really long time, folks.); the first man-kiss, which was very, very hottt, quite passionate, go Vincent D'Onofrio and Tommy Jane, I commend you; then the second man kiss in the phone sex cubicle was out of this world! Seriously, ladies (and fellas, wink wink) it was the man make-out to end all man make-outs....or begin them! If you can think of anymore movies with man make-out scenes, please, I beg of you, contact me. I need to get my fix...of good old fashioned man-loving; then there was the dance number, which was slightly marred by Salma Hayek, who was insanely annoying throughout the movie, so annoying, in fact, that she makes any decent, god-fearing, man-kiss loving women in the audience seriously consider taking the skin off their forearms and turning it into a penis right then and there. Anyhow, the scene at the club is really something, you just watch it and see. Tommy Jane knows how to dance like a gay man (and strut like a gay man, and make out like a gay man, and get a tattoo like a gay man, and weep like a gay man. In fact, it almost makes you start to wonder....); and the last great scene was when Tommy Jane was reading Dracula to Vincent D'Onofrio when he was dying of (SPOILER ALERT!!) the heartbreak of A.I.D.s and he was, like, imagining, I guess, that Vincent D'Onofrio was like, biting his neck and it was orgasmic, or something. Whatever it was, it was hot, hot with several t's. The rest of the movie, eh, watch it through once, but really, just jump to the hot scenes after that first time. Signed, Two Satisfied Bitc--Ladies",
         "It's painful to watch competent actors slumming in this movie. You know they are reaching for something \"cool\" and knowing, when what they ultimately grab at is something infantile and delusional. This is probably the writer James Still's point: that these people need to look death in the face and grow up. But it's such a mundane point. If death is all around you, if the people you know are dropping like flies, and you figure the remedy is to get along with the people who are left (because they may be gone tomorrow) and have children of your own (so you feel death has not defeated you), why stay among people whose habits issue in death? Why impose the specter of sexual caution and responsibility, when what makes the people in this movie who they are flies in the face of this appeal? I don't think the main characters Valentino, Mary Carmen, and Gary form a bisexual triangle, because they want to lead wary, conventional lives. The thought presented here that bisexuality can be the common ground on which homosexuals and heterosexuals can come together is sly pontificating, and when you consider the way the camera languishes over the liplock Vincent D'Onofrio is made to plant on Thomas Jane, you get the feeling that the heterosexual side is taking a back seat to the flip side of the triangle. This really seems like Gary's story anyway; Selma Hayek is trying much too hard to garner some respect and dignity for Mary Carmen for it to be hers. Director Dan Ireland should have pulled her in more; it might have done wonders for her big moment, when she lip-syncs to Diana Ross' \"Ain't No Mountain High Enough.\" It's supposed to suggest the strength of her attachment to her lover, but Hayek hasn't been asked to play it deeply. She declaims everything, so what she emotes spreads out too thinly. It's Thomas Jane's reticence that convinces us of whom the story favors. When his body surrenders to Valentino on the dance floor, or his eyes roll back with Valentino's teeth in his neck, or he broods quietly when Valentino and Mary Carmen are sharing intimacies, the sexual undercurrent he creates pulls you under with great impetus. This must be what Still means by Gary's velocity. At least that is what I figure. But if I happen to be wrong, what in blazes does that pretentious title mean?",
         "What a pleasure it is to discover a little film which presents little pieces of your own life story. This is a film that I imagine many will question what the hell is the point. It feels like an exploratory independent film that doesn't try to be very clever or cool, just an ordinary story with plenty of room for randomness. As it fits in neither the energetic class of cinema characterized by Tarantino and Fellini, nor the understated class a la Hou Hsiao-Hsien and Gus Van Sant, it won't impress the entertainment seekers and may not work for the purists. That said, I personally liked it more than not. The great Michelangelo Antonioni said that films are not to be understood; they are to be experienced. As a film VELOCITY may not score high, but viewing it was an experience which I will not forget soon. The scenes with the deaf boy in drag were simply poignant and memorable. I'll never forget the priceless look on his face when his wig was pulled away by the rascals. It was a look which captured a thousand unspoken words that few, if any, Hollywood star would be capable of replicating. His pursuit of Gary brings back traces of my own memory. For me, this character was the primary saving grace of the film; his \"acting\" was superb, so heart-felt that I'm not sure if it's acting or reality--probably a hybrid of both. In summary, VELOCITY is a film where some fragments are better than the whole package. Whether or not you can enjoy the film probably depends on how much your life experience draws you to the characters.",
         "SPOILERS: I sure didn't expect so many negative comments on this movie. Although I didn't love it myself, I wouldn't call it the worst movie ever made. I'd actually give it about a 6 which basically means I neither loved it nor hated it. I really liked the premise and I sure felt the poignancy but did not really love how the movie played out in general. In case someone is reading this who has no idea what it is about and does not mind major spoilers, I will say only that it concerns three individuals in the sex industry, Valentino, Mary Carmen and Gary. Valentino is bi sexual and having a relationship with both characters and they become a sort of little family, particularly when one of the characters becomes very ill(with something that appears to be Aids though the word is never really used). Anyway..this is their story-theirs and a few supporting characters along the way and a dog....Anyway.... First the good. The performances ranged from good to outstanding with Salma Hayak being the scene stealer. Although the main characters are in the sex industry this movie's major focus is not sex, although some of that is certainly present. It is more about how the characters' relate to each other and the interaction between Mary Carmen and Gary is pretty interesting and for people who like to analyze human behavior in movies, there will be a lot to analyze here. And then there's the poignancy itself. I was very moved by the story. It was very sad and the performers do a very good job in portraying the range of emotions their characters are feeling. I really felt a lot was well done and really don't think this film deserves a below average rating. Now the negatives. I felt the way the movie played was just to arty in tone. It didn't need to be because the story was there. It took away from the story though. There was a lot from the imagery to the individual scenes themselves that just reeked of an arty experimental quality that was distracting and took away from the movie. I also felt that there was just to much squabbling between Gary and Mary Carmen and frankly, the movie just wasn't very enjoyable to watch as a whole. The whole subplot with the dog disappearing(and his journey and re appearance) I didn't feel added much. I felt the strength of the film was the human element to the characters, the clear feelings of both love and anger that were so apparent-not much difference from many real life relationships..and the ability of the movie to immerse one in it's plot, even if it isn't much fun to watch overall. But I think I would have liked it more, if it had toned down some of the arty aspects and some of the previous stuff mentioned. I would neither recommend this movie or not recommend it. I liked the premise and appreciated the movie even if it isn't one of my favorites. My rating's a perfect 6.",
         "I found this movie to be utterly unsatisfying because of its excursions away from the story, (which was unfocused to begin with) and the poor editing job. Some of the acting was passable, but I did not believe any of the characters were \"real\", with the exception of the black drag queens. This was a script that could have gone somewhere and instead lay on the floor like the egg the movie turned out to be.",
         "\"THE VELOCITY OF GARY\" starts out promising and quite cinematic with hunky Thomas Jane as daylight cowboy Gary (not his real name) showering in one of New York's open hydrants. Montage of Gary (n.h.r.n) in every cinematographer's NY tribute from Bowery to Brooklyn, which makes Gary (nhrn) one busy cruiser. Next up, Gary (nhrn) reluctantly comes to the aid of a young drag queen whose straight off the bus from one of the square states (swinging her suitcase and grinning as if she's just landed in the Greenwich Village of the musical \"Wonderful Town\" not the real-life scaresville of today) and is promptly set upon by gay bashers. Suffice it to say, the kid learns that interesting people do indeed live on Christopher Street. Unfortunately, this collection of downtown losers is of far more interest to themselves than us. Under-developed and preening constantly, they speak in bad poetic jargon (the film's stage roots showing terribly) and manage to grate on our nerves in a New York minute. Selma Hayek (real name) and Jane (real name) are both oddly drawn to super-loser bisexual idiot played by Vincent D'Onofrio (who should change his name after helping produce this mess). All need a haircut in the worst way, making their adventure look like a 60's flashback when it's anything but. Everything goes downhill after the first flash forward and never recovers. \"The Velocity of Gary\" is lacks both velocity and veracity. You're better off not having known their real names.",
         "What am I to write about this film? Vincent D'Onofrio is one of the most bizarre actors to cross the screen, for my money. He plays a role that garners no sympathy at all, but builds a character to whom I can't help but relate. Thomas Jane and Selma Hayek are the most undeveloped, hard-edged characters in the film and seem hardly correct in the triune that includes the likes of Valentino (Vincent D'Onofrio). This is a seedy, unwashed film and I kept seeing things I hated in the first, second, and third times I watched it. And for some reason I keep watching it. The mixed sexual interactions are nauseating to me, and the shallow values of the principals presents them as flotsam, barely above hobo status and the sorts of souls to be found in any big city anywhere. But, they still \"live,\" and ultimately force my attention to their pathetic and at once selfish and self destructive lives.",
         "This film is one of the best I have seen in a very long time Vincent D'Onofrio is as gorgeous and as a fantastic actor as he is always is as the completely sexy Valantino! He is the true star of the film, Gary is a very complex character and Salma Hayek is on the verge of been obsessed with Valantino. I believe it shows a beautiful love story between three people no matter what gender or sexual orientation. The two best scenes have to be the second kissing scene between Vincent D'Onofrio and Thomas Jane as it looks seriously as two people in love rather than the director trying to force them to be together and the second best scene has to be the Halloween drag singing one that had me in stitches just for the fact that Vincent D'Onofrio is about 2 foot taller than all the extras!!!! I would seriously recommend this film to everyone especially those who already rate Vincent D'Onofrios fantastic talent as an actor",
         "Not a main stream movie by any means. This movie is funny, exciting, sad, and uplifting. See this film for Thomas Jane, Salma Hayek, the funny drag queens and the cool photography. I liked the music too. The film was a little slow in some parts but well worth",
         "Gary (Thomas Jane)is a young street hustler living day to day. His life becomes very complicated when he falls in love with Valentino (Vincent D'Onofrio), an actor in porn movies that seems to have a following made up of life's castaways. Valentino has baggage in the form of free-spirited waitress Mary Carmen(Salma Hayek)...offering unlimited availability. Their living consequence is precarious to say the least; then Valentino tests HIV-positive. Gary must make a life altering decision concerning his future with the now pregnant Mary. D'Onofrio is outstanding and Miss Hayek is too beautiful to be true...with or sans makeup. A grim movie with comedic elements, but smothered with strong sexual content. The cast also features: Olivia d'Abo, Ethan Hawke and Shawn Michael Howard."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Cineville",
         "Columbia TriStar Home Video",
         "Dan Lupovitz Productions"
      ],
      "summaries": [
         "Valentino is an Ex Adult film star very much in love with his girlfriend Mary Carmen....and boyfriend Gary. Things take a tragic turn when Valentino is rushed to the hospital after collapsing on a city street and is diagnosed with HIV/AIDS...Forcing Mary Carmen and Gary to push aside their jealousy & differences to take care of the man they both love while he is dying. Ultimately finding comfort, understanding, and strength in the other. A beautiful modern love story with a fantastic cast. Vincent D'Onofrio is very charismatic, charming, and intense as Valentino.....",
         "Gary is in love with Valentino. So is Mary Carmen. Their life changes when Valentino is hit with a deadly disease and is slowly dying in their hands. They tear each other off to end up re-uniting upon their love for the same man."
      ],
      "budget": 4000000
   },
   "movielensId": 2715,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-07-16",
      "dvdReleaseDate": "2004-04-13",
      "directors": ["Dan Ireland"],
      "runtime": 100,
      "movieId": 2715,
      "title": "The Velocity of Gary",
      "mpaa": "",
      "actors": [
         "Vincent D'Onofrio",
         "Salma Hayek",
         "Thomas Jane",
         "Olivia d'Abo"
      ],
      "imdbMovieId": "0120878",
      "originalTitle": "The Velocity of Gary",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["TdWU5O5tgpc"],
      "plotSummary": "Gary is in love with Valentino. So is Mary Carmen. Their life changes when Valentino is hit with a deadly disease and is slowly dying in their hands. They tear each other off to end up re-uniting upon their love for the same man.",
      "tmdbMovieId": 133575,
      "avgRating": 2.31481,
      "releaseYear": "1999",
      "numRatings": 135,
      "posterPath": "/rTCSO24BVkwQWpb0zL6yWeszkaP.jpg"
   }
}