{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "gadget",
         "id": 1683
      }],
      "imdb_id": "tt0141369",
      "video": false,
      "title": "Inspector Gadget",
      "recommendations": [
         19766,
         10603,
         11158,
         888,
         10054,
         9574,
         9354,
         1634,
         10992,
         11551,
         9822,
         3050,
         12589,
         12139,
         9327,
         10628,
         6878,
         26264,
         10923,
         10771
      ],
      "backdrop_path": "/rSVBuINAkGgJknWDbYOHZRJkCGF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Inspector Gadget / Robo Gadget / John Brown",
               "gender": 2,
               "credit_id": "52fe4238c3a36847f800d52d",
               "name": "Matthew Broderick",
               "profile_path": "/j9ETatVKFxYR5Ijk8l5tzKO4HPn.jpg",
               "id": 4756,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Sanford Scolex",
               "gender": 2,
               "credit_id": "52fe4238c3a36847f800d531",
               "name": "Rupert Everett",
               "profile_path": "/jGTaV5htTRo2T0aeM2eoHZcpLG4.jpg",
               "id": 4757,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Brenda / Robobrenda",
               "gender": 1,
               "credit_id": "52fe4238c3a36847f800d535",
               "name": "Joely Fisher",
               "profile_path": "/iaF9zT6qTv2BFer22kEhqacCL38.jpg",
               "id": 4758,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Penny",
               "gender": 1,
               "credit_id": "52fe4239c3a36847f800d539",
               "name": "Michelle Trachtenberg",
               "profile_path": "/jLkEO1ggRke1PQ6XZ2kZpVXMrob.jpg",
               "id": 49961,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Kramer",
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d53d",
               "name": "Andy Dick",
               "profile_path": "/ebNRu8oV7Ifv5aoP23UyNnx0lZS.jpg",
               "id": 43120,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Mayor Wilson",
               "gender": 1,
               "credit_id": "52fe4239c3a36847f800d541",
               "name": "Cheri Oteri",
               "profile_path": "/1j7zUQberFkZ6YVMzG3b7nkajaQ.jpg",
               "id": 60252,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Sikes",
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d551",
               "name": "Mike Hagerty",
               "profile_path": "/xDfY3QdSlvS7UwDr6DP1YjYNgzu.jpg",
               "id": 15105,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Chief Quimby",
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d555",
               "name": "Dabney Coleman",
               "profile_path": "/95I1LdB2PS2RcAL4mqUzAmJWI5x.jpg",
               "id": 12850,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Gadgetmobile (voice)",
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d559",
               "name": "D. L. Hughley",
               "profile_path": "/f6yF5dhBEooYQWY2YAWbIptNhZU.jpg",
               "id": 85931,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Artemus Bradford",
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d55d",
               "name": "Rene Auberjonois",
               "profile_path": "/eAF43tqzBqq7Lgi7jG27BBUZ6Bp.jpg",
               "id": 9807,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Thelma",
               "gender": 0,
               "credit_id": "52fe4239c3a36847f800d561",
               "name": "Frances Bay",
               "profile_path": "/uaT5z1YQKZZ8WcYsnOnnI6DRWdW.jpg",
               "id": 11794,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d565",
               "name": "Mr. T",
               "profile_path": "/l594jKabKzYsak9hoCZ4bUrUv4R.jpg",
               "id": 16619,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Famous Big Guy with Silver Teeth",
               "gender": 0,
               "credit_id": "52fe4239c3a36847f800d569",
               "name": "Richard Kiel",
               "profile_path": "/wop4KV2ywl6gdYnCUs1OthtGylM.jpg",
               "id": 10460,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Famous Villain with Deadly Hat",
               "gender": 0,
               "credit_id": "52fe4239c3a36847f800d56d",
               "name": "Richard Lee-Sung",
               "profile_path": null,
               "id": 61709,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Famous Identifier of Sea Planes",
               "gender": 0,
               "credit_id": "52fe4239c3a36847f800d571",
               "name": "Bobby Bell",
               "profile_path": null,
               "id": 81414,
               "order": 14
            },
            {
               "cast_id": 24,
               "character": "",
               "gender": 1,
               "credit_id": "591258e8c3a368646b04f2b7",
               "name": "Karin Silvestri",
               "profile_path": "/dQ9YCbXe3DjOMhFp2jOgefCqj4x.jpg",
               "id": 1813644,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4238c3a36847f800d529",
               "name": "David Kellogg",
               "profile_path": "/8CqtSRR1QoLQGD1cbtoA1HwOF2u.jpg",
               "id": 4759,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d547",
               "name": "Dana Olsen",
               "profile_path": null,
               "id": 26978,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4239c3a36847f800d54d",
               "name": "Zak Penn",
               "profile_path": "/tPwOS2wk8FFoWpXnDYK77bKcuWB.jpg",
               "id": 11011,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4239c3a36847f800d577",
               "name": "Kerry Ehrin",
               "profile_path": null,
               "id": 1236253,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe4239c3a36847f800d57d",
               "name": "Kerry Ehrin",
               "profile_path": null,
               "id": 1236253,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5548cc8892514155ff001ef1",
               "name": "Merrick Rustia",
               "profile_path": null,
               "id": 1447497,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 1,
               "credit_id": "591258f9c3a36864c604a5a4",
               "name": "Karin Silvestri",
               "profile_path": "/dQ9YCbXe3DjOMhFp2jOgefCqj4x.jpg",
               "id": 1813644,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.279295,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 332,
      "vote_count": 418,
      "budget": 75000000,
      "overview": "John Brown is a bumbling but well-intentioned security guard who is badly injured in an explosion planned by an evil mastermind. He is taken to a laboratory, where Brenda, a leading robotics surgeon, replaces his damaged limbs with state-of-the-art gadgets and tools. Named \"Inspector Gadget\" by the press, John -- along with his niece, Penny, and her trusty dog, Brain -- uses his new powers to discover who was behind the explosion.",
      "similar": [
         19766,
         112140,
         313867,
         203684,
         351420,
         87364,
         438805,
         233713,
         443708
      ],
      "original_title": "Inspector Gadget",
      "runtime": 78,
      "poster_path": "/kvlKBGtyyNVyGJB72aD1vwPk2d4.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Norsk",
            "iso_639_1": "no"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "DiC Entertainment",
            "id": 20477,
            "origin_country": ""
         },
         {
            "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
            "name": "Walt Disney Pictures",
            "id": 2,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Caravan Pictures",
            "id": 175,
            "origin_country": ""
         }
      ],
      "release_date": "1999-07-23",
      "vote_average": 4.3,
      "belongs_to_collection": {
         "backdrop_path": "/AosJpZ6TvYFYtRzvgFfb82g2S70.jpg",
         "name": "Inspector Gadget Collection",
         "id": 237445,
         "poster_path": "/wP1En2StHVqmpsHRhTKlzFjTQyC.jpg"
      },
      "tagline": "The greatest hero ever assembled.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Kellogg"],
      "runtime": 78,
      "synopsis": "Security officer John Brown is a security guard, who one day dreams of becoming a real Police Officer. In the meantime, he is charged with guarding a science lab operated by Brenda Bradford, and her father. One evening, a break-in occurs, in which a top-secret robotics project is stolen, and Brenda's father is killed. John gives pursuit of the getaway vehicle, which houses famed millionaire Sanford Scolex, and his assistant, Sikes. The chase lead to both vehicles being damaged, with Scolex tossing an exploding cigar into John's car. The ensuing explosion blows a bowling ball out of John's car, and into Scolex's limo, crushing his hand. John's injuries are numerous, and Brenda wishes to apply the 'Gadget program' that she and her father were working on, to help mend John. John is then outfitted with a number of different gadgets, that leads to at first be terrified, until Brenda explains that his new and improved self can help make a difference in people's lives. Brenda helps Gadget get acclimated with his new self, and explains about the advanced control chip that powers his body. Without it, John would not be able to function. Brenda also provides Gadget with a jive-talking vehicle, dubbed The Gadgetmobile. Meanwhile, Scolex has had an assistant named Kramer, fashion a claw-like arm in place of his crushed hand, and considers changing his name to 'Claw.' The item that they stole from the Bradford's lab (a robotic foot) proves unable to respond to Kramer and Sike's tinkering, leading Scolex to think that something extra must be needed to make it work. Gadget is first made known by the City's Mayor, and Police Chief Quimby. Even though Gadget is assigned to the Police, Quimby still dislikes the idea of a machine being shoehorned into his department, and relegates Gadget to community projects...like rescuing cats from trees. After the announcement, a gala celebration is held, wherein Gadget accompanies Brenda to the festivities. At the event, Scolex appears, and offers Brenda her own facilities and funding. Though Gadget reminds her of her and her Father's work on the 'Gadget Program,' Brenda gladly accepts Scolex's offer, unaware of his plans to steal her technological ideas and designs. Gadget is also upset that he is not being taken seriously, and sets out to find out who killed Brenda's father, with the help of his niece Penny, and her dog Brain. A mechanical piece at the scene of the crime contains the initials 'SI,' leading Gadget to Scolex Industries. In the meantime, with Brenda working for him, Scolex has stolen several of her ideas, and crafted two robotic clones of his own: one a bimbo-like clone of Brenda, and another that is an evil clone of Inspector Gadget. While Scolex keeps Brenda's clone for himself, Robo-Gadget is sent out to terrorize the public. Gadget manages to break into Scolex's facility, but is captured when he tries to recover the robotic foot stolen from Brenda's lab. Gadget is then eliminated when Scolex has the 'Gadget Chip' destroyed, leaving his assistant Sikes to dump Gadget at the City Dump. In the aftermath, Robo-Gadget goes on a mad rampage, prompting Brenda and Penny to try and find the real Gadget. Using the Gadgetmobile, they find him in the dump, but without the chip. However, due to Gadget's caring and emotions, he manages to start back up, and everyone decides to go after Scolex. After dropping off Penny and Brain at home, Brenda and Gadget find Scolex's limo, containing both Scolex and Robo-Gadget. Gadget wrestles Robo-Gadget into the streets, and the two have a battle until Gadget finally wins. Gadget activiates his Gadgetcopter, and heads to Scolex's building, in time to see him flying away with Brenda. Gadget manages to disable the helicopter, and safely recovers Brenda. In the aftermath, Scolex and his assistant Sikes are arrested for the murder of Brenda's father, and as the Police arrive, Quimby acknowledges Gadget as an actual member of the police force. As Scolex is led away, he vows to get Gadget 'next time,' as the Inspector and Brenda head off.",
      "writers": [
         "Andy Heyward",
         "Jean Chalopin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0141369/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5NDkwMTUxN15BMl5BanBnXkFtZTcwNzM2OTMyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Matthew Broderick, Rupert Everett, Joely Fisher | See full cast and crew »"],
      "reviews": [
         "I grew up watching Inspector Gadget. It was, and still is, one of my favorite cartoons, if not my absolute favorite. I learned a lot of geography and history from the spin-off Inspector Gadget's Field Trip. I wanted to slip on a banana peel and become the greatest detective ever. But the film has ruined the reputation of the wonderful cartoon. Matthew Broderick, an actor with potential, was definitely NOT the role for Inspector Gadget. First thing- in the film, Inspector Gadget is smart. Not so in the cartoon. In the film, Gadget solves the mystery mostly by himself. In the cartoon, it was almost always Penny, Brain, and the awesome book (I still want her book!). If Gadget solved the mystery, it was by accident. Gadget in the film seems to be a competent detective, but in the cartoon was pretty dumb, which was where the humor came from. Another thing is that it's too much \"Good Guy v. Bad Guy\" in the film. It's not just meant to be a silly Saturday morning cartoon. Also, Gadget never should have a love story, but Disney Corporation is filled with idiots. Also I miss the true gadgets that Gadget had, and especially the Gadget car. In the movie it was a chic convertible. In the cartoon it was a sedan police car and could turn into a van. It also barely had any gadgets and was mainly there to get him from place to place. But if anything, the one thing that was terrible about the movie was that it was a feature movie. Inspector Gadget was a silly Saturday morning cartoon. The movie was too serious, too overdone, had too much of a plot and wasn't even remotely as funny. Tip for those who haven't seen it: NEVER see it. EVER. Watch the cartoon, it's a true classic.",
         "Film: Gadget's real name is John Brown. Cartoon: His name really is Gadget. --- Film: Claw's real name is Sanford Scolex. Cartoon: His name really is Claw. --- Film: Metro City is in the USA. Cartoon: Metro City is in Canada. --- Film: Gadget works for the local police department. Cartoon: Gadget works for Interpol. --- Film: Gadget used to be a security guard and was injured in an explosion. Cartoon: Gadget used to be a policeman and was injured when he slipped on a banana peel. --- Film: Claw's face is shown (and it looks nothing like the action figure). Cartoon: Claw's face is never shown. --- Film: Claw has a mechanical claw inplace of one of his hands. Cartoon: Claw has normal hands. --- Film: Quimby hates Gadget for no reason. Cartoon: Quimby thinks Gadget is one of Interpol's best inspectors. --- Film: The Gadget Mobile can talk and has many gadgets. Cartoon: The Gadget Mobile can't talk, can change from a police car to a van (and vice versa) and has only a few gadgets. --- Film: Gadget was put back together by a team of surgeons. Cartoon: Gadget was put back together by one man; Professor Baxter. --- Film: Claw is the head of Scolex Industries. Cartoon: Claw is the head of a criminal organization called MAD. --- Film: Claw has two minions. Cartoon: Claw has hundreds of minions. --- Film: Gadget has 60 gadgets. Cartoon: Gadget has 14,000 gadgets.",
         "Once again, Disney manages to make a children's movie which totally ignores its background. About the only thing common with this and the original Gadget cartoons is the names. The most glaring errors are the characters - Penny does not have her book, Brain has been reduced from a character to a fancy prop, Dr Claw is more a show-off than an evil villain, etc. but there are more than that. The horrors start from the first minutes of the film - having Gadget as a security guard called John Brown doesn't help identifying him as the classic Inspector Gadget. And right in the beginning we see Disney's blatant attempt to turn every story ever into a love affair between a man and a woman - they introduce Brenda, who only serves to make this movie Disney-compatible. Add to this the fact that the \"Claw\" seen in this film and the classic Dr Claw are almost diagonally opposite and you'll see this is going to be nowhere near the original storyline. What would help would be a better storyline to replace it - but as you guessed, Disney failed in that too. The whole movie is just Gadget acting silly for silliness's sake and lusting after Brenda. As if to add insult to the injury, Disney introduced the \"new\" Gadgetmobile - it doesn't look, function or think like the old Gadgetmobile at all, it's just the canonical \"comic relief\" figure. Disney obviously recognised that the Gadget cartoons were a comedy, so they made the film a comedy too, but they took out all the clever running gags (like the assignment paper exploding in the Chief's face) and replaced them with Gadget being a moron, the Gadgetmobile being a wise-ass, and \"Claw\" showing off. Someone should tell Disney that \"children's movie\" doesn't imply \"total lack of any brain usage\". Gadget should be targeted for children of 10-12 years... not children of 10-12 months like this movie. Whatever this movie is supposed to be, it is NOT, repeat NOT, the real Inspector Gadget. Because I love the old Gadget, I hate this.",
         "This movie is actually pretty good. It was much better than what most critics said. Now that is surprising though. Why? Because this was made by Disney, a studio (to put it nicely) I am really not fond of. Matthew Broderick does a good job as the title character (really). The other actors don't play their characters as well as they could have. Moving to a more positive aspect, the special effects are another major highlight of the movie. Same for the action and fight scenes. As for the story, it's okay. The story is pretty much a prequel to the animated series, showing Inspector Gadget's origin. It's far from perfect, but keep in mind this movie is based on a Saturday morning series from the eighties and intended for the kids. Thumbs up.",
         "I was a huge fan of the original cartoon series, and was looking forward to finally seeing Gadget on the big screen -- but I never in my wildest dreams expected something so extremely extremely terrible. The pace was WAY too fast, there was no plot, and 'wowser!' - what the hell is that?? It was 'WOWSERS!!'.",
         "I used to have a fascination with the cartoon back in college when it was being made. It had much the charm of \"Get Smart\". While it admittedly had its faults, it was rather enjoyable. Naturally I was very interested in seeing the film version. That was before I saw it. Afterwords I wished it had never been made. Besides being miscast all around (who on Earth though Broderick was even close to the role?) it just didn't make the grade. The effects were reasonable and perhaps the ONLY thing I liked about the movie; seeing a live-action version of the gadgets in action! What was missing was a story and treatment which made it funny or charming or interesting. The original was a wacky cartoon with a very lighthearted attitude. It was FUN. The motion picture became murky and took itself FAR too seriously. If it had seriously had a great plot or went crazy enough to make it seem like a \"cartoon on film\" it might have been enjoyable. As it exists it doesn't deserve to be considered part of the \"Gadget Legacy\".",
         "I grew up watching the old Inspector Gadget cartoon as a kid. It was like Get Smart for kids. Bumbling boob can't solve any case and all the work is done by the walking talking dog Brain and his niece Penny. I had heard the live action movie was decent so I checked it out at the library. I rented this movie for free and felt I should have been paid to see this. Broderick comes nowhere near the caliber of acting Don Adams had as the voice of gadget. His voice was all wrong. The girl who played Penny looked nothing like the cartoon Penny. She is brunette where the cartoon version was blonde with pigtails. But she does do a decent job given what she had to work with. Dabney Coleman gives a good performance as Cheif Quimby. Saldy he never hid in any odd place or had exploding messages tossed at him accidently by Gadget. The gadget mobile was wrong. It never talked in the series and it did fine. Why did they do this? Gadget was too intelligent in this film. In the show he was a complete idiot. Here he had a halfway decent intellect. It would have worked better if he was a moron. Also the completely butchered the catchphrase. Borderick says \"Wowser\". It is and should always be \"Wowsers\". It sounds lame with out the 's'. I got upset when they showed the previews and they didn't have the correct phrase. The ONLY decent gags were during the credits. The lacky for Claw is in front of a support group for recovering henchmen/sidekicks. Seated in the audience is Mr. T, Richard Keil aka Jaws of Bond movie fame, a Herve Villacheze look alike, Oddjob, Kato and more. This is about the only part I laughed at. The other is at the end where Penny is checking out here gadget watch and tells brain to say somethin. Don Adams voices the dog saying that \"Brain isn't in right now. Please leave your name at the sound of the woof. Woof.\" of course this isn't laugh out loud funny, just a nice piece of nostalgia to hear Adams in the movie. He should have at least voiced the stupid car. Kids will like this, anyone over 13 won't.",
         "Well. Where to begin. Let's just say this; avoid this movie at all costs. It's based on a cartoon series. The movie makes the cartoon look like Hamlet. Filled with emasculated actors who seem embarrassed to be here, lousy camera work, terrible music, and enough product placement to make you want to never visit Yahoo! again, this movie is really the bottom of the barrel. To quote the New Yorker, Matthew Broderick and Rupert Everett mug their way through this picture with the gay abandon of men who have spotted a rare species of paycheck in the distance.\" They should pay us some of the millions they earned for watching it. Awful.",
         "Children and adults alike are decidedly ill served by \"Inspector Gadget,\" a frenetic but genuinely mirthless live action take on the popular Saturday morning cartoon series that mires poor Matthew Broderick in the role of a nerdish do-gooder who gets the chance to live out his heroic fantasies when he is converted into a one-man, self-contained crime fighting cybernetic arsenal. Thanks to current state-of-the-art special effects, the filmmakers manage to effectively translate the cartoonish aspects of the original to the live action format. Despite a few glaringly bad shots utilizing rear screen projection, the visuals that help to realize the infinite gadgets at the inspector's disposal are genuinely jaw-dropping. What the movie makers couldn't (or, at least, wouldn't) come up with is a decent script - without which all the greatest special effects in the world cannot a quality film make. Gadget is surrounded by a gallery of dull, poorly written caricatures ranging from a giddy, self-absorbed mayor, to a gruff, shortsighted chief of police, and an effete mad scientist bent on creating an army of indestructible gadget warriors, with which, of course, he (ho hum) plans to rule the world. Even the newly \"hipified\" gadget mobile comes across as a charmless, grating irritant as he provides a constant stream of witless one-liners as running commentary to the action. Of the actors, Broderick and Rupert Everett cannot be faulted since both provide a degree of enthusiasm wholly unwarranted by the inferior screenplay with which they are saddled. For a perfect marriage of sophisticated writing and unsurpassable special effects, check out \"Toy Story 2.\" And see what \"Inspector Gadget\" might indeed have been.",
         "In between 1987 and 1990 (in between the ages of 5 and 8), \"Inspector Gadget\" was one TV show I couldn't miss. It was a crucial show to my childhood. I was actually pretty open-minded when I saw the trailers and commercials and stuff for the movie. When I found out it was going to premiere on the Starz channel, I sat and watched, for about 15 to 20 minutes. Then I got up, left, and came back in time to see the ending credits. I was just dumbfounded. There were SO MANY things WRONG with this movie: 1. Chief Quimby. In the cartoon, he would give Gadget his assignment, usually by popping up in the most bizarre of places (akin to \"Get Smart's\" Agent 13). Once Gadget got his assignment, he'd toss the paper back to the chief. Of course, EVERY assignment ended with \"This Message Will Self Destruct,\" and when Gadget tossed the paper back at Quimby, KA-BLAM!!!! Usually when the assignment blew up in the chief's face, he'd lose it. And that was about the only time you'd see Quimby lose it in the cartoon. In the movie, the chief was more uptight, and very bitter, and I think there were times where he HATED Gadget! By the end of the episode of the original cartoon, he would always praise Gadget for a job well done (not realizing it had been Penny and Brain that did the legwork). 2. Matthew Broderick is definitely not a believable Gadget. Gadget is supposed to be a bumbling fool, and incompetent. Broderick's portrayal kind of made him a little smarter than usual, but not very bumbling. 3. Inspector Gadget Meets Knight Rider! Seriously, they turned the Gadget Mobile into a car that talked. Like KITT on \"Knight Rider.\" In the original cartoon, IT NEVER TALKED!!!! Was that trip REALLY necessary? 4. Penny and Brain, or rather lack thereof. They're my favorite characters from the original show, and the fact that they were barely in this ticked me off big time. That, and Penny in the cartoon is a 10/11 year old blond girl in pigtails. In the movie, she's a brunette tween. I seem to remember at one point she was using the Top Secret Gadget phone to take a personal call from a friend. Penny and Brain are the ones who are supposed to solve the case. Such was not the situation in this movie. 5. I didn't like Gadget's love interest in this for some reason. I don't know why, she just rubbed me the wrong way. 6. This last one was the biggest, and the thing that REALLY ground my gears over this movie. Why, why, WHY did they cast Rupert Everett as Dr. Claw?! And what was with the name \"Claw?\" It was always DOCTOR CLAW in the cartoon! Everett looked too young to be Dr. Claw, and above all: they showed his face throughout the whole picture! That is just wrong! You're NOT supposed to SEE Dr. Claw's face, people!!!!! Seriously, this movie made me wonder something: Did they even WATCH the original cartoon before they made this?"
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Family",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Walt Disney Pictures",
         "Caravan Pictures",
         "DiC Enterprises"
      ],
      "summaries": [
         "A remake of the television series, Matthew Broderick stars as Gadget, who suffers an accident at the beginning of the film, and befriends Brenda, a robotic surgeon who repairs Gadget so that he can defeat the villain Claw. In the meantime, Gadget and Brenda fall in love.",
         "When Security Officer John Brown is horribly injured after chasing after a killer, Dr. Brenda Bradford sees it as a perfect opportunity for her new project to take place. When John wakes up, he finds his body changed. John Brown is now Inspector Gadget; a cybernetic police officer whose first plan is to hunt down the killer of Bradford's father.",
         "Security guard John Brown wants to be a cop. After a battle with a cyberthief leaves him critically injured, Brown's employer, Dr. Brenda Bradford, turns him into the robotic cybercop Inspector Gadget. Gadget and Brenda battle the Claw, an evil industrialist intent on stealing Brenda's technological secrets and destroying Gadget once and for all.",
         "A security guard's dreams come true when he is selected to be transformed into a cybernetic police officer."
      ],
      "budget": 75000000
   },
   "movielensId": 2720,
   "movielens": {
      "languages": [
         "English",
         "Norsk",
         "Français",
         "Español"
      ],
      "releaseDate": "1999-07-23",
      "dvdReleaseDate": "1999-12-07",
      "directors": ["David Kellogg"],
      "runtime": 78,
      "movieId": 2720,
      "title": "Inspector Gadget",
      "mpaa": "PG",
      "actors": [
         "Matthew Broderick",
         "Rupert Everett",
         "Joely Fisher",
         "Michelle Trachtenberg",
         "Andy Dick",
         "Cheri Oteri",
         "Mike Hagerty",
         "Dabney Coleman",
         "D. L. Hughley",
         "Rene Auberjonois",
         "Frances Bay",
         "Mr. T",
         "Richard Kiel",
         "Richard Lee-Sung",
         "Bobby Bell",
         "Karin Silvestri"
      ],
      "imdbMovieId": "0141369",
      "originalTitle": "Inspector Gadget",
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["M5IWHxiwYMg"],
      "plotSummary": "John Brown is a bumbling but well-intentioned security guard who is badly injured in an explosion planned by an evil mastermind. He is taken to a laboratory, where Brenda, a leading robotics surgeon, replaces his damaged limbs with state-of-the-art gadgets and tools. Named \"Inspector Gadget\" by the press, John -- along with his niece, Penny, and her trusty dog, Brain -- uses his new powers to discover who was behind the explosion.",
      "tmdbMovieId": 332,
      "avgRating": 2.14414,
      "releaseYear": "1999",
      "numRatings": 4853,
      "posterPath": "/kvlKBGtyyNVyGJB72aD1vwPk2d4.jpg"
   }
}