{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "independent film",
         "id": 10183
      }],
      "imdb_id": "tt0162830",
      "video": false,
      "title": "Twin Falls Idaho",
      "recommendations": [
         124686,
         55123,
         54752,
         50071,
         27286,
         32590,
         21056
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Blake Falls",
               "gender": 2,
               "credit_id": "52fe45189251416c91027555",
               "name": "Mark Polish",
               "profile_path": "/A1cSkWZaCJsuM8Gi4v6XUOBjspy.jpg",
               "id": 41886,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Francis Falls",
               "gender": 2,
               "credit_id": "52fe45189251416c91027559",
               "name": "Michael Polish",
               "profile_path": "/Ar5xyhNq9dT4LBwhW0hekutRyuC.jpg",
               "id": 41887,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Penny",
               "gender": 0,
               "credit_id": "52fe45189251416c9102755d",
               "name": "Michele Hicks",
               "profile_path": "/zReeqY2DRzFklCEa2xtopG0OEig.jpg",
               "id": 163642,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "5395bfcac3a36864460045f8",
               "name": "Jon Gries",
               "profile_path": "/yNhP4IZCMN10duIYKdHUFt8mJCU.jpg",
               "id": 9629,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 0,
               "credit_id": "5395bfe5c3a3684e36000e3a",
               "name": "Patrick Bauchau",
               "profile_path": "/eAlTfdwkw4xCU8UIxVCkL4LWYO5.jpg",
               "id": 5274,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "5395bff0c3a368642b004717",
               "name": "Garrett Morris",
               "profile_path": "/2Sd1njRdKzWEHNY2AqFZGTv1xtT.jpg",
               "id": 83187,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "5395c001c3a3686415004525",
               "name": "Lesley Ann Warren",
               "profile_path": "/4I5VPyumsxYGKST9b0FL2harYRK.jpg",
               "id": 21818,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45189251416c91027551",
               "name": "Michael Polish",
               "profile_path": "/Ar5xyhNq9dT4LBwhW0hekutRyuC.jpg",
               "id": 41887,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5395c02ac3a368643400463a",
               "name": "Mark Polish",
               "profile_path": "/A1cSkWZaCJsuM8Gi4v6XUOBjspy.jpg",
               "id": 41886,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58ebc7f7925141281908b4da",
               "name": "M. David Mullen",
               "profile_path": null,
               "id": 22119,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.169638,
      "production_countries": [],
      "id": 33430,
      "vote_count": 14,
      "budget": 0,
      "overview": "Francis and Blake Falls are Siamese twins who live in a neat little room in a rundown hotel. While sharing some organs, Blake is always fit and Francis is very sickly. Into their world comes a young lady, who turns their world upside down. She gets involved with Blake, and convinces the two to attend a Halloween party, where they can pass themselves off as wearing a costume. Eventually Francis becomes really ill, and they have to be separated. They then face the physical and mental strains that come from their proposed separation.",
      "similar": [
         3134,
         11564,
         281,
         133805,
         2142,
         22323,
         294963,
         8810,
         948,
         298312,
         14433,
         4771,
         12162,
         769,
         185,
         949,
         205,
         8923,
         241,
         793
      ],
      "original_title": "Twin Falls Idaho",
      "runtime": 111,
      "poster_path": "/fwz3otIN0vrArVfw9y2WO3HyThy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-07-30",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "A different kind of love story.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Polish"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Mark Polish",
         "Michael Polish"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0162830/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxNzkxMjUzNV5BMl5BanBnXkFtZTcwOTczNDMzMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Polish, Mark Polish, Michele Hicks | See full cast and crew »"],
      "reviews": [
         "I'd never heard of this until a few weeks back. I saw it last week on video. What a lovely film. It treats its subject matter with real sensitivity. The performances are believable, especially by the two Polish brothers (who made the film as well)as Siamese twins who have shacked up in a hotel for reasons initially unknown, while Michele Hicks is really sweet as the only person who will befriend them. The mood and pace is slow and beautifully graceful. A nice change from shallow, dumb blockbusters, Twin Falls Idaho is a very touching, tender film.",
         "A story about a grown-up pair of Siamese twin brothers - one does wonder. \"Twin Falls Idaho\" is a quiet yet possibly disturbing film (only if one is uncomfortable with the idea of looking at a pair of conjoined twins' physical features, which was actually only subtly featured). It is thought provoking and calmly sentimental. Well-written, acted, and just the right dosage, I felt. It's a tender story about brotherly love, man and woman young love, sons and motherly love - full of humanity. The natural delivery of everyone in the movie, including Penny's friend, the doctor who gave a routine check up on the twins - there's a casualness and ease to his brief performance. Michele Hicks somehow fits perfectly into the role of Penny - there's just the enough measure of beauty and heart demonstrated by her acting. There's also her low voice, the way she talks; her lean figure, the way she walks. Along with the ever fascinating to watch Leslie Ann Warren, 'tis blessed casting. The Polish brothers are themselves remarkable. How they delivered such poignant sensitivity about a pair of attached Siamese twins, when they themselves were not, is amazing. Michael Polish directed this script that he wrote with brother Mark. It's not Hollywood, not action movie. It is independent film flavor. It has no glamour - it does have some artistic camera angles and a dreamlike flashback sequence. But it is an intriguing film to experience, at its own pace, without rushing anything. The tone and mood, and the dim photography might suggest otherwise, but there is suspense and a secret to unfold. It all comes together naturally, with its slow dance. Its ending? Go see for yourself - it's an experience that would worth your while. Applause to the Polish Brothers and everyone involved in the production of this film.",
         "I have to say this because I almost made the fatal mistake of classifying this movie with the sentimental, depressing, and whiny ones, based on the little I'd heard about it. Call me prejudiced, which I am (and thank goodness, this wonderful film cured me of some of those symptoms), but at first, the idea of watching a movie about a girl and a pair of Siamese twins was not that appealing. It took some recommendation from friends whose opinions I value highly to overcome those inhibitions and to decide to brave whatever disappointment might come out of this venture. I now thank those friends for the good and true word. The beautiful Penny (Michele Hicks) tells her friend that somehow the Falls twins were not ugly, and I couldn't agree more with her: the Falls brothers, with their neat dress and meek manners, are simply adorable. The strong bond uniting them is another attraction (anyone on especially close terms with their sibling(s) would understand this). I found it shocking that Penny's lawyer should think it rude that the twins should whisper constantly to each other; for me, it showed an intimacy that couldn't be imitated by anyone else, and beyond the reach of any convention. The Polish brothers have done an inimitable job; some of the details would never have occurred to one who has grown up on her/his own. And it was nice to see quite distinct personalities developed for each of the Falls twins that went beyond their talents/interests. Focusing on this kind of specific peculiarity might be what gives this story such an expressive power, to make us think about the various kinds of being \"different\" or relationship in general. On this other hand, it is a shame that the subtler overtones of the story can easily get buried because of this very focus, and scare some \"fun\"-loving people away. I later read an interview about the movie and the creators' account of some of the imagery and the design of the movie, but such explicit detailing has taken away some of the charm I had felt for what I had believed were natural/innocent things, rather than improve my opinion of the movie. So take this advice (although it might already be too late if you're reading this) and go see it for yourself, before exposing yourself to anything that could disenchant you! I promise that you won't be disappointed.",
         "\"Twin Falls Idaho\" is a dream-haunter of a film! Lovingly and meticulously directed by Michael Polish and written with quiet brilliance by Mark Polish (with help from twin brother Michael), this gentle, soft-spoken film is one of the three best films of 1999. The imagery in the film is often gritty and stark, pointing out subtext to the audience without utilizing masks or shadows. It's a wonderful story about the nature of relationships; about love and marriage and \"divorce\"; and about the lives of those unfortunates society labels as \"different\", and the realization that they are not so different as society may have initially supposed. The acting is superb; the Polish brothers are completely believable as the conjoined twins Blake and Francis Falls, performing feats like deftly buttoning up each other's shirts or playing the guitar together (Blake strums while Francis manages the fret for chord changes) as if they had, indeed, done it all their lives. As the film rolled on, I found myself loving these two guys as unique and colorful individuals, and empathizing with their plight. And the often-used \"Hooker with a Heart\" character Penny is given new light and life by Mark Polish's careful crafting of the character and by Michelle Hicks edgy yet warm performance. If you're like me, \"Twin Falls Idaho\" will leave you awake nights, thinking long and long. I look forward to seeing what the Polish brothers will do next, either collaboratively or on their own.",
         "I kept holding my breath while watching this movie. Not like being underwater or anything like that but more like kissing the love of your life or holding your own child in your arms for the first time. Like that. I had to remind myself to breathe. Twin Falls is one of the most beautiful films I've ever seen. Finely crafted to the extreme, delicately directed, with performances that absolutely broke my heart. The Polish brothers have created something truly remarkable here, and Michele Hicks, in her first film performance, is amazingly stunning and talented. Twin Falls is definitely a work of art!",
         "\"Twin Falls Idaho\" is amazing not just for how much really good material it packs into its first hour, but for how it parlays all that good material into even better material for the film's second half. Although Francis Falls tips the movie's hand when he gives us his thoughts about sad endings that become happy endings, the unexpectedly original way in which these thoughts are illuminated is a genuine treat. And what can be said about the acting? Neither Michael nor Mark Polish strikes a false note in what could have been embarrassingly showy turns. The quiet intensity of their attachment to one another and their relationship to the world around them. Michelle Hicks also finds a way to turn a character who could have been an instant cliche into a person whose feelings we care about. This film is a rare gem you will want to see more than once.",
         "I caught the beginning of Twin Falls, Idaho one evening while flipping past the Independent Film Channel. I was immediately hooked by the story. The acting was absolutely riveting, and while the plot may have been slow to develop, and even a bit predictable, there was an intangible quality about it that kept my eyes glued to the screen. Michele Hicks is brilliant in a difficult role. My heart nearly broke when she was shunned by the Falls brothers. Lesley Ann Warren was excellent as the cliche mother. But the real kudos belong to the Polish brothers, who were responsible for the writing, acting, and directing. I was convinced that the story they told was real when I first saw them. The bond they display on screen is definitely not contrived. I was completely blown away by the tenderness and understanding they shared. All in all, one of the 5 best movies I have ever seen. It is rare for me to be so completely gripped by a movie as I was when I saw this one. And yet, I just couldn't tear myself away. 10/10",
         "I drove sixty five miles one way to see this film and it would have bargain at twice the distance. This film is superbly written and acted and I see no flaws. The premise which is cojoined twins played by the Polish brothers, identical twins, is original and delivered with a poignancy that is rare. I spoke to a couple of people after the film who said they thought they would be uncomfortable with the subject and were for a couple of minutes but then became totally involved and forgot. I will not go into the storyline as this is a film you should enjoy as it unfolds, but I caution you to pay attention as there is alot to be appreciated in watching the intimacy between these brothers as well as the dialogue, sometimes almost inaudible between the brothers. The film also offers analogies, puns, metaphors, and an interesting array of supporting characters. There is also alot of \"hidden\" humor so watch carefully. Although there is alot of sadness in the film, the overall feeling after was uplifting. This film was on my mind for days and I think it was the first thing I brought up in conversations. This is a MUST SEE for anyone that enjoys film that are not standard fare. I am looking forward to adding it to my video collection. FOUR STARS!!!!",
         "This film is still haunting me, even long after watching it for the first time. It depicts a rare insight into the exclusivity of sibling relationships and utilises a neutral tone that ironically intensifies every second of the story. Although the movie skims slightly upon cliches, that only helps to familiarise the audience with the plot so that they don't feel too alienated by the mystery of the twins. This most certainly is a treasured oddity in the video store.",
         "\"Twin Falls, Idaho\" is a very well made film with unusual depth and complex emotional content. It is absolutely a must see for anyone wanting more than your usual Hollywood fodder and fluff. A different sort of Love Story and a gritty look at a uniquely off-center topic. The Characters are often somewhat surreal, but not to the point of being ridiculous or unbelievable, this said same surrealism serves to make the imagery and story all the more powerful. The Hopeful and \"Best of Humanity\" themes and messages underlying the main story are clear to anyone that watches this fine piece of work. Casting and Cinematography are exceptional. And the stand out performance without a doubt goes to the lovely Michele Hicks as Penny as well as fine performances by Mark and Michael Polish as the Twins. One of the Best Films I have seen in quite a long time."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Free Range Films",
         "Fresh Produce Company",
         "Seattle Pacific Investments"
      ],
      "summaries": ["Francis and Blake Falls are conjoined twins who live in a neat little room in a rundown hotel. While sharing some organs, Blake is always fit and Francis is very sickly. Into their world comes a young lady, who turns their world upside down. She gets involved with Blake, and convinces the two to attend a Halloween party, where they can pass themselves off as wearing a costume. Eventually Francis becomes really ill, and they have to be separated. They then face the physical and mental strains that come from their proposed separation. Viewers will be inclined to believe that the two are really Siamese twins, but in fact they are simply real-life brothers playing the parts convincingly."],
      "budget": 500000
   },
   "movielensId": 2725,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-07-30",
      "dvdReleaseDate": "2000-01-18",
      "directors": ["Michael Polish"],
      "runtime": 111,
      "movieId": 2725,
      "title": "Twin Falls Idaho",
      "mpaa": "",
      "actors": [
         "Mark Polish",
         "Michael Polish",
         "Michele Hicks",
         "Jon Gries",
         "Patrick Bauchau",
         "Garrett Morris",
         "Lesley Ann Warren"
      ],
      "imdbMovieId": "0162830",
      "originalTitle": "Twin Falls Idaho",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Francis and Blake Falls are Siamese twins who live in a neat little room in a rundown hotel. While sharing some organs, Blake is always fit and Francis is very sickly. Into their world comes a young lady, who turns their world upside down. She gets involved with Blake, and convinces the two to attend a Halloween party, where they can pass themselves off as wearing a costume. Eventually Francis becomes really ill, and they have to be separated. They then face the physical and mental strains that come from their proposed separation.",
      "tmdbMovieId": 33430,
      "avgRating": 3.57437,
      "releaseYear": "1999",
      "numRatings": 753,
      "posterPath": "/fwz3otIN0vrArVfw9y2WO3HyThy.jpg"
   }
}