{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "woman between two men",
            "id": 7439
         },
         {
            "name": "hoodlum",
            "id": 160488
         }
      ],
      "imdb_id": "tt0048254",
      "video": false,
      "title": "Killer's Kiss",
      "recommendations": [
         10165,
         247,
         45314,
         45966,
         45970,
         16958,
         802,
         14580,
         25955,
         3175,
         22527,
         1480,
         631,
         976,
         690,
         43878,
         995,
         965,
         3088,
         9797
      ],
      "backdrop_path": "/ei796qjzA01wpezajZQWDOKOX47.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Vincent Rapallo",
               "gender": 2,
               "credit_id": "52fe43169251416c75002ee7",
               "name": "Frank Silvera",
               "profile_path": "/d44sP5M05M1NGsLrtha0X1xs6LU.jpg",
               "id": 19217,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Davy Gordon",
               "gender": 0,
               "credit_id": "52fe43169251416c75002eeb",
               "name": "Jamie Smith",
               "profile_path": null,
               "id": 62601,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Gloria Price",
               "gender": 0,
               "credit_id": "52fe43169251416c75002eef",
               "name": "Irene Kane",
               "profile_path": null,
               "id": 62602,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Albert the manager",
               "gender": 2,
               "credit_id": "52fe43169251416c75002ef9",
               "name": "Jerry Jarrett",
               "profile_path": null,
               "id": 276364,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Gangster",
               "gender": 2,
               "credit_id": "52fe43169251416c75002efd",
               "name": "Mike Dana",
               "profile_path": null,
               "id": 246822,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Gangster",
               "gender": 2,
               "credit_id": "52fe43169251416c75002f01",
               "name": "Felice Orlandi",
               "profile_path": "/uh1gUkBeBUK4ch002jylSf4HuJl.jpg",
               "id": 14068,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43169251416c75002ee3",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43169251416c75002ef5",
               "name": "Howard Sackler",
               "profile_path": null,
               "id": 16188,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "57aa15a0c3a368739f007db9",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "57aa15ad92514111aa00153b",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "57aa15d3c3a368739f007dc8",
               "name": "Morris Bousel",
               "profile_path": null,
               "id": 1663827,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "57aa1659c3a3680e8c00153b",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "57aa166492514111aa00156e",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.903423,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10056,
      "vote_count": 135,
      "budget": 75000,
      "overview": "The film revolves around Davey Gordon (Jamie Smith), a 29 year old welterweight New York boxer in the end of his career, and his relationship with a dancer and her violent employer.",
      "similar": [
         772,
         1771,
         769,
         594,
         1572,
         51876,
         59108,
         7191,
         5236,
         253,
         186,
         891,
         1369,
         1374,
         1900,
         18487,
         40807,
         311,
         164,
         277
      ],
      "original_title": "Killer's Kiss",
      "runtime": 67,
      "poster_path": "/bHFmAWaUuzrok2khfLS85xeBqpO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Minotaur Productions",
         "id": 4323,
         "origin_country": ""
      }],
      "release_date": "1955-09-21",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Her Soft Mouth Was The Road To Sin-Smeared Violence!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Stanley Kubrick"],
      "runtime": 67,
      "synopsis": "In the main hall at New York's Pennsylvania Station, Davy Gordon (Jamie Smith), a young boxer, sits waiting for his train as he recalls the last few days... Living alone in a small apartment, he becomes attracted to a young woman, named Gloria Price (Irene Kane), who leads a no less solitary existence across the courtyard of his apartment building. He leaves for a fight while she goes to a nightclub where she works as a taxi dancer for its owner, Rapallo (Frank Silvera). Meanwhile, Davy loses the fight and on his return to his apartment, he sees through Gloria's bedroom window that Rapallo is trying to rape her. Davy rushes to her aid and beats Rapallo up who fleas. Shaken, Gloria recounts her life story to Davy about having to support herself and Rapallo who wants her. They decide to leave town and stay with Davy's uncle in Seattle. But first, Davy must collect money owed to him by Albert (Jerry Jarret) his manager. When Gloria phones Rapallo and tells him that she is leaving him for good, Rapallo decides to send out his strong-armed men (Mike Dana, Felice Orlandi, Ralph Roberts and Phil Stevenson) to kill Davy to reclaim his woman. Davy and Gloria go to the taxi dance club where Gloria will pick up her last paycheck and Davy will wait outside on the street for Albert to show up with his money. When two drunken mens club conventioneers steal Davy's coat, he chases off after them in which Albert arrives outside the club and waits for Davy. Just then, two of Rapallo's goons arrive and attack and kill Albert in a vacant alley after they mistake him for Davy. When Davy returns to pick up Gloria, Rapallo realizes that they killed the wrong man and he sends his men out to just grab Gloria by force. When Davy returns to his apartment to pack up and sees Gloria being taken by Rapallo's men, he rushes over, but they get away. Davy is forced to hide when his landlord and two policemen arrive looking for him to question him about Albert's murder. Davy now embarks on a personal quest to find Gloria on his own. The next morning, Davy follows Rapallo from his club to a seedy and desolate part of the Lower East Side where he takes him hostage with a gun and forces him to lead him to Gloria. At the loft, Davy holds Rapallo and his two henchman in check as he unties Gloria. But just then, one henchman lunges at him for the gun and a struggle ensues. Davy is forced to run while Rapallo and one of his thugs chase off after him while one stays behind to watch Gloria. When the henchman left behind lets his guard down, Gloria knocks him on his head and escapes. A climatic chase begins as Davy is pursued across the rooftops by Rapallo and one of his henchmen. When the henchman injurs his foot after jumping from one rooftop to the next, Rapallo leaves him behind to contine chasing after Davy. The chase leads to an old warehouse filled with disembodied shop-window mannequins. Davy engages in a life-or-death struggle with Rapallo, kills him and, believing that he has lost Gloria, leaves alone to catch his train to Seattle. Flashing forward to the present, just as Davy steps up onto the platform to board, Gloria joins him at the last minute and they ride off together.",
      "writers": ["Stanley Kubrick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0048254/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDAyNjM5NzQ0OF5BMl5BanBnXkFtZTcwMjEwMjMyMQ@@._V1._CR0,61,323,409_SY317_CR18,0,214,317_AL_.jpg",
      "actors": ["Stars: Frank Silvera, Irene Kane, Jamie Smith | See full cast and crew »"],
      "reviews": [
         "In 1955 a young man, who had produced a couple of 35mm. shorts and a feature which were so little known that they were never even shown in England, made a suspense thriller\u0085 From the fact that he co-produced it, wrote it, directed it and did the photography and editing himself you may deduce that he had more talent than backing\u0085 The movie was called \"Killer's Kiss,\" and the multi-talented man who made it was the young Stanley Kubrick\u0085 \"Killer's Kiss\" is a fascinating movie to look back as it is a notable thriller in its own right\u0085 It is a film about lonely people; alone people, which is not quite the same thing; their roots almost severed from a past which was once good and is now lost; solitary in the impartial big city at the end of the line\u0085 It starts with a confident, quiet slowness that few directors would dare in the frenetic Seventies\u0085 It takes its time to develop, and for nearly half the film you can't guess what the plot is going to be\u0085 But this carefully measured film gives you a deep feeling for the characters and their context that leaves you, even after all the suspense, with an overwhelming feeling of the humanity of the movie\u0085 The narrator, Davy Gordon (Jamie Smith) is a young and fading boxer, past it, but not defeated in his heart\u0085 The girl Gloria Price (Irene Kane), who lives in the same apartment block, has, like him, no family nor friends\u0085 She's come down to working as a dance partner in a shabby hall run by a baddie called Vincent Rapallo (Frank Silvera). Kubrick slowly, and movingly, shows the two principals taking the downgrade: Davy fighting a losing bout in the ring while Gloria is trying to push off some heavy passes from Rapallo\u0085 Even he, Rapallo, is made human, understandable\u0085 When he stands in his shadowed office, making up his mind to some malice, his eyes fall on cozy family photographs in nice domestic frames that he takes the trouble to keep there; and, when his mind is made up, he gestures irritably, guiltily, as if knowing he's letting them down and trying weakly to dismiss summarily aside their silent reproaches\u0085 The whole story is condensed into three days\u0085 Yet it seems to have the natural, inevitable pace of real life; and the moments briefly taken out for little touches of New York street scenes add to the reality and place it in a context of truth\u0085 Very little violence is actually shown except in Davy's boxing match which, in just a few minutes, gives a better feeling than most movies of what it's like to lose a fight in the ring\u0085 But, in spite of all, you're on the edge of your seat and you're glad to be there\u0085 There is a classic chase over the rooftops, but even here there are human touches that kill cliché\u0085 These villains are not supermen, any more than Davy is: they can stumble on a fire escape, and not for laughs; one of them can fall as you or I would fall and drop out with a twisted ankle\u0085 The suspense is not lessened by these touches: it is increased, because it is more real, seems less contrived\u0085 \"Killer's Kiss\" was a first-class suspense film that foreshadowed conscious and technique that Kubrick was to take to the limit in later years\u0085 And, after all, the ending was fair enough for the Fifties\u0085 In the Seventies, Gloria would probably have got raped by the railway porter, and there'd have been a lot of unlovely detail and no suspense at all\u0085",
         "This film, directed by Stanley Kubrik, is not seen often these days. It was a surprise that it was shown recently on cable as it gave all of Mr. Kubrik's fans the opportunity to watch one of his early works. The copy that was shown is amazing in that it has been kept, or probably restored, with great care. Stanley Kubrik was a genius; he probably knew more about movies than many other of his contemporaries. Yet, his legacy is somehow meager, only sixteen full length features in almost fifty years as a director. Killer's Kiss shows the Manhattan of 1955 like it has never been seen in other movies made in the city. Mr. Kubrik's attention to detail and style overshadows the story. The main problem is his screen play, it never involves the viewer in what he is seeing. This is exacerbated by the voice over one hears over the action. We never know what makes these people tick, much less what's going on in their heads at any given moment. The story is told in a flashback. We see Davy waiting at the old Pennsylvania Station for the train that is to take him to Seattle. He had planned to leave with Gloria, but she seems never to appear; for all we know, he might be waiting in vain. The streets of Manhattan come alive in the brilliant black and white cinematography by Mr. Kubrik, himself. That old New York that is no longer around, is captured by Mr. Kubrik in such brilliant detail that we mourn the fact those buildings and institutions are not around any more. The night scenes around Times Square, especially the stairway leading to the dance hall have a style that brings some of Edward Hooper's work to mind. Mr. Kubrik deserves credit for filming on location and never making it feel as though those scenes have been fixed to give that effect. In fact, that's where Kubrik's genius comes into play, we realize he had an eye for making things real. The acting is not the main focus of this film. Frank Silvera makes a menacing Vincent, the mobster and dance hall owner. Jamie Smith and Irene Kane, go through the paces, but they don't convey to the viewer the passion that is supposed to be going on between them. This movie should be seen by the serious moviegoer as it shows Mr. Kubrik's tremendous talent. It might be a minor film, in comparison to his best work, but being one of his first movies, one can clearly see what will come later.",
         "A young Stanley Kubrick's bare-budget film - perhaps his first \"mainline\" movie - shows him still in the minor leagues but very close to making it to the Major Leagues. In fact, he did so the following year with \"The Killing,\" a film noir that still ranks among the best. At any rate, this is an opportunity to see Kubrick at work right before he \"makes it\" in the business. With an almost-nothing budget you aren't going to draw too many professional actors, and that certainly was the case here, but still is worth watching. It's definitely a \"B\" noir that is more melodrama than crime until the ending when it gets very, very suspenseful featuring a chase over New York City rooftops and then into abandoned warehouses. Jamie Smith and Irene Kane are the stars and if you've never heard of them, it's probably because they weren't exactly Humphey Bogart and Bette Davis, acting-wise. The other star, Frank Silvera, at least is a name I recognized. Overall, the best feature may be the camera-work. It gives us a preview of the visual talents that Kubrick would bring to the big screen in following decade. On its own merits, if you are a film noir fan, you'll want this in your collection.",
         "At an age when most wannabe filmmakers are still 'in training' Stanley Kubrick was producing full length feature masterpieces. I'm still shocked at how many fans of Kubrick's later work do not appreciate Killer's Kiss. While the basic plot of the movie is nothing special and decidely more 'Hollywood' than Kubrick's later works there are more signs of his trademark style in this film than I feel there were in The Killing or Paths of Glory. Kubrick's own cinematography in particular blew me away. The use of depth, light and shadow and of his trademark moving camera show us more skill and thought than directors with dozens of films and much better scripts under their belt. And Kubrick's trademark use of his camera to observe silently, capturing the true spirit of his characters when they are alone (no music, no dialogue) is seen over and over in the apartment. If Kubrick's direction could turn a story like this into such a masterful cinematic experience I shudder at what he would of done with this film had he made 10 or 20 years later. If you love the unique cinematic idiosynchracies of Kubrick's later work then you MUST SEE KILLER'S KISS!",
         "With 3 short films and a feature (Fear And Desire [1953]) under his belt, none of which had received any notice (in fact, Kubrick bought up all of the existing prints of Fear And Desire, because he thought it was poorly done [not to mention that it was being billed as a sexploitation film]), Kubrick decided to try out something new. He decided to go with Film-Noir. The film is filled with Kubrick trademarks through and through. He uses boxing (which was the subject of his very first short Day of the Fight [1951]), zooming techniques, flashbacks (also used in his next film The Killing [1956]) and narration. The cinematography is exquisite, as usual, with many shots (particularly in the boxing studio and the train station) being backlit with a soft, grey light to give it a disconnected, almost rear-screen-projection feel. However, it is obvious that this is the early, naive Kubrick at work here. The entire movie, like Fear And Desire, is post-dubbed (much like a Fellini film), with all of the sound effects being done over by a meticulous Kubrick. And, of course, the Film-Noir. Davey Gordon (played to perfection by Jamie Smith) is the almost-stereotypical Noir anti-hero, with Irene Kane (aka journalist Chris Chase) as his anti-heroine. Frank Silvera, who had the lead role in Fear And Desire, is the slimy villain, whom you actually want to die (a good sign [for a villain]). This Kubrick film can most be compared to 2001: A Space Odyssey (1968) or Barry Lyndon (1975), in that, once you get past a slow beginning, the end is absolutely riveting. Kubrick knows that he wants to grab his audience, and he does so with perfection. Some of it is padded (the ballet sequence is not particular interest), but the rest it great, from the initial boxing sequence to the chase scene at the end. If you're a fan of Kubrick, see it. If you're a fan of great cinema, see it. If you're a fan of Film-Noir, see it (but take it with a pinch of salt). If you're none of these things, see it, and you will be.",
         "Killer's Kiss is a 1955 movie produced, directed and written by a 27 year old Stanley Kubrick. Coming off the heels of a poorly received first effort, 1953's Fear and Desire, Kubrick stormed back with an interesting little story set in the heart of New York City. The film's protagonist Davy Gordon, is a struggling local boxer who gets involved with a woman, Gloria Price who's ex, Vincent Rapallo hasn't let go of her yet. Kubrick slowly, and movingly, shows the two principals taking the downgrade: Davy fighting a losing bout in the ring while Gloria is trying to push off some heavy passes from Rapallo. While the pair try to flee the city, Rapallo and his henchmen foil there escape. Price meanwhile, has changed her mind and decides she's better off with a real man, Rapallo. In the thrilling climax, Gordon and Rapallo battle it out in a run-down mannequin factory which foreshadows his technique shown in later masterpieces. \"Killer's Kiss\" was a first-class suspense film that foreshadowed conscious and technique that Kubrick was to take to the limit in later years. After all, the ending was fair enough for the Fifties. Out of a possible 5 stars, I give young Stanley Kubrick's \"Killer's Kiss\" 4 stars.",
         "Stanley Kubrick's career really took off in 1956, upon the release of his first masterpiece; \"The Killing\", after which he would go on to make many much loved cinema classics such as \"Dr Strangelove\", \"The Shining\" and \"A Clockwork Orange\", to name a few. This movie is, however, no masterpiece; but that's not to say it's without it's plus points. First and foremost, this movie is admirable for it's directing, which is excellent. Of course Stanley Kubrick would go on to show himself as a genius behind the camera, and this movie is an early taste of that genius in the directorial department. Secondly, despite the B-grade cast, the acting is not bad at all. It's not marvelous, but considering the cast's accomplishments, previously and after this movie was made, it's better than one would expect. One of the movie's major flaws, however, is its lack of ideas. There are some nice ideas in the film, such as the part where Gloria tells her story to a backdrop of her sister doing ballet, and the Rear Window style way that the Gloria and Davy meet, but as the film is only 67 minutes long, it felt at times that Kubrick was spending too long on certain sequences, which is a problem if the movie is as short as this one is as it looked as though Kubrick was just dragging things out in order to meet an acceptable running time. That might be so bad in a longer film, but here it's not good. This movie is a nice, taut little thriller and is definitely recommended to people that want to see some early Kubrick and thereby see how he developed as a filmmaker, but it's not a great film and I don't recommend going into this movie expecting it to be one.",
         "**Spoilers** Stanley Kubrick's debut film about obsession and murder on the gritty and dangerous streets of midtown Manhattan and the empty and deserted factory lofts along the Brooklyn waterfront. With a number of fine performances by Jamie Smith & Gloria Price as the two unlikely lovebirds Davy Gordon & Irene Kane and especially Frank Silvera as Irene's jealous and obsessive former boyfriend Vicent Rapallo. Who runs the Pleasureland Dance-Hall where Irene works as a dance partner for the customers who go there for their nightly entertainment. Davy who's a professional boxer just came back from the sports arena after getting his brains scrambled by the up and coming world welterweight contender 22 year-old \"Kid\" Rodriguez, who knocked him out cold in the first round of their match. With his boxing career on the ropes the 29 year-old washed-up fighter was nursing his wounds when he hears a scream across the other side of his apartment building. With the women, Irene, in question being beaten up by her boyfriend,Vincent, and comes to the women's rescue as Vincent flees the scene. Irene had just broken up with Vincent who's also a part-time hoodlum as well as dance-hall manager. After spending the next morning with Davy, who had breakfast in her apartment, Irene decides to leave New York City with him for Seattle. It's there where she can live and find work together with Davy on his uncle's horse farm. Davy and Irene plan to meet after they both get paid at Penn. Station in mid-town Manhattan for a train to Washington State. Davy gets in touch with his fight manager Albert, Jerry Jarret, and tells Jerry to meet him at the Pleasureland Dance-Hall to pick up his check for his fight with \"Kid\" Rodriguez. Meanwhile Irene also goes to the dance-hall to get her severance pay from her former boyfriend Vincent. After having it out with him, when he begged her to please stay, Vincent sends two of his thugs outside the dance-hall to kidnap Irene and also work over Davy who's expected to meet her outside the place. Instead they mistake Jerry for Davy and end up beating him to death as they grab and take off with the terrified Irene. Davy getting to the dance-hall late, due to him chasing these two wackos who stole his scarf, goes home and takes his belongings to go to the train station the next morning thinking that Irene left and deserted him. Checking Irene's apartment Davy finds it empty but as he's there he sees outside the window into his apartment two police officers talking with his super about him being suspected of murdering his manager Jerry earlier that night. Realizing now what really happened and him being framed for Jerry's murder Davy get's a taxi to Vincent's place at the dance-hall. After taking him hostage Davy has Vincent drive him to a Brooklyn warehouse where his two hoods, who murdered Jerry, Mike Dana & Felice Oriandi are holding Irene captive. Exciting final with Davy battling both Vicent and his two henchmen with a real knock around battle with Vincent in a garment factory loft filled with mannequins that are used as deadly weapons in the fighting; together with axes and steel-hooked poles, with Vicent ending up dead and Davy arrested for murder. Davy is later vindicated at the police station for Vicent's death due to self-defense but Irene whom Davy rescued leaves the precinct without going with him to the train station to leave for Seattle, as she said earlier she would. We see this all in a flashback by Davy, reflecting on what he went through the last three days. Feeling hurt and dejected as Davy's about to get on the train by himself he spots running to the train station Irene! The film ends with Davy now knowing that he's not alone as he and Irene both kiss and leave for Seattle together like they planned to do in the first place. Stanley Kubrick showed in his first major motion picture \"Killer's Kiss\" just what the movie going public could expect from him in the future when he has more money and experience to put into the movies. Movies that he'll make and direct. And after some 44 years up until his death in 1999 the movie going public were never disappointed in any of his cinematic efforts.",
         "I saw this film quite a few years ago in a film appreciation class I took. I am a Kubrick fan so I was interested in seeing it. The acting is pretty bad in this film, but Kubrick was pretty much producing this independently (in the mid-50's when that was not done too often) and probably could not get very good actors. The filmmaking was great. There were great tracking shots, wonderful use of mise on scen, great long shots and close ups. In fact a lot of sequences were similar to sequences in many of Kubrick's famous films. Kubrick fans should see this movie at least once.",
         "It's just over an hour long and even so we have the trademark Kubrick opening, where he takes his own sweet time in letting us know what the film is about but somehow draws us in all the same. Look: it's an hour long, and it's a slight, hour-long kind of story. Don't expect anything more. I think there's also rather clearly a moment when Kubrick realised that he didn't know how he was going to end it all - to be honest, I have a sneaking suspicion that a similar thing happened on \"2001\", \"Eyes Wide Shut\" and even \"Dr. Strangelove\". In each of these cases it was the prompt for a daring and unconventional conclusion. I wish I could say that was the case here. This doesn't prevent it from being involving while it lasts. Kubrick once again demonstrates the he could point a camera at anything at all and make it interesting - the images are amazing, yet entirely functional. If you have ever loved any black-and-white camera work you'll love this. It's also a masterpiece of violence-without-violence, if you know what I mean. It deserves to be more well-known than it is."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Film-Noir",
         "Thriller"
      ],
      "productionCompanies": ["Minotaur Productions"],
      "summaries": [
         "Prize-fighter Davy Gordon intervenes when private dancer Gloria Price is being attacked by her employer and lover Vincent Raphello. This brings the two together and they get involved with each other, which displeases Raphello. He sends men out to kill Davy, but they instead kill his friend. Gloria is soon kidnapped by Raphello and his men, and it is up to Davy to save her.",
         "As a man waits at a train station for his girl, he tells us about the recent past and we segue into a long flash-back."
      ],
      "budget": 75000
   },
   "movielensId": 2727,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1955-09-21",
      "dvdReleaseDate": "1999-06-29",
      "directors": ["Stanley Kubrick"],
      "runtime": 67,
      "movieId": 2727,
      "title": "Killer's Kiss",
      "mpaa": "",
      "actors": [
         "Frank Silvera",
         "Jamie Smith",
         "Irene Kane",
         "Jerry Jarrett",
         "Mike Dana",
         "Felice Orlandi"
      ],
      "imdbMovieId": "0048254",
      "originalTitle": "Killer's Kiss",
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["CDWpQgcFn5g"],
      "plotSummary": "The film revolves around Davey Gordon (Jamie Smith), a 29 year old welterweight New York boxer in the end of his career, and his relationship with a dancer and her violent employer.",
      "tmdbMovieId": 10056,
      "avgRating": 3.33456,
      "releaseYear": "1955",
      "numRatings": 408,
      "posterPath": "/bHFmAWaUuzrok2khfLS85xeBqpO.jpg"
   }
}