{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sexual obsession",
            "id": 459
         },
         {
            "name": "hotel",
            "id": 612
         },
         {
            "name": "loss of loved one",
            "id": 697
         },
         {
            "name": "depression",
            "id": 894
         },
         {
            "name": "small town",
            "id": 1415
         },
         {
            "name": "flirt",
            "id": 1486
         },
         {
            "name": "midlife crisis",
            "id": 1599
         },
         {
            "name": "eroticism",
            "id": 1664
         },
         {
            "name": "youngster",
            "id": 2086
         },
         {
            "name": "lolita",
            "id": 2087
         },
         {
            "name": "motel",
            "id": 2669
         },
         {
            "name": "diary",
            "id": 2913
         },
         {
            "name": "seduction",
            "id": 3182
         },
         {
            "name": "forbidden love",
            "id": 3691
         },
         {
            "name": "literature professor",
            "id": 3746
         },
         {
            "name": "provocation",
            "id": 4125
         },
         {
            "name": "fascination",
            "id": 4126
         },
         {
            "name": "one-sided love",
            "id": 4127
         },
         {
            "name": "widow",
            "id": 4129
         },
         {
            "name": "adoptive father",
            "id": 4130
         },
         {
            "name": "summer camp",
            "id": 5767
         },
         {
            "name": "secret love",
            "id": 7879
         }
      ],
      "imdb_id": "tt0056193",
      "video": false,
      "title": "Lolita",
      "recommendations": [
         3175,
         247,
         967,
         975,
         10056,
         654,
         345,
         1643,
         614,
         439,
         3133,
         643,
         793,
         405,
         3112,
         592,
         475,
         396,
         935,
         7857
      ],
      "backdrop_path": "/12wzwkOOQrob6YHShKYfRTOyALg.jpg",
      "revenue": 9250000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Humbert Humbert",
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213fb",
               "name": "James Mason",
               "profile_path": "/b0ebmboBdaYvk8fn2CFCQl4TaW9.jpg",
               "id": 2091,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Dolores „Lolita“ Haze",
               "gender": 1,
               "credit_id": "52fe4278c3a36847f80213ff",
               "name": "Sue Lyon",
               "profile_path": "/yf7YNOdetscvBaQbWbNe5TNxdxC.jpg",
               "id": 12445,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Charlotte Haze",
               "gender": 1,
               "credit_id": "52fe4278c3a36847f8021403",
               "name": "Shelley Winters",
               "profile_path": "/zVg966M0RVK5kycHZUEDc51QULV.jpg",
               "id": 7632,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Clare Quilty",
               "gender": 2,
               "credit_id": "52fe4278c3a36847f8021407",
               "name": "Peter Sellers",
               "profile_path": "/sCVIv2DGoC9U16anTjLwMxKBPZ.jpg",
               "id": 12446,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Nurse Mary Lore",
               "gender": 1,
               "credit_id": "52fe4278c3a36847f802140b",
               "name": "Lois Maxwell",
               "profile_path": "/uQneO3fT5H7vmjxusi3lJmm3xT3.jpg",
               "id": 9878,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Tom",
               "gender": 2,
               "credit_id": "52fe4278c3a36847f802140f",
               "name": "John Harrison",
               "profile_path": null,
               "id": 12447,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Jean Farlow",
               "gender": 1,
               "credit_id": "52fe4278c3a36847f8021413",
               "name": "Diana Decker",
               "profile_path": "/40jACKULivs0MuFT4ceDgIi2jbn.jpg",
               "id": 12448,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "John Farlow",
               "gender": 0,
               "credit_id": "52fe4278c3a36847f8021417",
               "name": "Jerry Stovin",
               "profile_path": null,
               "id": 12449,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Richard T. 'Dick' Siller",
               "gender": 2,
               "credit_id": "52fe4278c3a36847f802141b",
               "name": "Gary Cockrell",
               "profile_path": "/eEOFZabrhZ6V8zpsIJUukdegJbr.jpg",
               "id": 12450,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "George Swine",
               "gender": 2,
               "credit_id": "52fe4278c3a36847f802141f",
               "name": "Bill Greene",
               "profile_path": null,
               "id": 12451,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Mrs. Starch",
               "gender": 1,
               "credit_id": "52fe4278c3a36847f8021423",
               "name": "Shirley Douglas",
               "profile_path": "/l9KYcMc3HAQLfAnjlO9hPyNjuOQ.jpg",
               "id": 12452,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Vivian Darkbloom",
               "gender": 1,
               "credit_id": "59f24d5b92514148be02e4cd",
               "name": "Marianne Stone",
               "profile_path": "/5jFJji3UamXNvDU3it1YeG1V7Zc.jpg",
               "id": 106628,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213c7",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213cd",
               "name": "James B. Harris",
               "profile_path": null,
               "id": 3349,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213d9",
               "name": "Stanley Kubrick",
               "profile_path": "/ywoN9gI2lFOA5EAxxyRbQ1R4GQ6.jpg",
               "id": 240,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213df",
               "name": "James B. Harris",
               "profile_path": null,
               "id": 3349,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4278c3a36847f80213e5",
               "name": "Bob Harris",
               "profile_path": null,
               "id": 12008,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4278c3a36847f80213eb",
               "name": "Nelson Riddle",
               "profile_path": null,
               "id": 4360,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213f1",
               "name": "Oswald Morris",
               "profile_path": null,
               "id": 10339,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4278c3a36847f80213f7",
               "name": "Anthony Harvey",
               "profile_path": "/xFb61Oxx98u6xrSpbN0KZFrysWO.jpg",
               "id": 12009,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "58bf1c8f925141126a04e0bc",
               "name": "Vladimir Nabokov",
               "profile_path": "/jCPUb6oz9UieoIg6cXhq3BdvDly.jpg",
               "id": 12007,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.676262,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 802,
      "vote_count": 557,
      "budget": 2000000,
      "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
      "similar": [
         296096,
         539,
         2288,
         26550,
         5123,
         907,
         617,
         1058,
         2637,
         638,
         9619,
         2149,
         10145,
         197082,
         14168,
         11634,
         3021,
         11879,
         157845,
         3877
      ],
      "original_title": "Lolita",
      "runtime": 153,
      "poster_path": "/heRYtNrkHLj3Lwghr2jPBX7Yc29.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Seven Arts Productions",
            "id": 516,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Allied Artists",
            "id": 517,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Transworld Pictures",
            "id": 518,
            "origin_country": ""
         }
      ],
      "release_date": "1962-06-13",
      "vote_average": 7.3,
      "belongs_to_collection": null,
      "tagline": "How did they ever make a movie of ...",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Stanley Kubrick"],
      "runtime": 152,
      "synopsis": "The film begins in a quarrell between two men at a remote mansion. Humbert Humbert (James Mason) a 40-something British professor of French literature, arrives at the masion which is ramsacked from an apparently wild party the night before and finds the insane and debauched Clare Quilty (Peter Sellers), whom is not only suffering from some kind of severe dementia, but is also clearly drunk, as he babbles on incoherently and does not seem to remember Humbert from a time ago. Quilty goes mad when Humbert points a gun at him. After a mutually exhausting struggle for it, Quilty, now insane with fear, merely responds politely as Humbert repeatedly shoots him. He finally dies with a comical lack of interest, expressing his slight concern in an affected English accent. Humbert is left exhausted and disoriented. The film then turns to events four years earlier and goes forward as Humbert travels to Ramsdale, New Hampshire, a small town where he will spend the summer before his professorship begins at Beardsley College, Ohio. He searches across the town for room to let, being tempted by widowed, sexually famished mother, Charlotte Haze (Shelley Winters) to stay at her house. He declines until seeing her beautiful 14-year-old daughter, Dolores Haze (Sue Lyon), affectionately called Lolita (hence the title). Lolita is a soda-pop drinking, gum-chewing, overtly flirtatious teenager, with whom Humbert falls hopelessly in love. In order to become close to Lolita, Humbert accepts Charlotte's offer and becomes a lodger in the Haze household. Soon, however, Charlotte announces that she will be sending Lolita to an all-girl sleep-away camp for the summer. On the morning of departure, Humbert receives a love confession note from Charlotte, asking Humbert to leave at once. The note says that if Humbert is still in the house when Charlotte returns from driving Lolita to camp, then he must join Charlotte in marriage. Humbert willingly marries Charlotte days later. After the wedding and honeymoon, Charlotte discovers Humberts diary entries describing his passion for Lolita, and has an emotional outburst. She threatens to leave forever, taking Lolita far away from Humbert. While Humbert hurriedly fixes martinis in the kitchen to smooth over the situation, Charlotte runs outside, gets hit by a speeding car, and dies. Humbert drives to Camp Climax to pick up Lolita, who doesn't yet know her mother is dead. That night at a hotel, a pushy, abrasive stranger (Quilty) insinuates himself upon Humbert and keeps steering the conversation to his \"beautiful little daughter,\" who is asleep upstairs. Humbert escapes the man's advances, and Humbert and Lolita enter into a sexual relationship. The two commence an odyssey across the United States, traveling from hotel to motel. In public, they act as father and daughter. After several days, Humbert tells Lolita that her mother is not sick in a hospital, as he had previously told her, but dead. Grief-stricken, she stays with Humbert. In the fall, Humbert reports to his position at Beardsley College in Ohio, and enrolls Lolita in high school there. Before long, people begin to wonder about the relationship between father and his over-protected daughter. Humbert worries about her involvement with the school play and with male classmates. One night Humbert returns home to find Dr. Zempf, a pushy, abrasive stranger, sitting in his darkened living room. Zemph, speaking with a thick German accent, claims to be a psychologist from Lolita's school and wants to discuss her knowledge of \"the facts of life.\" Humbert is frightened and decides to take Lolita on the road again. During the long drive across country, Humbert soon realizes they are being followed by a mysterious car that never drops away but never quite catches up. When they get a flat tire, Humbert sees the black car stoping beside the road not far from them. Lolita does not seem to be concerned about Humbert's suspicions that the man in the black car is following them, but when he offers to get out to talk to the driver, Lolita suddenly becomes nervous and tells Humbert not to engage the unseen driver in any conversation. Before he can make a decision at what to do, the black car turns around and drives away. When Lolita becomes sick, Humbert takes her to a hospital in a small Arizona town. However that night, Humbert receives a phone call in his motel room from an unknown man about Lolita. Worried, Humbert returns to the hospital to pick her up, and she is gone. The nurse at the front desk tells him she left earlier with another man claiming to be her uncle and Humbert, devastated, is left without a single clue as to her disappearance or whereabouts. Some years later, Humbert receives a letter from 'Mrs. Richard T. Schiller', Lolita's married name. She writes that she is now married to a nearly-deaf Korean War veteran named Dick, and that she is pregnant and in desperate need of money. Humbert travels to their home, where Lolita waits. Humbert finds that she is now 17-going-on-18, a roundly pregnant woman wearing eyeglasses leading a pleasant, humdrum life. Humbert demands that she tell him who kidnapped her three years earlier. She tells him it was Clare Quilty, the man that was following them, who is a famous playwright and with whom her mother had a fling in Ramsdale days. She states Quilty is also the one who disguised himself as Dr. Zempf, as well as the pushy stranger who kept crossing their path. Lolita claims that she herself carried on an affair with him and left with him when he promised her glamor. However, he then demanded she join his depraved lifestyle, including acting in his \"art\" films. Humbert begs Lolita to leave her husband and come away with him, but she declines. Humbert gives Lolita $13,000, explaining that it's her share of the money from the sale of her mother's house. Leaving Lolita forever, Humbert surprises Quilty at his mansion where he kills him for abusing Lolita, thus bringing the film full circle. A disclaimer in the final shot reveals that Humbert died in prison of a heart attack while awaiting trial for Quilty's murder.",
      "writers": [
         "Vladimir Nabokov",
         "Vladimir Nabokov"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056193/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3NDYzNDI5NF5BMl5BanBnXkFtZTcwODU2OTY1Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: James Mason, Shelley Winters, Sue Lyon | See full cast and crew »"],
      "reviews": [
         "A riveting transposition from page to screen. The accomplices are two giants in both fields. Nabokov adapts his own infamous novel for the screen and Kubrick, no less, translates it into images in a way that makes it unique, unforgettable and transcendental without ever putting himself in front of the camera. A Kubrick film can't be recognized by its style. Kubrick never made two films alike but there is something that, unquestionable, makes them stand out. In \"Lolita\"'s case the mere idea of touching the controversial novel with its taboo subject at its very core seem like a provocation from the word go. Pornography for the thinking man in which the only explicit act is the intention written in the character's eyes. Nothing is excessive and nothing is pulled back. James Mason - villain or victim - is monumental, mo-nu-men-tal! The unspeakable truth never leaves his brow. He is the most civilized man trapped in the lowest echelon of his own psyche. So aware, that it is painful to watch. Shelley Winters goes for it, taking her Mrs Hayes for all its worth and dives into the void of a desperate housewife, craving for sex. It is one of the most entertaining, shattering human spectacles, I've ever seen. But unlike Mason, she's not aware of it. There is a horrible innocence attached to her sickness. Peter Sellers's character from hell, the torturer comes in three riveting characterizations and Sue Lyon's temptress, the child, is the devil incarnate in a performance that defies description. None of them were nominated for Oscars and the film was condemned by every moral group in America and beyond. As film experiences go, this is one of the most provocative, enthralling, disgusting, entertaining and satisfying I've ever been through. Yep, I really mean that.",
         "Someone commented that if you want to acquaint yourself with Nabokov's `Lolita' without actually reading it, the best you can do is to see Adrian Lyne's version. This is surely true. And, I might add, if you want to acquaint yourself with Nabokov's `Lolita' without actually reading it - to hell with you. You don't stand a chance anyway. Humbert's narration cannot possibly make it to the screen in one piece. Kubrick, at least, made no attempt. He even invents his own material, which Lyne is afraid or unwilling to do. Something about Lyne's authenticity is even shocking. He opens the story in 1947, which is when the story in fact opens - yet everything looks jarringly old-fashioned, whereas Kubrick's indeterminate 1950s setting looks right. The bulk of the story might as well take place in the 1950s as any other time. The crucial point is that the story cannot begin any EARLIER than 1947 - we need a post-war America with motels dotting the landscape. Humbert has little contact with contemporary culture; he only encounters the snippets of music and film that obsess Lolita, and he finds them unendurably vulgar. Kubrick captures this very well. There's this boppy little pop tune we never hear the end of - although most of the time we only hear it subliminally - for the first half of the movie, and it sounds like exactly the kind of tune that drove Humbert up the wall. Kubrick's cast is a strong one. It's crowned by Peter Sellers as Quilty - and before you complain that we see too much of him, ask yourself what scene featuring Quilty could you possibly want to be removed? Admittedly, since this is 1962, we have a Lolita who is merely sixteen - but maybe this isn't just because it's 1962. After all, the book does two things at once. It makes us understand perfectly why Humbert is attracted to Lolita - we see her through his eyes - while constantly reminding us that Lolita is not someone that we would be attracted to, ourselves. Both are worthy goals, but when it comes time to film the book, the director must make a choice between them. Kubrick picked a genuinely attractive, but still obviously young, Sue Lyon. I can't fault this choice. As for Humbert - well, here Kubrick was actually MORE daring than Lyne was. Humbert Humbert is a sympathetic character who is also calculating, manipulative and - now and then - shockingly brutal. James Mason allows Humbert to be all of these things. This doesn't prevent him from being sympathetic. The story takes care of that. It comes down to this. What, exactly, does Humbert do that's so wrong? Is it that he has sex with a minor? Considered in itself this is the least of his crimes. What's really wrong is the way he attempts to be Lolita's lover and guardian simultaneously, and, of course, he makes a hash of both jobs. THAT is what's essential to the story of Lolita, and that's what Kubrick transfers to the screen at least as well as Lyne. Having said that I must add that both versions are very good. They're also different enough to scarcely even be competitors. See them one after the other, if you like.",
         "I have seen both versions of Lolita now. The 1997 version, directed by Adrian Lyne, certainly has it's merits, and is headed by two very good leads in Irons and Swain. But it is this, Stanley Kubrick's adaptation, that I prefer overall. Kubrick said in an interview after the film's release, \"Had I known what I would've had to cut out, I probably wouldn't of made the film.\" It's a surprising irony though that what had to be suppressed or changed from the book works to his advantage. Like other works under the master's belt, this has some comedy that is so dark that you almost (or do) feel guilty after laughing. The innuendo, even decades later, is still as provocative. And when it gets disturbing, it doesn't go too far over the line. I have not read the book, but I have heard much about it, what was different, and I think Kubrick at least is most successful at infusing his trademark touches to the material. For starters, there is the acting. Like with for example Full Metal Jacket, the supporting actors somehow outrank the leads. This is not to say that James Mason (Humbert Humbert) and Sue Lyon (Dolores \"Lolita\" Hayes) are not highly believable in their parts. But in looking at Peter Sellers in his multiple roles via the curious, insanely oddball Quilty, and Shelley Winters as Lolita's mother, they are simply flat-out brilliant (I would choose a better word if I could, believe me). Right from the first scene, which happens to take the last scene of the story in place, Sellers doesn't have me for a second thinking that he isn't perfectly off-the-wall. As was in Dr. Strangelove, his contributions to the project are incalculable. Winters, on the other hand, finds that balance with Mrs. Hayes as a lonely middle-aged woman looking for companionship, though unable to shake her over-protective tendencies. As for Mason and Lyon, their scenes together are at the least a little overtly melodramatic (which might have been the idea, it may take another few viewings to really grasp the weight of their performances) and at best helps define what the film is about. Mason finds the right notes, if a little anxiously and stuffy at times, in how Humbert is almost like a kid trying to break out of his middle-aged professor image. When he meets Lolita he's awestruck, and falls for her hard, very hard, which sets up what happens to the two of them for the rest of the film. What is even more interesting is how the dynamic is placed with Lolita, who is wiser in ways Humbert is not, and how the sort of idea of mutual youth is tempting, but definitely not everlasting. As the film unfolds it's third act, the film becomes an intense kind of morality tale, where male insecurities are touched upon with Humbert, and even Quilty to a degree. Kubrick, being one of the finest of dramatic character psychologists, hardly skips a beat in making sure not to lose the strange bits (which must be some of the better bits in Nabokov's text) with humor. Then there is the most rewarding thing of all in a Kubrick film, which is seeing how he photographs the scenes and characters. It holds some of the moves and angles and lighting he's held to for all of his career (some shots show as a precursor to Eyes Wide Shut perhaps), and how the camera stays on the characters in many scenes (actually, almost all the scenes) adds that right tension and space between us and them. If anything else, just watch the film for the sake of watching a film moving and staying put and capturing faces in particular ways. Lolita, in the end, may not be one of my very favorite Kubrick films (though only time and repeat viewings will tell), but it's certainly worth a viewing. Some Kubrick fans may come to this after seeing the essentials like 2001, the Shining, or Clockwork Orange, however it could come as being a favorite in some circles. It certainly is, for my money, as enticing and intriguing a sexual satire I've seen in many a moon.",
         "I think Stanley Kubrick was the only director who had any ideas of how to tackle a film version of Lolita. I also believe that he was the only director who could have succeeded, and I believe he did succeed. This film was everything I could have expected it to be, and maybe even a little more. Shelley Winters' performance was wonderful! James Mason delivered a strong effort in a very difficult part to play. Peter Sellers was Peter Sellers, four or five times throughout the movie, but that's Peter Sellers, and that's why I am really starting to admire his work. The real surprise performance in this movie, however, came from Sue Lyon in the title role. Her intensity was incredible. She seemed perfectly natural as a teenage girl enjoying the attention of older men, or just men in general. You could really see the wheels turning in her head as she schemed her way from one situation to the other. Some have criticized that her Lolita was \"too old\" in comparison to the novel's Lolita. One could make that judgment, however, what twelve year old actress would have been able to provide the emotional depth required for the part? Let's face it, in literary adaptations, some license must be allowed. All in all, I thought it was a very good movie, and I would recommend it to anyone who enjoys the work of Stanley Kubrick and/or Peter Sellers.",
         "A significant part of Stanley Kubrick's genius was his ability to translate a literary style into a visual one. It is demonstrated nowhere more brilliantly than in LOLITA and A CLOCKWORK ORANGE. LOLITA is perhaps the more stunning accomplishment, in that Nabokov's style is complex and multi-layered. Yet Kubrick captures the effect of it in camera angles and movements, in timing and point of view. The broadest layer of Nabokov's novel, the parable of the aging culture of Europe trying to revivify itself by debauching the seductive young culture of America, is really missing in the film. But everything else is there, despite the fact that the film departs from the exact events of the novel. Not to say that the film depends on the novel. It stands by itself quite easily. But it succeeds brilliantly in conveying the ideas and feelings that are the core of the novel, and it does so in completely cinematic terms. If films are to be based on works of literature, this is the way to do it, and the way it is almost never done.",
         "This film remains my all-time favorite. It's a delicious, adult meditation on youth, obsession and sex. While not entirely faithful to the novel, it captures the book's spirit and is nonetheless a masterpiece on its own terms. To fully appreciate what Kubrick has done, compare this version to Adrian Lyne's anemic remake. Kubrick chose his cast wisely for the most part. James Mason conveys both the tormented inner soul and the outwardly polite gentleman with such charm that you simply can't despise him for his treachery. Shelley Winters was never better as the shrill, man-hungry shrew. Sue Lyon is enormously credible in a complex role - physically attractive, childish at times in her behavior, but quietly calculating and manipulative. The weakest link is Peter Sellers, who Kubrick found amusing enough to let him run on too long. Sellers was a brilliant performer, but just not right for this film. As Quilty, he's fine. When masquerading as others, he's mostly intrusive and tends to alter the tone of what's going on. The need to tread carefully around the censors in 1962 actually works in the film's favor. There's a sophisticated subtlety that counterbalances the lurid subject matter. In fact, I even prefer the edited-for-television version of the scene in which Humbert and Lolita first have sex. Here she merely whispers in his ear before a suggestive fade-out. In the complete version of the film, the scene continues with them discussing a silly game played at summer camp. The less said, the better. \"Lolita\" has aged remarkably well. Its topic is relevant today, and the careful craftsmanship that went into this production holds up beautifully. I think it's Kubrick's best film - they tended to get more self-indulgent as time went on. This one's a gem. Not to be overlooked are the aptly provocative title sequence and Nelson Riddle's luscious piano score.",
         "Not the two words that came to mind when I first read the book. This movie nicely handles the taboo subject matter and is tremendously funny as well. Peter Sellers was warming up for his triumph in Dr. Strangelove, Shelly Winters gave her best performance, and James Mason made us feel his pain. As Lolita, Sue Lyon is convincing although Kubrick makes her character a bit older (probably to satisfy the censors, which still slapped this with an X rating originally, much to my surprise). The movie could play on TV today with no edits. I have not seen the 1997 remake but can only imagine, given its director with a reputation of going over the top, that it's not as classy and tasteful as this one. Since this was made in 1962, the risque elements from the book were left to our imagination. And the movie scores highly because of it. The movie's story is stuck in the '60s (that bubblegum music, which played during Lolita's early scenes, will stick with you), and if you are bored with the story, or cannot believe what you're seeing, you can always get a culture lesson: Hula hoops, malt shops, pseudo intellectuals, faulty cots and gas stations where they still pump your gas.",
         "What a surreal, dreamlike world Stanley Kubrick creates with this intriguing film! The book, a recognized 20th century classic, is at times disturbing, hysterically funny, uncomfortably erotic, and heartbreakingly sad. The film, made in the 60s, captures many of the same feelings generated by the book--but the censorship of the time could only allow Kubrick to suggest the more intimate and erotic aspects of the book--which he slyly succeeds in doing. It is hard to believe now, but when this film was released, it was considered to be unbelievably provacative and absolutely for adults only. The movie becomes its own artistic statement---Kubrick doesn't merely try to recreate the scenes and storyline of the book--although much of it is there--but he uses the period music, speech, clothes and mannerisms to create his own imaginative and fascinating world. At the same time, we sure do end up caring about the characters. Within the exceptional cast, note the special performance Shelly Winters gives--her character is at once funny and so achingly sad and pathetic. This is a real tour-de-force of acting. In several instances we go from laughing at her to really disliking her, to feeling so very sorry for her. She creates a truly memorable character.' The film ranks right up there with all of the spectacfular films Kubrick made during his amazing and very singular career---each of his films was so distinctive--and Lolita is one of the most distinctive of them all.",
         "Having read the Nabokov novel and the two well-known versions of the film, I believe the most accurate way of defining the relations is: Lyne´s film is more faithful to the literal reading of the story, Kubrick's one is far more faithful to its spirit and, what is even more important, it isn't drowned by comparisons with the book. Probably what bothers most people who have seen both films and read the novel is that Kubrick gives ample space to cynicism, farce and mocking of all the main (and even secondary) characters: it ridicules both the cultured, refined and cosmopolitan Englishman and the pseudo-liberal and fairly tacky Americans (the cultural and behavioral differentiation reminding me of Henry James, just in reverse). The child temptress is here seen more realistically as a sexy however vacuous and irritating teenager and Humbert´s love of her as a noble and real but tremendously stupid infatuation (coming from a cold-headed intellectual like him). Also delightful the portrayal of alcoholic and neurotic Shelley Winters, and particularly of Peter Sellers as a mediocre tv writer enhanced by American middle-class culture. There is a lot of witty sociopolitical criticism here. Adrian Lynne's version, being utterly romantic (and striving really too hard to be poetic) may seem more accurate on the love story but is really Nabokov's intention to tell a love story as such? I can't really appreciate how such wonderful novelist could be so obvious and open to his reader. Not forgetting the romanticism of Humbert's feelings of despair towards the girl, Kubrick doesn't indulge in a simple love story but explores all the most obscure consequences of irrationality and does so with irony and sarcasm (humour is everywhere) but also with a touch of compassionate dramatism when appropriate. We have a classic here, both faithful to the novel and full of innovations. Lynne´s intent is merely a limp follower of its two (the literary and the filmic) predecessors.",
         "8/10 Kubrik's version of Nabokov's tale of a middle-aged professor's self-destructive obsession with a young schoolgirl. Making a film that dealt with underage sex was considered impossible in 1962 due to the strict censorship regulations. Kubrik manages to get round this by merely alluding to sexual encounters and subtle wordplay and symbolism creeps into several scenes. He also raises the girl's age from 12 in the novel to 14 in the film. Lolita is also rich in Kubrik's trademark dark humour. The three central characters of the novel are all portrayed more than adequately in the film; James Mason as the smitten professor, Shelley Winters as the suburban widow with pretensions of culture and Sue Lyons as the young nymphet. However, it is Sellars' performance as the creepy eccentric Clare Quilty (a relatively minor character in the book) that steals the show and, ultimately, makes the film. The opening scene (which is the ending of the film) is an outstanding testament to his talent and versatility. The said scene gives the film the same \"circular structure\" used by David Lean in \"Brief Encounter\". My favourite moments include; Quilty's re-introduction to the film at the school's summer ball as the camera pans across the dancefloor and subtly reveals a look of comic ambivalence on his face as he dances with his lover, Humbert awkwardly trying to book the only remaining hotel-room at the police convention and Humbert again trying to teach the cynical Lolita the joys of Edgar Allen Poe's poetry. I thoroughly recommend this film. My only complaint is the length - the final third seemed to drag a bit."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Seven Arts Productions",
         "A.A. Productions Ltd."
      ],
      "summaries": [
         "Humbert Humbert, a divorced British professor of French literature, travels to small-town America for a teaching position. He allows himself to be swept into a relationship with Charlotte Haze, his widowed and sexually famished landlady, whom he marries in order that he might pursue the woman's 14-year-old flirtatious daughter, Lolita, with whom he has fallen hopelessly in love, but whose affections shall be thwarted by a devious trickster named Clare Quilty.",
         "A middle-aged college professor becomes infatuated with a fourteen-year-old nymphet."
      ],
      "budget": 2000000
   },
   "movielensId": 2729,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-06-13",
      "dvdReleaseDate": "2001-06-12",
      "directors": ["Stanley Kubrick"],
      "runtime": 153,
      "movieId": 2729,
      "title": "Lolita",
      "mpaa": "R",
      "actors": [
         "James Mason",
         "Sue Lyon",
         "Shelley Winters",
         "Peter Sellers",
         "Lois Maxwell",
         "John Harrison",
         "Diana Decker",
         "Jerry Stovin",
         "Gary Cockrell",
         "Bill Greene",
         "Shirley Douglas",
         "Marianne Stone"
      ],
      "imdbMovieId": "0056193",
      "originalTitle": "Lolita",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["viyXn6IX9lw"],
      "plotSummary": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
      "tmdbMovieId": 802,
      "avgRating": 3.80797,
      "releaseYear": "1962",
      "numRatings": 3614,
      "posterPath": "/heRYtNrkHLj3Lwghr2jPBX7Yc29.jpg"
   }
}