{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "paradise",
            "id": 439
         },
         {
            "name": "living together",
            "id": 3676
         },
         {
            "name": "power",
            "id": 3720
         },
         {
            "name": "governance",
            "id": 6088
         },
         {
            "name": "exit",
            "id": 6502
         },
         {
            "name": "idealism",
            "id": 6987
         },
         {
            "name": "honduras",
            "id": 7105
         },
         {
            "name": "idealist",
            "id": 9031
         },
         {
            "name": "nature",
            "id": 18330
         },
         {
            "name": "emigrant",
            "id": 192519
         }
      ],
      "imdb_id": "tt0091557",
      "video": false,
      "title": "The Mosquito Coast",
      "recommendations": [
         10675,
         10443,
         14628,
         10859,
         11896,
         9941,
         19382,
         10990,
         2565,
         14170,
         2107,
         9096,
         12560,
         15393,
         9080,
         10631,
         13766,
         9281,
         9331,
         11092
      ],
      "backdrop_path": "/bH0LGWWwtWDsHN031sW70ktPhoE.jpg",
      "revenue": 14302779,
      "reviews": [{
         "author": "Vincent",
         "id": "54d1fb8a9251411b57002344",
         "content": "**Disney for Anarchists**\r\n\r\nBefore there was a McConaissance there was a Harrisance, That's right, you heard right: Harrisance. Within a few years in the 1980's Harrison da Chicago lead what was arguably the greatest adventure movie ever mounted, and possibly the best science fiction movie ever launched. He was also featured in that adorable little _Star Wars_ trilogy. Not to mention a slew of fine movies like _Presumed Innocent_, _Frantic_, _the Fugitive_, and two thrillers as Jack Ryan. Among my favourite movies from the Harrisance period (if I keep saying it, it will be a thing) were two directed by Peter Weir, an Aussie who never met a cultural clash he didn't want to shoot. Weir directed a couple of American films and chose the right man to lead them. _Witness_ was well-liked and had a righteously tough Harrison cop defending the Amish. But in my opinion, _Mosquito Coast_ was better. Look at the headliners. Harrison Ford , Helen Mirren, River Pheonix, from a story by Paul Theroux, scripted by Paul (_Taxi Driver_, _Raging Bull_) Schrader. The jaded Film Critics at the time weren't exactly blown away by the movie's ambitious scope but liked the way Harrison could play an anti-hero. What's so anti about him? He was great! I wish he was my dad. I would have loved to go on an escapist adventure with a genius inventor father who had grand visions of erecting a new utopia in the forests of Belize by manufacturing ice in the tropics. Okay, maybe he went too far. Got a bit swollen-headed and delirious. Became the patriarchal tyrant he was running away from. But that was from the rage he felt when realizing that while (in the 1980's) he might be able to elude multinational greed, he can't escape human avarice. O the tragedy of humans",
         "url": "https://www.themoviedb.org/review/54d1fb8a9251411b57002344"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 8,
               "character": "Allie Fox",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251a1",
               "name": "Harrison Ford",
               "profile_path": "/7LOTdRfHU1H1qHBxpUv3jT04eWB.jpg",
               "id": 3,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Mother Fox",
               "gender": 1,
               "credit_id": "52fe43fc9251416c750251a5",
               "name": "Helen Mirren",
               "profile_path": "/4EGgBJPUBz68ZrnFuLVo01r0uND.jpg",
               "id": 15735,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Charlie Fox",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251a9",
               "name": "River Phoenix",
               "profile_path": "/qfokbmRwRvmIVsLHScshxLPAB3C.jpg",
               "id": 741,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Mr. Haddy",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251ad",
               "name": "Conrad Roberts",
               "profile_path": "/iKm5u3gADmcDAHMTQf96uWpDnZL.jpg",
               "id": 33688,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Emily Spellgood",
               "gender": 1,
               "credit_id": "52fe43fc9251416c750251b1",
               "name": "Martha Plimpton",
               "profile_path": "/7lU1kci6OZMwZk5Kxfnz0u8B5l5.jpg",
               "id": 17495,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Reverend Spellgood",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251b5",
               "name": "Andre Gregory",
               "profile_path": "/cHrPNHXH3QhNqYd3UUETcHM1OlB.jpg",
               "id": 109470,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Mr. Polski",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251b9",
               "name": "Dick O'Neill",
               "profile_path": "/t4yEaFexDrQvLqrpNW1FaAuBtq3.jpg",
               "id": 14835,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Jerry Fox",
               "gender": 0,
               "credit_id": "52fe43fc9251416c750251bd",
               "name": "Jadrien Steele",
               "profile_path": "/xeaNCT3YHqw8E8EY1G6Waa140m7.jpg",
               "id": 553420,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Francis Lungley",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251c1",
               "name": "Michael Rogers",
               "profile_path": "/qy9YAUpJrmJH27aOu1Uxm1bO5cv.jpg",
               "id": 216444,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "April Fox",
               "gender": 0,
               "credit_id": "52fe43fc9251416c750251c5",
               "name": "Hilary Gordon",
               "profile_path": "/iK7SMv3uF2NDC3CDpbIXRz2uALW.jpg",
               "id": 27506,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Clover Fox",
               "gender": 1,
               "credit_id": "52fe43fc9251416c750251c9",
               "name": "Rebecca Gordon",
               "profile_path": "/uomKdkL1BNyRn5QmR2qnTHEx8K9.jpg",
               "id": 27507,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Hardware Clerk",
               "gender": 2,
               "credit_id": "52fe43fc9251416c750251cd",
               "name": "Jason Alexander",
               "profile_path": "/ernpSXp2RnkzeV14OEEKXRq1yND.jpg",
               "id": 1206,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Ma Kennywick",
               "gender": 1,
               "credit_id": "52fe43fc9251416c750251d1",
               "name": "Butterfly McQueen",
               "profile_path": "/i41zpICsZwsuGyZe946MM8BG5hI.jpg",
               "id": 11500,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Mr. Semper",
               "gender": 0,
               "credit_id": "59afa90c925141078a0698ac",
               "name": "Tiger Haynes",
               "profile_path": "/hi1GJDmjE1qnkhPphfEYk843oAx.jpg",
               "id": 90186,
               "order": 13
            },
            {
               "cast_id": 22,
               "character": "Captain Smalls",
               "gender": 2,
               "credit_id": "59afabbbc3a3682e6401081a",
               "name": "William Newman",
               "profile_path": "/tSFsRnK1jfCc50yinO5MpFnJL3c.jpg",
               "id": 77027,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c75025179",
               "name": "Peter Weir",
               "profile_path": "/bQzmyhBOqCSrnSmCaRmi2T2b4Zf.jpg",
               "id": 2690,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c7502517f",
               "name": "Jerome Hellman",
               "profile_path": "/pw7HLpbqZ8WXySS4atQCOrZcrEV.jpg",
               "id": 30571,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c75025185",
               "name": "Peter Weir",
               "profile_path": "/bQzmyhBOqCSrnSmCaRmi2T2b4Zf.jpg",
               "id": 2690,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c7502518b",
               "name": "Maurice Jarre",
               "profile_path": "/yJDDi7RKlxHjb7g8NZTEhnS4drG.jpg",
               "id": 2704,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c75025191",
               "name": "Paul Schrader",
               "profile_path": "/hLdjFQOtgnvgKVL73dH6CWluicy.jpg",
               "id": 1035,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c75025197",
               "name": "Thom Noble",
               "profile_path": "/pl35WClWJFiuBao1dTMoV4PaxOj.jpg",
               "id": 17399,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43fc9251416c7502519d",
               "name": "John Seale",
               "profile_path": "/w4wp04pRMqJI2vt3gFTdIWLDDzp.jpg",
               "id": 2702,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 6.152137,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11120,
      "vote_count": 157,
      "budget": 0,
      "overview": "Allie Fox, an American inventor exhausted by the perceived danger and degradation of modern society, decides to escape with his wife and children to Belize. In the jungle, he tries with mad determination to create a utopian community with disastrous results.",
      "similar": [
         11314,
         11848,
         29440,
         22716,
         8093,
         21742,
         31034,
         256362,
         277797,
         120658,
         206671,
         301301,
         78097,
         111312,
         384279,
         306379,
         168456,
         419402,
         297684,
         450788
      ],
      "original_title": "The Mosquito Coast",
      "runtime": 119,
      "poster_path": "/8A1iDYSp8H5WORWZVCV3E3SpkGD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1986-11-26",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "He went too far.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Weir"],
      "runtime": 117,
      "synopsis": "This film has it all! It is a fascinating look at the humanist mindset. Basically, it goes like this: Allie (Harrison Ford) is a genius, who \"dropped out of Harvard to get an education.\" While that seems to be the trend with several very successful Americans, this \"inventor/genius\" of unconventional psychological make-up, makes it the celebration of his life. A modern-day Robinson Crusoe, Allie determines to move his family to the jungle. There they discover that paradise isn't paradise as long as evil men exist on this earth. Their particular awakening comes in the form of machine gun toting men who arrive in their slice of utopia, and demonstrate plans to both take over, and take his wife. The resulting Allie-led war ends the illusions of man-made heaven on earth.",
      "writers": [
         "Paul Theroux",
         "Paul Schrader"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091557/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgxNTEwNzI1OV5BMl5BanBnXkFtZTcwMjU5MDAyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Harrison Ford, Helen Mirren, River Phoenix | See full cast and crew »"],
      "reviews": [
         "Mosquito Coast is one of the best books I have ever read, and the movie does super well to do justice to that novel. It is also one of Harrison Ford's best character roles; the eccentricity and opinionated genius of Allie is done to perfection by him. Peter Weir's brilliant direction is to be expected considering his other masterpieces \u0096 Fearless, also based on an excellent book of the same name, is one of the best movies yet. His films (Truman Show, Green Card, and Witness come to mind) tend to chronicle troubles and eccentric characters to go out on a limb, literally. The narration is carefully done, only enough voice-overs to explain the philosophical implications and underpinnings of the characters' thoughts and actions. There are, of course, some mysterious elements to how things happen, which can only be remedied by reading Theroux's book of the same name. Taking a very Robinson Crusoe-esquire piece of fiction and putting it to film is not an easy process. In fact, this is the kind of novel that can be very easily messed up by the movies with strong action and adventure type Hollywood direction. Luckily, Weir has done an excellent job portraying the characters \u0096 not so much the plot \u0096 of those who will come to inhabit The Mosquito Coast. In short, not only is Mosquito Coast a film to watch, it should be required. RATING: 10/10 \"We eat when we're not hungry, drink when we're not thirsty. We buy what we don't need and throw away everything that's useful. Why sell a man what he wants? Sell him what he doesn't need. Pretend he's got eight legs and two stomachs and money to burn. It's wrong. Wrong, wrong, wrong.\"",
         "I can almost guarantee that anyone who has seen 'The Mosquito Coast', then looked at the subject line of this review, thinks I'm crazy. The truth is that this film is deeply flawed and undeniably weak in many regards, but it had a quality I cannot describe. This is the only film I have ever seen that, despite many shortcomings, manages to come out of the storm relatively unscathed, and become an unforgettable, almost haunting, movie. The production values are immaculate. Peter Weir's direction is excellent, and is in top form here. He has crafted a thick shell that blocks the flaws from coming up to the surface, an indescribable feat that very few directors have accomplished. The musical score is good, not outstanding, but it's fitting, and surprisingly subtle. There is only about six minutes out of the entire film that has musical accompaniment, which makes for a very unique experience, and not necessarily a bad one. The tropical cinematography is dazzling, and the decision to shoot on location in Belize instead of on a studio back lot really paid off, contributing greatly to the film's success. As good as the mentioned characteristics are, nothing is as good as the acting, especially that from the two leads: Harrison Ford and River Phoenix. Prior to this, Ford had made a name for himself with big budget action roles, with several failed attempts at drama (Hanover Street being the best example of that). It wasn't until 1985's 'Witness' (which Peter Weir also directed, that Ford was taken seriously as an all around actor. Personally I think Ford's performance here greatly overshadowed his work in 'Witness', and is a career best for him, even in the light of 'Regarding Henry' and 'Presumed Innocent', both made after his. He takes the character of Allie Fox, and moulds him into a selfish, driving maniac, blind to the wishes of others, only caring for himself. Phoenix, on the other hand, deserves even more acclaim, for several reasons. For one, this was only his third film, after 1985's 'Explorers', and 'Stand by Me', made right before this. Secondly, he was only 15 at the time of the shoot, and had little acting experience, yet he easily out acted most of his co-stars. Though his performance wasn't quite as refined as Ford's was, he still reached a level of near perfection and set the stage for a glorious, and ultimately tragic, career. The story is one of utter genius, one of the few original ones popping up in an industry full of sequels, remakes and rip offs. Based on the 1981 bestseller by Paul Theroux, and co-starring Helen Mirren, 'The Mosquito Coast' deserves a place among the best films of the 80's. But wait, I'm not done. Despite a great exterior, deep inside the movie is troubled. It's as if director Weir pushed all the movie's problems deep down under the surface, then piled layer after layer of... something, on top of it, hiding them from the clueless audience. My main problem with the movie is that it yearns to break away from it's literary roots, a problem that could've been easily avoided had the right script come along. Entire conversations are lifted from the text, and there isn't a single line that doesn't have an equal counterpart in the novel. For me this got extremely tedious as, hours before popping in the tape for a second viewing, I had finished the book, and the two are much too similar. Another problem I have with it is that the scenes are much too short, with none of them running over about a minute and a half. An obvious result of this is that many subplots remain unresolved, and several concepts are hinted at, but go without further explanation, making for a confusing story. If the screenwriter had put a little more effort into making the film different than the book, with new scenes, we would have seen a much better end product. A third, albeit a smaller one, is that the production team apparently spent too much time making sure that the movie would get a PG rating, though it would've been much better had it gotten an R, or even a PG-13 rating. That would've allowed Ford a little more breathing room to tweak his character, possibly allowing Allie to become less sympathetic, more of a madman. I can't think of much more worth saying to put in this review, so I'll end it with this note: see the movie, even if you've read the book, but don't do the two back to back.",
         "Some of the other reviews summarize this pretty well. The Mosquito Coast details flawlessly the grotesque decomposition of a good and true man. Harrison Ford's Allie is driven insane by his own intelligence and inability to control his ego. Even more remarkable and disquieting is the fact that this is based on a true story. In some ways, Allie reminds me of Dr. Mobius from Forbidden Planet. But the demons Allie conjures up are far more grotesque and deadly than anything from even Mobius' warped imagination. I conclude that this is a true piece of art and science -- magnificently crafted from beginning to end -- and I will NEVER voluntarily watch it again.",
         "Someone once said that ignorance is bliss; and if you follow through the reasoning process that leads to that conclusion, you discover that it is, indeed, true. Another way of saying it would be, that the less you know, the happier you are likely to be; kind of a `what you don't know can't hurt you' perspective, but true, nevertheless. Conversely then, what can be said about knowledge? About knowing too much? Can genius, for example, be equated with a life of torment? Can knowing-- and more precisely, understanding-- too much bring about anguish and unhappiness? The answer to that , of course, cannot be absolute, for there are a number of variables that must first be factored in, one of the most prevalent being that thin line that separates the true genius from madness, and how close to which side of that line the individual in question resides. It's a situation examined in depth by director Peter Weir, in his riveting, thought provoking drama, `The Mosquito Coast,' starring Harrison Ford, Helen Mirren and River Phoenix. Allie Fox (Ford) is a family man; he has a devoted wife, `Mother (Mirren),' and four children, the eldest of whom, Charlie (Phoenix), thinks his dad is a genius. Which he is. Allie Fox is an inventor who believes it's man's job to tinker with an unfinished world and make it work. He is also a true individual, the epitome of the man who marches to his own drum-- and in his case, his drum is the `only' one he will march to. He sees such potential in everything around him, but he also sees that very same potential being wasted at every turn by seemingly everyone, from the average guy just trying to make a living, to a Corporate America he sees as the impetus that has already begun to destroy the nation. All around him he sees a country and a people that has lost that spirit that made America strong; he sees ruin and decay in everything: In the lack of quality in any and all manufactured goods, and in the apathy of the acquiescent consumer. And he's had enough. Refusing to stand by and watch America die, he packs up and moves his family to a remote section of a jungle in Central America, near the coast of La Moskitia; and it is there that he discovers a land, that to him, is paradise-- and where he also encounters the demons that plague those who know too much, and feel too deeply. Working from an intelligent and penetrating screenplay by Paul Schrader (adapted from the novel by Paul Theroux), Weir delivers a thoroughly engrossing character study that parallels Werner Herzog's 1972 masterpiece, `Aguirre, The Wrath of God,' inasmuch as it examines the effects of self-perceived omnipotence in an individual driven to extreme measures by a singular quest for power and autonomy (albeit in different times and with different motives). Allie Fox, like Don Lope de Aguirre, becomes a victim of his own obsession, consequently victimizing those around him, as well, by losing sight of his own ideals and getting swept away in the current of a distorted sense of purpose. Allie leaves an environment he perceives as defective for one that is ultimately equally flawed-- that being the environs within his own mind. All of which is hauntingly presented by Weir, aided by John Seale and Maurice Jarre, whose cinematography and score, respectively, helps to create the atmosphere that so effectively underscores the drama of the story. As Allie Fox, Harrison Ford gives a performance that is one of his best and most powerful ever, affecting a commanding presence that dominates virtually every scene-- so compelling that his presence is felt even when he is absent from the screen. This isn't a character you are going to like, necessarily; and yet you are going to care about him, because there's something in him that reflects and addresses concerns that are universal, which makes Allie someone to whom many in the audience will be able to relate and identify. He's the man who believes that he truly `can' be an island unto himself, and beyond his personal peccadilloes, that is the kind of strength that demands admiration; for at the same time, it enables forgiveness. It's a solid portrayal of a man at cross purposes with himself, who realizes to some extent what he is doing, yet adamantly refuses to back down. And this is the man Ford brings to life so vividly; he's convincing, and his Allie Fox is disconcertingly real. Helen Mirren also turns in a memorable performance as Allie's devoted wife, whom he calls `Mother.' Mirren says more without dialogue-- through a subtle expression, or even the merest glance-- than most actors do with a limitless number of words. And it's her moments of silence that are some of the most telling of the film, while at the same time adding strength to the lines she does recite. In the end, Mirren creates a character who chooses her words well, then uses them wisely-- and it's a portrayal that is, without question, one of the strengths of the film. In the way Mother looks at Allie, Mirren conveys that love and absolute loyalty that makes everything they do believable. There is complete trust there, which you can feel when, standing in her kitchen, for example, she gives a final glance at the dishes piled high in the sink; a glance at the life she's leaving behind to follow her husband. And she's happy. In it's simplicity and brevity, it's a powerful scene that says so much about who she is, and who `they' are. And Mirren makes it work beautifully. Phoenix does a solid job, too, providing the narrative of the film as Charlie. He is perfectly cast as Ford's son, and he succeeds in giving `The Mosquito Coast' that sense of reflection and perspective that makes it a truly memorable, and emotionally involving, film. 9/10.",
         "With much of Harrison Ford's career during the eighties dominated by his participation in George Lucas and Spielberg blockbusters, it comes as a relief to discover that in between his numerous flights on the Milennium Falcon and slashing his whip he found time to star in many low key movies. Among these hidden treasures is The Mosquito Coast, a character driven story about one mans attempt to recreate an Eden in a faraway land. And his secret to survival? Ice. This is an interesting movie, not only because it has an all star cast, that includes River Phoenix, but because we see Harrison Ford give his all to creating a character that is multi dimensional. He is an idealist and has the best intentions, yet is doomed to failure as the viewer senses an impeding violent side to his vision which will come to destroy him. As a movie this is a good study of man's attempt to act upon his dreams, as a lighthearted pop corn flick this will annoy the average mainstream cinema goer. Simply put, many people will find it hard to imagine Harrison Ford as anything else other than the super hero incarnation of Indiana Jones, and multi faceted anti heroes that never see the errors of their ways is a genre of cinema that Hollywood hasn't quite got their head around yet. For everybody else who would like to see a movie that has depth, great acting and a solid script, this will be excellent viewing.",
         "You can watch \"The Mosquito Coast\" and think of how cruelly the world tends to treat idealists. Or you can think how cruelly Hollywood tends to treat literature. It's true either way. Harrison Ford stars as an inventor named Allie Fox, who leads his wife and four young children into the wilds of Central America (Belize here, Honduras in the novel) to get away from Western civilization, where people eat too much of the wrong things, anesthetize themselves with cheap entertainment, and are lulled to sleep by the falsities of materialism and Christianity. Allie is better than that, of course, and so he plunges himself and his family into a jungle clearing beside a river. There they create a rustic utopia they can call their own, complete with a giant ice machine that works from internal combustion fueled by ammonia hydroxide. For a while they enjoy the simple life, complete with air conditioning and pedal-powered laundry machine. But paradise can be easier to attain than it is to maintain. Ford obviously wanted to sink his teeth into some deeper material after the success he had in so many popcorn classics. He was coming off his best performance, in \"Witness,\" and took that film's director Peter Weir along for the river run. You have to give Ford credit for seeking such challenges at the apex of a profitable career, and he does a good job with the character in the script. But the script presents more of a star vehicle for Ford's ambitions than anything worth viewing on its own merits. It's funny that reviewers like Roger Ebert slammed this movie when it came out because Ford's character was unbearable. Allie Fox in the novel is unbearable, which is why the book is so good. He pushes and pushes his family and punishes them for their devotion. Even before making landfall in Central America, he goads his oldest son, Charlie, to climb a ship's mast and swing from the rigging. He rags on Charlie constantly, without reason, and is a thorough misanthrope, albeit often compelling as portrayed in the novel by Charlie's narration and author Paul Theroux. But Fox in the movie is not so unbearable. We see Fox and his son, played by River Phoenix, share laughs and backslaps. He hugs and jokes with his wife, \"Mother,\" played by Helen Mirren. Fox in the book is a dark man who spews insults at people, or makes loaded comments and then excuses himself with a terse \"Just kidding.\" Ford imbues him with a sense of humor, an air of reasonableness, and squares off with antagonists who are truly nasty rather than ambiguous targets of Fox's hostility. Ford maintains Fox's sense of idealistic contempt with Western civilization, and has fun with the many rants Fox throws up. A nice scene shows him going on about something as he starts a chainsaw, continuing to talk as the saw's roar drowns him out and not noticing. But a lot of the time Ford presents us with a beautiful dreamer, and the central idea of the story, that Fox is quite a dangerous man, is lost. The result is a picture that lacks something the novel has, a sense of depth that gives perspective to the suffering we witness. The story in the book is Charlie's discovery of his father's selfish, dangerous heart. In the movie, it's more like: Why do bad things happen to courageous idealists? After a while, you start to glaze over from it all, and \"Mosquito Coast\" becomes an ordeal without a point.",
         "Frothing at the mouth with disgust for his homeland America, inventor Allie Fox (Harrison Ford), with family in tow, pulls up roots, and moves to Central America. Here, he proceeds to build a new life in the jungle, using his mechanical skills, his inventiveness, and in particular his patented machine, which produces ice, sans electricity. \"Ice is civilization\", he proclaims with unctuous authority. That will be the foundation for his utopian dream. But Allie is so headstrong, so convinced of his infallibility that his vision blinds him to reality. And the film's ending is poignant. Delusion and self-deception breed nightmarish outcomes. And the cinema, through the years, has dramatized these themes quite well, in films like \"Aguirre: The Wrath Of God\", \"Fitzcaraldo\", and \"Deliverance\". In real life, delusion and self-deception were the basis for the events surrounding American preacher Jim Jones who, in the late 1970s, relocated his naive flock to the jungles of Guyana, whereupon he established Jonestown, envisioned as a religious utopia. The result was tragic. Beyond the deep themes thus expressed in the script, \"The Mosquito Coast\" looks good visually. The tropical scenery is spectacular. Production design and cinematography are terrific. And the film's score, by Maurice Jarre, is wonderfully exotic and majestic. My only complaint is the character of Allie Fox, who at some point badmouths just about everyone and everything. I could have wished for a quieter, less loquacious, madman. Then too, Harrison Ford plays Fox in a way that overrides subtext. In short, Fox not only is delusional and self-deceptive, he's also preachy, domineering, and totally lacking in compassion for others, someone whom we as viewers cannot root for or have any empathy with. \"The Mosquito Coast\" reminds us that the grass is not always greener on the other side of the fence. Chasing that elusive pot of gold at the end of the rainbow is for dreamers. This is a good film to watch when you're facing a pile of problems. You could be like Allie's family, trying to forge some existence in the jungles and listening to the rants of an icy madman.",
         "Harrison Ford is brilliant in this film, as is the rest of the cast, and I am a big fan of this sort of film that explores the human psyche. I, however, wish the film spent just as much time showing the Missionaries evils and maniacal religious B.S. as it did painting Ford's character as a dangerous megalomaniac. I disagree with many of Ford's characters decisions over the course of the film...and in the long run he ends up becoming exactly what he set out to destroy, but his ideas on America are SPOT ON (and are just as relevant today) and it goes without saying that his errors are paled in comparison to what Christian missionaries have done through the brainwashing of the 3rd world people. My point is that Ford's character's plans were ill-conceived and nutty, but the world he left was just as insane.",
         "Most of the others that took the time to comment on this film would seem to agree on a certain point: that this movie sticks in your mind. It is not simply a night spent with a videotape. It is an experience in emotional extremism and moral inquisition. The central motive of this movie is to send a wake up call and point out that the world we live in has been doomed since the dawn of civilization. This movie is a doomsday prophecy. Harrison Ford heads an enormously talented cast that is the both the perfect model and the antithesis of a working family. Ford plays Allie Fox, an American inventor who moves his family into the jungles of a Carribean Island paradise. His story, the story narrated by his oldest son (River Phoenix), is a gut wrenching, heart pounding tale that is marvellously captured by the actors that he presides over with his token cynicism and quick, sharp wit. Ford's Allie leaves America to begin anew in a world that has not yet been developed or corrupted by a modern society wraught with materialism and blind faith. What he does not understand is that his ambitions will only lead to the creation of a new society that is almost certainly a micro-carbon copy of the archetype that he wishes to escape. Pollution, violence, religous meddling all have their place in Allie's world, but he refuses to aknowledge to himself and to the people that he presides over that he has set off a chain of events that parellel the advancement and decline of every civilization since the beggining of time. When disaster strikes and he is forced to take actions that would've seemed inhuman to him early on in the story, he begins a writhing and painful decension into madness as his world slowly crumbles and the \"better life\" that he had hoped to sustain turns on him. As skepticism begins to creep into the minds of his family, he forces them into a life of desperation; a day to day routine of survival that ends in tragedy. The movie is shot beatifully. The camera captures moments of frightening irony that simple acting could never touch. The jungle scenes intially offer hope but transform into tragedy. The beach and river scenes capture the actors in full form as the tension grows, swells, and explodes. In fact, if there's anything that the film did wrong it was to rely almost solely on symbolism to convey the rich and powerful theme of the story. The average movieogoer is so used to blockbusters and movies that are about as deep as a tablespoon will most likely find the movie confusing. Religous watchers will probably find offense in the portrayl of a selfish and ethnocentric missionary that does not neccesarilly put down religon but rather offers a manifestation of evidence: in times of tragedy, society seeks a higher source of wisdom beyond the physical plane of reality. This movie should not be watched only once. It should be carefully scrutinized so that viewers may be fully immersed in the meaning and take the powerful message to heart.",
         "Although this movie is intriguing, it leaves one wondering about what exactly it is driving at. The answer to why the world is endless at the end of the movie seems to have too many conflictual answers. Could it be because Allie's ideals are too narrow? Is America the endless world (where the Foxes were returning to), and therefore Allie really off the mark? Was Allie a hypocrite (establishing his own religion and relying on technology as a last resort)? Did Allie actually think of himself as a type of god? Too many questions arise at the end of the movie. The lengthy criticisms of Allie seem to be the author screaming out his opinion as well. The criticisms could have been shortened a tad and Allie's actions could have expressed the opinion of the author in a deeper manner. Still, the movie is spellbinding. The imagery is intriguing. Harrison Ford is incredible. Helen Mirren portrays the ever-loyal wife well. The problems with this movie lie not in its presentation, but in the story's muddled messages."
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "The Saul Zaentz Company",
         "Jerome Hellman Productions"
      ],
      "summaries": [
         "An eccentric and dogmatic inventor sells his house and takes his family to Central America to build an ice factory in the middle of the jungle. Conflicts with his family, a local preacher and with nature are only small obstacles to his obsession. Based upon a Paul Theroux novel.",
         "American Allie Fox is a genius - especially when it comes to anything mechanical - and an idealist. He dropped out of Harvard to become an inventor, he now with nine patents and six pending. He loves the US, but is disillusioned by what it has become in so many different facets. As such, he unilaterally decides to uproot his family - his wife who he affectionately calls \"Mother\", their two sons Charlie and Jerry, and their twin daughters April and Clover - from their comfortable New England life to move to the jungles of Central America, most specifically Mosquitia. There, he hopes to start from scratch to build a society closer to his own ideals - his utopia. He believes he is doing this not just for himself, but for his family, as he wants his children to learn from real life as opposed to from books. Allie will learn that he may have his own view of what he wants to achieve, but that there are external forces, both human and non-human, that may conspire against him. Outwardly, chief amongst his human obstacles is missionary, Reverend Spellgood, whose work Allie believes is solely narcissistic propaganda. In turn, Reverend Spellgood believes Allie is a communist. But what may be lurking underneath the surface as another obstacle is Allie's own family, who may ultimately rebel against something in which they had no input, especially as Allie has a policy of anyone being free to leave if they want, but be excommunicated from the family forever. Allie, too, will have to decide how far he will go to achieve his ultimate dream.",
         "Allie Fox has never been a man to do things by the book. An avid inventor, he is a troubled genuis given to intense moods and an incredible drive. Seemingly on a whim, he shifts his family to the jungles of Central America, telling his children that America \"is gone\". Determined to create a civilization better than the one he has abandoned, Fox's obsession and mania might pull his family through, or it might pull them apart."
      ],
      "budget": 25000000
   },
   "movielensId": 2734,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-11-26",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Peter Weir"],
      "runtime": 119,
      "movieId": 2734,
      "title": "The Mosquito Coast",
      "mpaa": "PG",
      "actors": [
         "Harrison Ford",
         "Helen Mirren",
         "River Phoenix",
         "Conrad Roberts",
         "Martha Plimpton",
         "Andre Gregory",
         "Dick O'Neill",
         "Jadrien Steele",
         "Michael Rogers",
         "Hilary Gordon",
         "Rebecca Gordon",
         "Jason Alexander",
         "Butterfly McQueen",
         "Tiger Haynes",
         "William Newman"
      ],
      "imdbMovieId": "0091557",
      "originalTitle": "The Mosquito Coast",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": ["2t1z-gRiNm0"],
      "plotSummary": "Allie Fox, an American inventor exhausted by the perceived danger and degradation of modern society, decides to escape with his wife and children to Belize. In the jungle, he tries with mad determination to create a utopian community with disastrous results.",
      "tmdbMovieId": 11120,
      "avgRating": 3.29425,
      "releaseYear": "1986",
      "numRatings": 2938,
      "posterPath": "/8A1iDYSp8H5WORWZVCV3E3SpkGD.jpg"
   }
}