{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "monk",
            "id": 345
         },
         {
            "name": "social worker",
            "id": 2438
         },
         {
            "name": "mystic",
            "id": 2795
         },
         {
            "name": "wretch",
            "id": 4391
         },
         {
            "name": "tibet",
            "id": 4558
         },
         {
            "name": "demon",
            "id": 15001
         },
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "missing person",
            "id": 156091
         },
         {
            "name": "reluctant hero",
            "id": 217083
         }
      ],
      "imdb_id": "tt0091129",
      "video": false,
      "title": "The Golden Child",
      "recommendations": [
         11595,
         96,
         306,
         150,
         2614,
         9493,
         11584,
         10328,
         10303,
         90,
         11066,
         9647,
         6951,
         9604,
         9208,
         10466,
         11353,
         9080,
         10411,
         9396
      ],
      "backdrop_path": "/7BuvaLLd9Ne6ron2yKJhL2o4wZY.jpg",
      "revenue": 79817939,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Chandler Jarrell",
               "gender": 2,
               "credit_id": "52fe43319251416c75007111",
               "name": "Eddie Murphy",
               "profile_path": "/bsi706zdqs0KAPdOsqz6AkLNcFF.jpg",
               "id": 776,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Sardo Numspa",
               "gender": 2,
               "credit_id": "52fe43319251416c75007115",
               "name": "Charles Dance",
               "profile_path": "/bLT03rnI29YmbYWjA1JJCl4xVXw.jpg",
               "id": 4391,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Kee Nang",
               "gender": 1,
               "credit_id": "52fe43319251416c75007119",
               "name": "Charlotte Lewis",
               "profile_path": "/iONeOb1P7XF8dMCXv9GgN3IUCWe.jpg",
               "id": 42558,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "The Old Man",
               "gender": 2,
               "credit_id": "52fe43319251416c7500711d",
               "name": "Victor Wong",
               "profile_path": "/70vAqnH2QFhLOenNQCVcaG1JhN3.jpg",
               "id": 11395,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Tommy Tong",
               "gender": 2,
               "credit_id": "52fe43319251416c75007121",
               "name": "Peter Kwong",
               "profile_path": "/7IWgFkoeWvESueJHphnd9Q8RqzZ.jpg",
               "id": 97695,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "The Golden Child",
               "gender": 1,
               "credit_id": "52fe43319251416c75007125",
               "name": "Jasmine Reate",
               "profile_path": null,
               "id": 559312,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Doctor Hong",
               "gender": 2,
               "credit_id": "52fe43319251416c75007129",
               "name": "James Hong",
               "profile_path": "/8k4RrDRsqkvJDePU8ciMOOx5Zso.jpg",
               "id": 20904,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Til",
               "gender": 0,
               "credit_id": "52fe43319251416c7500712d",
               "name": "Randall 'Tex' Cobb",
               "profile_path": "/wtRQp99LgNrJ8bF9XyAzbuoekMb.jpg",
               "id": 5177,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43319251416c750070dd",
               "name": "Michael Ritchie",
               "profile_path": "/62566NoTLMRVLdoE07RG1B55zxy.jpg",
               "id": 12964,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c750070e3",
               "name": "Dennis Feldman",
               "profile_path": null,
               "id": 57396,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c750070e9",
               "name": "Michel Colombier",
               "profile_path": null,
               "id": 35838,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c750070ef",
               "name": "Donald E. Thorin",
               "profile_path": null,
               "id": 6490,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c750070f5",
               "name": "Richard A. Harris",
               "profile_path": null,
               "id": 3985,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c750070fb",
               "name": "Edward S. Feldman",
               "profile_path": null,
               "id": 11302,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c75007101",
               "name": "Robert D. Wachs",
               "profile_path": null,
               "id": 911,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43319251416c75007107",
               "name": "Charles R. Meeker",
               "profile_path": null,
               "id": 63949,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43319251416c7500710d",
               "name": "Richard Tienken",
               "profile_path": null,
               "id": 63950,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "588fd7539251412b06000001",
               "name": "Phil Tippett",
               "profile_path": "/2uQ0B7fN5cDQk17J1X3pxDSf9y.jpg",
               "id": 7727,
               "department": "Visual Effects",
               "job": "Visual Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 7.572413,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10136,
      "vote_count": 371,
      "budget": 25000000,
      "overview": "A detective specializing in missing children is on a madcap mission to save a youth with mystical powers who's been abducted by an evil cult. He battles a band of super-nasties, scrambles through a booby-trapped chamber of horrors and traverses Tibet to obtain a sacred dagger.",
      "similar": [
         109414,
         9552,
         91586,
         561,
         588,
         10014,
         9411,
         806,
         441701,
         28355,
         13515,
         9003,
         9378,
         335796,
         146301,
         409297,
         100241,
         26515,
         293670,
         19592
      ],
      "original_title": "The Golden Child",
      "runtime": 94,
      "poster_path": "/auDjIWIUob3yKfL78SthUl4Cy4z.jpg",
      "spoken_languages": [
         {
            "name": "Český",
            "iso_639_1": "cs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1986-12-12",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Eddie Murphy is the chosen one.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Michael Ritchie"],
      "runtime": 94,
      "synopsis": null,
      "writers": ["Dennis Feldman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091129/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzY0NzI4NTAxMV5BMl5BanBnXkFtZTYwMTg2MjA5._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Eddie Murphy, J.L. Reate, Charles Dance | See full cast and crew »"],
      "reviews": [
         "Why hardly anybody seems to appreciate this film anymore is without doubt one of the greatest mysteries of our time. I'm truly perplexed. Roger Ebert seems to be the only critic to at least half-realise how truly funny, entertaining and brilliant a film THE GOLDEN CHILD really is. Without doubt it's one of Eddie Murphy's finer films; it's impossible to not have a good time while watching this movie... his one-liners keep coming thick and fast, and if you can't find humour and fun in this movie, then surely your heart is made of stone. Visually, its cinematography is executed very well, the special effects are fantastic (except in one poorly executed shot where Charles Dance turns into a rat) and the theme tune has a strange kind of catchiness to it. Don't be prejudiced against this movie, just because everybody else is. People are so easily swayed by popular opinion these days that true cinematic gems like THE GOLDEN CHILD are forgotten. Four stars out of four. Long live 80s movies!",
         "I loved this movie. I totally disagree with some (negative) critiques that I've read over the years. This was a great vehicle for Eddie Murphy! He appeared to have a great time with his part as Chandler Jarrell and he should never care about what the critics say, if he had fun doing it \u0096 and most of his audience enjoyed it! And, it WAS fun to watch as it combined some great fantasy tension with Mr. Murphy's great comedic style. You have to keep in mind that 'Golden Child' is a 'fantasy' film \u0096 just an imaginative work of magic and wonder amidst the 'real' world. During the time this film was released, I was working in a video rental store. This was one of the most popular with all our customers. Every single time, we put this one up on our monitor, ALL the copies we had went out fast with wait-list requests that kept it on the queue for months! Everyone who rented it loved it! I was the resident film critic and all my regular customers would ask my opinion before they rented \u0096 this was one of my favorites and I knew the taste of my customers so I highly recommended this one to most of them. I really feel that this film is a Sleeper \u0096 it may not have done too well at the box office \u0096 due to very poor marketing \u0096 but it hit a high in the video rental and purchase market later! (YES, I did buy this film for my own video library!). I adored the little boy who played the 'Golden Child' \u0096 J. L. Reate - but after looking at his profile in IMDb, I noticed that he never did any more films. That is sad, because he definitely had an on-screen aura and could have continued with a film career. I also adored Victor Wong, who played the Old Man (I LOVED him in his part as 'Egg Shen' in 'Big Trouble in Little China' - 1986). At any rate, this was a great film. The only drawbacks that didn't seem to fit with the theme were some of the parts that got a bit more 'adult' in nature \u0096 such as 'Chandler's rather sexual remarks about the serpent lady that was presented to him as a silhouette. It was funny, but it still was out of sync. OK, so there were a few suggestive gratuitous scenes \u0096 those were put in for the mind-set of the day perhaps. This was still an adventurous and escapist type of film which we do need today to get away from all the hard core reality and depressing fluff that we are hit with from Hollywood. Now that's Entertainment!",
         "The premise may seem goofy, but since Murphy's character doesn't take it seriously, it helps ease the audience into this mix of mysticism and modern-day hard-boiled child abduction. Excellent cast, particularly Charles Dance and Charlotte Lewis, and Murphy is at the height of his 80's peak in comedy/action. There's also some great F/X, a very surreal dream sequence, and a fairly original plot. Often overlooked in the pantheon of Murphy flicks, but this one is worth a look.",
         "\"The Golden Child\" was Eddie Murphy's first film since his megahit \"Beverly Hills Cop\". And even though it's not as good as \"Cop\", it's a fun comic adventure. Murphy stars as a finder of lost children who's assigned a most unusual case. His assignment: to find the title character, a child with mystical powers. This movie could have been titled \"Beverly Hills Cop and the Temple of Doom\" since parts of this movie plays like a Spielbergian adventure, kinda like an Indiana Jones comedy. It's got comedy with laughs, and adventure with special effects. Lots of fun. *** (out of four)",
         "Whenever I see most reviews it's called 'a misfire for Eddie Murphy'. These critics want to take a look at some of the stuff he's doing these days, and maybe soften their stance in retrospect... \"The Golden Child\" is not highbrow entertainment, but thanks to some of the cast it breaths new life into old clichés, and gives Murphy one of his best roles. I don't understand the pervading lack of 'love' for its efforts, at all. Perhaps it was released at a time when the establishment had grown weary of knockabout, thrill-a-minute adventures? Steven Spielberg started it with Indiana Jones; it's unfair to make this one a scapegoat when what is possibly its biggest sin is also utterly harmless. There's nothing necessarily wrong with trying to capitalise on trends. Yes it's silly, but even an occasional observer should be able to understand that 'ridiculous' is where Hollywood's idea of mysticism begins and ends. What's more important than believability with a story like this is that the audience have entertaining tour guides on hand to show them the mysterious sights. Michael Ritchie and Eddie Murphy fit the bill for this capacity just fine. My advice to you is to buy the ticket and take the ride.",
         "I first saw this movie on television some years ago and frankly loved it. Charles Dance makes one of the most terrifying villains anyone can imagine. His sophistication is such a perfect contrast to the crudely good hero. I have never been much of an Eddie Murphy fan but find his irritating portrayal here a winner: a bit of \"Axel Foley Through the Looking Glass\". Charlotte Lewis is, to utilize a hackneyed phrase but the only one applicable, luminously gorgeous. Some scenes are wonderfully created: the dream sequence, the bird, the silly fight scenes, and the climactic confrontation. Through it all Murphy is the modern man suddenly dropped into an oriental myth, a stunned and quieter version of Kurt Russell in his oriental fantasy romp. Like that movie we have James Hong, the incomparable actor whose scenes, however short, raise the quality even of Derek. Since 1955 Hong has defined the fine supporting actor, the \"class act\" of his profession. \"The Golden Child\" is silly; it is not perfect; but it has so many redeeming features that it is an enjoyable and amusing fantasy, well worth watching. After four years I have seen \"The Golden Child\" again; I enjoyed it even more! It truly is great fun.",
         "Every once in a while, Eddie Murphy will surprise you. In a movie like \"the Golden Child\", especially. This is a movie you'd figure would star maybe Harrison Ford or Kurt Russell or someone. But Eddie really does work; he's smart, he's funny, he's brave, kind, courteous, thrifty, clean and everything else a hero should be. Having been chosen to secure a mystic child who holds the key to protecting the world from complete evil (embodied perfectly by Dance), Eddie goes from California, to Nepal and back, all while the beautiful Kee Nang (Lewis) wonders if he's all he says he is and a crazy old holy man (Wong, perfect as always) knows that he is. It's exciting, breathtaking in spots, shocking and, of course, funny. Eddie is the only action hero I know who could begin a movie by making rude remarks behind some guy reading a porno magazine and end it with smart-aleck remarks about Ed McMahon. No problem with this \"Child\": it's a \"Golden\" find. Nine stars. Viva Nepal!",
         "I love this film. It is well written and acted and has good cinematography. The story blends action, humor, mysticism, and tenderness with great sets and beautiful location shots. See it, buy it, show it to your friends. The acting is good and Murphy especially does a fine job portraying the reluctant/unlikely hero. I enjoyed all the characters and found them to be interesting and well developed with dynamic interactions. I cared what happened to these people and, while the outcome was pretty predictable (the good guys win, the hero gets the astonishingly attractive girl and the holy child saves lives--who doesn't see that coming?), it still made me happy when everything worked out well in the end. Thank God this film's dignity was never ruined with a crappy sequel. Grab some popcorn, cuddle up on the couch, and watch this fun, happy and entertaining film.",
         "How can't anyone like The Golden Child? I saw this as a kid with my brothers and sisters and I remember watching it over and over and over again. We all loved it and we still do. I give it a 10/10. It was witty, funny, great action and the story was very cool. Golden Child is one of those movies that no matter how many times I've seen it before, I'd be willing to see it again. Eddie was hilarious, Charlotte was hot and the supporting cast was awesome. The chemistry between Eddie, Charlotte and the kid who played \"Golden Child\" was great! Only a person without any type of imagination could say that this was not a great movie. I wish that I had 4 hands so that I could give this movie 4 thumbs up!",
         "Like most people, I enjoyed Eddie Murphy in the 1980s with the humorous, wild movies he made. Many of the characters he played were similar: wisecracking, loud, funny and obnoxious. This is one of the wilder stories he was involved with with a very good mixture of action, romance, fantasy and comedy. The female lead in here was an attractive actress named Charlotte Lewis. With her looks and manner, I thought she might go places, but I think this was the only hit movie she's been in. Twenty years after \"The Golden Child,\" I have found most of those Murphy films not the entertainment they used to be. Maybe it's just me getting older, but Eddie's constant shouting and abrasive boorishness is too much to take now. That includes this movie."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Fantasy",
         "Mystery"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Eddie Murphy Productions",
         "Industrial Light & Magic (ILM)"
      ],
      "summaries": [
         "Eddie Murphy plays a detective with a speciality of finding lost children. He is told he is the 'Chosen one' who will find and protect the Golden Child, a Bhuddist mystic who was kidnapped by an evil sorcerer. Murphy disbelieves the mysticism but finds more and more evidence of demon worship as he investigates.",
         "In an unknown location in Tibet, a young boy with mystical abilities, the Golden Child, receives badges of honor and demonstrates his power by reviving a dead bird, which is to become a constant companion. However, a band of villains led by a mysterious man breaks into the hidden temple, slaughters the monks and takes the boy away. Some time afterwards, a young woman named Kee Nang watches a Los Angeles TV show in which Chandler Jarrell, a social worker who is confronted by a young Asian woman who tells him that he is the Chosen One destined to save The Golden Child, the savior of all mankind, from the clutches of the evil demon Sardo Numspa, who won't rest until he sees to it that the boy is in his clutches. But Jarrell disbelieves the mysticism but he finds more and more evidence of demon worship as he starts investigating.",
         "A private detective specializing in missing children is charged with the task of finding a special child who dark forces want to eliminate."
      ],
      "budget": 25000000
   },
   "movielensId": 2735,
   "movielens": {
      "languages": [
         "Český",
         "English",
         "Italiano"
      ],
      "releaseDate": "1986-12-12",
      "dvdReleaseDate": "1999-03-09",
      "directors": ["Michael Ritchie"],
      "runtime": 94,
      "movieId": 2735,
      "title": "The Golden Child",
      "mpaa": "PG-13",
      "actors": [
         "Eddie Murphy",
         "Charles Dance",
         "Charlotte Lewis",
         "Victor Wong",
         "Peter Kwong",
         "Jasmine Reate",
         "James Hong",
         "Randall 'Tex' Cobb"
      ],
      "imdbMovieId": "0091129",
      "originalTitle": "The Golden Child",
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "_Pd0-Je3XDQ",
         "hggdGZ-XZVc"
      ],
      "plotSummary": "A detective specializing in missing children is on a madcap mission to save a youth with mystical powers who's been abducted by an evil cult. He battles a band of super-nasties, scrambles through a booby-trapped chamber of horrors and traverses Tibet to obtain a sacred dagger.",
      "tmdbMovieId": 10136,
      "avgRating": 2.88612,
      "releaseYear": "1986",
      "numRatings": 4329,
      "posterPath": "/auDjIWIUob3yKfL78SthUl4Cy4z.jpg"
   }
}