{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0092585",
      "video": false,
      "title": "Assassination",
      "recommendations": [
         26471,
         157771,
         31151,
         59201,
         18587,
         25423,
         37626,
         25432,
         16089,
         35810,
         38610,
         243856,
         80287,
         33055
      ],
      "backdrop_path": "/ysCStwIO71xS4vsqbabVErTReWC.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jay Killion",
               "gender": 2,
               "credit_id": "52fe4770c3a36847f8135b53",
               "name": "Charles Bronson",
               "profile_path": "/hxZR2w0LXX47VKtxibDyZDsTAkH.jpg",
               "id": 4960,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Lara Royce Craig",
               "gender": 1,
               "credit_id": "52fe4770c3a36847f8135b57",
               "name": "Jill Ireland",
               "profile_path": "/suSIOlNf82A49bcFIdoY3vd45ir.jpg",
               "id": 15753,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Fitzroy",
               "gender": 2,
               "credit_id": "52fe4770c3a36847f8135b5b",
               "name": "Stephen Elliott",
               "profile_path": "/uOZD5RzLjLtDSotOqKB3FPeznBx.jpg",
               "id": 786,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Charlotte Chong",
               "gender": 1,
               "credit_id": "52fe4770c3a36847f8135b5f",
               "name": "Jan Gan Boyd",
               "profile_path": null,
               "id": 19259,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 2,
               "credit_id": "5333dfd79251414463001472",
               "name": "James Staley",
               "profile_path": "/nwMsUCjnJESoSJr946rtnd7Hw5P.jpg",
               "id": 29385,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 2,
               "credit_id": "53a0ef98c3a3687b9b001048",
               "name": "Frank Zagarino",
               "profile_path": "/g0DD8vWzGXnRLe6Hlw8Fd26L9eL.jpg",
               "id": 24517,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4770c3a36847f8135b49",
               "name": "Peter R. Hunt",
               "profile_path": null,
               "id": 9868,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4770c3a36847f8135b4f",
               "name": "Richard Sale",
               "profile_path": null,
               "id": 95262,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "592dfd5cc3a36860ff000acf",
               "name": "Pancho Kohner",
               "profile_path": null,
               "id": 237036,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "592dfd69c3a36860ff000ad9",
               "name": "Menahem Golan",
               "profile_path": "/qGtHMLd4E7tRyw75H4lWTRelW7B.jpg",
               "id": 33008,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "592dfd74c3a3686135000a4e",
               "name": "Yoram Globus",
               "profile_path": "/bKbeXNvErtCQiK3pEEnFgmR9cvo.jpg",
               "id": 33009,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "592dfdb092514130d6000a3d",
               "name": "Valentine McCallum",
               "profile_path": null,
               "id": 1096248,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "592dfdc3c3a3686157000a1e",
               "name": "Robert O. Ragland",
               "profile_path": null,
               "id": 98606,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "592dfddac3a36860ff000b20",
               "name": "James T. Heckert",
               "profile_path": null,
               "id": 1497383,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "592dfde7c3a368616a000a5a",
               "name": "Hanania Baer",
               "profile_path": null,
               "id": 51555,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.555271,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48686,
      "vote_count": 15,
      "budget": 0,
      "overview": "Jay Killon is the bodyguard of the recently elected US president, but he is assigned to the first lady (Lara Royce). Lara hates Killon so she does all she can to escape. The story complicates when someone tries to kill Lara.",
      "similar": [],
      "original_title": "Assassination",
      "runtime": 105,
      "poster_path": "/s7PBv17JGA1zIPuq8CucLGzr5uk.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/5jvFLUVXGXxkyszL9cqJN5hNhJ6.png",
         "name": "Cannon Group",
         "id": 1444,
         "origin_country": ""
      }],
      "release_date": "1987-01-09",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A presidential bodyguard is assigned to protect an objecting first lady, as repeated attempts are made on her life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Peter R. Hunt"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Richard Sale"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092585/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5MDI4Njg2Nl5BMl5BanBnXkFtZTcwMDgyMTkxMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Bronson, Jill Ireland, Stephen Elliott | See full cast and crew »"],
      "reviews": [
         "This was the next to last film appearance by Jill Ireland, who died of cancer in 1990 after four decades as a well-known actress and producer. Ireland made quite a few waves in the press when she dropped her then-husband David McCallum in 1967, beginning her long relationship with Charles Bronson. It is a great irony that Bronson, probably the all-time leader in number of deaths rendered on-screen, had one of the most enduring marriages in film history. 'Assassination' seems to be a movie that was tucked into Cannon's production schedule for the sake of Bronson and Ireland. Ireland was already suffering from cancer-related illnesses in 1987 and you can almost picture the two actors wanting to do 'just one more, for old times' sake.' 'Assassination' is carelessly done as a whole, showing the lack of polish and dwindling funds that would tank Cannon by 1990. But there's a kind of nostalgia value in seeing the couple together one last time and the film makes you wonder what exactly helps a relationship to survive in the chaos that is Hollywood. Bronson plays Jay Killian, a high-ranking Secret Service agent who is assigned to protect the First Lady, Lara Craig (Ireland). The President's wife has a reputation for being difficult, bossing Service agents around and wanting to do things her own way. That all changes, however, when attempts are made on her life and she must journey with Killian by car, train, motorbike, and believe it or not, dune buggy to escape would-be assassins. There is little surprise here, as Killian believes the murderers are part of an inside job, perhaps arranged by the President himself. On the way, Killian and Mrs. Craig develop an unspoken affection for one another in scenes between Bronson and Ireland that are actually very funny. What really gets me is how this film was promoted upon its release and how it's still made to look as a DVD. The original trailer gives you the feeling that 'Assassination' is another cold-hearted Bronson shoot-'em-up. But a lot of this movie - which was rated PG-13, by the way - is in a comic vein, putting it along the lines of a romantic thriller like Bronson and Ireland's western 'From Noon Till Three.' Even the DVD case shows Bronson with a rocket launcher, ready to blow things up. Which he does, but to a lesser degree than his other '80s potboilers. On the whole, 'Assassination' is late Cannon slop work and doesn't really know what kind of film it wants to be. Besides drifting from actioner to romantic thriller and back again, there are serious mistakes in continuity, property values are bottom-of-the-barrel cheap, and the effects are dreadful; many of the explosions seem like matte work rather than being done on location. Robert Ragland, who had shown good composing skills in earlier films, teamed up with Valentine McCallum on a score that is mostly synthesized and better fit for television. Richard Sale's script has real lulus of dialogue, with the conversations between Bronson and Ireland the only bright spot. There is no explanation as to why the First Lady is called 'One Momma' all of a sudden, nor as to why Ireland is left with her British accent when the character is a Wyoming native. Jan Gan Boyd, playing Killian's main assistant, has a kitten-like personality and is badly miscast as a federal agent. Stephen Elliott (a former Tony Award nominee who died in May 2005), Randy Brooks, Erik Stern (as assassin Bracken), and Michael Ansara (Senator Bunsen) are acceptable in their supporting roles. Incidentally, this was the last film directing gig for Peter Hunt, who broke onto the scene with 'On Her Majesty's Secret Service' in 1969 and collaborated with Bronson and Lee Marvin on 'Death Hunt' in 1981. 'Assassination' is available on DVD through MGM Home Entertainment; it is presented in dual widescreen and standard format with three-language subtitles and theatrical trailer. ** out of 4",
         "I loved this Movie out of all Charles Bronson did. I think he and Jill Ireland were so neat in this together. I liked any movie they did together. I don't believe this was given enough credit. They just semed to fit in the parts together. I was truly saddened when Jill died and even more so with his passing. But at least we have the movies to watch which I never tire of seeing.",
         "In the twilight years of his career, Charles Bronson forged long-running partnerships with several directors, most notably J. Lee Thompson and Michael Winner. He did two films for one-time Bond director Peter Hunt too - the first being the decent 1981 actioner Death Hunt, the second being this indifferent political chase thriller. Assassination is pretty dull if truth be known, and come the end you'll find yourself longing for something with a bit more passion and pace, like The Wilby Conspiracy for instance (which, plotwise, this film resembles). Bronson sleepwalks through his role as bodyguard Jay Killian, whose assignment is to protect the American President's wife, Lara Royce Craig (Jill Ireland, real-life wife of Bronson). Killian believes that Mrs Craig has been targetted by assassins; she thinks he's an over-protective, paranoid pessimist. Turns out - surprise, surprise - that Killian was right all along and someone is indeed out to eradicate her. The pair of them go on the run, pursued by the assassins. Everyone knows that the wife of an American President is known as The First Lady. For some reason, in this film they have renamed her \"One Mama\"! Quite what the point of this is is anybody's guess, but it's indicative of the film's pointlessness as a whole. Most of the film's performances are lazy, and the script takes a heck of a long time to get to where it's going. If I had to label Assassination within a specific genre, I'd say it is supposed to be a \"thriller\". I'd say that with some reservations, however, as to say that it's a thriller it has precious few thrills.",
         "Secret service Agent Jay Killian is back on the job after some problems. He is no longer allowed to guard the President, though. His job is to protect the new First Lady, Lara Royce Craig, who apparently comes from a wealthy family and believes she can do what she wants without listening to anyone. While Mrs. Craig rides to her husband's inauguration in an open car (something no one in the First Family has done since Kennedy was shot), one of the police officers riding alongside has a wreck (and this being a Charles Bronson movie, naturally the bike has to explode). Killian believes it was no accident. Later, Mrs. Craig escapes on several occasions, though the Secret Service is able to find her in each case. Mrs. Craig's behavior is a problem not just because she needs protection under normal circumstances, but because it seems someone actually wants to kill her. Jill Ireland was deliciously witchy (actually that should start with a b) as the First Lady. Charles Bronson's character showed intelligence, and he wouldn't back down but remained strong in the face of the First Lady's protests. It was a pleasure to see the man who played the uptight and dignified Cloud Dancing in \"Dr. Quinn\" as an almost stereotypical Native American, a car salesman willing to laugh at people's expectations of his people and go along for the money. Jan Gan Boyd, as Killian's partner (in more ways than one?) was pretty and perky but showed confidence in her facial expressions. Too bad she often seemed to be reading her lines. The violence wasn't constant, but this movie had plenty of gunfire toward the end, and quite a few unnecessary explosions. One exciting scene involved a railroad bridge. The scenery in Wyoming was beautiful. I don't think this was intended to be a comedy, but it certainly was in my opinion. I found it quite entertaining. The idea is to have no real expectations.",
         "Ok maybe it's cheesey but it's a load of fun. Accept that it's that way and you love the film alot. It's a good action laugh, people take the micky saying you can't do this, that. Who's care, Bronson films are made to be enjoyed, he doesn't care what critics think. I don't. All he's own film he did are great. Fantastic stuff. Well the story line is simple, Bronson is a service secret agent protecting the first lady (Jill). And suspects that someone is trying to ASSASSINATE her. So it's up to him to stop her in this great Action comedy thriller. Worth the watch, i loved it. Especially with a comic Bronson. and he was 66 when he did this, wow, hope i'm like that at 66 running like a cat. 7 out 10",
         "if you are a charles bronson fan,as i am, you will enjoy this film. This is a simple film with a nice plot and story line. What's not to like.You also get jill ireland with the movie and other great scenery to boot..",
         "At first I liked the light tone.But soon it becomes annoying. Especially since there is no compensation for it. There are only a few action scenes and the ones that are there are incredibly dull.The intrigue is laughable. The plot and dialog are beyond comprehension. The way the characters are talking to each other is like they are all in this big farce. Even Bronson doesn't put in the time to make something of it. While the interaction between Charlie and Jill certainly can be seen as a highlight it simply didn't do it for me. Come on I don't want Charles Bronson to deliver comical lines. I want him to shoot up the place and kick some booty.Which he barely did. Probably the worst Bronson movie ever made.",
         "Bronson plays Jay Killian, a secret service agent who has been transferred from guarding the newly elected President of the U.S. to now guarding the new first lady. Eventually, Bronson learns that the first lady is being targeted for assassination (hence the title), the film for the most part deals with Bronson keeping the first lady out of harms way. Not really an excessive actioner for Bronson considering previous efforts from his career, meaning that it's a little light on the violence factor. Jill Ireland plays the first lady, who has quite a mean streak to her in the film, her snobby attitude makes quite a pairing for her and Bronson's character. There are some comical moments here and there throughout the film, Bronson has more dialogue than usual which is nice, he adds a little rare touch of comic relief althroughout the film. I would recommend this movie to any Bronson fan, it's not Paul Kersey, but Jay Killian isn't too bad either.",
         "I just saw this movie and the beginning started out pretty good and kind of funny between Ireland and Bronson. Just let you all know that I believe that Jill will go lethal with the shoe she had on if you mess with her so DON'T. But then at the middle of the movie, it had ups and downs. The first thing about it is that most of the action scenes go a little too fast and some of the non-action scenes go little fast too but other wise, the film is pretty good. Just to let you know that this is the last film that Charles and Jill are together and still do good being together in this film and I hope you you all enjoy the film. I give this a 7/10",
         "I was a little disappointed after re-watching 'Assassination'. It was a good piece, but it wasn't the non-stop action pack feature that I remembered. A bad thing\u0085 not really. Typical Bronson venture done through Cannon productions? Yes and no. However it's a typical story (even though quite ludicrous at times), but it felt rather low-scale (think of Bronson's 'Messenger of Death' the following year) with its thriller elements and explosively sparse action. Surprisingly when the action did kick into gear, the stunt work and positioning was impressive, but where the film's drive came from was the budding rapport between Charles Bronson (whose appealingly laid-back) and Jill Ireland (diving right into the role with convincing aplomb). Outside of those two I found the rest of the performances sub-standard. The plot is a tautly twisty (but far-fetched) cross-country political thriller that has veteran Secret Agent Jay Killian assigned to protect the demandingly stuck-up first lady, where he uncovers a devious plot involving assassins out to her kill her. It's a complex web, but the material seems to breeze through rather concentrating on the combination of the two main characters and their growing respect for each other. It can be dramatically soapy, but never does it feel as if it's really taking itself seriously due to some forced humour coming from the script. This doesn't stall it at all. Director Peter Hunt (who also directed Bronson with Lee Marvin in the 1981 rugged survival thriller 'Death Hunt') does a conventionally efficient job, even with some sequences coming across as if made for a TV show. When it came to the vigorously pumped-up activity, Hunt was at the top his game accommodating a no-bull approach and the productively scope-like cinematography passes through the top-notch scenic locations with verve-like ease. Earnestly slick filler."
      ],
      "genres": [
         "Action",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Cannon Group",
         "Golan-Globus Productions"
      ],
      "summaries": ["Jay Killion (Charles Bronson) had been the presidential bodyguard, but for the inauguration of the recently elected president, he is assigned to the first lady, Lara Royce (Jill Ireland). Lara, a perpetually indignant, arrogantly feministic lady, initially hates the methodical and rules-following Killion, and so she does all she can to avoid him and disregard his safety procedures. The story complicates, however, when repeated attempts are made on Lara's life. Eventually, the shaken Lara decides to trust Killion's instincts and precautionary methods, and the pair embark on a difficult and often perilous cross-country journey, with the assassins close on their heels."],
      "budget": 0
   },
   "movielensId": 2737,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-01-09",
      "dvdReleaseDate": "2003-02-04",
      "directors": ["Peter R. Hunt"],
      "runtime": 105,
      "movieId": 2737,
      "title": "Assassination",
      "mpaa": "PG-13",
      "actors": [
         "Charles Bronson",
         "Jill Ireland",
         "Stephen Elliott",
         "Jan Gan Boyd",
         "James Staley",
         "Frank Zagarino"
      ],
      "imdbMovieId": "0092585",
      "originalTitle": "Assassination",
      "genres": [
         "Drama",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": ["L9PuJl8GS0k"],
      "plotSummary": "Jay Killon is the bodyguard of the recently elected US president, but he is assigned to the first lady (Lara Royce). Lara hates Killon so she does all she can to escape. The story complicates when someone tries to kill Lara.",
      "tmdbMovieId": 48686,
      "avgRating": 2.50813,
      "releaseYear": "1987",
      "numRatings": 123,
      "posterPath": "/s7PBv17JGA1zIPuq8CucLGzr5uk.jpg"
   }
}