{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sibling relationship",
            "id": 380
         },
         {
            "name": "reunion",
            "id": 9824
         }
      ],
      "imdb_id": "tt0090886",
      "video": false,
      "title": "Crimes of the Heart",
      "recommendations": [
         39197,
         18913,
         61280,
         33525,
         59585,
         116014,
         11800,
         47329,
         23333
      ],
      "backdrop_path": "/sDLuCTKXVnkC7hvRkHlTwMftSbH.jpg",
      "revenue": 22905522,
      "reviews": [{
         "author": "talisencrw",
         "id": "57364e0dc3a3687e2f000ec1",
         "content": "I haven't seen any Bruce Beresford films, except for the magnificent 'Black Robe', and I'm a huge fan of the four main actors, so it was a no-brainer that I would eventually watch this. I enjoyed it greatly, and if you can handle a quieter 80's women's picture, there's much to enjoy here. Definitely worth investigating for the cinephile with exquisite taste.",
         "url": "https://www.themoviedb.org/review/57364e0dc3a3687e2f000ec1"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lenny Magrath",
               "gender": 1,
               "credit_id": "52fe475cc3a36847f81317d1",
               "name": "Diane Keaton",
               "profile_path": "/fzgUMnbOkxC6E3EFcYHWHFaiKyp.jpg",
               "id": 3092,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Meg Magrath",
               "gender": 1,
               "credit_id": "52fe475cc3a36847f81317d5",
               "name": "Jessica Lange",
               "profile_path": "/hC862LK6M6mMcCnhOzIyfvTmQk4.jpg",
               "id": 4431,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Babe Magrath",
               "gender": 1,
               "credit_id": "52fe475cc3a36847f81317d9",
               "name": "Sissy Spacek",
               "profile_path": "/zauFMssYujKk7Kadz0t100VU5WE.jpg",
               "id": 5606,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Doc Porter",
               "gender": 2,
               "credit_id": "52fe475cc3a36847f81317e9",
               "name": "Sam Shepard",
               "profile_path": "/6KincXfDKVQaRHwtX6qMUAwOsR0.jpg",
               "id": 9880,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Willie Boy",
               "gender": 0,
               "credit_id": "5a82f087925141167e01186e",
               "name": "Gregory Eugene Travis",
               "profile_path": null,
               "id": 1785625,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe475cc3a36847f81317df",
               "name": "Bruce Beresford",
               "profile_path": "/2BM92YfwzMpFkk5IlNZfZqPmODy.jpg",
               "id": 5696,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe475cc3a36847f81317e5",
               "name": "Beth Henley",
               "profile_path": null,
               "id": 100250,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 1.940137,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 48259,
      "vote_count": 20,
      "budget": 0,
      "overview": "Three sisters with quite different personalities and lives reunite when the youngest of them, Babe, has just shot her husband. The oldest sister, Lenny, takes care of their grandfather and is turning into an old maid, while Meg, who tries to make it in Hollywood as a singer/actress, has had a wild life filled with many men. Their reunion causes much joy, but also many tensions.",
      "similar": [
         8272,
         16314,
         73,
         244772,
         1254,
         164457,
         10054,
         32302,
         1562,
         4170,
         11224,
         334,
         8967,
         49519,
         858,
         425,
         93456,
         272,
         111,
         2288
      ],
      "original_title": "Crimes of the Heart",
      "runtime": 105,
      "poster_path": "/fSUFUAFsTiQJy5tDjEdYUM4Aqa1.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "De Laurentiis Entertainment Group (DEG)",
            "id": 484,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Crimes of the Heart S.A",
            "id": 62343,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "De Laurentiis",
            "id": 544,
            "origin_country": ""
         }
      ],
      "release_date": "1986-12-12",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Meg just left one. Lenny never had one. Babe just shot one. The MaGrath sisters sure have a way with men",
      "adult": false,
      "homepage": null,
      "status": "Post Production"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bruce Beresford"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Beth Henley",
         "Beth Henley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0090886/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4NDM5OTMzNV5BMl5BanBnXkFtZTcwNjM4MDUyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Diane Keaton, Jessica Lange, Sissy Spacek | See full cast and crew »"],
      "reviews": [
         "Putting three powerful actresses into one film isn't necessarily a guarantee that the project will work, however, this is one of those rare exceptions. Beth Henley's play about three eccentric sisters in the south is adapted well to the screen, thanks in part to the careful direction of Bruce Beresford. Diane Keaton plays Lennie, the eldest sister, who's feelings of awkwardness prevent her from being happy. Jessica Lange is Meg, the fast-moving middle sister who packed up and left town for the big lights of Hollywood, only to be disappointed. And Sissy Spacek is Babe, the kooky youngest sister, recently charged with shooting her husband. The sisters are tormented by their cousin and neighbor, Chick, played by Tess Harper. Her own desire to be an upstanding member of the ladies league, combined with her desire to outshine and belittle her cousins, make her the villain in this story. The sisters are reunited when Babe shoots her husband. As she says, she 'didn't like his stinkin' looks.' Babe is slightly unbalanced. After shooting him in the stomach she went out and made herself a pitcher of lemonade. What was most bizarre was that she then had the nerve to offer him a glass! Over the course of several days the sisters confront the demons that have been troubling them. Lennie has 'shrunken ovaries' and therefore cannot have children. She believes that this is keeping her from getting a man. Meg is tortured by her own selfishness. The rumors about her convincing Doc Porter (played by Sam Sheppard) to hang around in during a hurricane, only to suffer a life altering leg injury, are all true. The film reads like the play from which is came from. The scenes are often long. The dialogue marches on from subject to subject. The characters are well fleshed out, however most of the information we get comes from suggestions and flashbacks made by the characters. One must listen to the dialogue in this film in order to truly follow the story. The acting is first rate by all four leads. Sissy Spacek and Tess Harper are definate standouts. They each received nominations at the Oscars that year. Lange and Keaton play their parts well. The cast works as an ensemble, with no upstaging, but rather opportunities for everyone to shine. Crimes of the Heart is a first rate piece that may not be appropriate for all movie goers, simply because it requires the viewer to pay attention to detail. The action is slow moving, making room for some wonderful dialogue. Enjoy this film as it offers some great acting with a pretty decent script.",
         "POSSIBLE SPOILERS. This movie is classified as a \"comedy\" but depicts real-life behaviours of people when subjected to suicide of a parent. The three main characters, sisters, each deal with their childhood issues in their individualistic manners. One is withdrawn, shy, and non-assertive as an adult, believes she is defective because of the ignorance of her grandfather in regard to a minor medical problem, and afraid of relationships with men. Another is a chain-smoking alcoholic who hated her father, probably for more reasons than were depicted in the movie, has a long string of men whom she never allows herself to become genuinely close with, and suffers a temporary mental breakdown. The third sister married a controlling and abusive man at her age 18 years, suffers from loneliness and suicidal ideologies, and finally snaps enough to shoot her husband due to his abusiveness. The movie is a triumph in its illustration of accurate human behaviours and reactions to traumatic events and depicts the seriousness of those situations with humour. Additionally, it accurately depicts denial in operation.",
         "Usually when I sense that the actors had a great time making a movie, the result isn't particularly noteworthy. (\"Cannonball Run\" comes to mind.) But \"Crimes of the Heart\" is an exception. If Jessica Lange, Diane Keaton and Sissy Spacek weren't absolutely delighted to tackle the lead roles in this film, they are much better actors than I thought. The material is reminiscent of Flannery O'Connor, who wrote some of the most humorous, offbeat Southern fiction extant. The three sisters are so controlled by their visceral reactions that one wonders if any of them have ever had an intellectual moment. Although it would be maddening to have such people for friends, they're great instruments for movie comedy. One final note: If anyone thinks Sissy Spacek is goofy-looking (as I used to), they will change their mind when they see her in this. She is absolutely gorgeous here.",
         "i LOVE COTH. i know some of Henley's relatives & as hilarious as this movie (and play) are, the characters are true-to-life Southern eccentrics. living out of MS when i saw the play and the movie, i felt right at home. maybe one has to be US Southern to really understand the wackiness and schizophrenia of this part of the country. Henley writes about her own life and relatives and people of her community. Just as Slingblade is not so much movie as documentary, COTH is a memoir. When my mother watched Slingblade with me, she said, \"Isnt this supposed to be 'film?\" Didn't Mr Thornton win some award? Hell, he just went home to a family reunion and set up a video camera and let it roll. You know all those people; my God, we're kin to half of 'em.\" So it is with Henley's marvelous memoir, when eccentrics \"are just as sane as anyone else walking down the streets of Hazlehurst MS.\"",
         "An entertaining outrageous black comedy, it is supported by three excellent leading performances, although Sissy Spacek is by far the best, and the camera-work from Dante Spinotti is excellent, with creative camera angles and good use of panning. The film tries to bring in a nostalgic sense too though, and does not quite succeed, and the drama of the material does not mix well with the comedy. The choices of music are not too good either, and Tess Harper comes across as very annoying in an over-the-top way, but the virtues of the film are better than its shortcomings. The film comes across as rather lightweight with its black comedy treatment, but it certainly raises some issues with families and coping with one's past, among other ideas. It is not however a film to watch for its messages, but one to simply enjoy for its amusing parts and cinematic virtues, which include some good sound recording too.",
         "This is the south, true and simply amazingly illuminating. The three sisters, each unique in their own quirky way, adore each other as they resent each other. But the beauty is their coming together in those family moments when nothing is as good as kin. So much sunshine lights on the faces and expressions of the actresses, and the tension, though slow, makes for a more interesting look into the inner life of Lenny, Babe and Meg. The supporting case all did fine jobs, and although short lived, the interaction between Lange & Shepard magnified their personal connection. Harper, the harpy, uppity cousin, was as typical as a cousin could get in a small town with know-it-all manners and nothing much to offer but spite. She played it for all it was worth, and then some, and get a head's up from the Academy. Babe's character played by Sissy Spacek, was perhaps the central figure in the triumvirate, but Keaton and Lange held their own throughout. A most worthy southern tale to laugh at, cry with and relate to with ease.",
         "Based on the successful play this film gathered an ensemble of some of the most talented actors and actresses of our time, which includes Sissy Spacek, Sam Shepard, Tess Harper, Diane Keaton, and Jessica Lange. Taking place in the south, we follow the story of a family's relationship and how they are dealing with their sister shooting her husband. With the strong female cast we can't help but to feel their pain through their emotions, relationship with each other, and how they deal with life. Great strong character choices, yet sisters with something even greater in common....love of family, and loyalty. There are many lessons to learn in this film and one of the most important is you can't turn your back on your family, even when you run away they will be there for you. The acting is superb, the honesty is great and in all a wonderful film to see. A true classic and if you haven't seen the play, read it or rented it.....do it now...you won't be disappointed.",
         "Honestly, there's not a lot to say about this film. Sissy Spacek, Diane Keaton and Jessica Lange star as three Southern sisters who reunite when one (Spacek) shoots her husband. The sisters are, of course, incredibly different and their personalities collide over the course of a few days, dealing with what Spacek's character has done while old feuds come to the surface. Clearly based on a play, most of the action takes place in the same house and the film puts everything on the shoulders of the three central women. Keaton plays Lenny, the matriarch of the trio (both of their parents are deceased and their grandfather who raised them is in the hospital) who is socially inept and often gets stepped on by her siblings. Lange is Meg, the popular and outgoing wild girl, man-eater and failed actress. Spacek rounds it out as the potentially insane and murderous Babe. Tess Harper steals her few scenes as Chick Boyle, who lives next door to the house, but the whole thing is centered around the three sisters and that's what makes it work. The film never takes itself too seriously, despite it's morbid themes and narrative, and the women all do a marvelous job of bringing the laughs mostly without overdoing it. Crimes of the Heart is a film that on paper doesn't appeal to my tastes at all, but I often found myself cracking up at the ridiculousness of these characters. The women play the characters as straight as possible, approaching them as characters rather than jokes, and this helps make it an enjoyable experience as opposed to a grating one, although Keaton does overdo it at times. The characters are erratic and very large, which opens itself up to potential disaster, but in selecting the proper actresses for each role they were able to make it an entertaining little movie. It's a simple, light and enjoyable film; certainly nothing memorable and I'm sure I won't be thinking about it at all in a few days, but a nice experience while it lasts.",
         "Crimes of the Heart We all have crimes of the heart.....sad, true, and blissful....at times...this film covers all the territory. Based on the successful play this film gathered an ensemble of some of the most talented actors and actresses of our time, which includes Sissy Spacek, Sam Shepard, Tess Harper, Diane Keaton, and Jessica Lange. Taking place in the south, we follow the story of a family's relationship and how they are dealing with their sister shooting her husband. With the strong female cast we can't help but to feel their pain through their emotions, relationship with each other, and how they deal with life. Great strong character choices, yet sisters with something even greater in common....love of family, and loyalty. There are many lessons to learn in this film and one of the most important is you can't turn your back on your family, even when you run away they will be there for you. The acting is superb, the honesty is great and in all a wonderful film to see. A true classic!! When family gathers....everything comes out.",
         "i liked this movie quite a bit.i guess it's a chick flick,but i also think it was part dark comedy.at least there were elements of that here and there.either way,it was a good movie.it's basically about three sisters who have all grown up and gone their separate ways,who are then reunited under less than ideal circumstances.Diane Keaton,Jessica Lange ,and Sissy Spacek are three sisters that couldn't be more different.once they're brought together again,they form new bonds and learn about each other.the film is very poignant,very moving.this is no action movie,it's dialogue and character driven,so it may seem slow,and it's not for everyone.but in this case,it is the journey,not the destination that's important.watching the three woman as they react to a life changing event is fascinating.a word of caution.there are one or two scenes where a racial slur is uttered,which is disturbing.otherwise though,a wonderful movie with three wonderful actresses.for me,Crimes of the Heart is an 8/10"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["De Laurentiis Entertainment Group (DEG)"],
      "summaries": ["Three sisters with quite different personalities and lives reunite when the youngest of them, Babe, has just shot her husband. The oldest sister, Lenny, takes care of their grandfather and is turning into an old maid, while Meg, who tries to make it in Hollywood as a singer/actress, has had a wild life filled with many men. Their reunion causes much joy, but also many tensions."],
      "budget": 20000000
   },
   "movielensId": 2738,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-12-12",
      "dvdReleaseDate": "2004-02-03",
      "directors": ["Bruce Beresford"],
      "runtime": 105,
      "movieId": 2738,
      "title": "Crimes of the Heart",
      "mpaa": "PG-13",
      "actors": [
         "Diane Keaton",
         "Jessica Lange",
         "Sissy Spacek",
         "Sam Shepard"
      ],
      "imdbMovieId": "0090886",
      "originalTitle": "Crimes of the Heart",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["KkA27bsLt1A"],
      "plotSummary": "Three sisters with quite different personalities and lives reunite when the youngest of them, Babe, has just shot her husband. The oldest sister, Lenny, takes care of their grandfather and is turning into an old maid, while Meg, who tries to make it in Hollywood as a singer/actress, has had a wild life filled with many men. Their reunion causes much joy, but also many tensions.",
      "tmdbMovieId": 48259,
      "avgRating": 3.37941,
      "releaseYear": "1986",
      "numRatings": 539,
      "posterPath": "/fSUFUAFsTiQJy5tDjEdYUM4Aqa1.jpg"
   }
}