{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113755",
      "video": false,
      "title": "Man of the House",
      "recommendations": [
         17207,
         17795,
         161495,
         41841,
         15489,
         17770,
         26441,
         17745,
         40562,
         117553,
         27141,
         18856,
         250622,
         48287,
         42580,
         24736,
         30114,
         42807,
         11310,
         14170
      ],
      "backdrop_path": "/1h7dnAMMCYtU8Y8jlwkiz6s14Yy.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sandy Archer",
               "gender": 1,
               "credit_id": "52fe4594c3a36847f80cf2d1",
               "name": "Farrah Fawcett",
               "profile_path": "/aUMdPKJVwIHJhZX8BZlFbroaRwP.jpg",
               "id": 28768,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Jack Sturgess (Squatting Dog)",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2f3",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Ben Archer (Little Wing)",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2f7",
               "name": "Jonathan Taylor Thomas",
               "profile_path": "/1S8DpfNv6iiQRuKFPtb5u6sCQ5G.jpg",
               "id": 53283,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Chet Bronski (Chief Running Horse)",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2fb",
               "name": "George Wendt",
               "profile_path": "/wbDxe198w5Yu8zYdxkV9vmexN1E.jpg",
               "id": 66606,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Lloyd Small (Silent Thunder)",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2ff",
               "name": "David Shiner",
               "profile_path": null,
               "id": 147491,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Red Sweeney (Silver Fox)",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf303",
               "name": "Art LaFleur",
               "profile_path": "/4rEvPSEtiOeYfqNzwZ6PnCCAP9F.jpg",
               "id": 44792,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Joey Renda, Frank's Son",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf307",
               "name": "Richard Portnow",
               "profile_path": "/bKvHyXRytdiQLZmNkV9AjdFnNvK.jpg",
               "id": 4255,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Murray, Renda Goon",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf30b",
               "name": "Richard Foronjy",
               "profile_path": "/rz8GA26g2uISlcjfVOnSFby6fMw.jpg",
               "id": 47771,
               "order": 7
            },
            {
               "cast_id": 25,
               "character": "Tony, Renda Goon",
               "gender": 2,
               "credit_id": "5a6cec25925141075d00c199",
               "name": "Peter Appel",
               "profile_path": "/f2iffQFEqefoFvg4G3yC9n8WDzt.jpg",
               "id": 1005,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Leonard Red Crow",
               "gender": 0,
               "credit_id": "52fe4594c3a36847f80cf313",
               "name": "Chief Leonard George",
               "profile_path": null,
               "id": 147492,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Frank James Renda",
               "gender": 0,
               "credit_id": "52fe4594c3a36847f80cf317",
               "name": "George Greif",
               "profile_path": null,
               "id": 147493,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Bob Younger, Jack's Boss",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf31b",
               "name": "Ron Canada",
               "profile_path": "/deOASrl3c0zYKGl7pV3OZYrznxQ.jpg",
               "id": 85170,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Norman Bronski",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf31f",
               "name": "Zachary Browne",
               "profile_path": "/ayR35ahszZw2Mj3z9UskUPfEerP.jpg",
               "id": 147494,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Hank Sweeney",
               "gender": 0,
               "credit_id": "52fe4594c3a36847f80cf323",
               "name": "Christopher Miranda",
               "profile_path": null,
               "id": 147495,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Darryl Small",
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf327",
               "name": "Spencer Vrooman",
               "profile_path": "/RyCG8ZfbwSPRa5O4FylPomxdbj.jpg",
               "id": 147496,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2d7",
               "name": "James Orr",
               "profile_path": null,
               "id": 27444,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4594c3a36847f80cf2dd",
               "name": "David E. Peckinpahs",
               "profile_path": null,
               "id": 139758,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2e3",
               "name": "Richard Jefferies",
               "profile_path": null,
               "id": 73570,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2e9",
               "name": "James Orr",
               "profile_path": null,
               "id": 27444,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4594c3a36847f80cf2ef",
               "name": "Jim Cruickshank",
               "profile_path": null,
               "id": 27445,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "565225f7925141645f0080a7",
               "name": "J.J. Makaro",
               "profile_path": null,
               "id": 1007395,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.953787,
      "production_countries": [],
      "id": 40490,
      "vote_count": 50,
      "budget": 0,
      "overview": "Ben Archer is not happy. His mother, Sandy, has just met a man, and it looks like things are pretty serious. Driven by a fear of abandonment, Ben tries anything and everything to ruin the \"love bubble\" which surrounds his mom. However, after Ben and Jack's experiences in the Indian Guides, the two become much closer.",
      "similar": [],
      "original_title": "Man of the House",
      "runtime": 96,
      "poster_path": "/6bnOhhrrrq6RZhMgz4aGyqbJ9Wf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/4MbjW4f9bu6LvlDmyIvfyuT3boj.png",
         "name": "Walt Disney Pictures",
         "id": 2,
         "origin_country": "US"
      }],
      "release_date": "1995-03-03",
      "vote_average": 4.9,
      "belongs_to_collection": null,
      "tagline": "Jack wants to marry Ben's mother. But there are strings attached.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["James Orr"],
      "runtime": 96,
      "synopsis": null,
      "writers": [
         "David E. Peckinpah",
         "Richard Jefferies"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113755/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1MzQyNzI5N15BMl5BanBnXkFtZTcwMjUyNjUyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Chevy Chase, Farrah Fawcett, Jonathan Taylor Thomas | See full cast and crew »"],
      "reviews": [
         "Sandy Archer (Farrah Fawcett) is a single mom. She and her son, Ben (Jonathan Taylor Thomas) have been on their own for years, but now she's met an attorney, Jack Sturgess (Chevy Chase), and fallen in love. When Jack moves in to Archer's loft, he quickly learns that it's going to be rough going with Ben. To make matters more complicated, Jack routinely helps put away criminals with dangerous connections. Can Jack save his relationship with Sandy, save his job, save his life and become a welcomed stepfather to Ben all at the save time? I feel a bit sorry for Chevy Chase. Regardless of what he's like personally, I think he's genuinely talented, and not just for comedy. But he's acquired such a reputation over the years for being in sub par stinkers (mostly unjustly deserved, in my opinion) that I think it's a major hurdle for audiences to give his films a fair chance. That's a shame, because this is a very good film, with a good performance from Chase and the rest of the cast. It's important while watching to not expect Man of the House to be an over-the-top comedy. It's as much a drama as anything else, and has adventure/thriller aspects as well. All of the genres are entered into from more of a child's or adolescent's perspective, which is appropriate for the material and venue. From that perspective, scenes about the Indian Guides (a plot point that may have swayed my view of the film even more, as it brought back memories of my time in the Indian Guides with my dad back in the early 1970s) are just as weighty (both seriously dramatic and funny) as chase scenes with an impending threat of death. Other seemingly minor elements are also given more weight than they would have from an adult standpoint, and logic, plot progression and even physics are coming from a kid's world, not an adult's. That's not an easy thing for a 40-something year old director to achieve with just the right tone, but James Orr makes it look effortless. The scriptwriters weave the various threads of the film together very nicely, as Jack uses connections from his work to make the Indian Guides even more fun and educational, while at the same time, saving his relationship with an important client. In fact, the funniest material in the film comes from fish out of water themes. Various characters are regularly approaching activities they would normally avoid, with inappropriate attitudes, clothing, and so on. The subtext of the film, stemming from the fish out of water material, concerns furthering self through understanding and furthering others--opening up to new perspectives, trying different things, cooperating with others, and so on. Initial resistance makes things difficult, but the attempt to understand and further others brings happiness. The entire principle cast is great, but Man of the House also benefits from a number of excellent character actors, including George Wendt, Art LaFleur and Richard Portnow. Like most films, you'll enjoy Man of the House more, and get much more out of it, if you leave your expectations/preconceptions parked at the door.",
         "\"Man of the House\" is a true treasure of a film. It is one of those great Disney family comedies, that everyone enjoys. Good comedic performances from both the young Jonathan Taylor Thomas and Chevy Chase. George Wendt is also good. It's this type of enjoyable film that reminds you of some good times: great family films like this are becoming more and more rare and it's a shame. What a terrific film \"Man of the House\" is!",
         "As usual, I'm in the minority. I love this movie. Chevy is so funny as the step dad to Jonathan Taylor Thomas and would-be husband to Farrah Fawcet. I loved Chevy in this. He plays characters completely off the cuff, and I found his character endearing, but what I really liked about this movie was Farrah. She still shines after all those years, in a completely engaging performance. Jonathan Taylor Thomas is perfectly precocious in his role as Fawcett's son, a boy who lost his father, and refuses to accept Chevy as an adequate substitute. It's funny, heartwarming, and genuinely sweet. It rates a 6.7/10 from... the Fiend :.",
         "This is the best movie to watch is you are feeling down. The Man of the House is just so funny, I could watch this movie over and over, and never get tired of watching it. Even now, just writing about it, makes me smile. You have to watch this movie if you haven't seen it yet! Just for fun, if you have seen, watch it again! I relate to J.T.T. in this movie, I have done some pretty mean things to my step-dad, but never anything like making him join an Indian Guide club. The actors in this movie, just crack me up. Also, the songs picked out for this movie just fit so perfectly. I love all the songs on this movie! The parts with music playing, just makes the movie even funnier some how! All I have left to say is, I love this movie! It is great!",
         "I understand the problems many people have with this movie. There are a few ridiculous subplots and hokey slapstick violence in a little over 90 minutes that seems redundant and ridiculous. But when I heard how underrated this movie actually really is I must say I was shocked. OK so there are some stupid subplots in the movie but so what? A lot of pre-teenagers (as well as early teenagers) can really learn a lot from this movie especially if they have experienced a family event like a divorce and having to deal with a step-parent. I am one who has had to deal with a divorce and a step-parent and they both are no day at the beach whatsoever. But the Jonathan Taylor Thomas character in this movie really reminded me of being younger and how I thought it was fun to do silly tricks and manipulations to get my step-parent to go away. And with all the hype of Farrah Fawcett recently passing away I think a lot of people who are interested in her career should look back at this movie as this was one of her very few Hollywood theatrical films. She had much more success on the smaller screen as we all know. I think a lot of people also had trouble with this movie because it tried to make Chevy Chase into more of a heartwarming character unlike his \"Caddyshack\" and \"National Lampoon's Vacation\" series characters. Why people had a bad reaction to that is a mystery to me. Comedians like Chase should not be playing silly oafs their whole career. Sometimes it is OK to change characters if you are going in the right direction and for the most part I think Chase was doing so here. And George Wendt's supporting performance as the Indian Guide leader I thought was very good and made him into a more endearing and heartwarming character unlike his Norm Peterson fame on \"Cheers\". As aforementioned a few things in this film do not work. For instance on the camping trip that Chase and Thomas attend in the woods with the Indian Guides and Chase tells a campfire story it is supposed to be funny but it really isn't.At least that monologue could have been written better for Chase. The supporting charactersmake that scene more interesting. I also don't like the subplot of the man who wants to kill Chase because he sent his father to prison as a prosecutor for committing a crime. We get some hokey dialog once again there and then it turns into a semi \"Home Alone\" rip off trying to scare away the bad guys with \"Home Alone\" like booby traps. But aside from those flaws I think \"Man of the House\" on the whole is a good film that parents and kids alike can enjoy and learn a lesson from. And with all the parents complaining about content in films today and how \"family films don't exist\" I think this one blows that theory. There is only one mild discussion about sex (it is a pre-teenager film what else do you expect?) profanity is very mild, and the violence is done on such a slapstick level that you cannot take it seriously at all. By the end of the film Thomas likes having Chase for a stepfather and now life will be great with his mom and Chase. I only wish the ending of this movie could have happened with the situation in my parents divorce and my later teenage years. All I am saying is ignore this movies flaws and go along for the ride. If you have experienced something like this in real life this will be a movie you will be glad you didn't miss.",
         "I love this movie. It's been a favorite of mine since I was a little kid, and I love it to this day. Jonathan Taylor Thomas is hysterical as Ben, Chevy Chase truly embodies Jack, and Farrah Fawcett is great as Sandy. I love the Indian Guides characters; the kids and their fathers have great chemistry. For anyone who doesn't like this movie, I have to wonder if you were watching the same one I was. If you're ever looking for a funny, heartfelt family comedy, then this movie is definitely for you. I highly recommend it to everyone. P.S. I actually learned the rain dance. What does that tell you (apart from me being slightly obsessed)?",
         "This is basically a story of trust and building family relationships. When mom, the late Farrah Fawcett brings Chevy Chase in the house to live, obvious problems shall result when her 11 year old son rebels at the prospect of having to share his mother with this man. The situation is not helped by the fact that at the age of 5, the boy saw his father walk out on his mother and wave goodbye. Chase hopes to build this trust by introducing the child to a club of fathers emulating Indian chiefs with their sons. This becomes rather corny at best. Fawcett was given very little to do here and I wonder why she accepted this part. Chase, a prosecuting attorney, incurs the wrath of a mobster's son by putting the father away for 50 years. The son vows vengeance which interferes with Chase trying to establish a relationship with the boy. The last part of the film is inane since the son and his crew plot to do Chase in while the latter is on a camping trip with the boy and others. The attempt at turning this into a home alone type does not work and George Wendt, who portrays a shop teacher and member of the tribe, looks more like Friar Tuck. How the group turns the table on the mobster's son and his group is brief and ridiculous. More could have been made of this in a missed opportunity.",
         "I'm just now watching this on TV, and find it an enjoyable but fairly standard Disney type plot, with the usual misunderstandings based on lack of communication. Eventually justice will triumph, I'm sure, with all the usual civilian-vs-bad-guy showdown and broken-relationships-cemented stereotypes, still enjoyable to watch in each new screenplay. I mainly wanted to comment on a cute cameo that I didn't find mentioned anywhere. At the very beginning of the film, establishing the relationship of Farah Fawcett and her son, he mentions how she dated a few guys but they were all losers. They show a few seconds of one of these dates, with the fellow clowning around at the beach. If you watch closely you will see it is Ryan O'Neal!",
         "A mildly amusing, simple film that is good to fill in time. It's just another Disney family movie, with no outstanding features; the script is plain, the acting average and the plot predictable but variable enough to keep your interest. \"Man of the House\" centers around a young boy, Ben, who is unhappy about his single mother bringing home boyfriends. When she plans to marry one, he plots to get rid of the boyfriend so it can be just him and his mother again. This leads to a Boy Scout meets Native Americans type group of fathers and sons where Ben hopes he will be able to drive Jack away. Slight violence and language but no blood and guts. Rent if for the whole family.",
         "This is a great movie for families to watch together. This is a story about a boy who is trying to stop h is mom form being with her new boyfriend. Of course nothing is ever easy and things never go as planned. To add to everything the new boyfriend has a dark secret. One that he doesn't want the boy or his mother to know. When the secret does get out everything blows up and the story gets very interesting. Jonathan Taylor Thomas does a great job playing a kid who whats to keep things with just himself and his mother. I was really impressed with this movie and was really entertained by it. It is definitely worth watching."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "All Girl Productions",
         "Forever Girls Productions",
         "Marty Katz Productions"
      ],
      "summaries": [
         "Ben Archer is not happy. His mother, Sandy, has just met a man, and it looks like things are pretty serious. Driven by a fear of abandonment, Ben tries anything and everything to ruin the \"love bubble\" which surrounds his mom. However, after Ben and Jack's experiences in the Indian Guides, the two become much closer.",
         "When Ben Archer's parents divorce, it's just him and his mom. But a few years later, she meets a guy named Jack, it isn't long that he moves in with them and makes changes that Ben doesn't like. Ben, upon advice of some other boys, gets Jack to join the Indian guides with him, hoping that the experience will make him leave. At first Jack is about to pack it in but another parent in the guides tells him that Ben is afraid of losing his mom so Jack sticks it out. But unfortunately Jack, a prosecutor has someone gunning for him."
      ],
      "budget": 0
   },
   "movielensId": 274,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-03",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["James Orr"],
      "runtime": 96,
      "movieId": 274,
      "title": "Man of the House",
      "mpaa": "PG",
      "actors": [
         "Farrah Fawcett",
         "Chevy Chase",
         "Jonathan Taylor Thomas",
         "George Wendt",
         "David Shiner",
         "Art LaFleur",
         "Richard Portnow",
         "Richard Foronjy",
         "Peter Appel",
         "Chief Leonard George",
         "George Greif",
         "Ron Canada",
         "Zachary Browne",
         "Christopher Miranda",
         "Spencer Vrooman"
      ],
      "imdbMovieId": "0113755",
      "originalTitle": "Man of the House",
      "genres": [
         "Action",
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": ["JcW2p8nyrng"],
      "plotSummary": "Ben Archer is not happy. His mother, Sandy, has just met a man, and it looks like things are pretty serious. Driven by a fear of abandonment, Ben tries anything and everything to ruin the \"love bubble\" which surrounds his mom. However, after Ben and Jack's experiences in the Indian Guides, the two become much closer.",
      "tmdbMovieId": 40490,
      "avgRating": 2.84219,
      "releaseYear": "1995",
      "numRatings": 1280,
      "posterPath": "/6bnOhhrrrq6RZhMgz4aGyqbJ9Wf.jpg"
   }
}