{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0091699",
      "video": false,
      "title": "Otello",
      "recommendations": [
         135625,
         26771
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4d7e9251416c91118017",
            "name": "Franco Zeffirelli",
            "profile_path": "/rzu0vDf1FtvriZty1gJ1OwhrReN.jpg",
            "id": 24657,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [],
      "popularity": 0.57913,
      "production_countries": [],
      "id": 198469,
      "vote_count": 4,
      "budget": 0,
      "overview": "Having previously staged Verdi's 1887 opera Otello at the Met and La Scala, filmmaker Franco Zeffirelli committed his production to film in 1986. Starring as the fatally jealous Moor of Venice is Placido Domingo, who had also headlined Zeffirelli's 1976 La Scala staging (production on the film was briefly interrupted while Domingo participated in the rescue operations following the Mexico City earthquake). While Katia Ricciarelli as Desdemona and Justino Diaz as Iago perform their own singing, Zeffirelli's Cassio--played by real-life European prince Urbano Barberini--is dubbed by Ezio de Cesare. The director made several cuts in the original libretto and score in order to accommodate the film's two-hour time limit, but these excisions are done with taste and discretion. Because of the excessive violence in the third act--two murders, a suicide, a superficial throat-slashing--Otello was released with a PG rating.",
      "similar": [],
      "original_title": "Otello",
      "runtime": 118,
      "poster_path": "/pPHMSeOVR2BVq32JP7bgcLqlSf4.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1986-12-17",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Franco Zeffirelli"],
      "runtime": 118,
      "synopsis": null,
      "writers": [
         "Arrigo Boito",
         "Franco Zeffirelli"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0091699/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYwMjMyODM3OV5BMl5BanBnXkFtZTYwMjY3ODg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Plácido Domingo, Katia Ricciarelli, Justino Díaz | See full cast and crew »"],
      "reviews": [
         "A real rarity -- an opera on film that still retains its power. In fact, this version is even more powerful that some stage productions. The subtitles are easy to read, the staging is atmospheric, and the cast is wonderful.",
         "In terms of audience expectations, opera films are the luckiest in the medium. Whereas comedies have to be funny, action films exciting or mysteries mysterious, opera films could be the dullest, visually incompetent farragos ever, as long as the music is there, booming in all its glory. And, with a few noble exceptions - the Archers, Losey, Bergman - that is in general what we opera lovers have been given: we are that easy to please. Zeffirelli's OTELLO is far better than the usual, but is, if I may say so under IMDb guidelines, still hampered by a curious mixture of unfounded arrogance, cautious reverence and imaginative timidity. As any fool knows, the best films are founded on melodrama, literally music and drama, just like opera (and many great film-makers have produced opera also). Because action on stage is evidently limited, all the excitement, passion, emotion of characters' feelings and of extreme circumstance are carried by the music, in the same way narrative is less important in the films of, say, Minnelli or Sirk, than the vibrant mise-en-scene which speaks for characters when they cannot. Opera, therefore, might seem a perfect medium for cinema. In another way, though, it is constricted. A spoken theatre play, for example, can be opened up with relatively little damage, you can create new scenes, add dialogue. But any director of opera carries the millstone of the score - you can cut, but you cannot write new music (or if you did you'd be shot), and so you have to work with what you've got, which increases the theatricality. Again, depending on your genius, you can be limited or liberated by this. OTELLO benefits from this concentration because it is such an inexorable, claustrophobic piece, where the confinement of setting mirrors the different prisons characters find themselves in. But claustrophobia is uncomfortable, and Zeffirelli is catering to a bourgeois, generally non-cinema going audience, who want a tasteful, middle-brow night out, and so he never explores the opera's intensity as much as he might. And, we are reminded of Welles's OTHELLO, the second greatest Shakespearean adaptation, and know how it can be done. This is a very traditional interpretation, not just for opera on stage, but for Shakespearean performances as well. We get the usual Cyprus garrison, the Renaissance costumes, the exotic local colour, the play of black and white, the sight of pure Desdemona in white lying on her pure, white bed. But Zeffirelli makes a few 'adjustments' that are not neccessarily in Verdi, but have some justification from Shakespeare. For instance, Desdemona's relations with Cassio are ambiguous, made seemingly sexual from the very beginning, making Otello's rage less irrational, and her 'innocence' more complicated. This might blunt the story's symbolic force, but makes the characterisation more plausible, as does Otello's suspicion from the start, so that Iago's poison is only one factor in the Moor's anguish. These kind of interpretive devices are acceptable, if not exactly enriching. What are less acceptable are the cuts to the score, brief perhaps, but sticking out like tatters on a brocade robe. What's inexplicable is that they're not really needed - unlike, say, 'Die Meistersinger', this opera is the same length as a regular feature - did we really need the orchestral epilogue over the credits, disturbing the cathartic power of the finale? Further, maybe the print I saw was aged, but the sound was very muffled, made more inaudible by intrusive sound effects which are presumably there to heighten the drama, but only serve to irritate (Zeffirelli as Brecht? I don't think so). Visually, Zeffirelli is no Welles, and his shots are full of the propriety beloved of those who condescend to cinema. There are two sequences - Iago's self-revealing credo and Otello's jealous soliloquy - full of huge metaphysical power, bracing blasphemy and emotional voids that cry out for Welles; in fairness, these are the film's best scenes, but they are suffocated by restraint. Curiously enough, with the excessive zooming, clumsy compostions and unrhythmic editing, the nearest filmmaker to Zeffirelli is Welles' friend Jesse Franco - if the Italian never approaches that maverick's sheer profusion of ideas, there is a gratifying homoeroticism (especially Iago talking about Cassio's dream, immensely revealing or the villain's character) to compensate. It would be inappropriate to expect astonishing acting from opera performers - the histrionic requirements of a huge hall and an exposing close-up are completely different. I have mixed feelings about the casting of Placido Domingo. Surely, in the mid-80s, it is beyond offensive to cast a boot-polished singer in the lead role, especially with so many great black performers more than qualified. I suppose they wouldn't have enabled the film to get made. On the other hand, Domingo is the greatest tenor of the 20th century, the most daring, versatile and exciting, as well as the one with most subtle and expressive dramatic range. He is remarkable here, his acting surprisingly nuanced and moving. In his first appearance, entering from the storm, and in his first beg scene, halting the drunken brawl, Otello is a figure who emerges from chaos to assert order; his decline into madness, pointed by the profusion of scientific, 'rational', instruments, which become expressions of distortion, is painful to watch, but true. Katia Ricciarelli, excellent, looks like she's wandered in from 'Siegfried'.",
         "So seldom does everything come to-gether so perfectly. Verdi's masterpiece. Zeferelli's genius. Domingo's voice and those of a superb cast. I had just seen an excellent stage production of Otello last week and pulled out this tape to watch with a friend and again savour this wonderful opera. Nobody should have such sublime pleasure twice in one week. Powerful, Wonderful, Awesome. Magnificent. Why why why do people listen to rock and to rap when this music is available? A raptuous ten!",
         "This film could have been one of the best opera movies ever, if only Zeffirelli had refrained from interfering with not only the musical score, apparently to cut down the length to standard two-hour movie time (which is bad enough), but with the contents of the opera as well. His version blatantly suggests that Cassio was indeed somehow interested in Desdemona (on which level remains vague) which is simply not the case. This suggestion deprives the piece of the particular level of insanity that Otello's actions bear. It is very important that Otello's jealousy has indeed no basis in fact but is solely propelled by means of Iago's evil insinuations. In my opinion it is a rather cheap attempt by Zeffirelli to wring more \"movie drama\" out of a piece that already is so dramatic it doesn't need the \"enhancement\". As for the length, the opera normally runs for 2 hours and 20 to 30 minutes, which is not unheard of for a movie, and I don't think that people who are interested in an opera film would have said, \"if it had been two hours I would have watched it, but two and a half hours is too long\" and I doubt that people who are not interested in filmed opera would have been more willing to watch it for the reduced length. For someone who loves this particular opera it is very painful to see and hear it mutilated like that (Zeffirelli has proved with the Traviata film that you can slightly reduce the score in a manner that is much less offensive). As for the acting, he couldn't have chosen a better cast. Placido Domingo, having been in his prime at the time, is a rare example of an opera singer able to apply just the right amount of subtlety required by the occasion. Whereas other singers tend to overact in a medium that is defined by a much closer look on the actions and expressions of the actors he gives a very moving, very convincing performance, always aware that no excessive gestures are needed, instead making you believe that the character is a real person. His singing is beyond reproach or criticism, the voice has a beauty you rarely find in other tenor voices of the time. Katia Ricciarelli is also very good and moving, although her performance slightly leans toward the theatrical approach. Justino Diaz is convincing enough as the villain and obviously enjoys the role which adds to the altogether gripping feel of the movie. The setting, production design and costumes are at the usual level of Zeffirelli's well-known naturalistic directorial approach and attention to detail, which I rather like in opera movies. To sum it up, I wish he hadn't tempered with the opera but instead had shown a little more faith in and respect for Verdi's work.",
         "I am a fan of Placido Domingo in the sense that I admire him for his vast repertoire and lengthy career. That being said, this is one of the best movie versions of this opera around. Domingo is everything expected in this role. His superb singing and masculine physique are a perfect match. As for Katia's Desdemona, she is a great singer and beautiful woman (for an opera singer, of course). Justino Diaz's Iago is as evil and vile as Shakespeare wrote of him. The music along with actually shooting in Europe make a wonderfully complete picture for this masterpiece. Even the opening sequence is visual, unlike the usual staged productions. Real combat, emotion and staging are quite effective.",
         "Once again, Zefferelli produces a tour de force after the smash hit that was the 1982 film adaptation of Verdi's La Traviata starring Placido Domingo and Teresa Stratas. Placido Domingo, whom we are led to believe must be Zefferelli's favorite tenor (he never cast Pavoratti in any of his films, though Pavoratti was enjoying immense success at this time as well)is Otello. This is without a doubt his greatest role. He sang it numerous times, more than any other tenor of his time and prior, refining the role each time. No one, not Pavoratti, not Jon Vickers, or even the great Mario Del Monaco compares to the dramatic prowess of Domingo's portrayal. He is at first a noble hero, but eventually becomes a majestic savage, a roaring lion, consumed by jealousy and desire for revenge. Soprano Katia Ricciarelli stars as Desdemona, portraying the wronged heroine with vulnerability and pathos in her soaring voice alone. Bass-baritone Justino Diaz as the villainous and scheming Iago is almost Oscar worthy. His diabolical laughter sends chills down our spine. Zefferelli uses up all the tricks of his sleeve- Renaissance period costumes, authentic detail, color and backdrops (shot in Venice, Italy, which to the Italian Zefferelli is probably only a block away) beautiful people in the cast- even Cassio (Urbano Barberini) is quite good-looking and in a twist performs the role with a bit of ambiguity so as to make us believe that perhaps there is a little truth to Iago's story. He did have a dream in which he was making love to Desdemona and it's not altogether impossible that he wanted her for his own. He does tell him he has tired of Bianca and fallen in love with another woman (Desdemona perhaps ??). From the opening sea storm sequence to the grim finale, we are not only in Zefferelli's world, but we are also in Shakespeares world, for Shakespeare himself would be proud of this version. And to those who nag about Zefferelli cutting some arias or scenes, this means nothing. The \"Willow Song\" is not dramatically important and its omission does not take away from the dramatic strength and drive of the story. And this is not a full-length stage version but a movie!!! In a movie, we are limited to 2 hours at most, while some operas can last 4 hours. No one will sit through a 4 hour movie, so Zefferelli is wise in taking away some parts. He never loses the integrity of the spirit of the work. This late opera of Verdi is actually quite difficult to sing and anyone who can master the roles here are especially talented and dedicated to their art. Domingo shines in every scene, from the opening \"Exultate!\" as he returns home triumphant after defeating the enemy, to the tender love scene with Desdemona in which he recalls his tragic past (he was sold as a slave and taken from his native African soil and Zefferelli effectively uses flashbacks) to all his monologues which border on Laurence Olivier theatrics, to the intense finale in which he stabs Desdemona, he is quite frankly the best. What the world is waiting for, as well as I, is an African-American tenor who can master the role of Otello. For so long, non-black tenors have sung the role using heavy black make-up and body paint to appear black. There is a very limited supply of black men in opera. There have been far more black women as sopranos and mezzo sopranos (Grace Bumbry, Leontyne Price, Shirley Verrett, Jessie Norman, Kathleen Battle, Denyce Graves). Domingo makes a nuanced performance and quite moving. His descent into madness and jealousy is convincing. \"Maybe it's because I'm black\" he says at one point when he begins to question why Desdemona would turn to another man for love or passion. Surely at this time, a successful, victorious General like Otello, who was black in a white-European world, would cause some jealousy and envy by such people as Iago. Although it may not necessarily be a question of color (Iago, after all, wanted the position of Cassio and perhaps even Otello's own office as the great General and in this way was simply full of envy). This is a great film with top singers giving it their best. I am an opera fan for life after seeing this movie. My favorite moments include- Desdemona's Prayer Scene before she is killed, Iago's blasphemous \"Credo\" (I believe in a Cruel God\") in which he mocks the very establishment of religion, calling Heaven a lie, and praising the evil nature of man. If you notice carefully, we get a lot of the \"evil\" going-ons deep below the stony vaults of the castle, which represents the lower levels of human nature. Justino Diaz is a particularly devilish Iago, though I would have loved to see Samuel Ramey in the role. Diaz seems to be putting forth only vocal effort and lacks the \"slime\" he needs in acting/body movements, etc to effectively portray opera and literature's most evil villains.",
         "The story is simple, Shakespearean to the absolute extreme you can imagine. The peace and happiness of Venice is disturbed by the simple fact that a Moor, Othello, is welcomed as a hero after a battle he won in Cyprus. He is married to the daughter of a high ranking family, Desdemona, who is carrying in her own name the fact that she has a very doomed, demonized lot due to this very disruptive situation and love. This creates a rivalry, antagonism with the captain of the fleet, Cassio, and the extreme envy if not hatred from Iago is enough to turn a disruption, a breach of balance into a major catastrophe. A handkerchief and its supposed or alleged circulation will sign the end of Desdemona strangled by Othello, a strangulation that is very strange in this film since she will survive it long enough to expose her murderer and then die peacefully. Iago is then exposed in his treachery, killed by Othello with a spear instead of being tortured to death, and Othello finally kills himself with a dagger and still no blood at all. And balance is found again after the drama, the balance of sorrow, mourning and justice in a way. The play by Shakespeare and this opera reveals a deep racist inspiration. Othello is bringing this drama to Venice because he is a Moor, an Infidel, a Blackman, etc\u0085That theme exists in other plays like \"Titus Andronicus\" or \"The Merchant of Venice\", with an anti-Semite dimension in these latter cases. The common theme is the hatred from a mediocre person who is trying to get even with better people than him by destroying them through some kind of plotting. But this plotting leads to the ultimate ruin of the plotter. We have to look over this dimension, common in Shakespeare's time, and see the more universal dimension. The man who is successful will inspire jealousy, envy and even greedy hostility. In this case, the object of that envy is Othello's wife and the game is to make the successful warrior kill his love, which he does out of some jealous lust, some possessive desire. The subsequent drama and the repentance of Othello shows how things are changing in these renaissance years, how women are little by little capturing some individual existence of their own, on the way to freedom, even if it ends up in death altogether. In fact Shakespeare in his English society is more advanced than Verdi in his 19th century Italy. Shakespeare doubles the point by making Desdemona's maid the final and lethal accuser of Iago and his lying and conspiring. We have to think of Romeo and Juliet but this latter case is pure love, no conspiration, jealousy or whatever, though the end is the same apart from the poison. A double death in the name of love. Zeffirelli does a pretty good job by creating a rich environment, at times maybe too rich. A slightly leaner production would have probably emphasized the beauty of the music and the singing. Othello as well as Desdemona reach the depth and density the tragedy requires. The cluttered setting de-concentrates our attention, even maybe our interest. The singing and the music require a stylized setting for our eyes not to get lost in the jungle of the visuals, short-circuiting our ears in their enjoyment of their listening. Dr Jacques COULARDEAU, University Paris Dauphine, University Paris 1 Pantheon Sorbonne & University Versailles Saint Quentin en Yvelines",
         "The very beginning of OTELLO with everything so vastly bigger than reality sets the tone for our expectations. Some are disappointed, others are surprised. It seems, having found out Franco Zeffirelli's entire filmography, that the key movie which truly delivers the director's masterful eye for details as well as the desirable faithfulness in adapting the classical source to the screen is TRAVIATA with Placido Domingo and Teresa Stratas. There, you do not have to be particularly fond of opera to love it. Indeed, echoing Vincent Canby's words of September 1986, in TRAVIATA \"opera and film are effortlessly made to seem one.\" OTELLO, made 5 years later with the great tenor in the lead, appears to be a slightly different case in which aesthetic beauty is combined with classic tragedy but the manner is ultimately individual. The 2013 Year of Verdi may constitute a wonderful opportunity to broaden one's knowledge of this great composer, the genius of his time. However, many viewers who have seen Franco Zeffirelli's OTELLO will probably agree with the New York Times reviewer, Vincent Canby, that, unlike TRAVIATA, the movie rather \"ornaments\" the original than \"reveals\" it. Therefore, from the very opening shot with its grandeur and the majestic display of elaborate visuals rather than Verdi's storm music (which appears to be in the shadow of spectacle), OTELLO is foremost an expression of the director's style. Yes, it is more Zeffirelli than Verdi in its divided pieces, some chaotic continuity, dreamlike photography by the director's mainstay, Ennio Guarnieri, aestheticism and the vital, engrossing and a little terrifying conclusion. At certain moments, visuals and symbols appear to be supplied with an almost spiritual piety. Such care is being handled, such effort being put to everything. Although it may consist of certain liberties with the original source, nothing seems to stand in the way towards leaving the viewer dazzled at the creative use of images, dazzling costumes, breathtaking colors, camera angles and the cast who make it all beautifully acted and sung. They allow you to search into their souls. Yes, they will completely captivate you. Of course, the nature of this movie, opera, makes the performances considerably overacted. Viewers who are not used to such pompous execution of the sung lines may feel at odds with the over-dramatized moments. Yet, Zeffirelli, as in many (of not all) of his other movies supplies us with beautiful characters whose looks alone somehow make them easily identified with and likable. The pairing of Placido Domingo as Otello and Katia Ricciarelli as Desdemona rewards us all. By splendid combination of emotional resonance and the dramatic tensions, they deliver exceptionally memorable moments, in particular their wedding night which is a true visual poetry on screen. Domingo beautifully highlights the typical way of a tragic hero - from victory to tragedy, from pride to humiliation, from being hailed to being doomed. Ricciarelli is a delicate dove, an innocent victim, a truly beautiful creature born under evil star. She is incredible in the scene of the prayer at the shroud of Madonna. Piety, subtlety and dignity reach exquisite harmony and surprising balance. Yet, however they differ, as it is in the classical tragedy, they both fall victims of evil scheme, of the hero's evil genius. One line says: \"Beware of jealousy!\" This, unfortunately, did not apply to \"Beware of an evil man!\" Justino Diaz portrays Jago, a malicious man who believes in a god of vengeance...that is his creed. His demonic laughter allures all major human emotions. It is him who plants the seeds of doubt about Desdemona and her alleged lover, Cassio (Urbano Barberini) and his poison really works in the hero's mind. In one of the most powerful scenes of the movie, Jago stands at the cross in a typical Zeffirelli imagery (compare to the film about saint Francis) and, on the verge of blasphemy, he sings out in pride and vanity \"Heaven is an idle tale\" That scene has its continuation at Otello's oath. Zeffirelli delivers a splendid performance from Justino Diaz, the most memorable character/villain of the movie. From the supporting cast, a mention must be made of Urbano Barberini. Here, the classical idea of beauty, sort of Michelangelo's David is evoked, in particular, at the additional scene (which Canby relates to as 'gross interruption') when Cassio is showed succumbed to the wild pleasures of erotic dreams about Desdemona. Barberini evokes a certain aspect of an innocent young man so many times depicted by Zeffirelli with its pinnacle in ROMEO AND JULIET. With the marvelous display of visuals, aesthetic splendor and the director's standard hallmarks, Zeffirelli has never and will never win the hearts of those who are bound to criticize him. Yet, OTELLO may be forgiven its liberal treatments of the classical source and may be considered a significant film by those seeking high art on screen.",
         "This is a great adaptation of one play made by William Shakespeare, being one of the best movie versions of his works: Franco Zeffirelli made a great job with the original story making a incredibly good movie that has excellent performances, beautiful music and many memorable scenes. Actually, this is probably one of the best movies that I've ever saw: Everything about it was great and captivating. Placido Domingo made a completely unforgettable performance as Othello, and the rest of the cats made a magnificent work as well. This movie is a masterpiece, and definitely deserves more appreciation and recognition.",
         "This is easily one of Franco Zeffirelli's better opera films. The cinematography is excellent, perfectly capturing the beautiful costumes and locations used here. A chief example of beauty was Desdemona lying on the bed all pure, as white as snow, as is said in the Shakespeare play. The subtitles are also very easy to read, and the plot while shortened is faithful to the play and to the opera's libretto. The music is just superlative. Verdi is without doubt up there with Puccini as the finest Italian opera composer, composing masterpieces such as La Traviata, Il Trovatore and Aida, and Otello based on Shakespeare's play deserves to be up there with them. So many highlights to choose from, there is Exultate, there are a couple of beautiful choruses and the riveting revenge duet between Otello and Iago, but my favourite has to be Desdemona's beautiful but haunting Willow Song(only in excerpt form here), that can give you goosebumps, because the repeated word Salce is quite hypnotic and foreboding. As for the singing, what can I say, fantastic. Placido Domingo was just brilliant, yes in the play, Othello is supposed to be black, I am trying to avoid being racist here, but Domingo is such a versatile talented singer, with a phenomenal voice, and a stage presence that does make Pavarotti inferior in comparison, it is forgiven. Katia Ricciarelli looked beautiful as the tragic Desdemona, and her voice was like an angel, in one word stunning. And Justino Diaz is very convincing as the hissable villain Iago, especially in the blasphemous but chilling Credo, who manipulates Otello into believing that Desdemona is unfaithful in quite an entertaining way. Overall, a very well done film adaptation of Verdi's opera. Bravo Zeffirelli! 10/10 Bethany Cox"
      ],
      "genres": [
         "Drama",
         "Music"
      ],
      "productionCompanies": [
         "Cannon City Produktie Maatschappij B.V.",
         "Cannon Productions",
         "Italian International Film"
      ],
      "summaries": ["Based on Shakesphere's play, Verdi's opera depicts the devastating effects of jealousy, \"...the green-eyed monster which doth mock the meat it feeds upon\". Believing Otello has promoted the fast-rising Cassio over himself, Iago plots to destroy both Cassio and Otello. Iago convinces the jealous Otello that his beautiful wife Desdemona is unfaithful, and that Cassio is her lover. Jealousy is followed by tragedy, then retribution, \"Has Heaven no more thunderbolts?\""],
      "budget": 0
   },
   "movielensId": 2744,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1986-12-17",
      "dvdReleaseDate": "2003-03-04",
      "directors": ["Franco Zeffirelli"],
      "runtime": 118,
      "movieId": 2744,
      "title": "Otello",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0091699",
      "originalTitle": "Otello",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Having previously staged Verdi's 1887 opera Otello at the Met and La Scala, filmmaker Franco Zeffirelli committed his production to film in 1986. Starring as the fatally jealous Moor of Venice is Placido Domingo, who had also headlined Zeffirelli's 1976 La Scala staging (production on the film was briefly interrupted while Domingo participated in the rescue operations following the Mexico City earthquake). While Katia Ricciarelli as Desdemona and Justino Diaz as Iago perform their own singing, Zeffirelli's Cassio--played by real-life European prince Urbano Barberini--is dubbed by Ezio de Cesare. The director made several cuts in the original libretto and score in order to accommodate the film's two-hour time limit, but these excisions are done with taste and discretion. Because of the excessive violence in the third act--two murders, a suicide, a superficial throat-slashing--Otello was released with a PG rating.",
      "tmdbMovieId": 198469,
      "avgRating": 3.50191,
      "releaseYear": "1986",
      "numRatings": 262,
      "posterPath": "/pPHMSeOVR2BVq32JP7bgcLqlSf4.jpg"
   }
}