{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "blackout",
            "id": 2583
         },
         {
            "name": "alcohol abuse",
            "id": 15237
         }
      ],
      "imdb_id": "tt0091554",
      "video": false,
      "title": "The Morning After",
      "recommendations": [
         29825,
         31618,
         69007,
         32029,
         31922,
         26674,
         214884,
         42134,
         121676,
         30707,
         1815,
         4292,
         89072,
         37431,
         32077,
         46027,
         90590,
         42090,
         109962,
         4916
      ],
      "backdrop_path": "/nWKRdOh41KeN7HcjYdvXGYKSM21.jpg",
      "revenue": 25147055,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alex Sternbergen",
               "gender": 1,
               "credit_id": "52fe44a99251416c910186b7",
               "name": "Jane Fonda",
               "profile_path": "/y1QtAxHn8XOi4cHzDRJUuvK3aFp.jpg",
               "id": 6352,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Turner Kendall",
               "gender": 2,
               "credit_id": "52fe44a99251416c910186bb",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Joaquin Manero",
               "gender": 2,
               "credit_id": "52fe44a99251416c910186bf",
               "name": "Raúl Juliá",
               "profile_path": "/nh6jWnEubiTKp61EpEYcB2lFQH0.jpg",
               "id": 27888,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Isabel Harding",
               "gender": 1,
               "credit_id": "52fe44a99251416c910186c3",
               "name": "Diane Salinger",
               "profile_path": "/kJkPiBp9tSBxlX4h1OZ1I82Q5Vi.jpg",
               "id": 5131,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Sergeant Greenbaum",
               "gender": 2,
               "credit_id": "52fe44a99251416c910186c7",
               "name": "Richard Foronjy",
               "profile_path": "/rz8GA26g2uISlcjfVOnSFby6fMw.jpg",
               "id": 47771,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Bobby Korshack",
               "gender": 2,
               "credit_id": "52fe44a99251416c910186cb",
               "name": "Geoffrey Scott",
               "profile_path": "/8DxgtLUeXVhHtdBV2fXtiinXMU2.jpg",
               "id": 157485,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Frankie",
               "gender": 0,
               "credit_id": "52fe44a99251416c910186cf",
               "name": "James 'Gypsy' Haake",
               "profile_path": null,
               "id": 584985,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Red",
               "gender": 1,
               "credit_id": "52fe44a99251416c910186d3",
               "name": "Kathleen Wilhoite",
               "profile_path": "/53qB97B6QJeMtqeENUH1TyiM9BW.jpg",
               "id": 42335,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Hurley",
               "gender": 0,
               "credit_id": "52fe44a99251416c910186d7",
               "name": "Don Hood",
               "profile_path": "/5Zk7fUvXqCCDHPBKWalqHqhuX09.jpg",
               "id": 39430,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "5865e8a39251412b84028bc1",
               "name": "Bruce Vilanch",
               "profile_path": "/fKKkIdJaf5DNhIq45F5YFJOmc85.jpg",
               "id": 119713,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a99251416c910186dd",
               "name": "Sidney Lumet",
               "profile_path": "/sOo8jatHC3heDbC2FAOteBXe3z2.jpg",
               "id": 39996,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a99251416c910186e3",
               "name": "James Cresson",
               "profile_path": null,
               "id": 1196146,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.155217,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31924,
      "vote_count": 27,
      "budget": 0,
      "overview": "Failed actress Alex Sternbergen wakes up hungover one morning in an apartment she does not recognize, unable to remember the previous evening -- and with a dead body in bed next to her. As she tries to piece together the events of the night, Alex cannot totally rely on friends or her estranged husband, Joaquin, for assistance. Only a single ally, loner ex-policeman Turner Kendall, can help her escape her predicament and find the true killer.",
      "similar": [
         17814,
         924,
         813,
         1954,
         1093,
         503,
         10025,
         840,
         527,
         9005,
         31900,
         451,
         31602,
         9809,
         8859,
         475946,
         10937,
         12521,
         21623,
         58770
      ],
      "original_title": "The Morning After",
      "runtime": 102,
      "poster_path": "/kE4hwI5zApPvvKKfE3KSpvvw0hr.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "American Filmworks",
            "id": 8310,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Lorimar Productions",
            "id": 898,
            "origin_country": ""
         }
      ],
      "release_date": "1986-12-25",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Last night she drank to forget. Today she woke up to a murder. Is he her last hope or the last man she should trust?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney Lumet"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["James Cresson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0091554/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODQyNDA3MjUwM15BMl5BanBnXkFtZTcwNzI2MTQyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jane Fonda, Jeff Bridges, Raul Julia | See full cast and crew »"],
      "reviews": [
         "It's a shame the filmmakers decided to make this a murder mystery, because the \"mystery\" is the only bad part of the film. Fonda and Bridges are both terrific, as usual, and the story of their meeting and falling in love along with the moral rebirth that love sparked in both would have made a fantastic movie. Jeff Bridges is the USA's stealth great actor: he quietly nails every role without an ounce of flash. His chemistry with Jane Fonda (hell, he has chemistry with every actress he's ever costarred with) is the best reason to watch this. Unfortunately, the heart of the plot is a lackluster murder/conspiracy story which undermines the rest. It takes \"The Morning After\" from a \"must see\" to a \"see if there's nothing better.\"",
         "Jane Fonda, Raul Julia, and Jeff Bridges are the main charactors in this suspense thriller. Jane is excellent as never-quite-made-it / has-been actress with a longterm drinking problem. Jane's falling star crashes right into Jeff Bridges who is always good as a laidback but tragically flawed loner. Lucky for Jane, Mr Bridges likes to \"fix things other people have discarded\". Raul just shines as only he can. Too bad we lost him early. Great mystery, great suspense, great acting. Another excellent video in my personal collection for rainy days. This movie has all the elements to hold up for an encore performance.",
         "While Jane's last Oscar nominated performance (before she retired from films) has its moments, the film falls apart after she takes off her blonde wig. I thought she looked like a knockout with it on. Some really well photographed scenery pops up near the first half and there's a long extended sequence that has her clean up the dead man's apartment, which is filled with many sly touches; alas the beginning is ten times better and more developed than the weak conclusion. Jeff Bridges adds a nice touch to the story but was it really wise for the Fonda character to place all her trust in a total stranger? Kathy Bates has a cameo as a neighbor before she hit the big time scaring everyone in Misery. She's on the screen maybe 10 seconds to a minute, tops. Overall, the parts, as other reviewers have stated, are juicier than the whole.",
         "I Think I´ll never see again the city of Los Angeles so beautiful like in this movie. The sky is so blue that the color seems made in a laboratory. The shining California sun gives a very lighted look to all the scenes filmed on street locations. Jane Fonda, playing an alcoholic but also a sensual lady, is brilliant too and so sexy as she was in 1971, when she won the Oscar for \"Klute\". You´ll enjoy watching \"The Morning After\", if you love LA, the sunny days and ladies like Jane Fonda.",
         "The Morning After opens with an extraordinarily effective scene prototypical of director Sidney Lumet's pared-down building of tension. As Jane Fonda crawls out of bed, we sense her hangover, one of those inordinately miserable mornings when nothing about you is sufficiently functional, and we also sense how accustomed she's become to these mornings as she is not only passably functional but also recognizes herself in the mirror and indeed spills some gin into a glass, speculating about the guy in her bed. Who is he? She doesn't comprehend the true gravity of her predicament until she turns him onto his back. She sees no cop is going to buy her story, so she attempts to remove all the evidence of her stopover. And then she rambles back out, into the intense Los Angeles light. And in a shot from high overhead, she seems like a lab rat, ensnared in some sort of a experiment. It's so well directed that we almost forget how preposterous it is to think this frame-up would ever work. This beginning promises an exceptional thriller. Alas, The Morning After never matches its initial potential, not as a thriller, at least. The narrative has some gaping disparities in it, and thrillers need to be impermeable. This one chalks various elements up to pure coincidence, the ultimate motives are flimsy at best and the fact that the body keeps reappearing like a cartoon or a take-off on The Trouble with Harry brings the movie too close to qualifying as '80s schlock for one to become seriously absorbed in the plot. But The Morning After merits a look anyhow, owing to the characters that it cultivates, and the performances of Fonda and Jeff Bridges in the two leads. She plays an alcoholic actress long past her heyday. He plays an ex-cop who happens to be fixing his car right where she topples into his back seat and implores him to get her away from there, quick. Bridges stays in a petty, manufactured shed, where he repairs appliances. This is all Fonda needs. She's a veteran of the live-fast-die-young subscription, her friends all bartenders and drag queens, her separated husband Raul Julia the most upmarket hairdresser in Beverly Hills. Nevertheless Bridges is reliable and sound, and she could do with a friend. Naturally it's axiomatic that they fall in love. The plot of The Morning After is not nearly as well captured or interesting as the day-by-day grinds of these characters. Actually, I can picture a movie that would omit the murder and just trail the genuine human development between Fonda and Bridges. The thriller filler isn't needed, although given that they used it, couldn't they have made it credible? The entire murder plot gets such slapdash treatment that perhaps I oughtn't have been startled by the big scene in which the killer's exposed. I've seen innumerable revelations in innumerable thrillers, but seldom one as transparent as this one, where the surprises are just announced in an improbable monologue. Indeed, the fact that nearly every opinion I've heard or read of this film seems unanimous in terms of James Hicks' script, including mine, even down to the 'It starts off well but then it gets really forced and jerry-built' gist, it seems pretty clear-cut what makes the film not quite work, though it'd be a misstep to write this movie off simply because the story is so rickety. It's worth making an allowance for due to the performances. Fonda and Bridges are superb in the film, and their rapport, founded on skeletons in the cupboard, bitterness and ulterior motives, gets especially remarkable. They create tangible unspoken feelings together, and they have some dialogue that feels more alive than most starry-eyed chatter in the movies. Before the schmaltzy final scene, not even close to prototypical of Lumet, there's a single shot in which all Bridges and Fonda do is face each other, and we know, and fee, that they want to have sex with each other. It's just energy, and it works wonders. I also admire how Lumet reinforces every color. Living in Los Angeles is part of the debilitating influence on the character played by Jane Fonda. All color is exaggerated: red redder, blue filters, orange hazes. He creates an L.A. comprised of vast flat surfaces of pastels and aggressively sunlit exposed areas. He traps the inebriated Fonda on this landscape like a helplessly insignificant insect sought for squashing by unknown feet, and the imagery makes the whole first hour of the movie much more ominous than it merits. Too bad they couldn't have take steps with the script.",
         "THE MORNING AFTER is one of those films that begins with an intriguing opening--JANE FONDA wakes up in bed next to a murdered man and, because she was in an alcoholic daze, can't remember even entering the man's apartment. So far, so good. Nice hook to draw the viewer in. But as the story unwinds, it becomes clear that the writers ran out of material for a substantial story about midway through. The weaknesses are offset somewhat by the good performance of JEFF BRIDGES as a helpful policeman who agrees to help Fonda solve the who-dun-it aspect of her plight. It's all beautifully staged and photographed in a sunlit Los Angeles and worth watching for the performances alone. Fonda is at her best as the worried alcoholic who refuses to believe she could have committed the crime and Bridges provides some good chemistry as a co-star. But the ending (with its revelation) is a bit disappointing after all the build-up to a conclusion. RAOUL JULIA and KATHY BATES have minor roles but the weak ending is hard to dismiss. Fonda won an Oscar nomination and deserved it for creating a dimensional character in a story thin on believable characters.",
         "This movie was much better than I had reason to expect after reading the comments on IMDb. Its biggest flaw must be the way The Morning After is marketed. It is not really a taut whodunit thriller but rather a study of a particular place in a particular era with particular characters \u0096 a dark comedy and a love drama at the same time. The second biggest flaw is the grating, almost ever present musical score. But for the rest this movie is nearly perfect. I should call The Morning After an expose of Southern California in the mid 1980s. The sets and the photography (a lot frontal or near frontal wide angle shots of curbside sceneries) are very accomplished \u0096 Schrader's American Gigolo came to mind. The sun is always shining, the air seems to be absolutely pure, even places that should be dirty (back yards, industrial sites etc.) are painted in gaudy colors and squeaky clean. But the minds of the principal protagonists are desperately foggy and muddled. California appears to be a big, decaying fake idyll. People go there to die, I once read in a novel by Nathanael West (The Day of the Locust \u0096 also made into a great, underrated California movie, by the way). And that more or less sums up the feel of it. The cast is kept wonderfully small. Jane Fonda is brilliant and she would have deserved the Oscar for this part. For several long scenes she acts alone in front of the camera and she really conveys the desperation and the natural charm of the character (and she's really attractive, too, despite the boozing). Jeff Bridges is a reliable support here. Also very good is Raul Julia as Fonda's somehow estranged husband. He plays a high end hairdresser with a snazzy salon and at times displays an unexpected but highly welcome gentlemanly charm. Until now I always thought of Sidney Lumet as an American East Coast director. It is the only one of his movies I know that is set in California. He seems to have his own way of appreciating that place. There is a director's comment on the DVD I purchased and I am looking forward to listening to that.",
         "Jane Fonda gives an incredibly nuanced performance as a spiraling down drunkard, she researched the tragic 40's star Gail Russell who drank herself to death at 36 to fully understand her characters plight of a once promising actress reduced to blackouts and infamy. Jeff Bridges is almost as strong as a stranger trying to help her out of a situation she can't even remember. The rest of the cast gives good support starting with Raul Julia on down to a pre-stardom Kathy Bates in a tiny role, the problem is that the script that all this superior work is working with is ill conceived and not terribly well directed by the usually excellent Lumet.",
         "\"The Morning After\" is a murder mystery that features romance, blackmail and suspense but it's the relationship between the story's two leading characters that provides the main focus of the action and also most of the humour and interest that make this movie so enjoyable to watch. Its opening scene is really intriguing and sets the story up brilliantly. What follows is loosely based on \"The Blue Gardenia\" (1953) and like its predecessor, this movie features a woman who was with a murder victim on the night he died, awakens the next morning unable to remember what happened and then has to put her trust in someone of whom she's not certain. Alex Sternbergen (Jane Fonda) is an alcoholic ex-actress who wakes up in a strange bed next to the corpse of a man she doesn't know and has no memory of how she got there. She's immediately convinced that the police won't believe her story because she has a history of becoming violent and suffering blackouts after her drinking binges and had even stabbed her first husband with a paring knife during one of her blackouts. In her panic, Alex heads to the airport but can't get out of L.A. because it's the Thanksgiving holiday and all the flights are booked. Feeling desperate and anxious, she gets involved in a car accident and races away from the scene into a nearby parking lot where she meets Turner Kendall (Jeff Bridges). In her efforts to escape the other irate drivers involved in the car accident, Alex gets into Turner's car and together they drive away from her pursuers. Turner's an easy-going, bigoted, ex-cop who says \"I like to repair stuff, whatever people are through with\" and works mainly on small appliances like toasters. Turner and Alex gradually get to know each other and fall in love. She doesn't know whether or not she was responsible for the dead man's murder and he tries to help her to solve the mystery. The problem is she isn't sure whether or not she can trust him, especially as her estranged husband Joaquin \"Jacky\" Manero (Raul Julia), who's a very successful hairdresser in Beverly Hills, warns her that Turner is actually trying to frame her. Alex and Turner stick together and eventually discover who the murderer is and also the extent to which blackmail was involved in the crime. \"The Morning After\" makes a strong impression visually with good use being made of interesting locations and a colour palette that uses a range of pastels quite effectively. The scene in which Alex escapes from the apartment where the killing had taken place is particularly memorable because at a time when she's feeling desperate and scared, being situated in a highly lit, deserted-looking street in which she's dwarfed by the structures around her, really emphasises her plight and reinforces the impression that, in these very open surroundings, there really is no hiding place. Jane Fonda and Jeff Bridges are both exceptional in this movie and the chemistry between them is the icing on the cake. Fonda (in an Oscar nominated role) makes Alex's combination of toughness, vulnerability and self-doubt totally believable and Bridges is wonderfully subtle in a performance that creates a lot of distrust about how sincere he is in his concern for Alex's predicament. The dialogue they share is also superb and some of Alex's cutting remarks really sting. There's a great deal to enjoy in \"The Morning After\" and the whole experience of watching it is extremely entertaining. Its only disappointment, however, is the resolution to the mystery which, unfortunately, isn't up to the standard of everything else that precedes it.",
         "The film takes place in LA in the 1980's. So you know what that means- I don't even need to say do I? Any film from the 80's has a very distinct look and while you see glimpses here and there of that era it's not too much to be distracting even if some screen time takes place in a beauty salon. The film is interesting to watch because of the actors. They all do a good job here. Jane especially. Jeff Bridges and Raul Julia also are very good here. So it is the acting, the performances that make the film. The sets too are great-they almost are a character themselves from Alex's Pink and Mauve art deco place to the low budget but homey place of Turner's garage pad. The flaws. There are some. Some of the dialog is cheesy and clichéd with laughable lines. The references to different cultures here in crude and crass terms. This was way BEFORE \"politically correct\". This is not the greatest movie but I still love it and drag it out to watch about once a year."
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": [
         "American Filmworks",
         "Lorimar Productions"
      ],
      "summaries": [
         "Alex Sternberg wakes up with a hangover and no memory of how she ended up in bed with a dead man. She flees, convinced that she has had another blackout and stabbed someone. Her only support, Turner, an ex cop and recovering alcoholic who is unsympathetic to her plight. She could believe that it is as simple as a violent act committed while drunk, except that the body keeps re-appearing.",
         "A woman wakes up next to a murdered man. Did she do it herself, and if not, is she in danger herself?"
      ],
      "budget": 0
   },
   "movielensId": 2749,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1986-12-25",
      "dvdReleaseDate": "2005-08-30",
      "directors": ["Sidney Lumet"],
      "runtime": 102,
      "movieId": 2749,
      "title": "The Morning After",
      "mpaa": "R",
      "actors": [
         "Jane Fonda",
         "Jeff Bridges",
         "Raúl Juliá",
         "Diane Salinger",
         "Richard Foronjy",
         "Geoffrey Scott",
         "James 'Gypsy' Haake",
         "Kathleen Wilhoite",
         "Don Hood",
         "Bruce Vilanch"
      ],
      "imdbMovieId": "0091554",
      "originalTitle": "The Morning After",
      "genres": [
         "Crime",
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "7EiXXSp7MIk",
         "nfd0FmrpKHg"
      ],
      "plotSummary": "Failed actress Alex Sternbergen wakes up hungover one morning in an apartment she does not recognize, unable to remember the previous evening -- and with a dead body in bed next to her. As she tries to piece together the events of the night, Alex cannot totally rely on friends or her estranged husband, Joaquin, for assistance. Only a single ally, loner ex-policeman Turner Kendall, can help her escape her predicament and find the true killer.",
      "tmdbMovieId": 31924,
      "avgRating": 3.13959,
      "releaseYear": "1986",
      "numRatings": 591,
      "posterPath": "/kE4hwI5zApPvvKKfE3KSpvvw0hr.jpg"
   }
}