{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "civil suit",
            "id": 239954
         },
         {
            "name": "apprentice lawyer",
            "id": 239955
         }
      ],
      "imdb_id": "tt0093051",
      "video": false,
      "title": "From the Hip",
      "recommendations": [
         45877,
         81844,
         30709,
         26156,
         27397,
         76297,
         69828,
         27224,
         83078,
         38966,
         62522,
         61651,
         51177,
         25010,
         96378,
         2608,
         32060,
         21332,
         34322,
         35225
      ],
      "backdrop_path": "/feNetlj9yFAAPc6u0D8UVR14fNs.jpg",
      "revenue": 9518342,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Robin 'Stormy' Weathers",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026d83",
               "name": "Judd Nelson",
               "profile_path": "/9H1TSnBEDYl59tFC1EQHccrINsp.jpg",
               "id": 21624,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jo Ann",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026d77",
               "name": "Elizabeth Perkins",
               "profile_path": "/bkdWnnrMADJcFpKAOitMjQH3uEQ.jpg",
               "id": 20,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Douglas Benoit",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026d7b",
               "name": "John Hurt",
               "profile_path": "/rpuH2YRLpxJjMxHq4T1QdOSVtlN.jpg",
               "id": 5049,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Craig Duncan",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026d7f",
               "name": "Darren McGavin",
               "profile_path": "/t9wMwRZjnZZhFAwrE6OVI0NRqAf.jpg",
               "id": 7333,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Larry",
               "gender": 0,
               "credit_id": "5a19a7660e0a264cc802e9ee",
               "name": "Dan Monahan",
               "profile_path": "/1dyNIvDWNmqYydrlstwT9tozc3a.jpg",
               "id": 64221,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Steve Hadley",
               "gender": 2,
               "credit_id": "5a19a773c3a3680b9d02b863",
               "name": "David Alan Grier",
               "profile_path": "/5tkt3qRZTco4sz604aTIarQ0m8W.jpg",
               "id": 58563,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Roberta Winnaker",
               "gender": 1,
               "credit_id": "5a19a77f0e0a264cbc02e5e6",
               "name": "Nancy Marchand",
               "profile_path": "/d9DASq3XmUsyfzSrATbAAOY7yn1.jpg",
               "id": 12957,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Phil Ames",
               "gender": 2,
               "credit_id": "5a19a78c0e0a264cbe02c6cc",
               "name": "Allan Arbus",
               "profile_path": "/6DxLQ09V5YokE1l9rxTAIRbpmWQ.jpg",
               "id": 153619,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Raymond Torkenson",
               "gender": 2,
               "credit_id": "5a19a79a0e0a264cd002d819",
               "name": "Edward Winter",
               "profile_path": null,
               "id": 157661,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Matt Cowens",
               "gender": 2,
               "credit_id": "5a19a7abc3a3680b8d02d2d9",
               "name": "Richard Zobel",
               "profile_path": null,
               "id": 147397,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "1st Judge",
               "gender": 2,
               "credit_id": "5a19a7b9925141032602eb75",
               "name": "Ray Walston",
               "profile_path": "/5N6AVWIJCBD71uZtxSTTE8ZNfkB.jpg",
               "id": 4093,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Scott Murray",
               "gender": 0,
               "credit_id": "5a19a7c50e0a264cc802ea4d",
               "name": "Robert Irvin Elliott",
               "profile_path": null,
               "id": 91821,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "2nd Judge",
               "gender": 0,
               "credit_id": "5a19a7d2925141033002c297",
               "name": "Beatrice Winde",
               "profile_path": "/gj8UhsDJ2xad8mRrO1VDsGPLdiA.jpg",
               "id": 168638,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Lt. Matt Sosha",
               "gender": 2,
               "credit_id": "5a19a7e10e0a264cbe02c714",
               "name": "Art Hindle",
               "profile_path": "/cyse2WKDJ5GXCGWGtw4CHsamv8i.jpg",
               "id": 41256,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Mrs. Martha Williams",
               "gender": 1,
               "credit_id": "5a19a7f40e0a264cc402c068",
               "name": "Priscilla Pointer",
               "profile_path": "/rmT7Qje6YBG180d1hlY6zQpZmfv.jpg",
               "id": 11793,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Mr. Wilby",
               "gender": 2,
               "credit_id": "5a19a7fc925141032c02da2f",
               "name": "Royce D. Applegate",
               "profile_path": "/clLumMCdFDvaLa8wMR5L6WkP1u6.jpg",
               "id": 22251,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026d89",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5a19a73c925141032c02d984",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5a19a7450e0a264cca02d550",
               "name": "David E. Kelley",
               "profile_path": "/hv9yx4XnWcIjy9UkLjiZ2MNr2b9.jpg",
               "id": 59650,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "5a19a74a0e0a264cbe02c67c",
               "name": "David E. Kelley",
               "profile_path": "/hv9yx4XnWcIjy9UkLjiZ2MNr2b9.jpg",
               "id": 59650,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.150764,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24081,
      "vote_count": 15,
      "budget": 0,
      "overview": "Apprentice lawyer Robin Weathers turns a civil suit into a headline grabbing charade. He must reexamine his scruples after his shenanigans win him a promotion in his firm, and he must now defend a college professor who is appearantly guilty of murder.",
      "similar": [
         1645,
         389,
         11975,
         9623,
         9800,
         392982,
         37257,
         93,
         21733,
         11560,
         881,
         1592,
         819,
         595,
         314365,
         396371,
         12219,
         37233,
         548,
         1908
      ],
      "original_title": "From the Hip",
      "runtime": 111,
      "poster_path": "/nQHjPC0BLa858pyFJ3yRTv0nvCs.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "De Laurentiis Entertainment Group (DEG)",
         "id": 484,
         "origin_country": ""
      }],
      "release_date": "1987-02-06",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Getting To The Top Means Working Like A Dog!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Bob Clark"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Bob Clark",
         "David E. Kelley"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0093051/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc4MzI5NDQxMF5BMl5BanBnXkFtZTcwODgzODQzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Judd Nelson, Elizabeth Perkins, John Hurt | See full cast and crew »"],
      "reviews": [
         "A funny, insightful script that is treated a bit too lightly by the principals. No one looks like they're taking the story seriously except John Hurt, whose performance towers above everyone else's (it's too bad he only occupies the screen for 20 or so minutes). There are the odd moments of idiocy, and the entire effect is like an above average episode of a television law drama. My favorite scene is where Judd Nelson crouches behind a table full of classic literature, tossing out books at the judge. Sometimes, Nelson doesn't quite know what his character is doing, but he manages to entertain and keep the focus on him. But the first half of the movie is farce and the second half (Hurt's story) is serious drama. At one point this is signaled by Dan Monahan, who says, \"This isn't fun anymore.\" There are some good gags throughout and the drama could hold its own if the first part of the movie weren't so long. It could have been shortened considerably to make the John Hurt story longer and more effective. I enjoyed watching this movie and would recommend it to anyone who likes television law type shows.",
         "There is no possible way to make a bad movie with Judd Nelson, Elizabeth Perkins, and David Alan Grier in starring roles. This film was written by David E. Kelley, the head writer from LA Law. The film spoofs the legal profession, and courtroom drama specifically. The film should be watched by all law students and firm associates. Ignore those who label the humor as sophomoric. The film has a great story and is extremely funny.",
         "Quite simply I love this movie, not because I have an affinity to any of the actors but simply because it's a very easy way to pass a couple of hours. For movie which attempts to broach one of the legal systems greatest dilemmas (how to defend the guilty) the screenwriters and director somehow manage to deal with the issue seriously yet without allowing the movie to become heavy and dry. You will laugh as there are many genuinely funny scenes and yet you will also appreciate the very real and serious ethical dilemma \"stormy\" finds himself in. John Hurt does steal the show somewhat with a performance that is nothing short of chilling, but the movie is not just about John and the supporting cast are pretty good as well. Criticism of Judd Nelson for this role is certainly unwarranted. If you want a nice easy watch, which you can chose to just enjoy or to actually have a proper think about then this is a very good place to start. Do yourself a favour find the movie in a bargain bin, watch it and wonder why you never bothered to see it before",
         "Don't listen to the negative reviews or nay sayers. Decide for yourself the way we did. Judd Nelson is terrific in this entertaining movie. There should've have been a sequel but unfortunately just like many other terrific movies the studio didn't market this movie AT ALL. From opening to the end you're interested in the story and colorful well written characters. Trust me -- it's a truly entertaining movie in the tradition of all of the other brat pack movies. The script is clever and the pacing swift. The movie keeps you involved and the actors never miss a beat. Nelson and Perkins have chemistry and let's hope they do another movie some day.",
         "I stumbled across this movie on a whim, and it's become one of my favorites. A great mix of drama and humor, it's fun while still maintaining the suspense of a psychological drama. Judd Nelson gives a great performance as Stormy Weathers (love his name!) and John Hurt is spooky as the crazed Benoit. The question of ethics for attorneys is a thought-provoking commentary on our justice system, and the hearing on the swear word is such great satire! I have shown this to my high school students on \"reward days\" and they have enjoyed it so much. The tension at the end is unbelievable! Truly an underrated film . . . so glad I found it on DVD!",
         "Mmm, I liked it\u0085 quite a bit. Bob Clark writes/directs this comedy courtroom drama with many screwball antics but also well managed serious elements. Having it sit in both camps could've been disastrous, but while it isn't always 100% in convening them together. I found it hard not be gripped, and trying to wipe the grin of my face. However it's a glowingly clever little concept (falling in two parts), which is brought across by Judd Nelson's bouncy performance. He plays Robin Weathers a young, brash Boston lawyer that goes about things in a very unconventional manner, but these questionable methods gets the results. Embarrassment for his firm, but everyone else loves it. So after his first big win, he joins the firm's partnership and then finds himself dumped with a murder case which he has no hope of winning. This was purposely done, so his partners could get rid of him. The smart-lipped script is very agreeable with the smooth flowing pace and playful score adding to the amusing diversions. The comical interplay is quite heavy with ballistic energy in the early stages as the courtroom is a show-stopping circus of noisy gags (which has great snappy performance from Ray Walston as the judge of the courtroom), but when it gets to the main case that's when those dramatic aspects mingle in (like its stinging if transparent climax), but never leaving the theatrically colorful zinger and humour behind. Clark makes it work, as it's never over-cooked and has a purpose to steering the action and situations. John Hurt is amazing as the intensely cocky defendant that Nelson's character must try to acquit. There's fine support from the likes of Darren McGavin, Dan Monahan, David Alan Grier, Nancy Marchand and undoubtedly lovable Elizabeth Perkins (whose beautiful smile simply lights up a room). A novel crowd-pleaser that's always thinking on its feet.",
         "Engaging comedy/drama with a courtroom background. Has a sharp shift in tone between the first half and the second which makes sense in the course of the story but it is a quite a detour for the viewer to adjust to. Judd Nelson has a certain charm but is not the most charismatic leading man but he is surrounded by quality performers who contribute excellent performances. Elizabeth Perkins is fetching as Nelson's fiancée. Nancy Marchand the wry head of Stormy Weathers law firm providing a calm center when she's on screen. Darren McGavin and Alan Arbus each have a chance to sprinkle some funny bits to their scenes and Edward Winter has a high old time in a small role as a hot tempered bank president. But there are two actors who really stand out. First is Ray Walston as the judge in the initial trial whose flummoxed reactions are priceless and particularly John Hurt, exquisite as a seemingly benign college professor whose facade masks the fact that he's a homicidal maniac stealing every one of his scenes. Not a great movie but a good one with a lively pace, just be prepared for that sudden change in the feeling of the film.",
         "Hurt shows himself as the force that brought this film it's best area of presentation. Especially when describing how one would work upon a 'posiable' victim. 'The Stormy Weathers' part is very amusing with his two side kicks, and his love interest is very predictable. The plot seemed to forgo the usual nonsensical areas and showed why 'lawyers' should also not only eat their own, but could use a taste of honesty in their pursuits. I found this film to be very entertaining. It has an unusual method in the plot twists that most melodramas have. This film makes a presentation of values that should matter, but seldom do in real life situations.",
         "FRom the hip it a great comedy because. starts goods gets going faster the hummer is so funny at the first half. starts as a comedy then goes into a drama. tries to go into a drama then goes back to comedy in the second half . I think it should have stayed with the comedy it was the best part . It did all right with the drama it slowed the move right down when it started to go to the drama side then went back to the comedy then back. JUDD nelson did a great job on this movie he really got his teeth into it i really thought he was a lawyer.so did the rest of the cast. i don't think there was a wrong actor in it . i recommend this movie a MUST SEE.",
         "This is Bob Clark's cleverist and best film as a writer/director. The casting is superb (especially Judd Nelson and John Hurt), the story is incredibly clever in it's construction (I defy anyone to figure out the ending prior to the final scene !), the humour is very-well inter-woven into a very inticate, and challenging drama. The film really does expose the moral/ethical dilemas faced by a defence attourney, when faced with defending a particularly difficult and vicious murder case. I won't disclose too many details as it would ruin the film, but if you enjoy a thought-provoking yet very funny and hugely entertaining court-room drama..... then WATCH THIS FILM IMMEDIATELY !!!!!!!!!"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "De Laurentiis Entertainment Group (DEG)",
         "Indian Neck"
      ],
      "summaries": ["Apprentice lawyer Robin Weathers turns a civil suit into a headline grabbing charade. He must reexamine his scruples after his shenanigans win him a promotion in his firm, and he must now defend a college professor who is appearantly guilty of murder."],
      "budget": 0
   },
   "movielensId": 2751,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1987-02-06",
      "dvdReleaseDate": "2001-10-09",
      "directors": ["Bob Clark"],
      "runtime": 111,
      "movieId": 2751,
      "title": "From the Hip",
      "mpaa": "PG",
      "actors": [
         "Judd Nelson",
         "Elizabeth Perkins",
         "John Hurt",
         "Darren McGavin",
         "Dan Monahan",
         "David Alan Grier",
         "Nancy Marchand",
         "Allan Arbus",
         "Edward Winter",
         "Richard Zobel",
         "Ray Walston",
         "Robert Irvin Elliott",
         "Beatrice Winde",
         "Art Hindle",
         "Priscilla Pointer",
         "Royce D. Applegate"
      ],
      "imdbMovieId": "0093051",
      "originalTitle": "From the Hip",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["xPjkWFB4FwY"],
      "plotSummary": "Apprentice lawyer Robin Weathers turns a civil suit into a headline grabbing charade. He must reexamine his scruples after his shenanigans win him a promotion in his firm, and he must now defend a college professor who is appearantly guilty of murder.",
      "tmdbMovieId": 24081,
      "avgRating": 2.99271,
      "releaseYear": "1987",
      "numRatings": 343,
      "posterPath": "/nQHjPC0BLa858pyFJ3yRTv0nvCs.jpg"
   }
}