{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cheating wife",
            "id": 11501
         },
         {
            "name": "hitchcockian",
            "id": 155440
         }
      ],
      "imdb_id": "tt0092627",
      "video": false,
      "title": "The Bedroom Window",
      "recommendations": [
         31618,
         56669,
         5127,
         93862,
         42176,
         67307,
         44326,
         25269,
         32035,
         34028,
         161460,
         40833,
         36915,
         42010,
         4925,
         1793,
         170400,
         31922,
         88818,
         37296
      ],
      "backdrop_path": "/4a44Zjka8SuY4bnR7dMvnSjIJKM.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Terry Lambert",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065b85",
               "name": "Steve Guttenberg",
               "profile_path": "/utLqKSEN9TX3EniBlX4BpytDunB.jpg",
               "id": 26472,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Denise",
               "gender": 1,
               "credit_id": "52fe46f79251416c91065b8d",
               "name": "Elizabeth McGovern",
               "profile_path": "/egt1d836NcYDTeiokz5Im8gHU4r.jpg",
               "id": 4513,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sylvia Wentworth",
               "gender": 1,
               "credit_id": "52fe46f79251416c91065b89",
               "name": "Isabelle Huppert",
               "profile_path": "/wGG9v1Uci3sfrbjt0bRXkLrTqjY.jpg",
               "id": 17882,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Collin Wentworth",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065b91",
               "name": "Paul Shenar",
               "profile_path": "/1atzShPqdjNPAJ8J3do03ygrY2S.jpg",
               "id": 1165,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Det. Quirke",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065b95",
               "name": "Carl Lumbly",
               "profile_path": "/u6zmYwEWmCsVjrSsE6e5MUVtGHI.jpg",
               "id": 29382,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Henderson's Attorney",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065b99",
               "name": "Wallace Shawn",
               "profile_path": "/oGE6JqPP2xH4tNORKNqxbNPYi7u.jpg",
               "id": 12900,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Det. Jessup",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065b9d",
               "name": "Frederick Coffin",
               "profile_path": "/knyrsXPtKDU8F3Rp1ZGuGRHfxAe.jpg",
               "id": 28416,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Carl Henderson",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065ba1",
               "name": "Brad Greenquist",
               "profile_path": "/8rclBoyMrNwWRnUs5iPLTengKAk.jpg",
               "id": 56267,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "State Attorney Peters",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065ba5",
               "name": "Robert Schenkkan",
               "profile_path": "/bZ88GIuBcAm32CjT64NGnY8oMQN.jpg",
               "id": 53972,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Pool Player",
               "gender": 2,
               "credit_id": "52fe46f79251416c91065ba9",
               "name": "Maury Chaykin",
               "profile_path": "/jhJgkb5P0oAW7QtULjqD2kaN0ez.jpg",
               "id": 7868,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Dancing Girl",
               "gender": 1,
               "credit_id": "52fe46f79251416c91065bad",
               "name": "Sara Carlson",
               "profile_path": null,
               "id": 933236,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46f79251416c91065bb3",
               "name": "Curtis Hanson",
               "profile_path": "/e8o4pYzVjh4ier1n0bxD78HCbxg.jpg",
               "id": 323,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46f79251416c91065bb9",
               "name": "Curtis Hanson",
               "profile_path": "/e8o4pYzVjh4ier1n0bxD78HCbxg.jpg",
               "id": 323,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe46f79251416c91065bbf",
               "name": "Anne Holden",
               "profile_path": null,
               "id": 933237,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 5.935103,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 39074,
      "vote_count": 23,
      "budget": 0,
      "overview": "Terry Lambert is sleeping with Sylvia, the wife of his boss. One night, while in Terry's apartment, Sylvia witnesses a man assault a young woman, Denise, on the road below. Not wanting to reveal her affair with Terry, she keeps quiet. Terry instead steps forward, trying to help nab the criminal. However, he never saw the suspect and, when his lies are uncovered, the police begin to suspect his motives.",
      "similar": [
         845,
         28902,
         2768,
         4808,
         11033,
         19997,
         65057,
         8088,
         50124,
         10363,
         294795,
         235271,
         24402,
         16227,
         55580,
         301372,
         89455,
         20009,
         11603,
         12535
      ],
      "original_title": "The Bedroom Window",
      "runtime": 112,
      "poster_path": "/1V55KCCTY3hNTJgjK6DZ5w1qO96.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "De Laurentiis Entertainment Group (DEG)",
         "id": 484,
         "origin_country": ""
      }],
      "release_date": "1987-01-16",
      "vote_average": 6.1,
      "belongs_to_collection": null,
      "tagline": "A violent crime. A secret affair. A single witness. And nothing is what it appears to be through... The Bedroom Window",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Curtis Hanson"],
      "runtime": 112,
      "synopsis": null,
      "writers": [
         "Anne Holden",
         "Curtis Hanson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092627/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUyODQ1MTQ0OF5BMl5BanBnXkFtZTcwNTcxODkzMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Steve Guttenberg, Elizabeth McGovern, Isabelle Huppert | See full cast and crew »"],
      "reviews": [
         "Sometimes, people do the wrong thing, for a good reason. This isn't always right, but it's understandable. I think this is the premise for The Bedroom Window. People are human, and sometimes irrational behavior leads to something that can get more serious than originally anticipated. That is exactly what happens in this movie. Terry Lambert, played by Steve Guttenberg in what may just be his best performance, is a good man whose judgment isn't always the greatest. Terry is a business executive who makes the unwise decision of having an affair with his boss's wife, a beautiful french woman named Sylvia. One night at his apartment, she witnesses a young man assaulting a female. Obviously, she cannot go forward. Later, after learning of a different female being murdered near the scene that same night, he decides he'll go forward and report that he was the witness. \"It's my apartment, my bedroom window,\" he says in an attempt to justify the dishonesty. The only problem, which proves to be a damaging blow, is that nothing can be proved about the murder. So, the only chance to convict the assailant is to prosecute on the assault case. The logic being it at least gives the authorities a chance to put the killer away to prevent him from hurting anyone else, while still hoping to find evidence connecting him to the murder. So Terry must testify during the trial that he witnessed the assault. In a brilliant scene, the defendant's attorney carves him up like an overcooked turkey, making it very clear that Terry is lying, but not why. As the authorities become suspicious of Terry, he begins to bond, through shared experience, with Denise, the woman who was assaulted outside his apartment. She later figures out that Sylvia, and not Terry, saw the murder. \"The question isn't What am I going to do? It's what are you going to do? And what is she going to do?,\" she says harshly and angrily, but not at all incorrectly. They both later discover, at least partially, the killer's motives, and agree that the only way to implicate him, and clear Terry, is to trap him and catch him in the act. Steve Guttenberg is magnificent as the scared, confused, and conscientious Terry. Elizabeth McGovern and Isabelle Huppert are equally as good as the women who care about him, but are unsure how to figure him out, or what to do. McGovern shows her very good acting ability with non-verbals that demonstrate clearly that she knows something isn't right about Terry through her facial expressions and the looks in her eyes. The cast of this movie work together like a well-oiled machine, and the story may not have been as compelling had it not been for the convincing actors. This is writing at its best, top notch acting, and filmmaking on a master scale. The movie is so well-made that we love the story, understand the characters and their situations, and just can't wait to see what happens next. This movie is a classic, and also a great thriller. Watch it!",
         "Directed by future phenom Curtis (L.A. Confidential, Wonder Boys) Hanson, THE BEDROOM WINDOW is an elegant Hitchcock homage, and an example of good 1980s moviemaking. Its got a certain vibe, thanks to terrific cinematography by the great Gilbert Taylor, production design by Ron Foreman, and expert direction by Hanson. REAR WINDOW it ain't, but this jazzy film is still worth a look. Lighten up folks!",
         "Steve Guttenberg, (Terry Lambert) plays the role as a guy who gets himself involved with a sexual romance with his boss's wife and while they are making out in bed, there is a scream from a woman outside their window. The woman goes to the window naked and observes a woman being attacked and identifies the rapist and tells her lover all about it. Terry decides to report the incident to the police and says that he observed the entire sexual assault because he doesn't want his boss to find out about his affair with his wife. Elizabeth McGovern, (Denise) is the woman who is attacked and she gets herself deeply involved with Terry Lambert and she even goes to bed with him. There is plenty of twists and turns to this mystery and I cannot go into more details without giving away some very dark secrets to this film. This is a good film and well worth spending your time to watch. Enjoy.",
         "A young man named Terry Lambert (Steve Guttenberg) has a romantic fling with his bosses' wife. With their bedroom \"activities\" in progress, an outside assault occurs that gets Lambert involved, ultimately in murder. The film's underlying \"all for love\" theme is not really credible. Plot contrivances, along with incredulous coincidences and improbable timing imply a screenplay that was not well thought out. Further, the lead role in this film calls for a serious actor who can express some feeling. \"Police Academy\" Guttenberg, boyish and goofy looking, does not lend credibility to the role. That, combined with a dubious script closes any window of believability in this overwrought thriller. And that's too bad because \"The Bedroom Window\" does present a fairly engaging noir look, as a result of some great lighting and camera work. Production design is also quite good. The film's visual style is about all I can recommend in the way of interest. The ending is rather melodramatic, and includes some unintentional humor in some scenes that involve a man in a phone booth.",
         "The bedroom window is a brilliant Hitchcock style thriller.Brad Greenquist is excellent as Henderson.He has an innocent look with some of his expressions that can make other people think that he doesn't look like the kind of person who would kill,but he quietly gives terrifying looks as well.It is amazing that he hardly speaks in the film,and yet gives such a powerful performance.I liked his look in the film,with his red hair and pale skin.I would like to see more of Brad's films,as this is the only film i have seen him in so far. Steve Guttenberg also gives a good performance as Terry Lambert.Elizabeth McGovern gives a very emotional performance as the victim,Denise,and Isabelle Hubert plays Terry's lover,Silvia,very well too. * SPOILER * I haven't seen many thrillers,especially in recent films,where there hasn't been any graphic,gory,and violent scenes to show the killings.There are no scenes like that in this film,it just mentions the killings but doesn't actually show them.The only killing it shows is of sylvia,but you only see her after she has been killed.The film is just full of suspense.I love that it is an old fashioned style thriller too.I think its much better than other thrillers that are around today.I don't think thrillers need to be graphic and violent. I also love the soundtrack to this film.I haven't seen it available to buy anywhere.I would love to buy it I give this film 10/10 for amazing performances from superb actors,an interesting story and a great soundtrack",
         "This thriller would have made a great Hitchcock movie. As it stands, it's not too bad but it could have been so much better. However, any film that can engage the attention for nearly two hours must have something going for it and this does have an intriguing story line. It also has the advantage of a good cast, Steve Guttenberg is his usual affable self doing the wrong thing for the right reasons, Elizabeth McGovern brings a wonderful hard edge to her performance and Isabelle Huppert is beautiful but nasty. Brad Greenquist manages to imbue his role with a sinister quality without saying barely a word. The plot doesn't really hold up unfortunately and there are plenty of scenes that stretch credulity just too far. However if you are prepared to accept the film on just a surface level you will find yourself nicely entertained.",
         "This is the kind of thriller you'd expect Alfred Hitchcock to do with someone like James Stewart or Cary Grant as everyman. Here we have STEVE GUTTENBERG as the man in big trouble after witnessing a murder from his lover's bedroom window. He's having an affair with the boss' wife and nobly tells her that he'll give details of the assailant (which she saw) to keep their affair hidden from her husband. So far, so good. The story is stylishly photographed with the appropriate menacing mood and atmosphere. But he soon becomes the man suspected of the crime and it's from that point on that the plot contrivances become just a little too implausible, straining credibility until the very suspenseful ending. Too bad. Otherwise, it's a tricky piece of entertainment and well worth watching. ISABELLE HUPPERT has a little trouble getting her lines across with her French accent being quite a handicap but she's beautiful to look at. ELIZABETH McGOVERN does a nice job as Guttenberg's partner in finding the real killer. It moves quickly under writer/director CURTIS HANSON's direction. While many consider it \"counterfeit Hitchcock\", it's still worth a look.",
         "Although he rarely gets respect from the critics, Steve Guttenberg was quite a big film star in the 1980's. He made his first impression as a pudgy teenager who gets killed by Gregory Peck in the excellent \"Boys From Brazil\"(1978). The classic \"Diner\"(MGM,1982) established him as a fine actor and in \"Police Academy\"(1984) he was suddenly a buff leading man in a critically maligned yet audience loved box office blockbuster. He was now a \"STAR\" and the smash hits kept coming: several \"Police Academy\" sequels, \"Short Circuit\"(1985) and its sequel, the Oscar-winning classic Ron Howard's \"Coccoon\"(Universal, 1985) whose pool scene established him as a minor sex symbol, and finally the massive blockbuster \"Three Men and a Baby\"(Disney, 1987). Director/writer Curtis Hanson then cast him in the excellent Hitchcockian thriller \"The Bedroom Window\"(1987) alongside another young star of the time Elizabeth McGovern who had made a major impact in \"Ragtime\"(Paramount, 1981). Now he was a full-fledged star of a Top \"A\" quality film. This excellent thriller will keep you glued to screen. Hanson's taut direction, the gorgeous cinematography, and the excellent cast will hold your attention. The script has a couple holes but it is still very good. And Guttenberg who had a goofy face and could look geeky if not photographed carefully looks great so this should have been another feather in his cap. However this film tanked. Why I will never know. After this he would have one more big hit with \"Three Men and a Little Lady\"(Disney, 1990) and that was it. His career never recovered. Nonetheless his best films are definitely worth a look and \"The Bedroom Window\" is certainly among his best.",
         "\"The Bedroom Window\" is an entertaining and well paced psychological thriller that's intriguing throughout and also successful in generating moments of real tension, especially towards the latter part of the film. Made ten years before Curtis Hanson's best movie (L.A.Confidential), this offering is distinctly Hitchcockian with components such as \"the wrong man theme\", \"the disguise motif\" and similarities to \"Rear Window\" and \"The Man Who Knew Too Much\". The plot contains a number of interesting twists and Hanson (who also wrote the screenplay based on Anne Holden's novel \"The Witnesses\") directs the action with great skill and subtlety and in the process creates a rather ominous atmosphere. Baltimore businessman Terry Lambert (Steve Guttenberg) is having an affair with Sylvia Wentworth (Isabelle Huppert) who happens to be his boss' wife. One night after a company party, they go to Terry's apartment together and sometime during the early hours of the morning, Terry goes to the bathroom and Sylvia is attracted to the window when she hears screams outside. She sees a young woman being attacked by a red haired man who runs away as soon as he realises that he's being watched. When the couple learn that another woman has been attacked and murdered a short distance away, they want to tell the police what they saw in the hope that the culprit will be arrested. Sylvia, however, doesn't want to be directly involved because doing so would threaten her marriage and jeopardise Terry's job. Terry decides to report what they know to the police and pretends that he'd seen the attack. After giving a statement, he attends a line-up of apparent suspects but is unable to make an accurate identification for obvious reasons. At the line-up, the victim of the attack, Denise (Elizabeth McGovern), is also unable to identify her attacker. Terry's convinced from Sylvia's description that the attacker is a man called Henderson (Brad Greenquist) who he then starts to follow and keep under surveillance. Later, when Henderson is brought to trial, his defence attorney easily discredits Terry's testimony and because he is being prompted in court by Sylvia, it becomes clear to both Henderson and Denise that Terry didn't actually witness the attack. Henderson is acquitted and it isn't long before Terry becomes the police's new suspect. He then joins forces with Denise who believes in his innocence and together they embark on a plan to prove the guilt of the real killer. Terry seems confident and capable in his workplace and is a good natured guy who's anxious to do the right thing. He's also incredibly naive as he underestimates the professionalism of the police and the defence attorney and repeatedly gets out of his depth and puts himself in great danger. Steve Guttenberg conveys his character's gullibility convincingly and frequently looks as if he doesn't understand the seriousness of what's happening or the level of danger to which he's exposing himself. Sylvia is a cold character whose only concerns are to look after her own interests and Isabelle Huppert looks suitably controlled and calculating in her role. Elizabeth McGovern is particularly good in portraying Denise's amusing combination of toughness and warmth as she falls for Terry and also takes part in a very dangerous scheme to reel in the killer. Ultimately this is an enjoyable movie with a great set up, a number of nice twists and a good deal of suspense.",
         "Baltimore architect Steve Guttenberg (as Terrance \"Terry\" Lambert) quickly hides a former bedmate's bra to prepare for a sexual visit from French blonde Isabelle Huppert (as Sylvia), who happens to be his boss' wife. The risky encounter is satisfying for both players. After copulating, Mr. Guttenberg shows off his buttocks while rising to visit the bathroom. Upon hearing a scream from outside the window, Ms. Huppert likewise shows her cheeky behind. The scream turns out to be barmaid Elizabeth McGovern (as Denise Connelly), assaulted by red-haired rapist-murderer Brad Greenquist (as Chris Henderson)... Through \"The Bedroom Window\", Huppert gets a good look at the perpetrator. But she cannot go to the police because husband Paul Shenar (as Collin Wentworth) would discover her affair with Guttenberg. To solve the problem and help catch the criminal, they decide Guttenberg will claim he saw the attack and gives the police Huppert's description. Of course, things don't go according to plan... This is an enjoyable homage to Alfred Hitchcock's \"Rear Window\" (1954) and others, with director Curtis Hanson, photographer Gilbert Taylor and Guttenberg contributing great flair. The segment visualizing Guttenberg's hearsay description of a murder could have been dropped, and the courtroom sequence reconsidered - but a few missteps do not detract from \"The Bedroom Window\" being a consistently engaging, entertaining and occasionally exciting thriller. ******* The Bedroom Window (1/16/87) Curtis Hanson ~ Steve Guttenberg, Elizabeth McGovern, Isabelle Huppert, Brad Greenquist"
      ],
      "genres": [
         "Crime",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["De Laurentiis Entertainment Group (DEG)"],
      "summaries": ["Terry is having an affair with his boss' wife Sylvia. One night after an office party they are together and Sylvia witnesses an attack on Denise from Terry's bedroom window. She doesn't want to expose their relationship and so is reluctant about talking to the police. Terry, wanting to help, gives the police the description of the attacker. He soon becomes the main suspect in the case. He then sets to find the real rapist/killer with some help from victim Denise."],
      "budget": 0
   },
   "movielensId": 2753,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-01-16",
      "dvdReleaseDate": "2000-07-11",
      "directors": ["Curtis Hanson"],
      "runtime": 112,
      "movieId": 2753,
      "title": "The Bedroom Window",
      "mpaa": "R",
      "actors": [
         "Steve Guttenberg",
         "Elizabeth McGovern",
         "Isabelle Huppert",
         "Paul Shenar",
         "Carl Lumbly",
         "Wallace Shawn",
         "Frederick Coffin",
         "Brad Greenquist",
         "Robert Schenkkan",
         "Maury Chaykin",
         "Sara Carlson"
      ],
      "imdbMovieId": "0092627",
      "originalTitle": "The Bedroom Window",
      "genres": [
         "Crime",
         "Thriller",
         "Mystery"
      ],
      "youtubeTrailerIds": ["dP_XWJ9K5y0"],
      "plotSummary": "Terry Lambert is sleeping with Sylvia, the wife of his boss. One night, while in Terry's apartment, Sylvia witnesses a man assault a young woman, Denise, on the road below. Not wanting to reveal her affair with Terry, she keeps quiet. Terry instead steps forward, trying to help nab the criminal. However, he never saw the suspect and, when his lies are uncovered, the police begin to suspect his motives.",
      "tmdbMovieId": 39074,
      "avgRating": 3.19648,
      "releaseYear": "1987",
      "numRatings": 341,
      "posterPath": "/1V55KCCTY3hNTJgjK6DZ5w1qO96.jpg"
   }
}