{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "witch",
            "id": 616
         },
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "monster",
            "id": 1299
         },
         {
            "name": "babysitter",
            "id": 2604
         },
         {
            "name": "fairy tale",
            "id": 3205
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "impalement",
            "id": 11579
         },
         {
            "name": "werewolf",
            "id": 12564
         },
         {
            "name": "cult film",
            "id": 34117
         }
      ],
      "imdb_id": "tt0092850",
      "video": false,
      "title": "Deadtime Stories",
      "recommendations": [
         27630,
         30656,
         28762,
         70878,
         58797,
         28522,
         89345,
         24789,
         28450,
         198757,
         29852,
         27675,
         26554,
         45878,
         47892,
         34125,
         52017,
         53150,
         44936,
         24925
      ],
      "backdrop_path": "/aT1fNIH0uTpezfpxyq5HV3sbSvI.jpg",
      "revenue": 2750741,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1001,
               "character": "Peter",
               "gender": 2,
               "credit_id": "52fe4730c3a368484e0b98bd",
               "name": "Scott Valentine",
               "profile_path": "/rpuoosMHy5bALNvAOzN8ucL0k3k.jpg",
               "id": 24519,
               "order": 0
            },
            {
               "cast_id": 1002,
               "character": "Rachel (Red Riding Hood)",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98c1",
               "name": "Nicole Picard",
               "profile_path": null,
               "id": 68362,
               "order": 1
            },
            {
               "cast_id": 1021,
               "character": "Willie (Werewolf)",
               "gender": 0,
               "credit_id": "58d1cd3b9251411a9f012cef",
               "name": "Matt Mitler",
               "profile_path": null,
               "id": 99037,
               "order": 2
            },
            {
               "cast_id": 1004,
               "character": "Goldi Lox",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98c9",
               "name": "Cathryn de Prume",
               "profile_path": "/lMmyGDWy6FntWTLc5aQp3jWDQRW.jpg",
               "id": 163013,
               "order": 3
            },
            {
               "cast_id": 1005,
               "character": "Judith 'MaMa' Baer",
               "gender": 1,
               "credit_id": "52fe4730c3a368484e0b98cd",
               "name": "Melissa Leo",
               "profile_path": "/fcDdsUAyp7DZEi4UEzGXZEjXlUC.jpg",
               "id": 6832,
               "order": 4
            },
            {
               "cast_id": 1006,
               "character": "Miranda",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98d1",
               "name": "Kathy Fleig",
               "profile_path": null,
               "id": 557113,
               "order": 5
            },
            {
               "cast_id": 1007,
               "character": "Hanagohl",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98d5",
               "name": "Phyllis Craig",
               "profile_path": null,
               "id": 557114,
               "order": 6
            },
            {
               "cast_id": 1008,
               "character": "Uncle Mike",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98d9",
               "name": "Michael Mesmer",
               "profile_path": null,
               "id": 557115,
               "order": 7
            },
            {
               "cast_id": 1009,
               "character": "Little Brian",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98dd",
               "name": "Brian DePersia",
               "profile_path": null,
               "id": 557116,
               "order": 8
            },
            {
               "cast_id": 1010,
               "character": "Beresford 'Papa' Baer",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98e1",
               "name": "Kevin Hannon",
               "profile_path": null,
               "id": 557117,
               "order": 9
            },
            {
               "cast_id": 1011,
               "character": "Wilmont 'Baby' Baer",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98e5",
               "name": "Timothy Rule",
               "profile_path": null,
               "id": 557118,
               "order": 10
            },
            {
               "cast_id": 1012,
               "character": "Florinda",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98e9",
               "name": "Anne Redfern",
               "profile_path": null,
               "id": 557119,
               "order": 11
            },
            {
               "cast_id": 1013,
               "character": "Vicar",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98ed",
               "name": "Casper Roos",
               "profile_path": null,
               "id": 557120,
               "order": 12
            },
            {
               "cast_id": 1014,
               "character": "Seductress",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98f1",
               "name": "Barbara Seldon",
               "profile_path": null,
               "id": 557121,
               "order": 13
            },
            {
               "cast_id": 1015,
               "character": "Seductress",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98f5",
               "name": "Leigh Kilton",
               "profile_path": null,
               "id": 198227,
               "order": 14
            },
            {
               "cast_id": 1016,
               "character": "Grandma",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98f9",
               "name": "Fran Lopate",
               "profile_path": null,
               "id": 1188008,
               "order": 15
            },
            {
               "cast_id": 1017,
               "character": "Greg",
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98fd",
               "name": "Michael Berlinger",
               "profile_path": null,
               "id": 1188010,
               "order": 16
            },
            {
               "cast_id": 1022,
               "character": "Strangling Man",
               "gender": 0,
               "credit_id": "58d1cd7bc3a36838df0117bb",
               "name": "Jeffrey Delman",
               "profile_path": null,
               "id": 1088198,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4730c3a368484e0b98b9",
               "name": "Jeffery Delman",
               "profile_path": null,
               "id": 557111,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "537f4f7ac3a368059e0034a2",
               "name": "Jeffrey Delman",
               "profile_path": null,
               "id": 1088198,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "537f4f8fc3a36805920032e2",
               "name": "J. Edward Kiernan",
               "profile_path": null,
               "id": 1323300,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "537f4fa0c3a36805a80031f9",
               "name": "Charles F. Shelton",
               "profile_path": null,
               "id": 1323302,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 0.741273,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 66194,
      "vote_count": 10,
      "budget": 0,
      "overview": "A babysitting uncle tells his charges three horror stories--about a killer witch, Little Red Riding Hood and a werewolf, and a story about \"Goldi Lox\" and the three bears.",
      "similar": [
         948,
         5876,
         7191,
         8810,
         793,
         2667,
         841,
         411,
         58,
         141,
         124905,
         767,
         290595,
         224141,
         49730,
         75761,
         814,
         11564,
         11342,
         24920
      ],
      "original_title": "Deadtime Stories",
      "runtime": 93,
      "poster_path": "/7T4CqLmzLkZyqSh7ny4JhcBo91Z.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Overseas FilmGroup",
            "id": 888,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Scary Stuff",
            "id": 23792,
            "origin_country": ""
         }
      ],
      "release_date": "1986-04-13",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "You made your bed... now die in it!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeffrey Delman"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Jeffrey Delman",
         "J. Edward Kiernan"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0092850/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODc5NDcxMDAwNl5BMl5BanBnXkFtZTYwMTU3Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Scott Valentine, Nicole Picard, Matt Mitler | See full cast and crew »"],
      "reviews": [
         "I recently made it a point to try and see every horror anthology movie I know about. Having neared the end of my \"mission\", \"Deadtime Stories\" sticks out as being surprisingly good. Creative effects, clever stories, and just the right amount of dark humor make this one a great movie to watch. To start with, the wraparound story, while being somewhat tried, is dramatically saved by the character of the sleazy uncle. All he's trying to do is get his nephew to fall asleep so he can watch the Miss Nude competition. His introduction to the Runninghood story is terrific. I must have missed getting to hear THOSE fairy tales when I was a child. The first story is the darkest of the three, Peter and the Witches. Its highlights are a hot blonde with big breasts and a stomach-churning sequence of a fully-regenerating body. It has a chilling ending, with an intentionally-corny \"alternate\" ending told by the uncle to satisfy his bratty nephew. The second story is a clever variation of Little Red Riding Hood. Here Red Riding Hood is dubbed \"Runninghood\", and is, as the uncle graphically describes, a high school senior with firm breasts. The wolf is a werewolf, who attacks the girl's grandmother while our title heroine goes and has sex with her boyfriend (the woodsman). Even more interesting is if you know that the original Riding Hood fairy tale is largely a metaphor for a young woman's first sexual experience. The third story is the best, offering the perfect combination of horror and dark humor. In Goldi Lox and the Three Baers, \"Papa\" Baer and his mentally-retarded son \"Baby\" Baer escape from an asylum (whose name I won't give away, but it immediately tells you that the segment is going to be funny) with \"Mama\" Baer's help and find that the murderous Goldi Lox, who has Carrie-like telekinetic powers, is living in their old house. The feuding Captains Jack B. Nimble and Jack B. Quick of the police department successfully bungle their effort to capture the group, and the four go on their merry way at the end. Several parts are funny in this one, particularly when Goldi Lox and Baby Baer have \"sex\". Some of the humor is subtle, too. I almost didn't catch the \"plainclothes vehicles\" part. I quite enjoyed this one. Just one problem, though. You don't find out who won the Miss Nude pageant! 8/10.",
         "So, to tell the truth, the first reason I wanted to see this film was to see that actor from FAMILY TIES in a gross-out horror film. But, despite a few cheesy effects, this film is two-thirds a dud. The first story, about witches, is a wash-out. The second story, a parody on Little Red Riding Hood, was better paced, but still lacking in any real dramatic thrust(except for that of Red, when she meets up with her boyfriend). This is the one that Scott Valentine is in, and although an improvement on the first story, it still bit the big one. The third story, however, works. Goldi Lox is a psycho, and the Bears are thieves. This makes for a perfect coupling, until sex comes into play. Then, things get nasty. This segment is the best of the three stories, and maybe if the other two stories had been as strong(and funny), the overall film would've been better. As it stands, however, DEADTIME STORIES isn't exactly the best way to spend 90 minutes. It is slow in many sections, and the low budget is evident. But, if you don't mind fast-forwarding about an hour, the Goldi Lox story is a real hoot. Otherwise, THE OFFSPRING is a far more superior anthology film.",
         "To truly enjoy horror films I think you have to set other movie criteria aside. Let's face it horror wasn't created to win any Oscars, it is in a league of its own. Deadtime Stories is fun for what it is a b-horror movie with a cheesy, yet lovable twist. The whole idea of twisted fairy tales is intriguing and some of them are actually quite good re-telling in particular Little Red Riding Hood. Deadtime Stories is definitely not for the more serious movie watcher but if you enjoy gore with only the slightest bit of substance then buy it, you won't be sorry.",
         "A little boy begs his uncle to tell him bedtime stories. The uncle does, but gives them all macabre twists in this fair-to-middling anthology film. \"Peter And The Witches\" is about a young man (Scott Valentine) who is a slave to two witches. This segment is slow and almost plot less. \"Little Red Runninghood\" has a high school girl in a red jogging outfit picking up medicine for her sick grandma at the drug store. She's given the wrong prescription, and the man the medicine belongs to has a very special reason for needing it before the full moon (hint, hint). You'll guess the punchline, but it's still a funny segment. \"Goldi Lox And The Three Baers\" is a very broad, very black comedy about a telekinetic young woman (the very sexy Catheryn DePrume) and a homicidal family - Papa Baer, Mama Baer and Baby Baer - that team up together and go on a crime spree. Sort of a R rated Looney Tunes cartoon, this is the best segment of the film. Perhaps not the best horror anthology around, it's still amusing in spots. Apparently this movie was shot over the course of four years. The British title is Freaky Fairy Tales.",
         "The quote in this comment's subject line illustrates a beautiful example of what the dialogues sound like in this oddball and ultimately cheesy 80's horror anthology based on fairy-tales and children's bedtime stories. The sequence involves an elderly lady trapped in her house with a werewolf outside. She tries scaring him away by assuring him she has a meat clever and she knows how to use it! No offense granny, but meat cleavers usually don't come with manuals and everyone knows how to use them! You just pick them up and chop! Anyway, we're rambling off the subject\u0085 \"Deadtime Stories\" has a fairly ingenious basic idea but it's incredibly poorly elaborated and it ends up being more of a comedy instead of a horror film. A stereotype thirty-something bachelor, with only TV and naked models on his mind (in other words, someone you'd NEVER allow to baby-sit your children), is looking after his 8-year-old nephew and faces huge difficulties getting him to sleep. He tells him three bedtime stories that are all very personal interpretations of famous fairy-tales, namely Peter & the Wolf, Little Red Riding Hood and Goldilocks & the three Bears. The first story is really dull but contains a handful of decent gory make-up effects. A young man is enslaved by two sibling-witches that live in the forest and command him to lure people to their house where they'll be sacrificed in order to resurrect a third sister. Trust me, it's a lot lamer than it sounds. The second story starts with totally gratuitous (but nonetheless weak) masturbation sequence! Little Red Riding Hood is a hot teenager who loses her grandmother AND her virginity in one day! What an exciting day! Her long-anticipated \"first time\" impresses her even less than the death of her granny. The werewolf-transformations look ridiculous and the acting is terrible, still this segment offers a couple of chuckles and a nice looking young actress. The third & final story is arguably the best but certainly the most original one. The \"Bear\"-family is a trio of lunatics escaped from an asylum and Goldilocks herself is a supernaturally gifted serial killer that impales horny young men for fun. The two parties combine forces and do more crazy stuff, like\u0085um\u0085going out for pizza! This story lacks in the blood & gore-department, but it bathes in an atmosphere of genuine black comedy and the performances are actually quite good. Especially gorgeous Cathryn de Prume is great. \"Deadtime Stories\" is irredeemably bad but fun and there are far worse ways to spend 90 minutes of your life.",
         "Three fairy tales are given ghoulish twists in what should have been a homerun for the horror genre. However, a slack production and a director who seems confused as to handle the stories sink it. Tale one, a romantic horror fantasy with attractive leads and a lush score is a moderate success compared to the other tales.",
         "Fairy-tales gone bad, devilishly bad, in this total \"B\" cheese-fest anthology movie from obscure 80's horror heaven! It's an oddball flick, adding a lot of absurd and black humor. Bad actors and very low budget but still some cool & gory special effects (one scene in the first segment even had me thinking about the resurrection of Frank in \"Hellraiser\", of course a little less impressively staged this time). The last segment is as retarded as it is genius. And it's got Goldilox showing some upper nakedness. I just cannot flunk this bad boy; I had way too much fun with it. And regardless the painfully low production values, it does manage to be fairly original & spirited. Die hard horror anthology lovers should check this out some time.",
         "Sleazy Uncle Mike (a perfectly cranky Michael Mesmer) tells his bratty nephew Brian (the supremely annoying Brian DePersia) a trio of macabre variations on classic fairy tales. First and most ghoulish yarn, \"Peter and the Witches\" - Hapless nice young guy Peter (a likable performance by Scott Valentine of \"Family Ties\" fame) has to abduct sweet fair maiden Miranda (the lovely Kathy Fleig) so she can be used as a human sacrifice by a pair of ugly, bickering old hag witches (broadly essayed by Phyllis Craig and Anne Redfern) who want to resurrect their long dead sister Magoga. This segment offers plenty of creepy atmosphere for the audience to relish. Second and trashiet tale, \"Little Red Runninghood\" - Nubile young lady jogger Rachel (delectable brunette hottie Nicole Picard) gets stalked by predatory werewolf Willie (a pleasingly smarmy Matt Mitler). The punchline for this one is obvious, but still uproarious just the same. Third and funniest vignette, \"Goldi Lox and the Three Baers\" - The deranged Baer family -- Grouchy dad Beresford \"Papa\" Baer (an amusingly cantankerous Kevin Hannon), screwball mom Judith \"Mama\" Baer (the hilarious Melissa Leo) and their doltish son Wilmont \"Baby\" Baer (affably goofy Timothy Rule) -- escape from an asylum and join forces with daffy psychic murderess Goldi Lox (luscious blonder looker Cathryn DePrume). This episode goes for broke with the hysterically over-the-top lowbrow silly humor. Director/co-writer Jeffrey Delman maintains a steady pace throughout and does a solid job of creating an enjoyably campy tongue-in-cheek tone. Daniel B. Canton's plain, but acceptable cinematography, the groovy opening credits theme song, Ed French's shoddy, rubbery make-up f/x, and Taj's funky score round off the schlocky goodies to be savored in this entertainingly tacky treat.",
         "I enjoyed this movie,for a horror film it can pass as good.A little boy can't sleep,so his uncle tells him three scary bedtime stories.My favorate was little red riding hood,about a murderer that stalks this girl after briefly meeting her in a store.When she gets home she finds her grandmother murdered,and \"Oh what big teeth you half!\"she says.I thought the first and third story were boring.Scott Valentine stars in this movie and he's done alot better.He played Nick on family ties.Catherine De Prume played Goldi Lox.Like I said,this movie can pass for a good film.A little strange,but don't let that ruin your fun.Does anyone know why Michael Mesmer who played Uncle Mike has never made any other movies? Jacob Young",
         "This cheap and cheerful horror anthology might lack star power and some of the technical benefits that a decent budget can bring but it proves a reasonable enough way to pass the time, it's tongue-in-cheek approach complementing the very silly nature of its three twisted fairy tales, as told to irritating brat Brian (Brian DePersia) by his exasperated Uncle Mike (Michael Mesmer). Tale one revolves around a pair of wicked witches who, with the help of their slave Peter (Scott Valentine), try to resurrect their long dead sister; tale two has pretty cheerleader Rachel (Nicole Picard) pay a visit to her grandmother's house where a werewolf is waiting; the final story features a family of escaped psychos (the Baers) who arrive home to find psychic homicidal maniac Goldi Lox (Cathryn de Prume) living there. Boasting impressive special effects courtesy of Ed French, surprisingly good performances from its no-name cast, confident direction by Jeffrey Delman, and even a welcome shower scene with hot blonde de Prume, this intentionally daft compendium is pure '80s cheeze that, while unlikely to beat Creepshow to the top spot of anyone's list of '80s horror anthologies, should keep all but the most joyless happy with its hour-and-a-half of mindlessly diverting silliness. 5.5 out of 10, rounded up to 6 for the innovative opening credits sequence and the terrible theme song."
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": [
         "Scary Stuff",
         "Overseas FilmGroup"
      ],
      "summaries": [
         "A babysitting uncle tells his charges three horror stories--about a killer witch, Little Red Riding Hood and a werewolf, and a story about \"Goldi Lox\" and the three bears.",
         "A babysitting uncle tells his charges three horror stories--about a killer witch, Little Red Riding Hood and a werewolf, and a story about \"Goldi Lox\" and the three bears."
      ],
      "budget": 0
   },
   "movielensId": 2754,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1986-04-13",
      "dvdReleaseDate": null,
      "directors": ["Jeffery Delman"],
      "runtime": 93,
      "movieId": 2754,
      "title": "Deadtime Stories",
      "mpaa": "R",
      "actors": [
         "Scott Valentine",
         "Nicole Picard",
         "Matt Mitler",
         "Cathryn de Prume",
         "Melissa Leo",
         "Kathy Fleig",
         "Phyllis Craig",
         "Michael Mesmer",
         "Brian DePersia",
         "Kevin Hannon",
         "Timothy Rule",
         "Anne Redfern",
         "Casper Roos",
         "Barbara Seldon",
         "Leigh Kilton",
         "Fran Lopate",
         "Michael Berlinger",
         "Jeffrey Delman"
      ],
      "imdbMovieId": "0092850",
      "originalTitle": "Deadtime Stories",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": ["h0jzJ75iaAA"],
      "plotSummary": "A babysitting uncle tells his charges three horror stories--about a killer witch, Little Red Riding Hood and a werewolf, and a story about \"Goldi Lox\" and the three bears.",
      "tmdbMovieId": 66194,
      "avgRating": 1.98701,
      "releaseYear": "1986",
      "numRatings": 77,
      "posterPath": "/7T4CqLmzLkZyqSh7ny4JhcBo91Z.jpg"
   }
}