{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bomb",
            "id": 258
         },
         {
            "name": "terrorist",
            "id": 949
         },
         {
            "name": "arabian",
            "id": 1975
         },
         {
            "name": "based on tv series",
            "id": 10988
         }
      ],
      "imdb_id": "tt0094293",
      "video": false,
      "title": "Wanted: Dead or Alive",
      "recommendations": [
         50116,
         26426,
         9409,
         82756,
         86971,
         26325,
         14708,
         16969,
         21376,
         80201,
         75454,
         6309,
         12236,
         33055,
         81179,
         45096,
         41971,
         72096,
         84071,
         26199
      ],
      "backdrop_path": "/kbiuwZpspixKWZfMPqe3U486XUr.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nick Randall",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d05",
               "name": "Rutger Hauer",
               "profile_path": "/2x1S2VAUvZXZuDjZ4E9iEKINvNu.jpg",
               "id": 585,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Malak Al Rahim",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d1b",
               "name": "Gene Simmons",
               "profile_path": "/otJ1GRErxC0mZsLRB1ZS41dMeq9.jpg",
               "id": 57756,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Robert Aziz",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d09",
               "name": "Eli Danker",
               "profile_path": "/g6xL7z946FYpHR5l80MAK9QCyeE.jpg",
               "id": 78111,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Amir",
               "gender": 0,
               "credit_id": "52fe446ec3a368484e022d0d",
               "name": "Nick Faltas",
               "profile_path": null,
               "id": 109676,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Farnsworth",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d11",
               "name": "Dennis Burkley",
               "profile_path": "/cCmRR9saqVLLmYqlBGTEcom8Lfq.jpg",
               "id": 83362,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Terry",
               "gender": 1,
               "credit_id": "52fe446ec3a368484e022d1f",
               "name": "Mel Harris",
               "profile_path": "/p0gcTWZfJrSDzUnGcdHOz6l8lzh.jpg",
               "id": 25306,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Patrick Danahy",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d23",
               "name": "Hugh Gillin",
               "profile_path": null,
               "id": 73349,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Philmore Walker",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d27",
               "name": "Robert Guillaume",
               "profile_path": "/6lXvLF1v4wpW1uLDIjti3WuSoAX.jpg",
               "id": 8294,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "John Lipton",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d2b",
               "name": "Jerry Hardin",
               "profile_path": "/vMXJijoMhBktN2rWmwAjT59jP9B.jpg",
               "id": 89141,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Dave Henderson",
               "gender": 2,
               "credit_id": "52fe446ec3a368484e022d2f",
               "name": "Robert Harper",
               "profile_path": null,
               "id": 41739,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Danny Quintz",
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d33",
               "name": "William Russ",
               "profile_path": "/cqUD0Jm0owYxcmnMZMTKpEnrKOR.jpg",
               "id": 829,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe446ec3a368484e022d17",
               "name": "Gary Sherman",
               "profile_path": "/uBiHVY39sSgV2cBtOMpxmfuMLwN.jpg",
               "id": 33094,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe446fc3a368484e022d39",
               "name": "Michael Patrick Goodman",
               "profile_path": null,
               "id": 29766,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446fc3a368484e022d3f",
               "name": "Gary Sherman",
               "profile_path": "/uBiHVY39sSgV2cBtOMpxmfuMLwN.jpg",
               "id": 33094,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d45",
               "name": "Brian Taggert",
               "profile_path": null,
               "id": 64821,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446fc3a368484e022d4b",
               "name": "Robert C. Peters",
               "profile_path": null,
               "id": 1198898,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d51",
               "name": "Barry Bernardi",
               "profile_path": null,
               "id": 11772,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe446fc3a368484e022d57",
               "name": "Michael Patrick Goodman",
               "profile_path": null,
               "id": 29766,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d5d",
               "name": "Arthur M. Sarkissian",
               "profile_path": null,
               "id": 21636,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d63",
               "name": "Joe Renzetti",
               "profile_path": null,
               "id": 65681,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d6f",
               "name": "Ross Albert",
               "profile_path": null,
               "id": 66756,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe446fc3a368484e022d75",
               "name": "Ellen Meyer",
               "profile_path": null,
               "id": 1190236,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "52fe446fc3a368484e022d7b",
               "name": "Sally Stiner",
               "profile_path": null,
               "id": 1176345,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d81",
               "name": "Paul Eads",
               "profile_path": null,
               "id": 54776,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe446fc3a368484e022d87",
               "name": "Jon Hutman",
               "profile_path": null,
               "id": 2243,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "53fdab8d0e0a262058001213",
               "name": "Alex Nepomniaschy",
               "profile_path": null,
               "id": 59443,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.860255,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23599,
      "vote_count": 27,
      "budget": 0,
      "overview": "This movie features a character who is supposed to be the descendant of the character played Steve McQueen in the television series of the same name. And like McQueen's Josh Randall, Hauer's Nick Randall is also a bounty. But also an ex-CIA operative, who is asked by his former employer to help them track down a terrorrist, Malak Al Rahim, who is in the country, and has already made a move. But he is also looking for Randall, and the people, whom Randall is working for, is telling Malak, where he can find Randall.",
      "similar": [
         7461,
         2320,
         49026,
         201088,
         379149,
         5125,
         231,
         1637,
         4349,
         26388,
         1817,
         2253,
         12162,
         7551,
         253,
         36955,
         23483,
         36557,
         97630,
         109424
      ],
      "original_title": "Wanted: Dead or Alive",
      "runtime": 104,
      "poster_path": "/lEzNi23kwSbkJpFMsgB38FZleel.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "New World Pictures",
         "id": 1950,
         "origin_country": ""
      }],
      "release_date": "1987-01-16",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Nick Randall is a loner. A legend. A bounty hunter. He's the best there is at the job he hates.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Sherman"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Michael Patrick Goodman",
         "Gary Sherman"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094293/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3OTc0MDUxN15BMl5BanBnXkFtZTcwNDc1NjYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Rutger Hauer, Gene Simmons, Robert Guillaume | See full cast and crew »"],
      "reviews": [
         "Rutger's the MAN! I found this film at Best Buy about 4 or 5 months after September 11th, and it just hit the spot! I had never heard of the movie but being a Rutger fan I usually will spend the money to add his films to my ever growing collection. Sometimes he's the only thing that adds to the life of some very dreary films and he's in a bunch of them. The '80's however seems to have been his decade and this film is a pretty good outing for him. It is in the B-Movie range, for sure, but it works well. Gene Simmons plays a great villain. The action and pacing of the film works well, and frankly the subject matter couldn't be more up-to-date. I wish they were making more movies like this today where the terrorists get what they deserve and the audience can enjoy the pay back and feel like they are participating in the action. The very end of the film is great and it certainly is a statement that works even better today. I think most people would feel the same way as Rutger does at the end of this movie and want to do the same thing. I certainly did! For fans of action and/or Rutger hunt this movie down!",
         "I recently revisited \"Wanted Dead Or Alive\" after a period of almost 20 years. The film's really stood the test of time and it's a shame there weren't any sequels produced. Rutger Hauer's time as an action hero was short-lived. The film's low budget roots can't be missed but there are enough strong performances from the cast to carry the movie. Hauer's bachelor loft is the ultimate guy pad and, in my opinion, worth watching the movie for. To say his crib is cool is the understatement of the year. Gene Simmons delivers the goods as a thoroughly nasty baddie. Great '80s \"B\"-movie fun.",
         "After making his mark playing vicious characters in NIGHTHAWKS, THE HITCHER and FLESH + BLOOD, Rutger Hauer plays the hero in a solid action thriller,set in LA. While it is not as slick as the first LETHAL WEAPON movie, it is still quite witty and entertaining. Gene Simmons gives an understated, menacing performance as the terrorist and there's some good action.",
         "Action all the way, this is Hauer at his best. I first saw this movie about ten years ago, and remembered it only for its final scene; I still remembered the line \"**** the bonus!\". When watching the film again all these years later, unlike most movies, I actually got more from it than the first time I saw it. For action fans everywhere, put this on your must-see list.",
         "I'm not sure if this movie was supposed to be taken seriously or not, but the way I looked at, it was fun. I enjoyed everything about it and especially the characters. In particular I liked Nick ( Hauer ) and Phil ( Robert Guilleaume ). They had a familiarity to them, almost like you have met them somewhere before. Maybe you sat down to have a drink with them before and they told you a few stories. And this makes it fun to watch. Another strength this film has is its little subtleties. Like when, after catching a criminal, Nick puts him in the truck of the car because he wreaks of booze. Now that is funny. This really is a fun film and there are lots of interesting and fun little macho lines in the film to please any fan of the genre. Check it out.",
         "This film to me was pretty good. It sort of is a bit like \"Nighthawks\" another film featuring terrorist, one of which being Hauer himself. This one though has Hauer as the good guy and Gene Simmons as the bad guy. Both are very good in their roles. Both never being or becoming super celebrities. Hauer has been in a lot more movies than Simmons and he has been in some very big movies during his days. Still, he rarely got to be the lead star in films. Simmons just played bad guys like the one here and the one in \"Runaway\". He was actually rather good in both films and I am surprised he never got more chances to play in movies cause I so could see him in a horror movie as the sadistic killer. This film has terrorist on the attack and a bounty hunter is going to be the one to bring them down. I loved watching Hauer as Nick Randall do his thing. He is a former CIA operative and a descendant of a legendary bounty hunter. The action is pretty good here and there, it could use a bit of work, but I still thought it played out rather well. The ending to this movie is really good, though at the same time while it is satisfying it is also a bit sad too.",
         "This is the type of hero, we all need. Someone who can handle the situation and get the job done! And done indeed, he does as 'Nick Randall', a bounty hunter with a proved ability for survival. I hadn't followed Rutger's rolls very closely until he played a very controlling and virtually unstoppable cereal-murderer. Eric Red's story and Robert Harmon's directed film, 'The Hitcher'. A thriller that makes the hairs on your neck stand straight up, with a strange echoing eeriness. Rutger was 'mesmurizing' in the roll that he just, took over. He was aptly the killers's killer. I walked out of the theater stunned at his absolutely convincing performance. So when I went and saw, 'Wanted' with the reversal of 'rolls' for Rutger, Hell! He goes back and forth through 'Goodguy' 'Badguy' 'Protag' and 'Antag' character rolls better than Sylvester Stallone or Kevin Costner, even better than Harrison Ford for crying out loud. This man has that skilled ability, to lay it out unmistakably. The Hero that Nick Randall is in \"Wanted: Dead or Alive\" is a 'Snake-Eater'. First zero's in on his target and sets it up, then hit's them hard, knocking them down and then out. He is a 'Patriot', that doesn't want to be 'Snowed' by anyone. He is a strong man and yet he's a caring friend to fellow actor William Russ's character ((the L.A. officer Danny Quintz and even Agent Walker of the F.B.I. who considers him a 'Friend' for over 15 years)) the most impressive part(s) to me are when you can feel the emotionally-loaded response from Hauer's 'Randall'. You see him angry, hot, sweating feeling the strain. He is broken down emotionally with tears in his eyes at the death of his friend and his new love'Terry' whose lives have been brought to an 'abrupt end' by an anti-American group of killers. He still doesn't lose accurate focus under the pressure of his 'cover' being given away to his enemy, 'used as live bait' by those supposedly on his side of the fence (for their own strategic manoeuvrings). Even so, he forces himself not to stop or even slow down but follows his conscience through to the very ending of this Government contracted game, in which they are involved with 'holy-waring' terrorists. Rock group lead-singer Gene Simmons plays a jihad-violent terrorist that is a madman out to appease himself and his killing partners. Even with Simmons who plays well, he knows being an Israeli what it feels like to have a terrorist organization plotting to destroy your very existence. An incredible action movie that blows doors off of many others in this film 'genre'. If you haven't seen this one, but you have seen 9/11 on the television news and the papers...do yourself a favor, rent or buy this on D.V.D, watch it and feel better. This was not four-star acting. But the story can take you through if you're into it. It's like a late night made for television feature to be honest...but its fun. No fear but loss, triggering anger, causing Nick to bring about 'exacting' vengeance and then...comforting relief. (**)",
         "Recap: Nick Randall is a former agent that has burned his bridges with his former superiors in the justice system and now makes a living as a bounty hunter. But not any bounty hunter, he is the meanest, and most effective, bounty hunter around. Malak Al Rahim on the other hand is one of the few that got away from Randall's agent days. And in vengeance he becomes the worst terrorist around. Now they both are in L.A. and a showdown is inevitable, especially since Randall's former superiors use him as bait. Comments: Eastwood, Stallone, none of them has anything on Rutger Hauer. He just is the meanest bounty hunter/cop in movies. Just watch the presentation in the intro. Well, anyway that also sets the standard for the movie. This is an entertaining exposé in violence. And it does it very good, like they did in the middle of the eighties, with big guns and massive explosions. More surprising though is that it actually got a decent story. It's the classic revenge thing with an extra edge in the wedge Randall is in between Rahim and his deceitful ex-superiors. Combined with the limitless violence it is really very entertaining. If you like these kind of movies that is. You'll like it even more if you, like I, is a fan of Hauer. I won't say it is his best because I can't imagine ever can top Split Second (or Blind Fury for that matter) but it is right up there at the very top. This is really one for you fans out there. 7/10",
         "\"Wanted: Dead Or Alive\" was by no means an Oscar worthy film (or even an especially well made one), but it marks Hauer's peak in the late 80's before he ran his career into the ground by appearing in an endless string of 3rd and 4th rate films in which he was often the only thing worth watching. These days his films are often direct-to-video schedule fillers, although I have hope he could yet regain the prominence his talent deserves (in his favor, he's had a meaty role in \"Surviving the Game\" and a powerful three minute scene in \"Sin City\" that practically steals the film.) But \"Wanted\" is a lot of fun due to its setting, its lead character, and its renegade machismo atmosphere. Hauer gets to wear black leather jackets, pistol whip fugitives, drive an enormous truck, keep a cache of oiled-and-ready guns and knives and blackjacks. And he gets to live in a huge warehouse full of motorcycles and weights and electronics that he can play with ANYTIME HE WANTS - it's the ultimate Boy's Club Treehouse/Fortress of Solitude. He's essentially an loner and an outlaw who makes a living by supporting the law - a Lone Ranger for modern times. Any young man between the ages of 15 and 65 wanted to BE this guy at some point in his life - either this guy, or else Batman. So this film practically gets over on the lead character alone. So all the movie has to do is give him something to do, and someone to be against. For that, the film-makers chose to cast Gene Simmons as a terrorist who is, of course, completely despicable, cowardly, opportunistic, etc., etc. It's an OK choice, I guess, since Simmons has a nice sinister cast to his features, and he looks appropriately mean and hateful and gleefully sadistic in his role. In fact, it's the exact same performance that he put on in a similar role in \"Runaway\" about the same time. Really, though, it's nothing a dozen other character actors couldn't do better, especially with such a cardboard, unsympathetic character. (I can't help but wonder what M. Emmett Walsh could have done with this role - he could have come across as both lots funnier and 10 times more sociopathic if he'd been given the chance). So anyway, Hauer is put on Simmon's trail, Simmons get a hint of who is tracking him and decides a preemptive strike is in order, and hijinks ensue. Loved ones are killed or injured, Hauers gets madder and madder, Simmons leers and capers, it turns out that the authorities are double crossing our Hero, giving him even more reason to take off the kid gloves...any one who has ever watched 'renegade cop on the edge' movies can predict how this one will end. One nice touch here is that Hauer ends up stuffing a grenade in Simmon's mouth and pulling the pin, a 'coup de grace' that had not been used yet (to my knowledge). In spite of the formulaic nature of the plot, and the fact that Simmons is obviously only in this because he was a member of KISS, the film is much better than it should be. There is some kind of alchemy going on here - the director knows how to use his lead actor, and the pacing is good, and lots of little details work out and lines of dialog are given effective readings, etc. Maybe it was the spirit of Steve McQueen hovering over the set...who can say? I am sorry there was never a sequel to this movie with this character, but then again, it might have sucked, so I guess I should count my blessings. After all, I hoped for a sequel to \"Lethal Weapon\" and got it, only to watch that franchise become a mockery of itself. In summary: good viewing for anyone into Chuck Norris movies or 'renegade cop on the edge' movies, or action/thriller movies in general. If you like Rutger and haven't seen this yet, change your viewing plans for next Friday night and find yourself a copy.",
         "The former CIA operative in the Middle East Nick Randall (Rutger Hauer) is presently a bounty hunter in Los Angeles. He chases most wanted guys to get the reward and is saving money for repairing a vessel. He intends to retire and travel around the world with his girlfriend Terry (Mel Harris) and his best friend is Detective Danny Quintz (William Russ). After a terrorist attack in a movie theater, Randall is assigned to catch the evil terrorist, Malak Al Rahim (Gene Simmons), who has killed more than 140 persons in his attempt. However, the real intention of his disaffection from CIA, John Lipton (Jerry Hardin), is to use Randall as a bait to catch Malak. Terry and Danny are murdered by one terrorist and Randall discovers that the Malak's agenda is to blow-up a chemical facility and kill thirty thousand persons. But Randall now seeks revenge against Malak. \"Wanted: Dead or Alive\" is a B-movie full of clichés, but supported by good actors. Today I have just seen is again (01 May 2013) and the promising beginning unfortunately becomes a totally predictable story. The conclusion is awful, with Randall chasing Malak in a refinery crowded with policemen, detectives and agents and nobody hears the shooting. Anyway this movie entertains. My vote is six. Title (Brazil): \"Exterminador Implacável (on DVD)\" (\"Implacable Exterminator\") or \"Procurado Vivo ou Morto\" (on VHS) (\"Wanted Dead or Alive\")"
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "New World Pictures",
         "Balcor Film Investors"
      ],
      "summaries": [
         "This movie features a character who is supposed to be the descendant of the character played by Steve McQueen in the television series of the same name. And like McQueen's Josh Randall, Hauer's Nick Randall is also a bounty hunter. & also an ex-CIA operative, who is asked by his former employer to help them track down a terrorist, Malak Al Rahim, who is in the country, and has already made a move. But he is also looking for Randall, and the people, whom Randall is working for, is telling Malak, where he can find Randall.",
         "The former CIA operative in the Middle East Nick Randall is presently a bounty hunter in Los Angeles. He chases most wanted guys to get the reward and is saving money for repairing a vessel. He intends to retire and travel around the world with his girlfriend Terry and his best friend is Detective Danny Quintz. After a terrorist attack in a movie theater, Randall is assigned to catch the evil terrorist, Malak Al Rahim, who has killed more than 140 persons in his attempt. However, the real intention of his disaffection from CIA, John Lipton, is to use Randall as a bait to catch Malak. Terry and Danny are murdered by one terrorist and Randall discovers that the Malak's agenda is to blow-up a chemical facility and kill thirty thousand persons. But Randall now seeks revenge against Malak.",
         "Nick Randall is a bounty hunter who's built up quite a resume. One notable resume highlight, though, happened before his current career began--as a CIA agent. Malak Al Rahim, an evil international terrorist, shows up on the scene and suddenly there is a new member of America's Most Wanted list. A deadly game of cat and mouse fine Nick as both the mouse and the cat-- but has Nick finally met his match?"
      ],
      "budget": 0
   },
   "movielensId": 2756,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-01-16",
      "dvdReleaseDate": "2001-05-29",
      "directors": ["Gary Sherman"],
      "runtime": 104,
      "movieId": 2756,
      "title": "Wanted: Dead or Alive",
      "mpaa": "R",
      "actors": [
         "Rutger Hauer",
         "Gene Simmons",
         "Eli Danker",
         "Nick Faltas",
         "Dennis Burkley",
         "Mel Harris",
         "Hugh Gillin",
         "Robert Guillaume",
         "Jerry Hardin",
         "Robert Harper",
         "William Russ"
      ],
      "imdbMovieId": "0094293",
      "originalTitle": "Wanted: Dead or Alive",
      "genres": [
         "Action",
         "Thriller",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "This movie features a character who is supposed to be the descendant of the character played Steve McQueen in the television series of the same name. And like McQueen's Josh Randall, Hauer's Nick Randall is also a bounty. But also an ex-CIA operative, who is asked by his former employer to help them track down a terrorrist, Malak Al Rahim, who is in the country, and has already made a move. But he is also looking for Randall, and the people, whom Randall is working for, is telling Malak, where he can find Randall.",
      "tmdbMovieId": 23599,
      "avgRating": 2.94231,
      "releaseYear": "1987",
      "numRatings": 234,
      "posterPath": "/lEzNi23kwSbkJpFMsgB38FZleel.jpg"
   }
}