{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0089816",
      "video": false,
      "title": "Plenty",
      "recommendations": [
         147747,
         91217,
         15730,
         343725,
         44746,
         82191,
         5332,
         33247,
         39428,
         120393,
         100017,
         75364,
         84278,
         71445,
         27142,
         42090,
         31875,
         93946,
         14344,
         115553
      ],
      "backdrop_path": "/11h2yPSPx3aYIOr9iiI2WszeLEi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Susan Traherne",
               "gender": 1,
               "credit_id": "52fe45b9c3a36847f80d6cad",
               "name": "Meryl Streep",
               "profile_path": "/uyalVm3tH5DaUoxCmvILS9sUFsR.jpg",
               "id": 5064,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Alice Park",
               "gender": 0,
               "credit_id": "52fe45b9c3a36847f80d6cb7",
               "name": "Tracey Ullman",
               "profile_path": "/mwaLg97HsIyoxOgdqEnyQVR0bBv.jpg",
               "id": 30364,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Sir Leonard Darwin",
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cbb",
               "name": "John Gielgud",
               "profile_path": "/jvTSqk7cuOrsdtf037olQ9BKRAe.jpg",
               "id": 11857,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Mick",
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cbf",
               "name": "Sting",
               "profile_path": "/cnhlJfHWfNU0ig6hidOiXuvew7o.jpg",
               "id": 982,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Sir Andrew Charleson",
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cc3",
               "name": "Ian McKellen",
               "profile_path": "/coWjgMEYJjk2OrNddlXCBm8EIr3.jpg",
               "id": 1327,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Lazar",
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cc7",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Mr. Aung",
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6ccb",
               "name": "Burt Kwouk",
               "profile_path": "/7s1Sul5L6NU2TEfgLarBqrde65v.jpg",
               "id": 21944,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Raymond Brock",
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cd5",
               "name": "Charles Dance",
               "profile_path": "/bLT03rnI29YmbYWjA1JJCl4xVXw.jpg",
               "id": 4391,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Spencer",
               "gender": 2,
               "credit_id": "565b16f692514169250026b7",
               "name": "Christopher Fairbank",
               "profile_path": "/OtvVhW5zzq2J9eiLC0R1H9sZb2.jpg",
               "id": 8399,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Michael",
               "gender": 2,
               "credit_id": "565b1706c3a368507900268f",
               "name": "Hugh Laurie",
               "profile_path": "/3qCmEHtq5fBW8dbzsYDSy16Zqb0.jpg",
               "id": 41419,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "French Farmer",
               "gender": 0,
               "credit_id": "581650a89251415d3400fa99",
               "name": "John Serret",
               "profile_path": "/9MhRe9cbPVP9NzkGtghKI4DO9AB.jpg",
               "id": 93951,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cb3",
               "name": "Fred Schepisi",
               "profile_path": "/gN30W0bFd4p55fiCT3oeBFVJqs9.jpg",
               "id": 64061,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45b9c3a36847f80d6cd1",
               "name": "David Hare",
               "profile_path": null,
               "id": 8403,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.087008,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 41166,
      "vote_count": 9,
      "budget": 0,
      "overview": "David Hare's account of a one-time French freedom fighter who gradually realizes that her post-war life is not meeting her expectations.",
      "similar": [],
      "original_title": "Plenty",
      "runtime": 124,
      "poster_path": "/gvK5Wv9ntWwu6IzLFuIUd2enHNm.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Pressman Productions",
         "id": 21590,
         "origin_country": ""
      }],
      "release_date": "1985-09-20",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Fred Schepisi"],
      "runtime": 121,
      "synopsis": null,
      "writers": [
         "David Hare",
         "David Hare"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089816/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1ODgzNzk1OF5BMl5BanBnXkFtZTcwMTQwNjgxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Meryl Streep, Sam Neill, Charles Dance | See full cast and crew »"],
      "reviews": [
         "This is a film where you can get lost, wonderfully lost. Following Susan, the character created on the page by David Hare and on the screen by Meryl Streep, is a journey of gloriously unexpected ups and downs. It may be because the amazing Meryl Streep goes trough the analytic intellect of David Hare with her heart on her sleeve and I felt shattered and moved by the access she provided me into the heart and soul of her own personal labyrinth. To look back with regret and feel that memories of fleeting moments of extraordinary beauty can keep you going and see you through whatever hell fate seems determined to throw your way. Meryl Streep never looked this beautiful and the transparency of her missteps are a magic sweep of the most enthralling kind. Irrationaly sane. Like most of the great bipolar. They know, they've seen through. There is nothing ahead only behind and now it's too bloody late. The stages of Susan's journey, to the after war lands of plenty are framed by her own geniality - the character's and the actress's - Susan is overwhelmed by her own awareness, lonelier and lonelier, Meryl overwhelm us with her own sublime generosity. Fred Schepsi, the extraordinary man at the helm, keeps the puzzle open and clear. Like most works of art, not everyone will be ready to open up to this experience. Pretty frustrating let me tell you. I would love to share this experience with everyone.",
         "\"Plenty\" is a film I watch as often as other people watch \"It's A Wonderful Life\" or the first \"Terminator\", yes, I know, I must be a very strange guy. I was a teenager when I saw \"Plenty\" on stage at the National Theater in London. I remembered the play vividly, Kate Nelligan's performance was sensational. Fred Schepsi's \"Plenty\" has a totally unique life of its own. We're allowed into Susan's mind and Susan has Meryl Streep's face. Her performance makes her character's intellect visible, cinematic. Intimidating, fascinating, extraordinarily beautiful performance. I think David Hare has written here one of the best female characters I've ever seen and Meryl Streep strips it of every pretense. She can lie even to herself but not to us. It is mesmerizing at times. A ping pong ball going through the character's brain as she listens. Alone, so alone in the world. She never expresses it with words although she, I think, is totally aware of it. The infuriating sense of being incapable to adapt, to belong. Wanting and not wanting. Mesmerizing! As if this wasn't enough, Tracey Ullman, Charles Dance, Sting, Ian McKellen and John Gielgud giving, perhaps one of the best film performances during the final part of of his life I felt rather lonely in my love for this film until I started reading some of the comments posted here and realized I wasn't all alone in the world. Nice to meet you all.",
         "This is one film which has grown on me since I saw it on main circuit. It is an intelligent film, which demands a lot of active viewing. Aided with an incisive script by David Hare, it looks at Britain's history from the end of WWII, through to Queen Elizabeth's coronation the Suez Crisis, all counterpointed by the lead character, Susan Treherne (played, in I think one of her best moments, by Meryl Streep.) The film plays on the word \"Plenty\" and the hope for UK after WWII that there would be plenty - in itself ironic. It is also a study of a woman afflicted by bipolar disorder (manic-depression). This is not the focus of the film; in fact, it is never explicitly stated.... At the time portrayed, psychiatric illness wasn't acknowledged - it tended to be swept under the carpet. Streep imbues Susan with a dignity, despite her liking to \"lose control\"; there are excellent performances by Sam Neill (Lazar, her war-time \"love\"), Tracey Ullman, Sting, Charles Dance (her long-suffering husband) and John Gielgud (as the diplomat who takes the fall for the Suez Crisis.) It's not an easy film, but worth watching and discussing. It must be one of the most underrated films on IMDb. Do yourself a favour, ACTIVELY engage with this. Don't let this film be overshadowed by Meryl Streep's other films of this time, like the overrated Out of Africa. They don't hold a torch to this film!",
         "\"Plenty\" needs to be seen on a big screen in a theatre; more than most, this is a film that suffers in its translation to a TV screen. (Among other things, there are scenes that are simply ruined in the format change--like the hilarious scene of Streep and Sting on a sofa as Queen Elizabeth's coronation plays live on the tellie!) Sound is also important to fully appreciating the film--like the constant reminders of the sound of opening parachutes that echo throughout the story. It's easy to understand why the film was not a box office success; it focuses on a woman who is not terribly likeable, but I contend that it is a movie rich in observations that transcend post-war Britain and the borish woman who develops in that milieu. \"Plenty\" is (among other things) about passion, diplomacy, memory, self-deception and the great expectations that are so easily squashed in our unheroic modern world. The film (and Hare's play before it) revolves around a crucial scene brilliantly played by a startlingly mad Streep and Ian McKellan's icily insightful foreign service officer--well past the film's mid-point. After his long-in-coming dose of reality, Streep's Susan takes a tailspin into the movie's melancholy conclusion. It's not an easy film to \"enjoy,\" but the uniformly brilliant performances from Streep, Charles Dance, Tracy Ullman and John Gielgud make the film fascinating to watch and rewarding to have experienced.",
         "Plenty is one of my all-time favourite films. I loved this movie. I understand why many people did not like it, but I think they should have another look. Sure, it is not an easy movie to watch, and Meryl Streep's character is not the most pleasant woman in the world, but that is part of the point. \"Plenty\" is unabashedly unsentimental, and that is one of its greatest strengths. Meryl Streep gives one of her best performances, and it's not only because of her flawless British accent. That is just the surface of Ms. Streep's complete, and absolutely brilliant transformation into a very complicated character. She is also sexier than she has ever been on screen up to that time. This film is about as performance-oriented as films get, and it is full of great performances -the entire cast is excellent!! \"Plenty\" is a movie about how different life can turn out from the way we plan it. It is not supposed to be cheerful. It is gritty, gripping, and extremely powerful. It portrays the hardships of Resistance era France, and the harsh realities of Britain immediately after the Second World War; as well as the decadence that prosperity can bring, and the disappointments of life, and how the inability to deal with them can destroy a person´s sanity. Of particular note are Charles Dance, as Streep´s husband, Sam Neil as her lover, Sting and Tracey Ullman in small but important supporting roles, and especially Sir John Gielgud, who effortlessly steals the few scenes he is in. In one of the movie's few comic moments, Mr. Gielgud corrects the wife of a Burmese diplomat just as he is leaving a dinner party on the nationality of a certain European film director. Just this scene makes the movie worth watching! I have seen this movie described as an underrated tour-de-force. That is an extremely fitting description. I would add the word classic to that description. This is a film that challenges the viewer to sit through its grim depictions of what life can be like if we don´t know how to deal with life not turning out like we want it to. Depicting different eras from the Second World War to the early to mid sixties, \"Plenty\" is a period piece with painstaking recreations and some incredible locations in England, France and Jordan. If someone has not seen this movie, I urge them to buy it or rent it and watch it. There is no widescreen version available, which is unfortunate, because of the stunning cinematography, among other things. To anyone who appreciates great acting, this film is a MUST SEE. No serious film collector should be without this great classic. If someone has seen it but did not like it, I urge them to watch it again, and again. I have seen this film at least ten times, and I could easily watch it ten times more.",
         "PLENTY cast such a spell on me. It is one of those films which has a mood and tone all of its own. It is sombre, dreamy and elegaic. And it features a little seen, yet compelling and masterful central performance from Meryl Streep, who lights up the screen with the type of intelligence and female strength one laments the absence of in contemporary film. Based on David Hare's play, PLENTY (like so much of his work) boasts wonderfully complex, multi-layered roles for women. Meryl Streep and Tracey Ullmann excel with the intelligent dialogue given to them by this incredible writer - and despite the plethora of strong male actors surrounding them, it is the women whose stories move and interest us the most. What I love about PLENTY is that so much about it is anti-Hollywood. Its convoluted plot is often incoherent and dreamlike, its dependence upon memories and the co-existence of past and present present challenges for audiences who normally would be sign posted in the 'correct' direction. It has an impressionistic, hypnotic feel, and the film's characters, especially Susan, are unappologetic and potentially dislikeable people. Its narrative resoultion is ambiguous, refusing the closure of more traditional dramas. Here we have a film which refuses to pander to the demands of the mainstream, and for that it is to be applauded. Is there anything new that any of us can say about Meryl Streep??? This is a must for admirers of the actress, and a must for anyone with a penchant for riveting, deeply intelligent acting. Meryl grabs the part by the throat, investing Susan with a compelling defiance, a fierce intelligence, a sensuality, and a restrained beauty. Watch out for the dinner party scene. I forgot there was anyone else in the room (a room which included Sir John Gielgud and Charles Dance!) Such command, such depth, and such naturalness. This is an actress of phenomenal depth and magnificent expression. And such wonderful chemistry with the other actors! (Even Charles Dance who reportedly was a bit of a diva on set!! I wonder if this helped to enhance the fiery antagonsim between them on screen?) In sum, PLENTY is deeply complicated, but give it time, watch it more than once and you will be rewarded. For its thoughtful direction, its searing, intricate dialogue and its mesmerising acting - this is a film that deserves to be seen by much larger audiences. Bravo Queen Meryl!!",
         "There is now and has been since 1985 a lot of conjecture as to what this film is about. The reaction I had after I first saw this film was one of the first times I was genuinely depressed after I had seen a film. Depressed by an outside force not from within myself. Women in my family were of the similar age Meryl Streep's character of Susan Traherne...so I asked them how they felt during the war and after. Their candid replies (not prompted by any film discussion either) led me to believe PLENTY was a state of mind, a post war feeling of \"winner's feast after survival\"...I came quickly to realize Susan Traherne, her men, her lovers, her descent into disillusionment, unhappiness, into madness, irrationality. the realization she had to live with herself and her gauche cruelty, snobbery, foolishness and self deceit... was about Great Britain herself, Susan is the Nation, Brittania. PLENTY is possibly the saddest film I have ever seen, on par with MILLION DOLLAR BABY but for different reasons. I also think Susan represents the women baby boomers in every country had as their Mother, who after taking a deep sunny breath of freedom after struggle found that their family and suburbia was a prison and that post war servitude and struggle was the hell they never reckoned with. PLENTY is a great title for this film of 'the promised land\" that turned into a supermarket car park. I never want to see it again. Such is the heartbreaking success of this production. PLENTY is a major achievement in film making and it's emotional reality is absolutely crushing.... like Susan's soul and promise was crushed by post war plainness. THE HOURS goes into the same territory in the 1950s sequences with Julieanne Moore wanting to suicide. Susan's sex scene during the Queen's coronation is the cruelest, most superb observation of the relationship between the Royal family and Britain. PLENTY is a character study and not a popcorn movie. Not all films are 'flicks' as some people demand they be. THE FIGHT CLUB and the effect on 30 year old men of today of the pressures commercial modern living as personified by Ed Norton in his famous \"ikea\" speech is a good equivalent for today's crushed male soul.",
         "In \"Plenty\" (***1/2). Meryl Streep gives one of her greatest performances in the complex role of \"Susan Traherne\", an idealistic young Englishwoman whose compulsive need to stir things up comes in conflict with a crippling lack of courage. We follow her life from her days in the French Resistance at the end of World War II to her professional and emotional decline during the 60's. Her key line: \"I want to change the world, but I don't know how.\" The supporting cast, production and direction are superb, and the score by Bruce Smeaton is hauntingly beautiful. The character functions as both a metaphor for postwar England and a real flesh and blood human being, although it's a flaw that we don't learn more about her family background, apparently an upper class one, which might have contributed more to an understanding of her later, often perverse, behavior. The only two people she seems to have in the world are Charles Dance, playing her long-suffering diplomat husband and Tracy Ullmann, wonderful as her free-spirited best friend, probably the kind of person Susan would like to have been if it were not for her \"fatal weakness\": she likes \"losing control.\" This film has been newly released in its original Panavision dimension on DVD and looks terrific. Seeing it the way it should be seen only enhances my opinion that it's one of the most underrated movies of the 80's.",
         "I guess I've seen all of Meryl Streep's movies--even the silly one where her head is on backwards--but I think she was never better than in Plenty. It's basically a story about an English woman who risked her young life working for the French underground during the war and had the highest hopes for the world that would follow after the war ended. The film traces her increasing disgust with what in fact did follow. She takes a succession of jobs--clerk for a shipping company, functionary for QE II's coronation, assistant producer for a TV ad company--while simultaneously married to stiff but devoted British diplomat Charles Dance and intermittently entertained by bohemian Tracy Ullman. Throughout all her disillusionment she hangs on to the memory of a quick affair with an English paratrooper she met in France. A token he gave her becomes the symbol of her hope. Dance is top-notch as her long-suffering husband, trying to cope with her bouts of instability. Gielgud is excellent as Dance's boss, an ambassador trying to cope with British foreign policy. A short encounter between Streep and a Foreign Service bureaucrat, no less than Ian McKellan, is a sterling scene. Throughout the film the dialogue is as sharp as a razor. All in all, I can't think of any film which more pointedly contrasts the drama of the war years with the anti-climax of the post-war years. It gives new meaning to The Best Years of Our Lives.",
         "David Hare's brilliant stage play has been translated beautifully to the screen. The peculiar English trait of natural melancholy radiates throughout this sad exercise of seeing all through the lens of British class consciousness, repression and despair. The color photography, the performances, the stifling framing of the widescreen shots all add to the oppressive beauty of a story about the self-destruction of a preternaturally beautiful woman. Mery Streep has never been better before or since. Hare makes her intellectual acuity a weapon against herself as she sees through all the ghastly pretenses of a corroding Empire. No insight, no beauty of body, no letting go of formality and pretense can save her from herself. Feminism itself is taken to the burning stake as Streep's character thrashes, Hedda Gabbler like, against walls and prohibitions beyond her understanding. Rarely has such condemnation looked so ravishing."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Pressman Productions",
         "RKO Pictures"
      ],
      "summaries": [
         "Susan Traherne has been irreparably changed by her wartime experiences as a Resistance fighter. She sets out in the post-war world to make her way to what she wants, no matter who is hurt, or how.",
         "A young Englishwoman spends 20 years to make whatever kind of life for herself at the expense of others around her in post-World War 2 England."
      ],
      "budget": 10000000
   },
   "movielensId": 2758,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-09-20",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Fred Schepisi"],
      "runtime": 124,
      "movieId": 2758,
      "title": "Plenty",
      "mpaa": "",
      "actors": [
         "Meryl Streep",
         "Tracey Ullman",
         "John Gielgud",
         "Sting",
         "Ian McKellen",
         "Sam Neill",
         "Burt Kwouk",
         "Charles Dance",
         "Christopher Fairbank",
         "Hugh Laurie",
         "John Serret"
      ],
      "imdbMovieId": "0089816",
      "originalTitle": "Plenty",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["2wW_J798Mws"],
      "plotSummary": "David Hare's account of a one-time French freedom fighter who gradually realizes that her post-war life is not meeting her expectations.",
      "tmdbMovieId": 41166,
      "avgRating": 2.93836,
      "releaseYear": "1985",
      "numRatings": 219,
      "posterPath": "/gvK5Wv9ntWwu6IzLFuIUd2enHNm.jpg"
   }
}