{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "tree house",
            "id": 2005
         },
         {
            "name": "red-light disctrict",
            "id": 4750
         },
         {
            "name": "young people",
            "id": 6517
         },
         {
            "name": "stripper",
            "id": 6593
         },
         {
            "name": "make a match",
            "id": 6664
         },
         {
            "name": "mob boss",
            "id": 166462
         }
      ],
      "imdb_id": "tt0110516",
      "video": false,
      "title": "Milk Money",
      "recommendations": [
         12661,
         42580,
         11310,
         16297,
         25330,
         20096,
         26261,
         24073,
         15982,
         13203,
         8494,
         15128,
         17362,
         26603,
         34376,
         6393,
         12280,
         12475,
         11777,
         118430
      ],
      "backdrop_path": "/vTTZvavmVO2gNwAh8c4yOo33gq7.jpg",
      "revenue": 18137661,
      "reviews": [{
         "author": "Olivergbyrne",
         "id": "59d4b5639251414b99014ba5",
         "content": "I don't think that film is too bad,of course it's not the most interesting film I ever saw but I don't think it was the point of that movie. The all film turns around Frank (nicely played by Michael Patrick),He never knew his mum because she died giving birth to him,OK just to say with a plot like that the film could have been a catastrophe but because the character of Frank was played well enough it did'nt. In other Family drama with that kind of story the kid is always moaning and crying because he dos'nt know his mum or dad but Frank look more curious than depressed,Is acting like a real kid would in that situation,It's a simple but good thing about that film.\r\n\r\nAnd there is V,I don't agree with the comments which said she was a prostitute with a heart of gold far from it,V is very lost and she have very low self esteem.I think Melanie Griffith was lovely as V and it was different from character she usually play.\r\n\r\nNothing to say with Ed Harris,he did is best with very little to work with because we have to admit it that the Dad is a very flat and boring character.\r\n\r\nThe character of Anne Heche was supposed to be comic it was'nt instead you were wondering what the hell she was doing in that movie,the same go for Malcolm Mcdowell.\r\n\r\nthe film turns around the relationship between V and Frank which is well played by both Mickael and Melanie. Of course their is some annoying scenes with Frank's Friends and Heche/Macdowell but I think the film is what it was meant to be, a heart warming family film and I had quite a relaxing one hours and a half watching it.",
         "url": "https://www.themoviedb.org/review/59d4b5639251414b99014ba5"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "V",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab2d3",
               "name": "Melanie Griffith",
               "profile_path": "/rdRjFsPQDQqPE8JlDQcuT5JDpED.jpg",
               "id": 29369,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Tom Wheeler",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab2d7",
               "name": "Ed Harris",
               "profile_path": "/atzm7ZGRFSWJHQT6qKmzjmNQ9GA.jpg",
               "id": 228,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Frank Wheeler",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab2db",
               "name": "Michael Patrick Carter",
               "profile_path": null,
               "id": 56486,
               "order": 2
            },
            {
               "cast_id": 16,
               "character": "Waltzer",
               "gender": 2,
               "credit_id": "55204684c3a3684dd40023e0",
               "name": "Malcolm McDowell",
               "profile_path": "/lnVJ6J8szi86ssDTfyvZSl8lnlr.jpg",
               "id": 56890,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Betty",
               "gender": 1,
               "credit_id": "52fe44cec3a36847f80ab2e3",
               "name": "Anne Heche",
               "profile_path": "/aXMySUgcAJ09dq0oD0qY1mcsr1c.jpg",
               "id": 8256,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Cash",
               "gender": 2,
               "credit_id": "5520468e9251417be20015b8",
               "name": "Casey Siemaszko",
               "profile_path": "/kW2A2OrOMnlU7FoVDFbFmZJIUa8.jpg",
               "id": 1953,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Jerry the Pope",
               "gender": 2,
               "credit_id": "5520469c9251415c7a001f44",
               "name": "Philip Bosco",
               "profile_path": "/8B8EQk868fQF8fGZ1w33XDV5Z1S.jpg",
               "id": 6541,
               "order": 6
            },
            {
               "cast_id": 4,
               "character": "Brad",
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab2df",
               "name": "Adam LaVorgna",
               "profile_path": "/hynib27Gn37y1gMvz2zUrvs7VtH.jpg",
               "id": 56487,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Kevin Clean",
               "gender": 2,
               "credit_id": "552046e4c3a3684dc1001fc3",
               "name": "Brian Christopher",
               "profile_path": null,
               "id": 1449695,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab2e9",
               "name": "Richard Benjamin",
               "profile_path": "/9BQ5QcoCA7sfQzPvBpX8U4zDXqn.jpg",
               "id": 24318,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cec3a36847f80ab2f5",
               "name": "Frank Marshall",
               "profile_path": "/dVPOD85wQ1Xscpe3DOVQ1I59IIF.jpg",
               "id": 664,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44cfc3a36847f80ab2fb",
               "name": "Kathleen Kennedy",
               "profile_path": "/6rGtk7OdbkO2QDM2OQxt9Blww3O.jpg",
               "id": 489,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab301",
               "name": "Patrick J. Palmer",
               "profile_path": null,
               "id": 10829,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab307",
               "name": "Michael Convertino",
               "profile_path": null,
               "id": 4055,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab30d",
               "name": "David Watkin",
               "profile_path": null,
               "id": 10639,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44cfc3a36847f80ab313",
               "name": "Jacqueline Cambas",
               "profile_path": null,
               "id": 33830,
               "department": "Editing",
               "job": "Supervising Film Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44cfc3a36847f80ab319",
               "name": "Michael Finnell",
               "profile_path": null,
               "id": 16154,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59e6fc5a9251416ead006ee6",
               "name": "John Mattson",
               "profile_path": null,
               "id": 56488,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.781448,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 8986,
      "vote_count": 69,
      "budget": 0,
      "overview": "Three young boys pool their money and pay V, a kindhearted prostitute, to strip for them. Afterward, she drives them home to the suburbs -- but then her car breaks down. It's just as well, though, because a mobster named Waltzer is after her, and V realizes the suburbs are the perfect place to hide. But things get a lot more complicated when V falls in love with Tom, a single father who is unaware of her real profession.",
      "similar": [
         1904,
         15092,
         2690,
         26973,
         466,
         50270,
         34647,
         649,
         182560,
         27274,
         157847,
         1554,
         9005,
         13441,
         26579,
         1626,
         31007,
         49010,
         13855,
         30877
      ],
      "original_title": "Milk Money",
      "runtime": 108,
      "poster_path": "/94AgmLpD2NtCSwJ13rof6Bn5mfN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "The Kennedy/Marshall Company",
            "id": 862,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         }
      ],
      "release_date": "1994-08-31",
      "vote_average": 5.7,
      "belongs_to_collection": null,
      "tagline": "You can't get enough of a good thing... But first you have to find it.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Richard Benjamin"],
      "runtime": 110,
      "synopsis": null,
      "writers": ["John Mattson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110516/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ1NDQ3NzU4NV5BMl5BanBnXkFtZTcwNTA1MTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Melanie Griffith, Ed Harris, Michael Patrick Carter | See full cast and crew »"],
      "reviews": [
         "Very conservative people might not like the plot of this film (kid tries to get his widowed dad and an ex-hooker to fall in love with each other), but actually everything is quite harmless and fun. The story gets sometimes a bit silly (especially when the boy takes Melanie Griffith to school as part of his \"science project\"), but the acting and the comedy is good. There was always a smile on my lips as I watched the misunderstandings between Harris and Griffith, when the dad believes that she is a math tutor and the hooker believes he knows her true job. Ed Harris does a good job as the shy father, and Melanie Griffith is believable as the golden hearted hooker. But it's the kid (Michael Patrick Carter) the one who steals the show, with his winning smile and his mixture of innocence and curiosity.",
         "I saw \"Milk Money\" when I was eleven; much of what happens in the movie is the sort of stuff that would make any eleven-year-old boy think \"Whoa...cool!\" Looking back on it, I still think that it was pretty funny, but was it the most mature movie? No, and it doesn't pretend to be. I read somewhere that this movie was sexist; I wouldn't know one way or the other. All that I interpreted was that the movie was a nice, horny excuse to have fun. Richard Benjamin has proved himself to be quite capable as a director, and this adds to that. I know, the prostitute-with-a-heart-of-gold context is a cliché, but this is a comedy, so it passes. And believe you me, this V (Melanie Griffith) is definitely a V for vendetta! Also starring Ed Harris, Malcolm McDowell, Casey Siemaszko, and a very young Anne Heche. Really entertaining, especially the report on the female reproductive system.",
         "I'm sick of reading bad reviews of this movie. This is such a funny, heartwarming and endearing film. One look at the premise and many people would think it's hard to make the movie work that way but it does. This was my favorite movie of 1994 and it works on so many levels. The interaction between the actors is fantastic. Even though it is more a light-hearted comedy the teenaged stars are given a realistic treatment throughout the film which is something rarely see in film. Michael Patrick Carter, Melanie Griffith and Ed Harris are all stellar. This movie is filled with wonderful enduring scenes and is truly a delight.",
         "In some cases I'd say this is better then Pretty Woman. I say \"some\" with weight because Pretty Woman is a classic. But Milk Money fills that \"hole\" you had watching pretty woman. Ed Harris's character is sincere and attentive which matches Melanie's softness (which at the best of times can spoil her on screen performances) perfectly. It's a classic boy meets girl movie with that dash of \"damsel in distress but is now hardened and tough due to life being so rough and who now finally meets a man who breaks through it all and understands and loves her for who she is\" - as far as romantic comedies go- it was better then I thought it would be and even gets the heart strings welling when Ed Harris tells her \"this could hurt\"...The story itself can be at times almost childish, but in the end that's part of it's charm.",
         "I am always interested to see what actors can and will do in their work. I got such a strong Klute vibe from Ms. Griffith in the beginning of this movie. And it was nice to see Ed Harris just be Dad. The story itself is one of those adult fantasies that utilizes the kid mystique. Of course the-Hooker-and-the-Dad plays out an adult fantasy of its own. It turned out not to be a movie i would share with kids, in spite of its rating. It's a \"yeah, sure\" movie, white bread with way too much jam. BUT, i'm still glad i saw the work of the six pros who make it a viable (okay enjoyable--i enjoyed it)i'm-too-tired-tonight-to-move home entertainment. Yes, Virginia, there is a Hollywood.",
         "'Milk Money' gets its title from the idea that a group of prepubescent boys pool together their money to pay a hooker for a peek at her breasts. If this sounds like a smutty and degrading idea, then it pains me remind you that this is a family picture. First, let's start with that basic idea. In the days of 537 cable channels as well as the internet as well as old reliable \u0096 dad's porn stash - why would a group of prepubescent boys want to waste their time looking for a hooker. Because they are all dimwits and because the movie needs an idea from a better movie to reside over it's languid plot. The better movie being Pretty Woman which somehow managed to sidestep every cliché and empty-headed idea that this movie has. The hooker, named V (Melanie Griffith) has a heart of gold. Why a heart of gold? Because it would explain why she doesn't seem to worry about social diseases or AIDS, it explains one of the reasons that she is so willing to leave the trade, it allows for the fact that she never has to explain how she got on the streets in the first place and it makes her a suitable mate for the kid's widowed father \u0096 that's why! As if trying to weld those ideas together isn't bad enough then we have to contend with V's evasion from the Mafia who think V stole money from them. Then we get the father (Ed Harris) who is so hapless and stupid as to not notice that his kid is hiding a hooker in his treehouse and when he finally meets her is the last to figure out what her profession is. Then we have to throw in a subplot alluding to the fact that he wants to save some wetlands from being turned into a parking lot leading to one of those scenes where he is chained to a his car to keep the bulldozer from wrecking the place 'Milk Money' can't exist as a tease because there is a kid in the way. We know that since it's a family picture that the presence of a prostitute means that the movie will exclude any of the expected 'exposure'. So instead it has to throw in all these hackneyed cutesy clichés in order to attract and audience whose attention span is as long as your hand. Rating: * (of four)",
         "I've loved this movie ever since I was a kid, and after about a dozen viewings (damn, I've been having too much time) there's one question that still bothers me: who's this movie aimed at? On the surface it definitely looks like a family movie. You have your Disney-like music under almost every scene, you have your tired, clichéd story about kids wanting to make sugary sweet adults fall in love, you have your character that gets his heart cut out wait what? You have your hapless but likable kids who pull all kinds of school shenanigans, you have...Malcolm McDowall as a crazed pimp who pulls out his gun at a school dance? This movie just bounces all over the place, but it's fascinating rather than bothersome. Furthermore, even after so many times this is still a pretty effective little tearjerker. You know this stuff is probably going to end well (with someone getting his heart cut out?), but getting there is quite touching. You know she'll stay in the end, but still, don't leave. Ed Harris and Melanie Griffith also have near-perfect chemistry, it always helps if the protagonists of your romantic comedy look like they actually want to be there. \"Milk Money\" has its shortcomings because it's essentially an off-brand \"Pretty Woman\", but it's a childhood memory that I kinda cherish to this day.",
         "Young Frank Wheeler (Michael Patrick Carter) and his two friends have the brilliant idea to pool their milk money and head to the closest city to flag down a woman to show them her boobs. This brilliant notion allows them to cross paths with V, a prostitute played by Melanie Griffith, who ends up following them back to their small town on the run from her pimp. There Frank's mild-mannered single dad Ed Harris falls for V, not realizing her background. I am really hard-pressed to figure out who the audience for this film is. It is entirely too smutty for a family film and no where near smutty enough for the adults that may find this theme appealing. Director (and former actor) Richard Benjamin continues to be a director of limited merit. It is absurd that in this day and age kids like Frank and his friends could not see bare boobs by sneaking into a movie theater or looking in art books or Playboy, but would resort to traveling to the Big City and being slapped by offended women who they approach in their naive and guileless way with their sordid offer. And am I the only one tired of the Big City being depicted as a morass of immorality while the Small Town gets idealized into some romantic bubble of innocence? How innocent can it be with kids like Frank running loose (not to mention the one kid's dad who knows V from past experience)? Harris is adequate as Frank's clueless dad, but how disheartening that in a few years time Melanie Griffith went from her Oscar-nominated peak in Working Girl to this dismal development. Griffith looks tired and blowsy as V. She is also reduced to playing one nonsense scene (which truly makes no sense at all) wherein she shows up at Frank's school in a tight outfit so he can give an anatomy demonstration in class. The scene comes out of no where narratively, is not funny at all, and since the film has no nudity it serves no titillation purposes. One is just incredibly embarrassed for all involved. Naturally, all of this ends with a madcap, badly done car chase with the kids frantically driving V to safety from associated villains, because what cheesy film does not have a car chase for no good reason. Similarly, to say the \"happy\" ending is beyond a stretch would be pointless.",
         "Frank's father Tom Wheeler (Ed Harris) doesn't like to talk about his dead mother. He is struggling to understand girls. With his two friends, they decide to go to the city and pay to see a naked woman. The boys get robbed in a parking lot only to be rescued by V (Melanie Griffith). She happens to be a hooker and she flashes them her boobs. Cash (Casey Siemaszko) is her pimp and Waltzer (Malcolm McDowell) is his boss. The boys get their bikes stolen and V drives them home. Her car breaks down and Frank tells his father that she's a math tutor. He's a school teacher trying to save a tiny neighborhood wetland. She ends up living in Frank's treehouse and Frank wants her to marry his father. Cash stole money from Waltzer and is killed but only after telling him that V has the money. It's a strange thing to make a comedy about young kids and a hooker. It's not a kids movie but it's way too light weight to be anything else. The kids seem way too young to be so deep into sex education. A hooker in the suburb is an odd proposition already but director Richard Benjamin keeps trying to make this into a family movie ... with a lot of talk about sex. At some point, one would expect Melanie Griffith to button up her blouse at least. The problem is all the sex material is connected directly with little kids and any laughs from that are awkward at best.",
         "I guess to simply describe this movie would be to call it a Pretty Woman clone. Basically a guy meets a prostitute, falls in love with her, and in the end she gives up her job for him. The problem is that this movie is sort of lost between whether it is an adult comedy or one directed at young teens. Basically the main character in this film is a young teen who lost his mother and his father is caught up with this loss. The movie is about a group of kids going through that time when they begin to discover women and women begin to discover them. They are studying sex education at school, and instead of relying upon the biology textbooks, they decide to scrape together $100 and go to the city to see a naked woman. The woman they find ,V, is a prostitute but really wants to get out of it, and ends up helping the kids out by taking them home. She gets stuck in the suburbs, meets and falls in loves with the kids' father and decides she wants to stay, but unfortunately her past is always haunting her. This movie is really a lower grade version of Pretty Woman. Okay, Pretty Woman was way over-rated, and in the end really did not impress me that much. This movie didn't really promise anything, and I believe that it was actually a straight to video release (at least in Australia), which goes to show that in the end, it was not really that worth getting onto the screen. Still, it was better than some of the garbage that gets up there, and in fact the movie held itself together, and had the morale ending stating that lying never gets you anywhere, but she also landed up keeping a lot of dirty money, so if there is supposed to be a morale there, it is lost because in the end that it approves of other immoral stuff."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Kennedy/Marshall Company, The"
      ],
      "summaries": [
         "Young Frank and his pals get an idea for the ultimate in excitement. They decide to pool their savings, bicycle to the nearby Big City, and hire some woman of the streets to strip for them. Things do not work out that simply, but they do meet V, a Hooker With A Heart Of Gold, who ends up giving them a ride home. Soon she is living in Frank's treehouse, unbeknownst to Frank's widowed father Tom, who thinks she is one of Frank's teachers. Soon, however, the evil Waltzer comes looking for V.",
         "Twelve year old Frank becomes friends with V, a sweet young woman, despite the fact that they live in very different worlds. She has been working as a prostitute and he is the son of a regular guy living in a nice suburban home. Frank offers her his tree house to stay for a while without his father's knowledge. She helps Frank with his schoolwork in a hilarious scene in which she acts as his assistant in a lesson on reproduction in the classroom. He draws ovaries on her midriff while the teacher tries keys to unlock the door. Frank would like V, the sweet young prostitute, to marry his father and become his stepmother. When his father, Tom, does meet V, he falls for her in a big way. And she is taken with him also. The romance progresses and he asks her to marry him. She says \"Yes.\" But danger enters the picture when her \"manager\" tracks her down at the high school dance where she, Frank and Tom were having a good time. Frank perceives the threat and causes chaos by pulling the fire alarm to divert attention and makes off with V in her car accompanied by his pals. They are hotly pursued by Waltzer the pimp, a wild chase ensues and ends in a car crash at the train tracks. Everybody tumbles out of the car before it explodes. Waltzer gives up, assuming his money in the car has gone up in smoke. V reappears soon afterwards and saves Tom's house by paying off the mortgage. She had discovered a large sum of money in a backpack.Waltzer was looking for that money but would never find it now. She also bought the downtown ice cream parlor. Now she can be close to Tom and Frank but they can take their time and let the romance develop before rushing into marriage. The love is all around and makes this a sweet story."
      ],
      "budget": 0
   },
   "movielensId": 276,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-08-31",
      "dvdReleaseDate": "2003-09-09",
      "directors": ["Richard Benjamin"],
      "runtime": 108,
      "movieId": 276,
      "title": "Milk Money",
      "mpaa": "PG-13",
      "actors": [
         "Melanie Griffith",
         "Ed Harris",
         "Michael Patrick Carter",
         "Malcolm McDowell",
         "Anne Heche",
         "Casey Siemaszko",
         "Philip Bosco",
         "Adam LaVorgna",
         "Brian Christopher"
      ],
      "imdbMovieId": "0110516",
      "originalTitle": "Milk Money",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["UuaARlicot8"],
      "plotSummary": "Three young boys pool their money and pay V, a kindhearted prostitute, to strip for them. Afterward, she drives them home to the suburbs -- but then her car breaks down. It's just as well, though, because a mobster named Waltzer is after her, and V realizes the suburbs are the perfect place to hide. But things get a lot more complicated when V falls in love with Tom, a single father who is unaware of her real profession.",
      "tmdbMovieId": 8986,
      "avgRating": 2.98255,
      "releaseYear": "1994",
      "numRatings": 5730,
      "posterPath": "/94AgmLpD2NtCSwJ13rof6Bn5mfN.jpg"
   }
}