{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0129111",
      "video": false,
      "title": "The Gambler",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fyodor Dostoyevsky",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c91111719",
               "name": "Michael Gambon",
               "profile_path": "/k6VxRs7xcG6DLEVM1izjb3UWSyC.jpg",
               "id": 5658,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Anna Snitkina",
               "gender": 1,
               "credit_id": "52fe4d4d9251416c9111171d",
               "name": "Jodhi May",
               "profile_path": "/oMkEhQlGoKVIaz8egWuqCo9bPCQ.jpg",
               "id": 57449,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Polina",
               "gender": 1,
               "credit_id": "52fe4d4d9251416c91111721",
               "name": "Polly Walker",
               "profile_path": "/nUYl7W4QcO9ud2ig6qvLQ2qs0HZ.jpg",
               "id": 6416,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Alexei",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c91111725",
               "name": "Dominic West",
               "profile_path": "/56zmVMiuUhqas13xn700hvXUA32.jpg",
               "id": 17287,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Grandmother",
               "gender": 1,
               "credit_id": "52fe4d4d9251416c91111729",
               "name": "Luise Rainer",
               "profile_path": "/kX4vs7uLsRwAV3wRsXlO86Q63MA.jpg",
               "id": 125482,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Pasha",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c9111172d",
               "name": "William Houston",
               "profile_path": "/gc1DrDlzfQcA7gxx9Ke7Ul8vgww.jpg",
               "id": 84865,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "De Grieux",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c91111731",
               "name": "Johan Leysen",
               "profile_path": "/cjLEEzFfEGoEEpHnNxjfso04Dd0.jpg",
               "id": 53904,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "The General",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c91111735",
               "name": "John Wood",
               "profile_path": "/bWt4JT9eGxFtu3q0iCAKFtNv5XK.jpg",
               "id": 8937,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mlle. Blanche",
               "gender": 1,
               "credit_id": "52fe4d4d9251416c91111739",
               "name": "Angeline Ball",
               "profile_path": "/kmyjfoY9pZCwMyGLcP1P7lQfV9e.jpg",
               "id": 63358,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Mme. de Cominges",
               "gender": 0,
               "credit_id": "52fe4d4d9251416c9111173d",
               "name": "Marjon Brandsma",
               "profile_path": null,
               "id": 1045524,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Ivan",
               "gender": 0,
               "credit_id": "52fe4d4d9251416c91111741",
               "name": "Mark Lacey",
               "profile_path": null,
               "id": 1177288,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Maikov",
               "gender": 0,
               "credit_id": "52fe4d4d9251416c9111175f",
               "name": "Gijs Scholten van Aschat",
               "profile_path": "/Au28OTwwvU7x80sZxMp34m6Um7E.jpg",
               "id": 87915,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Dunya",
               "gender": 1,
               "credit_id": "593b79e9c3a3680f42006a55",
               "name": "Lucy Davis",
               "profile_path": "/3Qpcq4Pu8lKXtHxtUEHqyOuibbn.jpg",
               "id": 11111,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Professor Olkhin",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c91111749",
               "name": "Patrick Godfrey",
               "profile_path": "/n6q70F8UE4VSSHAjBlx3xBMqxY2.jpg",
               "id": 3568,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Ustinya",
               "gender": 0,
               "credit_id": "52fe4d4d9251416c9111174d",
               "name": "Greet Groot",
               "profile_path": null,
               "id": 1177291,
               "order": 14
            },
            {
               "cast_id": 16,
               "character": "Potapych",
               "gender": 0,
               "credit_id": "52fe4d4d9251416c91111751",
               "name": "András Fekete",
               "profile_path": null,
               "id": 1177292,
               "order": 15
            },
            {
               "cast_id": 17,
               "character": "Stellovsky",
               "gender": 2,
               "credit_id": "52fe4d4d9251416c91111755",
               "name": "Tom Jansen",
               "profile_path": "/5qQo8NH3OQE90cHDlWUPQ197D6D.jpg",
               "id": 211080,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4d4d9251416c9111175b",
               "name": "Károly Makk",
               "profile_path": "/98pjPrapgGQNRzD35DvSEIGyLCD.jpg",
               "id": 923620,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59fdff6dc3a36867f60222f4",
               "name": "Fyodor Dostoevsky",
               "profile_path": "/hMm3y5n60KNvLB5F14oCfo8imSK.jpg",
               "id": 223230,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "59fdff75925141473301fd93",
               "name": "Katharine Ogden",
               "profile_path": null,
               "id": 1917544,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "59fdff84c3a368686801e95a",
               "name": "Nick Dear",
               "profile_path": null,
               "id": 137933,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [],
      "popularity": 1.192934,
      "production_countries": [],
      "id": 197239,
      "vote_count": 0,
      "budget": 0,
      "overview": "Under pressure from his publisher, Russian novelist Fyodor Dostoyevsky gets work on his latest piece, 'Rouletenberg'. In the 27 days it takes for him to complete the novel reality and fiction become blurred; in this feverish atmosphere of excess Dostoyevsky's characters come to life as he struggles to complete his work.",
      "similar": [],
      "original_title": "The Gambler",
      "runtime": 97,
      "poster_path": "/Agw9swRzT91Ew7OJMpM6fnPPlmB.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1997-10-30",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "In the grip of obsession, reason is suspended.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Netherlands",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Károly Makk"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Fyodor Dostoevsky",
         "Katharine Ogden"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0129111/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIzNDEzNDI3N15BMl5BanBnXkFtZTcwNzkyNjgxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Michael Gambon, Jodhi May, Polly Walker | See full cast and crew »"],
      "reviews": [
         "Luise Rainer more or less vanished after winning a couple of Oscars for Louis B. Mayer in the thirties. My biographical snooping doesn't yield much in the way of clues, but it seems likely that, Louise Brooks-like, Rainer had simply had it with the movie colony. She has been plucked out of retirement only on brief occasions since the end of the Second World War, but never so spectacularly as in Karoly Makk's adaptation of Dostoevsky's THE GAMBLER. As the antihero's dowager-empress grandma, Rainer has two big scenes: they're all about the strange, giddy, self-annihilating glee the old bat experiences discovering what the fun of roulette is all about. Rainer looks and feels like a jaunty, no-cares twenty-five-year-old girl in old-age makeup. (This performance may, for all I know, be a Bowfinger-like stunt by Angelina Jolie.) Rainer, who came into pictures just as sound came in, has a post-Stanislavskian snap that you can't explain. She should be paraded across the screen like a bull elephant, as with Gloria Stuart in TITANIC or James Cagney in RAGTIME, but she gives an electrifying performance. You can feel the audience come alive every minute her face fills the screen. The rest of this threadbare period piece is ruins. At a curt but not brisk 97 minutes, the movie seems to have been hacked down to cable-softcore-movie length by the front office. Karoly Makk gets special dispensation for that crime, but in honesty it doesn't look as if there were much here in the first place. The movie details the 27 days in which Dostoevsky had to write THE GAMBLER or lose all rights to his future work, and it manages to convey exactly nothing about obsession, creation, lust, destitution, joy, connivance, religiosity, or gambling. (It does scarcely better with epilepsy and foot fetishism.) Michael Gambon, a hangdog piece of British baggage who gave great performances in the works of Peter Greenaway and Dennis Potter, gives a stagy, self-absorbed performance as Dostoevsky. The other non-Rainer personnel fare scarcely better--except for a couple of weirdly out-of-place Page Six hotties who seem contrived to be a duet of existential Spice Girls.",
         "Though I had not previously heard of this movie \"The Gambler\", I found it a very pleasant surprise as a late night TV movie. It told the story of a Russian author & portrayed some of the characters significant to his life & writings, & that his secretary Anna, who was penning his manuscript for him. I do not know how close to Dostoyevsky's real life this setting was, but I do know that he was jailed as a political activist in his youth, flung in with the struggles & downtrodden lives of anyone from petty criminals to hardened murderers, in extremely oppressive jails that were often a source for the characters in his novels. This movie does an admirable job of portraying the addictive aspect of gambling, tempting & drawing the characters as well as the viewer, into the world of casinos frequently by the rich, the curious & the desperate. But just as intriguing is the secondary plot of this movie, which looks in the complexities of relationships of some of the characters involved in the gambling & how easily it escalates beyond the imagination of those partaking in such thrills. Amidst all this, we gain a glimpse into the underlying passions, the romance, the ambiguous motives, even of Dostoyevsky & this young lady presented as of much more ethical substance than one who'd governed Dostoyevsky's heart from his youth. I thought the acting is also very good, both from Michael Gambon as the author & Jodhi May as Anna, his pen. The street & casino settings are likewise impressive. All in all, \"The Gambler\" is a worthy detour for a couple of hours, into the lives of the protagonists & those they portray.",
         "Makk's take on the 27 days Dostoyevsky worked to complete the novel 'Rouletenberg' is a mediocre attempt to inject some kind of passion into a direly dull subject. Themes of obsession and lust are all there bubbling under the surface but we never get under the skin of it, we never really go through the experience with Dostoyevsky, which ultimately means we hardly give a care. The saving grace in amongst some incredibly earnest, yet unaffecting performances, is Luise Rainer's mesmerising ten, or so, minutes on screen. All wide-eyed and full of charm, she steals the movie,as the Grandmother relishing the chance to play at roulette for the first time. The anticipation, delight, and despair in this brief appearance leave you wanting more. Sadly, there isn't any! Makk's film looks good, with the requisite period detail, and atmospheric slo-mo, and overlapping repeat shots, but with such a lacklustre story it didn't really ignite any enthusiasm in this viewer.",
         "Based on the true events of the writing of The Gambler, Dostoyevsky meets the much younger Anna when she comes to him as stenographer. This is as much a tale of chaste love as it is romantic, and the interweaving of the fiction they scramble to put together in order to keep him out of debt (and avoid losing the rights to all his works, both present and future!) with the elements of their reality is seamless and thoroughly engaging. The incomprable Louis Ranier shows up long enough to lose her fortune at the roulette table -- and the entire movie in three short scenes. I highly recommend this for fans of unconventional love stories and Masterpiece Theater. Those whose tastes run a bit faster may find themselves bored by the pacing and lack of flesh (but for Polly Walker's beautiful backside in one spicy scene). All in all, this one was much better than anticipated and I wouldn't mind keeping it in my collection.",
         "I ran to see this at its initial release, because I'd read most of Dostoevski's work and could not resist a film with such high credentials. My second viewing confirms the film as a masterful lie like truth. It must have been this way, even if it wasn't. The scenes of the novel reflect those of the writing, but palely, as the collaborators construct an engaging and deeply felt film out of the writing of a pretty darn good work of fiction, which Dostoevski created out of his own experience and insight. Makk and the screenwriters have followed the wise course of giving the best actors, most naturalistic style and deepest characters to the frame tale: The saga of the life-ravaged writer's race to finish his novel or lose his future. The writer's story, of obsessed gamblers at a casino in Germany, is stylistically distanced in performance as well as character depth and cinematography. As the novelist's deadline approaches and the novel's characters meet their fates, the two merge in a delicately hallucinatory interaction which is carried into a deeply satisfying and complex conclusion.",
         "Someone decided that the story of Fyodor Dostoyevsky writing The Gambler might be a better story than the novella itself. Thus this film The Gambler came into being. Michael Gambon plays Dostoyevsky who is really under the gun. He should have had a lawyer looking over the contract he signed with a publisher. He had a year to deliver a novel to them and if he didn't everything word he ever would write would belong to that selfsame publisher. Of course our friend Fyodor spent the advance quite liberally on his pleasures and now he's got only a month to deliver a book. So Gambon takes the unusual step of hiring a live-in stenographer to take down his words played by Jodhi May. She gets to live and observe the Dostoyevsky family their talents and their excesses. From which came the novella The Gambler. Gambon plays Dostoyevsky as a man like a lot of gifted people, someone whose talents seem to entitle them to excessive behavior. To be sure this also was a man survived Siberian exile and is probably enjoying the fleshpots of Moscow as much as he can. The Gambler is also the final appearance of recent centenarian Luise Rainer. She plays the live person who became the grandmother in the novella who threw her fortune away at roulette. Unless someone gets the idea to team Luise with upcoming centenarian Gloria Stuart and wouldn't that be an interesting film, I doubt she's doing another. It's worth it to see her give one bravura performance. Great literature gets born under unusual circumstances. Talk about publish or perish. The Gambler is an interesting piece on the life of its creator Fyodor Doestoyevsky.",
         "This movie was very disappointing. The scenes which were adapted from the novel were brief (none lasted more than three minutes) and gave NO details. Had I not read the book, these scenes would have made no sense at all. Even having read the book, they were worthless to the overall film, especially since they lacked Dostoevsky's narration which is probably even more important to the novel than the bare sketches of the scenes. As far as the biographical scenes, which made up most of the film, they were decent enough but not good in any sense of the word. The dialogue was limited and a bit contrived. The acting was unnatural and mediocre. Another reason this movie was bad is the casting. Gambon, especially without Dostoevsky's trademark beard, was pretty unsuited to the role. Polly Walker, Jodhi May, Dominic West and Luise Rainer were good, but the rest of the actors just didn't seem well-suited to their roles. Finally, the sound was poorly done. One minute they'd whisper and I'd have to turn the volume to 25, the next they were shouting so loud I had to turn it to 7. The music also was too loud compared to dialogue. Overall, a poor film. If you're a fan of the novel or Dostoevsky, this movie is horrid. If you're looking for an introduction to Dostoevsky, this movie gives the entire wrong impression. P.S. What was up with the panty-sniffing scene? That was so not in the book..."
      ],
      "genres": [
         "Biography",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Canal Plus Image International",
         "Channel Four Films",
         "Gambler Productions"
      ],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 2760,
   "movielens": {
      "languages": [""],
      "releaseDate": "1997-10-30",
      "dvdReleaseDate": "2002-11-19",
      "directors": ["Károly Makk"],
      "runtime": 97,
      "movieId": 2760,
      "title": "The Gambler",
      "mpaa": null,
      "actors": [
         "Michael Gambon",
         "Jodhi May",
         "Polly Walker",
         "Dominic West",
         "Luise Rainer",
         "William Houston",
         "Johan Leysen",
         "John Wood",
         "Angeline Ball",
         "Marjon Brandsma",
         "Mark Lacey",
         "Gijs Scholten van Aschat",
         "Lucy Davis",
         "Patrick Godfrey",
         "Greet Groot",
         "András Fekete",
         "Tom Jansen"
      ],
      "imdbMovieId": "0129111",
      "originalTitle": "The Gambler",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "Under pressure from his publisher, Russian novelist Fyodor Dostoyevsky gets work on his latest piece, 'Rouletenberg'. In the 27 days it takes for him to complete the novel reality and fiction become blurred; in this feverish atmosphere of excess Dostoyevsky's characters come to life as he struggles to complete his work.",
      "tmdbMovieId": 197239,
      "avgRating": 3.19811,
      "releaseYear": "1997",
      "numRatings": 53,
      "posterPath": "/Agw9swRzT91Ew7OJMpM6fnPPlmB.jpg"
   }
}