{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0168449",
      "video": false,
      "title": "The Adventures of Sebastian Cole",
      "recommendations": [],
      "backdrop_path": "/cHoYCwyN8ktba3wksd4wkRaaCXF.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Sebastian Cole",
               "gender": 2,
               "credit_id": "52fe4761c3a368484e0c3d7d",
               "name": "Adrian Grenier",
               "profile_path": "/qihY533cCB11VYChNN2ym1RfPkU.jpg",
               "id": 5090,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Hank / Henrietta",
               "gender": 2,
               "credit_id": "574b58f8c3a36840cc0006fa",
               "name": "Clark Gregg",
               "profile_path": "/t8CLS2Zcy7IjcZkE1vtxl40h9rh.jpg",
               "id": 9048,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Mary",
               "gender": 1,
               "credit_id": "574b590c92514119a500146d",
               "name": "Aleksa Palladino",
               "profile_path": "/nTpCRzn8raVlqLQfBP9oaAT3pXF.jpg",
               "id": 53441,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Joan Cole",
               "gender": 1,
               "credit_id": "574b591fc3a3683561000826",
               "name": "Margaret Colin",
               "profile_path": "/adlW4gq2BZTopzvWb28UgWnu5w1.jpg",
               "id": 8985,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Hartley Cole",
               "gender": 2,
               "credit_id": "574b59369251413f2f001ed1",
               "name": "John Shea",
               "profile_path": "/tSgR1D3beLbYxV1gIL0wOLY1Gs6.jpg",
               "id": 78439,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Jessica Cole",
               "gender": 1,
               "credit_id": "574b594bc3a3683a5e001fa0",
               "name": "Marni Lustig",
               "profile_path": "/suBEVqajQrY9c4sbxKsNnRY8Yzj.jpg",
               "id": 122550,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Anne",
               "gender": 1,
               "credit_id": "574b5965c3a368356100082e",
               "name": "Tennison Hightower",
               "profile_path": "/vsaL0bd3l4FXNKuojJpFGw8YYrR.jpg",
               "id": 1628317,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Troy",
               "gender": 2,
               "credit_id": "574b59fec3a368319a002e6d",
               "name": "Gabriel Macht",
               "profile_path": "/dm8TsNrZqU3m91XqX0rX7A2RLXT.jpg",
               "id": 16856,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Fiona",
               "gender": 1,
               "credit_id": "5793fbf69251414c380008bb",
               "name": "Famke Janssen",
               "profile_path": "/9wHWq6Mnfpn8L1diMxjr26ReZWl.jpg",
               "id": 10696,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4761c3a368484e0c3d79",
            "name": "Tod Williams",
            "profile_path": null,
            "id": 20133,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.918861,
      "production_countries": [],
      "id": 67323,
      "vote_count": 2,
      "budget": 0,
      "overview": "In June, 1983, in Dutchess County, New York, Sebastian Cole joins his mother, step-father, and sister for dinner. Hank, Sebastian's step-father, drops a bomb: he announces he's changing sexes. Sebastian's sister splits immediately for California, and his mother takes him back to England. Jump ahead eight months, Sebastian is back in New York, knocking on Hank's door. Hank (now Henrietta, although all the surgeries aren't complete) takes Sebastian in and is his rock over the next few months of high school. Sebastian's \"adventures\" are mostly self-destructive.",
      "similar": [],
      "original_title": "The Adventures of Sebastian Cole",
      "runtime": 99,
      "poster_path": "/8ZXDdF8Z8HgPNvcehjdXkguSvD5.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-11",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tod Williams"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Tod Williams"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0168449/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzk3NTYyMzgyNV5BMl5BanBnXkFtZTcwNDcxMTMyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Adrian Grenier, Clark Gregg, Aleksa Palladino | See full cast and crew »"],
      "reviews": [
         "This little film is surprisingly quite observant of it's characters and doesn't turn this film into a crazy Farrelly bros. comedy or silly farce. I has good performances,especially from the lead,Grenier,who shows a lot of depth and mystery. You kinda can understand the quiet hauntings inside his head and the fact that he doesn't want to attach to anyone. It's a film that really brings out the trappings of what it is really like to be a growing young adult coping with the problems of understanding love,sex,school,sex changes,stepfather wanting a sex change(I know this is not a usual trapping..just being silly),and wanting more from life than the expected future. Sebastian wants to go on \"adventures like Ernest Hemingway.\" That's the lifeblood of the film. Cole is not your ordinary kid..he thrives to get the most from his life..he wants to discover emotions and unpredictable happenings. He puts himself in situations just to see what results wil occur. He is a complex character and that is what makes this little film special..it's a breath of fresh air and a good experience. ****/*****",
         "The film is criticized for not going anywhere, but I think this is because some critics can't handle a storyline that doesn't have an action-based, simplified plot. The story is coherent and flows well. There is no wasted time - small moments are significant. The visual symbolism (such as the arrow that falls between Sebastian and Mary) is fantastic, as is the dialogue. There is no empty imagery. Many films rely too much of the visual element. The writing was great, and so was the camera work. And the acting. Bravo to the whole crew. I hope that Tod Williams is in it for the long haul and writes _and_ directs more work of his own, and soon. If someone out there knows him and thinks he needs an ego boost on a bad day, please pass this along.",
         "A comical and realistic view of the real world of high school without all that American Pie/She's All That crap about just capitalizing off of what kids WISHED their high school life was like. This truly was a movie that had everything in it: great wit, great drama, a great plot, great music, and great acting. If the distributor had only allowed it to more theaters, it would have surely been more of a success as most people HEARD it was good, but were not able to see it since it was only released in a few places for a few days. Kudos to Tod Williams.",
         "I expected a lot more out of this film. The preview looked interesting so I decided to check it out. Bottom line is that \"The Adventures of Sebastian Cole\" only had one decent thing: Adrian Grenier. I really like Grenier and found his performance to be very pleasing. The character is designed well, but everything else sort of just drifts along through the duration of the movie. Clark Gregg is really good, but I don't think that his character was explained too well. I mean there's not too much to explain; he wants to become a woman. Still, something was missing. The obvious low budget of the film was nice to see. I enjoyed that the movie was filmed on just a script (a bad one at that) and just a few actors. It was a nice change. While the main idea of the film was actually okay, it became disappointing to see a lot of scenes that had nothing to do with it just thrown in here and there. Like I said, the script looked promising and I must say that I was interested where director Tod Williams was headed, but it was basically a very slow movie with not too good of dialogue. \"Sebastian\" started to look good towards the end, but again, it fell right back down into a hole. The acting was mostly good, the writing is in need of some work, yet the budget of the film helped it out in the long run. I would recommend this to someone if they wanted to watch a quiet movie with a strong lead character, but other than that I would stay away. Personally, I wouldn't watch it twice.",
         "Rarely does a film capture with any kind of authenticity the subtleties of the qualities of a particular time and place. When it does so it is something that can be appreciated not for standing out from the story but for becoming integral to the fabric of the narrative. The \"Adventures of Sebastian Cole\" achieves this rare unity of time, place, character and story and it does so in the most unassuming way. The atmosphere of Sebastian's world is undeniably one of normalcy and yet it is also undeniably beautiful and rich with possibilities for anything. In this world even the smallest of pleasures, the smallest of adventures takes on a sublime quality and seems ready to infect the future of the character with an understanding and appreciation of his youth. We can appreciate everything about this story for being small and unassuming and yet alive. Sebastian's confusion and \"posing\" seem somehow sincere and he remains likeable as the protagonist. As the story unfolds, watching Sebastian Cole lead his life of adventure, no one could possibly feel unable to identify. There is something very genuine in the story and lives of the characters. At the same time there is a deep sense of loss, of delusion, of dislocation. There is something intangible about this film, something that goes beyond story and plot. The characters are both likeable and despicable. The acting is almost flawless and a pleasure to watch, Clark Gregg is never over the top in his role as Hank/Henrietta. There is very little moralizing, very little hitting over the head with a message. The story is presented as a slice of life and we are allowed to fill in the blanks and make judgments for ourselves. It is, overall, a film that reminds you a life is always a complicated, disappointing and wonderful thing and always what you make it.",
         "This should be re-named \"Everybody Loves Sebastian\". The 1983 rural go-nowhere town high school junior (or senior? - they seemed to flip flop on that one) with weird hair and \"Leo-like\" good looks has a big plate full of issues. His step-dad announces definite plans to have a sex-change operation, upon which his mom calls the marriage quits; Sebastian is called the \"f\" word by everyone and their mother, all-the-while \"kissing around\" with various girls, getting high on Ready-Whip at a supermarket, and saving a \"strawberry\" prostitute from the clutches of her ruthless pimp. Sebastian's \"buddies\" make Eddie Haskal look like a choir boy; bad association doesn't get much worse. Sebastian seems to go for \"Harold's\" suicide attempts record (although he won't admit suicidal tendanccies). For no apparent reason the genius level SAT scoring Sebastian MUST graduate a year early, although he has no clue about the future, nor does he want to attend college (what gives with this nonsense?). This film is a look into a few weeks in the life of someone who is PRETTY MESSED UP. The final scene suggests that things will be alright, although the HOW is left entirely up to the viewer. The makers of this film seem to bank solely on the undisputed appeal of the very attractive male lead. The \"story\" leaves a lot to be desired. Looking for \"what will this gorgeous kid do next...?\" doesn't exactly satisfy. The lackluster production values just don't measure up to other films, independent or otherwise. A low budget and weak story need more than a pretty face to carry it through. The \"results\" of this project are forgettable and an insult to intelligent cinema fans.",
         "The Adventures of Sebastian Cole is about a boy named Sebastian (Adrian Grenier) who fancies himself becoming a writer at some point, given he actually puts effort into it. This movie is presumably the years where he gets his material for writing, the adventure years, hence the title and the previous quote. In it we experience the very typical coming of age stories and warnings of loves, drugs, and sex...changes. Yeah, there's a slight twist here that is very interesting, and that is that Sebastian's step dad (Clark Gregg) very early on makes a rough decision to get a sex-change that has a huge impact on Sebastian's family and his relationship with his step-dad. Clark Gregg plays Hank/Henrietta, Sebastian's step-father and is very good in the part, very believable without being over the top, which is a route this film could've taken rather easily. Thankfully they didn't. Adrien Grenier, who I'm only familiar with from Entourage, is also very good in his part as Sebastian, and together, he and Gregg have a great relationship on screen. It's always quite engaging to watch these guys (?) relationship as it develops and is genuinely heartbreaking at times. And that's the best of what this film has to offer. Unfortunately, it brings with it some mediocre camera work, direction, and cinematography. It's not bad, but it's a far cry from being good, or memorable in the slightest. The characters are also thinly written, and it's clear from the get go how most of the arcs will pan out. The only truly fascinating character through and through is Clark Gregg's Hank/Henrietta. I've already said Grenier did well acting-wise, but the character of Sebastian is not only not engaging, but is completely unlikeable. I don't honestly see why anyone in the audience would route for his character in anything he does. He mopes, whines, cheats, lies, and lacks any aspirations other than to be a complete slacker. It'd be different if he was maybe a side-character or comic relief, but to have him as the main focus and to be asked to take the character seriously? Come on. And I don't really hold it against this film, but I just want to say...pick a different song in all these films, Hollywood! No more \"Where Is My Mind\" by the Pixies, we all know it's a good song, stop using it in every other film! I feel like I could just keep tearing more and more of this film apart, but in all honesty I didn't hate it. I just didn't really care for it, and I wouldn't recommend it to anyone. The Adventures of Sebastian Cole isn't a bad or boring film, it's just not a very good or engaging one either. It's very uneven and the script could've used quite a bit of work. I guess the point of the film is to be a loose sort of look at the life of a writer before he made it, and it worked...if that writer put out pieces of fiction that I wouldn't want to read.",
         "There are some that love this movie, and there are some that hate it with the fire of a thousand suns. True, this movie isn't for everyone, but if you're like me, it might possibly become one of your favorites of all time. I'm a big 80s junky, I love all the classics, from John Hughes to Cameron Crowe, and I always thought they just don't make teenage movies like the ones from yesteryear anymore. Then came Sebastian Cole. It looked and felt like a film picked straight out of the Golden Age, back in the 80s when teen movies were in their prime. The film was a timeless, edgy, and original take on something we've all seen before: the coming of age story. The title character, Sebastian, is endearing, and though the plot can get a bit slow at times, you're always interested in where his life is leading next during the course of the story. His relationships with his sister, his friends, his girlfriend, and his stepfather all pan out beautifully and by the end, you feel like you know these people. If you're looking for something new and different in a sea of \"American Pie's\", you should definitely check this movie out.",
         "Coming of age in a dysfunctional family has been worked and overworked in recent years, but \"The Adventures of Sebastian Cole\" presents a somewhat different slant on the story. It also contains characters that are not written as \"can-you-top-this?\" stereotypes: the clueless fathers, slut stepmothers, stormtrooper school administrators, you've seen them over and over. In this movie, the focal relationship between stepfather and teenage son is rather realistic and touching, even though the stepfather is in the process of changing his sex. Quirky, yes, very much so, but nonetheless the characters have a natural charm that is missing from many films of this genre. This is not an A-list movie with high production values, but I recommend it when in the mood for something a tad different.",
         "Sebastian Cole stars Adrien Grenier (Drive Me Crazy) as a teen struggling to come to grips with his father's transsexualism. Director Tod Williams maintains a nice semi-comedic, yet always surefooted tone, which keeps the film grounded, yet also prevents it from becoming too serious. Grenier too often reminds us of a run-of-the-mill wise street-kid type, not too dissimilar from his role in Drive Me Crazy. Yet, he is effective in both films and has considerable appeal. The film is at times uneven as we follow the antics of Grenier, along with his longtime buddies, his \"girlfriend\" Mary, and the rest of his family. Yet, the movie does a good job in its depiction of several disparate family members trying to cope with a family crisis. Despite a vague ending and the occasional unevenness mentioned above, the film is worth seeing for its honesty and candid portrayal of a father struggling with his sexuality and how it affects the family unit. Far from flawless, yet ultimately convincing."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Culpan Productions LLC"],
      "summaries": ["In June, 1983, in Dutchess County, New York, Sebastian Cole joins his mother, step-father, and sister for dinner. Hank, Sebastian's step-father, drops a bomb: he announces he's changing sexes. Sebastian's sister splits immediately for California, and his mother takes him back to England. Jump ahead eight months, Sebastian is back in New York, knocking on Hank's door. Hank (now Henrietta, although all the surgeries aren't complete) takes Sebastian in and is his rock over the next few months of high school. Sebastian's \"adventures\" are mostly self-destructive."],
      "budget": 0
   },
   "movielensId": 2766,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-11",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Tod Williams"],
      "runtime": 99,
      "movieId": 2766,
      "title": "The Adventures of Sebastian Cole",
      "mpaa": "",
      "actors": [
         "Adrian Grenier",
         "Clark Gregg",
         "Aleksa Palladino",
         "Margaret Colin",
         "John Shea",
         "Marni Lustig",
         "Tennison Hightower",
         "Gabriel Macht",
         "Famke Janssen"
      ],
      "imdbMovieId": "0168449",
      "originalTitle": "The Adventures of Sebastian Cole",
      "genres": [
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In June, 1983, in Dutchess County, New York, Sebastian Cole joins his mother, step-father, and sister for dinner. Hank, Sebastian's step-father, drops a bomb: he announces he's changing sexes. Sebastian's sister splits immediately for California, and his mother takes him back to England. Jump ahead eight months, Sebastian is back in New York, knocking on Hank's door. Hank (now Henrietta, although all the surgeries aren't complete) takes Sebastian in and is his rock over the next few months of high school. Sebastian's \"adventures\" are mostly self-destructive.",
      "tmdbMovieId": 67323,
      "avgRating": 3.2585,
      "releaseYear": "1998",
      "numRatings": 294,
      "posterPath": "/8ZXDdF8Z8HgPNvcehjdXkguSvD5.jpg"
   }
}