{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "victorian england",
            "id": 8250
         },
         {
            "name": "young woman",
            "id": 14712
         }
      ],
      "imdb_id": "tt0120210",
      "video": false,
      "title": "Stiff Upper Lips",
      "recommendations": [],
      "backdrop_path": "/7DcuamSCQFL4ONWknGy75WUNmcz.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Emily",
               "gender": 1,
               "credit_id": "52fe4a2f9251416c910c5eff",
               "name": "Georgina Cates",
               "profile_path": "/kgAOadgrgupouhfCux6cOM0Vscp.jpg",
               "id": 95789,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Horace Wiggins",
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5ef7",
               "name": "Peter Ustinov",
               "profile_path": "/8Lv4g3ZPVSM1ckKk15OnryX8sL7.jpg",
               "id": 14501,
               "order": 1
            },
            {
               "cast_id": 10,
               "character": "Aunt Agnes",
               "gender": 1,
               "credit_id": "52fe4a2f9251416c910c5efb",
               "name": "Prunella Scales",
               "profile_path": "/rNE3QUgVqsJHVaXdl0rr3bXyzie.jpg",
               "id": 55643,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Edward",
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5f03",
               "name": "Samuel West",
               "profile_path": "/yIDXDpgXxPbl5qWu8KHV7fGzVNr.jpg",
               "id": 54447,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "George",
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5f0b",
               "name": "Sean Pertwee",
               "profile_path": "/mHNlvnrlFvNddFY6isD0S40lAIu.jpg",
               "id": 28848,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Hurdler",
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5f17",
               "name": "David Artus",
               "profile_path": null,
               "id": 937889,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Hurdler",
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5f1b",
               "name": "Kevin Furlong",
               "profile_path": null,
               "id": 937890,
               "order": 6
            },
            {
               "cast_id": 21,
               "character": "Don 1",
               "gender": 2,
               "credit_id": "5664aac6c3a3682bd8009c15",
               "name": "Nicholas Selby",
               "profile_path": null,
               "id": 184892,
               "order": 7
            },
            {
               "cast_id": 23,
               "character": "Don 2",
               "gender": 2,
               "credit_id": "5a0ec5dac3a368628600e96e",
               "name": "John Boswall",
               "profile_path": null,
               "id": 140452,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Cedric",
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5f07",
               "name": "Robert Portal",
               "profile_path": "/hj0DXrM67C9PIFnK81cE7m7hySk.jpg",
               "id": 121606,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Hudson Junior",
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5f0f",
               "name": "Frank Finlay",
               "profile_path": "/rnWMfVFu1XQ5WS9hRr24jeZ9Ni1.jpg",
               "id": 6637,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "His Butler's Voice",
               "gender": 2,
               "credit_id": "58986ca89251417a91008db1",
               "name": "Geoffrey Palmer",
               "profile_path": "/6ouSoFGy8Rd9viyHmWHoEJfknFa.jpg",
               "id": 10746,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5ec9",
               "name": "Gary Sinyor",
               "profile_path": null,
               "id": 20779,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5ecf",
               "name": "Paul Simpkin",
               "profile_path": null,
               "id": 937886,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5ed5",
               "name": "Gary Sinyor",
               "profile_path": null,
               "id": 20779,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5edb",
               "name": "Jeremy Bolt",
               "profile_path": "/pqbpSnsM5Ord6t6Fx7AqCb0bGqo.jpg",
               "id": 4016,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5ee1",
               "name": "Nigel Savage",
               "profile_path": null,
               "id": 937887,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a2f9251416c910c5ee7",
               "name": "Gary Sinyor",
               "profile_path": null,
               "id": 20779,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5eed",
               "name": "Simon Scotland",
               "profile_path": null,
               "id": 937888,
               "department": "Production",
               "job": "Line Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a2f9251416c910c5ef3",
               "name": "Danny Hambrook",
               "profile_path": null,
               "id": 7658,
               "department": "Sound",
               "job": "Sound Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.323869,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "IN",
            "name": "India"
         }
      ],
      "id": 89861,
      "vote_count": 1,
      "budget": 0,
      "overview": "Stiff Upper Lips is a broad parody of British period films, especially the lavish Merchant-Ivory productions of the 'eighties and early 'nineties. Although it specifically targets A Room with a View, Chariots of Fire, Maurice, A Passage to India, and many other films, in a more general way Stiff Upper Lips satirises popular perceptions of certain Edwardian traits: propriety, sexual repression, xenophobia, and class snobbery.",
      "similar": [
         10895,
         637,
         804,
         11216,
         13448,
         1213,
         36557,
         80752,
         98,
         207932,
         324552,
         242,
         238,
         240,
         279,
         644,
         332567,
         398818,
         15206,
         38167
      ],
      "original_title": "Stiff Upper Lips",
      "runtime": 99,
      "poster_path": "/qozMEPtSjU3bvKS9E4DNYzW1h8u.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-06-12",
      "vote_average": 10,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gary Sinyor"],
      "runtime": 94,
      "synopsis": null,
      "writers": [
         "Paul Simpkin",
         "Gary Sinyor"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120210/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE2NTYwNjg3Ml5BMl5BanBnXkFtZTcwMjA5NjUxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: David Artus, Kevin Furlong, Nicholas Selby | See full cast and crew »"],
      "reviews": [
         "This film is a glorious tribute to so many 'stiff' period pieces as well as such comedies as 'Carry on up the Kyber'. It is also beautiful to watch with real locations used in the UK, Italy and India (rather than at the back of Shepperton studios). While the plot may lag in some places, the references and in-jokes are so dense that you can blink and miss many of them. The list of movies and television series that are lampooned is massive, but a few include 'Chariots of Fire', 'Brideshead Revisited', anything with Helena Bonham-Carter, 'Upstairs Downstairs', 'Lawrence of Arabia' and 'Gandhi'. Peter Ustinov (Horace) letches like Sid James, Prunella Scales (Aunt Agnes) stands her ground like Joan Sims, Sam West (Edward) bumbles like Charles Hawtree and Robert Portal (Cedric) sneers almost like Kenneth Williams. Sean Pertwee (George) saves the day a la Jim Dale and Georgina Cates (Emily) is feisty like Barbara Windsor etc. etc. The scene where Cedric meets Aunt Agnes is priceless, if only for the 'Daughter of Zeus' gag. 'Stiff Upper Lips' is definitely worth seeing more than once.",
         "This film kept me laughing all the way. Prunella Scales alone cracked me up totally! The Bonham-Carter parody was indeed weak. That was a pity, since she is the crown princess of Merchant-Ivory Land. Samuel West was brilliant at mocking the characters he DIDN'T play in the real Merchant-Ivory pieces. His fan scene with friend was fabulous. Ustinov didn't try very hard, as usual in his later career. But, as a Merchant-Ivory junky, I have to say that I was delighted at the opportunity to laugh at myself for being such a sucker for their formula. If you watch this film, you must be prepared to lighten up, or else it will be wasted on you.",
         "I have always admired the way Merchant/Ivory films have had at their core a sort of droll humour that has come through and made me smile. This movie has taken every little bit that had made me crack a smile during the \"serious\" Merchant/Ivory productions and made me smile and laugh so much my cheeks hurt by the end of the movie. There are so many sight gags that I couldn't keep track of them all, and the ones I did see were enough for me to recommend this movie. Here's a little hint, just before George rescues Emily from drowning, take a look at what he's carving, maybe that's why he was little too eager to divest himself of his clothes. Don't get me wrong, I loved Howards End and Room with a view, but I also loved The Naked Gun and Airplane as well, this is the perfect hybrid of the two genres. The acting isn't in the least bit Hammy, the actors play it straight the whole way through, which is what makes this so funny, Samuel West probably being the best thing about this movie. His brainless upperclass twit played to perfection makes this a good movie for Masterpiece theatre watchers with a sense of humour.",
         "Based on the title of this movie, I expected it to be a droll British comedy. Instead it was a laugh out-loud spoof of such films as A Room With A View, A Passage To India, Sense And Sensibility and others in that vein. I must admit that once I caught onto the joke it didn't seem quite as funny as it was at the beginning, but it was still one of the most amusing films I've seen in quite awhile. If you like British period movies and British humor, I highly recommend this one.",
         "I saw this film twice in the first week it came out. This was just as well, as it closed after a week, as nobody else saw it apart from me and a friend. I think that, apart from its DVD availability, it is just about unseen. This is what I would call 'a pity'. Stiff Upper Lips has, especially in the first half, so many spot on gags that it becomes almost abstract. Death in Venice? Yes. Chariots of Fire? Yes. Maurice? Yes. Every Merchant Ivory film? You bet. And all these jokes are funny. Imagine Airplane, remade in Britain, with better jokes. And the performances are spot on as well. Peter Ustinov is amusing as a slave trading plantation owner, Georgina Cates is fun as the 'heroine', who spends most of the film whinging, but the honours go to Robert Portal and Samuel West, in a pair of the funniest performances of all time. Every nuance, every line is finely judged. (Is that Forster you're reading? Yes, but I only read him for the landscapes.) Buy a DVD player, get this film, and enjoy.",
         "Emily (Georgina Cates), a lovely young British blueblood, lives with her stuffy Aunt Agnes (Prunella Scales) in a beautiful mansion. Her brother, Edward (Samuel West) is bringing home a college friend, Cedric (Robert Portal) in hopes that he may be a good match for Emily. However, although Cedric can quote Homer and dresses meticulously, he is a snob who criticizes nearly everything, including the cucumber sandwiches Aunt Agnes serves for lunch. That, of course, may be the fault of Agnes butler, Hudson, for he is the only servant-cook-bottlewasher in the whole house, and he is too busy to worry about whether the cucumbers are sliced thinly enough. In any case, Emily doesn't really warm up to Cedric but does become quite heated when George (Sean Pertwee), the local poor boy, rescues her from a near-drowning. Emily gets a bad cold from her ordeal and Aunt Agnes decides to take everyone to sunny Italy, including George in the capacity of a servant. Nothing could please Hudson more, as he will have the time to actually sit down and rest. But, will Emily and George be able to hide their budding attraction in such a romantic venue? And, does Cedric have his eye on someone, too? This film is great fun, especially for those, like myself, who adore Merchant & Ivory, David Lean, and others. It sends up such films as A Room with a View, Chariots of Fire, and A Passage to India in a most amusing way. For example, Edward manages to trip the runners at Cambridge, who are attempting to beat the clock in a race around the school's courtyard, while Emily needs a horse, pulling a rope, to get her into her corset. Fun, fun, fun. The cast is truly great, with Peter Ustinov adding to the amusement as a tea plantation owner. West, as some may know, played the unfortunate clerk in Howard's End and it is wonderful to see him getting a chance to smile, for a change. Cates is lovely, Scales a stitch, and Portal's imitation of Daniel Day-Lewis's character in Room with a View is priceless. The scenery is also gorgeous, the costumes very fine, and the production values quite high. All in all, even if you have never seen a Merchant-Ivory or David Lean film, you will still find this an entertaining film. But, if you are a true fan of distinguished British cinema, you will vastly enjoy the opportunity to laugh at this worthy parody.",
         "Based on the title of this movie, I expected it to be a droll British comedy. Instead it was a laugh out-loud spoof of such films as A Room With A View, A Passage To India, Sense And Sensibility and many others in that vein. I must admit that once I caught onto the joke it didn't seem quite as funny as it was at the beginning, but it was still one of the most amusing films I've seen in quite awhile. If you like British period movies and British humor, I highly recommend this one.",
         "\"Stiff Upper Lips\" pokes fun at the crustiness of the British upper crust as it follows a silly ensemble of aristocrats from England to Italy to India and back. Those who groan at puns and mutter \"humph!\" at wry humor will likely enjoy \"SUL\" while those who don't will suffer the opposite reaction. How enjoyable this film is will depend solely on the sense of humor of the viewer. Funny or not, \"SUL\" is undeniably a jolly well done spoof.",
         "This is a hilarious film designed to appeal to Anglophiles, particularly those who enjoyed Fawlty Towers and Monty Python. It is a takeoff on all those wearisome and often thought-provoking Masterpiece Theater films many of us know well. Only the British themselves could have made such glorious fun of this genre. I would give this the highest rating possible.",
         "For anyone who has seen Howards End, Enchanted April, A Passage to India, Carrington, and especially A Room with a View, this is a side-splitter. Though aiming mostly at Merchant-Ivory films, this piece takes on that entire category of films centered on the lives and loves of stuffy late-Victorian and Edwardian Brits of the upper class. Some of the gags are film specific like Edward opening his window in Rome to find a brick wall or character names like Reverend Dweeb. Others, like Emily's panicked flight through a hedge maze the size of closet are broader. I found the entire cast, especially Prunella Scales as Aunt Agnes, to be spot-on perfect. It helps that Scales and West (as Edward) were actually featured in Howards End. Peter Ustinov is also grand as batty Horace. Whether you love or hate this kind of movie, Stiff Upper Lips is a kick."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Cavalier Features",
         "Impact Pictures",
         "Ivory Hall"
      ],
      "summaries": [
         "Young upper-class fellow Edward arrives with his friend Cedric at the family manse, Ivory Hall. He plans to pair off Cedric with his sister Emily. Emily, on the other hand, falls in love with a son of local peasant, George. Old Aunt Agnes sends all the bunch off, first to Italy and then to India, so Emily would forget George, who is an undesirable partner for her because of class differences, and choose Cedric.",
         "Emily is now 22 and ripe for marriage. Her idiotic brother Edward decides, in cahoots with Aunt Agnes, to pair her off with his upper-class twit friend Cedric Trilling. Emily has already had and refused a proposal of marriage from the local vicar Mr. Tweeb on the eminently sensible grounds that his eyebrows were too bushy! An accident at the family lake brings Emily very closely into contact with the naked, handsome, muscular, lower-class peasant George and she is instantly attracted to his ripping unmentionables! Seeing the undesirability of the match Aunt Agnes takes the family first to Italy and then to India to try to separate the lusty, ill-matched couple but George accompanies them as a servant. Will lust prevail or will Emily be forced into a loveless marriage with the extremely dull and boring Cedric?",
         "Aunt Agnes vainly tries to force Emily to marry boring Cedric by taking them to Italy and India hoping that Emily will forget about the handsome George."
      ],
      "budget": 0
   },
   "movielensId": 2768,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-06-12",
      "dvdReleaseDate": "2000-09-12",
      "directors": ["Gary Sinyor"],
      "runtime": 99,
      "movieId": 2768,
      "title": "Stiff Upper Lips",
      "mpaa": "R",
      "actors": [
         "Georgina Cates",
         "Peter Ustinov",
         "Prunella Scales",
         "Samuel West",
         "Sean Pertwee",
         "David Artus",
         "Kevin Furlong",
         "Nicholas Selby",
         "John Boswall",
         "Robert Portal",
         "Frank Finlay",
         "Geoffrey Palmer"
      ],
      "imdbMovieId": "0120210",
      "originalTitle": "Stiff Upper Lips",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["SVn8zPPn7xo"],
      "plotSummary": "Stiff Upper Lips is a broad parody of British period films, especially the lavish Merchant-Ivory productions of the 'eighties and early 'nineties. Although it specifically targets A Room with a View, Chariots of Fire, Maurice, A Passage to India, and many other films, in a more general way Stiff Upper Lips satirises popular perceptions of certain Edwardian traits: propriety, sexual repression, xenophobia, and class snobbery.",
      "tmdbMovieId": 89861,
      "avgRating": 2.90244,
      "releaseYear": "1998",
      "numRatings": 82,
      "posterPath": "/qozMEPtSjU3bvKS9E4DNYzW1h8u.jpg"
   }
}