{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "competition",
            "id": 271
         },
         {
            "name": "new love",
            "id": 1605
         },
         {
            "name": "santa claus",
            "id": 1991
         },
         {
            "name": "department store",
            "id": 2081
         },
         {
            "name": "miracle",
            "id": 2618
         },
         {
            "name": "wish",
            "id": 4896
         },
         {
            "name": "christmas",
            "id": 207317
         }
      ],
      "imdb_id": "tt0110527",
      "video": false,
      "title": "Miracle on 34th Street",
      "recommendations": [
         9745,
         11881,
         11630,
         11395,
         41579,
         9021,
         5375,
         9446,
         11597,
         13767,
         9409,
         10437,
         11158,
         18935,
         12154,
         12139,
         11164,
         2616,
         21352,
         6279
      ],
      "backdrop_path": "/5Vt7uCfZjqoBN8gPPPf6qHjFy9A.jpg",
      "revenue": 46264384,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 16,
               "character": "Susan Walker",
               "gender": 1,
               "credit_id": "52fe437d9251416c750126a1",
               "name": "Mara Wilson",
               "profile_path": "/twFydeLmcbYR7DFBgs3cKe4es8O.jpg",
               "id": 11717,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Kris Kringle",
               "gender": 2,
               "credit_id": "52fe437d9251416c75012653",
               "name": "Richard Attenborough",
               "profile_path": "/Abo8fAcdruACs344ut6PNSKH7N4.jpg",
               "id": 4786,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Dorey Walker",
               "gender": 1,
               "credit_id": "52fe437d9251416c75012657",
               "name": "Elizabeth Perkins",
               "profile_path": "/bkdWnnrMADJcFpKAOitMjQH3uEQ.jpg",
               "id": 20,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Bryan Bedford",
               "gender": 2,
               "credit_id": "52fe437d9251416c7501265b",
               "name": "Dylan McDermott",
               "profile_path": "/4VVyvrxVVrrX9GsKlkSnUz32Ft6.jpg",
               "id": 32597,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Ed Collins",
               "gender": 2,
               "credit_id": "52fe437d9251416c7501265f",
               "name": "J.T. Walsh",
               "profile_path": "/39KZjhJSyDjvBhKGj0IbGVteFAm.jpg",
               "id": 22131,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Jack Duff",
               "gender": 2,
               "credit_id": "52fe437d9251416c75012663",
               "name": "James Remar",
               "profile_path": "/AeSuQlBclvWqztlpkf9nIhvvhsc.jpg",
               "id": 1736,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Alberta Leonard",
               "gender": 1,
               "credit_id": "52fe437d9251416c75012667",
               "name": "Jane Leeves",
               "profile_path": "/wioqL9owN0Rap04qeGXchc7fi20.jpg",
               "id": 52951,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Denice",
               "gender": 1,
               "credit_id": "52fe437d9251416c750126a5",
               "name": "Jennifer Morrison",
               "profile_path": "/sqn3ySCTYw82vtW10oqrmtg3B9L.jpg",
               "id": 41421,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Victor Landbergh",
               "gender": 2,
               "credit_id": "5913615dc3a36864fc059296",
               "name": "Joss Ackland",
               "profile_path": "/l7XyBslyU5slMUuO9zTjCRZKXex.jpg",
               "id": 14324,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe437d9251416c7501266d",
               "name": "Les Mayfield",
               "profile_path": "/qFl6z4jAfvb3bfMeGDMD4ch61tI.jpg",
               "id": 56911,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c75012673",
               "name": "George Seaton",
               "profile_path": "/x6G1rB1GYeGKarRKU5epFyVi3aQ.jpg",
               "id": 24939,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c75012679",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c7501267f",
               "name": "William S. Beasley",
               "profile_path": null,
               "id": 33281,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c75012685",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c7501268b",
               "name": "William Ryan",
               "profile_path": null,
               "id": 65482,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c75012691",
               "name": "Bruce Broughton",
               "profile_path": null,
               "id": 20897,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c75012697",
               "name": "Julio Macat",
               "profile_path": null,
               "id": 11506,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe437d9251416c7501269d",
               "name": "Raja Gosnell",
               "profile_path": "/jbcOXhl4QGaYcvAK5WsbEARkkQZ.jpg",
               "id": 1215,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 8.886005,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10510,
      "vote_count": 279,
      "budget": 0,
      "overview": "A little girl discovers dreams can come true if you really believe. Six-year-old Susan Walker has doubts about childhood's most enduring miracle - Santa Claus. Her mother told her the 'secret' about Santa a long time ago. But after meeting a special department store Santa who's convinced he's the real thing, Susan is given the most precious gift of all something to believe in.",
      "similar": [
         10147,
         9479,
         51052,
         11395,
         13673,
         9021,
         11881,
         1585,
         8871,
         13377,
         18147,
         17979,
         287903,
         5255,
         10719,
         364,
         634,
         927,
         772,
         338964
      ],
      "original_title": "Miracle on 34th Street",
      "runtime": 114,
      "poster_path": "/iuI31j8DM4TOxJTZeumG0S4npPU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1994-11-18",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "If you really believe, anything can happen.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Les Mayfield"],
      "runtime": 114,
      "synopsis": null,
      "writers": [
         "Valentine Davies",
         "George Seaton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110527/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3ODEzODA0NV5BMl5BanBnXkFtZTcwMjI1MjIyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Attenborough, Elizabeth Perkins, Dylan McDermott | See full cast and crew »"],
      "reviews": [
         "I can't see why a retelling of a really good story gets panned. It stayed true to the original concept, that believing in something good, even if it only comes once a year, can make us better. If I may reference another Christmas classic of which there have been several worthy interpretations, \"Scrooge\" (1951), the young Scrooge says to the young Marley upon their meeting, \"I believe the world is becoming a very hard and cruel place...\". If it was that way in the 1800's, it's ten times worse today, and therefore all the more reason to be reminded of our better nature. I especially enjoyed the scene where the streets of New York City were filled with throngs of people, traffic on the bridges was stopped, all waiting for the verdict. I know NYC well, and how its people rise to such occasions. These scenes were not in the 1947 version, and I think they added a uniqueness to this version. Better, worse than the 1947 version? Neither - just different, and just as valid.",
         "On a normal level of cinema, this film is only mediocre. Where it fails is that it is a terrible remake of a well-known, well-loved film. And even worse for this film, it's a lousy remake of a well-known, well-loved film that just happens to be my favorite Christmas film of all time. It has a few positives. All right, it has one positive, and that is Richard Attenborough. He brings a genuine delight to the role of Saint Nick, and it is not hard to believe this guy could be the genuine article. Unfortunately, his performance highlights the lousy performances of many of the principles. Dorey Walker is played by Elizabeth Perkins with none of the sympathy given to her by Maureen O'Hara. It's impossible to even dream of her getting married to anyone. Some of this is to be blamed on the script, though, which spends so much time establishing Dorey's cold heart that it forgets she's supposed to be getting our sympathy, not our scorn. Which brings us to the flat performance of Dylan McDermott. He could be replaced with a cardboard cut-out without affecting the flow of the movie. Then we have Mara Wilson. She tends to be more snobby and over-confident than confused, but Wilson is up against Natalie Wood. To be fair, we never get to see Wilson chattering like a monkey for comparison purposes. That delightful scene was excised from the modern version. A rather ridiculous subplot has been added to this remake with a rival store, Shopper's Express, trying to put Cole's out of business (Macy's refused to have their name put in the film). It is headed by the popular 90's villain of choice, the Greedy Evil Mean CEO, Victor Landbergh. He doesn't play much of a role, yet he is supposed to be the encompassing bad guy, evoking images of Lex Luthor plotting the demise of Superman. He even has his own flunkies who attempt to sabotage the department store, skittering around almost like Boris and Natasha. This subplot tends to weigh down on the film, feeling forced in rather than meshing with the film. The pompous psychiatrist of the original works because it was simply one guy with a chip on his shoulder instead of a wicked retail overlord. The former is funny, while the latter is overkill. Actually, that addresses another problem with this film - it takes its subject matter far too seriously. The original film was an enjoyable farce. This one is a somber story, filled with the right glurgy turns to renew our souls or something. Basically, it's way too serious considering the subject matter (an old guy who thinks he's really Santa Claus.) The original had some laugh out loud moments of sharp humor - this one instead attempts to force you to shed tears of sadness and joy. It usually just shed tears of boredom from me. The court decision at the end of the film is not only anti-climactic, but doesn't really address the actual issue - Kris is on trial for lunacy. The only decision to save him is to prove he's REALLY Santa Claus, thus making him sane. This movie can't seem to make up its mind why he's on trial and its ultimate answer for Kris obvious acquittal would fall upon under the lightest of legal scrutiny, where the original film made a compelling legal argument. I can't answer that, but I will say that this film's answer is far off the mark. Please, I beg of you-if you have NOT seen the 1947 Black and White original, then please correct that. This is not an adequate substitute to a film that didn't need one in the first place. They even colorized the old one, so if you hate black and white, then you still have a color option without wasting your time on this.",
         "Richard Attenborough returned to acting after 14 years behind the camera in \"Jurassic Park\", and followed it swiftly by daring to challenge comparison with Oscar-winner Edmund Gwenn in this remake. As a heartwarmer for those inadequates who won't sit through a 60-year-old monochrome movie-- albeit one which rivals \"It's a Wonderful Life\" as Hollywood's answer to \"A Christmas Carol\"-- this John Hughes revamp will probably serve. Anyhow, there are plenty of copies on sale at the checkout of my local supermarket. But it is a bit too laid-back and, latterly, too bogged down in argument for younger kids or older boys. It may warm more cockles among the grandparents. The main thematic interest is how Hughes chooses to tweak the original screen story as adapted (unusually for the time) by the director, George Seaton. Whether he sought to or not, the remake has thrown up some intriguing twists for a more skeptical and secular time. The oldie caught the mood of an America yearning to get back to normalcy amid the perils of the post-war, Cold War world. Location shooting in New York City, with much co-operation from Macys, gave a touch of realism to the fantasy, whereas in 1994 it's an imaginary store and (for Americans, at least) an incongruously \"veddy British\" claimant to the chair of Santa Claus- although his nationality is not the issue when the legal meanies of the State of New York try to get him confined to the bughouse. What is striking is the judge's rationale for allowing Kris's plea for freedom. Because US bills have \"In God We Trust\" on them, he reasons, it means New York is allowed to have blind faith in the existence of a supernatural being who lays presents on 1.7 billion children in one night, operating from invisible workshops with reindeer which cannot be made to fly in a courtroom demonstration of his powers because it isn't Christmas Eve. Besides, the sneery prosecutor's kids were raised to believe in him, so there- case closed. In real life the ACLU would be appealing such a judgement all the way to the Supreme Court for allowing too much religion into the law and the public square. \"In God We Trust\" was only put on the money during the Cold War, to cock a snook at \"Godless bolshevism\"; but this film is refreshingly disrespectful to the newer orthodoxy of playing down most Americans' beliefs in their films. Kris asks if he should swear in the Bible, the Pope's ruling on Nicholas's sanctity is debated, and the ethos is quietly but unmistakably Christian. No \"spiritual\" Santa or \"Happy Holidays\" here. In a very light fashion, the film does revolve issues of how far it is legitimate to maintain a metaphor as a source of inspiration when rationalism of the Dawkins and Hitchens strain is sniping at it. The screenplay also looks quite beadily at the way commercial operators use holy myth to make money, even if the message comes muted from Hollywood. That is the good news. There's plenty to carp at as well. Attenborough's quiet, gentle but firm performance (most atypical of one who spent his previous acting time mainly playing unreliables or martinets) suffuses the film. He gets little competition, save from the contrasted crustiness of Windom. Most of the support is so-so, on the level of a Yuletide TV special, and not excluding little Wilson as the girl who has faith in Mr Kringle's claim to be St Nicholas. She is no Margaret O'Brien, if no worse in her way than the kewpie-doll Natalie Wood. In fact, she's a John Hughes moppet who did little later and nothing since 2000. The narrative's departures from the well shaped original are no help. Once off the legal hook, Kris, wearing a brown suit, just disappears-- we don't see any triumphal sleigh ride to bid him adieu-- while attention shifts to a ridiculous post-midnight-mass impromptu wedding in a Catholic church. Then follows a trip out to a dream house in the snowy country, ushered by a silly salesman. The film does not seem to know when to call a halt, and there's not so much as Clarence's tinkling bell to bring back Kris at the close. It's as if the whole object of the exercise was to unite two bland characters in matrimony.",
         "If there ever was a film that did not need a remake, the original \"Miracle on 34th Street\" was such a film. The original featured a virtually perfect screenplay in which everything works out right against all odds. Above all, it softened the sentimentality with some genuine satire (corporate heads who are so afraid of losing sales that they have to admit that Santa Claus exists)and, above all, with a delightful sense of ambiguity as it leaves open the possibility that Chris really is Santa Claus. The remake just pours on the sentimentality and (spoiler) even changes the ending.",
         "I watch it every year. I've read negative reviews of Mara Wilson's performance but I think she is charming and smart but not at all obnoxious or know-it-all as others have said. She is acting over maturely as she was raised by her no-nonsense and jaded mother. Her subtle winks and expressions are very apropos to her role and she interacts very well with Mr. Kringle. (Perhaps I like her because she looks like my daughter when she was little.) Regardless, I love the way this story is told and Mara makes it for me. Even though logically she was taught that Santa was not real, as a little girl she was still willing to believe. Take a little joy in believing! I hope you enjoy :)",
         "I read many reviews of this film and the original and I was shocked by some of them. I saw this version of the film first and I was amazed. It is a warm, decent, traditional film about courage, faith and hope, that motivates to fight against evil and protect the good. Later I saw the original 1947 version and I liked it, but I can't say it was better than this version. It is difficult to compare after you see one film and love it and then see another version like it more than than the first you saw. But after all I like the new ideas of this film. They are really improvements of the story and the film fits more for the current audience, since less generations lie between it and the film. The film is really well done and Richard Attenborough is a fantastic Santa Claus.",
         "And the remake to the classic original MIRACLE ON 34TH STREET makes the wait very worthwhile! Richard Attenborough makes a delightful Kris Kringle, who starts trouble by claiming to be the one, true Santa Claus. Mara Wilson of MRS. DOUBTFIRE also stars as the little girl who at first is cynical about the whole idea of Christmas and St. Nick, but soon Kris Kringle shows her that he does exist. A good holiday flick for the whole family. I'm a teenager, and I thought MIRACLE ON 34TH STREET was a great movie, partly b/c of the film's excellent lack of sap unlike other family movies!",
         "I first saw the 1970's version of this on TV. I had not yet seen the 1947 version until after I saw this one. I liked all three versions but I really like this one the best. I usually don't like remakes because they tend to totally change the story or they just add some unnecessary dirty words, nudity, violence or sex scenes. This remake was very good. I don't see why people are so against it. There are many versions of A Christmas Carol and yet few seem upset by that. I liked the dollar bill evidence much more than the post office evidence near the end. I loved the scene in which the citizens of NY city showed their belief in Santa Claus. I also felt that the reason why Kris Kringle struck out at the man was much more realistic in this version than in others. Maureen O'Hara is one of my favorite actors. ( yes the screen actors guild uses the term actor meaning \"one who acts\" for males and females. ) The 1947 version is well acted and charming. The 1994 version is a movie that stands on it's own and is delightful.",
         "There are some movies in which one watches in life which has no real intention but to make a person feel good about not only themselves but for the collective people. Miracle on 34th Street does this for me. Not only does the performance of all the cast make this memorable but the there is no real person which you end up hating, except maybe 2. This is a must movie for all Christmas lovers out there who just want a tale told to them which will make them as warm as that eggnog they drink that night, (unless you drink it cold like in Australia). Brilliant movie which I watch every Christmas. In conclusion, it is a movie which once watching it and allowing one's self to be captivated by its charm, one finally feels like a kid again. And anyway which is worse? 'A lie that brings a smile, or a truth which draws a tear' Best Santa I have seen",
         "This remake is a decent film on its own, but can't compare to the original version. It lost me right from the beginning with juvenile humour (making the bad Coles Santa the butt of jokes), and never won my interest back. I was particularly disappointed in the ending. The original ending drew the necessary distinction between proving that Santa existed and proving that the gentleman known as Kris Kringle was Santa. For some inexplicable and unjustifiable reason, the remake glosses over that distinction. This cheapened the rest of the film for me. I also preferred the ending in the original version. While I like the direct God/Santa comparison in the remake (suggesting that Santa works through others his miracles to perform), I prefer the manner in which the family obtains their house in the original version. It's a lot more meaningful if they have never seen the house before that minute, as the randomness factor hints more strongly at Kris's actually being Santa. In the same vein, I thought Kris acted too mentally inadequate in this version, talking about the Tooth Fairy and Easter Bunny as if they were real, and addressing a local reindeer as if it were one of his own. Santa becomes less a person than an ideal of behaviour and attitude, as the overly sentimental script keeps reminding us. He inspires other people to do things instead of being able to do them himself. I suppose that's the point the film is making, but all the same I prefer the less heavy-handed approach of the original."
      ],
      "genres": [
         "Family",
         "Fantasy"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Hughes Entertainment"
      ],
      "summaries": ["A little girl discovers dreams do come true if you really believe. Six-year-old Susan has doubts about childhood's most enduring miracle - Santa Claus. Her mother told her the \"secret\" about Santa a long time ago, so Susan doesn't expect to receive the most important gifts on her Christmas list. But after meeting a special department store Santa who's convinced he's the real thing, Susan is given the most precious gift of all - something to believe in."],
      "budget": 0
   },
   "movielensId": 277,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-11-18",
      "dvdReleaseDate": "2000-10-31",
      "directors": ["Les Mayfield"],
      "runtime": 114,
      "movieId": 277,
      "title": "Miracle on 34th Street",
      "mpaa": "PG",
      "actors": [
         "Mara Wilson",
         "Richard Attenborough",
         "Elizabeth Perkins",
         "Dylan McDermott",
         "J.T. Walsh",
         "James Remar",
         "Jane Leeves",
         "Jennifer Morrison",
         "Joss Ackland"
      ],
      "imdbMovieId": "0110527",
      "originalTitle": "Miracle on 34th Street",
      "genres": [
         "Fantasy",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["yiypbCFV7Ao"],
      "plotSummary": "A little girl discovers dreams can come true if you really believe. Six-year-old Susan Walker has doubts about childhood's most enduring miracle - Santa Claus. Her mother told her the 'secret' about Santa a long time ago. But after meeting a special department store Santa who's convinced he's the real thing, Susan is given the most precious gift of all something to believe in.",
      "tmdbMovieId": 10510,
      "avgRating": 3.38871,
      "releaseYear": "1994",
      "numRatings": 11236,
      "posterPath": "/iuI31j8DM4TOxJTZeumG0S4npPU.jpg"
   }
}