{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "thailand",
            "id": 3434
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "injustice",
            "id": 163119
         }
      ],
      "imdb_id": "tt0120620",
      "video": false,
      "title": "Brokedown Palace",
      "recommendations": [
         15992,
         35645,
         8986,
         18550,
         12257,
         11310,
         9448,
         26618,
         12395,
         9264,
         9430,
         12146,
         12661,
         10279,
         9685,
         11517,
         12596,
         10223,
         91767,
         2610
      ],
      "backdrop_path": "/mI9POWphsAFKECJ4GQ3jNaLStEq.jpg",
      "revenue": 13000000,
      "reviews": [{
         "author": "John Chard",
         "id": "53c8edc20e0a26649900183c",
         "content": "That's all freedom is... an illusion.\r\n\r\nTwo carefree teenage girls are jailed in Thailand for allegedly smuggling Heroin while on vacation.\r\n\r\nIt has become the stuff of reality nightmares, seemingly every year there is the reports of foreigners abroad caught smuggling drugs. Quite often the innocence is starkly protested, claims of being duped or threatened into being drug mules through customs borders. Brokedown Palace is an interpretation of one such instance.\r\n\r\nThere's a viable complaint about the film that it condenses the harsh realities of the surroundings, this \"Brokedown Palace\" is not portrayed as the dirty hell holes they so often are in reality. This initially gives the film a sort of false feel, that we are being fed a watered down Hollywood production of something very serious.\r\n\r\nHowever, looking deeper into the picture as a character piece, Jonathan Kaplan's film beats a mighty heart and has brain staying power as well. Claire Danes and Kate Beckinsale (both superb) are the two friends at the centre of this mystery. Story is more concerned with how their friendship copes under the trying circumstances. Through the initial shock of their situation, to the faux trial, the interactions with others and the relationship they have with their American lawyer, Hank the Yank (Bill Pullman). There's also the not small matter that one of the girls might actually be guilty as charged? Which really gives the piece an intriguing kick.\r\n\r\nUnfortunately it falls down in other areas. How come the girls are perfectly coiffured? Quite often splendidly attired in cosmetics? As Kaplan strains for authenticity in human interactions, he loses credibility elsewhere because these two girls look like actors who have had a \"don't make me look ugly\" clause inserted into their contracts. Ultimately when the story is dialled into the two girls and their friendship, Brokedown Palace hits the heights required, elsewhere it's a disappointment and it's not hard to understand why the two lead actresses practically disowned the film shortly after their publicity commitments were over. 6/10",
         "url": "https://www.themoviedb.org/review/53c8edc20e0a26649900183c"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Alice Marano",
               "gender": 1,
               "credit_id": "52fe47419251416c75093041",
               "name": "Claire Danes",
               "profile_path": "/6Lr3Yc53iifCPtJz1jTzjhVxa0j.jpg",
               "id": 6194,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Darlene Davis",
               "gender": 1,
               "credit_id": "52fe47419251416c75093045",
               "name": "Kate Beckinsale",
               "profile_path": "/jlleQafwnW1j0mvxJLiqnNL2mYh.jpg",
               "id": 3967,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Hank Greene",
               "gender": 2,
               "credit_id": "52fe47419251416c75093049",
               "name": "Bill Pullman",
               "profile_path": "/pIpTEQVbDif8m8OdjAxQKNCj0D6.jpg",
               "id": 8984,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Yon Greene",
               "gender": 1,
               "credit_id": "52fe47419251416c7509304d",
               "name": "Jacqueline Kim",
               "profile_path": "/3xvzDHNIKnkdK5YU6raXdkjqWBJ.jpg",
               "id": 56485,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Roy Knox",
               "gender": 2,
               "credit_id": "52fe47419251416c75093051",
               "name": "Lou Diamond Phillips",
               "profile_path": "/afXcQRss7rZ6Ocx7PUQFbz7tPOm.jpg",
               "id": 38560,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Nick Parks",
               "gender": 2,
               "credit_id": "55c0bfbe9251410d9500191b",
               "name": "Daniel Lapaine",
               "profile_path": "/rbjKrUGYsPFvUg8bNU9afBnV4b.jpg",
               "id": 3072,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Doug Davis",
               "gender": 2,
               "credit_id": "55c0bfd29251410d9500191f",
               "name": "Tom Amandes",
               "profile_path": "/yEvZI1qkaGqBjxrlz0Dur9kjImf.jpg",
               "id": 126471,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Beth Ann Gardener",
               "gender": 1,
               "credit_id": "55c0bfe8c3a36823f40018ec",
               "name": "Aimee Graham",
               "profile_path": "/gRgsEkk4JxxyluVpoUK7BF8glex.jpg",
               "id": 35545,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Bill Marano",
               "gender": 2,
               "credit_id": "55c0bffa9251410f78001c54",
               "name": "John Doe",
               "profile_path": "/EuDIT3BBTqkkLKD8wgp7MwuGCx.jpg",
               "id": 42746,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Chief Detective Jagkrit",
               "gender": 2,
               "credit_id": "55c0c0109251410f2a001944",
               "name": "Lim Kay Tong",
               "profile_path": "/rI0qfi5tuXif3QU2L3jiuCp8SQv.jpg",
               "id": 93737,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Guard Velie",
               "gender": 1,
               "credit_id": "55c0c021c3a36822fd00185e",
               "name": "Beulah Quo",
               "profile_path": null,
               "id": 156813,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Mary",
               "gender": 0,
               "credit_id": "55c0c0539251410d95001926",
               "name": "Maya Goodwin",
               "profile_path": null,
               "id": 1422212,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Ferg",
               "gender": 0,
               "credit_id": "55c0c0659251410d95001928",
               "name": "Chad Todhunter",
               "profile_path": "/zFHBwnGHAfyj3naHz6NbPaZNAuT.jpg",
               "id": 1216156,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Jason",
               "gender": 2,
               "credit_id": "55c0c07ac3a368238c00192a",
               "name": "Paul Walker",
               "profile_path": "/iqvYezRoEY5k8wnlfHriHQfl5dX.jpg",
               "id": 8167,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47419251416c75093057",
               "name": "Jonathan Kaplan",
               "profile_path": "/sv953vXFS4YD5BZ4GBjrSWQsiMW.jpg",
               "id": 42171,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe47419251416c7509305d",
               "name": "Adam Fields",
               "profile_path": null,
               "id": 1586,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47419251416c75093063",
               "name": "A. Kitman Ho",
               "profile_path": null,
               "id": 2621,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe47429251416c75093069",
               "name": "Adam Fields",
               "profile_path": null,
               "id": 1586,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.995998,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17707,
      "vote_count": 141,
      "budget": 25000000,
      "overview": "Best friends Alice and Darlene take a trip to Thailand after graduating high school. In Thailand, they meet a captivating Australian man, who calls himself Nick Parks. Darlene is particularly smitten with Nick and convinces Alice to take Nick up on his offer to treat the two of them to what amounts to a day trip to Hong Kong. In the airport, the girls are seized by the police and shocked to discover that one of their bags contains heroin.",
      "similar": [
         6075,
         339692,
         627,
         634,
         429200,
         1585,
         1991,
         4771,
         180863,
         10147,
         185,
         1701,
         979,
         769,
         340837,
         21575,
         17979,
         134411,
         1581,
         364
      ],
      "original_title": "Brokedown Palace",
      "runtime": 100,
      "poster_path": "/q429dpKlVP8uTrWJ7Tq9UFEQ8ww.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "ภาษาไทย",
            "iso_639_1": "th"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Two Girls Productions",
            "id": 81140,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Adam Fields Productions",
            "id": 3334,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-08-13",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Their graduation present was a trip to paradise, but they never thought they would land in hell.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jonathan Kaplan"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Adam Fields",
         "David Arata"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120620/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyNTQ1MjU4NF5BMl5BanBnXkFtZTcwNDE0NjkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Claire Danes, Kate Beckinsale, Bill Pullman | See full cast and crew »"],
      "reviews": [
         "I'm a little surprised by the negative criticism this film is attracting. I'm old enough to be the father of the two main characters; they seemed like accurately drawn teenage girls to me. And I've probably hung out with both of their fathers before. I've been to the Far East. I've stayed in both better and worse places than the girls stayed. I had the pleasure of seeing the inside of a police station after I was robbed. I'm glad I had no more direct exposure to the local judicial system than that; that was more than enough. Everything in this movie seems awfully familiar to me. I think \"Brokedown Palace\" represents something pretty close to stark realism. It certainly reminded me of Asia. Of course it's true that the attitudes of the girls often don't do much to improve their situation. But they are meant to be an example of what not to do overseas. And the portrayal of some of the Thais did make me uncomfortable. But then many of my own personal travel anecdotes don't paint a complimentary picture either. This is a cautionary tale. An unfortunate consequence of too many people having too much money to spend these days is that you will find unescorted, unprepared, \"streetwise\", naive young people popping up in places where they have no business being. And when that happens, you end up with situations mirroring this movie. I suspect people choose to denigrate this one because they are too embarrassed to accept how true it is, and how vulnerable they would be if placed in similar circumstances.",
         "Although I go to the movies regularly, I didn't see a trailer for this film, and the few reviews I read beforehand suggested it would appeal mainly to women under 35. Being neither, I could have been excused for missing this film, which would have been a shame, because I enjoyed it. The acting from Danes, Beckinsdale and Pullman was excellent and a pleasant change from watching films where special effects try to substitute for quality acting. Brokedown Palace is one of the few films I've seen this year where I haven't been able to correctly predict the outcome half way through. For me this was more than a repeat of the \"tourist taken advantage of by nasty local/foreign low life\" film. While it is clearly a cautionary tale of the risks of travelling abroad, it is also very much about trusting your friends and the extent you are willing to make sacrifices for them. It is also a reminder that in any country, justice is dispensed by people with power, and the extent that truth features in the dispensing of justice is largely at their discretion. The film correctly portrays that crying \"I'm an American citizen, I have rights\" rarely sees an immediate release from jail and humble apology from the local police, nor does enlisting the help of the US embassy result in a company of marines landing at night to storm the jail and rescue you. Brokedown Palace is one of the few films I have seen this year which I intend to see again.",
         "I saw this film at a store in the cheap section. I actually vividly remembered seeing the commercials and trailer for it years ago. I thought \"What the hey' and bought it, basically because the plot sounded interesting and Claire Danes has always been someone of talent in my eyes (this was also before I became a huge Kate Beckinsale fan). So it's about two girls who sneak off to a vacation in Bangkok, get busted for narcotics (which they are innocent of) and then are sent to a Thailand prison. The film follows what will happen to them and at times questions their innocence. Both Claire Danes and Kate Beckinsale give great performances, and the plot of this film wraps itself up unconventionally, and raises some nice moral discussion questions. I think this is a solid good film, but there could have been some improvements. It could have been longer...it would've helped to solidify these characters and more insight into the politics of Thailand's justice system would've helped. Nevertheless, other than that, it's a good film with some great performances. P.S. For all you pop-culture junkies be on the lookout for a two-minute role by Paul Walker. I didn't even notice him the first time I saw the film.",
         "I saw this movie by luck, just because I was going through a phase where I had a new found admiration for Bill Pullman and wanted to see all of his recent movies and thank God I did! This Movie has stuck with me ever since and remain one of my favorites! The story revolves around two girls who embark on a dramatic journey in a foreign country where they'll learn the true meaning of freedom. Alice and Darlene were just trying to spend a vacation together before going to college but their trip ended up a much more complicated story. The struggle they go through as they are arrested in Thailand and became prisoners is very moving and intense. The acting is amazing, the images extraordinary, the soundtrack is fantastic and so right for the movie and the message transmitted definitely powerful. I actually can't even find the right words to describe how this movie makes me feel every time I watch it. I know some people haven't appreciated as much as me by the rating the movie has but I swear, this one, you have to see!!! I promise it will stick with you!",
         "*** out of **** Brokedown Palace has an intriguing premise: two best friends (Kate Beckinsale and Claire Danes) fresh from high school are on their summer vacation in Thailand, but are arrested for possession of narcotics, found guilty and sentenced to 33 years in a women's prison. Admittedly, I'm aware of several films with similar stories (Midnight Express, Return to Paradise, and Red Corner), and I must also admit I've only see one of those three aforementioned films, which might be why much of it felt fresh and engrossing to me. Either that, or it's just a story that's told damn well. Bill Pullman also stars in the picture as an American lawyer named Hank Greene, who feels for the girls' plight and fights to prove their innocence. But the real focus is on Beckinsale and Danes, whose wonderful performances are the anchor to the film's drama and moral quandaries. Beckinsale's Darlene is the more reserved and quieter of the two, the kind of person who sort of follows her friend without question, and certainly not the type to take unwarranted risks (unless her friend persuades her to). She's almost a direct opposite of Danes' Alice, whose outgoing and semi-rebellious behavior is the indirect link to their current troubles. I hesitate to give much more of the movie away, suffice to say that their friendship is what's ultimately put to the test, and watching the twists and turns (almost all of which are perfectly believable) in the story is utterly captivating. The film slinks to melodrama in its climactic moments, but still rings true thanks to the tour-de-force turns from Beckinsale and Danes. It's an open-ended question as to whether or not either of the girls committed the crime of smuggling narcotics, and such ambiguity might upset some, but I liked not knowing for certain, and it's not as if it makes the final scenes any less believable. In fact, the ambiguity only makes it all the more compelling. Yes, the plot has its share of head-scratching moments (what purpose does that Thai girl who despises Darlene and Alice really serve?) and lacks subtlety on occasion, but it's a well-crafted film that boasts great performances, and has the guts not to cop out in the end.",
         "This movie is cold, bare truth. Often we think \"oh no, that won't happen to me.\" But it can. Drug smuggling is big money and often people are unknowingly (or tricked) into doing things for smugglers. The story of these two girls is the story of many young people who like them, only wanted a exotic holiday - which turned into a nightmare. People need to know that these sort of events aren't improbable or exaggerated - this IS a major problem in today's society. I would recommend this movie to mature viewers because of the understanding needed to truly appreciate this movie. It is very emotional and raw. Well worth watching and certainly stays in your memory.",
         "Alice(Claire Danes) and Darlene(Kate Beckinsale) have been best friends since forever and after they graduate they decide to take a trip to Thailand. Due to a incident, they meet a young attractive mysterious stranger who invites them to go with him Hong Kong for the weekend. But at the airport, Alice and Darlene are mistaken for drug smuggling heroine and they are sent to prison. Now it's time for ultimate survival and true friendship. This was a pretty good movie, i've seen it a couple of times and after a while you notice that they are a few holes in the plot but the movie still keeps you entertained. Claire Danes did a great job as usual, she is a great actress. I would give Brokedown Palace 8/10",
         "I saw this movie a million years (5 years to be exact) ago for the first the time. In the light of recent events with the Australian woman Schapelle Corby being imprisoned in Indonesia for so called smuggling pot, I decided to watch this movie again. I excepted to cry my heart out, 'cause I'm sucker for hot girls in need (just read my review of 'the stalking of Laurie Show'). Some moist escaped my eyes, but it were hardly buckets filled with tears. Why? Not because the two heroines weren't utterly adoring and helpless, not because the movie wasn't heartbreaking at the sight of these two kids in the prime of their live locked up in almost inhuman conditions. Why then? Why did I not cry? I wanted to cry! When I rent a movie like this, I except to be moved, to sob like there's no tomorrow, to feel miserable and like it. This movie was simply too short to do this. It was just like the script was reduced to the main plot elements, and while doing this the psychological aspect was thrown aside. Clare Danes and Kate Beckinsale did an excellent job portraying the emotions of the two friends, but this movie just screamed for more footage of these girls in their depressing (and oppressing) surroundings. The mental journey is missing here for some reason. You only get to see the key moments of it (which are very touching, I admit), probably because of bad editing. Sometimes I felt these girls were walking around in a postcard. The relationship with the family members could also have used a bit more attention. What's up with the relationships between the girls and the parents (especially between Alice and her dad)? You catch a glimpse of it, but the film doesn't quite offer the whole picture, sadly enough. Nonetheless this was a great movie, and at the end I even had to bite my lip a bit. But I guess this has more to do with the acting skills (and the looks) of the actresses (and the music) then with the merit of the director. To be honest, I hardly knew who Kate Beckinsale was before I watched this movie (again). Now, I am a fan! Great movie, as long as you don't expect it to be classic cinema.",
         "Brokedown Palace is truly a one of a kind. It's an amazing story, showing two girl's plight for freedom against the Thailand justice system. They soon find themselves placing faith into a system they know nothing about. Alice Morano (Claire Danes) and Darlene Davis (Kate Beckinsale), are two best friends, strait out of high school. They suddenly change their vacation plans from Hawaii to Thailand, and are immediately captivated by a young man, Nick Parks. He flirts with them both, and suggests that the three of them go to Hong Kong for the weekend. When the two arrive at the airport, they are immediately searched for drugs. Someone tipped off customs, and in an instant, their life is changed forever. In the mix of the confusion of settling into their new life, they learn about a highly respected lawyer, named Hank Green (Bill Pullman). An American who knows the Thai justice system, he fights for the girl to be free. But they soon find out, when they leave or go is all up to them. If you're looking for a great movie that'll stay with you for years - Brokedown Palace is definitely the way to go.",
         "We all have friends. Some of us have more than others but there really are only one or two people that you feel really close with, people that you can say are like your brother or sister. Alice ( Danes )and Darlene ( Beckinsale ) are like that. You can see that from the beginning. They graduated together, they go to parties together and they decide to go to Bangkok together when they were supposed to be going to Hawaii. They also get busted for attempting to smuggle drugs into a third world country and that spells disaster. The rest of the film is about survival and not giving up hope. It also has a strong message about the power of friendship and what it can mean to someone. Brokedown Palace is a very good film, it is not excellent and that is due to a few issues that I want to talk about. But first I want to say what is good about the film. And for starters the acting is top notch, and you can look no further than the two leads. Danes and Beckinsale are perfect in the roles that they have. Alice is always fiery and seems a little rough around the edges, but she seems more fun than Darlene. But sometimes that fun can get her into trouble. Darlene is always a little on the conservative side and although that can get irritating sometimes, it would have served the two girls better if her way was adhered to instead of Alice's. Bill Pullman is adequate as the American lawyer living in Thailand. The film is photographed very well also. The inside of the prison while not the same as Shawshank or Natural Born Killers or Return To Paradice, but it does show the necessary ( but underdone) hopelessness of the situation that they are in. Johnathin Kaplan's direction is quite good as well. We see the two girls struggling to make it through each day but you can see their spirit is being put out a little more each day. Brokedown Palace is excellent when it talks about friendship and it shows how they have to rely on each other to survive. The other thing that I had to comment on is the soundtrack for the film. It heightens and compliments the mood of the film to perfection. The song that you hear in the trailer is also played in the film and when it plays you feel the plight of the women in this prison. You can feel how alone they must feel and how desperate they are to get out and get back to the simple things in life. And it also makes you look at yourself and realize how lucky we are to live in the society that we do. We have it easy compared to some country's and believe it or not the music is a perfect catalyst for reflection on this subject. Some of the music is done by a group called Delirium ( I think ) but it is Sara McLaughlin( wrong spelling, but how do you spell her last name? ) that does the lyrics and her voice is beautiful and haunting and it adds so much to the film. What I didn't enjoy about the film was some of the stupidity that the girls exhibit. I won't say what it is that they do but when you see it for yourself you'll know what I am talking about. Also I didn't really feel that the prison they were in was all that bad. It looked more like a minimum security prison and that may be because when there are similar circumstances in other films that invlove men doing time in a foreign country, the prison scenes are always brutal and sadistic. But I didn't get that here. Overall this is a great film and it really does make you ask the question, \" How far would you go for a friend? \" That is a tough question and maybe one that none of us could honestly answer until put into the same situation. Let's just hope that it never comes down to that."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": [
         "Fox 2000 Pictures",
         "Adam Fields Productions",
         "Twentieth Century Fox Film Corporation"
      ],
      "summaries": [
         "Alice and Darlene, best friends, decide to take a trip to Thailand to celebrate high-school graduation. While there, they are befriended by charming Australian rogue Nick Parks. Nick convinces them to take a weekend side trip to Hong Kong, but at the airport, they are busted for smuggling drugs. They are convicted in a show trial and sentenced to 33 years; in desperation, they contact Yankee Hank, an American lawyer based in Thailand who has been reported to be helpful if you've got the cash.",
         "Alice and Darlene, friends since birth, have just finished high school. They are planning a summer vacation in Hawaii, but they hear Bangkok is even better. They leave... without telling their parents about the change in plans. Bangkok's fun, but they're not crazy about their $6 accommodation. They try for a swim at a luxury hotel, but then there's some trouble when it's time to pay for their drinks. They're rescued by a roving software consultant, Nick Parks, an Australian. Nick's a good guy, although he can't decide which girl he's after. He tells the pair that Hong Kong is great, and he's willing to exchange his first class plane ticket for three economy... The girls rush to catch their flight out. At the airport police arrive suddenly. The girls have heroin in their backpack... Darlene's father has no luck freeing the girls from prison, even when he looks for help from the local DEA agents. But there's a sleazy lawyer, Hank Green, who may be able to do something, for a price...",
         "Two women are arrested for smuggling while vacationing in Thailand."
      ],
      "budget": 25000000
   },
   "movielensId": 2771,
   "movielens": {
      "languages": [
         "English",
         "ภาษาไทย"
      ],
      "releaseDate": "1999-08-13",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Jonathan Kaplan"],
      "runtime": 100,
      "movieId": 2771,
      "title": "Brokedown Palace",
      "mpaa": "PG-13",
      "actors": [
         "Claire Danes",
         "Kate Beckinsale",
         "Bill Pullman",
         "Jacqueline Kim",
         "Lou Diamond Phillips",
         "Daniel Lapaine",
         "Tom Amandes",
         "Aimee Graham",
         "John Doe",
         "Lim Kay Tong",
         "Beulah Quo",
         "Maya Goodwin",
         "Chad Todhunter",
         "Paul Walker"
      ],
      "imdbMovieId": "0120620",
      "originalTitle": "Brokedown Palace",
      "genres": [
         "Drama",
         "Thriller"
      ],
      "youtubeTrailerIds": ["p-xXGVsYOyM"],
      "plotSummary": "Best friends Alice and Darlene take a trip to Thailand after graduating high school. In Thailand, they meet a captivating Australian man, who calls himself Nick Parks. Darlene is particularly smitten with Nick and convinces Alice to take Nick up on his offer to treat the two of them to what amounts to a day trip to Hong Kong. In the airport, the girls are seized by the police and shocked to discover that one of their bags contains heroin.",
      "tmdbMovieId": 17707,
      "avgRating": 3.01019,
      "releaseYear": "1999",
      "numRatings": 1767,
      "posterPath": "/q429dpKlVP8uTrWJ7Tq9UFEQ8ww.jpg"
   }
}