{
   "tmdb": {
      "original_language": "fr",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "male model",
            "id": 167193
         },
         {
            "name": "granada",
            "id": 181313
         }
      ],
      "imdb_id": "tt0176422",
      "video": false,
      "title": "Alice and Martin",
      "recommendations": [],
      "backdrop_path": "/9Mxq3RmVHLS6LYHGXGf7RaOIHoI.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Alice",
               "gender": 1,
               "credit_id": "52fe4a09c3a36847f81b4e61",
               "name": "Juliette Binoche",
               "profile_path": "/rkW6eE75Tt1i3J1s2fsIDZBW0kd.jpg",
               "id": 1137,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Martin Sauvagnac",
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e65",
               "name": "Alexis Loret",
               "profile_path": "/ws3dJs1rgHYV86hnYZpOUa5p4R9.jpg",
               "id": 94067,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Jeanine Sauvagnac",
               "gender": 1,
               "credit_id": "52fe4a09c3a36847f81b4e69",
               "name": "Carmen Maura",
               "profile_path": "/6YU3CAWmlSy13aRUG2QWRZlJab5.jpg",
               "id": 2744,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Benjamin Sauvagnac",
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e6d",
               "name": "Mathieu Amalric",
               "profile_path": "/yJlm02FobTETwbyaCTOOU26OfmS.jpg",
               "id": 8789,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Saïd",
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e9b",
               "name": "Roschdy Zem",
               "profile_path": "/d2589ZaPsk4mpxlUYxSaOvaZdo3.jpg",
               "id": 20442,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Victor Sauvagnac",
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e9f",
               "name": "Pierre Maguelon",
               "profile_path": "/k3qmJTLkIUR9eJahRfKxkpXhSDg.jpg",
               "id": 36915,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e5d",
               "name": "André Téchiné",
               "profile_path": "/1briIztUPnyuSUwOWXaiFCpKOxV.jpg",
               "id": 96627,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e73",
               "name": "Olivier Assayas",
               "profile_path": "/ySOOBOK7qSPlmSeLmcFsQaULcwY.jpg",
               "id": 21678,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4a09c3a36847f81b4e79",
               "name": "Gilles Taurand",
               "profile_path": null,
               "id": 50538,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e7f",
               "name": "André Téchiné",
               "profile_path": "/1briIztUPnyuSUwOWXaiFCpKOxV.jpg",
               "id": 96627,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e85",
               "name": "Alain Sarde",
               "profile_path": "/95fgX9tAqahF98DG4FutHpLjbEi.jpg",
               "id": 3560,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e8b",
               "name": "Philippe Sarde",
               "profile_path": null,
               "id": 20075,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4a09c3a36847f81b4e97",
               "name": "Martine Giordano",
               "profile_path": null,
               "id": 41524,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "5450fe8ec3a3680242004767",
               "name": "Caroline Champetier",
               "profile_path": "/tkHJncN5hO0RXkWGKDSoek67fng.jpg",
               "id": 50539,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.62276,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "ES",
            "name": "Spain"
         }
      ],
      "id": 102489,
      "vote_count": 8,
      "budget": 0,
      "overview": "At the age of 20, Martin leaves his home town and comes to Paris, where he fortunately becomes a model by chance. He meets Alice, his brother's friend, and falls in love with her. They start a passionate relationship, although Martin remains very mysterious about his past and the reasons why he left his family. But when Alice tells him she's pregnant, he is suddenly almost driven to madness, as his past comes back to his mind. Alice will now do anything she can to help him",
      "similar": [
         269,
         3989,
         255,
         591,
         95,
         342473,
         707,
         147,
         283227,
         16869,
         284,
         612,
         1213,
         10545,
         37710,
         82695,
         59436,
         112160,
         858,
         80
      ],
      "original_title": "Alice et Martin",
      "runtime": 124,
      "poster_path": "/9IwtR0iolypfZbDrPk3xB7A9fKh.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Les Films Alain Sarde",
            "id": 635,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "France 2 Cinéma",
            "id": 83,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-10-23",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["André Téchiné"],
      "runtime": 124,
      "synopsis": null,
      "writers": [
         "Olivier Assayas",
         "Gilles Taurand"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0176422/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM2MzY1Mzg2OV5BMl5BanBnXkFtZTYwMTkyNjg4._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Juliette Binoche, Alexis Loret, Mathieu Amalric | See full cast and crew »"],
      "reviews": [
         "\"Alice and Martin (Alice et Martin)\" is the anti-Hollywood relationship movie of the summer. (It's French so you have to say it like you went to National Lampoon's famous School of ze French Akzent: \"a-LEES ay mar-TAHN\"). Act 1 gives you background on Martin growing up, yeah you think as you get restless, the usual dysfunctional family, the usual fights with dad, so he ends up in the big city. Act 2 is the usual couple in the Big City (in this case, of course Paris) and quite a few people in the audience yawned quite loudly. There's a few sophisticated touches -- she's pals with gay guys, he falls into being a fashion model for the easy money (and the metaphor for his blankness) so there's arguments about commercialism. This is my first Andre Techine film so I don't know if the crucial Act 3 is unusual, even though the central plot development was not a complete surprise. So many Hollywood \"meet cute, fall into bed, fight then realize they're made for each other\" movies have the couple existing in a bubble, separate from family or the sources of how they got to be like they are. Here coming to terms with their souls means coming to terms with their family and seeing through all the implications. So there's a bit of a gimmick in cutting back and forth with flashbacks to reveal background to us, but it's done sort of like an amnesia victim gradually remembering. Juliette Binoche really rises to the Act 3; I wasn't all that impressed with her in \"The English Patient\" but she's gut-wrenching here, going through very complex emotions--and nice non-Hollywood touch that she's the older of the pair. If Hollywood were to remake this movie, they'd cut to the last 10 minutes, and turn it into a courtroom drama where the heroic defense lawyer goes around interviewing everyone to get to \"the truth,\" but coming to peace with yourself is not something that litigation can solve, and Binoche's face shows that. Nice repeat use of Jeff Buckley song. (originally written 9/3/2000)",
         "With Techine directing Binoche you would expect something special, something emotionally involving, something...good. But, sadly, this movie is, for the most part, disappointing. First of all we don't truly care about the characters, Loret, who plays Martin, is wooden and distant, and the blossoming relationship between the two leads is unconvincing. Binoche is on top form, a beauty to behold, but every time she's off the screen the film nosedives. Perhaps Alice's past should have been explored too. The psychological leash Victor has on Martin isn't tight enough to convincingly escalate into patricide. However, it isn't all bad. The cinematography is beautiful, in particular, when Martin opens his window, as a child, and is greeted by the snow falling. Golden Spain too. Alice Et Martin isn't diabolical, but with the talent involved, you would expect so much more. 6/10",
         "Although the performances were good, this movie is quite frustrating. While a non-linear narrative can be effective and compelling, the disjointed plot or lack of one leaves the viewer bored and confused. The story line is further strained by the lack of development of much of Alice's and Martin's characters. For instance, one can't understand why Martin's father was such a brute or why Alice would choose to stay with Martin. It's a shame because this movie could have been a lot better.",
         "French screenwriter and director André Téchiné's thirteenth feature film which he co-wrote with French screenwriter Gilles Taurand and French screenwriter and director Olivier Assayas, premiered at the 43rd Valladolid International Film Festival in 1998. It tells the story about 20-year-old Martin who disappeared without notice after his father passed away. Several weeks later he shows up at his half-brother Benjamin's apartment in Paris where he meets Benjamin's partner Alice who is a violinist. Alice invites Martin to stay with them, which he does, and everything works out fine between the three, but when Martin gets a job as a model he falls in love with Alice. This fast-paced character-driven and dialog-driven psychological drama which was shot in France and Spain and produced by Alain Sarde, is a brilliantly directed romantic thriller by post-New Wave filmmaker André Téchiné with a shifting atmosphere, a parallel narrative that increases the pace and compelling milieu depictions which are emphasized by French cinematographer Caroline Champetier's notable cinematography. This plot-twisting French-Spanish co-production has a great score by French composer Philippe Sarde which features music from amongst others Jeff Buckley (1966-1997) and commendable acting performances by French actress Juliette Binoche, French actor, screenwriter and director Mathieu Amalric and French actor Alexis Loret. An intriguing mystery and an internal study of character from the late 1990s focusing on themes like coming-of-age, family relations, guilt, love and redemption.",
         "Andre Techine is a director that likes to portray the problems young people are facing, which seems what attracted him to \"Alice et Martin\", a film that gives us a strange take in how the past catches up with a young man that challenged his father's authority. The screen play is by Olivier Assayas and Gilles Taurand, two men that have had written better things for the cinema. The film's opening sequence is puzzling since we have no clue as to what makes Martin run away from home. This seems to be a disjointed way to make the film work, because even though we might guess what could have happened, when the final truth comes about, we just don't care about it. Then there is the problem of Alice's attraction for Martin. Alice is a woman that seems to know what she wants. She is older than the young guy that comes into her life, and should have been wiser to avoid, at all costs, but she falls for him, anyhow. Basically, what attracted us to the film was Juliette Binoche, an actress that is always interesting to watch. Unfortunately, because our lack of interest in the story, we stop caring about her long before we get to know what really happened. Alexis Loret is a weak choice for Martin. Mathiew Amalric and Carmen Maura fare better in their supporting roles. \"Alice et Martin\" is a slow moving film that will get in the nerves of viewers. Better luck to M. Techine in his next effort.",
         "When \"Alice et Martin\" was released in France in November 1998, one of the more positive comments was in relation to its unorthodox narrative structure. In Dec 1999, upon it UK release the film was again highly praised for its structure, editing technique and bravura score. In Jul 2000 when \"Alice et Martin\" was released in the US it was heavily criticised for its narrative structure, which may critics labelled confusing and non-sensical. Are we at a point that even critics need to be spoon feed a 123 narrative. The flashback in \"Alice et martin\" is admittedly disjointed at first - it's meant to be as it reflects Martin's psycological state. \"Alice et Martin\" is a simple story which breaks up into two distinguishable parts. We are introduced to Martin (Alexis Loret) in a prologue which sketches his troubled childhood relationship with his father. We then see Martin flee from his home and live rough in the countryside before landing on his brother Benjamin's (Mathieu Amalric) door. Benjamin share a flat with musician Alice (Juliette Binoche). initially Alice is a brittle presence and resents Martin for disturbing the equilibrium she has found in a sexless relationship with the gay Benjamin. Martin quickly become infatuated with Alice and eventually she gives in and allows herself to fall in love. this first section of the film is episodic and set over a year, although on screen it is approximately 45 minutes long. The changing seasons are reflected by scenes showing summer, autumn and winter views of Paris. The second part of the film begins when Martin is taken ill in Spain at the news that Alice is pregnant. We soon learn that he killed his father and cannot function as a human being or become a father until justice takes it's course, and he is punished. His stepmother was the only witness and Alice travells to Martins old home to convince her to testify at Martin's trial. Techiné's film is unorthodox in many ways. The relationship between Alice et Martin is un-even from the beginning with her taking the lead. It is also shown as a deepky sexual relationship. Alice's strength again come to the fore when she is fighting Martin's family. however it is the issues of law and punishment, as well as family hurt which again haunt Techine in his work. As well as the law of the land we are presented with a family law. Indeed all the characters are shown to construct families of their own - ala Benjamin and Alice'e \"Zoro - Zero\" relationship. The performances in the film are great. Amalric, Carmen Maura as Martin's mother and Marthe Villalonga as his stepmother are great. Alexis Loret in his first screen role is blank and his performance has been criticised for this. Yet I think this is exactly how he should be. His entire life is stunted by his guilt. In her first role since winning an Oscar, Juliette Binoche does what she does best - underplays the drama and steals the film, coming into her own in the second section. Caroline Champetier's cinematography of Paris, Granada and South West France is ace, while Philip Sarde's score is assured and complimentary. Alice et Martin is not perfect. The final act labours a little too much on Martin's guilt rather than portraying how it affects his relationship with the pregnant Alice. He is also shown at the end in prison, a step to far, we dont need to know that - we only need to know that he is taking responsibility for his actions and being allowed to do so by his family. Interestingly while all of Martin's brothers all have major issues with their father, who is described as cold, distant and hard, Téchiné does not present him as a monster - instead the relationship between father and sons is a lot more ambiguous and interesting. All in all one of the best French movies of 1998. Téchiné's most mature film and a terrific turn from Juliette Binoche.",
         "A weirdly inconsistent film, mixing hamfisted direction with an occasional obsessive attention to telling detail, seemingly shallow interactions with deeper thoughts, and Juliette Binoche's acting with Alexis Loret's acting. Loret can't act at all, even though he is pretty. This is not a great French film, but there's a lot to like about it nonetheless. Juliette Binoche is in fact that pretty, and she can act too. It has some (but not all) of the unforced naturalness that distinguishes French cinema. And it does not look upon its audience as a bunch of slack-jawed troglodytes, always a plus. Seven of ten, not the thing to convince someone to enjoy French cinema but pleasurable nonetheless.",
         "Martin, age 20, runs away from his rural French home under mysterious circumstances and ends up at his half-brother's flat in Paris, where he meets and falls in love with the half-brother's female roommate Alice, age somewhat older. When Alice informs him, halfway through the film, that she is pregnant, he has a flashback (which we don't see for a while yet) of what happened to make him flee his father's house, and for the rest of the film, while Martin languishes in a psychiatric facility, Alice must resolve the situation Martin created, a labor of love she doesn't hesitate to perform even though it involves the sacrifice of her own happiness. The bad news: This is a long, slow movie, and the characters are not really as well-defined as they perhaps could have been, especially given the film's character-centered plot. The good news: It's really beautiful to watch, and when the end of the movie sneaks up on you, and you've given what you've seen a little while to sink in, it's so brilliantly sad that you just want to fly to Paris and find Alice and hug her or take her to dinner or something. Not a good choice for a first-date movie--rent the video and have a close friend over for wine and cheese.",
         "In her review of 'Alice et Martin' in Cinopsis, Marina Bergamelli states that the reason why Techine made this film remains obscure. For those people who understand and know that such emotional worlds exist, it is a cathartic masterpiece of great value. It takes courage to make a feature film of this nature and am grateful to the people who undertook such an artistic endeavour. Film would be dead without them. Julian Flynn",
         "Once a critic for Cahiers Du Cinéma, André Téchiné wakes generally high expectations from movie viewers, but he not always satisfied them. The interest for melodrama that distinguishes him from nouvelle vague predecessors returns in Alice and Martin which is not free from the thematic of dysfunctional family of others of his films. In this case the results are more unconvincing. At the beginning and for a long time we don't know what happens, and when we know, it does not matter enough. The disproportion between the elliptical and not few scenes of unnecessary diffuse dialogue does not contribute to go deep into the drama. Secondary characters like the tyrannical father, the mother, and the stepmother of the protagonist are delineated in the style of the stereotyped Spanish telenovela. The nicely photographed landscapes (a mark in Téchiné's pictures) add to the pleasure of the viewer but not fulfill the holes in the screenplay. The story, excessively charged with family quarrels, suicide, involuntary crime, tempestuous love, professional aspirations, madness, atonement, and final redemption, can't easily catch the spectator. Adam Gai"
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Les Films Alain Sarde",
         "Vértigo Films",
         "France 2 Cinéma"
      ],
      "summaries": ["At the age of 20, Martin leaves his home town and comes to Paris, where he fortunately becomes a model by chance. He meets Alice, his brother's friend, and falls in love with her. They start a passionate relationship, although Martin remains very mysterious about his past and the reasons why he left his family. But when Alice tells him she's pregnant, he is suddenly almost driven to madness, as his past comes back to his mind. Alice will now do anything she can to help him."],
      "budget": 0
   },
   "movielensId": 2773,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "1998-10-23",
      "dvdReleaseDate": null,
      "directors": ["André Téchiné"],
      "runtime": 124,
      "movieId": 2773,
      "title": "Alice and Martin",
      "mpaa": null,
      "actors": [
         "Juliette Binoche",
         "Alexis Loret",
         "Carmen Maura",
         "Mathieu Amalric",
         "Roschdy Zem",
         "Pierre Maguelon"
      ],
      "imdbMovieId": "0176422",
      "originalTitle": "Alice et Martin",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["4olEujRCQOI"],
      "plotSummary": "At the age of 20, Martin leaves his home town and comes to Paris, where he fortunately becomes a model by chance. He meets Alice, his brother's friend, and falls in love with her. They start a passionate relationship, although Martin remains very mysterious about his past and the reasons why he left his family. But when Alice tells him she's pregnant, he is suddenly almost driven to madness, as his past comes back to his mind. Alice will now do anything she can to help him",
      "tmdbMovieId": 102489,
      "avgRating": 2.97475,
      "releaseYear": "1998",
      "numRatings": 99,
      "posterPath": "/9IwtR0iolypfZbDrPk3xB7A9fKh.jpg"
   }
}