{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "transsexuality",
            "id": 571
         },
         {
            "name": "canada",
            "id": 1329
         },
         {
            "name": "eroticism",
            "id": 1664
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "lesbian relationship",
            "id": 9833
         },
         {
            "name": "lesbian",
            "id": 10768
         },
         {
            "name": "transgender",
            "id": 17975
         },
         {
            "name": "lesbian sex",
            "id": 33998
         },
         {
            "name": "lgbt",
            "id": 158718
         },
         {
            "name": "vancouver",
            "id": 160223
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0168987",
      "video": false,
      "title": "Better Than Chocolate",
      "recommendations": [
         29371,
         12793,
         31216,
         12808,
         31421,
         19344,
         28031,
         37636,
         12800,
         96314,
         106538,
         26491,
         38645,
         294,
         31031,
         125233,
         62986,
         14845,
         15647,
         56743
      ],
      "backdrop_path": "/9Cd0valk8L7COsMwPq6XPEsf2dd.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Maggie",
               "gender": 1,
               "credit_id": "52fe47699251416c7509853f",
               "name": "Karyn Dwyer",
               "profile_path": "/3HVIxccgAkQc37yuLmgKB5tBTPa.jpg",
               "id": 104151,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Kim",
               "gender": 1,
               "credit_id": "52fe47699251416c75098543",
               "name": "Christina Cox",
               "profile_path": "/qkbxOma6tBghX6sYJW0avfYaimV.jpg",
               "id": 28110,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lila",
               "gender": 1,
               "credit_id": "52fe47699251416c75098547",
               "name": "Wendy Crewson",
               "profile_path": "/e20JNF2oF7B0uGcoepL8j3uY0iE.jpg",
               "id": 19957,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Frances",
               "gender": 1,
               "credit_id": "52fe47699251416c7509854b",
               "name": "Ann-Marie MacDonald",
               "profile_path": "/gzHoYliPbwb3KDZlPljSMEY6dYh.jpg",
               "id": 104156,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Judy",
               "gender": 2,
               "credit_id": "52fe47699251416c7509854f",
               "name": "Peter Outerbridge",
               "profile_path": "/a3OpOcxpBWi30MsgFTYLsWFwFoV.jpg",
               "id": 12978,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Mr. Marcus",
               "gender": 2,
               "credit_id": "52fe47699251416c75098553",
               "name": "Jay Brazeau",
               "profile_path": "/oSFswqMxjLCAwVpEG2yK6NzLUiP.jpg",
               "id": 63791,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Carla",
               "gender": 2,
               "credit_id": "52fe47699251416c75098557",
               "name": "Marya Delver",
               "profile_path": "/8qyWiiKOlNiZbvVhrYuJjouHQmC.jpg",
               "id": 75948,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5305423d925141348b07bef3",
               "name": "Anne Wheeler",
               "profile_path": "/4ZtAMT6qy1AcecimExWPtaYTa0K.jpg",
               "id": 97773,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "55638bafc3a36853b7003112",
               "name": "Peggy Thompson",
               "profile_path": null,
               "id": 980687,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.015697,
      "production_countries": [{
         "iso_3166_1": "CA",
         "name": "Canada"
      }],
      "id": 18212,
      "vote_count": 31,
      "budget": 0,
      "overview": "Not long after moving into her own place, Maggie finds herself with two unsolicited roommates: her recently divorced mother, Lila, and her young brother. The timing is especially bad, considering Maggie has fallen hard for an attractive woman, Kim, only hours before they move in. What could be a nonissue becomes increasingly complicated -- since Maggie's family is unaware of her sexual orientation, and Maggie is not open to sharing that information.",
      "similar": [
         513,
         370663,
         401898,
         300667,
         258480,
         540,
         449176,
         244772,
         5123,
         11421,
         11634,
         226,
         254470,
         525,
         27586,
         2255,
         6477,
         294,
         12793,
         152584
      ],
      "original_title": "Better Than Chocolate",
      "runtime": 101,
      "poster_path": "/gT38JHYcUSrwdrWX7cQda0FuaFD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Government of British Columbia Film Incentive BC Program",
            "id": 53186,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "British Columbia Film",
            "id": 10316,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "CITY-TV",
            "id": 11572,
            "origin_country": ""
         }
      ],
      "release_date": "1999-02-14",
      "vote_average": 6.5,
      "belongs_to_collection": null,
      "tagline": "A delicious romantic comedy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anne Wheeler"],
      "runtime": 101,
      "synopsis": null,
      "writers": ["Peggy Thompson"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0168987/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1NDIwMjkzOV5BMl5BanBnXkFtZTcwMjA4MTk0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Wendy Crewson, Karyn Dwyer, Christina Cox | See full cast and crew »"],
      "reviews": [
         "Well, what can one say about this film? You could just agree to all the bad critics that have been written about it \u0096 that \"Better than chocolate\" is nothing more but a cliché and an unrealistic fairy tale. Fairy tale's the word: What is cinema supposed to be if not a fairy tale? It's unrealistic; it helps us forgetting our daily troubles and allows us to dream and to bathe in romantic feelings. And these are exactly the reasons I recommend \"Better than chocolate\" and think that it's a splendid movie, a hilarious comedy and a love story so sweet you just get enchanted by it. It's a classic: The sweet princess, Meggie, just quit university and preferred becoming part of Vancouver's gay scene, performing in a gay bar (and she's so great in it!) and working in a lesbian book store. Things seem to go pretty fine until the day when Maggie's Mum Lila calls and informs our princess that she just left her current husband and wants to move in with Maggie, bringing Maggie's teen brother Paul with her. The problem is: Mum doesn't know (or doesn't want to know) that her little daughter is gay. Things get even more problematic when one night, after her performing at the club, Maggie meets her knight, who does not wear an armour or ride a white horse, but who is an attractive, tough and cool girl named Kim, rides a funky van and lives on the road, earning her money with drawing portraits. When all the characters mentioned above finally find themselves living under the same roof some days later, things become chaotic and almost grotesque cause it's so obvious that Kim and Meggie are a couple but Lila is simply blind for it. Mind you, the movie also deals with other interesting characters. We get to know Frances, the neurotic owner of the book shop Maggie works in. There is also Judy, who once was Jeremy, but now is a woman and hopelessly in love with Frances. And don't forget Carla, whose favourite pass of time is sex, who seduces almost every person crossing her way, is an expert in the newest *toys* and digs on Maggie as well as her brother Paul. Of course it's one or two clichés, I mentioned it before. But if you see how lightly and heart-warmingly the story is told, if you hear the hilarious jokes and one-liners, follow the soft filming of the camera you just can't help forgetting about those clichés and falling in love with this movie. For in the middle of this colourful chaos the love story between Kim and Maggie is the calm and comforting pole, it's told in silent pictures and gentle sounds (which become a bit louder when it comes to \u0085 well, the making love part). And this beautiful love story has highlights of its own, and I don't want to reveal even one of them. I can only say that much: A lot of colour and \u0085 goddesses ;) (everyone who's seen the movie of course knows what I'm talking about) There is also something else I love about this film: Although it's a fairy tale and most parts of it are simply utopic, \"Better than chocolate\" can be inspiring and show possibilities: The possibility of an alternative life style and that you can be comfortable with it, no matter what others might think, the possibility to break out of certain expectations society burdens us with and the possibility to love differently. For example when Maggie quits her finance studies to live her dream of being an author. So, besides allowing us to dream, this film also gives incredible hope and this might be its greatest strength. A word on the cast which is simply \u0096 brilliant. And before concentrating on one of the protagonists, who in my opinion stood out, I'd like to compliment the others. There is this young actor playing Paul, who up to \"Better than chocolate\" has had no acting experience but is very good at what he's doing. There is the sex-ridden but likable Carla. The neurotic Frances \u0096 Canada's currently probably most famous lesbian actress and author Ann-Marie MacDonald (and according to director Anne Wheeler the only openly gay actress participating in this movie). The icing on the cake in this film are two profound Canadian actors \u0096 Wendy Crewson as Lila and Peter Outerbridge as Judy. Wendy (who is probably most familiar as Harrison Ford's wife in \"Air Force One\") is just outstanding as the confused, sweet and clueless Mum with a weakness for chocolate. Peter Outerbridge is just incredible as Judy and you really have a hard time to believe that this is his first transsexual performance \u0096 he's so great in this role and just a beautiful woman. And now let me point out the person who impressed me most with her performance: Christina Cox as Kim. She's hot, she's sexy, she's tough and cool but at the same time so soft and feminine. I think only few actresses can add so many different facets to their role. I mean, she could have easily played a simple butch, but she adds such charisma and dignity to her character \u0096 it's just amazing. There, enough said, she's just great. The movie's soundtrack is a highlight of its own \u0096 Sarah McLachlan with \"Ice Cream\" for example \u0096 and perfectly mirrors the film's young spirit, it's modern, it's sexy, it's dreamy and it rocks. And with this I'd like to give \"Better than chocolate\" three thumbs up \u0096 a summer movie with heart, soul, humour and a lot of love.",
         "I can honestly say that I have never seen a lesbian move that really made me feel all warm and snuggly. I just thought the whole plot was perfect. I have nothing bad to say about the actual movie itself. I really thought they picked the perfect people to play the main parts. Having good actors and actresses really make the whole movie more enjoyable. Better Than Chocolate certainly was one of those movies where you could sit back and relax and just enjoy it. A true romantic comedy. I personally have not seen a movie that shows what life is really like for lesbians and well, this one certainly does. I would definitely recommend this film to anyone. Old and young alike.",
         "I thought I should start closing my blinds at night, since the character of Frances IS me! I was extremely impressed by the two leads, Karen Dwyer and Christina Cox. Their love making scenes were utterly realistic, a tribute to the acting ability of these two lovely ladies.(unless, of course, they are truly lesbians) But for me, the supporting cast was equally amazing. This is a group of great Canadian actors, who have proven once again that Canada can hold her own when it comes to the arts. Outstanding performances by Peter Outerbridge, Anne-Marie MacDonald and Wendy Crewson. I loved every one of you. I think anyone who feels the need to dis this movie is taking life way too seriously!(Nothing like a dyke with an attitude, eh?)",
         "I liked this movie. It wasn't the best lesbian film I've seen, but it's quite sweet. I'll get the bad points of the movie out of the way first. My main problem with the film was that the characters weren't really deep. You couldn't really relate to them much as the makers only skimmed the surface of their personalities. I felt the same way with the plot, too. It needed a few viewings before I could really get into this film. On the other hand. Although a little bland, the characters where still quite sweet. And funny. My favourite being Judy, the loveliest drag-queen ever! If you like romantic little stories, and are a fan of gay cinema - then you should see this movie.",
         "The problem with Canadian cinema is that most of the time it is pretty good, pretty different from those ugly Hollywood formulas. Another problem is we don't have the chance to see these movies in Canadian theatres, because it is filled with USA. Director Anne Wheeler is from west Canada. It's the third of her movies I see : Loyalties (1986, with fantastic Indian actress Tantoo Cardinal) Bye bye blues (1989) These two have a Canadian cultural edge to it. Not this one : it is universal, but set in Canada. What the three movies have in common is the FEELINGS! They are also very feminine. This one is a romantic comedy, with good acting by Christina Cox and charming Karyn Dwyer. It's fun, human, intelligent. Did I have to say this is a movie about lesbians? Not really : it's just a pretty good romantic comedy. I'd like to see more of Anne Wheeler because I'm sure she's a great talent from Canada. By the way, I'm sure that Canadians from the west don't really know about Quebec's films. Very sad! We make a pretty good lesbian picture too : Revoir Julie. Thanks to miss Wheeler and all the cast.",
         "Better Than Chocolate is a Canadian film about the relationship between mother and daughter which turns out to be a lot closer than we're originally led to believe. As the mother, Wendy Crewson appears to be oblivious to the fact that daughter Karyn Dwyer is a lesbian. At least that's how it appears when she drops in unannounced on her daughter and a recent new girl friend, Christina Cox. The pretext is that Dwyer has dropped out of the university, but Crewson wants to check out more than that. Acting honors in this film go to Peter Outerbridge who plays the transgender woman Judy, formerly Jeremy. Outerbridge in his own way is playing a role as much a pioneering effort as Hillary Swank in Boys Don't Cry. Had this been a major American film, we might have been talking Oscar for him. Outerbridge is a wise old soul who's seen life from a few different perspectives. She's been cast out by her family, kind of like Michael Dunn is Ship of Fools. Just as Dunn's parents didn't want a dwarf around and gave him spending money to constantly travel, Outerbridge's parents by him a flat precisely so he can live away from them. It's quite a scene when Judy discovers that the flat is really a kiss off. Crewson and Outerbridge aid each other in their moment of crisis. If nothing else should have tipped her off that Dwyer was not living the 'normal' life those battery operated sex toys should have said something. Of course Crewson finds they have their uses and she who has said that sex is now being sworn off for chocolate finds that even battery operated love is better than no love at all. Better Than Chocolate is funny and sweet and endearing all at the same time. A triple threat on the emotions from Anne Wheeler in Canada.",
         "This is a wonderful movie rich in both love and life. Maggie, a worldly yet closeted twenty-year-old runs into her new girlfriend Kim, a similarly aged artist-on-the-road, the day before her mother and brother come to live with her and romantic adventure ensues. Maggie's mother, Lila, believes the only pleasure left in the world after her divorce is chocolate, but soon finds there still is more to life. This film covers all the bases of the LGBT spectrum and, while occasionally using stereotypes, is a beautiful way to celebrate diversity. This is one of my favorite movies for the subtle humor and beautiful theme of the movie and I, personally, give it an A+!",
         "First of all, this movie shows just how tastefully lesbian sex can be portrayed on the big screen. It's hot. Super hot. If I saw something like that happen in real life, I think I would explode. Not hardcore or anything like that, just creative and beautiful. The girls aren't even 10's, but they totally make it work. Sex aside, this movie actually has quite a good story, is pretty funny, and I think just about every character is likable in some way. But you definitely have to be open minded to enjoy this one. I wanted to watch this one for all the wrong reasons, only to find out that it is actually a very good movie. I'm glad I watched this one in its entirety... with the sound on.",
         "This is that rarity, a sexually explicit film that's actually good. Chelsea Clinton-lookalike Karen Dwyer is a college dropout whose family doesn't know she's gay. Just as she's beginning her first serious relationship with beautiful Christina Cox, her mother (a hilarious Wendy Crewson) and teenage brother come for a visit. While Maggie (Dwyer) attempts to hide her relationship, her mother befriends a pre-operative transsexual and her brother makes time with a beautiful, sexually promiscuous bisexual. The movie gets bogged down in politics toward the end, but for the most part it's quite entertaining. Crewson displays an enormous comic talent as a middle aged woman rediscovering her sexuality and the sex scenes between Dwyer and Cox are beautiful and romantic. This film is aimed primarily at the gay/lesbian crowd but should appeal to quite a few straights as well. If you think Canadians are dull, rent this film and see for yourself.",
         "I was expecting a pleasant bit of romantic fluff, but instead found this movie to be hilarious, hot, poignant and well-acted. The humor is all about the difficulties we face in communicating with each other, fears of coming out, of taking risks. The romantic content is passionate and believable. And the ultraviolet Julie Christie number is not to be missed."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "British Columbia Film",
         "CITY-TV",
         "Government of British Columbia Film Incentive BC Program"
      ],
      "summaries": ["Two attractive young lesbians, Maggie and Kim, meet in Vancouver, develop a passionate romance, and move in together. Meanwhile, Maggie's well-meaning but naive mother Lila gets divorced and decides to move to Vancouver and join the household. Soon after, Lila is befriended by Judy, a transsexual about to undergo a sex-change operation. Complications ensue as the conservative Lila learns the truth about Maggie, Judy, and their diverse group of friends."],
      "budget": 0
   },
   "movielensId": 2774,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-02-14",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["Anne Wheeler"],
      "runtime": 101,
      "movieId": 2774,
      "title": "Better Than Chocolate",
      "mpaa": "R",
      "actors": [
         "Karyn Dwyer",
         "Christina Cox",
         "Wendy Crewson",
         "Ann-Marie MacDonald",
         "Peter Outerbridge",
         "Jay Brazeau",
         "Marya Delver"
      ],
      "imdbMovieId": "0168987",
      "originalTitle": "Better Than Chocolate",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["MxS3znIIzfQ"],
      "plotSummary": "Not long after moving into her own place, Maggie finds herself with two unsolicited roommates: her recently divorced mother, Lila, and her young brother. The timing is especially bad, considering Maggie has fallen hard for an attractive woman, Kim, only hours before they move in. What could be a nonissue becomes increasingly complicated -- since Maggie's family is unaware of her sexual orientation, and Maggie is not open to sharing that information.",
      "tmdbMovieId": 18212,
      "avgRating": 3.32231,
      "releaseYear": "1999",
      "numRatings": 771,
      "posterPath": "/gT38JHYcUSrwdrWX7cQda0FuaFD.jpg"
   }
}