{
   "tmdb": {
      "original_language": "it",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0119614",
      "video": false,
      "title": "Marcello Mastroianni: I Remember",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4aecc3a368484e16e1c3",
               "name": "Marcello Mastroianni",
               "profile_path": "/mZCdZhu5UfS8As8gSoyxYAsXVNl.jpg",
               "id": 5676,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4aecc3a368484e16e1c7",
               "name": "Renato Berta",
               "profile_path": null,
               "id": 19054,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4aecc3a368484e16e1cb",
               "name": "Manoel de Oliveira",
               "profile_path": "/yDDRrKfzFhyoMkujD46ask3XeFF.jpg",
               "id": 81749,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4aecc3a368484e16e1cf",
               "name": "Diogo Dória",
               "profile_path": "/uEk1s9UVWR16n3D4oSJdSEGHou8.jpg",
               "id": 130715,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Herself",
               "gender": 1,
               "credit_id": "52fe4aecc3a368484e16e1d3",
               "name": "Leonor Silveira",
               "profile_path": "/pNRH0PQKBwaOc8nwkRv3H6vFDpa.jpg",
               "id": 213290,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4aecc3a368484e16e1b9",
               "name": "Anna Maria Tatò",
               "profile_path": null,
               "id": 1083461,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4aecc3a368484e16e1bf",
               "name": "Anna Maria Tatò",
               "profile_path": null,
               "id": 1083461,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.149786,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 126996,
      "vote_count": 2,
      "budget": 0,
      "overview": "In 1996, Marcello Mastroianni talks about life as an actor. It's an anecdotal and philosophical memoir, moving from topic to topic, fully conscious of a man \"of a certain age\" looking back. He tells stories about Fellini and De Sica's direction, of using irony in performances, of constantly working (an actor tries to find himself in characters). He's diffident about prizes, celebrates Rome and Paris, salutes Naples and its people. He answers the question, why make bad films; recalls his father and grandfather, carpenters, his mother, deaf in her old age, and his brother, a film editor; he's modest about his looks. In repose, time's swift passage holds Mastroianni inward gaze.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         858,
         141,
         634,
         3981,
         242224,
         112160,
         394117,
         376867,
         437557,
         297762,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Marcello Mastroianni: mi ricordo, sì, io mi ricordo",
      "runtime": 198,
      "poster_path": "/fOjI7t91yG7oT7i4LsfTPjOlohF.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [],
      "release_date": "1997-08-29",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Anna Maria Tatò"],
      "runtime": 198,
      "synopsis": null,
      "writers": ["Anna Maria Tatò"],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0119614/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwMzMxMjMyOV5BMl5BanBnXkFtZTcwMDM4MjEyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Marcello Mastroianni, Renato Berta, Manoel de Oliveira | See full cast and crew »"],
      "reviews": [
         "This is a fantastic documentary for anyone really interested in the cinema. It is very long so it is really for the committed cinephile and true fan of Marcello Mastroanni. He was already 72 when he recorded this but that only gives the film even more credibility. He has great humility and is very candid. I have always admired this man both as an actor and as a person. His warmth is such that you can imagine yourself having an espresso with him and listen to him talk. And can he talk. You can see that he truly enjoys his profession and takes it very seriously indeed. He talks with the same easy manner that he acts.He makes it all look and sound so easy. Bravo Marcellino wherever you are.",
         "A sensitive documentary portraying in his own words, the great Italian actor Marcello Mastroianni. Film clips to go along with his life story. Although known as The Latin Lover after his starring role in La Dolce Vida, he claims it is not so. He maintains in his own words (Subtitled) that he was paid to play the role of the lover in his films and never even walked on the Via Veneto. Mastroianni made about 170 films and never had an aging problem because he had no problem playing characters that matched his age. He quite honestly said that at least 20 of his films were complete duds and some clips were shown on a couple of them. I'm surprised that there has not been a greater distribution of this film, particularly since it showed some of the older Italian movie directors who Scorcese and other American directors have openly copied from. For Italian film buffs, nostalgia at its best.",
         "It is almost impossible to think that it's been almost ten years since Marcello Mastroianni died. As far as actors go, he was a colossal figure that dominated the Italian cinema throughout his long and productive career. With almost one hundred and fifty pictures to his credit, Mr. Mastroianni's career is something that few actors can claim for themselves. Marcello Mastroianni's love for the cinema was evident as a young man. Like most of his contemporaries, the medium was like a drug. His early favorites, no wonder, were those American movie stars that appeared in the film that impressed him as a growing man. Coming from humble origins, he was lucky to land a job in what otherwise might have been a hard area to get into. Anna Maria Tato, who was intimately connected to the actor, does a fine job in this three hours and twenty minutes documentary that is never boring and holds our attention from the moment the camera shows us this vibrant man of the movies. At the time most of the filming was done, he was working for Manoel DeOliveira, the Portuguese director, in what was going to be his last film appearance. Ms. Tato shows him in different locations as he tells us his own philosophy of life, and about his triumphs and the films that didn't make it. Marcello Mastroianni, with his good looks, resented the fact he was viewed as a \"Latin Lover\", something that he was far from being. Mr. Mastroianni is kind to the people he worked with and he is complimentary to the people that trusted him with starring roles in their projects. His association with Fellini is legendary, but let's not forget that Mr. Mastroianni worked with the best of the best. Vittorio DeSica, Luchino Visconti, Mario Monicelli, Ettore Scuola, Pietro Germi, Elio Pietri, and the other giants of the Italian cinema. While Mr. Mastroianni keeps us entertained with his memories, little comes out about his own personal life. The only thing close to a revelation is when his Paris apartment is shown and he mentions, casually, that he also has a daughter in Paris. We can respect his desire to keep that part of his life away from us because this documentary is about his work bringing to life the people he played on the big screen. One can only hope Mr. Mastroianni is now in heaven surrounded by Toto, Giulietta Massina, Silvana Mangano, Anna Magnani, Vittorio Gassman, and all the Italian great actors that, like you, enriched our lives. Thank you Marcello, and Bravo!",
         "Romano Rating: 77% A humorous and self-deprecating look at the life of a 72-year-old Italian film icon in his own words. Had it been edited down to less than two hours, this biographical documentary might well have been even more enjoyable to watch. It is still well worth seeing, there are some wonderful anecdotes and brilliant scenes from Mastroianni's films and stage appearances. But at 3 hours and 18 minutes, you may be better off renting it on video and taking breaks. To Remember: \"When I was young, life seemed long and endless to me.\" \"This is a marvelous profession, you're paid to play and everyone applauds.\""
      ],
      "genres": [
         "Documentary",
         "Biography"
      ],
      "productionCompanies": [
         "Cinecittà",
         "Istituto Luce",
         "Mikado Film"
      ],
      "summaries": ["In 1996, Marcello Mastroianni talks about life as an actor. It's an anecdotal and philosophical memoir, moving from topic to topic, fully conscious of a man ^Óof a certain age^Ô looking back. He tells stories about Fellini and De Sica's direction, of using irony in performances, of constantly working (an actor tries to find himself in characters). He's diffident about prizes, celebrates Rome and Paris, salutes Naples and its people. He answers the question, why make bad films; recalls his father and grandfather, carpenters, his mother, deaf in her old age, and his brother, a film editor; he's modest about his looks. In repose, time's swift passage holds Mastroianni inward gaze."],
      "budget": 0
   },
   "movielensId": 2776,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1997-08-29",
      "dvdReleaseDate": "2000-03-21",
      "directors": ["Anna Maria Tatò"],
      "runtime": 198,
      "movieId": 2776,
      "title": "Marcello Mastroianni: I Remember",
      "mpaa": null,
      "actors": [
         "Marcello Mastroianni",
         "Renato Berta",
         "Manoel de Oliveira",
         "Diogo Dória",
         "Leonor Silveira"
      ],
      "imdbMovieId": "0119614",
      "originalTitle": "Marcello Mastroianni: mi ricordo, sì, io mi ricordo",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1996, Marcello Mastroianni talks about life as an actor. It's an anecdotal and philosophical memoir, moving from topic to topic, fully conscious of a man \"of a certain age\" looking back. He tells stories about Fellini and De Sica's direction, of using irony in performances, of constantly working (an actor tries to find himself in characters). He's diffident about prizes, celebrates Rome and Paris, salutes Naples and its people. He answers the question, why make bad films; recalls his father and grandfather, carpenters, his mother, deaf in her old age, and his brother, a film editor; he's modest about his looks. In repose, time's swift passage holds Mastroianni inward gaze.",
      "tmdbMovieId": 126996,
      "avgRating": 3.54667,
      "releaseYear": "1997",
      "numRatings": 150,
      "posterPath": "/fOjI7t91yG7oT7i4LsfTPjOlohF.jpg"
   }
}