{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "raven",
         "id": 166484
      }],
      "imdb_id": "tt0057449",
      "video": false,
      "title": "The Raven",
      "recommendations": [
         28501,
         23439,
         25319,
         28498,
         29074,
         29486,
         17907,
         26680,
         32569,
         3079,
         27003,
         30137,
         28504,
         30346,
         29570,
         29030,
         11815,
         18250,
         18274,
         31579
      ],
      "backdrop_path": "/f3dFwTEt1OixC2WL9C3tAV7okef.jpg",
      "revenue": 1499275,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Dr. Erasmus Craven",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db65",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Dr. Adolphus Bedlo",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db69",
               "name": "Peter Lorre",
               "profile_path": "/6V1Jd8qN0PV76xJce7cJsqkQ55R.jpg",
               "id": 2094,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Dr. Scarabus",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db6d",
               "name": "Boris Karloff",
               "profile_path": "/3kY1eEgGFAoVyy8MjNolCS5wouj.jpg",
               "id": 2922,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Lenore Craven",
               "gender": 1,
               "credit_id": "52fe45c3c3a368484e06db71",
               "name": "Hazel Court",
               "profile_path": "/arrnJNt1mJqH7NEwyYr7Mxz0eeY.jpg",
               "id": 101499,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Estelle Craven",
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06db75",
               "name": "Olive Sturgess",
               "profile_path": "/9H530FRyLrpUB7U8dYO8Ft36g0v.jpg",
               "id": 102722,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Rexford Bedlo",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db79",
               "name": "Jack Nicholson",
               "profile_path": "/z5kVLyn3sxj0wNRlFgVgT6deeRO.jpg",
               "id": 514,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Roderick Craven",
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db7d",
               "name": "John Dierkes",
               "profile_path": "/enFa8jeKSkySro8wto7PPcJ3bZ4.jpg",
               "id": 29645,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db2b",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db31",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db37",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06db3d",
               "name": "Edgar Allan Poe",
               "profile_path": "/akmuLsbMrtcVrmiiaYqDK3QNdwC.jpg",
               "id": 48415,
               "department": "Crew",
               "job": "Poem"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06db43",
               "name": "Les Baxter",
               "profile_path": "/Al8Y7Wqykey2ne2QcbLCUC2wjcZ.jpg",
               "id": 99452,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db49",
               "name": "Floyd Crosby",
               "profile_path": null,
               "id": 4083,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c3c3a368484e06db4f",
               "name": "Ronald Sinclair",
               "profile_path": "/eX9iLKCQVCPprwzdrdzaDtwkAGR.jpg",
               "id": 102721,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06db55",
               "name": "Daniel Haller",
               "profile_path": null,
               "id": 28236,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06db5b",
               "name": "Daniel Haller",
               "profile_path": null,
               "id": 28236,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c3c3a368484e06db61",
               "name": "Harry Reif",
               "profile_path": null,
               "id": 30839,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56e1578ac3a3680a1a002577",
               "name": "Ross Hahn",
               "profile_path": null,
               "id": 1588447,
               "department": "Art",
               "job": "Construction Coordinator"
            },
            {
               "gender": 0,
               "credit_id": "56e1579cc3a3680a220024ce",
               "name": "Karl Brainard",
               "profile_path": null,
               "id": 1588452,
               "department": "Crew",
               "job": "Property Master"
            },
            {
               "gender": 2,
               "credit_id": "56e157b4c3a3680a1f00256d",
               "name": "Gene Corso",
               "profile_path": null,
               "id": 1070097,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e157d592514115720007fb",
               "name": "Pat Dinga",
               "profile_path": null,
               "id": 100988,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "56e157e9c3a3680a1a00258b",
               "name": "Eve Newman",
               "profile_path": null,
               "id": 51379,
               "department": "Sound",
               "job": "Music Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e15800c3a3680a1f00257a",
               "name": "Betty Pedretti",
               "profile_path": null,
               "id": 1466871,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "56e158109251410886002303",
               "name": "Ted Coodley",
               "profile_path": null,
               "id": 30843,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Horror",
            "id": 27
         }
      ],
      "popularity": 6.028151,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29056,
      "vote_count": 70,
      "budget": 350000,
      "overview": "A magician who has been turned into a raven turns to a former sorcerer for help in this film loosely based on the Edgar Allen Poe poem.",
      "similar": [
         9966,
         4627,
         39158,
         28592,
         322796,
         505590,
         8128,
         428442,
         69698,
         367309,
         285186
      ],
      "original_title": "The Raven",
      "runtime": 86,
      "poster_path": "/yx3A4mkcf0RnfqmVJoZpQXhgpoE.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Alta Vista Productions",
         "id": 4820,
         "origin_country": ""
      }],
      "release_date": "1963-01-25",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The Macabre Masterpiece of Terror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Roger Corman"],
      "runtime": 86,
      "synopsis": null,
      "writers": [
         "Richard Matheson",
         "Edgar Allan Poe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0057449/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ4MjAzMzQzN15BMl5BanBnXkFtZTcwNzkyMTU2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Price, Peter Lorre, Boris Karloff | See full cast and crew »"],
      "reviews": [
         "Clever dialogue, gothic scenery, and three old masters of horror make this film a delight to watch...over and over again. It is not very often one gets a chance to see three horror legends...Boris Karloff, Vincent Price, and Peter Lorre(plus a young Jack Nicholson)...in any movie, especially one with competent and stylized direction by a Roger Corman and a witty script by some guy named Richard Matheson( a legend in the horror and sci-fi genres and the one author that influenced Stephen King more than any other). The talent alone insures success and each of these respective masters delivers in this film. The story has virtually nothing to do with the Poe poem...but who cares with a cast like this. Peter Lorre steals every scene he is in and chews the scenery left and right. Hazel Court has a small role as the beautiful Lenore, and she turns in a good performance as well. But in the end it is the King of Horror and the Crown Prince of Horror...Karloff and Price...that make this movie a magical experience, particularly in their duel of magic at the climax of the film. Get some popcorn, a nice big drink, and turn the lights out and have fun with The Raven.",
         "Sorry, if you are expecting a movie based on Poe's poem. Other than Vincent Price elucidating one line from the poem and his wife being named Lenore, any other connections are coincidental. Yet, I'm sure you will find this movie entertaining and funny. An all star cast of Vincent Price,( the kind but powerful hero), Peter Lorre, (a sniveling, shifty, weasel), and Karloff at his diabolical best as the evil magician. It is sort of a D&D version of the Good, Bad & the Ugly. Great special effects for its time. A young ,soon to be Superstar Jack Nicholson playing Peter Lorre's noble son does not really add to the story, but it's fun to see him in his fledging days.",
         "The Corman-Matheson The Raven, a charming cultural artifact from the early sixties, played extremely well at kiddie matinees when first released, holds up less well for grownups when watching it on television. This is a movie that needs an audience, preferably young and not too sophisticated. Without the laughter of children it falls a little flat, but is still fun to look at, if only for the remarkable sets of Daniel Haller, the colorful costumes, the mugging actors. This is not an adaptation of the Edgar Allan Poe poem (which would be impossible) but rather a spoof of the various movies adapted from Poe's stories that were so popular at the time it came out, featuring many of the same cast members! As such, the movie needs to be seen in this context or else it will make no sense. Vincent Price, a good magician, helps Peter Lorre turn from raven back to human form, then journeys to the castle of bad magician Boris Karloff, who was responsible for changing Lorre into a bird, to engage in a battle of sorcerer's tricks. Jack Nicholson is on hand as Lorre's son, and the two have some funny scenes together. There's not much story here, but the look and feel of the film are what make it work, to the extent that it does, as it's really a showcase for the actors and set designers more than anything else. It's a lighthearted film from the start, with nary a frightening moment. Everyone's dressed up as if at a Halloween party, and the festive tone is sustained throughout.",
         "This is true magic. You will be shaking but not through horror. The Raven was made to amuse and it does. The magician's duel may lack 'modern effects' but for their day they were pretty impressive. And the warmth and humour shines out in all the characters. And yes, Peter Lorre dressed up as a Raven IS hilarious.",
         "This movie is loosely based around the famous Edgar Allen Poe poem of the same name. However, I don't think this is what the great literary genius had in mind when he originally wrote it; as Corman has turned the great Gothic poem into an absurd adventure styled comedy! Well, Edgar Allen Poe may be turning in his grave; but the rest of us get to have fun as we see horror gods Vincent Price, Boris Karloff and Peter Lorre, not to mention Jack Nicholson ham it up in style as the weird and wonderful cast of this absurd story of wizards and hocus pocus. Vincent Price is Dr. Erasmus Craven, and the film starts out with a reading of the famous Poe poem by the one and only Mr Price, and we're in familiar Corman-Poe territory. However, things take a turn in a totally different direction when, nearly napping, suddenly there comes a tapping, as someone gently rapping, rapping at Craven's chamber door. 'Tis a raven...or rather, Dr Bedlo (Peter Lorre), a fellow magician that has been turned into a raven by the rather nasty Dr Scarabus (Boris Karloff). After turning Bedlo back into a man, Craven is convinced by Bedlo, after hearing Scarabus has his beloved Lenore, to accompany him to his castle. And that is where the fun starts. Peter Lorre and Vincent Price make a delicious comedy pairing; their two unique personalities blend together brilliantly and it's great to see these two legends on screen together. As mentioned, these two are joined by fellow legend; Boris Karloff. Karloff is a vastly underrated actor that has played lots of important characters and turned his hand to many different aspects of horror; comedy being one that he does well at also. Like the rest of the cast, he delivers his one-liners with the utmost skill and has many fine comedy moments. Not all of the jokes in the film work, but some parts of the film are laugh-out loud funny. Seeing Jack Nicholson in a film like this is rather bizarre when you consider what he has gone on to achieve, but his presence serves in giving it even more cult appeal. Although if you'd heard someone say that he would go on to achieve these things after only seeing him here, you'd probably think whoever told you was having a laugh... Whether or not Corman should have turned 'The Raven' into a comedy is debatable. On one hand, I love the film, but I'm not sure if a serious version better would have been better. Still, the debate is irrelevant because he did and this is the result. The film is loyal to the poem in some ways (including the lovely wrap up), but basically; this is completely different. But pay the similarities and differences no mind, as 'enjoy!' is my advice.",
         "THE RAVEN Aspect ratio: 2.35:1 (Panavision) Sound format: Mono During the 15th century, an evil sorcerer (Boris Karloff) lures his arch rival (Vincent Price) to a lonely castle where they fight a magical duel to the death. Handsomely mounted on some of the most lavish sets ever created for AIP's Poe series, THE RAVEN toplines Price, Karloff and Peter Lorre for the first time in their careers, alongside a very young Jack Nicholson (making the most of a juvenile supporting role). Richard Matheson's clever script turns the faux seriousness of earlier Poe pictures on its head, countering Price's overwrought histrionics with a series of rude rejoinders from Lorre, who relishes his role as a cowardly magician whose divided loyalties place everyone around him in danger. Price and Karloff are worthy adversaries, and their climactic duel is one of the most celebrated set-pieces in horror movie history, despite some fairly obvious trick-work. Floyd Crosby's expansive cinematography and Daniel Haller's 'olde worlde' art direction conspire to render a suitably Gothic atmosphere, though the movie derives most of its strength from the quality of its dialogue and performances. Directed by Roger Corman.",
         "Several masters of horror and mystery gather here to have fun with Poe and the horror genre in general. The duel of the magicians is a hoot, and Peter Lorre in a bird suit is delightful. One of the best horror spoofs ever made.",
         "Raving About Roger Corman's The Raven (1963) Every October my daughter and I pick up a few spooky movies to get into the Halloween groove. This year, I had the pleasure of introducing her to one of my all time favorite horror comedy classics, Director Roger Corman's \"The Raven.\" The screenplay is adapted (VERY loosely) from the famous Edgar Allan Poe poem. This is one of Corman's many American International Picture adaptations of Edgar Allan Poe's works, and one of his best. As the king of \"b\" horror movies, Corman knew had to make the most out of a tight budget. His stylish films consistently used good source material, well written screenplays, lavish set designs, locations, props, costumes and great horror stars. \"The Raven\" boasts no less a cast than Vincent Price, Boris Karloff, Peter Lorre, Jack Nicholson, and 60's scream queen Helen Court \u0096 a mind boggling cast given that this is a low budget film. Pairing horror legends Price, Lorre, and Karloff was indeed a momentous occasion and the stars make the most of it. Any semblance to Poe's Gothic poem pretty much ends after Vincent Price reads the first few lines (brilliantly recited despite its brevity) at the intro of the movie. Afterwards, screenplay writer Richard Matheson takes the sombre mood of the original poem and turns it on its ear with his original comic screenplay. At the outset of the film, we learn that Price's character (Dr.Craven \u0096 a wizard) has lost his wife Lenore (Helen Court) and has long mourned her loss. He's interrupted in the midst of his grief by \"a tapping at his door.\" Price opens the door to find himself confronted by a raven (Peter Lorre). The raven, it turns out, can talk and is actually a rascally wizard named Dr Bedlo who has been enchanted by the evil wizard Dr Scarabus (Boris Karloff). He entreats the amazed doctor to help him become a man again. Richard Matheson's screenplay provides the actors with some wonderful comedy dialog with which to work. Price and Lorre had been previous teamed in Tales of Terror, and their styles blend beautifully together \u0096 they are a scream! They set about concocting a potion in set designer Daniel's Haller's creepily atmospheric dungeon. After much fumbling, Price finally manages to restore Lorre's human head, but his body remains that of a giant human sized raven. Seeing Lorre strut his stuff in the Big Bird raven costume is almost worth the DVD price by itself! Once restored, Lorre swears revenge on Dr Scarabus. He asks for Price's help. But the doctor refuses until Lorre's character spots a portrait of Price's long lost wife and remarks that he's seen the woman at Scarabus' castle. The two set off for the castle along with Price's daughter (Olive Sturgess) and Bedlo's son (played by a young delightfully hammy Jack Nicholson). When Lorre and Price reach the castle, the fireworks begin \u0096 figuratively and literally. It's clear these three horror icons are having the time of their lives, hilariously spoofing their monster screen personas. Dated special effects (though fine for their day) detract little from the final magical showdown between Karloff and Price. I never get sick of seeing this movie and happily give it a rave review! Grab the popcorn and enjoy. Rob Rheubottom Winnipeg, MB Canada",
         "Roger Corman's \"The Raven\" is the best of the Poe films and the most entertaining. It owes even less to Poe than some of the other adaptations, but I can't recall laughing so much in a horror film. That it was intended as a followup to the wildly successful \"Tales of Terror\" only added to the good vibes. The historic teaming of three horror stars Vincent Price, Boris Karloff and Peter Lorre makes this irresistible. Price plays one of his rare good guy roles as Craven, a good warlock living in his castle in England (where else?). Lorre is Bedlo, a coward who was turned into a raven by the evil sorcerer Scarabus (Karloff). Craven changes him back and Bedlo tells the good warlock/magician that his thought to be dead wife is shacking up with Scarabus. This sets up the final 20 minutes of the film, a hilarious showdown between Craven and Scarabus involving lasers and cheesy red arrows that only make the viewer laugh even more than he/she was doing before. The great castle designed by Daniel Haller was reused famously in \"The Terror\" shot two days after this wrapped by Corman. Unless you're a film buff, you probably won't notice, but it adds a comic touch to an already hilarious film. The best comic moments belong to Lorre and Jack Nicholson (as Lorre's son). These two are nuts! Floyd Crosby's photography (in Panavision and Pathecolor) is solid as usual (although the castle isn't; he,he) and Richard Matheson's script (with bits added by Price, Karloff, Lorre and Nicholson) is one of the best comedy scripts ever written. Why wasn't \"The Raven\" on the AFI Top 100 Comedies List? It's as good as anything in the Top 10 (better than the second ranked Tootsie, that's for sure). The probable answer: they don't know great comedy even if it bit them in the butt. **** out of 4 stars",
         "The magician Dr. Erasmus Craven (Vincent Price), who does not belong to the brotherhood of magicians, grieves the loss of his beloved wife Lenore (Hazel Court) and lives in a castle with his daughter Estelle (Olive Sturgess). One day, a raven knocks on his window and Dr. Craven learns that the bird is actually the magician Dr. Adolphus Bedlo (Peter Lorre) that was turned into a raven after challenging the powerful magician Dr. Scarabus (Boris Karloff) that was an enemy of his father. Dr. Craven makes a potion to turn Dr. Bedlo back to the human form and Dr. Bedlo tells that he has seen Lenore in the castle of Dr. Scarabus. Dr. Craven decides to go in his coach with Dr. Bedlo to visit Dr. Scarabus but Estella and Dr. Bedlo's son Rexford (Jack Nicholson) decide to go with them. They find an amicable Dr. Scarabus that invite them to stay for the night. Was Dr. Craven's father wrong about Dr. Scarabus? \"The Raven\" is a delightful movie about ambition, treachery and magic, with a wonderful duel of magicians and lots of humor. The raven is hilarious and it is impressive his training with participation in many scenes. The special effects are simple but impressive for a 1963 movie. The cast is excellent with Vincent Price, Peter Lorre and Boris Karloff and it is curious to see Jack Nicholson in the beginning of his career. My vote is seven. Title (Brazil): \"O Corvo\" (\"the Raven\")"
      ],
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "productionCompanies": ["Alta Vista Productions"],
      "summaries": [
         "In this tongue-in-cheek movie inspired by Poe's poem, Dr. Craven is the son of a great sorcerer (now dead) who was once himself quite skilled at that profession, but has since abandoned it. One evening, a cowardly fool of a magician named Bedlo comes to Craven for help - the evil Scarabus has turned him into a raven and he needs someone to change him back. He also tells the reluctant wizard that Craven's long-lost wife Lenore, whom he loved greatly and thought dead, is living with the despised Scarabus.",
         "The magician Dr. Erasmus Craven, who does not belong to the brotherhood of magicians, grieves the loss of his beloved wife Lenore and lives in a castle with his daughter Estelle. One day, a raven knocks on his window and Dr. Craven learns that the bird is actually the magician Dr. Adolphus Bedlo that was turned into a raven after challenging the powerful magician Dr. Scarabus that was an enemy of his father. Dr. Craven makes a potion to turn Dr. Bedlo back to the human form and Dr. Bedlo tells that he has seen Lenore in the castle of Dr. Scarabus. Dr. Craven decides to go in his coach with Dr. Bedlo to visit Dr. Scarabus but Estella and Dr. Bedlo's son Rexford decide to go with them. They find an amicable Dr. Scarabus that invite them to stay for the night. Was Dr. Craven's father wrong about Dr. Scarabus?",
         "A magician who has been turned into a raven turns to a former sorcerer for help in this film loosely based on the Edgar Allan Poe poem."
      ],
      "budget": 200000
   },
   "movielensId": 2780,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1963-01-25",
      "dvdReleaseDate": "2003-08-26",
      "directors": ["Roger Corman"],
      "runtime": 86,
      "movieId": 2780,
      "title": "The Raven",
      "mpaa": "G",
      "actors": [
         "Vincent Price",
         "Peter Lorre",
         "Boris Karloff",
         "Hazel Court",
         "Olive Sturgess",
         "Jack Nicholson",
         "John Dierkes"
      ],
      "imdbMovieId": "0057449",
      "originalTitle": "The Raven",
      "genres": [
         "Comedy",
         "Fantasy",
         "Horror"
      ],
      "youtubeTrailerIds": [
         "Uy3ktfRztss",
         "aK2qh3_x-hs"
      ],
      "plotSummary": "A magician who has been turned into a raven turns to a former sorcerer for help in this film loosely based on the Edgar Allen Poe poem.",
      "tmdbMovieId": 29056,
      "avgRating": 3.22571,
      "releaseYear": "1963",
      "numRatings": 494,
      "posterPath": "/yx3A4mkcf0RnfqmVJoZpQXhgpoE.jpg"
   }
}