{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "autopsy",
            "id": 4715
         },
         {
            "name": "black and white",
            "id": 12999
         },
         {
            "name": "pathologist",
            "id": 162716
         }
      ],
      "imdb_id": "tt0053363",
      "video": false,
      "title": "The Tingler",
      "recommendations": [
         25319,
         28261,
         53949,
         29570,
         29030,
         29394,
         43312,
         28423,
         85237,
         83519,
         55152,
         116327,
         3104,
         30137,
         56702,
         28501,
         15096,
         86191,
         40761,
         41020
      ],
      "backdrop_path": "/ojTM25XF09jLRLrHlE0ZVNN2y0b.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Warren Chapin",
               "gender": 2,
               "credit_id": "52fe451dc3a368484e049503",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mrs. Martha Ryerson Higgins",
               "gender": 1,
               "credit_id": "52fe451dc3a368484e049507",
               "name": "Judith Evelyn",
               "profile_path": "/fMTA0RXp12rRFFP0nz2cc9MNwOT.jpg",
               "id": 7686,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "David Morris",
               "gender": 0,
               "credit_id": "52fe451dc3a368484e04950b",
               "name": "Darryl Hickman",
               "profile_path": "/bRMxUW00nvYWJZf2X0k09i2tjyz.jpg",
               "id": 81481,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Isabel Stevens Chapin",
               "gender": 1,
               "credit_id": "52fe451dc3a368484e04950f",
               "name": "Patricia Cutts",
               "profile_path": "/oo5q1r1XFsxDtb3WNnllEimMzYI.jpg",
               "id": 96458,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Oliver 'Ollie' Higgins",
               "gender": 2,
               "credit_id": "52fe451dc3a368484e049513",
               "name": "Philip Coolidge",
               "profile_path": "/kAOAZbjY2xi4PGv7o2Ggfbl3bq.jpg",
               "id": 2649,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Lucy Stevens",
               "gender": 1,
               "credit_id": "58163cb09251415a7f00f589",
               "name": "Pamela Lincoln",
               "profile_path": "/8M06MRDWGUPdkrbUy1sFW3PYJna.jpg",
               "id": 1701693,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Prologue Himself - Host (uncredited)",
               "gender": 2,
               "credit_id": "58163cc89251415cd100f81e",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe451dc3a368484e049519",
               "name": "Robb White",
               "profile_path": null,
               "id": 57522,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe451dc3a368484e04951f",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe451dc3a368484e049525",
               "name": "William Castle",
               "profile_path": "/6vUhJ5Nb5YlX4WsztDkSCePM61I.jpg",
               "id": 12011,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 3.428215,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 26857,
      "vote_count": 44,
      "budget": 250000,
      "overview": "After much hard work, a pathologist discovers and captures a creature that lives in every vertebrate and grows when fear grips its host. \"Scream for your lives!\"",
      "similar": [
         397243,
         2292,
         227156,
         705,
         62214,
         828,
         9833,
         121986,
         50204,
         2657,
         363,
         63849,
         91739,
         9033,
         352208,
         5544,
         140420,
         922,
         12237,
         9442
      ],
      "original_title": "The Tingler",
      "runtime": 82,
      "poster_path": "/AmzbPAUuCIFgnOCDUP7x7LBmsHn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1959-07-29",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Ghastly Beyond Belief!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["William Castle"],
      "runtime": 82,
      "synopsis": "The movie opens on a white screen. Then William Castle enters and informs us, \"I am William Castle, the director of the motion picture you're about to see. I feel obligated to warn you that some of the sensations, some of the physical reactions which the actors on the screen will feel will also be experienced for the first time in motion picture history by certain members of this audience...And remember this: A scream at the right time may save your life.\" The screen goes dark and a man's screams are heard. His head (an uncredited Pat Colby) floats towards the audience. Two women's heads (left is an uncredited Gail Bonney, right is an uncredited Amy Fields), screaming, join the man. We fade in on a convict being led to the execution chamber. He is Ryerson (an uncredited Bob Gunderson) and two guards drag him to his fate--the electric chair. Standing in the hall is his brother-in-law, Ollie Higgins (Phillip Coolidge). Title and credits are shown over the march to the chamber. In a nearby lab, Dr. Warren Chapin (Vincent Price) prepares for the state required autopsy of the convicted and executed man. The body is wheeled from the execution chamber to the lab on a gurney. Chapin does his work and Ollie comes in to watch. They chat about the electrocution and Chapin notes, \"This man's vertebrae are cracked. They're nearly splintered in two.\" He explains he's seen this before, always related to fear and this is the focus of his research. Ollie postulates it might be what causes your spine to tingle. Chapin is amused and dubs the force, \"The Tingler,\" something he has been researching for years with no name. Chapin asks rhetorically, \"Fear causes tremendous tensions in the body. If you can't relieve them, why can't they become strong enough to kill you?\" Chapin completes the death certificate and prepares to leave. Ollie asks for a ride back into town and the doctor agrees. Chapin stops his car in front of a walk-in theater. It specializes in old, silent movies. Ollie offers the doctor a cup of coffee. He first checks in with his wife, Martha (Judith Evelyn) who is working in the box office. She is a deaf-mute and reminds her husband about working the opening of the theater. Ollie and Chapin enter the rooms above the theater. Martha enters the apartment and places cash in a large safe by the front door. She enters the kitchen and washes her hands. She stares at Chapin and refuses to shake his hand, miming that they are loaded with germs. Besides being deaf-mute, Martha has a serious OCD condition and a serious phobia about something else Chapin discovers after he accidently breaks a saucer. He reaches into the sink to retrieve the broken pieces of a saucer and cuts his hand. The sight of the blood sends Martha into a rigid, dead faint. Chapin treats her and explains to Ollie that her inability to scream allows the tension to build. She does not actually faint, but experiences something he calls a psychosomatic escape. Chapin brings the woman around with smelling salts. Martha immediately checks the safe to verify the money is still there. Satisfied her money is safe, she refuses to go downstairs to open the box office until Ollie and the doctor have left. Doctor Chapin leaves and drives home. Chapin arrives home, a large expensive house in an upscale neighborhood. His wife has money and an independent nature. Feeling neglected at home she indulges her desire for male company openly. Lucy Stevens (Pamela Lincoln) walks down the stairs. She is dressed for her date. She is Chapin's sister-in-law. Her boyfriend, David, works for Dr. Chapin. They are both pathologists. She tells Chapin her sister is out on a date. Chapin takes a certain amount of responsibility for the situation. They discuss Lucy's financial situation, her sister controls the inheritance and refuses to share it with her little sister. The doorbell rings and Lucy answers it. It is David Morris (Darryl Hickman) and he apologizes for being late. David was late because he was out trying to catch a stray cat for their experiment. David also gives Chapin the drug he requested. [Note: LSD was still legal back in the 1950s and was being used by Psychiatrists for research.] David warns Dr. Chapin that, \"It can produce pretty weird effects.\" Chapin relays the story about Martha and her blood phobia and her fear reaction. Chapin tells David he is now convinced what he is looking for is tangible and solid. He now calls it, The Tingler. David and Lucy go out on their date. Dr. Chapin sits and reads a preliminary report titled, \"Fright Effects Induced by Injection of Lysergic Acid LSD25.\" It is late, 1:00 a.m., and Chapin sees his wife out the window. She is kissing her date good night. Chapin decides to kill two birds with one stone. He retrieves a gun from the hutch drawer, it is loaded with blanks but she doesn't know that. He confronts Isabel (Patricia Cutts) in the entry way. They exchange catty dialog and decide to have a drink. Chapin mentions Lucy and David and threatens that unless she gives Lucy her inheritance, she will be dead. He pulls a gun and escorts her into the lab. He tells her that her \"suicide\" can be better arranged there. Isabel refuses to give Lucy her money, so Chapin \"shoots\" her. She collapses in fear. He places her body on the X-Ray table and takes three pictures of her spine in rapid succession. He wakes his wife and tells her, \"You're not hurt, dear. It was just a blank cartridge. Thanks for helping with the experiment. You played your part excellently.\" She is furious. A cat in the cage calls out. He gleefully tells Isabel, \"I was going to use this cat. But you made a much better subject. Have you two met? In the same alley, perhaps?\" Isabel threatens, \"When my turn comes, and it will come, it won't be an experiment.\" The next day, David pulls up in his old car. He brought the dog Chapin requested. Chapin is excited to show Dave the X-Rays he took of Isabel. It shows The Tingler in stages of growth and deployment along the spine. Chapin and Dave discuss what they know and what they need to find out. They speculate that The Tingler may be a solid mass, and a living organism. That evening, Lucy, Dave, and Dr. Chapin have coffee in the living room. Chapin wants to scare himself to do more research, \"to personally sense the power of The Tingler, in a genuine fear situation. In a controlled experiment, with my own fear perhaps I can find out all the things we have to know. Only nothing scares me.\" Chapin suggests, then demands that Dave take the night off. Dave suspects Chapin may try something stupid and dangerous. His fears are realized. Dave and Lucy observe, from outside the lab, Chapin take the LSD and have a bad trip. Chapin carefully tape records all his observations and symptoms. He is able to experience fear, but despite his desire to stifle a scream, he does scream and the thing that makes his spine rigid disappears. Lucy, David, and Chapin discuss the experiment, and Dave notes that a deaf-mute is unable to scream. At the movie theater, Dr. Chapin stops to see Ollie. He came to see how Martha was doing. Ollie says it must have been very traumatic because she is off her routine. Chapin walks up to see Martha. He gives her a sedative and puts her to bed. He sends Ollie to the drug store to fill a prescription for Martha. Sometime later, Martha wakes. Strange things happen: lights go off on their own, windows close, a rocking chair moves with no one sitting in it, and doors open and close on their own. A creature with a scarred face and oversized teeth menace her with a knife. She eventually is locked in the bathroom and sees blood flowing from the hot and cold water faucets in the sink. [Note: The movie is black and white, but the sink and tub sequences are in color, to emphasize the blood.] The tub is full of blood and an arm rises out of the thick liquid towards the frightened woman. She goes rigid and clutches her spine with one hand. The bathroom medicine cabinet opens and there she sees her own death certificate. She collapses to the floor, dead. Dr. Chapin arrives home to the phone ringing. There is no one on the line by the time he answers it. He finds two drinking glasses on the coffee table and concludes his wife has been entertaining. A gold tie clip confirms his suspicions. The doorbell rings, and Dr. Chapin answers it. It is Ollie and he has brought his wife's body over to the Chapin home. They carry Martha in and place her on the exam table in the lab. Chapin confirms she is dead, and has been for at least an hour. Chapin records the time and circumstances to complete the death certificate. Martha's body rises up on the table, still covered in the sheet. She settles back down, and Ollie is convinced she is still alive. Chapin assures him she is quite dead, but wants to find out why she moved. He removes a Tingler from around her spinal bones. It is about 16 inches long and resembles a black lobster or huge earwig with pincers on the front and back. Chapin calls for a glass tank, but before he can secure the creature it pinches his arm. His screams causes the creature to release the grip on his arm and fall limp on the table. Isabel enters the lab. She is repulsed by the creature. Ollie asks how strong it is, and Chapin replies, \"Strong enough to kill a man, easily and quickly.\" Chapin puts The Tingler in a wire mesh carrying case. Isabel grabs a small vial from the lab and before leaving looks at The Tingler with a certain fascination. She pours the contents of the vial into a glass on the bar. Ollie agrees to take Martha home and notify both a funeral parlor and the police. Isabel suggests a celebration for the discovery, something her husband has been seeking for years. She pours two drinks and offers Chapin one, but he demands the other instead. She agrees, knowing her husband does not trust her, but he gets the spiked one anyway. She asks about The Tingler. He explains that it is very powerful. Ollie calls and tells Chapin that Martha is now at a funeral parlor and he has called the police. Chapin passes out from the drink before Ollie can complete his conversation. Ollie gathers up the paraphernalia he used to scare his wife to death: the mask, knife, and other items. As Chapin sleeps it off, Isabel brings in The Tingler in its carrying case. She lets it loose to do its murderous thing. It crawls over to Chapin and proceeds to strangle him with its fore-pincers. Fortunately, Lucy arrives home, hears his struggles, and screams disabling The Tingler's grip on the doctor's throat. It falls to the rug in front of the couch. The next day in the lab, Chapin tries to destroy The Tingler. He holds a blow torch and tells David, \"Nothing affects it. You can't destroy the thing.\" Dave is excited at the medical discovery, but Chapin explains that he is not going to share the discovery with anyone, not at a convention or with a journal article. Chapin explains his reasons, \"The Tingler exists in every human being we now know. Look at that. It's an ugly and dangerous thing. Ugly because it's the creation of man's fear. Dangerous because a frightened man is dangerous. We can't destroy it, because we've removed it from its natural place.\" Chapin decides it has to be put back inside Martha's body and hopes it will be re-absorbed. Lucy comes into the lab and reports that Isabel has left, taken her clothes and moved out. Dave reports that the police got no report of her death. Chapin grabs his bag and the Tingler in its cage and departs for Ollie's place. Ollie is home packing. He empties the safe of cash. Chapin arrives and confronts the man. He finds the objects Ollie used to frighten his wife to death. While preparing Martha's body, The Tingler escapes from its cage and gains entry to the theater below via a loose floor board. Chapin and Ollie start their search for it. As the audience watches an old movie, The Tingler searches out prey. One woman (an uncredited Amy Fields) screams when it latches on to her leg. Chapin douses the lights and tells the audience there is no cause for alarm. The projectionist (an uncredited Dal McKennon) prepares for a reel change. The Tingler crawls through the opening in the wall. The Tingler causes the film to flutter and break. Its' crawling silhouette shows on the theater screen and Chapin and Ollie see it. The audience in the theater murmurs. Chapin again tells the audience not to panic, and implores them, \"Scream! Scream for your lives! The Tingler is loose in this theater! And if you don't scream, it may kill you! Scream! Scream! Keep screaming! Scream for your life!\" Chapin and Ollie run to the projection booth. The projectionist is being choked by The Tingler. His scream causes the thing to release its grip on his throat. Chapin loads it into a film canister and carries it back upstairs to where Martha's body is located. Ollie admits that Chapin gave him the idea to kill his wife. Chapin places it back into Martha. Chapin informs Ollie, \"This time you're going to the police with me.\" Ollie pulls a gun and corrects the good doctor, \"You're wrong. You're going by yourself.\" Chapin calls the man's bluff, and walks out. Ollie walks towards the door, but it slams shut on its own. The window shuts and Martha's sheet covered body rises up. She stands and stares at her husband. He silently screams in fear. The screen goes black. We close with final words of wisdom from Dr. Warren Chapin, \"Ladies and gentlemen, just a word of warning. If any of you are not convinced that you have a Tingler of your own, the next time you're frightened in the dark, don't scream.\"",
      "writers": ["Robb White"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0053363/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4MDgxNzE4Ml5BMl5BanBnXkFtZTcwODU5MTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Price, Judith Evelyn, Darryl Hickman | See full cast and crew »"],
      "reviews": [
         "\"The Tingler\" is the name that Vincent Price's likable scientist character gives to the creature that apparently is responsible for the sense of spine-tingling fear we all experience at some point in our lives. If we scream, The Tingler is rendered harmless. If we do not, The Tingler will get us! This is classic William Castle gimmick stuff. When this black and white masterpiece of schlock was originally shown in theaters, devices would be rigged up underneath theater seats which would \"tingle\" during a certain scene. The film would then seemingly stop, and the audience would be encouraged to scream! Scream for their LIVES! Of course, the audience was happy to oblige and the Tingler would be defeated. Man, how I regret having missed those days of cheesy ballyhoo. This film has some really nifty stuff in it. Highlights include Vincent Price's \"acid\" trip (reportedly the first acid trip ever seen on the silver screen), and a cool hallucinatory color sequence with a deaf mute woman menaced by a bathtub full of blood, among other things. The plot is clever and actually pretty well thought out for a B flick, and Vincent is superb, as he always is. This is an absolutely hysterical film that should not be missed. I can't say enough good things about it - it simply has to be seen to be appreciated. It's campy, seedy, bloody good fun!",
         "William Castle's 'The Tingler' is one of the most extraordinary horror movies ever made. Low budget, silly script, bad dialogue, uneven acting, gimmicky to the extreme (with or without \"percepto\"), but it STILL manages to amaze. It's a kind of trojan horse, being a cheesy b-grade thriller with a hidden core of surrealism almost worthy of Bunuel or Cocteau. Memorable performances from horror legend Vincent Price as the scientist obsessed with explaining the strange phenomenon he labels \"the tingler\", and Judith Evelyn (who had a bit part in Hitchcock's 'Rear Window') as a bizarre deaf mute who owns a silent movie theatre, elevate this above most of Castle's overrated output. The classic acid trip scene (I think the first ever), the memorable short colour sequence, and the William Burroughs-like monster make this something really special. Not to be missed!",
         "The Tingler marks the second teaming for horror's greatest actor - Vincent Price, and horror's greatest showman - William Castle. This film was released later in the same year that their first venture - House on Haunted Hill - was unleashed upon audiences across the world, and the film sees the two men deliver more of what they did with their first feature. House on Haunted Hill was much loved then - and now - for it's ludicrous plot line and hammy performances, and The Tingler marks another successful fusion of these elements. The plot line is even sillier this time round, and it follows Vincent Price's scientist as he conducts his experiments into fear. He discovers that when we get frightened, a thing, which he called 'the tingler', manifests itself on the spinal column and the only way to rid oneself of this 'tingler' is to scream. Deaf mute's cant scream, however, and soon after discovering that his friend's wife suffers from that condition, and has an acute fear of blood, Price gets to work on attempting to isolate and remove the tingler. William Castle shows his flair and passion for entertaining his audience throughout this film, with the whole film being, basically, a metaphor for the horror genre on the whole. Castle uses several different methods of getting his audience to scream, and while this film isn't very scary by today's standards - watching this master of entertainment weave his magic is always delightful. Another thing that's delightful about this film is the fact that Vincent Price is in it. Price has an amazing ability to command to the screen, and while this movie doesn't feature his best performance - he's always entertaining, and it's always a pleasure to see him on screen. Castle's special effects are hokey, with the central monster - the tingler - looking rather silly, but that adds to the fun effect of the movie and if the effects had been terrific examples of how good special effects can be - the film wouldn't have been nearly as fun as it is. The Tingler is silly throughout, and it gets really ridiculous towards the end, but if you watch knowing that this isn't to be taken seriously, you'll enjoy yourself just like Castle intended.",
         "Directed and hyped by William Castle. Proof he is a master. Vincent Price is a pathologist that discovers that, when in a state of extreme fear, an organism grows along a person's spine enlarging up to the neck. The only thing that will stop the growth is the sound of screaming. Along with Price are Darryl Hickman and Pamela Lincoln. This is a real gimmicky film, but still effective. Well acted by Price, one of his very best. Still creepy after all these years.",
         "\"Ollie\" was my favorite person in this movie. What a strange dude! He was full of surprises, including reactions to things, comments he makes and, of course, deeds he commits. Yeah, Vincent Price proves again what a fine actor we was, and is the star of the film, but I really enjoyed Philip Coolidge's (Ollie) performance. As for Price, watching this other day made me scratch my head and wonder how such a good actor could play in so many cheesy films? Whatever, those two along with Patricia Cutts (the tramp wife), Judith Evelyn (Ollie's deaf-mute wife), Darryl Hickman and Pamela Lincoln all did a pretty nice job, although Price's acting talents stand out among the cast. It also would have fun to see this in the theater 50 years ago when they rigged the seats to tingle during certain scenes! That really happened! Director William Castle really tried everything to get the audience. He even stopped the film and asked the audience to scream! It must have been hilarious. You have to give it to the man for his effort to promote his \"horror\" films. The movie begins slowly so one has to have patience with this story. Once it kicks in though, it's very good with some shocking scenes (including a color scene or two) and some interesting twists. However, to be fair, there are a lot of holes in this story and really, really corny things......but that's part of the fun. It's like Ed Wood films - so bad, you have to laugh. The DVD looks good. This is a nice transfer, which is important with all the lights and shadows. You can see some alternate scenes, too, which are interesting.",
         "William Castle was a great filmmaker. Many people would disagree because no one Castle film stands out as being great. Yet Castle was a great innovator that made going to the movies more than just a way to spend time to an experience. His gimmicks, although not usable today, are not what his movies are about. His films are about stories, pretty good ones at that. The Tingler is no exception. It is a tale of horror and science. It concerns itself with a doctor trying to prove that each of us has a tingler within us that gets bigger when we are in a state of fear and is repelled by our screaming. Although the scientific merit of this story seems somewhat implausible, Castle makes it seem very credible through his story-telling techniques. Some scenes in the movie are just wonderful. Vincent Price is excellent as the doctor questing for answers and then faced with a moral dilemma as to what should be done with his newly found knowledge. If you like science fiction, Vincent Price, or just a good old-fashioned horror yarn....The Tingler is for you!",
         "The coroner and scientist Dr. Warren Chapin (Vincent Price) is researching the shivering effect of fear with his assistant David Morris (Darryl Hickman). Dr. Warren is introduced to Ollie Higgins (Philip Coolidge), the relative of a criminal sentenced to the electric chair, while making the autopsy of the corpse, and he makes a comment about the tingler-effect to him. Ollie asks for a lift to Dr. Warner, and introduces his deaf-mute wife Martha Higgins (Judith Evelyn), who manages a theater of their own. Dr. Warner returns home, where he lives with his unfaithful and evil wife Isabel Stevens Chapin (Patricia Cutts) and her sweet sister Lucy Stevens (Pamela Lincoln). Dr. Warner, upset with the situation with his wife, threatens and uses her as a subject of his experiment. When Martha dies of fear, Dr. Warner makes her autopsy and finds a creature that lives inside every human being, feeds with fear and is controlled by the scream. Once Martha was not able to scream, the tingler was not rendered harmless and became enormous. When the living being escapes, Dr. Warner and Ollie chase it in a crowded movie theater. \"The Tingler\" is very hilarious and cheesy B-movie, but with a great potential of cult-movie. I can imagine the behavior of the real audiences with the instructions of the character of Vincent Price ordering in the dark to scream in the movie theaters to save their lives, while he is looking for the tingler on the screen, and a device installed underneath their seats is vibrating in the scene. The flawed screenplay is silly but also very, very funny indeed. There are two great moments along the story: the ahead-of-time acid trip of Dr. Warren Chapin (in 1959); and the red colored bathtub full of blood, the unique colored scene along the whole black and white film. My vote is seven. Title (Brazil): \"Força Diabólica\" (\"Evil Force\")",
         "I was very young when this movie was originally released and my first encounter was when I switched on the TV (no remotes in those days, so I was right in front of the set) and a woman's face suddenly appeared, screaming right at me! It scared the living hell out of me --- and that was only a *commercial* for THE TINGLER! It was years before I saw the actual film and while it wasn't as scary as I imagined (nothing could have been) it had, as William Castle's films frequently do, an unsettling feeling of dread about it. Of course it's also absolutely ridiculous. The whole premise is insane, and the plot twists keep getting more and more loony, but that only adds to the fun! The titular creature itself is a mixed bag, crudely done (even for its day) but somehow effectively disgusting. The acting is uniformly good and the dialogue pretty intelligent. The only weak point for me was Judith Evelyn as the deaf mute wife, who overacted like hell but never seemed genuinely terrified by any of the bizarre goings on. The DVD contains an excellent short called SCREAM FOR YOUR LIVES including (among others) co-star Darryl Hickman, now in his seventies, looking incredibly fit and happy and seemingly unable to talk about making THE TINGLER without constantly cracking up. Who can blame him????",
         "\"The Tingler\" (1959 - 82 minutes - B&W), is a classic of horror and science fiction produced and directed by the remarkable master William Castle, who was known for setting tricks in the cinema rooms in fifties and sixties in order to interact the audience with the film. (In \"The Tigler\", Castle placed an equipment, the \"Percepto\", inside the cinema armchairs so that, when the audience shouts during the movie, they felt a shock). In this masterpiece, Vincent Price is Dr. Warren Chapin, an obstinate doctor of legal medicine who discovers that fear causes the \"tingler effect\" with the growth of a parasitic creature near the vertebral column. Chapin could isolate and remove the creature of a deaf and dumb woman (the actress Judith Evelyn) but the \"thing\" escapes and runs away to a full cinema. A way to defeat the creature is to shout loud. According to John Waters, of the \"Film Comment\", the film shows the first citation of LSD of the cinema. The writer Robb White had heard about the lisergic acid from Aldous Huxley, he went to the UCLA to try the drug in himself (before it became illegal) and then he introduced the drug in the story.",
         "...because the person in the seat next to you will probably be screaming too! You've got to love this campy cult classic from William Castle. Vincent Price is great as always, but the supporting characters are really good also, which can sometimes be hard to find in this kind of movie. The opening 'screaming' sequence can be a little annoying, but it's all in keeping with the fun you have watching this classic. Be ready to laugh! 8 out of 10"
      ],
      "genres": ["Horror"],
      "productionCompanies": [
         "Columbia Pictures",
         "William Castle Productions"
      ],
      "summaries": [
         "Dr. Warren Chapin is a pathologist who regularly conducts autopsies on executed prisoners at the State prison. He has a theory that fear is the result of a creature that inhabits all of us. His theory is that the creature is suppressed by our ability to scream when fear strikes us. He gets a chance to test his theories when he meets Ollie and Martha Higgins, who own and operate a second-run movie theater. Martha is deaf and mute and if she is unable to scream, extreme fear should make the creature, which Chapin has called the Tingler, come to life and grow. Using LSD to induce nightmares, he begins his experiment.",
         "After much hard work, a pathologist discovers and captures a creature that lives in every vertebrate and grows when fear grips its host. \"Scream for your lives!\"",
         "The coroner and scientist Dr. Warren Chapin is researching the shivering effect of fear with his assistant David Morris. Dr. Warren is introduced to Ollie Higgins, the relative of a criminal sentenced to the electric chair, while making the autopsy of the corpse, and he makes a comment about the tingler-effect to him. Ollie asks for a lift to Dr. Warner, and introduces his deaf-mute wife Martha Higgins, who manages a theater of their own. Dr. Warner returns home, where he lives with his unfaithful and evil wife Isabel Stevens Chapin and her sweet sister Lucy Stevens. Dr. Warner, upset with the situation with his wife, threatens and uses her as a subject of his experiment. When Martha dies of fear, Dr. Warner makes her autopsy and finds a creature that lives inside every human being, feeds with fear and is controlled by the scream. Once Martha was not able to scream, the tingler was not rendered harmless and became enormous. When the living being escapes, Dr. Warner and Ollie chase it in a crowded movie theater."
      ],
      "budget": 250000
   },
   "movielensId": 2781,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1959-07-29",
      "dvdReleaseDate": "1999-09-07",
      "directors": ["William Castle"],
      "runtime": 82,
      "movieId": 2781,
      "title": "The Tingler",
      "mpaa": "",
      "actors": [
         "Vincent Price",
         "Judith Evelyn",
         "Darryl Hickman",
         "Patricia Cutts",
         "Philip Coolidge",
         "Pamela Lincoln",
         "William Castle"
      ],
      "imdbMovieId": "0053363",
      "originalTitle": "The Tingler",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "PWVeuVyShnE",
         "TDxqx4hOpF4"
      ],
      "plotSummary": "After much hard work, a pathologist discovers and captures a creature that lives in every vertebrate and grows when fear grips its host. \"Scream for your lives!\"",
      "tmdbMovieId": 26857,
      "avgRating": 3.15903,
      "releaseYear": "1959",
      "numRatings": 393,
      "posterPath": "/AmzbPAUuCIFgnOCDUP7x7LBmsHn.jpg"
   }
}