{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "edgar allan poe",
            "id": 155317
         },
         {
            "name": "black cat",
            "id": 155488
         },
         {
            "name": "tomb",
            "id": 156081
         }
      ],
      "imdb_id": "tt0059821",
      "video": false,
      "title": "The Tomb of Ligeia",
      "recommendations": [
         30137,
         29074,
         28501,
         27636,
         23439,
         26857,
         25319,
         3104,
         28498,
         28261,
         29235,
         28715,
         32569,
         24111,
         40955,
         26680,
         3031,
         38996,
         29056,
         3574
      ],
      "backdrop_path": "/wBM5IkKQoVDSSI3WrRfAJqQvmkW.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Verden Fell",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5cf",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Lady Rowena Trevanion / Lady Ligeia",
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d5d3",
               "name": "Elizabeth Shepherd",
               "profile_path": "/h8pIttTBWJut7uV1hlC5BUwWVf6.jpg",
               "id": 66610,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Christopher Gough",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5d7",
               "name": "John Westbrook",
               "profile_path": null,
               "id": 101512,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Lord Trevanion",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5db",
               "name": "Derek Francis",
               "profile_path": null,
               "id": 101529,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Kenrick",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5df",
               "name": "Oliver Johnston",
               "profile_path": null,
               "id": 29308,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Dr. Vivian",
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5e3",
               "name": "Richard Vernon",
               "profile_path": "/bl4auPonPHOCZcxdPbePbpeK5hS.jpg",
               "id": 47000,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5ad",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d5b3",
               "name": "Edgar Allan Poe",
               "profile_path": "/akmuLsbMrtcVrmiiaYqDK3QNdwC.jpg",
               "id": 48415,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5b9",
               "name": "Robert Towne",
               "profile_path": "/hF5R8kmpreIZsv47mIYzDN5XX2Q.jpg",
               "id": 11057,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c2c3a368484e06d5bf",
               "name": "Arthur Grant",
               "profile_path": null,
               "id": 30138,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d5c5",
               "name": "Kenneth V. Jones",
               "profile_path": null,
               "id": 31291,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c2c3a368484e06d5cb",
               "name": "Pat Green",
               "profile_path": null,
               "id": 102609,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56e297f392514143cc000684",
               "name": "Alfred Cox",
               "profile_path": null,
               "id": 30702,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e29807c3a368700b0022e6",
               "name": "Colin Southcott",
               "profile_path": null,
               "id": 1588528,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56e2981bc3a3686ff20023cf",
               "name": "Moray Grant",
               "profile_path": null,
               "id": 30761,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "56e29838c3a3686ffd002056",
               "name": "John Aldred",
               "profile_path": null,
               "id": 1556556,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "56e2985d9251410261002129",
               "name": "Bert Ross",
               "profile_path": null,
               "id": 108814,
               "department": "Crew",
               "job": "Sound Recordist"
            },
            {
               "gender": 0,
               "credit_id": "56e29871925141026100212d",
               "name": "Don Ranasinghe",
               "profile_path": null,
               "id": 1588861,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e29882c3a3686ff9002396",
               "name": "Les Wiggins",
               "profile_path": null,
               "id": 1588226,
               "department": "Sound",
               "job": "Sound Editor"
            },
            {
               "gender": 0,
               "credit_id": "56e2989892514143cc0006a5",
               "name": "Pearl Orton",
               "profile_path": null,
               "id": 1588862,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 2,
               "credit_id": "56e298ab9251410261002140",
               "name": "George Blackler",
               "profile_path": null,
               "id": 1276585,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 4.186951,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 29030,
      "vote_count": 52,
      "budget": 0,
      "overview": "Story about a man haunted by the spirit of his dead wife and her effect on his second marriage.",
      "similar": [
         16859,
         282035,
         335797,
         9598,
         9325,
         1734,
         1735,
         564,
         140300,
         127380,
         116149,
         34584,
         164,
         281338,
         278927,
         15370,
         86829,
         1597,
         809,
         817
      ],
      "original_title": "The Tomb of Ligeia",
      "runtime": 81,
      "poster_path": "/7M8Muk7wZVhWrwbTFKIBKbPskw8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Alta Vista Film Production",
         "id": 13862,
         "origin_country": ""
      }],
      "release_date": "1964-11-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Even on her wedding night she must share the man she loved with the \"female thing\" that lived in the Tomb of the Cat!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Corman"],
      "runtime": 81,
      "synopsis": null,
      "writers": [
         "Edgar Allan Poe",
         "Robert Towne"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0059821/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNjgxNTM0Nzk0OV5BMl5BanBnXkFtZTcwMTgyMTM4NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Price, Elizabeth Shepherd, John Westbrook | See full cast and crew »"],
      "reviews": [
         "I was asked recently if I could name any genuinely scary films made before The Exorcist in 1973. The only titles I could come up with were Rosemary's Baby and Night of the Living Dead from the late '60s. I could suggest many horror titles made before 1970, but none were genuinely flesh-crawling enough to make the list. At the time, I had not seen The Tomb of Ligeia. Now I have seen it and, wow! This is one seriously under-rated gem. It is one of the many Roger Corman films from this era based on an Edgar Allan Poe story. Intelligently scripted by Robert Towne, and acted to perfection by Vincent Price and Elisabeth Shepherd, this film is a treat from start to finish. Shepherd plays a well-to-do lady in Victorian England who falls in love with a mysterious loner (Price) who resides in a crumbling abbey and seems haunted by memories of his previous (now-dead) wife Ligeia. She marries Price, but her chances of love are blighted by spooky happenings which may be the work of the ghost of his jealous ex-bride. The dream sequence, featuring a dead fox hidden in a bouquet of flowers and a terrifying metamorphosis midway through a passionate kiss, is a marvellous and memorable scene. All scenes featuring the weird black cat are eerily effective. There's also a wonderfully creepy hypnotism episode. The photography is lovely, with colourful outdoor lensing of a real English abbey and superb blending of light and shadows during the ghostly indoor sequences. So, if you're after a truly spine-tingling film from before 1970 - here you go!",
         "\"The Tomb of Ligeia\" was one of a cycle of films made by Roger Corman in the sixties based on the works of Edgar Allen Poe. Verden Fell, an English country gentleman of the 1820s has become obsessed with his dead wife Ligeia. Indeed, although she has been buried in a tomb he built for her, he believes that she is not dead but has, as she promised she would, survived death in some form and will return to him. This obsession survives Fell's remarriage to Rowena, the daughter of a neighbouring landowner. Indeed, his obsession worsens, as he comes to believe that Rowena is possessed by Ligeia's spirit. This is an unusual horror film in that much of it takes place not only outdoors but also in daylight. The sort of images of ruin and decay traditional in horror films- Fell lives in a gloomy, crumbling, cobwebbed manor house close to the ruins of a mediaeval abbey- are contrasted with sunlit scenes of the beautiful, verdant English countryside. The difference between life and death is the central idea of the film- which ends with a quote from Poe himself: \"The boundaries which divide life from death are at best shadowy and vague. Who shall say where the one ends and where the other begins\"- so this contrast is possibly symbolic, with the outdoor scenes symbolising life and the indoor ones death. The two main female characters (both played by the same actress, Elizabeth Shepherd) are differentiated in a similar manner. Rowena is a healthy-looking, \"English Rose\" type blonde with a love of outdoor pursuits, especially hunting. Ligeia is dark haired and gaunt with an unhealthy pallor. Like many films of this period, and unlike later films such as \"The Exorcist\", this is an example of an understated horror film, with the horror mostly being implied rather than shown directly. Ligeia makes an appearance in the film, but we are never sure whether this is really her ghost returning from the grave or a hallucination conjured up by Fell's distraught mind. Although it is understated, however, it is genuinely frightening, not because of Exorcist-style special effects, but because of the eerie mood that Corman is able to create. Apart from the atmospheric setting, various objects take on a sinister significance- a bunch of flowers, a dead fox and, most of all, a mysterious, malevolent black cat which may be the reincarnation of Ligeia's soul, or may be just a cat. The acting is also very good, especially from Shepherd in the dual role of Rowena/Ligeia and from Vincent Price as Fell. In a way this is also a dual role, as there are two separate aspects to Fell's character. On the one hand he is sinister and frightening, the man who threatens Rowena's happiness, her sanity and even her life. (The adjective \"fell\" significantly means cruel or fierce). On the other hand he is a pitiable character, a victim of his own obsessions and (possibly) also of his late wife's ghost. This duality is very much in keeping with the mood of the film, which is one of ambiguity and doubt. As befits one based upon the work of Poe, it is a tale of mystery and imagination. 7/10",
         "Well, at least for a little while! His last of eight Poe films as director is (loosely) based on the Poe work of the same name and is a solid metaphorical ghost story. Lady Rowena (the wonderful Elizabeth Shepherd) falls in love with Verden Fell (Vincent Price) despite his strange behavior and questionable past. Soon after their marriage, he starts disappearing, she's menaced by that old Poe stand-by (the evil black cat) and plagued by horrific nightmares involving Verden's deceased former wife Ligeia (also played by Shepherd), whose ghost seems intent on ruining the union. Price, in top hat and strange sunglasses in many scenes (his vision being \"dangerously acute\"), seems a bit too old for the role, but still manages to come through with an effective performance. Corman has always been underrated for effectively capturing period detail on a limited budget and it's his keen eye for the crumbling ruins, lush green countrysides, oceanfronts and shadowy castle corridors that make much of this film work. Screenplay by future Oscar-winner Robert Towne (CHINATOWN). LIGEIA was Corman's last horror film as director until 1990's FRANKENSTEIN UNBOUND.",
         "There is an assumption among movie fans that the longer a movie series exists, the worse the later films will be. Although the films Roger Corman made of some of the stories of Edgar Allan Poe began well and continued with no obvious sense of decline, it is my opinion that the best was kept for last. The most overtly spectacular film in the series was 'The Masque of the Red Death' with its fine sense of colour and effective sense of homage to Ingmar Bergman's 'The Seventh Seal'. I have always enjoyed this film and in terms of a deliberate departure from the series norm, it is exceptional. However one enjoys any series for the familiar as well as the unusual, and in this respect 'The Tomb of Ligeia' is the most memorable for me in the way it builds upon and enhances what has gone on in previous films. The logical departure from the previous films which had been (very happily and effectively) studio-bound, was to move to location. Corman's choice of Castle Acre Priory in Norfolk, was an inspired one. An large amount of location filming was done there and this grounded the film in a realistic (yet unusual)setting. Gone were the fog machines and 'blasted heath' effects of 'House of Usher' and 'The Premature Burial'. Many critics have mentioned their disquiet at the absence of Barbara Steele, at that time undoubtedly the actress most associated with this type of picture. Wonderful though Miss Steele was in, say, the last thirty minutes of 'The Pit and the Pendulum', I feel that the presence of the English actress, Elizabeth Sheppard, adds to the sense of realisim, while taking little away from the shock effect of one actress playing both a good and an evil role. Roger Corman is on record as saying that he had to keep a written record as to when Rowena was herself and when she was Ligeia. All I can say that it is happily obvious on the screen when each side of the romantic coin is in evidence. I think that Elizabeth Sheppard's performance, grounded in reason, and when added to the inevitable polish that was being obtained by this stage in the series, showed a welcome extra sense of belief, to point out the advances and progression that had been made by this, the last film, in the series. Two scenes stand out : the entrapment of Rowena in the bell tower by the black cat (representing Ligeia.) I am also very impressed by Rowena's hynotism ; first to her own childhood and then to the persona of Ligeia. This film has not been available for viewing in the UK for many years. It is to be hoped that this situation will be reversed before long. I remember with affection the moment when great talents (from both sides of the 'pond') collaborated with great effcetiveness to come up with the ultimate 'Corman Classic'.",
         "\"Ligeia\" is one of my very favorite E.A. Poe stories, a masterpiece of suspense that doesn't reveal its secret until the very last word. Like a lot of Poe's stories, however, the transformation to the screen isn't always an easy one. A great deal of the action in the short story takes place in the narrator's head, and to make a feature length movie out of it there must be some added action and characters. The screenwriter here, Robert Towne, would go on to bigger and better things and garner fame and awards while doing it. But this early script of his is a rather modest one. The action drags more and more as the film goes on and the sense of horror and tension dissipates rather than builds as the film progresses. Plus there's that annoying black cat (left over from another Poe story, perhaps?) What points this movie does get are for style. Roger Corman wasn't a schlock director by any means; he had a great eye and and gave his films a distinctive look and feel. The cast is a very good one as well. Vincent Price does the usual fine job we expect from him and I liked actress Elizabeth Shepard as the Lady Rowena, Price's wife who succeeds Ligeia. I wasn't familiar with her before seeing this movie and I found her very watchable. But 'The Tomb of Ligeia' is hardly classic Poe or a memorable horror film. But fans of Corman and the Hammer Films type of productions may want to see it.",
         "\"Tomb of Ligeia\" was the last of Corman's popular Edgar Allan Poe adaptations of the 60's. Because of how it's totally different in style from the previous entries in the series, many have deemed it as an inferior effort, though I personally think it's the total opposite. There's no doubt in my view that \"Ligeia\" is Corman's finest Poe adaptation. All the flaws present in his earlier films (even in the more well praised \"Masque of the Red Death\"), that have become even more visible with aging, have served as a lesson as to what not to do, and are thankfully not present here. The most effective change was the change of setting. Instead of using painted backdrops posing and excessive sound stage interiors posing as European settings, this one was actually filmed on-location in the British countryside, with studio indoors scenes kept to a minimum. The gorgeously photographed exterior locations, with the dark and imposing ruins clashing against the peaceful, idyllic nature surroundings, add immensely to the film's brooding Gothic atmosphere, and it's a real shame it wasn't used more often in other films of the same period. Not since Jean Epstein's haunting \"Fall of the House of Usher\" in 1928, has Poe's style been so faithfully adapted to the silver screen. This is mostly due to Corman's stylish and original direction, an intelligent script by Robert Towne (of \"Chinatown\" fame) and to Vincent Price's acting. Without resorting to over-the-top melodramatic gestures (as seen in 1961's \"Pit and the Pendulum\"), Price plays to perfection a suave, mysterious, eerily seductive and haunted lead - the ultimate Poe lead, and one of his best performances, up there with his work in \"Witchfinder General\". Elizabeth Sheppard, whom you might remember as the doomed journalist from \"Damien: Omen II\", is equally effective as the female lead, both as Ligeia and Lady Rowena. As Rowena, Sheppard doesn't go for your typical 'damsel in distress' performance as it could've been, and plays as a much stronger willed, not so innocent, independent, yet likable character. Though her role as creepy raven-haired Ligeia has less screen time, she does manage to leave an impression, and manages to be genuinely creepy. Another bonus is the surreal dream sequence that happens somewhere in the middle of the film. A trademark Corman treat, this scene is filled with vivid colors, brilliantly otherworldly camera-work and bizarre, nightmarish imagery, it's one of the film's scariest moments, and also one of the director's most memorable set pieces. Also, I love the subtly creepy and disturbingly poetic approach Towne and Corman take at the controversial necrophilia subplot. This subject matter would get an equally elegant treatment 10 years later in Mario Bava's \"Lisa and the Devil\". The film's flaws come basically from the final confrontation between Price and Sheppard, which comes back as a more typical Corman-ending-to-a-Poe-film, coming off as a bit anti-climatic, considering how much build up there was it. Nevertheless, it's fun and stylish, even if it's slightly campy tone doesn't match the otherwise seriousness of all that came after. Overall, an exquisite Gothic gem from the 60's, and essential viewing for fans of the genre. Even if you're not a fan of the director's work, do check it out, as it might as well come off as a pleasant surprise. 9.5/10",
         "Very fine Poe adaptation. I had always reckoned Masque of the Red Death, from the same period to be far superior, but not so. Viewed again this is very well put together, especially the first half, which is really only setting the scene for the Poe tale to be told. Not quite as stylish as the aforementioned film, this is still, nevertheless, possessed of a very strong dream like quality and builds scarily as doors rattle, animals squawk and the inevitable black cat scrambles, leaps and screeches. Wonderful setting of Castle Acre Priory helps give the film greater authenticity and Corman mixes the Shepperton Studio interiors well with the beautiful Norfolk countryside and the marvellous grandiose priory remains. I don't know why the tomb of the title had to be so shining white and new looking but never mind, a really good Corman outing with excellent performances from Price and the leading lady Elizabeth Shepherd, who regrettably seems to have otherwise worked almost exclusively in television. She has real presence here in a double role successfully mixing the seductiveness of Lady Rowena and the satanic steel of Ligeia.",
         "Of all the collaborations between director Roger Corman and sensuous, creepy actor Vincent Price, this is probably their best. There's the small cast of characters, mainly Ligeia, buried in a marble tomb in the grounds of a sinister old abbey, Rowena, a lady horserider looking for someone she can be 'drawn' to who is more interesting than her beau Christopher, and Verdon, Ligeia's bereaved husband, with his black shades and mood swings. There's also a cat. And this cat is really the true star of the film, watching, attacking, influencing. The film benefits from its heavy use of locations, and makes it stand apart from the studio interiors of other adaptations. This is a decadent, decaying England with strange happenings and curses. It is a superb film, and lifts the Shepperton Poe adaptations to a new level.",
         "Roger Corman is often celebrated for his economies, but nobody ever told me that he was also a wonderful cinematic craftsman. 'The Tomb of Ligeia (1964)' is my second Corman film (after the throwaway cheapie 'The Little Shop of Horrors (1960)'), and I'm now intrigued by the prospect of seeing his other Edgar Allan Poe-inspired creations. Horror maestro Vincent Price stars as Verden Fell, a wealthy widower who becomes obsessed by the possibility that his deceased wife somehow survives. Inexplicably drawn to Verden's sinister charms, the lovely Lady Rowena (Elizabeth Shepherd) agrees to marry him. However, on their wedding night, she is tormented by the memory of her predecessor, who seemingly takes the form of an ominous black cat. Though one could argue that nothing much happens in this film, it is nevertheless exceedingly dense with atmosphere, almost stiflingly so, every frame an overwhelming banquet of garish colours. The darkness of the nighttime is vividly punctuated by the gleaming scarlet of blood, hellish yellow flames, and an invisible black enemy that skulks in the shadows. While I don't expect that 'The Tomb of Ligeia' stays particularly close to the original story, the screenplay from Robert Towne (later to write 'Chinatown (1974)') emulates the gloomy Gothic overtones of classic Poe. Discomfort is gleaned, not only from the dialogue, but the silences between words. Not that Verden Fell is not given his fair share of dialogue; the film is so apparently entranced by the dark, charismatic tones of Price's voice that he often breaks off into superb, meandering monologues that give voice to the obvious. Not that the audience is complaining, of course \u0096 the way Price presents himself to the camera, with complete and utter conviction, is mesmerising. While the film, of course, owes a debt to Poe's literature, it is also an expansion of the Gothic melodrama sub-genre of the 1940s. Consider Hitchcock's 'Rebecca (1940),' in which young innocent Joan Fontaine is plagued by the \"ghost\" of her husband's previous wife; or Mankiewicz's 'Dragonwyck (1946),' which finds Gene Tierney harassed by her mentally deranged husband \u0096 played, appropriately, by Vincent Price.",
         "The films that immediately come to mind when considering Roger Corman's considerable cycle of Edgar Allen Poe adaptations are undoubtedly titles such as The Fall of the House of Usher (1960) and The Pit and The Pendulum (1961), both starring Vincent Price as a man psychologically torn by a past event or his looming fate, and both featuring the Gothic, set-based atmosphere that is now so celebrated by movie fans. The Tomb of Ligeia may be one of Martin Scorsese's all- time favourite horror movies, but it has been strangely, and unfairly, overlooked in the horror cannon. Price once again plays a man, Verden Fell, haunted by the death of his wife. While out fox-hunting one day, the young and boisterous Lady Rowena (Elizabeth Shepherd) comes across Verden in a graveyard, apparently looming over the grave of his wife, the mysterious Ligeia, and forced to wear protective glasses due to his failing eye sight. Rowena takes pity on him, and witnesses his psychological torment first hand, which is mainly due to the presence of a threatening cat and the idea that his dead wife is haunting him from the grave. The two eventually marry, but Rowena finds herself the subject of increasingly strange goings-on. Ligeia is noticeably different to the other entries into the Corman- Poe cycle, mainly due to it's use of exterior filming. While this causes it to lose the claustrophobic, and beautiful, sets of the likes of Usher and Pendulum, it makes for a spookier atmosphere. Price is excellent as always, as is Shepherd, but the blooming romance between their two characters suffers from a distinct lack of chemistry and the niggling problem of the glaring age-gap. However, Ligeia was written by Chinatown (1974) scribe and all-round Hollywood titan Robert Towne, so the absorbing dialogue more than makes up for the awkwardness between the two leads. Certainly a different experience, but Ligeia is up there with the very best of Corman's output. www.the-wrath-of-blog.blogspot.com"
      ],
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "productionCompanies": ["Alta Vista Film Production"],
      "summaries": [
         "Some years after having buried his beloved wife Ligea, Verden Fell meets and eventually marries the lovely Lady Rowena. Fell is something of a recluse, living in a small part of a now ruined Abbey with his manservant Kenrick as the only other occupant. He remains infatuated with his late wife and is convinced that she will return to him. While all goes well when first married, he returns to his odd behavior when they return to the Abbey from their honeymoon. The memories of Ligea continue to haunt him as well as her promise that she would never die.",
         "Erudite recluse Verden Fell is truck by a meeting with lady Rowena, daughter of country lord Trevanion, who reminds him of his late wife, Ligeia, both being somehow associated with a black cat and the wild fox the lord loves hunting. They fall in love, marry and resolve he leave the ruined abbey where he buried Ligeia. However Rowena's devoted gentleman friend Christopher Gough discovers it cannot be sold as Ligeia was never declared legally dead, making Rowena's marriage involuntarily bigamous. After a hypnotic session shows Ligeia possesses Rowena, strange things keep happening. Verden relapses in gloom and seclusion, but Christopher gets his loyal old manservant Kenrick to assist in an exhumation. In the abbey, things turn to a spectacular, dramatical conclusion for all concerned, yet not quite.",
         "A nobleman always dresses in black and is obsessed with his dead wife. He believes his new wife has been possessed by his dead wife's evil spirit.",
         "A man's obsession with his dead wife drives a wedge between him and his new bride."
      ],
      "budget": 0
   },
   "movielensId": 2783,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1964-11-01",
      "dvdReleaseDate": "2003-08-26",
      "directors": ["Roger Corman"],
      "runtime": 81,
      "movieId": 2783,
      "title": "The Tomb of Ligeia",
      "mpaa": null,
      "actors": [
         "Vincent Price",
         "Elizabeth Shepherd",
         "John Westbrook",
         "Derek Francis",
         "Oliver Johnston",
         "Richard Vernon"
      ],
      "imdbMovieId": "0059821",
      "originalTitle": "The Tomb of Ligeia",
      "genres": [
         "Horror",
         "Drama"
      ],
      "youtubeTrailerIds": ["54nxTqUBxJ4"],
      "plotSummary": "Story about a man haunted by the spirit of his dead wife and her effect on his second marriage.",
      "tmdbMovieId": 29030,
      "avgRating": 3.03103,
      "releaseYear": "1964",
      "numRatings": 145,
      "posterPath": "/7M8Muk7wZVhWrwbTFKIBKbPskw8.jpg"
   }
}