{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "spider",
            "id": 3986
         },
         {
            "name": "reincarnation",
            "id": 5484
         },
         {
            "name": "vase",
            "id": 5640
         },
         {
            "name": "wine",
            "id": 6563
         },
         {
            "name": "buried alive",
            "id": 7172
         },
         {
            "name": "horror",
            "id": 8087
         },
         {
            "name": "anthology",
            "id": 9706
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "zombie",
            "id": 12377
         },
         {
            "name": "corpse",
            "id": 13092
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "drunk",
            "id": 40879
         },
         {
            "name": "hypnotist",
            "id": 156040
         },
         {
            "name": "tomb",
            "id": 156081
         },
         {
            "name": "edgar allen poe",
            "id": 157132
         },
         {
            "name": "horror anthology",
            "id": 214544
         }
      ],
      "imdb_id": "tt0056552",
      "video": false,
      "title": "Tales of Terror",
      "recommendations": [
         29030,
         28501,
         45714,
         30137,
         25319,
         29107,
         29235,
         29056,
         83519,
         28170,
         119555,
         88176,
         27328,
         45674,
         74241,
         26680,
         23439,
         65899,
         40037,
         39973
      ],
      "backdrop_path": "/fcKy7EIzg7neljrwrLl90qCbcF8.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "John Chard",
         "id": "54dc097d9251416191002dbb",
         "content": "Corman, Poe & Price.\r\n\r\nThe fourth venture into Poe adaptations for Roger Corman and Vincent Price sees them taking on the portmanteau format with a trilogy of creepers. \r\n\r\nFirst off is Morella, which finds Price as a typecast loner living in a big old mansion with the dead corpse of his wife! Enter his daughter, who at birth was the reason for Morella’s death and thus Price originally holds a grudge, but of course there is a twist in the tale.\r\n\r\nSecondly is The Black Cat, with Peter Lorre joining Price in the best of the three tales. Price is a wine tasting dandy, Lorre a complete drunk and once Price meets Lorre’s beautiful put upon wife, things are going to end badly.\r\n\r\nFinally is The Case of M Valdemar which pits Basil Rathbone into the mix as a devious hypnotist who uses his powers for what he thinks will be sexually tinged deeds. Price is in this as well, but spends most of the story as a corpse.\r\n\r\nIt’s a short sharp shock piece of film making, fun and sometimes stylish, it doesn’t however have the requisite scares to marry up with the welcome black humour that makes the second instalment the standout. \r\n\r\nStill, having three legends of cinema in one picture has to be a bonus, and The Black Cat alone is worth investing time with this one. 7/10",
         "url": "https://www.themoviedb.org/review/54dc097d9251416191002dbb"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Locke / Fortunato / Valdemar",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e1b5",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "Montresor",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e1b9",
               "name": "Peter Lorre",
               "profile_path": "/6V1Jd8qN0PV76xJce7cJsqkQ55R.jpg",
               "id": 2094,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Carmichael",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e1bd",
               "name": "Basil Rathbone",
               "profile_path": "/grjsDNr7wt6E57Bf2GDg0yaBsRo.jpg",
               "id": 8727,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Helene",
               "gender": 1,
               "credit_id": "52fe45c5c3a368484e06e1c1",
               "name": "Debra Paget",
               "profile_path": "/hu9oG6bt7WohvU4G0ydKZ1aeDuf.jpg",
               "id": 48958,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Annabel",
               "gender": 1,
               "credit_id": "52fe45c5c3a368484e06e1c5",
               "name": "Joyce Jameson",
               "profile_path": "/xYwdYIxVzVSt9VCfNji9QD8i3Kp.jpg",
               "id": 40381,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Lenora",
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e1c9",
               "name": "Maggie Pierce",
               "profile_path": "/jDj148AePm38eVp9JegByRt8Hcj.jpg",
               "id": 102841,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Dr. James",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e1cd",
               "name": "David Frankham",
               "profile_path": "/nWfvSZ64kaHLnQmgL3No1ArAkra.jpg",
               "id": 16063,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Morella",
               "gender": 1,
               "credit_id": "52fe45c5c3a368484e06e1d1",
               "name": "Leona Gage",
               "profile_path": null,
               "id": 102842,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Barman Wilkins",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e1d5",
               "name": "Wally Campo",
               "profile_path": "/u1rbwy6rBLXZ6gnKn8Weh6uO1qE.jpg",
               "id": 102727,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Chairman of Wine Society",
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e1d9",
               "name": "Alan DeWitt",
               "profile_path": "/8ov1RE14bq13XISJoTpmHV36isW.jpg",
               "id": 102843,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e17b",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e181",
               "name": "Roger Corman",
               "profile_path": "/gCfEvxl7jTv2dBo8HvwWVMi3auz.jpg",
               "id": 102429,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e187",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e18d",
               "name": "Floyd Crosby",
               "profile_path": null,
               "id": 4083,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e193",
               "name": "Les Baxter",
               "profile_path": "/Al8Y7Wqykey2ne2QcbLCUC2wjcZ.jpg",
               "id": 99452,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e199",
               "name": "Daniel Haller",
               "profile_path": null,
               "id": 28236,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c5c3a368484e06e19f",
               "name": "Anthony Carras",
               "profile_path": null,
               "id": 41399,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e1a5",
               "name": "Harry Reif",
               "profile_path": null,
               "id": 30839,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e1ab",
               "name": "Ray Mercer",
               "profile_path": null,
               "id": 100991,
               "department": "Visual Effects",
               "job": "Visual Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e1b1",
               "name": "Pat Dinga",
               "profile_path": null,
               "id": 100988,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c5c3a368484e06e1df",
               "name": "Edgar Allan Poe",
               "profile_path": "/akmuLsbMrtcVrmiiaYqDK3QNdwC.jpg",
               "id": 48415,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "5500e4f9925141275c001a3f",
               "name": "Samuel Z. Arkoff",
               "profile_path": null,
               "id": 30904,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5500e508c3a3685b96002129",
               "name": "James H. Nicholson",
               "profile_path": null,
               "id": 51730,
               "department": "Production",
               "job": "Executive Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         }
      ],
      "popularity": 6.74025,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29074,
      "vote_count": 45,
      "budget": 0,
      "overview": "Three stories adapted from the work of Edgar Allen Poe:  1) A man and his daughter are reunited, but the blame for the death of his wife hangs over them, unresolved.  2) A derelict challenges the local wine-tasting champion to a competition, but finds the man's attention to his wife worthy of more dramatic action.  3) A man dying and in great pain agrees to be hypnotized at the moment of death, with unexpected consequences.",
      "similar": [
         29514,
         15762,
         16288,
         11033,
         431,
         238636,
         170,
         19908,
         452507,
         336843,
         298312,
         395834,
         397243,
         168098,
         10285,
         205,
         681,
         23483,
         769,
         4771
      ],
      "original_title": "Tales of Terror",
      "runtime": 89,
      "poster_path": "/bckNqHEsUX2Q7XyogXNyjL0RDfQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Alta Vista Productions",
         "id": 4820,
         "origin_country": ""
      }],
      "release_date": "1962-07-04",
      "vote_average": 6.6,
      "belongs_to_collection": null,
      "tagline": "A Trilogy of Shock and Horror!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Roger Corman"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "Richard Matheson",
         "Edgar Allan Poe"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0056552/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjIxMDU5NDg3M15BMl5BanBnXkFtZTcwNjIzMTM3NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Vincent Price, Maggie Pierce, Leona Gage | See full cast and crew »"],
      "reviews": [
         "Another of the Roger Corman/Vincent Price films based VERY loosely on three Edgar Allan Poe tales. The first is \"Morella\" where a dying girl comes to visit her father (Price) and find out why he abandoned her as a child. It has to do with her mother (Morella) and her death. Well-done but it doesn't make a lot of sense. \"The Black Cat\" is about a man (Peter Lorre) finding out his wife is cheating on him with someone else (Price). It's pretty good but Lorre's acting turns it into a comedy more than a horror story. \"The Case of M. Valdemar\" has an evil mesmerist (Basil Rathbone) keeping a man's spirit alive while his body wastes away. Well-done with a pretty gruesome ending. Basically this a good anthology of horror stories. They're well-produced, well-acted and written. Just don't expect them to be anything like the Poe tales (especially \"Morella\"). GREAT liberties have been taken with the stories--they just use them as a starting point and build on it. Also try to see it letter-boxed--the pan and scan TV version is pretty terrible. I give it a 7.",
         "This Roger Corman adaptation of three Edgar Allan Poe stories is fun to watch, hard to take too seriously. The first tale, Morella, is the most sombre, featuring Vincent Price mourning the death of his wife, for which he blames his young daughter. It's short and quite dramatic. The second story, The Black Cat, is an amiable mess, featuring Price and Peter Lorre. It has some agreeable humor, especially in its wine tasting scenes, and has some evocative nineteenth century street and tavern sets. The final tale, Facts In the Case Of M. Valdemar, features Price as a dying man whose consciousness but not body is kept alive by a scheming mesmerist, played by Basil Rathbone. This one ends on a note of pure horror, and is nearest to Poe in its mood and ideas. Screenwriter Richard Matheson did a reasonable job of adapting Poe, and Corman was probably wise to emphasize jokes in the middle tale, as Poe was one grim, death-haunted writer, and each of these stories is a meditation on death and the tricks it plays on us. Perhaps to compensate somewhat for the morbidity of the stories, Corman emphasizes bright colors throughout, as the decor and costumes are quite attractive, almost garish at times. The actors are fine, the older ones especially, though Maggie Pierce in Morella is quite good, if too contemporary in looks and voice. I can't resist a few sociological comments on the Corman-Poe cycle of films of the early sixties. Tales Of Terror came out in 1962, the high noon of the New Frontier. This was a time of optimism and social change, the start of the space program and the Civil Rights movement, and yet in the middle of it all there was this series of low budget horror films, aimed mostly at children and teenagers, and quite unwholesome in atmosphere and subject matter. These weren't even monster movies, like the horrors of old, they were morbid movies about death, torture, witchcraft and premature burials. They were like anti-Disney films, with Price, Lorre and Rathbone instead of MacMurray, Brian Keith and Dorothy McGuire. If in Disney nothing really bad ever happened, in Corman-Poe nothing really good ever happened. Disney represented the smiling surface of America, while Corman-Poe hinted as anxieties just below the surface, and as such, sad to say, portents of things to come.",
         "This film is a very loose adaptation of three Edgar Allan Poe tales, \"Morella\", \"The Black Cat\" and \"The (Facts in the) Case of M. Valdemar\", each roughly one half-hour in length. All three feature Vincent Price. The Black Cat also features Peter Lorre, and M. Valdemar also features Basil Rathbone. Morella concerns a daughter returning to the home of her father, who is estranged because of the mother's death. The Black Cat concerns an alcoholic who makes a crucial mistake in covering up a crime. And M. Valdemar concerns a doctor experimenting with hypnosis (or \"mesmerism\") on a terminally ill man. Although fairly clunky and uneven compared to the other Roger Corman/Vincent Price Poe collaborations (which tend to be excellent), and even compared to other similar collections of short films from the same era, such as Amicus' Dr. Terror's House of Horrors (1965), this is still a good film, and earned an 8 out of 10 from me. It is usually very difficult to try to adapt Poe stories to film--similar to the difficulty of attempting to adapt H.P. Lovecraft to film. Both authors write very dense, poetic, often abstract prose, and Poe, especially, is sometimes not very plot-oriented. Each segment in Tales of Terror succeeds in its own way, however. Morella, as Poe writes it, is an exploration of what personal identity means, particularly as it applies to continuation through offspring. In director Corman and writer Richard Matheson's hands, Morella becomes an even more abstract depiction of the ideas of personal identity, turned into more of a supernatural ghost story. It's also implied in the film that a lot of the events perhaps occurred in Locke's (Price) mind, leading up to the tragic ending. This segment is particularly notable for the set design, which is the best in the film. The Black Cat, which is Poe's most conventionally plotted tale out of the three presented here, is also probably the most changed. The changes in this case are surely due to the still lingering studio-imposed moral and content restrictions of the \"Golden Era\" of Hollywood. The changes are understandable, if still lamentable, in historical context. Corman and Matheson turn Poe's very dark and somewhat grisly story into more of a comedy for its first half, then more a tale of moral retribution in the second half. It's a joy to watch in any event, especially seeing Price's hammy comic performance. The ending of this section is as chilling as the beginning is humorous. Except for the addition of a couple characters, The Case of M. Valdemar is probably the closest to its source in spirit. This is a tightly scripted, creepy story, and the Carmichael (Rathbone) character is actually an improvement on Poe, and it's great to see Rathbone play someone so evil. In a fairly literal way, this is a great zombie story, although the ending of the filmed version is a bit more vague in both plot and in explaining the horrific dilemma than Poe's version. Despite its slight flaws--mainly that it's a bit too bright and colorful and the mood of the segments could have matched better--Tales of Terror is worth viewing, especially for any Poe, Corman, Price or Rathbone fans.",
         "Tales of Terror is a classic anthology of Edgar Allen Poe stories brought to life by Richard Matheson's writing and Roger Corman's directing. It's loaded with genre favorites and Vincent Price stars in all three tales (that right there is enough to make me watch). All three stories are indeed dark or humorous, or both, with The Black Cat being the strongest simply because of the interaction between Price and Peter Lorre. Price really hams it up in the wine tasting scene and I crack up every time. And Lorre is incomparable. This yarn does feature a black cat, but it's more like The Cask of Amontillado actually. The Facts in the Case of M. Valdemar is something else that needs to be seen. Basil Rathbone stars in this one and looks remarkably like a beardless Wes Craven. It's uncanny. Let us not forget the first story, Morella. This one is a dark drama and doesn't offer any humor. It's still great though and Price's character here reminds me quite a bit of the one he played in The Pit and the Pendulum (another Corman/Poe production). If you like the other Corman adaptations of Poe, don't miss this one.",
         "Roger Corman presents this horror anthology based on three stories by Edgar Allen Poe, where all three segments are introduced by and star Vincent Price. \u0091Tales of Terror' is a movie which generally is hard to accept as a serious horror film, but fun when considered as a camp and kooky entry into the genre. Vincent Price is excellent in all three of his fairly contrasting roles and one could certainly see this film as a major piece of evidence when attempting to ascertain just how great and diverse a performer the late Mr. Price actually was. Roger Corman's directorial lavishness served to give the entire a movie a certain air of pomposity that lacked from some of his previous efforts and the varying directorial styles that Corman utilised throughout the film are the most prominent reason for the enjoyability of the movie. In the first segment, entitled \u0091Morella', Vincent Price stars as Locke, a man traumatised to the point of insanity following the death of his wife (Leona Gage). Locke blames the early passing of his wife solely on his daughter Lenora (Maggie Pierce) and is therefore unimpressed and enraged when she shows up at his door twenty-six years since he last saw her. However, the relationship between the two starts to grow strong, before events take a horrifying turn. Easily the most solemn and horrific of the three stories, \u0091Morella' is unfortunately too short a segment for one to really enjoy the production. It seems that Corman preferred to concentrate the majority of the segment solely on the relationship between Lenora and her father, thus leaving the ending scenes looking rushed and the viewer to feel rather unsatisfied. That is not to say the story itself is not entertaining, it just does not appear to have fulfilled its potential. Good performances, some magnificent (albeit brief) haunting scenarios and a frightful image of a decomposed corpse are the highlights to this segment and certainly help to save it from the problems with pacing. The following segment is far more corny and amusing. Entitled \u0091The Black Cat', this story follows the drunk, cat-hating Montressor (Peter Lorre) who during one of his less sober moments, challenges Vincent Price's wine-critic character of Fortunato to a wine-tasting contest and shortly Montressor begins to wish the two had never met. This segment seems so far removed from the opening segment that one could be forgiven for thinking they were watching a different movie. \u0091The Black Cat' takes a far more light-hearted tone as the entire segment is laced with camp humour \u0096 particularly the facial expressions and general mannerisms of Vincent Price during the wine-tasting contest. This is a far more extravagant Vincent than we had previously seen. Despite one or two dramatic moments of tension and suspense, the segment never really sends any chills down the spine and is quite obviously present mainly for comedy value. It is in this story that Corman primarily chooses to utilise camera effects and visual trickery to set the mood, which is usually to enhance the humorous aspects of the film, such as during the wine-tasting contest where the effects are obviously used to show the increasing state of Montressor's intoxication. Even a hallucinatory sequence where Vincent Price's character plays with a severed head has an undeniable camp, comic charm. All in all, this segment is fun but far from truly horrifying. The final segment, called \u0091The Facts in the Case of M. Valdemar', stars Vincent Price as a terminally ill man receiving pain relief through a form of hypnosis. Valdemar (Price) agrees to be hypnotised at the point of death by Carmichael (Basil Rathbone), much to the dismay and disgust of Valdemar's wife (Debra Paget) and physician Elliot James (David Frankham). Unlike the first segment, this one suffers by moving too slowly. Corman does an excellent job of building the tension where required, but he seems to take a rather lethargic approach to moving the story along. Performances from the entire cast were excellent and are the main positive aspect to the segment. Overall, this seems a fitting way to end the film and features one particularly gruesome scene. Just like the previous two segments, the story never really seems to fulfil its potential but can hardly be described as poor. Generally, the film is entertaining despite the pacing problems and intermittent moments of overabundant camp humour. Horror fans should not go into this movie expecting a serious fright fest. Instead it is best to view when ready to see some great performances from Vincent Price in three rather differing types of story. Excluding a couple of scenes, one should not find anything horrifying about this film, but should find multiple amusing aspects and a jolly good time. My rating for \u0091Tales of Terror' \u0096 7/10.",
         "This film's three segments are roughly based on Poe stories, with writer Richard Matheson adding subplots of adultery and jealousy. In \"Morella,\" there's a dying father and daughter and a dead wife who decides to speed their demise (which Corman would cover again in his film \"Tomb of Ligeia\"). \"The Black Cat\" is an elaborated version of \"The Cask of Amontilado\" with the addition of adultery (and a funny guest part by Peter Lorre). \"The Case of M. Valdemar\" adds a lecherous hypnotist (Basil Rathbone) to the story of a hypnotized corpse. As in most AIP films, gore is minimal, and innocents rarely suffer (with the possible exception of the daugher in \"Morella\"). While not a major classic, it's enjoyable, with the charisma of the old cult film stars (Price, Lorre and Rathbone) one of the best elements.",
         "An excellent film which seems made for the cast that is in it. Each tale excels with Price's presence and I was sad to see the movie end. While not quite as good for Price fans as \"Last Man on Earth\" or \"Pit and the Pendulum,\" it also is not quite as surreal and comedic as Price, Lorre, and Karloff were in \"The Raven.\" Definitely worth watching and is a great film to introduce younger audiences to possible interpretations of Poe as well as Price, Lorre, and Corman. Recommended",
         "\"Tales of Terror\" presents three adaptations of good stories by Edgar Allan Poe directed by Roger Corman. (1) \"Morella\": The twenty and something years old Lenora (Maggie Pierce) returns to the derelict house of her estranged father Locke (Vincent Price). Her mother Morella (Leona Gage) died after giving birth to Lenora and Locke still grieves and blames Lenora for the death of his beloved wife. Lenora finds the corpse of Morella on her bed and Locke tells that he could not leave her in a coffin six feet under. Locke tries to make amends for abandoning Lenora but something supernatural happens. \"Morella\" is the weakest segment of this trilogy of horror tales. The good theatrical performances and the excellent sets make it worthwhile watching. My vote is six. (2) \"The Black Cat\": The drunkard Montresor (Peter Lorre) is an abusive man that spends the money that his wife Annabel (Joyce Jameson) earns working drinking wine in a tavern. He also mistreats her black cat. One day, Montresor meets the connoisseur of fine wines Fortunato Luchresi (Vincent Price) and he disputes his knowledge with him. Fortunato brings Montresor home and woos Annabel. When Montresor discovers that his wife is having a love affair with Fortunato, he plots an evil scheme to seek revenge. \"The Black Cat\" is the best segment of this trilogy. This story has humor and Peter Lorre's performance is very funny. The conclusion is hilarious with the cat's meow. My vote is eight. (3) \"The Case of M. Valdemar\": The wealthy Ernest Valdemar (Vincent Price) is terminal feeling great pain. He hires the hypnotizer Carmichael (Basil Rathbone) to relief his pain and asks his beloved wife Helene (Debra Paget) and his Dr. James (David Frankham) to get married to each other after his death. However Carmichael controls his mind and Valdemar dies but his soul stays trapped in his body. Carmichael tells Helene that he let Valdemar go only if she marries him but his attitude brings tragic consequences. \"The Case of M. Valdemar\" is a creepy tale of terror. Debra Paget is very beautiful, the veteran Basil Rathbone is scary with his eerie power and the conclusion is great. My vote is seven. Title (Brazil): \"Muralhas do Pavor\" (\"Wall of Terror\")",
         "A portmanteau film comprising three Edgar Allen Poe stories adapted for the screen by Richard Matheson. Morella: A woman (the Morella of the title) died shortly after giving birth to her baby daughter. The father blamed his daughter for his wife's death and shunned her. However, twenty-six years later the daughter returns home and makes up with her estranged father. However, the father has kept his wife's corpse mummified and the spirit of the dead woman seeks revenge by possessing the spirit of her daughter. The Black Cat: A drunkard discovers that his wife is having an affair with his best friend, a local wine taster. He rebels by burying them behind a brick wall also burying with them his wife's black cat whom he could not stand. The Facts In The Case Of M. Valdemar: An elderly man dying of an incurable illness agrees to let a shady mesmerist hypnotise him on his death bed in order to avoid the pain of his illness. However, when the mesmerist does this, he takes control of the man's spirit in order to command it to do as he pleases. When the spirit awakes it strangles the mesmerist and the corpse decomposes into slime. Handsomely mounted entry in Roger Corman's Poe series. The special effects including the sequence in Morella where the spirit of the dead wife emerges through dark cobwebbed corridors in sinister shadow must have pushed the technological bounds of cinema to it's limits at the time. Another interesting sequence is in The Black Cat where the murderer in a drunken stupor has a nightmare in which his victims have beheaded him and are tossing it from one to the other and the man is still crying out give me back my head with the headless body chasing it and the face still alive with expressions. Grisly but technically astonishing even after forty-two years since it was released! The cast is exemplary with Price who features in all the stories shining best in The Facts In The Case Of M. Valdemar as the dying man. In this story Basil Rathbone (former Sherlock Holmes star) is outstanding as the evil hypnotist. Peter Loree is also fine as the old soak driven to murder in The Black Cat. Corman's direction is good and Floyd Crosby's camera-work is simply brilliant.",
         "As a fan of both vintage horror films and Poe, I knew I had to see this one. I was familiar with Poe's Morella and The Black Cat, so I wanted to see how the film treatment compared. I hadn't yet read The Facts in the Case of M. Valdemir. In short, I was not too impressed with the first and third stories in the movie, but the second one was very funny. I watched it with my 11-year-old son, and he enjoyed it as well. It was interesting to see how elements of the Poe stories were worked into the film. The writer(s) used not only the 3 sub-titular stories as inspiration, but drew from other stories and poems. Someone who is familiar with Poe's writings will notice several familiar names (Lenore from The Raven, Annabel from Annabel Lee, Fortunato, Luchresi, and Montresor from The Cask of Amontillado). The Black Cat segment is really a blending of that story with The Cask of Amontillado, which is a very interesting combination indeed...especially since it results in a downright funny (albiet VERY darkly funny) story, as there isn't much funny about either Poe story. Overall, I'm glad I saw it, although I doubt that I'll watch it again."
      ],
      "genres": [
         "Comedy",
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Alta Vista Productions"],
      "summaries": [
         "Three stories adapted from the work of Edgar Allen Poe. A man and his daughter are reunited, but the blame for the death of his wife hangs over them, unresolved. A derelict challenges the local wine-tasting champion to a competition, but finds the man's attention to his wife worthy of more dramatic action. A man dying and in great pain agrees to be hypnotized at the moment of death, with unexpected consequences.",
         "\"Tales of Terror\" presents three adaptations of good stories by Edgar Allan Poe directed by Roger Corman. (1) \"Morella\": The twenty and something years old Lenora returns to the derelict house of her estranged father Locke. Her mother Morella died after giving birth to Lenora and Locke still grieves and blames Lenora for the death of his beloved wife. Lenora finds the corpse of Morella on her bed and Locke tells that he could not leave her in a coffin six feet under. Locke tries to make amends for abandoning Lenora but something supernatural happens. (2) \"The Black Cat\": The drunkard Montresor is an abusive man that spends the money that his wife Annabel earns working drinking wine in a tavern. He also mistreats her black cat. One day, Montresor meets the connoisseur of fine wines Fortunato Luchresi and he disputes his knowledge with him. Fortunato brings Montresor home and woos Annabel. When Montresor discovers that his wife is having a love affair with Fortunato, he plots an evil scheme to seek revenge. (3) \"The Case of M. Valdemar\": The wealthy Ernest Valdemar is terminal feeling great pain. He hires the hypnotizer Carmichael to relief his pain and asks his beloved wife Helene and his Dr. James to get married to each other after his death. However Carmichael controls his mind and Valdemar dies but his soul stays trapped in his body. Carmichael tells Helene that he let Valdemar go only if she marries him but his attitude brings tragic consequences.",
         "Three tales of terror involve a grieving widower and the daughter he abandoned; a drunkard and his wife's black cat; and a hypnotist who prolongs the moment of a man's death."
      ],
      "budget": 0
   },
   "movielensId": 2785,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1962-07-04",
      "dvdReleaseDate": "2000-09-26",
      "directors": ["Roger Corman"],
      "runtime": 89,
      "movieId": 2785,
      "title": "Tales of Terror",
      "mpaa": "",
      "actors": [
         "Vincent Price",
         "Peter Lorre",
         "Basil Rathbone",
         "Debra Paget",
         "Joyce Jameson",
         "Maggie Pierce",
         "David Frankham",
         "Leona Gage",
         "Wally Campo",
         "Alan DeWitt"
      ],
      "imdbMovieId": "0056552",
      "originalTitle": "Tales of Terror",
      "genres": [
         "Thriller",
         "Comedy",
         "Horror",
         "Mystery"
      ],
      "youtubeTrailerIds": [
         "Y58nHVXTO1c",
         "TvU-9-B05mQ"
      ],
      "plotSummary": "Three stories adapted from the work of Edgar Allen Poe:  1) A man and his daughter are reunited, but the blame for the death of his wife hangs over them, unresolved.  2) A derelict challenges the local wine-tasting champion to a competition, but finds the man's attention to his wife worthy of more dramatic action.  3) A man dying and in great pain agrees to be hypnotized at the moment of death, with unexpected consequences.",
      "tmdbMovieId": 29074,
      "avgRating": 3.13265,
      "releaseYear": "1962",
      "numRatings": 147,
      "posterPath": "/bckNqHEsUX2Q7XyogXNyjL0RDfQ.jpg"
   }
}