{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "immigrant",
            "id": 2356
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "family relationships",
            "id": 10235
         },
         {
            "name": "los angeles",
            "id": 12670
         },
         {
            "name": "family",
            "id": 18035
         },
         {
            "name": "death of wife",
            "id": 208397
         }
      ],
      "imdb_id": "tt0113896",
      "video": false,
      "title": "My Family",
      "recommendations": [
         125842,
         23217,
         32325,
         34615,
         1363
      ],
      "backdrop_path": "/2npHrrDLRrRQfEIHTPnBrggBEGq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paco",
               "gender": 2,
               "credit_id": "52fe46d69251416c91061683",
               "name": "Edward James Olmos",
               "profile_path": "/i7zKqsFqL5L1HPmAMeSA1xZzlD5.jpg",
               "id": 587,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "52fe46d69251416c9106169b",
               "name": "Jimmy Smits",
               "profile_path": "/yIcr7NKpvkQPi2Js5SyISvOKys1.jpg",
               "id": 33181,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Chucho",
               "gender": 2,
               "credit_id": "52fe46d69251416c9106168b",
               "name": "Esai Morales",
               "profile_path": "/qeOm5PAxV0vDg5l9l0oqZsZg7PR.jpg",
               "id": 65344,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Young Maria",
               "gender": 1,
               "credit_id": "52fe46d69251416c91061693",
               "name": "Jennifer Lopez",
               "profile_path": "/yOz9MwgY9IV4kV9QdJyMCrATHCw.jpg",
               "id": 16866,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Young Jose",
               "gender": 2,
               "credit_id": "52fe46d69251416c9106168f",
               "name": "Jacob Vargas",
               "profile_path": "/IP7LaQDCFgoM6rKp8lGG2GUXNU.jpg",
               "id": 16429,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Toni",
               "gender": 1,
               "credit_id": "52fe46d69251416c91061697",
               "name": "Constance Marie",
               "profile_path": "/aBcdUxU0S7IW3SgexFOx9IQly9g.jpg",
               "id": 92326,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Young Jimmy",
               "gender": 0,
               "credit_id": "52fe46d69251416c9106169f",
               "name": "Jonathan Hernandez",
               "profile_path": "/wo0gzwC2fJvdNvC2YtrrQqKoQOB.jpg",
               "id": 89499,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe46d69251416c910616a3",
               "name": "Jenny Gago",
               "profile_path": "/usYVMd4GvrvWrMXjAOFOZgGB8ZR.jpg",
               "id": 129872,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jose",
               "gender": 0,
               "credit_id": "52fe46d69251416c910616b3",
               "name": "Eduardo López Rojas",
               "profile_path": "/AkGNInsnAHWgWOdvBibGD8SCetO.jpg",
               "id": 109627,
               "order": 8
            },
            {
               "cast_id": 2,
               "character": "Roberto",
               "gender": 0,
               "credit_id": "52fe46d69251416c91061687",
               "name": "Rafael Cortés",
               "profile_path": null,
               "id": 129871,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46d69251416c910616a9",
               "name": "Gregory Nava",
               "profile_path": "/n7P75gJWuUhvJKzVw6hJeL8rDoP.jpg",
               "id": 16395,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46d69251416c910616af",
               "name": "Gregory Nava",
               "profile_path": "/n7P75gJWuUhvJKzVw6hJeL8rDoP.jpg",
               "id": 16395,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "590ad59d9251414f8d010df7",
               "name": "Francis Ford Coppola",
               "profile_path": "/vEGwqahu7UlI6OwELy92xbXk9Kd.jpg",
               "id": 1776,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "5ac4023dc3a3682d66047a03",
               "name": "Edward Lachman",
               "profile_path": "/yXhB83p1aRpJzd3qKke6uBYescB.jpg",
               "id": 6345,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "5ac402490e0a260c390426b3",
               "name": "Nancy Richardson",
               "profile_path": null,
               "id": 67846,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "5ac4027d925141271203f034",
               "name": "Anna Thomas",
               "profile_path": null,
               "id": 16396,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.017054,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 38722,
      "vote_count": 12,
      "budget": 5500000,
      "overview": "Traces over three generations an immigrant family's trials, tribulations, tragedies, and triumphs. Maria and Jose, the first generation, come to Los Angeles, meet, marry, face deportation all in the 1930's. They establish their family in East L.A., and their children Chucho, Paco, Memo, Irene, Toni, and Jimmy deal with youth culture and the L.A. police in the 50's. As the second generation become adults in the 60's, the focus shifts to Jimmy, his marriage to Isabel (a Salvadorian refugee), their son, and Jimmy's journey to becoming a responsible parent.",
      "similar": [
         427900,
         339397,
         32868,
         13,
         281,
         112160,
         11121,
         416477,
         226,
         8272,
         3134,
         49950,
         5781,
         9654,
         319,
         320,
         19913,
         1581,
         858,
         141
      ],
      "original_title": "My Family",
      "runtime": 128,
      "poster_path": "/wDV4MCBmmTdgNQTv2tYbQg5diaB.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Newcomb Productions",
            "id": 89873,
            "origin_country": ""
         },
         {
            "logo_path": "/ueaENQkPcy8rlr5fGZVBXKOhlBh.png",
            "name": "American Zoetrope",
            "id": 70,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "American Playhouse",
            "id": 3906,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Majestic Films International",
            "id": 20928,
            "origin_country": ""
         }
      ],
      "release_date": "1995-05-03",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "Three generations of dreams.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Gregory Nava"],
      "runtime": 128,
      "synopsis": null,
      "writers": [
         "Gregory Nava",
         "Anna Thomas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113896/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg5OTM1Mzg4NV5BMl5BanBnXkFtZTgwMzY2NjQzMTE@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jimmy Smits, Esai Morales, Edward James Olmos | See full cast and crew »"],
      "reviews": [
         "I really enjoyed this movie. If you know anything about Mexican culture, it should really make you laugh! Of course, it also has its moments of tragedy but somehow everything ends up being okay. I liked it! It's definitely a movie that makes you feel! Esai Morales, Chucho, does an excellent job! I think it's some of the best acting I've ever seen him do. I hope you see it!",
         "'My Family' is a compelling tale spanning three generations about a family of Mexican origin living in Los Angeles. It starts with the father of the family, Jose Sanchez (terrifically played by Jacob Vargas), making a one year journey on foot from Mexico to Los Angeles. Once there, he meets and marries the love of his life, Maria (Jennifer Lopez, in an interesting performance). After, Maria survives a tragic separation, she and Jose settle in Los Angeles and raise a family of six. There is a tremendous amount of expectation here, namely because Francis Ford Coppola, who crafted arguably the most exhilarating family saga in the Godfather pictures, is an executive producer. But, My Family is nowhere near in the same league as films like 'The Godfather'. Rather, 'My Family' turns out to be a great film that could have been better. One glaring flaw is in the script written by Gregory Nava and Anna Thomas is that too often, the script relies on tragedies to stir our emotions. Consequently, the emotion presented in the film feel fake at times. Particularly, in the scenes involving Jimmy attempting to bond with his only son, Carlitos. Despite the missteps in the film, there are many positives to draw upon. The strong performances of the cast. Jimmy Smits, in particular, dominates the film with an intense and yet affecting performance. The film hardly ever succumbs to being a standard tear-jerker or phony. Instead, the film succeeds at creating a touching and provocative portrait of a family's struggles and tribulations in a world that hardly seems just.",
         "Mexican culture has rarely been pictured in the Hollywood cinema (even though they we are the biggest minority in the country!), but this film probably rates as the best Mexican-themed film (until further notice). The evolution of the family's house really makes this an interesting image in regards to the lives of the family. The intersecting lives of the family are all well thought out, even though it all seems rather convenient they all have these different personas and political aspirations. When I first watched this film, I thought it was one of the greatest movies of all time. Instead of portraying Mexicans as lazy, this film really encompassed the cultural aspects and fears of the common Mexican man. A great film to watch, even if you aren't Mexican.",
         "The following tender scene (in an otherwise male-oriented movie) is totally unexpected: Jimmy Smits is a macho and is busy with his car, his wife (Elpidia Carrillo) whom he only married so she wouldn't be deported, comes up to him and changes the music in the cassette-player. She tries to get him to dance with her, right there on the street. At first he doesn't want to, but the way by how she finally succeeds is really a must to see. He even asks her at the end of the dance \"Will you teach me how to salsa?\". For only this scene one should rent the video, the rest of the movie isn't bad either!",
         "This is one of the best Latino movies I ever see. Story is great and the problems are real. The characters are well played. If you like \"the goodfather\" here's the hispanic version!",
         "'My Family' is a compelling tale spanning three generations about a family of Mexican origin living in Los Angeles. It starts with the father of the family, Jose Sanchez (terrifically played by Jacob Vargas), making a one year journey on foot from Mexico to Los Angeles. Once there, he meets and marries the love of his life, Maria (Jennifer Lopez, in an interesting performance). After, Maria survives a tragic separation from her husband, they both settle down in Los Angeles and raise a family of six. There is a tremendous amount of expectation here, namely because Francis Ford Coppola, who crafted arguably the most exhilarating family saga in the Godfather pictures, is an executive producer. But, My Family is nowhere near in the same league as films like 'The Godfather'. Rather, 'My Family' turns out to be a great film that could have been better. One glaring flaw is in the script written by Gregory Nava and Anna Thomas. Too often, the script relies on tragedies to stir our emotions. Consequently, the emotion presented in the film feels fake at times. Particularly, in the scenes involving Jimmy attempting to bond with his only son, Carlitos. Despite the missteps in the film, there are many positives to draw upon. The strong performances of the cast. Jimmy Smits, in particular, dominates the film with an intense and yet affecting performance. The film hardly ever succumbs to being a standard tear-jerker or phony. Instead, the film succeeds at creating a touching and provocative portrait of a family's struggles and tribulations in a world that hardly seems just. Rating: (8/10)",
         "Mi Familia is a mini masterpiece. It uses all manner of genre styles to tell its story and amazingly it works. This is a film with so much passion and significance it is almost tiring to praise it for fear of running out of breath. You could call this film an epic or a saga since it deals with many generations of the same family. The film never shies away from making a social comment or two and deals directly with the issues at hand in whatever time period it happens to take place in. The family has never had an easy life, but the closing statement rings true in that despite the hardships they have been made to endure they have lead an incredibly good life. More than twice this family is broken up by the racial hatred and civilly unjust policies of their times, but they always stick together and no matter what happens or who does what this family is truly unbreakable. All performances are fantastic but there is one the really sticks out. Jimmy Smits has proved time and again that he is a capable actor but his work in this film is simply amazing.",
         "This one hit close to home with me, especially with the characters. Chucho is a fun character that seemed to just be chased by bad luck, and some Hispanics, especially the older ones, are extremely superstitious. But it was funny how close the Chucho character was to the character that same actor played on \"La Bamba.\" And Jimmy... well, that character brings so many memories of one of my cousins life... who has been in and out of prison... he's crude, rude, and can be ruthless, but will help you any way he can, especially if you're family. As a filmmaker, I'm hoping to bring a non-integrated part 2 to this, but the background of the adventure of my lineage is exciting on both father and mother's side. It'll be filled with the unexplained, the pain and drama, Spanish royal connections, and treasure.... which still remains hidden to this day.",
         "This movie is by far one of the best Latino stories I have ever seen. True, the movie does use stereotypes (such as Jimmy and his prison life) Chuco and his gang life which eventually leads to his death, and of course who can forget the backyard wedding and the large family living in a small home. However, this movie is not meant to be a representation of ALL Latino's everywhere, rather its meant to merely tell one families story and struggles in the United States. The comments stating \"This movie does not represent Latinos everywhere!!\" are absolutely correct. And it does not represent Latinos, but it does help you learn about one family you learn to almost care about by the end of the film. Going back to the story itself, I can honestly say that the movie itself was very well made. Jimmy Smits performance was superb and the movie was very focused on all the family members. The film provides a sense of hope at the end, basically trying to get across that while life is full of problems they are manageable. Also, the fact that the movie also involved a different Latino culture, such as the Central American Isabel helped viewers understand that even among Latino's there are differences in cultures. I would definitely recommend this movie to someone willing to learn about one Mexican American families struggle.",
         "Very interesting film, mainly because it managed to avoid the cliches and the endless navel gazing that most movies with that theme would fall into. The story flowed gracefully and realistically and showcased a great cast of actors in unpretentious dramatic situations."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "American Playhouse",
         "American Zoetrope",
         "Majestic Films International"
      ],
      "summaries": ["Traces over three generations an immigrant family's trials, tribulations, tragedies, and triumphs. Maria and Jose, the first generation, come to Los Angeles, meet, marry, face deportation all in the 1930's. They establish their family in East L.A., and their children Chucho, Paco, Memo, Irene, Toni, and Jimmy deal with youth culture and the L.A. police in the 50's. As the second generation become adults in the 60's, the focus shifts to Jimmy, his marriage to Isabel (a Salvadorian refugee), their son, and Jimmy's journey to becoming a responsible parent."],
      "budget": 5500000
   },
   "movielensId": 279,
   "movielens": {
      "languages": [
         "English",
         "Español"
      ],
      "releaseDate": "1995-05-03",
      "dvdReleaseDate": "2004-04-06",
      "directors": ["Gregory Nava"],
      "runtime": 128,
      "movieId": 279,
      "title": "My Family",
      "mpaa": "R",
      "actors": [
         "Edward James Olmos",
         "Jimmy Smits",
         "Esai Morales",
         "Jennifer Lopez",
         "Jacob Vargas",
         "Constance Marie",
         "Jonathan Hernandez",
         "Jenny Gago",
         "Eduardo López Rojas",
         "Rafael Cortés"
      ],
      "imdbMovieId": "0113896",
      "originalTitle": "My Family",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["Cl7ff7hqAA0"],
      "plotSummary": "Traces over three generations an immigrant family's trials, tribulations, tragedies, and triumphs. Maria and Jose, the first generation, come to Los Angeles, meet, marry, face deportation all in the 1930's. They establish their family in East L.A., and their children Chucho, Paco, Memo, Irene, Toni, and Jimmy deal with youth culture and the L.A. police in the 50's. As the second generation become adults in the 60's, the focus shifts to Jimmy, his marriage to Isabel (a Salvadorian refugee), their son, and Jimmy's journey to becoming a responsible parent.",
      "tmdbMovieId": 38722,
      "avgRating": 3.68881,
      "releaseYear": "1995",
      "numRatings": 956,
      "posterPath": "/wDV4MCBmmTdgNQTv2tYbQg5diaB.jpg"
   }
}