{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "ambassador",
            "id": 1704
         },
         {
            "name": "devil's son",
            "id": 4084
         },
         {
            "name": "anti-christ",
            "id": 8685
         },
         {
            "name": "demon",
            "id": 15001
         },
         {
            "name": "fox hunt",
            "id": 154856
         }
      ],
      "imdb_id": "tt0082377",
      "video": false,
      "title": "Omen III: The Final Conflict",
      "recommendations": [
         10766,
         794,
         17792,
         11587,
         806,
         33518,
         11569,
         11298,
         9064,
         11980,
         9529,
         10676,
         15158,
         12662,
         11246,
         10859,
         11586,
         9725,
         13939,
         4961
      ],
      "backdrop_path": "/rTqJVYf0tcxGlhKDNC4V97ZPZys.jpg",
      "revenue": 20471382,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Damien Thorn",
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac71",
               "name": "Sam Neill",
               "profile_path": "/1ZHExb2rz6210NutoUhQcqQpwnl.jpg",
               "id": 4783,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "DeCarlo",
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac75",
               "name": "Rossano Brazzi",
               "profile_path": "/bhFXDKu6ldldNFowgS0xE5a27cE.jpg",
               "id": 29327,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Dean",
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac79",
               "name": "Don Gordon",
               "profile_path": "/nlffwt9VgwnPvcuVEorb6AApfqR.jpg",
               "id": 14062,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Kate Reynolds",
               "gender": 0,
               "credit_id": "52fe43b39251416c7501ac7d",
               "name": "Lisa Harrow",
               "profile_path": "/xkSAsTcQIQXJCSPalIaVTHDEMTS.jpg",
               "id": 66612,
               "order": 3
            },
            {
               "cast_id": 18,
               "character": "Peter Reynolds",
               "gender": 0,
               "credit_id": "57c02631c3a3684ce7002683",
               "name": "Barnaby Holm",
               "profile_path": null,
               "id": 1670480,
               "order": 4
            },
            {
               "cast_id": 19,
               "character": "President",
               "gender": 2,
               "credit_id": "57c0263ec3a36820f8003718",
               "name": "Mason Adams",
               "profile_path": "/ty5wmpiFUWgKgPapYT6exGsS6vf.jpg",
               "id": 59945,
               "order": 5
            },
            {
               "cast_id": 5,
               "character": "Barbara",
               "gender": 0,
               "credit_id": "52fe43b39251416c7501ac81",
               "name": "Leueen Willoughby",
               "profile_path": null,
               "id": 66613,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Brother Benito",
               "gender": 2,
               "credit_id": "57c025f59251414b15002672",
               "name": "Marc Boyle",
               "profile_path": null,
               "id": 18775,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Brother Martin",
               "gender": 2,
               "credit_id": "57c02602c3a3684d30006e12",
               "name": "Milos Kirek",
               "profile_path": null,
               "id": 152283,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "American Ambassador",
               "gender": 2,
               "credit_id": "57c0264d9251414b1500269a",
               "name": "Robert Arden",
               "profile_path": "/l8lx4yA8IQtgxPsd47p9dnoPWgQ.jpg",
               "id": 535977,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac87",
               "name": "Harvey Bernhard",
               "profile_path": null,
               "id": 7199,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac8d",
               "name": "Andrew Birkin",
               "profile_path": null,
               "id": 2355,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac93",
               "name": "Andrew Birkin",
               "profile_path": null,
               "id": 2355,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac99",
               "name": "David Seltzer",
               "profile_path": "/xrpGKYuDVkTJe6bjMDPgGdbEpR6.jpg",
               "id": 11834,
               "department": "Writing",
               "job": "Characters"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501ac9f",
               "name": "Graham Baker",
               "profile_path": null,
               "id": 43513,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501aca5",
               "name": "Richard Donner",
               "profile_path": "/2G0gyLVJzLmRl4W3sFyaVfxppJJ.jpg",
               "id": 7187,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501acab",
               "name": "Jerry Goldsmith",
               "profile_path": "/e6sd10VuwFXkgRFrCTCygbhMq2q.jpg",
               "id": 1760,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43b39251416c7501acb1",
               "name": "Phil Meheux",
               "profile_path": "/7dvzEurZ3sI5L2RYxvHjS4RLNl3.jpg",
               "id": 10709,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501acb7",
               "name": "Robert Paynter",
               "profile_path": null,
               "id": 14456,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43b39251416c7501acbd",
               "name": "Alan Strachan",
               "profile_path": null,
               "id": 24257,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 6.624017,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10768,
      "vote_count": 158,
      "budget": 0,
      "overview": "Damien Thorn (Sam Neill) has helped rescue the world from a recession, appearing to be a benign corporate benefactor. When he then becomes U.S. Ambassador to England, Damien fulfills a terrifying biblical prophecy. He also faces his own potential demise as an astronomical event brings about the second coming of Christ.",
      "similar": [
         253,
         646,
         657,
         667,
         699,
         708,
         806,
         954,
         714,
         588,
         9552,
         1250,
         1562,
         91586,
         561,
         668,
         682,
         10014,
         259693,
         691
      ],
      "original_title": "Omen III: The Final Conflict",
      "runtime": 108,
      "poster_path": "/6vbza8mUbfDiBqqYJMfsLSVIAvn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
         "name": "20th Century Fox",
         "id": 25,
         "origin_country": "US"
      }],
      "release_date": "1981-03-20",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": "/97vU4Y2bBmoJ3Mwi3uOAL8ahdUC.jpg",
         "name": "The Omen Collection",
         "id": 10919,
         "poster_path": "/5De8Hqq0z9gmDM7SbWU0C5pTjPC.jpg"
      },
      "tagline": "The power of evil is no longer in the hands of a child.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Graham Baker"],
      "runtime": 108,
      "synopsis": "Damien Thorn (Sam Neill), now 32 years old and head of his late uncle's international conglomerate, is appointed Ambassador to Great Britain, the same position his adoptive father held in the first film. Unlike the previous Omen films, the adult Damien is now entirely aware of his unholy lineage, and his destiny. An alignment of the stars in the Cassiopeia region of the night sky causes the generation of a 'superstar', described in the film as a second Star of Bethlehem. Thorn realizes it is a sign of the Second Coming of Christ and he orders all boys in England born on the morning of March 24, 1982 (the morning when, in the story, the Cassiopeia alignment occurred) to be killed in order to prevent the Christ-child's return to power. A subplot deals with one of Thorn's disciples, Harvey Dean, attempting to hide the fact that his own son was born at the appointed time; Dean not only fails at hiding that fact about his child from Damien, but is killed by his own hypnotized wife - likely in retaliation for refusing to go through with Damien's command to murder his son as a test of loyalty (the last child whom Damien suspects). Thorn has also become romantically involved with journalist Kate Reynolds (Lisa Harrow), a complex relationship which undermines his plans for political dominion for the time being. But Damien is not deterred from his plans and even focuses his attention on her preadolescent son Peter (Barnaby Holm), whom he takes as a disciple, partly by manipulating and exploiting the boy's internal desire to have a father-figure. Meanwhile, Father DeCarlo (Rossano Brazzi) and six other priests armed with the seven daggers of Megiddo - ancient holy weapons which are the only Earthly weapons which can harm the Antichrist - hunt Thorn in the hope of killing him before he can destroy the Christ-child. However, one by one, Damien kills off all the priests (some in horrific circumstances) until only DeCarlo survives. Finally, in spite of Thorn's efforts, DeCarlo informs Reynolds that the Christ-child is out of his reach but that, nonetheless, the task still remains to destroy Damien. In hopes of getting her son back, she (deceivingly) agrees to take him to the Christ-child in exchange for Peter. This is actually part of DeCarlo's plan to lure him into a trap where he is hoping to ambush Damien and catch him off guard, since most of his attention would be directed towards confronting Christ. The plan backfires though when Damien manages to spot DeCarlo first and in a final act of evil, Damien uses Reynolds' son - now slavishly devoted to Damien - as a human shield against the dagger. As Peter lies dying, Damien strangles the stunned Father DeCarlo. In a desperate bid to salvage his waning power, Damien calls out for Christ to appear before him. As he does, Kate sneaks up behind Damien with one of the daggers and stabs him in the back, releasing an otherworldly reverberating wail of demonic agony throughout the cathedral ruins. Christ appears before a dying Damien who then mockingly tells Christ 'Nazarene...you have won...nothing'. After Damien dies, his body is seen lying on the ground with Kate standing over it. In the foreground, a fully grown Christ carries Peter's body and hands him to Kate. The film ends with scripture of Revelation Chapter 21, Verse 4 indicating that when Christ returns to earth, peace will reign for all who faithfully awaited the Lord's return.",
      "writers": [
         "David Seltzer",
         "Andrew Birkin"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082377/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0MzkxMzg5NF5BMl5BanBnXkFtZTcwNDY4MTU1MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sam Neill, Rossano Brazzi, Don Gordon | See full cast and crew »"],
      "reviews": [
         "After the success of the first two 'Omen' films, it was inevitable that there would be more. According to the documentary 'The Omen Legacy' the original plan was for 7 total films, but producer Harvey Bernard and Twentieth Century Fox settled on 3. Now this was probably a smart thing to do, because you could only take this story so far until people would be tired of it. 'The Final Conflict' would be the long-waited finale to the series and was much anticipated. To the dismay of many who saw it, it was not the grand finale it should have been. It's sort of a cross between the first two films. On one hand it has more story and less blood and gore, but on the other it seems a bit more concerned with spectacle than telling a good story and ending the series in a satisfactory way. That doesn't mean this film isn't any good, but if you like the first two then you will likely be underwhelmed by the end result. Pros: Fine work done by the cast. Jerry Goldsmith composes a different, but still excellent score. Some elaborate and creative death sequences. Moves at a decent pace. Well photographed and nice scenery. A stronger, more layered script than last time. Has quite a mean streak. Cons: Lacking in scares and tension. Some things are too underdeveloped. The ending is a letdown for this film and the series as a whole. Final thoughts: After a series starts so well you hope the level of quality stays high in the subsequent installments. In the case of the 'Omen' franchise it did take a dive after the first film, but both theatrical sequels are still above average and worth the viewers time. They could have been better, especially this one, but unlike some sequels they aren't an embarrassment. My rating: 3.5/5",
         "The horror in this movie is so bad it's funny! Every time a monk gets anywhere near Damien the poor guy falls over a bridge or drops down a hole or just slips on a banana peel or something. On the other hand, the smart and pretty lady reporter gets her hands on Damien right away, without any trouble. It's said that Sam Neill who plays Damien and Lisa Harrow who plays Kate Reynolds were actually falling in love for real as this movie was being made. It really shows! Aside from being just gorgeous, Lisa Harrow was a good actress. You can see that her character has at least three sides to her. As a reporter, she's intrigued by Damien's vast wealth and growing political power. As a mother, she's frightened of his influence on her troubled teenage son. And as a woman, she can't help responding to the sheer excitement of his darkly sexual charisma. But what makes this interesting is that the story line always treats her character with respect. Her sexual feelings don't cancel out her heart or her intelligence, they just make her more mature and sympathetic. Why is it that major stars like Julia Roberts and Meg Ryan never play anyone half as interesting as this?",
         "In the first two Omen films, we were presented with a boy learning to adjust to his unusual personality and his future position in the destiny of the cosmos, but in this last film, Damien is in complete control as he prepares mankind for a \" paradise of pain. \" Sam Neill exudes a aura of amoral humanity, befriending a female reporter and her son while he seeks to defeat God; One very good sequence has Damien describing man as being naturally evil, claiming that God seeks to keep man from becoming truly innocent. Even though the atmosphere bounces from materialistic to spiritual, the film still gets a powerful message about corporations and their link to politics to the audience. Again, Sam Neill shows us a flawed, but arrogant man-beast, who pushes his way through without a backward glance. With such a performance, it is no wonder that Sam Neill is a great actor.",
         "Having seen this on it's initial video release, I have to admit I was somewhat disappointed with the outcome of the trilogy after the promise given in THE OMEN and DAMIEN - OMEN II. If you haven't seen it in ages, I would suggest getting hold of a copy of the DVD 25TH ANNIVERSARY TRILOGY to sample it again. THE FINAL CONFLICT, like THE BLACK HOLE and TRON in widescreen DVD, looks, sounds and feels better than in their original VHS versions. As always, I won't give away the essence of it, except to say that certain visuals make a lot more sense (the widescreen image does do justice to this, as you see a lot more of the frame) and Sam Neill's portrayal of Damien is even more chilling this time around. Granted, some of the plot points may throw you a bit and logic may win out, but some of the scenes make even more sense than they did initially (Think the complexities of MISSION: IMPOSSIBLE'S plot to get an idea of what I am thinking here!!). One other thing which may throw audiences is the English setting of the film, (but THE OMEN was set in London as well!) compared to the American setting of OMEN II, but bearing in mind that the saga has evolved with the characters, this is a strong point. It is also refreshing to have an American-made film which doesn't resort to too many stereotypes like WAYNE'S WORLD and THREE MEN AND A LITTLE LADY did Jerry Goldsmith's score is the best he did out of the three films. Take another look - you may be pleasantly surprised.....",
         "So far, I've given the \"Omen\" films straight eights, which is interesting. It's incredibly rare to find a sequel, much less the SECOND sequel, to be so good. The idea of the final ending of Damien Thorn was quite creative, and I'm very impressed with actor Sam Niel's accomplishment in fulfilling this part as Damien. It's most impressive, and, personally, I think the ending is rather... not as dramatic as it could have been. I think they ended it all too quickly, but all-in-all, the film is great. This series certainly hasn't lost it's touch, I'll admit. I suppose it's also very upsetting in places, since Damien is now an adult, in change of the Ambassador position after all this time, but even so, the film is very powerful, and very moving. Once again, the \"Omen\" series flourishes.",
         "*SPOILERS* I keep saying non-secular when I mean secular so I'm going to have to be especially careful when talking about this final in the trilogy which has been shown on telly for consecutive weekends on the graveyard shift. The other two were made in the seventies thus bestowing coolness upon them. At the start of the film Damien is sitting in a viewing theatre and is somewhat miffed. \"Trite, cliched, inane\" he complains. But enough about 'The Final Conflict' Damien, what about the advert you just watched? The eighties are truly upon us and are apocalyptic. Poor Sam Neill was described as a 'hacktor' after appearing in this but just how do you go about playing the Anti-Christ? Dracula disappears for most of Bram Stoker's novel to great effect and the best move would have been to do a 'Dead Zone' type plot with one man having visions after shaking his hand and trying to off him for the duration with Damien very much in the background. Instead, Neill goes for a hilarious pantomime turn of twitches, eyeball rolling, furtive glances and failed charm. All that is missing are the cape, mustache and tall black hat. His speech is mannered. \"The daggers are the only thing on EARTH...(pause)...that can kill me.\" DAN-DAN! Not the only thing, script starvation is another. This portentousness extends to the incomprehensible Father DeCarlo. \"The mark, 66.....(long pause)...6!\" Did he forget? It's not like a long zip code, is it? What you also don't want to do is hire a British tv director (Graham Baker) to direct a genre he is unfamiliar with. The action mostly revolves around people coming in and going out through doors and the set-ups are flat. Hey, Graham, horror films have lightening, don't they? So bung them in too in a highly risible manner, knocking a man off his feet in Keystone Cops fashion. Another problem is Jerry Goldsmith's score which makes an old style Ben Hur epic sound like a mere tap on the door. It's deafening appearances during the staid proceedings is laughably incongruous. The devil changes his modus operandi in this film. Why the change from crow to dog? Well, in a recent London stand up comedy act, a comedian found that the duck he hired cost £250 a day, £100 more than the Equity standard actor's pay for a WEEKS work. So he hired an actor in a duck's costume, I kid you not. So the change to a dog is not just satanic, it's smart. This dog is unusual though, it's point of view shot when stalking the American Ambassador in Hyde Park appears to be floating at least a foot off the ground and doesn't disturb twigs. Damien later explains that the breed once marched with the imperial Roman army. Must have been a sight, a load of soldiers with a row of dogs floating in the air. Keeps the sand off their paws, I guess. But a man's best friend is not his dog but his personal secretary. Harvey Dean (for it is he) reminds me of the hilariously inept personal secretary played by Barry Foster in the 'Sweeney!' Film, only going one better and adding baby killing to his CV. The none-too-bright Dean happily twitters on to Damien about family life seemingly unaware, unlike the rest of us, that the devil has a propensity towards nihilism. But unlike Barry Foster, Dean's assassins are competent and it's the God Squad's (on a sacred mission) that are inept. And don't say they're not used to that sort of thing, have you forgotten the Spanish Inquisition? Anyway, one of DeCarlo's priests goes to kill Damien in a tv studio. From, ahem, a gantry. What was he planning to do, jump down, break both his legs then crawl over to Damien and try and stab his toes? Embarrassed by this incompetence, Father DeCarlo tells the other priests that this time they're going to plan things down to the finest detail. So two of them wait in some ruins while another priest lures Damien to his demise. Sadly they get stuck in a hole, doomed to starvation. But hang on, doesn't planning down to the finest detail entail everyone knowing where they were heading thus ensuring a search party? But it's only me who thinks of these little things, such as Damien moaning to Dean that Christians like sticking to the letter of their prophecies. But do they? Killing Damien on consecrated ground and crucifying him with all seven daggers seems to have gone out of the window. Also 'Revelations' states that Christ will do battle with the Anti-Christ but he doesn't. Probably because he's a little short. In fact, he's a baby, a salient point lost on our Damien who stalks through an Abbey yelling, \"come out and face me, Nazarene!\" Er, Damien, he's a baby. He can't even walk yet. Do you expect one of the priests to run out and try and nut you with him? Instead, Damien is stabbed in the back by a journalist. Honestly, as the son of Satan he really should have seen THAT one coming. This film bludgeons you with pious scriptures and pompous choirs but is hypocritically exploitative. The series was silly but tapped into superstitions supposedly forgotten in this secular (yes, made it!) age, so it's a shame they went for easy sleazy rather than something thoughtful. What if, as a recent song writer posed, you had to believe in Jesus and the saints? If it was all true? The theological, moral and historical implications would have made for some philosophically interesting films. 'The Final Conflict' throws away the really big philosophical question of history, \"what is evil?\" Damien says that true evil is as pure as innocence and that people confuse it with their own lusts and perversions. The trouble is Damien has a statue of Christ crucified the wrong way to a cross and also sodomises his girlfriend Kate Reynolds telling her, \"birth is pain, life is pain, beauty is pain\", which suggests he's a bit confused as well. But Satan, being the father of lies, is bound to produce a hypocrite. The other problem with this film is Damien isn't really, well, evil enough. He's big on hyperbole: \"Grandeur of melancholy, divinity of loneliness, God doesn't lift a finger to do any housework\" etc, but he's only managed the death of a few relatives himself. What's shocking about being the head of a multi-national corporation nowadays? Thorn produces everything from Nuclear weapons to Soya Beans, but if you've ever been to supper at my mother-in-laws you'll know which is more lethal. Damien involves himself with a coup in Botswana to gain financially for Thorn industries and set himself favourably up with the president, while blithely missing the fact that with a bit more effort he could have stirred some real trouble up in the middle East between two of the worlds oldest religions, thus precipitating armageddon well ahead of schedule. It does at least prove however, that although the devil may have all the best tunes, don't hold your breath for the CD; he's a real slacker. In fact, the most shocking moments in the whole film come when Kate Reynolds (a BBC journalist, no less!) Seems to approve of her son fox hunting and being traditionally blooded and also let's a complete stranger into her house late at night just because he tells her he's a priest. A sobering thought for our non-secular times. Oh, ****!",
         "A fairly good end to the trilogy, although it's a shame the threatened armaggeddon never comes off (as in the later novels). Sam Neill puts in a good performance as the Devil's son and is surrounded by decent character actors. However, how Jerry Goldsmith didn't win an Oscar for the score, I will never know. It's absolutely amazing and proves music really can improve a film (just imagine a score-less Psycho, for example).",
         "I had a very strange reaction to this film. I love it, I really mean that, I LOVE it, but at the same time, I can't figure out why. It runs slow, it is not very suspenseful, and even some of the actors are a little off. But still yet, for some reason, I really enjoyed this movie. Damien Thorn, the evil being that we saw in the first two films, is now grown up. And even worse, he is not the US Ambassador to England. Now that he is a powerful man, he must find away to prevent the second coming of Christ. Fans of psychological horror will love this film. There are a bunch of truly terrifying things that happen in this film, yet we don't see them. A lot of them having to do with babies. Sam Neill does an excellent job at playing the adult Damien Thorn. He is truly talented in the acting business. This is a good film, and should be watched by all fans of the first two.",
         "I was excited to view this film after watching two shocking films before, and I was not pleased. It opens with a patriotic type of black mass(fabulously scored by Goldsmith)over sounding the continuing story of Damien, the antichrist, but alas it was not meant to be! Upsetting in almost all departments it was carried into, this film was a disapointment. I could deal with shocking deaths of child killing, because at least that was attention getting, but the ending was a real letdown!!! Sam Neill was absolutely perfect in a dark and seductive role as an older version of the antichrist, but his terrific portrayal was wasted by the terrible writing this one had to offer. All that build up for a lackluster ending! Just watch the first two, and avoid this one!",
         "This second sequel to huge hit 'Richard Donner's Omen (Gregory Peck, Lee Remick)' centres on anti-Christ personified by Damien (Sam Neill) . Now grown-up Damien (as a teen was incarnated by Jonathan Taylor) is the only proprietary of Thorn industries , one time deceased his forested parents (William Holden , Lee Grant from Omen 2 by Don Taylor) . Damien is named American Ambassador to London by the US President (Mason Adams). A group of monks (Rossano Brazzi , Tony Voguel , among others) get the seven daggers , as Damien Thorn can now only be murdered by one of the daggers . In England Damien is helped by an assistant (Don Gordon) and he falls in love with a TV journalist (Lisa Howard) . The film talks, fundamentally, about the rebirth of Christ and confrontation to anti-Christ Damien . The devilish Damien is poised for ruling over earth supported by his underlings . This exciting follow-up contains thrills , chills , suspense ,tension and grisly killings . The chief excitement resides in seeing what amazing and creepy murders happen every few minutes of picture . The eerie scenes range from the genuinely fantastic to the bizarre and horrifying images . The movie is quite predictable but we have seen the previous chapters but also its predictability is redeemed in part by the charismatic acting by Sam Neill , the New Zealand-born player , and an effective secondary casting . Colorful and adequate cinematography by Phil Meheux (The Zorro) . Again evocative musical score by the great Jerry Goldsmith (Planet of apes) with soundtrack-alike first entry , winner a deserved Oscar . The motion picture was professionally directed by Graham Baker (Beowulf , Alien Nation) . Followed by an inferior television movie , Omen IV (2001) , and for genre addicts only , directed by Jorge Montesi with Faye Grant and Michael Woods ."
      ],
      "genres": ["Horror"],
      "productionCompanies": ["Twentieth Century Fox Film Corporation"],
      "summaries": [
         "Now come into his full knowledge and power, the Anti-Christ in the body of Damien Thorne is about to strike his final blow. The Christ-child has been born again, on the Angel Isle, Great Britain (Scotland, England & Wales). The plan is simple, find the male children born on the specified day, and kill them all.",
         "Damien, the anti-Christ, is a thirty-something CEO of a huge multinational corporation and the new ambassador for Great Britain (Scotland, England & Wales), but he lusts for control of the world. The Dark One's only enemies are seven monks sworn to Damien's destruction with sacred daggers forged for that one purpose. As the monks hunt Damien, he orders the systematic elimination of recently born boys, who he believes are the Second Coming of Christ. Will good or evil triumph?",
         "The now adult Antichrist plots to eliminate his future divine opponent while a cabal of monks plot to stop him."
      ],
      "budget": 0
   },
   "movielensId": 2790,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-03-20",
      "dvdReleaseDate": "2000-09-05",
      "directors": ["Graham Baker"],
      "runtime": 108,
      "movieId": 2790,
      "title": "Omen III: The Final Conflict",
      "mpaa": "R",
      "actors": [
         "Sam Neill",
         "Rossano Brazzi",
         "Don Gordon",
         "Lisa Harrow",
         "Barnaby Holm",
         "Mason Adams",
         "Leueen Willoughby",
         "Marc Boyle",
         "Milos Kirek",
         "Robert Arden"
      ],
      "imdbMovieId": "0082377",
      "originalTitle": "Omen III: The Final Conflict",
      "genres": [
         "Drama",
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [
         "MEh07Der7dc",
         "ZqrUy6S2O68"
      ],
      "plotSummary": "Damien Thorn (Sam Neill) has helped rescue the world from a recession, appearing to be a benign corporate benefactor. When he then becomes U.S. Ambassador to England, Damien fulfills a terrifying biblical prophecy. He also faces his own potential demise as an astronomical event brings about the second coming of Christ.",
      "tmdbMovieId": 10768,
      "avgRating": 2.66748,
      "releaseYear": "1981",
      "numRatings": 615,
      "posterPath": "/6vbza8mUbfDiBqqYJMfsLSVIAvn.jpg"
   }
}