{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "game show",
            "id": 4325
         },
         {
            "name": "chaos",
            "id": 4630
         },
         {
            "name": "travel",
            "id": 9935
         },
         {
            "name": "family vacation",
            "id": 14724
         },
         {
            "name": "eiffel tower paris",
            "id": 164889
         },
         {
            "name": "marriage problems",
            "id": 166113
         },
         {
            "name": "interrupted vacation",
            "id": 166129
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0089670",
      "video": false,
      "title": "National Lampoon's European Vacation",
      "recommendations": [
         11153,
         11419,
         9749,
         5825,
         9080,
         14170,
         2617,
         11977,
         14628,
         8388,
         10890,
         11584,
         8873,
         11064,
         10276,
         13665,
         11814,
         10023,
         1406,
         11933
      ],
      "backdrop_path": "/heeguNcsSjav0LZbBkfSPWRV5vm.jpg",
      "revenue": 49364621,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Clark Griswold",
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d847",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ellen Griswold",
               "gender": 1,
               "credit_id": "52fe443c9251416c7502d84b",
               "name": "Beverly D'Angelo",
               "profile_path": "/8fYQIA8dAaA4GOTxOFSKIvTqzi.jpg",
               "id": 821,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Audrey Griswold",
               "gender": 1,
               "credit_id": "52fe443c9251416c7502d861",
               "name": "Dana Hill",
               "profile_path": "/phLOlvkyID7EF9ZFu3CPaoW71L5.jpg",
               "id": 69344,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Russell 'Rusty' Griswold",
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d865",
               "name": "Jason Lively",
               "profile_path": "/klkqv3Yvmx6drZZ5PHrCUwcGuTN.jpg",
               "id": 69345,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Hotel Manager",
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d87b",
               "name": "Mel Smith",
               "profile_path": "/t9aojcL97IStdae9fP90D84NlSJ.jpg",
               "id": 141450,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Jack",
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d87f",
               "name": "William Zabka",
               "profile_path": "/kHcFbjmtF3CPK8uIDzKh5aj2bUv.jpg",
               "id": 56124,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Mr. Froeger",
               "gender": 2,
               "credit_id": "53c231ffc3a3684cdf007929",
               "name": "Paul Bartel",
               "profile_path": "/7Kj1Y9V8lfnFXHkjf30H8d3ylQA.jpg",
               "id": 101377,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Mrs. Froeger",
               "gender": 1,
               "credit_id": "53c2320ec3a3684ce9007ee4",
               "name": "Cynthia Szigeti",
               "profile_path": null,
               "id": 45392,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "The Bike Rider",
               "gender": 2,
               "credit_id": "53c23233c3a3687e5900772c",
               "name": "Eric Idle",
               "profile_path": "/8bIEjD3ZNRdveo6avslTX6PB22U.jpg",
               "id": 10713,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Man in the Bathroom",
               "gender": 2,
               "credit_id": "53c23248c3a3684cef007f67",
               "name": "Robbie Coltrane",
               "profile_path": "/u07QKPs7wvXxzjXi1UUBSGjjmQm.jpg",
               "id": 1923,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Kent",
               "gender": 2,
               "credit_id": "54e1b415c3a368087b0011b5",
               "name": "John Astin",
               "profile_path": "/2b0Iv7mg0kTnyH4ZU0ajk2e0wYL.jpg",
               "id": 41230,
               "order": 10
            },
            {
               "cast_id": 18,
               "character": "Announcer at Court",
               "gender": 0,
               "credit_id": "54e1b42c9251411950006eba",
               "name": "Angus MacKay",
               "profile_path": null,
               "id": 1230681,
               "order": 11
            },
            {
               "cast_id": 19,
               "character": "Hotel Desk Clerk",
               "gender": 2,
               "credit_id": "54e1b440c3a3684541007fef",
               "name": "Jacques Herlin",
               "profile_path": "/ztGRlFmz3GEIWpNb9uIX7TtAiFF.jpg",
               "id": 6784,
               "order": 12
            },
            {
               "cast_id": 20,
               "character": "Hotel's Assistant Manager",
               "gender": 2,
               "credit_id": "54e1b450c3a3684541007ff2",
               "name": "Jacques Maury",
               "profile_path": null,
               "id": 34588,
               "order": 13
            },
            {
               "cast_id": 21,
               "character": "Fritz Spritz",
               "gender": 2,
               "credit_id": "54e1b465c3a36857560054ab",
               "name": "Willy Millowitsch",
               "profile_path": null,
               "id": 46234,
               "order": 14
            },
            {
               "cast_id": 22,
               "character": "Helga Spritz",
               "gender": 0,
               "credit_id": "54e1b477925141195a006a8e",
               "name": "Erika Wackernagel",
               "profile_path": null,
               "id": 23566,
               "order": 15
            },
            {
               "cast_id": 23,
               "character": "Rusty's German Girl",
               "gender": 1,
               "credit_id": "54e1b488c3a368454b00688e",
               "name": "Claudia Neidig",
               "profile_path": null,
               "id": 1427785,
               "order": 16
            },
            {
               "cast_id": 24,
               "character": "Prince Charles",
               "gender": 0,
               "credit_id": "560d44d7c3a3686810009768",
               "name": "Peter Hugo",
               "profile_path": null,
               "id": 1267471,
               "order": 17
            },
            {
               "cast_id": 25,
               "character": "Rusty's California Girl",
               "gender": 0,
               "credit_id": "560d456ec3a3686824008b15",
               "name": "Moon Unit Zappa",
               "profile_path": "/g6y0u0G7wV1mbZqix3alTAjrBfX.jpg",
               "id": 140387,
               "order": 18
            },
            {
               "cast_id": 26,
               "character": "Mrs. Garland",
               "gender": 1,
               "credit_id": "588e174c925141184200bf1b",
               "name": "Elizabeth Arlen",
               "profile_path": "/tYaDJk3oNI2zey4UOi1fN9oA54T.jpg",
               "id": 1564336,
               "order": 19
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d851",
               "name": "John Hughes",
               "profile_path": "/dFVgYYRY1R0aUCYvfEah00Iwzlt.jpg",
               "id": 11505,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d857",
               "name": "Matty Simmons",
               "profile_path": null,
               "id": 69342,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d85d",
               "name": "Pembroke J. Herring",
               "profile_path": null,
               "id": 1531,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe443c9251416c7502d86b",
               "name": "Amy Heckerling",
               "profile_path": "/c68tZT9Be1triBbKmSOKCS3dsBI.jpg",
               "id": 57434,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d871",
               "name": "Charles Fox",
               "profile_path": null,
               "id": 50239,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe443c9251416c7502d877",
               "name": "Robert Paynter",
               "profile_path": null,
               "id": 14456,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 9.422229,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11418,
      "vote_count": 280,
      "budget": 0,
      "overview": "The Griswalds win a vacation to Europe on a game show, and thus pack their bags for the continent. They do their best to catch the flavor of Europe, but they just don't know how to be be good tourists. Besides, they have trouble taking holidays in countries where they CAN speak the language.",
      "similar": [
         634,
         10735,
         314385,
         1581,
         858,
         6637,
         1281,
         118,
         112160,
         437557,
         122906,
         433,
         44683,
         43923,
         455,
         2252,
         1562,
         866,
         141,
         242224
      ],
      "original_title": "National Lampoon's European Vacation",
      "runtime": 95,
      "poster_path": "/QbyzCI54hvCIwt1SQEsq7a6rp8.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1985-07-25",
      "vote_average": 6,
      "belongs_to_collection": {
         "backdrop_path": "/pBmhj6KkEjlzc3e7jAPkIHgGIrE.jpg",
         "name": "National Lampoon's Vacation Collection",
         "id": 108693,
         "poster_path": "/zvEUkLpDO7xlgabBEA9CCc0cvAt.jpg"
      },
      "tagline": "For over two thousand years, Europe has survived many great disasters. Now for the real test. Chevy Chase & his family are coming from America!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Amy Heckerling"],
      "runtime": 95,
      "synopsis": null,
      "writers": [
         "John Hughes",
         "John Hughes"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089670/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU2Nzg1ODM0MF5BMl5BanBnXkFtZTcwMTM5OTMyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Chevy Chase, Beverly D'Angelo, Dana Hill | See full cast and crew »"],
      "reviews": [
         "OK, was this the best Vacation sequel? No, not really. But it still had a great amount of a laughter. I can't believe that some people really didn't like this film. Don't you have moments where you just want to sit down and laugh? Don't think, just laugh and have a good time with the film? The Griswalds are back and they are in Europe! They have won an excellent trip to London, Paris, Germany(they don't state where), and Rome. Of course they do manage to get into trouble, otherwise it wouldn't be a comedy. Clark still has the \"father-knows-best\" policy and becomes more obsessed with having a good time with the family than listening to them and their ideas. Ellen has become a famous naked model in Europe because of some undeleted footage that was stolen from Clark on his camera. Rusty is opting for a lot of booty in Europe and Audrey just won't shut up about a not all that boyfriend, Jack. This movie has non-stop laughter that you have to admit is catchy. They did recycle some jokes from the first, but I think you need to let go and have some fun. This was an enjoyable film. 7/10",
         "I'm surprised by all the negative comments - this was the first National Lampoon movie I saw, so I came to it fresh. OK, so it's not a great work of art, but I thought it was side-splittingly funny in places, and cleverly parodies all the national stereotypes that people tend to use. As a great fan of visual humour, my favourite moment in the film has to be the scene where, having had all their clothes stolen, the family go shopping in a boutique in Italy and emerge on to the street dressed in absurdly over-the-top designer creations. It really is one of the funniest sights I have ever seen in a film. I defy anyone with a sense of humour not to laugh.",
         "The Griswold's (mis-spelled here as Griswald) European Tour is far inferior to their cross-country trek to Walley World. First time around Clark had a goal, a destination, and pay-off for the audience when he finally got there. Second time around he's just wandering aimlessly from country to country, and it doesn't make for great entertainment I'm afraid. The Griswold's win the grand prize in a humiliating TV show called 'Pig in a Poke' and are sent to England, France, Germany, and Italy on an all expenses paid trip. The bulk of the humor is a scatter-shot approach to comedy that abuses tired clichés and cultural stereotypes for quick, easy, cheap laughs. Director Amy Heckerling may have used the first Vacation as a reference, but she doesn't have the control over the film that Harold Ramis did, and frequently allows the actors to ad-lib with the assumption that whatever they do might be funny. Even comedy actors need direction, and Heckerling's poor effort ruins many scenes that had potential. Even her camera placing and angles seem awkward and unbalanced. The grainy, low-key photography is also completely inappropriate for a film featuring such a wide range of scenery. Her use of stock footage is bad too (a shot of the Statue of Liberty shows no Twin Towers of the WTC, which were built in 1972!), and heightens the slapdash nature of the production. A few scenes seem to be edited out of order too, which leads me to believe that the script flowed a little differently before being rewritten (Clark leaves the London hotel, moves literally five feet down the street, then asks for directions back to the hotel). John Hughes' influence on the script was obviously minimum. Vacation and Christmas Vacation were ficionalised accounts of his own family's experiences. But European Vacation feels like a quick cash-in on the original's success, and co-writer Robert Klane doesn't know how to inject the pathos and satire that was so easy for Hughes. The European trip is definitely lagging far behind Walley World, Christmas and Las Vegas. A better director and a tighter script would have saved it. But Chase is as watchable as ever, and the only reason to sit through this poorly-made drivel.",
         "I had always thought that \"European Vacation\" was much funnier than the original \"Vacation\", until just recently. I watched both films back-to-back and in the end I've got to concede that I like the original \"Vacation\" more than it's sequel. I think the two films are equally funny, but the first one has a little more originality to it and a slightly better cast. Don't get me wrong though, \"European Vacation\" IS a funny movie and a very good sequel, but just not as good as the original. Chevy Chase and Beverly D'Angelo of course, play the parts of Clarke and Ellen Griswold (although spelled \"Griswald\" in this film for whatever reason) perfectly. The parts of Rusty and Audrey Griswold were re-cast (for whatever reason) with Jason Lively and Dana Hill. I thought Jason Lively was a fine replacement for Anthony Michael Hall, and even slightly resembles him. Although, I was less than impressed with Dana Hill. Not that she did a bad job acting, but more that her character seemed quite different and didn't resemble the original Audrey (Dana Barron) at all. It was nice to see both Eric Idle and Robbie Coltrane in the film (both playing very small roles). \"European Vacation\" was a good film and a nice sequel, but still not as good as the original. Although, I would strongly recommend you take a look at this film if you liked the original or just like Chevy/Beverly. Chevy Chase is great, as is Beverly D'Angelo, both make the film well worth the time I put in watching it and I hope they'll make your time worth it as well. Thanks for reading, -LebowskiT1000",
         "I don't understand why people don't like this movie so much. Chevy Chase is there, Beverly D'Angelo is there, Eric Idle is there which is great. Sure, I'd rather see Anthony Michael Hall rather than Jason Lively, but even that's alright, Lively does a decent job. I don't care if people hate this movie, I'm sticking by my beliefs, and I say this movie is great.",
         "I picked this up as a Dana Hill fan, and found it rather depressing. Those who blame the actors for this turkey aren't being fair; the actors to blame are those who could have killed the script - Chevy Chase and possibly Beverly D'Angelo. Simply put, the material isn't funny. A lot of it is stupid physical comedy, lame jokes and stuff that I wonder why anyone thought was funny, and way too much of the last. (The flight scene in Germany, and subsequent train trip, for example). And they should have gone all the way with the dog, like in UHF. There are some briefly funny parts in the movie, most of which were the family trying to communicate who didn't speak their language. Eric Idle added a slighly Monty Pythonesque note to the movie, which I found out of place, but was slighly funny. I'm not to usually blink at vulgarity and nudity, but \"Ich weiss nicht doch\" is not \"Beats the s**t out of me\" (the mandatory subtitle) and obsenity is out of character for that particular character. (It's closer to \"I really don't know\".) There are a number of instances of topless nudity and sex jokes, which would be better excused if they were funny. If you're looking for a better Dana Hill comedy then European Vacation, I suggest Combat High; if you're looking for a better Vacation movie, Christmas Vacation (my favorite) or the original Vacation are better; Vegas Vacation was a failure.",
         "`Pig in a Poke' is the newest game show in the US. Families dress up in pig costumes and answer questions. At the end, they can be pigs and win a great prize. And who's starring on it? Why, none other than our favorite family the Griswalds (spelled differently in this one than the others)! After a close competition with resident champions the Froegers, they win a European vacation. Audrey (Dana Hill) doesn't want to leave behind her boyfriend Jack (William Zabka), and Rusty (Jason Lively) just doesn't want to go. They do, reluctantly, but this two week vacation doesn't go without a hitch. 2nd released in the series, and usually considered least of the series, which I go with. Simply, it's not as funny as the others: Vacation, Christmas Vacation, and Vegas Vacation. It tries to be more raucous and irreverent than the others. It doesn't have a central grasp on any one plot. They go across Europe, but there's nothing that connects all of the destinations. For instance, in Vacation there was Aunt Edna; Christmas Vacation, it actually had a real plot, and in Vegas Vacation there were a few subplots, but they all went through. All that isn't to say that it wasn't funny, it's just not as funny as the other three. As heard from Chevy Chase on the subpar DVD commentary, he wishes to do another Vacation movie. I would like to see that. Many of the laughs came from slapstick and pratfalls, which aren't my favorite types of humor. Some of them were predictable (they go to Stonehenge\u0085guess what?), but some of the gags (like on the train to Rome) were nice. The MPAA wrongly gave this movie its PG-13 rating. It most definitely should have been rated R. The writers, which include veteran John Hughes, must have tried to keep the humor in the PG-13 range, because they didn't `rough it up' as much as they wanted to. One last thought: if there was an earlier movie version of Chicago, Beverly D'Angelo would have been perfect as Roxie. My rating: 6/10 Rated PG-13 for sustained scenes of nudity, sexual situations, teen drinking and language.",
         "Although it's not as good as the first film, this sequel isn't as terrible as I've heard people say. There are some very funny moments and this is Chevy Chase's best screen role. The only thing that's ever really bothered me about the Vacation films is that the Griswold's children are always played by different actors. Maybe I'm being picky, but I like continuity once in a while. There is a nice cameo from Eric Idle that was very funny and I liked the spoof of The Sound Of Music. Worth a watch.",
         "I have seen this movie many times and although it is nearly 20 years old, it still makes me laugh.Europe as experienced by an American family is very funny and even people who are offended by the so-called lack of respect towards the old continent, should agree that the typical characteristics of the English, French, Germans and Austrians are true to life, although admittedly slightly exaggerated.It's an unpretentious movie which aims at offering a better form of slapstick. Chevy Chase with his mixture of good intentions and bewilderment is always hilarious. One good piece of advice: NEVER go to Austria and watch the guys doing those typical male dances in their short leather pants.After having seen this movie, you will be subjected to hysterical laughter!",
         "`European Vacation' Some Spoilers `European Vacation' is the first of three sequels to the 1981 comedy `National Lampoon's Vacation,' or just plain `Vacation.' The first film chronicled the events in the life of Clark W. Griswold, Jr., and how he tried to get to Walley World with his family. Now, the cast is back (well, Chevy Chase and D'Angelo, at least), for a sequel that is familiar to the first, but nowhere near as funny. After winning a prize on John Astin's `Pig in a Poke' gameshow, Clark Griswald (spelled with an `a' in this film instead of an `o') and family head out for a tour of Europe, which includes backing into Stonehenge (we saw it coming), driving on the wrong side of the road, getting trapped in the Big Ben roundabout, and a running gag about battered tourist Eric Idle, whom Clark runs over, punches, slaps, runs over again, etc\u0085 It's odd how the humor changed in these films. The first, written by John Hughes, was not exactly slapstick but just funny. Same for the second. And then, the third, `Christmas Vacation,' also written by Hughes, did a 180. The humor in it was completely different from the first; anyone who disliked the first would probably love `Christmas\u0085' And then there was `Vegas Vacation,' which was the most underrated sequel. However, I think the WORST sequel is `European\u0085' Many of the jokes fall flat. Let's face it. And the kids\u0085 Jason Lively is decent as Rusty, but the girl who played Audrey is one of the most annoying child actors I have ever seen. Chevy Chase seems the most held back from all his other `Vacation' films. Clark just doesn't seem like Clark all the time. Beverly D'Angelo is about the same as she usually is: there's no complaining from me on her account. But most of those things account for how bad the film is; HOWEVER, I have a theory of why it is so underrated\u0085 You have to have lived in Europe to understand many of the in-jokes and gags. If you haven't, you just won't get half of them. I have lived in Europe around seven years before, and I must say that many of the jokes were for those that have either toured or lived in Europe for an amount of time. John Hughes is listed as writing this film, but actually, he didn't. He got credit for co-writing because he created the characters. I just thought I should make that point since many people don't. If you don't believe me, read: www.geocities.com/johnsmovieportal2003/hughesinterview. John Hughes says: `I didn't write them! I swear!' in regards to the `European' and `Vegas' films. All in all, I have to tell you that `European Vacation' was a major blow to the series, mainly because it failed on all levels we expect from a `Vacation' film. However, when the credits rolled, I still got that same distinct feeling I got when the other films were over: a bit of relief and sadness. I'm not sure why, to tell you the truth. It's something about the way they play the credits. I think it's just because I like the `Vacation' films so much that no matter how bad one of them is, the others are so good it makes me happy. So, yes, it's not a great movie, but it's not a horrible movie, either. I'm glad I watched it. It's the worst of the series, but not an awful movie in any aspects. 3/5 stars \u0096 maybe 2.5 on a lesser day - John Ulmer"
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["Warner Bros."],
      "summaries": [
         "The Griswolds win a vacation to Europe on a game show, and thus pack their bags for the continent. They do their best to catch the flavor of Europe, but they just don't know how to be be good tourists. Besides, they have trouble taking holidays in countries where they CAN speak the language...",
         "In a game show called \"Pig In A Poke,\" the Griswold family -- Clark, Ellen, Rusty, and Audrey -- accidentally wins a trip to Europe, winning against a family that had previously never been defeated on this game show, which is hosted by Kent Winkdale. Just before the trip, Clark makes an erotic videotape of Ellen, promising to erase the tape later. Clark likes the game show's itinerary of what they are scheduled to do in Europe, but Ellen and the kids don't feel the same way. They begin their trip to Europe in London, England, where they stay in a ratty hotel. Clark has problems learning how to drive European cars, which have the steering wheel on the right side instead of the left. In London, the Griswolds see things like Big Ben, Parliament, and Buckingham Palace repeatedly because Clark cannot figure out how to exit a circular \"roundabout\" intersection. Audrey misses her boyfriend Jack so much that she wants to go back to Chicago. Clark is oblivious to how his family feels as he takes the family to see places such as Stonehenge, which Clark accidentally knocks down by backing a rented car into it. The trip to Europe then moves from London to Paris, France, where Clark has a Frenchman use the camcorder to tape the Griswolds near a water fountain, but the Frenchman steals the camera, with a videotape inside of it. In Paris, the Griswolds visit the Eiffel tower. The hotel room they check into in Paris is better than the one they had in London. The Griswolds visit the Musée du Louvre, then Audrey gets a letter from Jack, saying that Jack has been seeing Audrey's best friend Debbie while Audrey is in Europe. The next stop for the Griswolds is Germany, to visit their long-lost relatives Fritz and Helga, but they end up at the wrong house and mistake this house's residents for their relatives. Nevertheless, they have a nice visit. Next, the Griswolds visit a festival where Clark joins in on some German dancing that he has no idea how to do. Not surprisingly, the dancing ends with a fistfight. The Griswolds get on a train to Rome, Italy, but on the way there, they get off the train to go to the traveler's-check office, but they are greeted by a pair of men who they don't know are robbing the place. After getting $3,000 from the place, the Griswolds get a car from the same two men, who have placed the clerk in the trunk of the car. The Griswolds make their way into Rome, where they buy new clothes and Ellen sees a picture of herself on a billboard -- the thief who stole their video camera has been selling copies of the erotic tape of Ellen, which Clark forgot to erase, and Ellen is livid. The two thieves who robbed the traveler's-check office show up in Rome, and one of them, who has fallen for Ellen, kidnaps her. Audrey sees them leaving, and Audrey and Clark set off to rescue Ellen.",
         "In a game show, the family Griswold wins a trip to Europe. They set out for Britain, France, Germany and Italy, ignorant to the damage they do to other people: In Britain Clark has slight problems adapting to driving on the left side, runs several people over and accidentally knocks over Stonehenge in reverse gear. In Germany, they visit the wrong relatives and are chased by angry 'Schuhplattl' dancers. Finally, in Rome, they unknowingly help robbers in a hold-up and then Ellen gets kidnapped... simple jokes, always following the same scheme.",
         "When the Griswolds accidentally win the grand prize on the \"Pig in a poke\" TV show, a trip to Europe for all of them, they happily decide to go. But the family's name would not be Griswold if everything went without complication. In London, they see Big Ben and Parliament extensively, but only after Clark learned to drive on the left side by not doing so; in Paris, Rusty's hormones disastrously spring to live; in Germany, the Griswolds visit the wrong relatives and in Italy, the family gets in touch with crime and a videotape that was in the camera that was stolen back in Paris. In addition, Audrey, who is in love with less-caring beau Jack, keeps ringing up the phone bill, Rusty keeps hitting on girls and Ellen keeps keeping them all together when times are bad.",
         "The Griswolds win a vacation tour across Europe where the usual havoc ensues."
      ],
      "budget": 0
   },
   "movielensId": 2794,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-07-25",
      "dvdReleaseDate": "2002-04-02",
      "directors": ["Amy Heckerling"],
      "runtime": 95,
      "movieId": 2794,
      "title": "National Lampoon's European Vacation",
      "mpaa": "PG-13",
      "actors": [
         "Chevy Chase",
         "Beverly D'Angelo",
         "Dana Hill",
         "Jason Lively",
         "Mel Smith",
         "William Zabka",
         "Paul Bartel",
         "Cynthia Szigeti",
         "Eric Idle",
         "Robbie Coltrane",
         "John Astin",
         "Angus MacKay",
         "Jacques Herlin",
         "Jacques Maury",
         "Willy Millowitsch",
         "Erika Wackernagel",
         "Claudia Neidig",
         "Peter Hugo",
         "Moon Unit Zappa",
         "Elizabeth Arlen"
      ],
      "imdbMovieId": "0089670",
      "originalTitle": "National Lampoon's European Vacation",
      "genres": [
         "Adventure",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["vbF_7TiG5bg"],
      "plotSummary": "The Griswalds win a vacation to Europe on a game show, and thus pack their bags for the continent. They do their best to catch the flavor of Europe, but they just don't know how to be be good tourists. Besides, they have trouble taking holidays in countries where they CAN speak the language.",
      "tmdbMovieId": 11418,
      "avgRating": 2.96991,
      "releaseYear": "1985",
      "numRatings": 3672,
      "posterPath": "/QbyzCI54hvCIwt1SQEsq7a6rp8.jpg"
   }
}