{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "slapstick",
            "id": 9253
         },
         {
            "name": "city country contrast",
            "id": 9821
         }
      ],
      "imdb_id": "tt0095188",
      "video": false,
      "title": "Funny Farm",
      "recommendations": [
         18509,
         14628,
         9749,
         11418,
         16471,
         9080,
         11933,
         28117,
         29739,
         16806,
         2617,
         15596,
         11718,
         11419,
         26261,
         16384,
         11310,
         9941,
         13105,
         13766
      ],
      "backdrop_path": "/23oyxeSnhmTI7zdnCINdJTte3uO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Andy Farmer",
               "gender": 2,
               "credit_id": "52fe45d39251416c75063d49",
               "name": "Chevy Chase",
               "profile_path": "/svjpyYtPwtjvRxX9IZnOmOkhDOt.jpg",
               "id": 54812,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Elizabeth Farmer",
               "gender": 1,
               "credit_id": "52fe45d39251416c75063d4d",
               "name": "Madolyn Smith Osborne",
               "profile_path": "/589nvAruYaM7B5m1Y6ntKhNbATw.jpg",
               "id": 66079,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sheriff Ledbetter",
               "gender": 2,
               "credit_id": "52fe45d39251416c75063d51",
               "name": "Kevin O'Morrison",
               "profile_path": "/c8ClQUJKGxWUNM9tHjmgGuJf1Mx.jpg",
               "id": 77022,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Michael Sinclair",
               "gender": 2,
               "credit_id": "52fe45d39251416c75063d55",
               "name": "Joseph Maher",
               "profile_path": "/hgq8vDtBsk0ovVxRJHkAyXzTVth.jpg",
               "id": 20626,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Bud Culbertson",
               "gender": 2,
               "credit_id": "52fe45d39251416c75063d59",
               "name": "Jack Gilpin",
               "profile_path": "/cYaMYTd4TawSeF9eUSwXR1rP3th.jpg",
               "id": 77023,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Betsy Culbertson",
               "gender": 1,
               "credit_id": "52fe45d39251416c75063d5d",
               "name": "Caris Corfman",
               "profile_path": null,
               "id": 77024,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Newspaper Editor",
               "gender": 0,
               "credit_id": "52fe45d39251416c75063d61",
               "name": "William Severs",
               "profile_path": null,
               "id": 77025,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Crocker",
               "gender": 2,
               "credit_id": "52fe45d39251416c75063d65",
               "name": "Mike Starr",
               "profile_path": "/9JrAo8iPqaLk4SrxMNq1sKHeKaK.jpg",
               "id": 5170,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Mickey",
               "gender": 2,
               "credit_id": "52fe45d39251416c75063d69",
               "name": "Glenn Plummer",
               "profile_path": "/esZnjqw2WRA7zaX8SbJKGMp1xBg.jpg",
               "id": 2683,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Old Character",
               "gender": 2,
               "credit_id": "52fe45d49251416c75063d6d",
               "name": "William Duell",
               "profile_path": "/1X6Qj2BQyy6QniGx0P73t18UxRk.jpg",
               "id": 7079,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Old Operator",
               "gender": 0,
               "credit_id": "52fe45d49251416c75063d71",
               "name": "Helen Lloyd Breed",
               "profile_path": null,
               "id": 49821,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Young Operator",
               "gender": 0,
               "credit_id": "52fe45d49251416c75063d75",
               "name": "Kit Le Fever",
               "profile_path": null,
               "id": 77026,
               "order": 11
            },
            {
               "cast_id": 13,
               "character": "Marion Corey Jr.",
               "gender": 2,
               "credit_id": "52fe45d49251416c75063d79",
               "name": "Dakin Matthews",
               "profile_path": "/tP63g4n8HPOUubsqUN8xZfXantn.jpg",
               "id": 43364,
               "order": 12
            },
            {
               "cast_id": 14,
               "character": "Gus Lotterhand",
               "gender": 2,
               "credit_id": "52fe45d49251416c75063d7d",
               "name": "William Newman",
               "profile_path": "/tSFsRnK1jfCc50yinO5MpFnJL3c.jpg",
               "id": 77027,
               "order": 13
            },
            {
               "cast_id": 15,
               "character": "Mrs. Ethel Dinges",
               "gender": 1,
               "credit_id": "52fe45d49251416c75063d81",
               "name": "Alice Drummond",
               "profile_path": "/f1O8suDhVloKdPvhyltj017SPTo.jpg",
               "id": 17488,
               "order": 14
            },
            {
               "cast_id": 17,
               "character": "Crum Petree, the Mailman",
               "gender": 2,
               "credit_id": "568db5f49251416b52000be0",
               "name": "Kevin Conway",
               "profile_path": "/803hyktASensafHsdvDCnlzWK8k.jpg",
               "id": 27116,
               "order": 15
            },
            {
               "cast_id": 29,
               "character": "Elizabeth's Student (scenes deleted)",
               "gender": 1,
               "credit_id": "5a0772d2c3a368334400496f",
               "name": "Sarah Michelle Gellar",
               "profile_path": "/gCX6MburZMncZrqGh6niLofn7nb.jpg",
               "id": 11863,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45d49251416c75063d87",
               "name": "George Roy Hill",
               "profile_path": "/p2CQkWZo3AXFPQ9gussyEC3BEPh.jpg",
               "id": 9577,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "58083c97c3a3687332002be3",
               "name": "Elmer Bernstein",
               "profile_path": "/3H3AqKesJnkwJzWFJY9hyFwci5m.jpg",
               "id": 7182,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "58083c9f925141033e003416",
               "name": "Bruce Bodner",
               "profile_path": null,
               "id": 26980,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "58083ca792514105ea0032d7",
               "name": "Robert Crawford Jr.",
               "profile_path": null,
               "id": 57139,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "58083cbb9251410f57002f77",
               "name": "Patrick Kelley",
               "profile_path": null,
               "id": 1412008,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58083cc99251410d8e003043",
               "name": "Alan Heim",
               "profile_path": null,
               "id": 853,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "58083cd1c3a3687332002c06",
               "name": "Marion Dougherty",
               "profile_path": "/vHUj1WzotNrj9PTT6wJ1yhhULbD.jpg",
               "id": 3806,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "58083cd9c3a36874ea002a8c",
               "name": "Henry Bumstead",
               "profile_path": "/hmJBS9jdH5q5PrEsF3K48Gumhug.jpg",
               "id": 369,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58083cdfc3a36874ea002a92",
               "name": "James W. Payne",
               "profile_path": null,
               "id": 14826,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "58083cf0c3a368752b002db7",
               "name": "Ann Roth",
               "profile_path": "/cT4EtdqvG0Yq4EQ3LASXiwyndYi.jpg",
               "id": 5493,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "58dd7d45c3a3685153000179",
               "name": "Miroslav Ondříček",
               "profile_path": null,
               "id": 4008,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 6.300846,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14170,
      "vote_count": 83,
      "budget": 0,
      "overview": "Chevy Chase stars as Andy Farmer, a sportswriter who moves with his schoolteacher wife Elizabeth (Madolyn Smith) to the country in order to write a novel in relative seclusion. Of course, seclusion is the last thing the Farmers find in the small, eccentric town, where disaster awaits them at every turn.",
      "similar": [
         3082,
         87818,
         9530,
         28333,
         19133,
         13161,
         11576,
         2022,
         992,
         10098,
         3063,
         936,
         400028,
         11937,
         6283,
         20678,
         115210,
         23988,
         27601,
         10970
      ],
      "original_title": "Funny Farm",
      "runtime": 101,
      "poster_path": "/tW6LGDEZrJpLbvEGkHk51MyQqJC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
         "name": "Warner Bros. Pictures",
         "id": 174,
         "origin_country": "US"
      }],
      "release_date": "1988-06-03",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Chevy Chase finds life in the country isn't what it's cracked up to be!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George Roy Hill"],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Jay Cronley",
         "Jeffrey Boam"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095188/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwNTEwMzYyNV5BMl5BanBnXkFtZTcwNjY1MjMyMQ@@._V1_SY317_CR7,0,214,317_AL_.jpg",
      "actors": ["Stars: Chevy Chase, Madolyn Smith Osborne, Kevin O'Morrison | See full cast and crew »"],
      "reviews": [
         "I realize that comedy is subjective and things that I think are funny others may not think is too funny. But I am dumbstruck at some of the negative reviews for \"Funny Farm.\" Far and away this is Chevy's best film. I think the screenplay is beautifully written with so many small touches of humor hidden within a scene that to list them would take forever. I will agree that the last act takes a bit of a wide turn in reality but it doesn't stray so far that the film goes off track. The main story is your typical fish out of water story but what person can't identify with Chase's Andy Farmer in one way or another? Of course the film takes it to the extreme and it's all the funnier for it. And the characters are a biting reminder that not everyone is normal or sane for that matter. The waitress who serves lamb fries without explaining what that really is until it is desperately too late. The sheriff who has to take a cab because he flunked his driver's test. The mailman who throws the mail to the road because he is drunk by the time he reaches the Farmer's residence. And the small touches? How about the dog that runs away from home just after being brought home for the first time? Or the umpire whose strike zone is a bit wide. The odd fate of Claude Musselman? And let's not forget the phone operator who can tell the sound of two pennies being dropped in a jar but fails to realize it's not a pay phone Chase is calling from? I laughed hard and often which is something odd for me in any film with Chevy Chase. In all the years with all of his films I can honestly say I have only enjoyed five of them (Foul Play, Vacation, Fletch, Christmas Vacation and this one. That's right I am not a fan of Caddyshack)and this is his best. One more small moment sums up the film's humor for me. Chase is fishing with some men he has just met. One of them men gets a hook stuck in his neck. Instead of trying to pull it out Chase thinks it easier to knock the man out so THEN they can pull the hook out. After punching the man three times in the face one of the other men finally steps in and says \"You're not knocking him out, you're only beating the p*ss out of him.\"",
         "This movie is funny. I don't know why it has such low ratings. I like the sarcasm involved in having a married couple from the city moving out to a farm. This is a movie that I recommend to anyone who wishes to have a few laughs watching Chevy Chase and his superb timing for acting in comedies such as this one.",
         "Now, admittedly, I saw this during a period of my life when I believed Chevy Chase could do no wrong but even so, this is one that holds up, and was unfairly lambasted by the critics. From the ads (if you can even remember that far back!) this looked like it was just going to be a \"Vacation\" rip-off, sort of \"The Griswolds Move To the Country.\" Believe me, the humor in this film is much slyer and more charming than anything in the Vacation pictures (of which the first one was solid, the next two lame). The film is about a sportswriter (Chase) who quits his job in order to move out to the country with his wife (the wonderful Madolyn Smith) and write the Great American Novel. The movie details his gradual come uppance, as he realizes that neither country living nor his talent is all that it's cracked up to be. The film wonderfully skews the convention of the innocent country rubes moving to the big city and being overwhelmed by its meanness and craziness. Here, it's the cityfolk who move wide-eyed to the country - and are amazed to find there a roll call of crazies, misanthropes, and just plain wierdos. Does this view of country life have any basis in reality? Probably not, but then the film isn't really trying to be a satire but instead a pure lunatic comic fantasy. And it gives us a rich array of supporting characters - from the town sheriff who hasn't yet passed his driving test and so must ride around in cabs, to the owner of an antiques store whose merchandise are all personal. All these characters are priceless, and the film just keeps coming up with more and more of them - until it has created this pleasantly bizarre and warped Otherworld, of a kind that only comedy can truly provide. Best of all is the way in which Chase and Smith react to all of this and try to make some sense of it. I very clearly say \"Chase and Smith\" because the film belongs equally to both of them. It had to be billed as a Chevy Chase Comedy, of course, since he's the big star here, but this is no star trip; from the very first, the wife is made an equal partner in the trials and the laughs, and it's the way the two go through their new life together that provides much of the comedy. It also helps take the edge off of the usual Chevy Chase persona: in Funny Farm he's neither glib and disinterested (as in the Fletch movies) nor over the top silly (like in the Vacation movies). He comes across instead like a normal, personable guy who just finds himself caught in insane circumstances. Finally, the climactic sequence of the film is absolutely priceless - one of the most brilliantly sustained comic set-pieces you'll see in any movie, of any era. Funny Farm is the type of movie which gives you a great time and leaves you with a big, dopey grin on your face after it's all over. Trust me, even if you don't normally like Chevy Chase, you'll love Funny Farm.",
         "This is one of the best Chevy Chase comedies there is. The script in intelligent, his co star, Madolyn Smith, is wonderful and she and Chase have fantastic chemistry. The plot involves Andy and Elizabeth Farmer (get it?) who move from the city to small town Vermont so that he can write a book. They plan to start a family, but first, they have to get used to the eccentric people they are surrounded by. I have watched this movie at least a dozen times, and I still laugh out loud. We just bought the DVD (had the VHS but sold it a while back), and we're having fun introducing this hilarious movie to our kids. They love it too! This is a great, funny, sweet little film that more people should see.",
         "This is my favorite Chevy Chase film for several reasons. Here they are: 1.) I love the scenery in the movie--Vermont, four distinct seasons, gorgeous Cape Cod house. 2.) I love and can totally relate to the story line. When I first saw this movie, I was in college and playing tennis on the tennis team. We traveled to a city where EVERYTHING went wrong--and, the people were just plain weird. I saw this movie, and I totally empathized with Andrew and Elizabeth Farmer! 3.) The humor in this movie is not over the top as it is with some of Chevy Chase's other films--everything is believable, and it's all very funny. 4.) I want a yellow dog!!! The yellow labrador in this movie will make you want one of your own! My only complaint with this film: The DVD version is not in Widescreen, and there are no special features. But, for $5.88 in the Wal-Mart cheap bin, YOU CANNOT GO WRONG. This is an excellent movie to watch over and over again.",
         "While watching this movie, I realized that on several levels we live in a small town not much different from the Vermont one depicted. Our tourist town is located on a Channel Island in the Pacific, but the characters couldn't be more identical to those Chevy and wife deals with in the rural town they move to for serenity and quiet. Everyone tests their resolve to live in that community, and in failing to measure up to their standards, they are treated as outsiders. Once they understand the neighborhood peculiarities, everyone becomes acquainted, then accustomed to one another. While finding a common bond and learning to fit in, there is one silly misadventure after another. There are a lot of laughs in this movie that allow a person to stand back and realize that this is how small communities conduct themselves everywhere, and is a study in human behavior. Chevy's characters rarely make anything easy, which combined with a seemingly conservative personality has become his calling card.",
         "I wouldn't say this is one of Chevy Chase's best films, but this one still has some good things to offer. There is a fair amount of good laughs and an entertaining story, but not as great as some of Chevy's other credits. Chevy Chase does a fine job with his role, playing a very similar character to most of his other films. Chevy is good at what he does and doesn't seem to stray very far from what works. Madolyn Smith-Osborne is fantastic in the film, looking just gorgeous and playing her role very well. The only other actors that were familiar to me were the movers in the beginning of the film, Mike Starr and Glen Plummer. Both actors do a fine job, although very small roles in the film. If you are a fan of Chevy Chase, then I'd recommend seeing this film, you'll probably enjoy it. But, if Chevy Chase isn't your cup of tea, then this may not be the film for you. In any case, if you do see it, I hope you enjoy it. Thanks for reading, -Chris",
         "Chevy Chase is normally associated with the Caddyshack, Fletch and Vacation series meaning that his one-shot movies mostly fall by the wayside. Films like Spies Like Us, Nothing But Trouble and Funny Farm have went largely unseen since the advent of DVD in 1997. Neither of these movies have received widescreen releases and have been out of print for years. I was beginning to wonder what Warner had against giving them definitive releases until I discovered an HD master of Funny Farm on the PlayStation Network. I saw it only once, when I was about 9, and remembered very little. If you're a fan of Clark Griswold then Andy Farmer isn't too far removed. Andy is a sports journalist who retires from the big city to the Redbud, Vermont hoping to enjoy and idyllic, peaceful life and finally write the great, American novel (The Big Heist). When he gets there he and his wife discover that almost everyone and everything is weirder than the last. There are giant snakes in their pond, a dead body buried in their garden, a Sheriff who can't drive, a crazy mailman and a town who basically hate them. And top of all this Andy has severe writer's block while his wife manages to churn out a successful children's novel without really trying. With careful, measured direction from George Roy Hill (Butch Cassidy, The Sting) Funny Farm, based on a novel by Jay Cronley, manages to be a little classier than Chase's usual fare. This makes the lack of a home video version even more puzzling. It has never been released on DVD in the UK, and the 1989 VHS is long gone. If you have access to the PlayStation Network then go for it. I have a funny feeling that Funny Farm and Spies Like Us will probably be released as a Warner Blu Ray Double Feature in the near future, but nothing has been announced so far. Don't let the mistreatment of this film put you off, it lives up to it's title and is the perfect vehicle for Chevy Chase and his goofy humour.",
         "I think this movie has some classic lines by Chevy Chase and the town people, why this movie doesnt get talked about more, i dont know, i happened to laugh my head off at it, but of course i love chevy chase in about everything but invisible man and cops and robbersons",
         "Funny Farm is exactly what its title states. After Andy and Elizabeth move to Vermont from New York City, they hope for quite life while Andy works on his new career on being an author. Everything goes wrong. Their mailman is an alcoholic who throws the mail at them, their furniture gets lost along with the men driving it, and the writing career that Andy is hoping for falters. Andy and Elizabeth need a way out and the only way to do it is to con their way out by tricking a family into buying the place. Along the way Andy and Elizabeth must confront their marriage problems that are slowly starting to develop. The film is hilarious. Every scene with Andy results in him getting screwed, punched, or thrown in the lake. Andy is the one you look too for the comedy and Elizabeth as the set up girl. The film is meant to be more of a serious comedy but does break off into the goofy side, especially with Andy trying to stop the mailman and the whole sequence of them trying to sell the house. Chevy Chase as Andy is perfect. He is older, which is needed for the role. A man who is smart and easy to annoy. The scene with the 'lamb fry' (sheep balls) in the restaurant had me on the floor laughing. Madolyn Smith-Osborne is pretty funny and I wish she still acted today. She is the one ultimately getting Andy angry. This film is a true fish out of water story and doesn't disappoint. Just watch for the Norman Rockwell Christmas and the drunk mailman played by Kevin Conway. Funny Farm. Starring: Chevy Chase, Madolyn Smith-Osborne, Kevin Conway, and Kevin O'Morrison. 4 out of 5 Stars"
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Cornelius Productions",
         "Pan Arts",
         "Warner Bros."
      ],
      "summaries": [
         "When Andy and Elizabeth buy a farm in Vermont, they can't imagine the trouble that awaits them. Andy has quit his job as a sports journalist and is planning to use the peace and quiet of the country to write the Great American Novel. From the moment the movers' truck gets lost with their furniture, though, there's little peace and less quiet. From a manical mailman to a dead body buried in the garden, Andy is distracted by the town and its wacky inhabitants. His effort at a novel is mediocre, at best, and he's threatened by Elizabeth's foray into writing when she attempts a children's book. Can the Farmers survive the townsfolk and each other?",
         "Andy and Elizabeth are sick of life in the city, and decide to move to the country. Buying a home near a picturesque town, then soon discover (to their horror) that things are done differently in the country. They must deal with all of the local characters, the local animals, as well as any skeletons in the closet."
      ],
      "budget": 19000000
   },
   "movielensId": 2796,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-06-03",
      "dvdReleaseDate": "1999-05-18",
      "directors": ["George Roy Hill"],
      "runtime": 101,
      "movieId": 2796,
      "title": "Funny Farm",
      "mpaa": "PG",
      "actors": [
         "Chevy Chase",
         "Madolyn Smith Osborne",
         "Kevin O'Morrison",
         "Joseph Maher",
         "Jack Gilpin",
         "Caris Corfman",
         "William Severs",
         "Mike Starr",
         "Glenn Plummer",
         "William Duell",
         "Helen Lloyd Breed",
         "Kit Le Fever",
         "Dakin Matthews",
         "William Newman",
         "Alice Drummond",
         "Kevin Conway",
         "Sarah Michelle Gellar"
      ],
      "imdbMovieId": "0095188",
      "originalTitle": "Funny Farm",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["l4iw_hfBQqM"],
      "plotSummary": "Chevy Chase stars as Andy Farmer, a sportswriter who moves with his schoolteacher wife Elizabeth (Madolyn Smith) to the country in order to write a novel in relative seclusion. Of course, seclusion is the last thing the Farmers find in the small, eccentric town, where disaster awaits them at every turn.",
      "tmdbMovieId": 14170,
      "avgRating": 2.91017,
      "releaseYear": "1988",
      "numRatings": 1475,
      "posterPath": "/tW6LGDEZrJpLbvEGkHk51MyQqJC.jpg"
   }
}