{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0102719",
      "video": false,
      "title": "Problem Child 2",
      "recommendations": [
         11077,
         28601,
         11011,
         29739,
         17207,
         12139,
         15413,
         17745,
         9622,
         19087,
         10714,
         48232,
         34376,
         9356,
         18885,
         13154,
         11982,
         6280,
         23470,
         12120
      ],
      "backdrop_path": "/fjosUKj3GI9eeQIzXE6P55ANOcO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Ben Healy",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a4b",
               "name": "John Ritter",
               "profile_path": "/2WIkWe5UASXpZgLQ1pMTtHNJKJX.jpg",
               "id": 27772,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Junior Healy",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a4f",
               "name": "Michael Oliver",
               "profile_path": "/mM6oXybBauFBwZLlpD7A9Ou68sM.jpg",
               "id": 68209,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "'Big' Ben Healy",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a53",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Lawanda Dumore",
               "gender": 1,
               "credit_id": "52fe45a4c3a368484e066a57",
               "name": "Laraine Newman",
               "profile_path": "/ApYftBOqDMBnVColOQwXIodOt5s.jpg",
               "id": 35159,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Annie Young",
               "gender": 1,
               "credit_id": "52fe45a4c3a368484e066a5b",
               "name": "Amy Yasbeck",
               "profile_path": "/c7WOXDlKE9cwTBjpUtCKFPqnptr.jpg",
               "id": 1219,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Trixie Young",
               "gender": 1,
               "credit_id": "52fe45a4c3a368484e066a5f",
               "name": "Ivyann Schwan",
               "profile_path": "/1hHKPdh3AVck6Tla1MBX5pzYTPY.jpg",
               "id": 101277,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mr. Peabody",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a63",
               "name": "Gilbert Gottfried",
               "profile_path": "/cu15UEyL3wnUtTAF5KfuyxxjVzH.jpg",
               "id": 15832,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Smith",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a67",
               "name": "Paul Willson",
               "profile_path": "/qLDv3SgQw5dfai2wsH03PeFolBS.jpg",
               "id": 15099,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Aron Burger",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a6b",
               "name": "Alan Blumenfeld",
               "profile_path": "/2ag56MvKkTuhGnUFgJza4hJZl8u.jpg",
               "id": 22053,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Debbie Claukinski",
               "gender": 1,
               "credit_id": "52fe45a4c3a368484e066a6f",
               "name": "Charlene Tilton",
               "profile_path": "/jZwoQorUzQXTbwENKDCYPIbCGxl.jpg",
               "id": 21862,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Mr. Thron",
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a73",
               "name": "James Tolkan",
               "profile_path": "/mB9vHaDMzy5Z5pPWOliA6MJ3gTq.jpg",
               "id": 1072,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Alan White",
               "gender": 2,
               "credit_id": "581b04609251412ccf002af8",
               "name": "Kenneth Londoner",
               "profile_path": null,
               "id": 1666903,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a4c3a368484e066a79",
               "name": "Brian Levant",
               "profile_path": "/6fM0CJSEqwC50wivfx8Z7sPcikb.jpg",
               "id": 13581,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5835f407c3a36836a30010c9",
               "name": "Scott Alexander",
               "profile_path": "/2Zcnbxg4dLC0yRcv7NqcUrpZeCj.jpg",
               "id": 7130,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5835f45ac3a36836a60010a4",
               "name": "Larry Karaszewski",
               "profile_path": null,
               "id": 7131,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 7.606571,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28597,
      "vote_count": 141,
      "budget": 0,
      "overview": "Junior and his father, Ben, move from Cold River to Mortville. Junior becomes threatened by Ben's desire to date again and find a new mother for Junior, and sabotages each of his dates.",
      "similar": [],
      "original_title": "Problem Child 2",
      "runtime": 90,
      "poster_path": "/npr7j2HuRgvsKrXLIxIiXevTH8A.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Português",
            "iso_639_1": "pt"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/4PR5ZyqlDrMqx1h5PyOL4VRL70z.png",
            "name": "Imagine Entertainment",
            "id": 23,
            "origin_country": "US"
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1991-07-03",
      "vote_average": 5.2,
      "belongs_to_collection": {
         "backdrop_path": "/3qrIGlVQTi7Aps9IUm9vAep9C2W.jpg",
         "name": "Problem Child Collection",
         "id": 180854,
         "poster_path": "/aIWRqX5mJ9RPKox8sguNutPCiX8.jpg"
      },
      "tagline": "He’s bad. She’s worse.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Brian Levant"],
      "runtime": 90,
      "synopsis": "Like Problem Child only twoier!!!",
      "writers": [
         "Scott Alexander",
         "Larry Karaszewski"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102719/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3OTYwNTg3OF5BMl5BanBnXkFtZTcwNDc1NDMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: John Ritter, Michael Oliver, Jack Warden | See full cast and crew »"],
      "reviews": [
         "Okay, I saw this movie when I was like 8 for the first time and I loved it. Now i'm 15 and I still love it! What's so awful about about it? It's about this 8-year old kid named Junior Healy, he's bad. After leaving his hometown with his foster father Ben Healy they move to Mortville. Junior has a little problem at school, this little girl is making his life a living hell. His father meets the school nurse Annie who is basically a fox. But she shows no interest. Then he meets rich woman Lawanda Dumore, who is also a fox but is a scary witch and hates Junior. Junior then finds out that the girl who is tormenting him is Annie's daughter. So he tries to fix them up. Along the way him and the girl, Trixie, become friends. Now theyre trying to get there parents together and get rid of Lawanda. I love this movie! I give it ***½ out of *****!!",
         "I think this is good, but the first one is best. This one had no need to be a 2nd movie they could have been fine with just Problem child i think, but it was funny. The first one had meaning and feeling, to know what orphans go through and how they're treated, this one i don't feel very much, except an evil woman who is taking away the only person that ever loved him and he only married Lawanda because he thought she loved children and he found out she doesn't so he married Annie because she understands what he's going through and she will cope with him and plus Junior and Trixie were friends. Junior finds a friend someone who can actually relate to him, so i think it's a nice message that you can always find somebody who can relate to you and make you feel special. I find it's funny and good and doesn't deserve a vote of 3.1",
         "Although I would never give this movie a great review, I can't understand why the movie has been rated so poorly on IMDb. If I took a little time, I'm sure I could list hundreds of movies that are FAR worse. Instead, this movie should be seen as a silly little time-passer. Some, particularly kids and people who have a high tolerance for John Ritter, may actually like the movie. This CAN'T be said of horrible films like THEY SAVED HITLER'S BRAIN, ALPHAVILLE or CRACKING UP--3 infinitely worse movies that just popped into my head. PROBLEM CHILD 2 did NOT cause me to feel bored or nauseous--while this is NOT a glowing review, it certainly seems to me a good reason not to list this among the worst films ever made.",
         "I think there's a deeper level of comedy in this movie than the simple dumb jokes and pranks. Things like Junior's deadpan delivery of \"these people are dicks\" after meeting his new neighbours, his facial expressions and fist clenching whenever someone p***es him off, and his deadpan fake laughter when he gets his revenge. You never really know whether these kind of things are meant to convey the kid's evilness and be taken seriously within the context of the movie, or are just supposed to be completely ridiculous, which just makes them all the more hilarious, moreso than the more obvious actual jokes.",
         "Watch it for what it is; an entertaining sequel about a problem child who meets his perfect sidekick. The movie continues the misadventures of Junior Healy and how his stepfather, Ben Healy deals with him and his horrible attitude. But this time Junior is not alone; because his new cute female friend Trixie comes to his aid in order to stop Ben to marry Lawanda Dumore, a total witch. Join Junior, Trixie, Ben, 'Big Ben', and of course, Mr. Peabody in this entertaining and sometimes kitschy comedy. I had a good time watching this one when I was a kid and nowadays, I take it for what it is; an entertaining sequel with the typical American comedy characters from family movies. John Ritter as always is great. The man was an idol. Jack Warren also delivers a fine performance; R.I.P. Excellent actor. The problem children are also great and display a great chemistry between them. Mr. Peabody always delivers great laughs; the man can make you laugh only with his gestures. I will never forget the huge crap that the dog takes, the vomit on the roller-coaster, the infamous food fight, and some other hilarious scenes. Well, this is a mindless entertaining movie for children.",
         "The Problem child movies are very funny!John Ritter,Amy Yasbeck,and Jack Warden are all good in the films!The film has some of the more hilarious scenes ever and if you like comedy film with bratty kids then check this out!",
         "Be sure to check out my video review of this movie here: http://www.youtube.com/watch?v=GKX5QEiVync Everyone has their choice for \"worst movie they've ever seen.\" Some like to pick on Gigli or Battlefield Earth. Some pick on classics like Plan 9 From Outer Space. Ever since I was 14 I have been very vocal in saying that to me, it is Problem Child 2, and 9 years later, I feel the exact same way. It's not \"one of the worst,\" it's not just an expression. It is THE ACTUAL worst movie I have ever seen. How much farting, pooping, peeing, and puking can you put in a single movie? I don't need to see a dog take a dump that goes up to my waist! Why is it that I'm so hard on this filth? I have nothing against bathroom or gross-out humor. Heck, I like the American Pie movies. Having such an excess of it within 90 minutes is a bad idea, but the true tipping point is to do it with kids! Having little kids call each other sexual names (IMDb won't even let me post that word on here, yet here it is coming out of the mouths of 8 year olds. Think of the irony in that!) and urinate and puke on each other just makes the whole thing feel dirtier. Worst line in the movie: \"I guess I should fart in more people's offices.\" What other film has: urination into lemonade, dynamite sticks exploding toilets, a little boy filming his babysitter having sex and projecting it on the side of the house, and a little girl joking about scratching testicles? However, my absolute favorite moment has to be when the same little girl is on a carnival ride, says: \"I'm gonna puke,\" opens her mouth, and fake looking puke shoots straight out of her open mouth in a perfect 90 degree angle! The puking scene in Scary Movie 2 looked more real than that. I suppose the only redeeming element in the movie is Gilbert Gottfried. You get the impression that he didn't even have a script, but was just being his usual self. Too bad he has to act stupid while pizza gets thrown on him. You know what? Thinking about the movie this much has just made me have to go to the bathroom. Goodbye!",
         "This is a childhood favorite of mine. No I wasn't a problem child, but got enjoyment out of watching these kids run rampant. I just don't understand why it has gotten such a bad rating. Its not Oscar material, but it doesn't deserve a 3.3 either. I guess to each is own. There are some classic lines and stunts that are burned into my brain, make me laugh just thinking of it now. Granted I haven't seen this movie in 8 years, I still give it a 7 because it holds a special place in my movie watching experience as a kid with my sister. Line 9 Line 10 I don't understand why I have to make this 10 lines but I am wasting some space this was supposed to be a",
         "and nothing else. One of my friends bought the Problem Child Tantrum Pack (contains the first two \"Problem Child\"s in one disc), and we decided to watch the sequel because it was \"funnier\". There were many funny moments in the movie (the vomit scene, that's all I need to say.), Nippy the dog after eating CHOW DOWN, and numerous others. The movie is nothing but toilet humor, but it's hilarious. Other than the funny moments, though, this movie has little to offer. John Ritter annoys the crap out of me, because it sounds like he's reading out of a book. The man can't act in this one, sorry. Although I can't say if I would find the movie funny now...(we were blown when we watched it), it's a perfect movie for a rainy day...but nothing else. Don't expect Oscar material on this one, guys.",
         "Seriously! You've just got to see this movie to understand everything that is wrong with it. It came out during the time period where everybody was trying to make family movies that everyone could enjoy (The little rascals; Mr. Nanny, etc.) yet it lacked any charisma or enthusiasm. Every single character in the movie is driven by rage, with the exception of Trixie's mother, who shows only aggravation and weariness, possibly at the tired cliché's this movie enjoys. To put it simply, the biggest flaw in the film was not the acting, nor the filming, but most notably the writing. The lines we receive are reminiscent of Disney classics, although this film lacks the whole-heartedness IL' Walt managed to pull off. Junior's Dad, (John Ritter) makes you mad without even doing anything, simply because he allows Junior to run around unsupervised, and only gives him a stern warning when he tapes a 200-pound behemoth to a chalk board. Also, Junior's grandfather is particularly excruciating. For those of you who saw the first one, found it nauseating, and thus, did not see the second one, \"Big Ben Healy\" as he is referred to in this movie, is still a total douche. He basically barges into John Ritter's house uninvited, settles himself in Junior's room, even though he says that he hates Junior, and basically does nothing to accelerate the film's speed, or to support the film in any way. Rather, he ticks off the audience by being a lazy free loader. Finally, we are introduced to a wide variety of new characters, such as the smug, obnoxious, Trixie, who carries dynamite in her backpack, which she first lights, then hands, to Junior, who simply stares wide eyed at. Also, Gilbert Gottfried returns in this film, this time playing the obnoxious principal at Junior's new elementary school. If Gilbert Gottfried ain't enough to get the point across, I will put it simply: This film reeks! 2/10 stars, because the actor's convictions shine through the film, even though the script sucks."
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Universal Pictures",
         "Imagine Entertainment"
      ],
      "summaries": [
         "Junior's back in his first adventure since his last! Junior and Ben move to Mortville which seems like the perfect town to live in. The Healys have a nice new house--and Junior get's a cool new room! And young women have formed a line at Ben's door in order to get a piece of him (romantically). Ben does feel he should get remarried so Junior can have a mom, so while Junior adjusts to his new school which includes a little girl who's as bratty as Junior and a teenage brain-dead ignoramous bully in Junior's sixth grade class, Ben finds some dates, which Junior sends running for the hills, in the meantime Junior pulls his infamous tricks on people: blowing up barbecues, taping the bully to the chalkboard, videotaping his babysitter and her boyfriend having sex and broadcasting it for the whole neighborhood to see, same old same old. Meanwhile, Ben meets the gorgeous school nurse (after the school's satellite dish get's pushed on his head) and they, well he, believes it's love at first site, until he meets LaWanda Dumore, a greedy business women who wants to marry Ben and send Junior to boarding school--in Baghdad! So Junior and his new friend, Trixie, must get rid of LaWanda (any way possible!) to bring their parents together!",
         "Junior and his father, Ben, move from Cold River to Mortville. Junior becomes threatened by Ben's desire to date again and find a new mother for Junior, and sabotages each of his dates. Ben falls in love with Annie, the school nurse. However, Annie is the mother of Trixie - who is worse than Junior in his behavior and equally resents her mother dating again. Then Ben meets Lawanda, the richest woman in Mortville, who desires to marry Ben and send Junior to boarding school in Bagdad. And Ben now has to make the decision whether to continue to pursue Annie for love or marry Lawanda so Junior can have a mother."
      ],
      "budget": 15000000
   },
   "movielensId": 2799,
   "movielens": {
      "languages": [
         "English",
         "Italiano",
         "Português"
      ],
      "releaseDate": "1991-07-03",
      "dvdReleaseDate": "1991-12-05",
      "directors": ["Brian Levant"],
      "runtime": 90,
      "movieId": 2799,
      "title": "Problem Child 2",
      "mpaa": "PG-13",
      "actors": [
         "John Ritter",
         "Michael Oliver",
         "Jack Warden",
         "Laraine Newman",
         "Amy Yasbeck",
         "Ivyann Schwan",
         "Gilbert Gottfried",
         "Paul Willson",
         "Alan Blumenfeld",
         "Charlene Tilton",
         "James Tolkan",
         "Kenneth Londoner"
      ],
      "imdbMovieId": "0102719",
      "originalTitle": "Problem Child 2",
      "genres": ["Comedy"],
      "youtubeTrailerIds": ["Qcrl2r3g5cY"],
      "plotSummary": "Junior and his father, Ben, move from Cold River to Mortville. Junior becomes threatened by Ben's desire to date again and find a new mother for Junior, and sabotages each of his dates.",
      "tmdbMovieId": 28597,
      "avgRating": 1.8391,
      "releaseYear": "1991",
      "numRatings": 1271,
      "posterPath": "/npr7j2HuRgvsKrXLIxIiXevTH8A.jpg"
   }
}