{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "prisoner",
            "id": 1563
         },
         {
            "name": "death row",
            "id": 2501
         },
         {
            "name": "alcatraz",
            "id": 3859
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "courtroom",
            "id": 33519
         },
         {
            "name": "murder trial",
            "id": 207240
         },
         {
            "name": "1940s",
            "id": 207883
         },
         {
            "name": "mistreatment",
            "id": 211082
         },
         {
            "name": "public defender",
            "id": 215596
         },
         {
            "name": "prisoner abuse",
            "id": 223044
         }
      ],
      "imdb_id": "tt0113870",
      "video": false,
      "title": "Murder in the First",
      "recommendations": [
         12395,
         13715,
         1644,
         2163,
         1073,
         9566,
         2275,
         6723,
         4997,
         10909,
         178,
         10493,
         10126,
         10731,
         10433,
         9057,
         12647,
         8987,
         2924,
         9013
      ],
      "backdrop_path": "/AubQpA81JLI0muHPEgYSeF8Ox7b.jpg",
      "revenue": 17381942,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "James Stamphill",
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d0f",
               "name": "Christian Slater",
               "profile_path": "/3ElLWjnvchMS6Q4cIQOK8QNAoMG.jpg",
               "id": 2224,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Henri Young",
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d13",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Glenn",
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d17",
               "name": "Gary Oldman",
               "profile_path": "/tofLS5A6lBXNjeROGvgpfe2JwaT.jpg",
               "id": 64,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Mary McCasslin",
               "gender": 1,
               "credit_id": "52fe44a9c3a36847f80a2d1b",
               "name": "Embeth Davidtz",
               "profile_path": "/gmc4nZtGc6bge9DnriR57VYq0dA.jpg",
               "id": 6368,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Bill McNeill",
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d1f",
               "name": "William H. Macy",
               "profile_path": "/cYmHYCGxkOVZgu2oDyhF6lKgfaj.jpg",
               "id": 3905,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mr. Henkin",
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d23",
               "name": "Stephen Tobolowsky",
               "profile_path": "/fUodC7wMUZLAXnm4ONCxF5haCtC.jpg",
               "id": 537,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Byron Stamphill",
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d27",
               "name": "Brad Dourif",
               "profile_path": "/6pqeGxtWEdDjYsnQfUkmzXLlDvs.jpg",
               "id": 1370,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Blanche",
               "gender": 1,
               "credit_id": "52fe44a9c3a36847f80a2d2b",
               "name": "Kyra Sedgwick",
               "profile_path": "/udLKlspMdXSC9LMdhygL5rcJ4XI.jpg",
               "id": 26467,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Rosetta Young",
               "gender": 1,
               "credit_id": "52fe44a9c3a36847f80a2d2f",
               "name": "Mia Kirshner",
               "profile_path": "/n8XXrUi2PEdY6MiEaTQD0fgavsW.jpg",
               "id": 18658,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2cf9",
               "name": "Marc Rocco",
               "profile_path": null,
               "id": 54971,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2cff",
               "name": "Dan Gordon",
               "profile_path": null,
               "id": 54972,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d05",
               "name": "Christopher Young",
               "profile_path": "/2laVovSXDVpHRS6HSpKyCspSmze.jpg",
               "id": 19155,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a9c3a36847f80a2d0b",
               "name": "Fred Murphy",
               "profile_path": "/oLzSw5wj6X3H5FYIQuXruf8TkaW.jpg",
               "id": 17765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a9c3a36847f80a2d35",
               "name": "Russell Livingstone",
               "profile_path": null,
               "id": 41763,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.051654,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 8438,
      "vote_count": 172,
      "budget": 0,
      "overview": "Inspired by a true story. A petty criminal sent to Alcatraz in the 1930s is caught attempting to make an escape. As punishment he is put in solitary confinement. The maximum stay is supposed to be 19 days, but Henri spends years alone, cold and in complete darkness, only to emerge a madman and soon to be a murderer. The story follows a rookie lawyer attempting to prove that Alcatraz was to blame.",
      "similar": [
         107846,
         1645,
         37257,
         5925,
         1701,
         11615,
         9291,
         1368,
         238,
         1429,
         708,
         278,
         76640,
         392982,
         57201,
         7984,
         10447,
         10734,
         5971,
         11327
      ],
      "original_title": "Murder in the First",
      "runtime": 122,
      "poster_path": "/jPbBDALAjTQFzCl21ZKmhjSjEmD.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Wolper Organization",
            "id": 2428,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1995-01-20",
      "vote_average": 6.9,
      "belongs_to_collection": null,
      "tagline": "The trial that brought down Alcatraz",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Marc Rocco"],
      "runtime": 122,
      "synopsis": null,
      "writers": ["Dan Gordon"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113870/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0NDU5NjA5MV5BMl5BanBnXkFtZTcwNTg1MzYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Christian Slater, Kevin Bacon, Gary Oldman | See full cast and crew »"],
      "reviews": [
         "As Wayne would have it---\"DENIED!!\" how this film escaped the attention of Oscar and Globe voters is one of the great Hollywood mysteries of our time...if Bacon ain't Oscar meat here, i don't know what is...an absolutely brilliant performance in the kind of role the voters usually jump all over at ballot time...ya really gotta wonder... conspiracy theories aside, this is one helluva flick...besides our pal Kevin, there's outstanding work from Christian Slater, Gary Oldman, and everybody's favorite drill sergeant, Lee Ermey...Moe Greene's kid, Marc Rocco, gets a great period feeling economically...solid work by the wardrobe and make-up units...this film deserved a much better fate at the box office and at awards season in '96...if you haven't seen this one yet, you're missing a real gem...",
         "This is clearly Kevin Bacon's best performance. It's a shame he was not nominated for an academy award for his role. A truly emotional movie that ranks among the top Alcatraz movies made! Gary Oldman also puts in a very solid performance. Christian Slater plays a youthful, inexperienced attorney to perfection. In showing another side of Alcatraz the movie breaks away from typical escaped based Alcatraz films. While \"Escape from Alcatraz\" may still be the top movie in this topic area, \"Murder in the First\" provides a new twist that involves a different type of drama. Kevin Bacon was surely jilted for not being nominated here!",
         "How Kevin Bacon didn't get an Oscar, let alone a nomination is beyond me. What is wrong the the Academy? it was a better performance than Tom Hanks in Forrest Gump, I was moved to tears by the man, it's a heartbreaking performance. He should have been nominated for 'The Woodsman' as well. Great actor. But i have to say it's not an easy watch, and the violence is relentless, it reminds me of the time i once witnessed a boy get bullied at school, it just never ended and i remember feeling awful for the poor chap, the fact that it's a true story just makes me shudder. Gary Oldman gives one of the most hateful performances i've ever seen while Slater shows depth as the lawyer trying to get him out of prison as early as possible.",
         "My comments are directed to the claim that this film is based on a true story. The true facts of Henri Young's case are significantly different from the story told in the movie. For instance, Young was not just a petty thief when he came to Alcatraz -- he was already doing time for bank robbery and murder. Nor was he kept in an underground dungeon for three years as punishment for an escape attempt -- his punishment was served in an isolation cell on the prison's first floor with the normal facilities that all prisoners' cells had. His case did not lead directly to the closing of Alcatraz; it continued as a Federal prison for over twenty years after his trial. Of course, there were some abuses at Alcatraz (as at virtually all prisons). Young's trial had some impact on correcting those abuses, but not to the extent suggested by the film. If you're interested in another view of the Henri Young case, visit the Bureau of Prisons web site (I can't give the URL because that would violate the comments posting guidelines) and search for \"Murder in the First\". In any film based on a true event, some license must be granted to the screenwriter. There's no way they can know exactly what was said in every conversation, so representative dialogue has to be written. Some minor characters will probably be composites. These things are understandable. But when the film blatantly distorts the main characters and the main events of the story, I can't help but think that the point the film is making is probably built on shaky ground. \"Murder in the First\" may be entertaining in some people's opinion, but no one should come away from this film thinking they have seen history portrayed accurately.",
         "I had not heard of his movie before. I caught it in mid-broadcast on cable, while channel surfing, eleven years after its release, and after the first few moments, decided to watch it to the end. It is now one of my favorites, right up there with \"To Kill a Mockingbird.\" This film succeeds both as star turns and as an ensemble piece. But more importantly it succeeds in portraying American society in the 1930s as a whole, and involving the audience emotionally in both the the greater social issues as well as the smaller, more tender, personal issues. Despite its sensitivity, it is far from a chick flick. Despite it's theme of violence, it is far from a macho action flick. It is a courtroom thriller based on real events, and it is worth watching more than once. The script writing and direction are calculated to be moving, and they succeed. Every actor in the film, every detail of the art direction, every camera angle plays on your heart and sense of moral indignation. To do so successfully, as I think this movie does, is the definition and purpose of art. Kevin Bacon shows the most range in his film that I have ever seen from him. His physical performance was very demanding, his character work even finer. His chemistry with each actor in every scene is both bold and subtle, raw and complex. He reminds me of DeNiro's performance in the \"Cape Fear\" remake. Christian Slater's character provides the viewer's point of view in the film, and he plays with great emotion and passion, and yet with a touch of reserve and detachment. I am strongly reminded of Kevin Costner's performance in \"The Untouchables.\" Needless to say, Gary Oldman is a master at his craft, and always amazing to watch. Every character Oldman plays is memorable, and the antithesis of type-casting. His portrayal of the warden in this film is a brilliant balance of a socially acceptable monster. This movie has received a lot of criticism for portraying historical facts inaccurately, and for taking sides in a political debate. I would remind the open-minded viewer that \"To Kill A Mockingbird\" also took great liberties with the facts of the historic court case on which it was based (there were six accused rapists, not one; the person on whom Atticus Finch was based was in reality the judge and not the defense attorney, etc.) and emphatically took sides in the even more hotly contested political debate over racial discrimination in America. Both films were based on real life, but neither claimed to be a documentary. Whether you resent historical tampering and political statements for dramatic impact is something only you can decide for yourself. Personally, I support both \"To Kill A Mockingbird\" and \"Murder in the First\" as films whose merits outweigh their flaws. In short, this movie is worthy of your time, and will reward you, whether you want entertainment thrills, a good popcorn movie, a morally inspiring story or the appreciation of a well-crafted piece of work. It falls a little short of \"The Shawshank Redemption,\" but not far. Despite what this or any other review says, start this movie without any preconceived notions, and just go along for the ride. I think you will be surprised, happy and satisfied.",
         "This appears to be a prison movie about the injustices inflicted upon a hapless inmate named Henri Young. In reflection it is actually about friendship and the every day things we take for granted. At the heart of this movie, Kevin Bacon's character, Young, asks Christian Slater's character, Stamphill, if they were on the outside, would they be friends? He answers without much thought, yes, of course. Then Bacon says, I could've been like you. He sees in this young attorney, his own life & what it might have been if not for $5. He asks Slater, did you ever steal $5? Of course he had, from his brother, who told him never to do it again. Henri Young's punishment was to go to a federal penitentiary where upon trying to escape, he was \"sentenced\" or left to die, for 3 long years in solitary confinement. Young's character has never been with a woman and he's 28 years old. In a very moving scene (wisely done without music, although the music in this movie is beautiful) Stamphill brings a woman into the cell in an attempt to give him a few moments as a man. Unfortuantely, he cannot even bring himself to enjoy this - the look on his face will absolutely make you break down and cry. The performances by everyone are terrific. Contrary to previous reviewers, there is nothing wrong with Slater's performance. Thankfully, it is understated as it should be. Also, it should be rather obvious, that with a role this meaty & important, Bacon's outstanding performance is likely to make any other actor in the same scene, seem less of an accomplishment. This is definately Kevin Bacon's most important role and should have garnered an Oscar nomination. This is a not to be missed movie- and wouldn't you know it, it's based on a true story. In the end, it's about a triumph of the human spirit. I was lucky enough to see this at the theater when it first came out- you're lucky because it's available on video- go rent it tonight if you're interested in a good story.",
         "This was a very entertaining film about the horrible treatment of a certain prisoner at Alcatraz named Henri Young who robbed a store for five dollars ($5.00) and was sent to prison. Henri Young was played by Kevin Bacon who did a fantastic job of acting and captured your attention through out the film. There were many scenes filmed on the Island of Alcatraz and some old time footage of the first time Warden of Alcatraz, James R. Johnston. Christian Slater, (James Stamphill) was the lawyer assigned for Henri Young's defense, who had a hard job trying to rehabilitate his client so he could stand trial and even speak a few words. Young was in such bad shape mentally from being put into the solitary confinement for three (3) years, he was like an animal instead of a human being. This Hollywood version is not all completely true about Henri Young, he really had a long history of crime and mental problems. However, this film is very entertaining and Kevin Bacon put his heart and soul into this role. Enjoy.",
         "This film was excellent. Yes it's true that it wasn't as factually accurate as it could have been, but judged purely as a drama, it was film making at its best - superb acting, directing and cinematography. However, I would especially like to commend Christopher Young's amazing music score. It was haunting, beautiful and emotive, and contributed so much to the feel of the movie. Two scenes where the music was used to great effect: the tracking shot after Henri attacked the other prisoner, and the setting up of the court room then dissolving into an aerial shot of Alcatraz. Thank you to all concerned for making this great and moving picture - it makes me want to go and make movies!",
         "This movie didn't do well, in fact drove a talented filmmaker away from directing. Its because it has powerful characters and powerful actors that viewers snap to one of the six viewing modes they have and read it as a \"character-driven\" drama. Others were upset that the story deviates from real events rather drastically. My own view is that this is one of the very few films we have that features a building as a character. This is a traditional trial form, where conflicting and synthesized realities are understood to exist by ordinary viewers. Usually this form is used to support battling stories, or versions of reality. Powerful characters can exist (\"Mockingbird,\" \"Few Good Men\"), but they are there only as representatives of conflicting realities. What makes this so interesting is that it is the building itself that is on trial. This is exploited by Rocco to an extraordinary extent. Fincher tried to take this notion to the next level in \"Panic Room,\" but got fired. Too bad, because it is a cinematic thrill of sorts to see someone try to present a space as a character. Sure, it is unusual and many viewers thought the man was going crazy with his odd camera angels, his swoops, his unusual blocking. But I ask you to watch this and see how the prison is introduced to us, and the supposed core, its antebellum dungeons. Then see the contrasting \"open\" space of the courtroom where it is to be tried. Slater's opening statement is an amazing exploration of space with one multi-encircling movement. Ted's Evaluation -- 3 of 3: Worth watching.",
         "Having caught up again with this film on t.v., I can only support all other commentators who have observed how utterly ridiculous is the American Academy Award system for not having even nominated the utterly brilliant performance by Kevin Bacon in this film for the best actor award, let alone in not giving him the damned thing! I am always impressed by whatever Kevin Bacon does, and am constantly surprised that he is one of those stars who always seems to creep under the public's radar of appreciation and awareness. As to the comments about the film not exactly being the \"true\" story of Henri Young, there again it always come down to the precise meaning and interpretation of a film's initial caveat of \"inspired by a true story\". Certainly, the film will have me searching the internet for more of the \"true\" facts of this harrowing story. And whether exactly the film was totally \"true\" or not, as any visitor to Alcatraz (as I have been myself) can tell you, just imagine yourself in any part of that prison in its heyday and say whether any filmic representation needs to be totally 100% accurate to convey the horrendous nature of what it must have been like there. Returning to the antics of the members of the U.S. Academy Award, their failures over this Kevin Bacon performance remind me of the time they robbed Cate Blanchett for her out of this world outstanding performance in \"Elizabeth\" in favour of that whimpering blonde piece of fluffy air Gwyneth Paltrow for the paltry \"Shakespeare in Love\"."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Warner Bros.",
         "Canal+",
         "Wolper Organization, The"
      ],
      "summaries": [
         "Henri Young stole five dollars from a post office and ended up going to prison - to the most famous, or infamous, prison of them all: Alcatraz. He tried to escape, failed, and spent three years and two months in solitary confinement - in a dungeon, with no light, no heat and no toilet. Milton Glenn, the assistant warden, who was given free reign by his duty-shirking superior, was responsible for Young's treatment. Glenn even took a straight razor and hobbled Young for life. After three years and two months, Young was taken out of solitary confinement and put with the rest of the prisoners. Almost immediately, Young took a spoon and stabbed a fellow prisoner in the neck, killing him. Now, Young is on trial for murder, and if he's convicted he'll go to the gas chamber. An eager and idealistic young attorney, James Stamphill, is given this impossible case, and argues before a shocked courtroom that Young had a co-conspirator. The true murderer, he says, was Alcatraz.",
         "Inspired by a true story. A petty criminal sent to Alcatraz in the 1930s is caught attempting to make an escape. As punishment, he is put in solitary confinement. The maximum stay is supposed to be 19 days, but Henri spends years alone, cold and in complete darkness, only to emerge a madman and soon to be a murderer. The story follows a rookie lawyer attempting to prove that Alcatraz was to blame, and that Henri should not be executed.",
         "Henri Young was convicted for stealing $5 from a post office and sent to Alcatraz, the most secure jail for the most dangerous criminals. After a futile escape mission, he was sent to a dungeon and got out after a thousand days, though 19 days in dungeon was the maximum official punishment allowed. He became scared, confused, and savage and killed one of the prisoners. It was a sure-to-lose case, so James Stamphill, a fresh law graduate, was appointed as Young's lawyer. The rest is history: how the dungeons of Alcatraz were closed forever.",
         "An eager and idealistic young attorney defends an Alcatraz prisoner accused of murdering a fellow inmate. The extenuating circumstances: his client had just spent over three years in solitary confinement."
      ],
      "budget": 0
   },
   "movielensId": 280,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-20",
      "dvdReleaseDate": "1999-06-22",
      "directors": ["Marc Rocco"],
      "runtime": 122,
      "movieId": 280,
      "title": "Murder in the First",
      "mpaa": "R",
      "actors": [
         "Christian Slater",
         "Kevin Bacon",
         "Gary Oldman",
         "Embeth Davidtz",
         "William H. Macy",
         "Stephen Tobolowsky",
         "Brad Dourif",
         "Kyra Sedgwick",
         "Mia Kirshner"
      ],
      "imdbMovieId": "0113870",
      "originalTitle": "Murder in the First",
      "genres": [
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["oMbMwdPwnYE"],
      "plotSummary": "Inspired by a true story. A petty criminal sent to Alcatraz in the 1930s is caught attempting to make an escape. As punishment he is put in solitary confinement. The maximum stay is supposed to be 19 days, but Henri spends years alone, cold and in complete darkness, only to emerge a madman and soon to be a murderer. The story follows a rookie lawyer attempting to prove that Alcatraz was to blame.",
      "tmdbMovieId": 8438,
      "avgRating": 3.71612,
      "releaseYear": "1995",
      "numRatings": 5328,
      "posterPath": "/jPbBDALAjTQFzCl21ZKmhjSjEmD.jpg"
   }
}