{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "minister",
            "id": 3065
         },
         {
            "name": "australia",
            "id": 5657
         },
         {
            "name": "inheritance",
            "id": 10911
         },
         {
            "name": "wager",
            "id": 11411
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "19th century",
            "id": 207928
         }
      ],
      "imdb_id": "tt0119843",
      "video": false,
      "title": "Oscar and Lucinda",
      "recommendations": [
         38509,
         59481,
         38981,
         45609,
         55123,
         41974,
         38583,
         18840,
         31064,
         80659,
         62677,
         21544,
         32075,
         37749,
         298664,
         29946,
         108021,
         38043,
         12660,
         47907
      ],
      "backdrop_path": "/pIM2VzGc2uP6JhgsO3Ni0U9svPv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Oscar Hopkins",
               "gender": 2,
               "credit_id": "52fe47309251416c9106cf99",
               "name": "Ralph Fiennes",
               "profile_path": "/95C56hfbvSA1UNvD433EzXviyV5.jpg",
               "id": 5469,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Lucinda Leplastrier",
               "gender": 1,
               "credit_id": "52fe47309251416c9106cf9d",
               "name": "Cate Blanchett",
               "profile_path": "/5HikVWKfkkUa8aLdCMHtREBECIn.jpg",
               "id": 112,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Reverend Dennis Hasset",
               "gender": 2,
               "credit_id": "52fe47309251416c9106cfa1",
               "name": "Ciarán Hinds",
               "profile_path": "/h5n8B12WoY1UAZjzSVEup4vsoBw.jpg",
               "id": 8785,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Hugh Stratton",
               "gender": 2,
               "credit_id": "52fe47309251416c9106cfa5",
               "name": "Tom Wilkinson",
               "profile_path": "/4mxZKgdem0sQ8hJd0Y7TREwq7TJ.jpg",
               "id": 207,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Mr. Jeffries",
               "gender": 2,
               "credit_id": "547888afc3a3683a67000766",
               "name": "Richard Roxburgh",
               "profile_path": "/hN1bWQ0Qe0DrA33Ch6TLKuIWs0.jpg",
               "id": 12206,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mr. Tomasetti",
               "gender": 2,
               "credit_id": "5525aacdc3a3687e11002526",
               "name": "Christian Manon",
               "profile_path": "/800kuPsHOsFpCdHNaiV31xTQcQJ.jpg",
               "id": 1451740,
               "order": 5
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe47309251416c9106cf95",
               "name": "Gillian Armstrong",
               "profile_path": "/nAWFdZDlp7q6yWDWgM5PMkkmZcA.jpg",
               "id": 58094,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "54788891c3a3687f040001bd",
               "name": "Laura Jones",
               "profile_path": null,
               "id": 65035,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.904192,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 39780,
      "vote_count": 32,
      "budget": 0,
      "overview": "After a childhood of abuse by his evangelistic father, misfit Oscar Hopkins becomes an Anglican minister and develops a divine obsession with gambling. Lucinda Leplastrier is a rich Australian heiress shopping in London for materials for her newly acquired glass factory back home. Deciding to travel to Australia as a missionary, Oscar meets Lucinda aboard ship, and a mutual obsession blossoms. They make a wager that will alter each of their destinies.",
      "similar": [
         858,
         112160,
         141,
         634,
         281957,
         242224,
         43923,
         8810,
         297762,
         437557,
         298382,
         27586,
         713,
         2771,
         9587,
         3134,
         11236,
         13075,
         9813,
         5781
      ],
      "original_title": "Oscar and Lucinda",
      "runtime": 132,
      "poster_path": "/tIehCqQIgEwLGybchijTFi56AIA.jpg",
      "spoken_languages": [
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/4RgIPr55kBakgupWkzdDxqXJEqr.png",
            "name": "Fox Searchlight Pictures",
            "id": 43,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Dalton Films",
            "id": 39711,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Australian Film Finance Corporation",
            "id": 1380,
            "origin_country": "AU"
         }
      ],
      "release_date": "1997-12-31",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "They dared to play the game of love, faith, and chance.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "AUD ",
      "directors": ["Gillian Armstrong"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Peter Carey",
         "Laura Jones"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119843/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNDE1NzE1MDEyOV5BMl5BanBnXkFtZTcwMDY3MzcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Ralph Fiennes, Cate Blanchett, Ciarán Hinds | See full cast and crew »"],
      "reviews": [
         "The marketing for this film in America was absurd when compared to the real thing. I had seen the trailers, and as I am intrigued by anything with Ralph Fiennes, I took notice. However, the preview stressed an gambling-chance-obsessive fun aspect that I found less than compelling. Had the true soul and purpose of the movie come through in that two minute-long advert, I would have been hooked. As it was, I waited until it came out on video. My expectations, coloured by this misleading trailer, were well exceeded. The film had to do with love and gambling, yes, but there were elements of faith, guilt, family, destiny and survival that were wholly ignored in the press. Ralph Fiennes is marvellous as a disheveled and uncertain faithful, with a boyish charm and utter purity that is difficult to portray without seeming slow-witted or unlikeable. Cate Blanchett, who has received a tremendous amount of notice for her recent portrayal of Elizabeth, is a fountain of strength, charm, capricious abandon, intelligence and sensuality. Like her minor role in _Paradise Road_, she steals scenes and breaks hearts with an undeniable charisma and resolve. Set in Australia, the story is surprising, and ultimately shocking in its constrast of the ideal and the real. I was moved, and thoroughly impressed with this movie. This is a romance for those who are tired of the predictable, the trite and the overworked. The scenery is beautiful, and the direction is both soft and unflinching. A wonderful achievement. --Salome",
         "I am not one for love stories, but this one truly moved me. It is wonderfully strange! It's nothing like anything I've seen before. I loved the awkwardness of Oscar and Lucinda, and the way that we had a chance to see (at length} who they were before they ever met each other. It made their attraction to one another make sense (something so rare in cinematic romances). I think this is Ralph Fiennes' best performance of his career, and he's proved his versatility. Compare his Oscar to his Count in The English Patient - completely different people, not even carrying themselves in the same way! This was a very good role for him. Cate Blanchett was really the standout for me; I took notice of her right away, and determined to keep an eye out for her future performances (she did a terrific job in the flawed \"Elizabeth\"). Of course, the film is beautifully made (I wouldn't expect anything less from Gillian Armstrong) and imaginative ... the way it depicts reality as almost surreal, and the surreal as quite real ... it's lovely. On the one hand, this is a sad film, in that it's about two people who are just ... odd. They don't really fit in anywhere, and people don't understand them. Neither Oscar nor Lucinda are even anticipating (or aspiring) to be understood, and yet they find, and take comfort in, one another. Here is where the film turns from sad to joyful ... it is thrilling to see the surprise and delight they express as they discover that they have found their soulmates. I have to say that I found, in their story, a true (and hopeful) portrayal of love.",
         "I don't know what it is about Ralph Fiennes and Booker Prize-winning novels (like 1996's THE ENGLISH PATIENT), but this shows him to have a pretty good track record with them. This novel was extremely difficult to follow, but director Gillian Armstrong, who also did a good job with her adaptation of the more straightforward LITTLE WOMAN, cuts through the confusing storyline to make an entertaining and thoughtful film about gambling, religion, and, of course, love. She and writer Laura Jones can't quite defeat some of the overdone symbolism of the novel (like the glass church), but for the most part, this avoids the stateliness of many literary adaptations by being alive. Fiennes took awhile to warm up for me as Oscar, because this is a more outwardly nervous character than he's ever played before, and the voice he uses takes getting used to as well. Once I got over that, I enjoyed his performance. But the real star here is Cate Blanchett as Lucinda; she is simply enchanting, and you can really see the fire in her eyes. The supporting cast is excellent as well.",
         "Do you like great acting? I mean something subtle where an actor's face is like an artist's brush or music by a fine composer. In this film Ralph Fiennes and Cate Blanchett are the virtuosos and they simply dazzled me with their talent. The main story of Oscar and Lucinda is not very original, a tragic love story. The film does involve pre 1900 English characters that present some basic dilemmas of life. How strange the English of the 1800's seem today. Their repressed world can make an interesting contrast to the lives of free spirits and native cultures. The dilemma Oscar and Lucinda gives us is that if we follow our feelings and obsessions, we will break away from many silly and confining customs. But such devotion to feeling taken too far can lead a person to commit hideous acts. Oscar and Lucinda goes to the heart of many of these conflicts which are also touched upon by the fine film, The Piano, and by the more obvious and superficial Sirens. With such weighty issues, there is much hand wringing guilt by several characters. And all of that gets in the way of the love story which was alright with me but may bother some. There are a few novelistic touches (why use the flashback technique a la Fried Green Tomatoes at all) that felt unnecessary. But these are minor points. The talented director Gillian Armstrong finely crafts many of the scenes and keeps the story moving. As a final dilemma, even though Western Civilization has tragically spoiled much of the beauty of the natural world, it has also created beautiful, finely acted films such as this.",
         "*Oscar and Lucinda* is based on a brilliant, though very tough-to-adapt, novel by Peter Carey. It is a small miracle that director Gillian Armstrong succeeded so magnificently. (I'm giving all the credit to her: the end-credits tell us that the script was developed by the \"Australian Film Commission\" or something, whatever that is. I doubt that they were actually on the set.) For all you young filmmakers out there dreaming of making a Big Epic with Big Themes, I urge you to watch this movie right now, and learn how to construct a narrative out of the most rambling source material. The two titular characters -- one starting out in England, the other in Sydney, Australia -- don't even meet until about 40 minutes into the film; it's all the more impressive that we don't feel impatient for this meeting, realizing that their connection will occur as a result of the natural and logical development of the story. Aside from Oscar and Lucinda, Armstrong also has to manage about 8 or 9 other characters who will be crucial to the plot. Each character is introduced just when they need to be: the process is never hurried or confusing. As all the elements of narrative and character come together, we realize Armstrong has created nothing less than an art of cinematic fugue tantamount to genius. Budding filmmakers may also want to take notes on Armstrong's judicious use of voice-over narration in the film. The Narrator pipes up only when he needs to, providing crucial information or the occasional bit of witty commentary. (\"In order that I exist, two gamblers -- one obsessive, the other compulsive -- must declare themselves.\") It's also marvelous how the Narrator himself, seemingly so omniscient, becomes the very culmination of the story. In other words, the Narrator is a key element, rather than a superfluous chatterbox -- the case of most movie narrators. The story is set in the 1850's, revolving around a saintly young Anglican minister (Ralph Fiennes) who, trying to escape his gambling addiction, takes a ship to Australia. On board, he meets Lucinda (Cate Blanchett), an ahead-of-her-time independent businesswoman from Sydney who is returning home after a buying expedition for her glass-works factory. She is also nursing a gambling problem. Naturally, the two misfits form an immediate bond. Upon arriving in Sydney, Oscar promptly wrecks his ministry before it even gets started when he's caught playing cards with his new friend. Adding to his woes, he believes that Lucinda is in love with ANOTHER minister (Ciaran Hinds) who has already been run out of town -- banished to the church-less frontier -- because of his friendship with her. (Beautiful and single and a gambler, Lucinda is a sort of eye of a hurricane -- only her wealth keeps her from getting tarred and feathered, apparently.) The naif Oscar, despite all indications that his affection for her is reciprocated, hits upon a new wager: he bets Lucinda that he can deliver a glass church to Hinds via a dangerous overland journey across the continent. The stakes? Each other's inheritance . . . and, for Oscar, ultimate proof that he loves Lucinda more than any man. This is a wonderful story, chock-full of some pretty startling ideas -- for instance, that religious faith itself is little more than a cosmic gamble -- and immersed in the visual symbols of water (i.e., Death) and glass (declared here as a solid form of liquid). The two symbolic motifs converge near movie's end, when Fiennes sits alone in the glass church as it floats down a river -- truly a magnificent sight to see that would justify a dozen lesser movies than this one. One review below mine judged this as \"overdone\": but it seems to me that if you aren't impressed with this image, then you just don't like the movies, sorry. I also differ with the general opinion that the climax of the film is intolerably depressing. It seems to me that God saves the saintly Oscar from an unhappy life shared with someone he could never love. True saints can never be with us for very long: they set examples for us, but they're soon called home to God. In any case, the movie's symbolism was telling you all along what Fiennes' fate would be. Sorry for the long review, but this is a great film. Let me conclude by saying that Fiennes has never been better than here, perhaps because he's not handsomely and sulkily brooding, for once: Oscar is a true oddball, and Fiennes handles him delicately. Excellent work. And this movie also introduced us to the great Cate Blanchett, who has more than lived up to the promise that she manifested here. 9 stars out of 10.",
         "Based on Australian novelist, Peter Carey's award-winning book, Oscar and Lucinda, this is a faithful period piece about iconoclasts and their attempt to find love and purpose in strait-laced society despite their fears and obsessions. Ralph Fiennes and Cate Blanchett have glorious, quirky chemistry in the title roles. Ralph Fiennes is such a mercurial actor that while watching this film, it's hard to believe this is the same man that played Amon Goeth in Schindler's List and Charles Van Doren in Quiz Show. Cate Blanchett was discovered by Director Shekhar Kapur and awarded the title role in Elizabeth as a result of her natural, unforced acting in this little-seen Gillian Armstrong film. Brilliantly adapted, visually stunning, and (above all) extremely well-acted this is a film that it would be sad to miss.",
         "This beautifully made romance has an odd appeal. I only ranked it a seven, because it has some flaws - the complicated story is is not rendered clearly in all its details (I could not figure out what was going on with the Reverend Haslitt, for example) and the style tends towards a gothic/romantic manneredness in places. All the same, I recommend it for anyone who can tolerate the genre. I love these two actors, Ralph Fiennes and Cate Blanchett. They and the supporting cast, including the bit parts, fill out their roles with life, warmth and poignancy. There are numerous evocative touches in the details of the production - the mysterious moving church in the opening scene, for example, the music, the costumes, and the sets. The story is unique, original, character-based, and there are some unexpected flashes of insight into human nature.",
         "This is one of my favorite movies. Regular readers of my comments will wonder why I elevate it to my \"must see\" category Part of the reason I want you to see it is because of how well it pairs with Cate's masterpiece, \"Heaven.\" Now, that film can stand on its own as a transcendent cinematic experience. It easily shifts us from a \"real\" world into one more magical and over the course of the experience that distance increases. It took Kieslowski's notion of cinematic distance and added the journey to that distance. It is one of the most important successful experiments in cinema and it owes much to the collaboration of Cate. That reflects on this. A smaller project. A less ambitious director, but still with an affecting emotional directness. A pre-existing story that has literary strengths that become cinematic defects. And yet there is that same collaboration with the creating of an alternative magical reality fueled by obsession. There is that same smooth slide from here to there. There is that same equating of wilderness (a Herzogian river) to the internal landscape. The same trigger of the gamble. And also, there is the remarkable glass chapel. One shot has it moving down the river, but it seems as if it is floating through the trees. You are dead if that does not stick with you for years. Alas, not much is made of a central image in the book \u0097 the tensed glass tears that explode when gently traced at their origin. The major flaw is Fiennes. Both brothers have a sort of forehead acting style which unravels much of the subtleties of Cate's acting by breathing. But she is so breathtaking an actress in both these films, even though she is only the referent in the last part of this. See the two films in one night. Any order. Ted's Evaluation -- 4 of 3: Every cineliterate person should experience this.",
         "After a slow beginning, Oscar and Lucinda meet and create a peculiar relationship with God on one side and the addiction of gambling on the other. The last half hour is quiet fascinating as Oscar takes a journey to sail a glass church down the river and into a small secluded town. This unfortunately was treated with rather hastily, not given the attention the early scenes received. But we still get the picture and by the end of it Ralph Fiennes' brilliant performance as the saintly manic, bible guilt-ridden, phobia riddled Oscar, makes it worth the while.",
         "There are many films that are so controversial yet so beautiful, they appeal to only a select number of individuals. \"Oscar & Lucinda\" is one such triumph. It manages to border on heresy and yet sustain profoundness. Altogether a masterful piece of work from one of my favorite directors (Armstrong also filmed \"Charlotte Gray,\" and \"Little Women\"), with an absolutely stunning, star-studded (before they were \"big\") cast. You simply cannot comment on the film without considering the two leading cast members. Cate Blanchett is stunning here. She was beautiful, aloof, and impressive as \"Elizabeth,\" but her role as the uncertain yet adventurous Lucinda is extremely memorable. Note her childish transformation into womanhood -- the discovery that not all tales have happy endings, that love eventually leads to sorrow. Her scenes with Ralph Fiennes literally crackle with intensity. These are two actors who manage to convince us they're not acting. The passion and devotion put into the role gives the film it's sparkle beyond the stunning cinematography and absolutely breathtaking musical score. Ralph Fiennes is rapidly becoming one of my favorite actors. He's extremely versatile and never shies away from challenging roles, whether it's a heartless Nazi in WWII, a Cambridge professor caught up in the throes of a quiz show scandal, or the impassioned Evgene Onegin. With \"Oscar\" we see him literally at his finest. The appropriately-nicknamed Academy Award should have been handed to him the day this sweet little Australian film premiered. His Oscar is passionate, guilt-ridden, complex, and utterly sweet. If you're not in tears by the end, you've not managed to give your heart over to one of the most fascinating literary characters ever created. The sub-roles are all very good (Richard Roxburg in yet ANOTHER 'villainous' lead, but no one minds his untimely demise; Cirian Hinds in the upper-crust role of a minister shocked by his lady friend's gambling habits, even Geoffrey Rush as the unseen narrorator) and lend themselves to a highly romantic atmosphere. I love a slowly unfolding, deep love story but dislike superficial attachments. In the course of this film you believe Oscar & Lucinda actually get to know one another. They're involved in a series of \"narrow hits and misses,\" which make the ending all the more tragic. They \"connect\" in a way other people cannot; in a world full of round holes, two square pegs make the perfect match. The religious aspect of this film is also highly interesting. As a Christian myself, I regard anything bordering on heresy with wary suspicion. At first glance, the film borderlines on blasphemy, as Oscar so prudently considers in a key scene (\"... unless it is blasphemy to consider mortal pleasure on the level of the divine!\") when comparing eternal salvation to gambling (\"It's all a gamble, isn't it?\"), but if you take the time to explore it more fully, there are very realistic truths tucked in with the uncertainties. Oscar eventually does find Truth and clings to his beliefs to the bitter end. The rivalry between different denominations is also notable. Older viewers seeking enthralling but not necessarily uplifting entertainment will find \"Oscar & Lucinda\" an excellent way to spend a couple of hours, particularly in a group. There is one scene of sexual content that is offensive (although clothed and necessary to the plot; for my own enjoyment, I always skip this provincial scene) but otherwise the film is surprisingly light in content. But it's a movie you shouldn't enter lightly. Out of the group of friends I showed it to one weekend, two out of five found it \"depressing.\" But the rest of us were enthralled."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Australian Film Finance Corporation (AFFC)",
         "Dalton Films",
         "Fox Searchlight Pictures"
      ],
      "summaries": ["In mid-1800's England, Oscar is a young Anglican priest, a misfit and an outcast, but with the soul of an angel. As a boy, even though from a strict Pentecostal family, he felt God told him through a sign to leave his father and his faith and join the Church of England. Lucinda is a teen-aged Australian heiress who has an almost desperate desire to liberate her sex from the confines of the male-dominated culture of the Australia of that time. She buys a glass factory and has a dream of building a church made almost entirely of glass, and then transporting it to Bellingen, a remote settlement on the north coast. Oscar and Lucinda meet on a ship going to Australia; once there, they are for different reasons ostracized from society, and as a result \"join forces\" together. Oscar and Lucinda are both passionate gamblers, and Lucinda bets Oscar her entire inheritance that he cannot transport the glass church to the Outback safely. Oscar accepts her wager, and this leads to the events that will change both their lives forever."],
      "budget": 16000000
   },
   "movielensId": 2801,
   "movielens": {
      "languages": [
         "Français",
         "English"
      ],
      "releaseDate": "1997-12-31",
      "dvdReleaseDate": "2005-01-11",
      "directors": ["Gillian Armstrong"],
      "runtime": 132,
      "movieId": 2801,
      "title": "Oscar and Lucinda",
      "mpaa": "R",
      "actors": [
         "Ralph Fiennes",
         "Cate Blanchett",
         "Ciarán Hinds",
         "Tom Wilkinson",
         "Richard Roxburgh",
         "Christian Manon"
      ],
      "imdbMovieId": "0119843",
      "originalTitle": "Oscar and Lucinda",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["Q9KRbrmc-A0"],
      "plotSummary": "After a childhood of abuse by his evangelistic father, misfit Oscar Hopkins becomes an Anglican minister and develops a divine obsession with gambling. Lucinda Leplastrier is a rich Australian heiress shopping in London for materials for her newly acquired glass factory back home. Deciding to travel to Australia as a missionary, Oscar meets Lucinda aboard ship, and a mutual obsession blossoms. They make a wager that will alter each of their destinies.",
      "tmdbMovieId": 39780,
      "avgRating": 3.39989,
      "releaseYear": "1997",
      "numRatings": 899,
      "posterPath": "/tIehCqQIgEwLGybchijTFi56AIA.jpg"
   }
}