{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "holiday",
            "id": 65
         },
         {
            "name": "nostalgia",
            "id": 5609
         },
         {
            "name": "young boy",
            "id": 11336
         },
         {
            "name": "bb gun",
            "id": 170472
         },
         {
            "name": "essay",
            "id": 170487
         },
         {
            "name": "christmas tree dealer",
            "id": 170496
         },
         {
            "name": "mall santa",
            "id": 170499
         },
         {
            "name": "christmas",
            "id": 207317
         },
         {
            "name": "1940s",
            "id": 207883
         }
      ],
      "imdb_id": "tt0085334",
      "video": false,
      "title": "A Christmas Story",
      "recommendations": [
         12498,
         13187,
         11528,
         3083,
         5825,
         11977,
         11153,
         11881,
         596,
         903,
         13342,
         3090,
         6471,
         5683,
         11787,
         887,
         981,
         10276,
         982,
         93
      ],
      "backdrop_path": "/wok0YepwQfBAPsrttFq0W6HXT2g.jpg",
      "revenue": 19294144,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Mrs. Parker",
               "gender": 1,
               "credit_id": "52fe4281c3a36847f802449b",
               "name": "Melinda Dillon",
               "profile_path": "/f4DU3lNCJqNVgwDZmHMlNV96rKV.jpg",
               "id": 4778,
               "order": 0
            },
            {
               "cast_id": 12,
               "character": "The Old Man (Mr. Parker)",
               "gender": 2,
               "credit_id": "52fe4281c3a36847f802449f",
               "name": "Darren McGavin",
               "profile_path": "/t9wMwRZjnZZhFAwrE6OVI0NRqAf.jpg",
               "id": 7333,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Ralphie Parker",
               "gender": 2,
               "credit_id": "52fe4281c3a36847f80244a3",
               "name": "Peter Billingsley",
               "profile_path": "/2wlX6TzKnghrZHIdbtA2oKxKHcv.jpg",
               "id": 12708,
               "order": 2
            },
            {
               "cast_id": 26,
               "character": "Ralphie as an Adult",
               "gender": 2,
               "credit_id": "52fe4282c3a36847f80244d3",
               "name": "Jean Shepherd",
               "profile_path": null,
               "id": 12699,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Randy Parker",
               "gender": 2,
               "credit_id": "52fe4281c3a36847f80244a7",
               "name": "Ian Petrella",
               "profile_path": "/pfZJOPcAhRwdlj4wUvy2KYtgcyV.jpg",
               "id": 12709,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Flick",
               "gender": 0,
               "credit_id": "52fe4281c3a36847f80244ab",
               "name": "Scott Schwartz",
               "profile_path": "/b4jHavjmm9IclKG1X00Lhl6TcuZ.jpg",
               "id": 12710,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Schwartz",
               "gender": 0,
               "credit_id": "52fe4281c3a36847f80244af",
               "name": "R.D. Robb",
               "profile_path": "/j5xBAzZSS0VHj5kaKCbmc4XROPK.jpg",
               "id": 12711,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Scut Farkus",
               "gender": 2,
               "credit_id": "52fe4281c3a36847f80244bb",
               "name": "Zack Ward",
               "profile_path": "/4vqMpB4iojzCQNQ2jLNQWZ1XIIq.jpg",
               "id": 12714,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Grover Dill",
               "gender": 2,
               "credit_id": "52fe4281c3a36847f80244b7",
               "name": "Yano Anaya",
               "profile_path": "/lTHGJL2nO6BLqdna6c4WR58BLPC.jpg",
               "id": 12713,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Miss Shields",
               "gender": 1,
               "credit_id": "52fe4281c3a36847f80244b3",
               "name": "Tedde Moore",
               "profile_path": "/2y9WGr4Kwsy8rrCMox1m6EAVkC2.jpg",
               "id": 12712,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Santa Claus",
               "gender": 0,
               "credit_id": "52fe4281c3a36847f80244bf",
               "name": "Jeff Gillen",
               "profile_path": null,
               "id": 12715,
               "order": 10
            },
            {
               "cast_id": 28,
               "character": "Woman",
               "gender": 0,
               "credit_id": "5841fe0d9251417d5300c2c4",
               "name": "Leigh Brown",
               "profile_path": null,
               "id": 1717582,
               "order": 11
            },
            {
               "cast_id": 29,
               "character": "Swede",
               "gender": 2,
               "credit_id": "5841fe22c3a36865c600aefe",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Christmas Tree Man",
               "gender": 2,
               "credit_id": "52fe4281c3a36847f80244c3",
               "name": "Leslie Carlson",
               "profile_path": "/nnYVdNB7MpXbBdq3xRzkD5fTzmW.jpg",
               "id": 12716,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Freight Man",
               "gender": 0,
               "credit_id": "52fe4282c3a36847f80244d7",
               "name": "Jim Hunter",
               "profile_path": null,
               "id": 61872,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f8024461",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f8024467",
               "name": "Jean Shepherd",
               "profile_path": null,
               "id": 12699,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f802446d",
               "name": "Paul Zaza",
               "profile_path": null,
               "id": 12700,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f8024473",
               "name": "Carl Zittrer",
               "profile_path": null,
               "id": 12701,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f8024479",
               "name": "Reginald H. Morris",
               "profile_path": null,
               "id": 12702,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f802447f",
               "name": "Stan Cole",
               "profile_path": null,
               "id": 12703,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe4281c3a36847f8024485",
               "name": "Reuben Freed",
               "profile_path": null,
               "id": 12704,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f802448b",
               "name": "Gavin Mitchell",
               "profile_path": "/sQlGMe4W5QKDUCSHOGaBO7a7TXR.jpg",
               "id": 12705,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f8024491",
               "name": "Mark S. Freeborn",
               "profile_path": null,
               "id": 12706,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe4281c3a36847f8024497",
               "name": "Mary E. McLeod",
               "profile_path": null,
               "id": 12707,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4281c3a36847f80244c9",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4282c3a36847f80244cf",
               "name": "Bob Clark",
               "profile_path": "/yQgRWKPFH2uFWIJiWr5EyWLRbvD.jpg",
               "id": 12698,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 7.254899,
      "production_countries": [
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         },
         {
            "iso_3166_1": "CA",
            "name": "Canada"
         }
      ],
      "id": 850,
      "vote_count": 430,
      "budget": 0,
      "overview": "The comic mishaps and adventures of a young boy named Ralph, trying to convince his parents, teachers, and Santa that a Red Ryder B.B. gun really is the perfect Christmas gift for the 1940s.",
      "similar": [
         9479,
         11395,
         13377,
         287903,
         51052,
         1581,
         1585,
         634,
         10147,
         8871,
         772,
         5255,
         10719,
         338964,
         9279,
         9714,
         10510,
         13673,
         9021,
         11881
      ],
      "original_title": "A Christmas Story",
      "runtime": 94,
      "poster_path": "/1dSFarRSXwMjFODxPTwyaiNZotF.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Christmas Tree Films",
            "id": 10757,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1983-11-18",
      "vote_average": 7.3,
      "belongs_to_collection": {
         "backdrop_path": "/sDJLWSHdsORRGMEii0SWvm7DMwN.jpg",
         "name": "A Christmas Story Collection",
         "id": 201873,
         "poster_path": "/qjHPRBBiluOwJZp7AcMtrs0dNPr.jpg"
      },
      "tagline": "Peace, Harmony, Comfort and Joy... Maybe Next Year.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "CAD ",
      "directors": ["Bob Clark"],
      "runtime": 94,
      "synopsis": "Set in an undeterminate year of the 1940s, Ralphie Parker ( Peter Billingsley) is a nine year-old boy living in the small town of Hohman, Indiana. His older self (voice of Jean Shepherd) narrates his experiences and thoughts through the short weeks before Christmas. As he, a few friends, and his younger brother Randy ( Ian Petrella) look into the display window of a local store, Ralphie has his eyes set on the only item he wants for Christmas; an Official Red Ryder Carbine-Action Two-Hundred-Shot Range Model Air Rifle, with a compass in the stock and \"this thing which tells time\" (a sundial). Knowing full well that he could never request this item openly to his parents, Ralphie sneaks advertisements for the gun into his parents' magazines the next morning. At the breakfast table, he fails to bring up the subject in casual conversation, and with less subtlety than was intended. He then accidentally lets slip his desire to his mother ( Melinda Dillon) who immediately rejects the idea with the dreaded phrase: \"you'll shoot your eye out.\" Disappointed, Ralphie enjoys a reverie about how he alone, armed with his gun, stands between his family and a gang of stripe-shirted ruffians in a Western-style standoff. Meanwhile his grouchy father ( Darren McGavin) is forced to battle the temperamental house furnace in the basement amid a slur of inaudible curses. While walking through the frozen, snow-covered neighborhood on his way to school, Ralphie meets up his two friends, Flick ( Scott Schwartz) and Schwartz ( R.D. Robb), while Randy lags behind, heavily bundled under a thick, wool snow jumper that leaves his arms sticking straight out. Before class, Flick and Schwartz argue over what would happen should someone stick their tongue to a frozen flag pole, engaging in a delicate nuance of phrase during which Schwartz dares Flick to stick his tongue to the pole. Upon the dreaded triple-dog-dare, Flick puts his tongue to the pole to find it stuck tight. He starts screaming but the others run into school as the bell rings. Their teacher, Miss Shields ( Tedde Moore), notices Flick's absence and, when she sees him outside, calls the fire department and local police and tries to comfort Flick. As the students watch with excitement, Ralphie feels a pang of guilt. Still, when Flick is escorted to his desk, a bandage around his tongue, and Miss Shields gives a brief speech on how whoever put Flick up to sticking his tongue to the pole should atone for their misdeed. But Ralphie explains that kids know better not to get caught. Miss Shields then gives them an assignment; to write a theme about what they want for Christmas. Ralphie sees this as an opportunity to write about the Red Ryder gun, hoping that his teacher will sympathize with him and secure a little reprieve with her authority as an adult. On the way home, Ralphie, Flick, Schwartz, and Randy are confronted by a local bully named Scut Farkus ( Zack Ward) and his toadie Grover Dill ( Yano Anaya). Poor Schwartz is subjected to a painful hammerlock before they all run away, screaming shrilly, while Randy lags behind unable to keep up wearing his thick winter clothing. Ralphie makes it home and finishes his theme just as his father comes home, shouting excitedly, before being surrounded by the neighbor's dogs. Ralphie watches from his window above and comments how his neighbors, the Bumpuses, owned dozens of bloodhounds that ignored everyone else on earth except for the Old Man. Mr. Parker exclaims that he won a grand prize in a local magazine sweepstakes, showing his wife the telegram that says it will be delivered that night. During dinner that night, Randy displays his typical dissent for food and refuses to eat until his mother playfully asks him how pigs eat. Randy dives into his food face first, laughing hysterically, while Mr. Parker and Ralphie watch with mild disgust. Then, the doorbell rings and everyone immediately stops. They run to the door where Mr. Parker allows the delivery men to wheel in a large box and opens it with fervor to reveal a lamp that's designed to look like a woman's leg, complete with stocking, high heel shoe, and a shade that looks like a skirt. While Mr. Parker gushes over it, Ralphie's mother is clearly uncomfortable, especially when her husband tells her to display it in the front window for the entire neighborhood to see. Only one thing draws Ralphie and his brother away from the glow of electric sex gleaming in the window, and thats their favorite radio program; Little Orphan Annie. The next day at school, Ralphie hands in his theme and has a momentary daydream where his paper is given the best grade in class before being brought out of it by Miss Shields. After school, he and his friends are once again chased through the alley by Scut and Grover. Upon arriving home, he checks the mail to see that his long awaited package from the Little Orphan Annie Secret Society with his secret message decoder pin has arrived. He listens to the encrypted message on the radio that night and rushes up to the bathroom to decode it, only to realize that the secret message is nothing but an advertisement for Ovaltine. Wiser, but nonetheless disappointed, Ralphie casually swears under his breath. At school, the students bring in apples as small gifts for Miss Shields before Christmas. Ralphie gives her a large fruit basket, hoping that it will help sway her final decision on his paper. That evening, the family goes out to pick a Christmas tree. On the way home, the car blows a tire and Mr. Parker goes outside to fix it. When his mother encourages him to help his father, Ralphie is only happy to do so, but when his father accidentally knocks the hubcap that Ralphie is using to hold the tire bolts out of his hands, Ralphie utters the big one that he heard his father say in private over and over again. Ralphie says: \"oh, fudge!\" (Actually the F-dash-dash-dash word). At home, his mother puts a bar of soap in his mouth, one that he dislikes in taste above all others he's had the opportunity to sample. His mother asks where hes heard that word and, although Ralphie admits to us that his old man used the word as fluently as an artist would use paint, he chickens out and blurts out his friend Schwartz's name. When Mrs. Parker calls Schwartz's mother and tells her, we hear her screaming maniacally and giving Schwartz a sound beating. Sent to bed early, Ralphie cries to himself and fantasizes about visiting his parents years into the future to reveal that all the soap sessions his mother gave him resulted in premature blindness, causing his parents to moan and grieve over their wrongdoing. At school, Ralphie is handed his theme back from Miss Shields. He looks in horror at the large C+ stamped across the top with the phrase \"youll shoot your eye out\". He imagines his teacher clad in a witch's outfit, laughing at him next to his harlequin mother who must have surely gotten to her. Ralphie spends the rest of the day in class feeling depressed and hopeless that he'll never get the Ryder BB gun. On the way home, Ralphie walks alone and is suddenly hit in the face with a snowball. He takes his glasses off and sees Scut Farkus and Grover Dill approach him. Ralphie tears up until Scut starts to mock him and laugh, something that causes Ralphie, in all his disappointment and anguish, to snap and charge angrily at Scut, tackling him to the ground and beating him. Grover runs off as the neighborhood kids cheer Ralphie on. Randy picks up his discarded glasses and goes to get their mother who arrives just as Ralphie is finishing a rant of slurred curses. She gets Ralphie off of Scut and helps him walk home. Scut is left to pick himself up with a bloodied nose. The cowardly Scut runs off, yelling to Ralphie that he'll tell his father about beating him up. Ralphie is inconsolable by the time he gets home, though his mother tries to calm him and puts him to bed until dinner. Meanwhile, Randy hides himself under the kitchen sink, crying that \"Daddy's gonna kill Ralphie\". When Mr. Parker does come home, Ralphie goes downstairs, fearing the worst and knowing full well the mix of bad words hed said during the fight. However, his mother merely mentions the fight in passing, giving Ralphie a reprieve. Suddenly, the furnace blows black smoke into the kitchen again and the Old Man rushes down to do battle. Mrs. Parker appears complacent as she strolls into the living room with a watering can before a loud crash is heard. Ralphie watches as his father rushes up the stairs and finds his wife holding his broken lamp. She admits it was an accident before shouting, after Mr. Parker claims she was jealous that he won it, that it was the ugliest lamp she's ever seen. Mr. Parker attempts to fix the lamp but it quickly falls apart, much to his wife's amusement. He musters all the dignity he can as he takes the remains to the back yard and buries them. Before going to sleep, Ralphie decides that if no one else will help him in his quest to obtain the Red Ryder gun, he should ask Santa. The next night, (Christmas Eve) the family goes downtown to watch the Christmas parade. Ralphie is impatient and keeps asking to leave early so that they can see Santa Claus. As soon as Santa goes by in his float, his parents concede and take him and Randy to the department store where Santa ( Jeff Gillen) sits atop a frosty mountain, a long line of kids on one side and a slide going down on the other. Ralphie's parents let him take Randy while they go off on their own. Stuck at the end of a very long line, and with a Santa enthusiast nicknamed Goggles ( David Svoboda) to awkwardly content with, Ralphie can only wonder if he'll make it to see Santa before closing time. When they finally make it to the top, Goggles sits on Santa's lap and immediately starts screaming before being put on the slide. Randy follows suit and Ralphie is escorted by an irritable helper elf ( Patty Johnson) to sit on Santa's lap. His perspective, as he's swung around, shows clearly why most kids are afraid of Santa. In shock himself by Santa's intimindating face, Ralphie is unable to tell Santa exactly what he wants. Santa suggests a football to which Ralphie numbly agrees. He comes to his senses just as he's about to go down the slide and stops himself, struggling back to the top where he blurts out what he really wants. He gives his best smile, but Santa merely repeats what Ralphie fears, \"you'll shoot your eye out, kid\" before putting his boot to Ralphie's forehead and pushing him down the slide. Ralphie's parents collect him and Randy at the bottom and take them home where they decorate the tree (a task that results in blowing a dangerously packed outlet). The boys are then ushered quickly up the stairs to bed. The next morning, Ralphie wakes up to see that fresh snow has fallen overnight and goes downstairs eagerly with his brother, who claims that everything in sight is his. Their parents follow suit and presents are unwrapped with frantic excitement (except for socks). When all is said and done, Randy lies sleeping amid the wrappings with his toy zeppelin as Ralphie sits on the couch with his parents. His father asks if he got everything he wanted that year before pointing out a mysterious package behind the desk. Ralphie goes to unwrap it and finds what he thought he'd never get; the Red Ryder BB gun. His father chuckles as he fills it with BB pellets and asks to try it out. Mr. Parker explains to his wife that he had one when he was eight years old, though she still worries Ralphie will hurt himself. Ralphie runs outside and sets up his metal target board while his father drools over the Christmas turkey his mother is making. Ralphie takes aim, fires, and falls back; the pellet having bounced off the target and hitting him on the cheek, knocking his glasses off. Fearful for a second that he actually did shoot his eye out, the half-blind Ralphie collects himself and looks for his glasses but accidentally steps on them, breaking them. Despondent, he tries to think of a way to explain the accident to his mother and decides that an icicle falling off the garage would have to work. He fakes some tears and goes to his mother. She takes him to the bathroom upstairs to wash his face off (though Ralphie is ecstatic that his plan worked) and gives him an old pair of glasses to use. Meanwhile, the Bumpuses' street bloodhounds get into the house and run rampant through the kitchen, eating all of the turkey. Mr. Parker chases the dogs out, yelling at the top of his lungs, before announcing to everyone that they're going out to eat. They go to a Chinese restaurant where the family listens to the waiters' attempts to sing carols before the main course is brought out, with its head still intact. The owner ( John Wong) casually takes out a butcher knife and chops the head off while the family claps and begin to eat. That night, Ralphie sleeps with his Red Ryder held close, the best Christmas gift he ever received, dreaming of hunting ducks and making spectacular shots.",
      "writers": [
         "Jean Shepherd",
         "Jean Shepherd"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0085334/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NzY1NjkyMV5BMl5BanBnXkFtZTcwMjYxNjE0MQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Peter Billingsley, Melinda Dillon, Darren McGavin | See full cast and crew »"],
      "reviews": [
         "\"A Christmas Story\" is a rare film about children yet for adults. While kids will definitely enjoy this Christmas-themed saga, adults will find a deeper level of depth than they may remember from seeing the film at a younger age. The movie strikes a sharp contrast between the exaggerated, polysyllabic narration of Ralphie, filled with nostalgia and lucid memories, and the soft, high-pitched childlike wonder of Ralphie's spoken word. The narrator is clearly not the same character as the one portrayed on film, but a character wholly outside the story, reliving his childhood emotions and anecdotes. Yet he is the heart of the film, the true center of gravity. This is because the movie is not about a scary Santa Clause and a BB gun - it's about childhood memories and the feelings they evoke. To that end, \"A Christmas Story\" is flawless. \"A Christmas Story\" tells of the epically materialistic journey of Ralphie (Peter Billingsley) as he searches for the golden, upheld idol of all red-blooded American boys: A Red Rider Air Rifle. Ralphie spins an intricate web of cunning and deceit as he plots to get his hands on it - including an essay, a trip to Santa Claus and more. The movie also shows us a glimpse of his family - his irritable, foul-mouthed father with a good heart, his whiny brother Randy, and his sweet, all-American mother. It is not so much a continuous story as a series of vignettes, but it ultimately serves the movie's purpose. This is a funny film. The narration by Jean Shepherd is filled with love for this story. He absolutely captures the emotions and logic of childhood. In a subtle but amusing moment, Shepherd intones the incomparably eloquent pouring forth of thought into writing - only to have Billingsley note in his awe-filled, high-pitched voice that \"I think everyone should have a Red Rider BB gun. It's very good for Christmas.\" (paraphrased). Most of the humor is similar - the natural exaggeration of a child as expressed by Shepherd's consistent string of hyperbole. Also, there's a reason why it's played constantly on cable TV throughout the Christmas season - it's a movie everyone can relate to. There are moments of such pure truth here that few can deny their power. I'm sure that there is a scientific law left unwritten that determines that every kid must at some point fantasize about his parents feeling absolutely terrible and forever regretting some unutterable punishment they inflicted on their child - in this case, the immortal washing of a mouth out with soap. Obviously, \"A Christmas Story\" is not a film that can be compared to Casablanca or Citizen Kane. It simply excels at its simple goals, and comes together as an extraordinarily entertaining piece of cinema.",
         "I lived the life of Ralphie! Even though I'm a girl and was born in the late seventies, my Christmases were much the same as Ralphie's. From playing Santa on Christmas morning to sipping my Dad's Christmas cocktail to visiting Santa at the department store, I lived the very same Christmas memories. This movie brings out the true essence of Christmas happiness. Everyone, young and old, can relive the magic of being a child. Ralphie's vibrant imagination and inventiveness in his ploys to seduce his parents into buying him the ultimate gift are \"pinch-his-chubby-cheeks\" adorable. And Randy...need I say anything?? He is the perfect picture of the baby brother! This movie is universal in its appeal to audiences of all ages, race, and nationalities. My husband, who grew up in Lebanon and who's first language is Arabic, even knew the famous \"oh fudge\" line when I first played this movie for him here in the States. I get giddy every time I sit down to watch this movie. Curling up with a warm cup of cider in front of the fireplace, wrapping Christmas presents, making Christmas cookies, or writing a letter to Santa Claus...those are all perfect times to watch this classic family film. This has been and always will be my all-time favorite Christmas film.",
         "Nostalgic tale of a Ralphie Parker (Peter Billingsley) growing up in the 1940s (I believe). He wants nothing more than a Red Ryder Ranger Model Air Rifle (a BB gun for short) for Christmas but everyone tells him it will \"shoot your eye out\". That's about it for plot but the film has sequences that every child (and adult) can relate to. My favorites: Ralphie's best friend getting his tongue stuck to a pole when he's dared to lick it; Ralphie accidentally swearing in front of his father; the bully that threatens Ralphie and his friends every day until Ralphie beats him up (in a GREAT scene); Ralphie's constant fights with his little brother (wonderfully played by Ian Petrella) and Billingsley and his brother being terrified by a department store Santa. Also Melinda Dillon and Darren McGavin are just great as the parents-- especially Dillon. She has one uproarious scene where she gets Petrella to eat by imitating a pig! This was totally ignored when it came out in 1983 but has slowly developed a cult following. It's now considered one of the best Christmas movies ever made--right up there with \"It's a Wonderful Life\" (which was also ignored at its release). A charming, wonderful Christmas film. A 10 all the way!",
         "A Christmas Story touches my heart as does no other film, and I know the reason for this is because it reminds me so much of my own 1950's boyhood. For sure it strikes a nerve in persons of my generation. This is Bob Clark's masterpiece and I know I am not the only person who feels this way. I am going to assume that, if you are reading this, chances are you have seen the film; indeed, probably have seen it countless times as I have. This is not a film review in the normal sense. It is more a reminiscence and appreciation of a great story captured for all time in moving pictures which, in turn, captured the essence of the time and place of its setting; that time and setting being a typical town in Indiana during Christmas season in the 1940s as we observe a typical family (the Parkers) with two young sons named Ralphie and Randy. Most of us over the age of 50 can relate very well to the story's key elements. I recall vividly family outings to crowded downtown sidewalks, Mom and Dad squeezing in a season's worth of shopping in one day and doing it under the nose of one who had a visit to Santa Claus on his mind. Staring at the prominent HIGBEES sign in the downtown square, I could almost see the words John A. Brown in its place. Browns was the main department store in my hometown of Oklahoma City and the place where I would make my annual visit with Santa Claus. I am sure most who have seen the film realize this is Ralphie's story, but Melinda Dillon as the typical 1940's stay-at-home mom and Darren McGavin as the grumpy but kindly father made the story work. The stove in the Parker's kitchen reminds much of the one my grandmother had, and the rest of the house reminded me of the home my other grandparents lived in. As you see, viewing A Christmas Story is always a magical experience for me. It is almost as if Mr. Clark made this film with Tom Fowler in mind. There are so many comments to make. It will be impossible to relate them all in a short review, but here are some that I know people my age will be most familiar with: Beautiful toys displayed in department store windows. The agonizingly long wait for toys ordered via mail and learning too late they are not quite what was expected. The excitement of buying a Christmas tree, the joy of setting it up and how much bigger Christmas trees seemed then. Neighborhood bullies who were not nearly as tough as they seemed. Ralphie wanting a BB gun more than life itself. Mom covering trouble for Ralphie to his dad, and the same mom making him eat soap for uttering words -- learned from Dad. Randy sitting underneath the kitchen sink when depressed. A panicky visit to a tired Santa. An unwanted gift from a well-meaning aunt. The furious unwrapping of gifts on Christmas morning. I could go on and on. I will make two more observations and then will sign off and let somebody else speak. In the film's sweetest scene, we see Dad coming through for his son at the last possible moment. To see the look on young Ralphie's (ably played by Peter Billingsley) face as he unwraps his best and last gift is one of filmdom's true golden moments. But, for me the best moment was the last. Ralphie is in bed at film's end. We see snow outside and Ralphie dreaming of his wonderful gift, as the story's author and narrator Jean Shepherd, speaking as the grown up Ralphie, realizes this was the best Christmas he ever had, or ever would have. If you are middle age or older and have not seen A Christmas Story, you are perhaps unaware that you have cheated yourself. Buy or rent the 2003 20th anniversary DVD. It will be the best money you spend this Christmas -- or any Christmas.",
         "A Christmas Story, there is absolutely no way that anyone could ever say they never saw this film since it's shown every Christmas, especially on TNT when they do the 24 hours of A Christmas Story, lol. But onto the movie, I've watched A Christmas Story since the day I was born, it's one of those films you never get sick of because of the simple fact that each year of your life you could relate to it in some way. Each character has these memorable moments and you could say that you've been in the same situation. It's great seeing this movie because it makes us laugh about the silliest moments in our life during the Christmas season. Ralphie is a little boy who just so badly wants a B.B. gun for Christmas, it's just his dream. Only one problem, it'll shoot his eye out according to the adults around him. We go through Christmas with Ralphie and his family, his father who is obsessed with a prize leg lamp he won. His mother who is greatly under-appreciated but extremely loving. His brother, Randy, who is your typical silly and annoying younger brother who makes fun of him. And his friends who are on a constant run from the school bully. But all Ralphie can think about during this hard time in his adolescence is that B.B. gun. A Christmas Story has constant unforgettable scenes, like the pink bunny out fit that Ralphie gets as a present from his aunt, him saying his first swear in front of his dad, Mom and Dad's fight over using the glue on purpose, visiting Santa at the mall, and of course that great ending that is sure to bring a that is sure to bring a tear to your eye. It's just the perfect Christmas movie that is a BIG recommendation for the season. It has great comedy, terrific acting, and just the most touching moments you'll ever see in a Christmas movie. 10/10",
         "Ralphie (Peter Billingsley) wants a Red Rider BB Gun for Christmas but his mother is totally against it - the \"you'll shoot your eye out\" discussion being a major opposition. This is essentially a story about childhood and is very spot-on in regards to the yearning of children and the whole Christmas era - I've been watching it since I was a child and every Christmas when it comes on TV I watch it again. It's funny, poignant and totally memorable - it has some of the best scenes of all-time and although I know a few people who dislike it because it's a bit \"weird\" and \"dark,\" most people I know love it. Worth watching every Christmas, forever!",
         "12 reasons that A Christmas Story is a modern Classic! 12: \"Fa-Ra-Ra-Ra-Ra Ra-Ra-Ra-Ra\" 11: \"Don't forget to drink your Ovaltine\" 10: \"Nadafinga!!\" 9: Ralphie's pink bunny outfit 8: Scut Farkus' yellow eyes 7: \"Fuuuuuuuudddggee\" 6: \"Randy...how do the little piggies eat?\" 5: \"Fra-Gi-Le...it must be Italian\" 4: \"Where's the glue?\" \"We're out of glue!\" \"You used up all the glue on purpose!!\" 3: \"I triple-dog dare ya!\" 2: \"Alright, I'll get that kid to eat. Where's my screw driver and my plumber's helper? I'll open up his mouth and I'll shove it in\" ... and, of course, the #1 reason: \"You'll shoot your eye out, kid!\" A Christmas classic and tradition in every sense of the word!",
         "A Christmas story is a classic holiday film that is very funny and entertaining. This is a movie that should be viewed by everyone, and can been seen on television during thanksgiving and Christmas time. In most families, this film is already a tradition to watch every year and that's because it has a wonderful plot, great characters and believable actors. A Christmas Story is about an average middle class family living in a small town in the 1940's. The film contains an average family of a regular husband and wife relationship and two young boys. The eldest of the boys is named Ralphie (Peter Billingsley) who is the star of the film. All that Ralphie wants is to have a perfect Christmas containing the perfect gift, a Red Ryder carbon action BB gun. This is all that Ralphie can think about day and night. When Ralphie has to write a Theme about what he wants for Christmas, his teacher replies to him `you'll shoot your eye out' which seems to be the only reply to him throughout the whole film. What makes this film so great is the ability to relate to Ralphie with his problems throughout the movie, such as wanting that one gift that everyone thinks that you're too young to have and are unable to get. The acting is very convincing and makes you think that this could even be you in the movie. There are some very hilarious parts in this film that also make it very good. This particular scene also contains some very cheesy acting which also makes it funny. Ralphie has a dream about getting his Red Ryder BB gun and saving his family from a bunch of evil villains. In this scene Ralphie is wearing the white sparkly cowboy suit and he shoots down the evil villains and saves the day with his gun in a very unrealistic way. There really wasn't much music that can be commented on in this movie, just that it was the orchestral type of music that was out in the time period of the 40's. The costumes where great and convincing. I also liked how real they made the 40's look. You actually think it might have been made in that time period which makes the film very authentic. I would recommend this film to anyone who wants some holiday laughs and some great family time together. I would rate this film a 9 out of ten because it's so memorable.",
         "How difficult is it to perfectly capture nostalgia? It must be pretty darn difficult or else everyone would make movies like this. It may not be absolute perfection but Jean Shepherd, Bob Clark and the outstanding cast came as close as anyone here. Creating a story centered around nostalgia is a tricky thing as the memories that creates it are unique to each of us. The themes, however, are similar and that's where the success lies. I didn't want a Red Ryder BB gun when I was that age but my Christmas wish was just as fervent and I schemed just as hard as Ralphie. The bully at my school didn't have yellow eyes but he was pretty much like Scut Farkus. And so on, from the fantastically flawed parents to the pop-heroes, A Christmas Story captures it all. Truly wonderful.",
         "Peter Billingsly in a custom made role as Ralphy, the 9-year old who wants a toy rifle for Christmas in 1940 Cleveland. Everyone from his mom to his teacher, to even Santa Claus himself tell him that \"he'll shoot his eye out\" and should not have such a dangerous toy. Many wonderful scenes of \"boys will be boys\" trouble, including the unforgettable \"tongue frozen to the flag pole\" make this movie a delight to watch again and again. As an added bonus there is much authentic Cleveland nostalgia, including the old wooden escalators at Higgbees and the main Square in front of Tower City. Add this to your Christmas Classics and place it right next to \"Miracle on 34th Street\" and \"It's A Wonderful Life\"!"
      ],
      "genres": [
         "Comedy",
         "Family"
      ],
      "productionCompanies": [
         "Metro-Goldwyn-Mayer (MGM)",
         "Christmas Tree Films"
      ],
      "summaries": [
         "Christmas is approaching and 9 year-old Ralphie wants only one thing: a Red Ryder Range 200 Shot BB gun. When he mentions it at the dinner table, his mother's immediate reaction is that he'll put his eye out. He then decides on a perfect theme for his teacher but her reaction is like his. He fantasizes about what it would be like to be Red Ryder and catch the bad guys. When the big day arrives he gets lots of present under the tree including a lovely gift from his aunt that his mother just adores. But what about the BB gun?",
         "Adult Ralph Parker is remembering back to a Christmas season when he was nine years old living with his parents and his younger brother Randy in the northern Indiana town of Holman. Then largely known as Ralphie, he, like most kids, loved Christmas, his favorite time of the year. He often fantasized about things that he knows now would never happen, but that within a kid's mind is totally plausible. That Christmas was memorable for: his contest-obsessed father winning a prize for the first time in his life, that prize which would be the bane of Ralphie's mother's existence; his father's seemingly never-ending battle with the furnace in the house and the neighbor's pack of dogs; his mother's attempts to get Randy to eat, he at a stage when he never ate anything voluntarily; Ralphie's changing view toward the Little Orphan Annie radio program and commercial advertising; Ralphie and his friends Schwartz and Flick's changing battle with Scut Farkus and Grover Dill, their primary bullies; the triple dog dare Schwartz issued to Flick; and Ralphie's new relationship with Lifebuoy soap. But most memorable was what he wanted more than anything for Christmas: an official Red Ryder carbine action 200-shot range model air rifle, aka a BB gun. As it looked increasingly like he was not going to get this prized gift, Ralphie went about trying to manipulate and outwit those he thought would either be the decision makers or influencers of that gift, namely his parents, his teacher, Miss Shields, and the big guy at the North Pole, even if he was in the form of a less than empathetic department store version.",
         "Ralphie, a young boy growing up, dreams of owning a Red Rider BB gun. He sets out to convince the world this is the perfect gift. But along the way, he runs into opposition from his parents, his teacher, and even good ol' Santa Claus himself.",
         "It's 1940, in the northern Indiana town of Hohman. 9-year-old Ralph \"Ralphie\" Parker wants only one thing for Christmas -- an official Red Ryder carbine-action 200-shot range model BB rifle with a compass in the stock. Between his younger brother Randy and having to handle school bully Scut Farkus, Ralphie doesn't know how he'll ever survive long enough to get the BB gun for Christmas. When Ralph asks his mother for a Red Ryder BB gun for Christmas, she says, \"No, you'll shoot your eye out\". When Mrs. Shields, Ralph's teacher at Harding Elementary School, assigns the class to write a theme about what they want for Christmas, Ralph sees a golden opportunity to express his desire to have a Red Ryder BB gun. Ralph gets a C+ on the theme, and Mrs. Shields has written \"You'll shoot your eye out\" on the theme. Ralph's next plan is to ask Santa Claus for a Red Ryder BB gun, and how does Santa respond? By saying \"You'll shoot your eye out, kid.\" By this time, Ralph has had enough of that. When Scut Farkus and his sidekick Grover Dill start in on Ralph while he's on his way home from school that day, Ralph knocks Grover Dill to the ground, beats Scut's face bloody, and then pounds Scut's head on the snow-covered ground several times. Ralph thinks he'll never get the BB gun for Christmas now. And all of the other kids are going to be getting what they want for Christmas. But someone may have planned a surprise for Ralph.",
         "It's Christmas time and there's only one thing on Ralphie Parker's Christmas list this year: a Red Ryder Carbine Action 200-Shot, Range Model Air Rifle, but many obstacles stand in the way of his dream because every adult that he confronts keeps telling him he'll shoot his eye out. Meanwhile The Old Man just got a major award (a lamp shaped like a woman's leg), and Mom is making sure The Old Man doesn't come near her turkey, Ralphie's friend gets his tongue stuck to a flag pole, and Ralphie utters the f-word in front of his father. Christmas is drawing nearer and Ralphie visits Santa at the department store in hopes of asking him for his dream gift. Will he receive it? Let's hope so.",
         "Ralphie has to convince his parents, his teacher, and Santa that a Red Ryder B.B. gun really is the perfect gift for the 1940s."
      ],
      "budget": 4000000
   },
   "movielensId": 2804,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1983-11-18",
      "dvdReleaseDate": "2003-10-07",
      "directors": ["Bob Clark"],
      "runtime": 94,
      "movieId": 2804,
      "title": "A Christmas Story",
      "mpaa": "PG",
      "actors": [
         "Melinda Dillon",
         "Darren McGavin",
         "Peter Billingsley",
         "Jean Shepherd",
         "Ian Petrella",
         "Scott Schwartz",
         "R.D. Robb",
         "Zack Ward",
         "Yano Anaya",
         "Tedde Moore",
         "Jeff Gillen",
         "Leigh Brown",
         "Bob Clark",
         "Leslie Carlson",
         "Jim Hunter"
      ],
      "imdbMovieId": "0085334",
      "originalTitle": "A Christmas Story",
      "genres": [
         "Comedy",
         "Family"
      ],
      "youtubeTrailerIds": [
         "uvMLfSQrHKE",
         "0_jNL-KD43c"
      ],
      "plotSummary": "The comic mishaps and adventures of a young boy named Ralph, trying to convince his parents, teachers, and Santa that a Red Ryder B.B. gun really is the perfect Christmas gift for the 1940s.",
      "tmdbMovieId": 850,
      "avgRating": 3.9906,
      "releaseYear": "1983",
      "numRatings": 14683,
      "posterPath": "/1dSFarRSXwMjFODxPTwyaiNZotF.jpg"
   }
}