{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "marriage proposal",
            "id": 1459
         },
         {
            "name": "fbi",
            "id": 1812
         },
         {
            "name": "mafia boss",
            "id": 6220
         },
         {
            "name": "mafia",
            "id": 10391
         }
      ],
      "imdb_id": "tt0130121",
      "video": false,
      "title": "Mickey Blue Eyes",
      "recommendations": [
         2020,
         2058,
         12280,
         11472,
         9713,
         9310,
         11566,
         10859,
         11353,
         8970,
         10563,
         10480,
         10765,
         11374,
         11821,
         11467,
         6472,
         9440,
         9099,
         11622
      ],
      "backdrop_path": "/jhvz3UQzKjUXD12QXFQhuZ0Gpk7.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Michael Felgate",
               "gender": 2,
               "credit_id": "52fe43369251416c75007d15",
               "name": "Hugh Grant",
               "profile_path": "/lzCB9YN6MjGosh8v27o6omhSmjL.jpg",
               "id": 3291,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Frank Vitale",
               "gender": 2,
               "credit_id": "52fe43369251416c75007d19",
               "name": "James Caan",
               "profile_path": "/g4bxNXWft1jLZX8gKk4G6ypkTUf.jpg",
               "id": 3085,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Gina Vitale",
               "gender": 1,
               "credit_id": "52fe43369251416c75007d1d",
               "name": "Jeanne Tripplehorn",
               "profile_path": "/pZcw8RXsRSO9WXHOrQqentISWYv.jpg",
               "id": 10478,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Vito Graziosi",
               "gender": 2,
               "credit_id": "52fe43369251416c75007d21",
               "name": "Burt Young",
               "profile_path": "/rbSsSkQ72FoGcvwIHUxQWJ92I3W.jpg",
               "id": 4521,
               "order": 3
            },
            {
               "cast_id": 13,
               "character": "Philip Cromwell",
               "gender": 2,
               "credit_id": "53e3d76cc3a36848530025af",
               "name": "James Fox",
               "profile_path": "/27vddrOyr0jnT2pi17cFoKPro4A.jpg",
               "id": 1292,
               "order": 4
            },
            {
               "cast_id": 14,
               "character": "Vinnie D'Agostino",
               "gender": 2,
               "credit_id": "53e3d785c3a368485c002573",
               "name": "Joe Viterelli",
               "profile_path": "/3HhSpMcoWk4fucH6DSTU66x2D0g.jpg",
               "id": 60023,
               "order": 5
            },
            {
               "cast_id": 15,
               "character": "FBI Agent Bob Connell",
               "gender": 2,
               "credit_id": "53e3d79fc3a36848530025b3",
               "name": "Gerry Becker",
               "profile_path": "/4oXmbOtBU18w0eB5Jaj7OACvEpG.jpg",
               "id": 19468,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Carol the Photographer",
               "gender": 1,
               "credit_id": "53e3d7bac3a368484d0025ff",
               "name": "Maddie Corman",
               "profile_path": "/358wSv3l3FPhNTcpcalQvRVXQB4.jpg",
               "id": 121757,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Angel",
               "gender": 2,
               "credit_id": "53e3d7cdc3a368484d002602",
               "name": "Tony Darrow",
               "profile_path": "/ckz3hqyTyRiwVEauD6PBgvrQw0u.jpg",
               "id": 11482,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Ritchie Vitale",
               "gender": 2,
               "credit_id": "53e3d7e6c3a368484d002606",
               "name": "Paul Lazar",
               "profile_path": "/tYql2muBX2aJpUtteoRmPSLcJTl.jpg",
               "id": 138988,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Al",
               "gender": 2,
               "credit_id": "53e3d7f5c3a36848580026d2",
               "name": "Vincent Pastore",
               "profile_path": "/4SlzY9TtgQKDVu2GIYu3M73MxeP.jpg",
               "id": 47774,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "FBI Agent Lewis",
               "gender": 2,
               "credit_id": "53e3d828c3a3684850002659",
               "name": "Scott Thompson",
               "profile_path": "/yBq2XSBkiVpWd7hVjvTvdSPJ4mP.jpg",
               "id": 78576,
               "order": 12
            },
            {
               "cast_id": 22,
               "character": "Johnny Graziosi",
               "gender": 2,
               "credit_id": "53e3d85fc3a36848470025ee",
               "name": "John Ventimiglia",
               "profile_path": "/ws3R1TndkITQMGBariX3UaUjqXP.jpg",
               "id": 87707,
               "order": 13
            },
            {
               "cast_id": 23,
               "character": "Sante",
               "gender": 2,
               "credit_id": "5814a238c3a3687a9d030b22",
               "name": "Frank Pellegrino",
               "profile_path": "/3GiQU6gYC1DNy0PfknJovVdKopF.jpg",
               "id": 1701137,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d27",
               "name": "Kelly Makin",
               "profile_path": null,
               "id": 64030,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d2d",
               "name": "Adam Scheinman",
               "profile_path": null,
               "id": 64031,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d33",
               "name": "Robert Kuhn",
               "profile_path": null,
               "id": 51216,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43379251416c75007d39",
               "name": "Elizabeth Hurley",
               "profile_path": "/fVcP55KQlaIcOrlHoBGf671kmZb.jpg",
               "id": 13918,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d3f",
               "name": "Charles Mulvehill",
               "profile_path": null,
               "id": 3222,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d45",
               "name": "Basil Poledouris",
               "profile_path": "/jEUcVOa9gppkDvr5MJOvSD5KVtj.jpg",
               "id": 7728,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d4b",
               "name": "Donald E. Thorin",
               "profile_path": null,
               "id": 6490,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43379251416c75007d51",
               "name": "David Freeman",
               "profile_path": "/lmGZ6v9vHrzvRBEzW2dvhMO06Q8.jpg",
               "id": 27903,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 8.489496,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 10154,
      "vote_count": 171,
      "budget": 0,
      "overview": "An English auctioneer proposes to the daughter of a mafia kingpin, only to realize that certain \"favors\" would be asked of him.",
      "similar": [
         7516,
         10651,
         1422,
         1538,
         156022,
         9873,
         8012,
         261023,
         64689,
         2099,
         2252,
         186,
         101,
         968,
         9366,
         769,
         273481,
         193893,
         168672,
         594
      ],
      "original_title": "Mickey Blue Eyes",
      "runtime": 102,
      "poster_path": "/oJsTBcWZcvcb8rseT2FraKDUo5r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/7znWcbDd4PcJzJUlJxYqAlPPykp.png",
            "name": "Castle Rock Entertainment",
            "id": 97,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-08-16",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "A romantic comedy you can't refuse",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kelly Makin"],
      "runtime": 102,
      "synopsis": "An auctioneer finds his new intended has Mob relatives who ask certain favors of him.",
      "writers": [
         "Adam Scheinman",
         "Robert Kuhn"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0130121/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU5MTU0MjExMV5BMl5BanBnXkFtZTcwNDYwOTIyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Hugh Grant, Jeanne Tripplehorn, James Caan | See full cast and crew »"],
      "reviews": [
         "This was great. People exaggerate the amount of roles where Hugh Grant plays the loveable Englishman. There's only been 3 to my knowledge. I don't really care anyway, as he is brilliant in that role. DeNiro, John Wayne, Morgan Freeman etc generally play the same role in their films and it doesn't put the viewer off. This wasn't up to Four Weddings or Notting Hill standard. The story line let it down, but only slightly. You need to be of a certain intelligence level to find the satire & dry wit of these films, funny. Give me that anyday to the sex & masturbation gags in most films or the childish braindead crap from Adam Sandler or Jim Carrey that that mistakenly falls into the genre of 'humour.' It's such an easy film to watch and enjoy. There's more humour at the beginning than the end of Mickey Blue Eyes, but it has at least half a dozen laugh out loud scenes and is worthy of a mark far superior than 5.8/10. Highly recommendable, a very high ... 8/10",
         "Just happened to rent this one on a whim, mainly due to the cast - Hugh Grant and James Caan - and was surprised to find a much better than average comedy. When the world of a sophisticated English-born art auctioneer in a Tony Manhattan auction house collides with the world of the New York mob, one expects a universe of comic opportunities, and the movie pays off in spades. James Caan is becoming one of those rare actors who is as adept at comedy as at heavier roles. The script is intelligently funny, and the movie is loaded with riotously incongruous situations. The scene where Caan attempts to teach the debonair Hugh Grant how to say \"fuggedaboutit\" in a hood's accent is alone worth the price of the movie. An overlooked delight.",
         "This is a comedy all the way, and one of the funnier \"gangster\" comedies I've seen, in tone reminds me a lot of \"Analyze This.\" Hugh Grant is the boyfriend and Jeanne Tripplehorn is his girl, but she refuses when he proposes because her father is a mobster (James Caan, in a perfect role) and she knows they would suck in her innocent auctioneer. The writing is refreshingly good and Grant's delivery makes it go. Here I disagree strongly with critic Ebert who thinks Grant was not right for the role. My favorite scene, I laughed so hard I had to back it up and watch again, Grant has to pretend in a restaurant that he is \"Mickey Blue Eyes\" from a Kansas City gang, and his poor imitation of NYC gangster talk is hilarious. This film has no lasting value but is very entertaining, enough so that I think it deserves an \"8\". I saw it on DVD, nothing remarkable about the presentation, but nothing wrong either.",
         "The whole idea of the movie is pretty creative, but near the end of the movie, the story got a little predictable (that's all I'll say about the plot... so no I'm not spoiling anything.) However, I laughed to the point I was literally in pain. A lot of pain. Especially during \"the restaurant scene\". Even after the movie I was still giddy, and I started laughing hysterically in the parking lot of the movie theater. An aftershock I guess? If you're looking for a good laugh you should go see it. If you're looking for a strong plot, save your time and money.",
         "This was an entertaining comedy, similar to several other films I've seen in which an innocent-appearing nice guy gets caught up in the middle of a mob family. (i.e. Matthew Broderick in \"The Freshman.\") In this film, it's Hugh Grant who winds up in mobster James Caan's clan. The latter isn't known for his comedy but he's good at it. Sometimes just the facial expressions on Caan's face brought out big laughs with me. Joe Viterelli is perfect for any Mafia-type story, as is Burt Young. It was a little strange, though, to see Young look like such a shriveled up old man. Jeanne Tripplehorn provides the romantic interest in here. My only complaints were too much usage of God's name in vain, especially for a comedy, and the typical on again-off again marriage plans you've seen so many times in movies for many decades. Overall, however, a good lighthearted comedy that should please a lot of people.",
         "It took only a few movies for Hugh Grant to become a caricature of himself. He first gained notice as the hopeless romantic in \"Four Weddings and a Funeral.\" Audiences fell in love with his good looks, deadpan delivery and ability to convey hurt. He was even better in \"Notting Hill,\" and added just the right note of foppishness. But in \"Mickey Blue Eyes\"-perhaps because he is miscast-all of these once-endearing traits now seem annoying. The floppish hair once endearing in Notting Hill now seems to be a distraction. His repeated use of the word \"right,\" just right in Notting Hill, seems annoying here. Perhaps the problem is that the previous two films were fresh and well written. \"Mickey Blue Eyes\" is neither. Perhaps it's time for Grant's character to move in a new direction and to once again display the talent he showed in \"Remains of the Day.\" \"Mickey Blue Eyes'\" plot about an auctioneer about to become engaged to what turns out to be a Mafia princess is okay. And the idea of using an auction to launder money is fresh. But the second half of the film goes down hill quickly. And the supposed tragic ending is too obviously a ruse. The only two saving graces in the movie are James Caan and Scott Thompson. It's been fascinating to watch Caan move from pretty boy (\"Lady in a Cage\" and \"El Dorado\") to real life and screen tough guy (\"The Godfather\") and now to comedian. Watch Caan's eyes-they seem to be in conflict with the rest of his body, letting us know that he knows a lot more than he's letting on. Thompson, of the \"Kids in the Hall\" troupe, shines here as an FBI agent. He steals every scene he's in.",
         "The previews that I saw for this movie promised it to be a very funny movie...and for the most part it was but it could have been better. The movie is about a conservative British fellow (Hugh Grant) that runs an auction house in New York. He decides to propose to his girlfriend (Jeanne Tripplehorn) but she has reservations about marriage as her father has connections to the mafia. In her opinion, this marriage will not work as Grant's character will invariably be sucked into the organized crime life. He assures her that he won't and they decide to go ahead with the marriage. As you guessed it, Grant does become entangled and what ensues is a humorous \"fish-out-of-water\" comedy as Grant tries to get himself out of a mess. For the most part, the characters were well played. Hugh Grant does a good job, albiet familiar to other characters that he's played recently (and probably not too unlike his real self) but it was nonetheless well played. Most of the humor revolves around his character and his ability to deliver the lines and timing is very well done. The same cannot be said for Jeanne Tripplehorn's character. She seemed to overact some scenes and others it seemed that she wasn't quite sure how to portray the character. At times, it almost made me feel uncomfortable trying to watch her find her role. James Caan did a very good job of playing the father and in some cases, he stole some scenes. The rest of the actors played their roles fairly well although many of these actors have been typecast as the mafia type character. Although the movie was fairly amusing, there were places that it seemed to drag a little bit. A sign of a good movie for me is how much my mind wanders and this did happen in some places. In my opinion it could have been even funnier but in general it was pretty good. Overall, I found it to be entertaining and genuinely funny...7/10.",
         "Key Words: Cute / Funny / Stumbles & Mumbles / Nice Ending This often-told tale of accidently getting involved with the Mob (\"Family\") is well done here with lots of humor. Hugh stumbles and mumbles as he tries to walk the thin line of getting wed to his sweetheart without getting sucked in by the Mob that her father works for. There are some really well crafted humorous scenes, and the ending is more complex and surprising that I had expected. The Italian music that runs through the flic will have you humming along after the credits roll. I thoroughly enjoyed this light bit of fluff...........",
         "So perhaps this isn't the best romantic comedy out there, but it certainly did have a few interesting twists, and some generally funny moments to it. Hugh Grant was the bumbling and charming Brit he always is, Jimmy Caan was great as the mob member daddy to Jeanne Tripplehorn. It's a fun film to watch and I think most people will enjoy it.",
         "Hugh Grant is in someways a modern version of a comic actor who I have had problems with in viewing: Charles Butterworth. Butterworth would hem and haw, afraid of making some social faux pas while pursuing whatever business occupied his activities on screen. This diffidence while mildly amusing could get tedious after awhile. Similarly Grant will hesitate, and stammer a bit. But his English manners, and his good looks make his hesitancy far more easy to accept than Butterworth's. Certainly his good looks have made him an easy leading man type (whereas Butterworth always played in supporting roles). MICKEY BLUE EYES gives Grant far more to be nervous and hesitant about. He plays Michael Feldgate, a highly successful auctioneer at a leading house in Manhattan (his boss is Philip Cromwell (James Fox)). Michael has been romancing a schoolteacher named Gina Vitale (Jeanne Tripplehorn), and has finally decided to propose to her. Besides causing an unintentional series of uproars in a Chinese restaurant, he is surprised to find Gina less than enthusiastic. After he meets her father Frank Vitale (James Caan) he follows Gina home and learns the reason for Gina's lack of enthusiasm (though not lack of love). Frank is a member of a Mafia family headed by Vito Graziosi (Burt Young), and Gina was always afraid that if Michael and she married he'd be trapped into the Mafia way of life sooner or later. Uneasily Gina agrees to the wedding, with Michael insisting that with her assistance he can avoid any real problems from Graziosi and his gang. But soon the subtlety of the mobsters proves too much for Michael (with or without Gina's help). Graziosi realizes that auctioning art can be useful as a way of laundering dirty mob money (he can have debts paid by having various debtors settle what they owe by buying items the mob puts up at auction). And Michael soon finds he is auctioning art by Graziosi's violent mental case son Johnny (John Ventimiglia) that are setting records - records the F.B.I. are showing great interest in. While worrying about this, Michael is also under pressure of trying to present a good, respectable front for a potentially lucrative client. Somehow the mobsters and the F.B.I. just don't seem to help create this image. Michael finds that everything Gina suggests, or her father Frank tries to help with fails, and soon the Englishman finds he is in the middle of an unwanted killing - one that can set off a mob war. He also finds that he has to parade around town with his erst-while father-in-law as an out-of-town underworld torpedo named \"Mickey Blue Eyes\" (actually, \"Young Mickey Blue Eyes\" from Kansas City, as opposed to \"Old Mickey Blue Eyes\" his dead dad, and the original \"Mickey Blue Eyes\" from Chicago!). This includes burying a corpse in an overused waste land, and ordering steak in a restaurant where \"Mickey\" is barely understood talking a version of underworld English, and upsetting customers by his anti-English remarks and his constantly dropping his gun. The cast is wonderful, led by a continually drained Grant who can't find any way out of the deeper and deeper hole he is in, Caan who has found that he has a comfortable niche in the mob - but has somehow lost his daughter's trust, Tripplehorn who finds that she is bloodily closer to the mob than she ever expected or wanted to be, Young who is properly sinister but ruthlessly smart, and Fox who constantly trying to put the best face on the worst situations (like talking to his potential client about respectability, opening a door, and finding Grant shaking his behind in front of his fiancé!). Even that late budding comic \"goon\" actor Joe Viterelli (who played \"Jelly\" in the ANALYZE THIS and ANALYZE THAT films) has a nice moment where he watches a television commercial about a very strong adhesive tape that can even bind people's hands - and makes a note for future reference when he needs to bind some person's hands! Until the last comic twists of the plot, the film entertains, and is certainly worth a \"10\" out of \"10\" on the scale here."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "productionCompanies": [
         "Castle Rock Entertainment",
         "Polygram Filmed Entertainment",
         "Simian Films"
      ],
      "summaries": [
         "An art-house auctioneer finds himself getting in deeper and deeper with the mob after learning that his teacher girlfriend is the daughter of a major mobster. Things get worse when a godfather decides to launder his no-talent son's gory paintings through the art house and gets the FBI into the picture. Everything then falls apart when the son is accidentally shot.",
         "An English auctioneer proposes to the daughter of a mafia kingpin, only to realize that certain \"favors\" would be asked of him."
      ],
      "budget": 40000000
   },
   "movielensId": 2805,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-08-16",
      "dvdReleaseDate": "1999-12-28",
      "directors": ["Kelly Makin"],
      "runtime": 102,
      "movieId": 2805,
      "title": "Mickey Blue Eyes",
      "mpaa": "PG-13",
      "actors": [
         "Hugh Grant",
         "James Caan",
         "Jeanne Tripplehorn",
         "Burt Young",
         "James Fox",
         "Joe Viterelli",
         "Gerry Becker",
         "Maddie Corman",
         "Tony Darrow",
         "Paul Lazar",
         "Vincent Pastore",
         "Scott Thompson",
         "John Ventimiglia",
         "Frank Pellegrino"
      ],
      "imdbMovieId": "0130121",
      "originalTitle": "Mickey Blue Eyes",
      "genres": [
         "Comedy",
         "Crime",
         "Romance"
      ],
      "youtubeTrailerIds": ["AOh-F4PKwjU"],
      "plotSummary": "An English auctioneer proposes to the daughter of a mafia kingpin, only to realize that certain \"favors\" would be asked of him.",
      "tmdbMovieId": 10154,
      "avgRating": 2.85838,
      "releaseYear": "1999",
      "numRatings": 5529,
      "posterPath": "/oJsTBcWZcvcb8rseT2FraKDUo5r.jpg"
   }
}