{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "super computer",
            "id": 3222
         },
         {
            "name": "computer program",
            "id": 4286
         },
         {
            "name": "destiny",
            "id": 40850
         },
         {
            "name": "timebomb",
            "id": 41414
         }
      ],
      "imdb_id": "tt0176269",
      "video": false,
      "title": "Universal Soldier: The Return",
      "recommendations": [
         28510,
         9349,
         10596,
         3513,
         9091,
         9405,
         9103,
         10908,
         122857,
         37498,
         9594,
         10861,
         8831,
         10413,
         19277,
         17466,
         10134,
         37632,
         2019,
         9625
      ],
      "backdrop_path": "/3cihutGzbXIHr45cCSaOKQgYg3h.jpg",
      "revenue": 10667893,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Luc Devereux",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e145",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Maggie",
               "gender": 0,
               "credit_id": "52fe43619251416c7500e149",
               "name": "Kiana Tom",
               "profile_path": "/5viDwydn0KMMd6xKbiFmIhf8MjT.jpg",
               "id": 65235,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Romeo",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e14d",
               "name": "Bill Goldberg",
               "profile_path": "/1qS0cnf0RTa05nNO6n2boyEbTnn.jpg",
               "id": 65236,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "SETH",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e151",
               "name": "Michael Jai White",
               "profile_path": "/zvt4lOlPVVq1MZXmJDWNmBQDnWl.jpg",
               "id": 64856,
               "order": 3
            },
            {
               "cast_id": 12,
               "character": "Erin Young, KTXD",
               "gender": 1,
               "credit_id": "52fe43619251416c7500e17f",
               "name": "Heidi Schanz",
               "profile_path": "/svkz78fByMnD4K5LbQx903ao5I0.jpg",
               "id": 11321,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Dr. Dylan Cotner",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e183",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Captain Blackburn",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e187",
               "name": "Justin Lazard",
               "profile_path": null,
               "id": 160082,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "General Radford",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e18b",
               "name": "Daniel von Bargen",
               "profile_path": "/fFiiZCvBCqQ4xmCzYpMJQ7xboP3.jpg",
               "id": 1473,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Sergeant Morrow",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e18f",
               "name": "James Black",
               "profile_path": "/trnwqONnbGc13d1aaDZ0oMDH9L8.jpg",
               "id": 106911,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Hillary Deveraux",
               "gender": 0,
               "credit_id": "52fe43619251416c7500e193",
               "name": "Karis Paige Bryant",
               "profile_path": null,
               "id": 154531,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Squid",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e197",
               "name": "Brent Hinkley",
               "profile_path": "/1vsUTyswlmeKc4nZOEivdq482mO.jpg",
               "id": 7134,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Technician #2",
               "gender": 2,
               "credit_id": "52fe43619251416c7500e19b",
               "name": "Brent Anderson",
               "profile_path": "/6dqEr5uTPGG78b10xxT80cdPN0R.jpg",
               "id": 180538,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e157",
               "name": "Mic Rodgers",
               "profile_path": "/i2aoSvkQAyPAfwQpD7fJtGWRw2r.jpg",
               "id": 18889,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e15d",
               "name": "Daniel Melnick",
               "profile_path": null,
               "id": 14942,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e163",
               "name": "Jean-Claude Van Damme",
               "profile_path": "/t9to1GoMzx7IDSBXwzwe1huakFk.jpg",
               "id": 15111,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e169",
               "name": "John Fasano",
               "profile_path": null,
               "id": 65237,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e16f",
               "name": "William Malone",
               "profile_path": null,
               "id": 57898,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e175",
               "name": "Don Davis",
               "profile_path": null,
               "id": 4949,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43619251416c7500e17b",
               "name": "Mike Benson",
               "profile_path": null,
               "id": 65238,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "59354d1c9251417ddc035c0f",
               "name": "Peter Malota",
               "profile_path": "/9Yh6HFHHc0KhBeVu3hQuijq2xfS.jpg",
               "id": 1785844,
               "department": "Crew",
               "job": "Martial Arts Choreographer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 8.49551,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 10366,
      "vote_count": 169,
      "budget": 45000000,
      "overview": "Luc Deveraux, the heroic former Universal Soldier, is about to be thrown into action once again. When Seth (Michael Jai White), the supercomputer controlled ultra-warrior, decides to take revenge and destroy its creators, only Luc can stop it. All hell breaks loose as Luc battles Seth and a deadly team of perfect soldiers in a struggle that pits man against machine and good against evil.",
      "similar": [
         20526,
         605,
         62,
         644,
         157353,
         1090,
         9271,
         484886,
         2164,
         218,
         534,
         78,
         296,
         603,
         604,
         17431,
         2048,
         264660,
         274855,
         262543
      ],
      "original_title": "Universal Soldier: The Return",
      "runtime": 82,
      "poster_path": "/zy0M1Mf7nqiazIYh2D49bbxnlIn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
            "name": "TriStar Pictures",
            "id": 559,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Baumgarten-Prophet Entertainment",
            "id": 12968,
            "origin_country": ""
         }
      ],
      "release_date": "1999-08-05",
      "vote_average": 4.3,
      "belongs_to_collection": {
         "backdrop_path": "/bonZuSo9YE7LFHEFE8oLD3qv32o.jpg",
         "name": "Universal Soldier Collection",
         "id": 10713,
         "poster_path": "/w6VKg5MJFmoACGgLcDUMmNSPYOv.jpg"
      },
      "tagline": "Prepare to become obsolete",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mic Rodgers"],
      "runtime": 83,
      "synopsis": "Seven years after the events in the first film, Luc Deveraux ( Jean-Claude Van Damme), now an ordinary human, is a technical expert who is working with the government with his partner Maggie ( Kiana Tom), who has been through countless hours of combat training with him, in order to refine and perfect the UniSol program in an effort to make a new, stronger breed of soldier that is more sophisticated, intelligent, to spare using living soldiers in the battlefield. All of the new UniSols, which are faster and stronger than the original UniSols, are connected through an artificially intelligent computer system called S.E.T.H. ( Michael Jai White), a Self-Evolving Thought Helix. When S.E.T.H. discovers that the Universal Soldier program is scheduled to be shut down because of budget cuts, it takes action to protect itself. Killing those who try to shut off his power, and unleashing his platoon of super soldiers, led by the musclebound Romeo ( Bill Goldberg), S.E.T.H. spares Devereaux, only because Devereaux has the secret code that is needed to deactivate a built-in program that will shut S.E.T.H. down in a matter of hours. With the help of Squid ( Brent Hinkley), a rogue cyberpunk, S.E.T.H. is able to put his program in a UniSol which Squid made superior to any of the newer models (White). Not only must Luc contend with ambitious reporter Erin Young ( Heidi Schanz), who will not leave his side, but Luc must also contend with General Radford ( Daniel von Bargen) who wants to take extreme measures to stop S.E.T.H.. S.E.T.H. has arranged Romeo to kidnap Luc's injured 13-year-old daughter Hillary ( Karis Paige Bryant), killing Maggie in the process. Luc is the only person who can rescue Hillary, because Luc knows firsthand how a UniSol thinks, feels, and fights. Luc infiltrates the UniSol building, but finds Maggie, now revived as one of the UniSols. S.E.T.H is able to figure out the code himself, decides to kill Luc and raise Hillary himself, who he has healed using UniSol technology. During the fight Luc covers S.E.T.H. in liquid nitrogen then shatters S.E.T.H.'s frozen body. Luc then engages into a fight with Romeo, which ends when Maggie finally rebels against the UniSols by shooting Romeo, and allows Luc and Hillary to get out of the building on time. However, the bomb that General Radford had placed was deactivated by S.E.T.H.. As Romeo and the platoon of Universal Soldiers start to march out for battle, Luc fires at the explosive charge blowing up the building, killing all the Universal Soldiers.",
      "writers": [
         "Richard Rothstein",
         "Christopher Leitch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0176269/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAwNTk4NzYxNl5BMl5BanBnXkFtZTcwNDQ0ODUxMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Claude Van Damme, Bill Goldberg, Heidi Schanz | See full cast and crew »"],
      "reviews": [
         "This movie is just so bad it's good! The acting may look a bit \"forced\" at times (ok, perhaps \"painfully horrible\" would be a better expression) but really folks... did you honestly expect an award winning performance from Van Damme or Goldberg? I don't know about you all, but I rented this movie to see Van Damme trade punches with the 290 pound Goldberg and Michael Jai White while uttering dozens of slightly pathetic/slightly amusing one liners at every conceivable opportunity, and I got just what I asked for =) If you don't like it... tough. Go rent \"The Piano\" or \"Lawn Dogs\" if you want real movies, but if you just want Van Damme brawling with big guys plus some shots of pretty girls, this is just what the doctor ordered. One of my favourites.",
         "This is a shocking 'B' grade action movie with lots of bad acting and dialogue. Van Damme does his usual best which aint much, Jai White is good as Seth but the scene stealer is the cheesy but lovable Bill Goldberg. This film is so ridiculously bad that it ends up being funny and quite enjoyable. If you like cheesy low budget action flicks that doesn't take itself too seriously then this is worth a laugh or two! As a fan of the genre and the fact that i realise this isn't meant to be taken seriously, *** out of *****!",
         "The mind boggles at exactly what about Universal Soldier merited a sequel. Since the real star, Dolph Lundgren, would not be able to reprise his role from the original, there is already scant reason to indulge oneself in this obvious tax write-off. Bold attempts are made to fill the gap with professional wrestler Bill Goldberg and martial arts expert Michael Jai White. To their credit, they give their action sequences a good sense of excitement. Bill Goldberg looks like he is having the time of his life on this film, and he makes a fair stab at filling the requisite comedic villain role. For once, his role is the kind that involves repeating the same line a few times, and it does not get irritating. The problem from the audience's point of view is that neither of these gentlemen really have the sense of comic timing or minor humility that makes Lundgren such a pleasure to watch in almost all of his films. And therein lies the problem. You do not go to see a Van Damme film because you want serious action. You go because you want comedy, however unintentional. Unbeknownst to many people, Universal Soldier was followed by two direct-to-video sequels. I have only seen the first, which had production values so bad one can only wonder if it was meant to be some kind of elaborate joke. Matt Battaglia was so terrible in the role of Luc Deveraux that for once in his career, the sight of Jean-Claude Van Damme comes as a welcome relief. The film more or less completely disregards the stories of the aforementioned direct-to-video sequels, and instead begins a whole new story set an indeterminate time after the events of the original. After years of investigation and explanation, the Unisol project is still going ahead, with some minor modifications. For one, the new Unisols are stronger and more damage-resistant than their earlier cousins. For another, all of the Unisols are now under the direction of a supercomputer called SETH. In the early parts of the film, SETH exists primarily as a series of abstract graphics within a glass dome. Being that the film barely lasts more than eighty minutes, we are quickly told that funding to the military is being cut. The Unisol project is on the chopping block, which essentially means that SETH will be turned off. SETH, somehow overhearing this conversation through means that are never really explained, decides to mobilise the Unisols as an army against those seeking to shut him down. His only problem is that every so often, a code is required to be put into his system in order to prevent automatic shutdown. Two individuals possess the code in question. SETH kills the first in short order, and those who are familiar with the plot kit that Van Damme's films are constructed out of will guess within five seconds who the second happens to be. The rest of the film revolves around the Unisols' attempts to get the code out of Van Damme without injuring him too badly. A subplot with a daughter and a reporter is woven into the film, but it adds about as much to the story as Van Damme does to the profession of acting. The film is loaded to the brim with ridiculous lines and clichés. When SETH transplants his command module into the body of Michael Jai White, we get a speech about how the time of the humans is over. He goes on to tell his foot soldiers how fear and mortality will be humanity's weakness(es). Gee, SETH, you mean they will not be our strong points? All kidding aside, the short length of the film is both the film's weakness and its strength. It leaves the action without adequate setup. In the original, we are given a very thorough explanation of the Unisols, how they work, and how they are brought to the state that is seen in the majority of the film. Here, the writer seems to take it for granted that the viewer knows what a Unisol is and how they operate. At least in the original, a moment of curiosity and wonder was created by leaving the explanation for later in the film when the hero lies in a tub of ice. Here, one of the villains is shot with a gun that leaves massive holes in his uniform (and presumably his body), getting up every time without stopping for breath. I tend to reserve the score of one for films that are so bad that they become entertaining in a completely unintentional manner. If you can see it on the cheap, knock yourself out. This is the kind of film that makes me mourn the loss of Mystery Science Theatre.",
         "Wow what pure garbage! Well At least I knew it was going be bad before I saw it. I mean first of all it's a Jean Claude Van Damme movie. Secondly, without Dolph Lundgren the first one would have been a bore. I guess you can sum this one up by saying that it was so bad that it was funny. Yes, this movie was hilarious. It made absolutely no sense, had no plot, just a bunch of stuff that happens and a bunch of people get blown up. For example this girl in the movie whom Luc just met like 3 hours ago at the most is telling him at the end of the movie that she can't live without him. PLEASE!!! I have never watched more predictable movie.",
         "Van Damme returns to one of his best action roles, with a very weak storyline, and very irritating, stereo-typed characters. When the action is going, IT'S GOING. Van Damme's aging, but, still has the moves. He's also a widower with a young daughter. First plot problem, his daughter has access to the \"Top Secret Project\" building for the Universal Soldier program, and uses it like a daycare center. No other workers had their kids there, so what made her so special, except to put her closer to the action. Second plot problem, the female reporter. She arrives for and interview, is excorted inside the factility, and when all hell breaks loose, she and her cameraman remain instead of being escorted out. Another excuss to put a character close to the danger. Third plot problem, the irritating and unreal attitude the reporter has. Instead of showing the least amount of fear over the killing and mayhem going on around her, she's doing her \"I-a-reporter-with-a-scoop\" dialogue. I was hoping that Romeo or another soldier would take her out. Fourth plot problem, Kiana Tom, Van Damme's butt-kicking sidekick at the beginning of the movie, is left on the sidelines for most of the movie. Her character replacing the reporter would have enhanced the whole story and added to the action. If you can overlook the plot problems, the show is at least bearable.",
         "I like Van Dammes movies and Universal soldier was one of my favorites(along with Blood sport and Hard target). I looked forward to a sequel, but when I saw the reviews, \"The worst film I've seen\" it also earned it self a average of 3.0(29th of Feb 2000) on this sight. But I had to hire it out, and I was honestly surprised. DON'T watch it unless youv'e seen the first or it will make no sense. It doesn't explain the first story, it only says that Luc(Van Damme) was one of the first uni sols. It then doesn't tell you about the new project, and how Luc became involved, also it says about the main female characture in the first, who is now his wife and is dead, how did she die? Although it doesn't make much sense it is a good action film with some great fight scenes especially ones with Goldburg, and the final showdown. So make your own decision and watch. entertaining 4/10",
         "Jean-Claude Van Damme has been in about a film a year for 15 years now, and has been the star performer in those films since 1985's No Retreat, No Surrender. That's no mean achievement and shows that this action movie star has a market for his skills, as limited as they might be. The formula isn't Van Damme's alone but he's certainly the most prolific of the action movie stars. Silvester Stallone, Arnold Schwarzennegger, Steven Segal, Bruce Lee and Jackie Chan are the best known of the action stars but with the exception of Chan, Van Damme is the one who seems to be still most actively in the business. And these sorts of films are much less popular than they used to be. Jean-Claude is a terrible actor and his film world is simplistic. One can only assume that his fans wish that the real world was like his. The scenario almost invariably includes lots of hand to hand fighting, silly women and often children who need defending. The plots are stupid and concocted only to allow Jean-Claude to fight a lot and to show his sensitive side as he protects the women and/or children. The mushy bits, accompanied by appropriate music, aren't ever romantic, Jean Claude could never manage that, but they serve to depict this action man as being a reluctant hero. He only beats people up, firstly because he can, but secondly because he has to. His best film so far, of the ones I've seen, was the John Woo directed Hard Target (1993) which had many stylish touches, often in slow motion, which accentuated the admirable Van Damme gracefulness. I think the worst was Double Impact which unfortunately doubled the torture - there were two characters in the film played by the Muscles From Brussels. And the famous, universal, Van Damme bum shot, the scene where we get to see Jean-Claude's tastefully lit posterior, happens early on in Universal Soldier 2. So if you like you can leave early. Universal Soldier follows the formula. Actually I think that his fans will like this one. There's plenty of kick boxing.",
         "whoa - lots of spoilers here. this has got to be one of the most unappreciated cult movies in history. around every corner are clever and interesting twists that leave me, and other hungry van dammage fans, panting for more. the main source of this shining light is lord of the jews: goldberg. goldberg's character romeo is written with the flair and panache of a 1920's vaudeville showman. his classic one-liners like, \"i hate that guy\" and \"i really hate that guy\" are pure gold. so here's the problem. people went into seeing this flick with the expectation of a solid action movie like the first universal soldier. no, no, no. instead of another horribly doomed sequel (aka universal soldier 2) that stays in the same vein and is thus fated to crap-tastic status, uni: return jumps right out of the mold and goes x-games style. who could hate this movie? this movie is so bad it's brilliant. i understand if it was the first time some 12 year old saw an action movie, they might be disappointed at the ridiculous plot and train-wreck acting, and they might become physically ill upon hearing lines like \"miniaturization of seth brain complete.\" but for people with a well-developed sense of knowing how to separate the crappy b-movies (uni 2, etc) from the all-time flaming flops that you have to love, like this fine work. uni: return has grown on me in a way that i never thought possible. the scene where goldberg rips off his shirt and wrestles the hospital security guards? how could anyone try and take that seriously? the people who hate on this movie are the same people who hate on hudson hawk. and for these poor saps who are stuck in a hollywood blockbusters are the only good movies mindset, i truly pity them. for if they simply opened their eyes a little wider, they would see a more beautiful world, a world in which films like uni: return shine with the inner light of radiance that i see in them.",
         "There are really only 3 reasons to watch this: Michael Jai White has some quality screen time; Kiana Tom is quite gorgeous except for her dismal second incarnation, and this film has the most hilariously gratuitous T & A sequence since Richard Pryor and Gene Wilder hid out in the poledancing club in Stir Crazy. Actually I quite like Van Damme - he makes martial arts look attainable. You can go to your classes and think \"I'll never be as good as Jet Li, the guy's superhuman. But I might just get as good as Van Damme someday.\"",
         "I really don't get why most people heavily criticize this movie. Actually, I had a really fun time watching this flick. Maybe the reason why so many people dislike it is because they just take it too seriously. Fans of the first movie who expect a serious sequel won't get what they're hoping for. That's rather good in my opinion. The first movie was just boring and had bad (and too little) action, but that's not the case with \"Universal Soldier: The Return\". The action is nearly non-stop from beginning to end, and most of the action scenes are great! I really liked that wrestling guy being one of the main bad guys, and the fight at the hospital with the nurses (you have to see it for yourself) was just hilarious. The story was OK too, and Michael Jai White was perfect as the villain in this movie."
      ],
      "genres": [
         "Action",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Baumgarten-Prophet Entertainment",
         "IndieProd Company Productions",
         "Long Road Entertainment"
      ],
      "summaries": [
         "Luc Devereaux, the only surviving member of the original Universal Soldier Team. He now works with Dylan Cotner, on a project to create and improve a new Universal Soldier. Their plan is for the Universal soldier or UNISOLS to be controlled by a computer they call SETH. When the government decides to terminate the project, which includes shutting down SETH. SETH, not wanting this to happen, takes steps to prevent this. He first kills Dylan. He then has himself transfered into a body. He then seeks out Luc Devereaux, who is the only person who knows the code that will stop his program from being deleted. So he sends out all the UNISOLS to get him. Luc must try and stay away until SETH program is deleted. But SETH has targeted his daughter as possible leverage.",
         "Luc Devereux is now a technical expert who is working with the government with his partner Maggie, who's been through countless hours of training and combat with him, to refine and perfect the UniSol program in an effort to make a new, stronger breed of soldier that is more sophisticated, intelligent, and agile. All of the new Unisols, which are faster and stronger than their predecessors, are connected through an artificially intelligent computer system called SETH, a Self-Evolving Thought Helix. When SETH discovers that the Universal Soldier program is scheduled to be shut down because of budget cuts, he takes matters into his own \"hands\" to protect himself. Killing those who try to shut off his power, and unleashing his platoon of super-soldiers, led by the musclebound Romeo, SETH spares Deveraux, only because Deveraux has the secret code that is needed to deactivate a built-in program that will shut SETH down in a matter of hours. With the help of a hacker named Squid, SETH takes human form. Not only must Luc contend with ambitious reporter Erin, who won't leave his side, but Luc also must contend with General Radford, who wants to take extreme measures to stop SETH. SETH has also kidnapped Luc's injured 13-year-old daughter Hillary, and is now holding her hostage. Luc is the only person who can rescue Hillary, because Luc knows firsthand how a UniSol thinks, feels, and fights.",
         "Universal Soldier II continues the story of Luc Deveraux, who has survived his experiences as a Universal Soldier, recovered, and is now working as a technical expert on a government project to revive and improve the Universal Soldier training program. When S.E.T.H., the supercomputer controlling the Soldiers, goes haywire and takes over, Luc is the only one who can battle this elite team of deadly, near-perfect warriors.",
         "The \"universal soldiers\" must fight the whole army. When the military's supercomputer S.E.T.H gets out of control"
      ],
      "budget": 24000000
   },
   "movielensId": 2807,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-08-05",
      "dvdReleaseDate": "1999-12-21",
      "directors": ["Mic Rodgers"],
      "runtime": 82,
      "movieId": 2807,
      "title": "Universal Soldier: The Return",
      "mpaa": "R",
      "actors": [
         "Jean-Claude Van Damme",
         "Kiana Tom",
         "Bill Goldberg",
         "Michael Jai White",
         "Heidi Schanz",
         "Xander Berkeley",
         "Justin Lazard",
         "Daniel von Bargen",
         "James Black",
         "Karis Paige Bryant",
         "Brent Hinkley",
         "Brent Anderson"
      ],
      "imdbMovieId": "0176269",
      "originalTitle": "Universal Soldier: The Return",
      "genres": [
         "Action",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["XuP9kxJI2sw"],
      "plotSummary": "Luc Deveraux, the heroic former Universal Soldier, is about to be thrown into action once again. When Seth (Michael Jai White), the supercomputer controlled ultra-warrior, decides to take revenge and destroy its creators, only Luc can stop it. All hell breaks loose as Luc battles Seth and a deadly team of perfect soldiers in a struggle that pits man against machine and good against evil.",
      "tmdbMovieId": 10366,
      "avgRating": 1.87613,
      "releaseYear": "1999",
      "numRatings": 1437,
      "posterPath": "/zy0M1Mf7nqiazIYh2D49bbxnlIn.jpg"
   }
}