{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0119692",
      "video": false,
      "title": "With Friends Like These...",
      "recommendations": [],
      "backdrop_path": "/nJ0GIyixBNoj3fLwZgVjpkVx77C.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Maurice Melnick",
               "gender": 2,
               "credit_id": "52fe4ad8c3a368484e16a201",
               "name": "Bill Murray",
               "profile_path": "/7BOoOAIA1CnSzFSVSJP7saniQaB.jpg",
               "id": 1532,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "",
               "gender": 2,
               "credit_id": "58be9e78c3a3686630058caf",
               "name": "Adam Arkin",
               "profile_path": "/zCLaZZMQxBMZ4DtXOecy84xnO2g.jpg",
               "id": 55257,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 2,
               "credit_id": "58be9e86c3a3686630058cc2",
               "name": "David Strathairn",
               "profile_path": "/5P9hWKVBXVD6bNdDO3O7upa1A6S.jpg",
               "id": 11064,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "",
               "gender": 2,
               "credit_id": "58be9e90c3a3680df8012144",
               "name": "Jon Tenney",
               "profile_path": "/fiG1bW6DX1szsRDPIYjfIKPQ0kV.jpg",
               "id": 4602,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "",
               "gender": 2,
               "credit_id": "58be9e9cc3a3680db10122a0",
               "name": "Robert Costanzo",
               "profile_path": "/vyUeNk56Yv7xyHztgVa8UBEIasu.jpg",
               "id": 33492,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "",
               "gender": 1,
               "credit_id": "58be9ea492514132a2012f18",
               "name": "Amy Madigan",
               "profile_path": "/pNdNJPKRdl3veCRH8fZv3H76ywJ.jpg",
               "id": 23882,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "",
               "gender": 1,
               "credit_id": "58be9eadc3a36866a505aef7",
               "name": "Laura San Giacomo",
               "profile_path": "/xOPY9e0HN6zYmI5HrmRSbwygEzy.jpg",
               "id": 1212,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "",
               "gender": 1,
               "credit_id": "58be9eb7925141609b05e9ac",
               "name": "Elle Macpherson",
               "profile_path": "/1XWYq795rjP2dQtH8PRC8GUI3aI.jpg",
               "id": 5590,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "",
               "gender": 1,
               "credit_id": "58be9ec1c3a36866860554a4",
               "name": "Lauren Tom",
               "profile_path": "/oXU7sZOTjlALqz3UYYi2sWBAYAl.jpg",
               "id": 15100,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "",
               "gender": 1,
               "credit_id": "58be9ecac3a3680d6801136a",
               "name": "Beverly D'Angelo",
               "profile_path": "/8fYQIA8dAaA4GOTxOFSKIvTqzi.jpg",
               "id": 821,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "",
               "gender": 2,
               "credit_id": "58be9ed792514160840611c1",
               "name": "Martin Scorsese",
               "profile_path": "/4Xwx5XL1RJj0JQmEo8Fhr6nkpOg.jpg",
               "id": 1032,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "58be9efa925141126a042d1b",
               "name": "Philip Frank Messina",
               "profile_path": null,
               "id": 1184213,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "58be9f0a925141126a042d3a",
               "name": "Philip Frank Messina",
               "profile_path": null,
               "id": 1184213,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58be9f1dc3a36866a505afb4",
               "name": "John Powell",
               "profile_path": "/fFRYoiZxBtP4Gs0CAphU7F5mDk.jpg",
               "id": 11098,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "58be9f8d925141126a042e53",
               "name": "John Powell",
               "profile_path": "/fFRYoiZxBtP4Gs0CAphU7F5mDk.jpg",
               "id": 11098,
               "department": "Crew",
               "job": "Compositors"
            },
            {
               "gender": 0,
               "credit_id": "58be9fc2925141126a042eaa",
               "name": "Brian J. Reynolds",
               "profile_path": null,
               "id": 1533102,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 0.362851,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 126152,
      "vote_count": 0,
      "budget": 0,
      "overview": "Four small-time two-bit character actors, all close friends, are competing for same important part in the next Martin Scorsese mob film.",
      "similar": [],
      "original_title": "With Friends Like These...",
      "runtime": 105,
      "poster_path": "/iaOiRKh9o8hoAEAUWc7Dq71w2cl.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/sNhxHhbyJ0xo52nr9xI2cJKkWFO.png",
         "name": "Miramax Films",
         "id": 14,
         "origin_country": ""
      }],
      "release_date": "1998-09-10",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Philip Frank Messina"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Philip Frank Messina"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0119692/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjE4MjI0MTAwMl5BMl5BanBnXkFtZTcwMTg3NDEyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Adam Arkin, David Strathairn, Jon Tenney | See full cast and crew »"],
      "reviews": [
         "and actors don't get any smaller than this handful of marginal character actors in LA who are falling all over each other, stabbing each other in the back, lying, cheating, threatening, and deceiving in order to get cast in the lead role in a new Scorsese film. And they're all friends! This is a wonderful film. It's funny, the acting is excellent (I particularly liked Adam Arkin), and the climax is something you just don't see coming. A lot of the humor is film industry insider stuff, but most people who get out occasionally will get most of it. Watch for this one - it won't be around long if it comes around at all.",
         "Wonderfully done! I thought I knew each of the characters. One right after another they became more real. It amazes me why films like this don't get more play! It's realism into the world of auditioning breaks your heart! It shows what people with hearts for their work, these actors, have to go through to get a job! Holding on to HOPE which is all you have. Bill Murray's cameo was right on the money! Unlike in Baseball if you're a 300 hitter you're job on a team should be fairly secure. But with acting, as these characters experience, it's a whole different ball game! This movie will definitely make the out of work actor want to throw a brick through the TV. However it also makes you see that family and friends is what life is all about!",
         "This is a pretty good 'slice-of-life' comedy. It revolves around four male actors who become captivated by the prospect of auditioning for the part of Al Capone in Martin Scorsese's next production. The Los Angeles actors' lifestyle is chronicled here, with several ironic references to familiar themes: nobody can keep their mouth shut, times are tough, and everybody is out for themselves. \"With Friends Like These\" has flaws. It doesn't have as many laughs as it should, and the 'feel-good' parts of the film don't come off quite right. There is some comedy here, and some drama, but the the two aren't integrated well. The characters are knowingly painted as self-absorbed, except for Amy Madigan's character, who has a penchant for charity work. What saves the film is a fairly good script, some good ensemble work by the cast, and a brisk tempo that keeps the film hopping along. The film's second half is better than its first, and I enjoyed the end quite a bit. David Strathairn is one of the great underrated American actors, and he has a lot to do with the film gaining momentum. Elle MacPherson is good too, as she is given something to do besides just look ravishing. She always does that well, but it's nice to see her get a chance to act. Other nice touches were Scorsese himself appearing in one of the pivotal final scenes, and some nice work between Strathairn and his girlfriend, played by Lauren Tom. This film isn't a classic, but it is about people rather than robots or a serial killer, and it doesn't insult the intelligence of people over 20 years old. Rating 7/10.",
         "With Friends Like These.... is definitely a cut above most Hollywood films about Hollywood. It is laugh-out-loud funny as well as warm, touching and authentic when it comes to depicting relationships between friends and spouses...a totally worthwhile experience! The entire cast is great, especially Adam Arkin and Laura San Giancommo as transplanted east coasters trying to tough it out until their ship comes in on the west coast. Bill Murray's turn as the self-involved famous producer is a riot. The fact that this film was not distributed at the time it was originally made, is a sad comment on the business end of the business, where so much junk makes it's way to the big screen, and other films, of higher quality, like this one, get lost. The writing is hysterical, filled with rapid one liners reminiscent of classic comedians, delivered with perfect timing. For anyone who has ever suffered through endless casting cattle calls or tried to get \"in front\" of the right people, this film is a must. For everyone else it's a decided pleasure.",
         "I just saw this film in its 2005 re-release. It's really a fun little film, with quite a few laughs and lots of great moments among a really amazing, well-chosen cast. It's so much smarter than the average Hollywood film -- which may have been its problem when released?! Who knows why studios do what they do -- and apparently, they didn't do this film justice in 1998 (after all, it has an ensemble cast where -- gasp -- no one is under 30!) As both a writer and an Italian-American, I got perhaps an extra kick out of the story, which is about survival in Hollywood for these four actor characters and their families -- but the film's humor and theme of friendship is truly universal.",
         "This original, warm, funny and biting satirical comedy shows us the ups and downs of four character actors in Los Angeles. Their friendships are tested when Martin Scorsese comes to LA to cast \"Capone\" his new (and fictional) project. A lively, hilarious script is balanced by full, three dimensional performances from the well known faces (particularly the always brilliant David Strathairn), and there are some great cameos to boot.",
         "\"With Friends Like These\" is a gem of a movie waiting to be discovered by millions of people who are intelligent, love comedies, and have a deep feeling for the human condition -- especially as it involves competition among friends for fame and fortune. While the friends in this movie are \"bit actors\" operating within the \"Hollywood\"/cinematic context, the forces that move them -- and us, as viewers -- are universal, and could apply to any group of friends, in any situation. The premise of the movie is simple, and like many things simple, it derives from a brilliant observation: friends will be disloyal to one another if they sense the rewards of disloyalty are great enough. On the face of it, the rewards seem obvious--money and adulation--but the desire for them itself reflects the true motivation of the actor-friends: desire for simple recognition of their talent in a system that chronically ignores and demeans them as human beings, artists, and professionals and -- at best -- underutilizes what they have to offer both film-makers and audiences. In a word, they are frustrated . . . to the point of desperation. And the thought of auditioning for Martin Scorcese himself -- in a new mob movie he is casting -- is irresistible. Worth anything, in fact -- even the risk of losing the love and respect of their dearest friends. Given this powerful motivator, the \"secret\" about the Scorcese audition initially held by one of the friends is soon let loose, and rapidly spreads among the others like an infectious disease . . . thus creating the competitive situation that fuels the film. Unlike most comedies today, however --which pathetically attempt to garner laughs from the audience through the characters' mindless \"schtick,\" pratfalls, and mean-spirited jabs at one other -- the humor in \"With Friends Like These\" derives organically from the situation the characters find themselves in, aided by their idiosyncratic personalities. Even the situation, itself, however, and the types of characters who inhabit it, would not produce the guffaws, chuckles, and deep smiles that \"Friends\" does, were it not for the intimate knowledge of the movie industry and actors that Phil Messina, the writer-director, brings to every frame. \"With Friends Like These\" is much more than a comedy: It is a perceptive depiction of the \"human condition\" in a modern, capitalist society,conveyed in a humorous, humanistic way. For these reasons, \"With Friends Like These\" -- like the exceptional films of Woody Allen -- is a rare gem that should not be missed by anyone who loves great movies.",
         "This is a thoroughly entertaining film. It was received very well at the Santa Barbra International Film Festival. I hope it gets distribution Real Soon Now.",
         "A not too bad effort at chronicling the life and hard times of barely working character actors in Los Angeles. I never know when I check out one of these low budget indies if I am going to be pleasantly surprised or grievously disappointed, so it's always nicer to be the first. Some fine character actors on display, including David Straithairn, Amy Madigan, Adam Arkin, Beverly D'Angelo and an uncredited Bill Murray (pre-Lost in Translation). The story is a little light, even for a comedy, and doesn't really hit many strong notes, but it's nice to see something about those actors whose faces are always familiar to us and yet we rarely know their names. There is a particularly nice turn at the end, when each actor auditions for a \"dream part\" in a Scorcese film (the elusive goal driving the plot), and we suddenly see them as talented professionals, not goofballs and losers. This is very well done and a nice, satisfying end to the film. If there is a major flaw -- and this is a flaw in a lotta movies -- these marginally successful actors are all depicted as living like Hollywood royalty. Big, stylish houses that would cost upwards of $1 million in So Cal! And yet these actors are clearly described as \"out of work\", sometimes for over a year. Get real! A real out-of-work character actor is probably living in a one bedroom apartment and lucky if he doesn't have a roommate at that! Still, as someone else wrote, it's nice anymore these days to see a movie about something besides a giant monster, space alien, things blowing up or CGI graphics. So thumbs up!",
         "This is a very good film about the folks on the lower rung of the movie industry. I agree that David Straithairn does not get all the credit due and he really brings this movie home. The acting all around is good and examines what happens when one person out of a group of friends gets a chance at the big time. Rent this movie for a totally enjoyable 2 hours."
      ],
      "genres": ["Comedy"],
      "productionCompanies": [
         "Parkway Productions",
         "Quadrant Films",
         "Robert Greenhut Productions"
      ],
      "summaries": ["Four small-time two-bit character actors, all close friends, are competing for same important part in the next Martin Scorsese mob film."],
      "budget": 0
   },
   "movielensId": 2811,
   "movielens": {
      "languages": [""],
      "releaseDate": "1998-09-10",
      "dvdReleaseDate": null,
      "directors": ["Philip Frank Messina"],
      "runtime": 105,
      "movieId": 2811,
      "title": "With Friends Like These...",
      "mpaa": "R",
      "actors": [
         "Bill Murray",
         "Adam Arkin",
         "David Strathairn",
         "Jon Tenney",
         "Robert Costanzo",
         "Amy Madigan",
         "Laura San Giacomo",
         "Elle Macpherson",
         "Lauren Tom",
         "Beverly D'Angelo",
         "Martin Scorsese"
      ],
      "imdbMovieId": "0119692",
      "originalTitle": "With Friends Like These...",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Four small-time two-bit character actors, all close friends, are competing for same important part in the next Martin Scorsese mob film.",
      "tmdbMovieId": 126152,
      "avgRating": 3,
      "releaseYear": "1998",
      "numRatings": 44,
      "posterPath": "/iaOiRKh9o8hoAEAUWc7Dq71w2cl.jpg"
   }
}