{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bat",
            "id": 5155
         },
         {
            "name": "suspense",
            "id": 9937
         }
      ],
      "imdb_id": "tt0052602",
      "video": false,
      "title": "The Bat",
      "recommendations": [
         22741,
         112481,
         56140,
         29324,
         37521,
         115666,
         18696,
         29071,
         27496,
         41023,
         58733,
         26925,
         33543,
         38125,
         28423,
         84720,
         37426,
         43248,
         85170,
         28425
      ],
      "backdrop_path": "/uRz6KgauShQ0HOESoJnOhLp5Wkh.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Dr. Malcolm Wells",
               "gender": 2,
               "credit_id": "52fe45b79251416c9103be35",
               "name": "Vincent Price",
               "profile_path": "/w9wcf7hWLD2I2K0PojJaqd9vbHL.jpg",
               "id": 1905,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cornelia van Gorder",
               "gender": 1,
               "credit_id": "52fe45b79251416c9103be39",
               "name": "Agnes Moorehead",
               "profile_path": "/ajpbxYhFVcpGAGMnux9zCwzRYlo.jpg",
               "id": 11025,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Lt. Andy Anderson",
               "gender": 2,
               "credit_id": "52fe45b79251416c9103be3d",
               "name": "Gavin Gordon",
               "profile_path": "/kmCRZ3fBfnoNZQqW92T0bI8QZMe.jpg",
               "id": 2927,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Warner, the chauffeur",
               "gender": 2,
               "credit_id": "52fe45b79251416c9103be41",
               "name": "John Sutton",
               "profile_path": "/sTEet1qqS8onrjtARXpIOamh9DG.jpg",
               "id": 100589,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Lizzie Allen",
               "gender": 0,
               "credit_id": "52fe45b79251416c9103be51",
               "name": "Lenita Lane",
               "profile_path": "/5b62sZU2A6DZkZTspBQvqVczmjK.jpg",
               "id": 100581,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Judy Hollander",
               "gender": 0,
               "credit_id": "52fe45b79251416c9103be55",
               "name": "Darla Hood",
               "profile_path": "/wPLGNOJppnmyMy5qfNKOXMvDteH.jpg",
               "id": 31772,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Dale Bailey",
               "gender": 1,
               "credit_id": "52fe45b79251416c9103be59",
               "name": "Elaine Edwards",
               "profile_path": "/ii53LBQ9Af6TdgtUZxCOL9D7Ece.jpg",
               "id": 258715,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Mark Fleming",
               "gender": 0,
               "credit_id": "56ce6399c3a3681e4a0007e0",
               "name": "John Bryant",
               "profile_path": null,
               "id": 1325136,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "John Fleming",
               "gender": 2,
               "credit_id": "56ce63b0c3a3681e5700083e",
               "name": "Harvey Stephens",
               "profile_path": "/tYzi0GBDnfbF3tuC3qYT4USP8Kh.jpg",
               "id": 114097,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Victor Bailey",
               "gender": 0,
               "credit_id": "56ce63c3c3a3681e3900085c",
               "name": "Mike Steele",
               "profile_path": null,
               "id": 1582485,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Jane Patterson",
               "gender": 0,
               "credit_id": "56ce63d19251413e6a0008cc",
               "name": "Riza Royce",
               "profile_path": null,
               "id": 103233,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Detective Davenport",
               "gender": 0,
               "credit_id": "56ce64309251413e6d0008da",
               "name": "Robert Williams",
               "profile_path": "/lFO6YQPH0byE6A7X5eF5FErc61V.jpg",
               "id": 120070,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45b79251416c9103be47",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "56ce6467c3a3681e3e00097b",
               "name": "Avery Hopwood",
               "profile_path": null,
               "id": 114769,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "56ce6473925141642e00045d",
               "name": "Mary Roberts Rinehart",
               "profile_path": null,
               "id": 43840,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "56ce6486c3a3681e3c000a09",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "56ce648c9251413e6d0008e7",
               "name": "Crane Wilbur",
               "profile_path": "/ou3qil42C78krnQtobNwGZfjho9.jpg",
               "id": 84940,
               "department": "Writing",
               "job": "Screenstory"
            },
            {
               "gender": 0,
               "credit_id": "56ce649ac3a3681e57000868",
               "name": "C.J. Tevlin",
               "profile_path": null,
               "id": 1582486,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "56ce64a6c3a3681e44000a05",
               "name": "Louis Forbes",
               "profile_path": null,
               "id": 96251,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56ce64b2c3a3681e3c000a0f",
               "name": "Joseph F. Biroc",
               "profile_path": null,
               "id": 14431,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "56ce64d09251413e6d0008ed",
               "name": "Dave Milton",
               "profile_path": null,
               "id": 120193,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "56ce64dd9251413e68000873",
               "name": "Rudy Butler",
               "profile_path": null,
               "id": 1325120,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "56ce64eb9251413e68000878",
               "name": "Kiva Hoffman",
               "profile_path": null,
               "id": 1582487,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "56d5feddc3a3681e44019e93",
               "name": "William Austin",
               "profile_path": null,
               "id": 25169,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.7306,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 35813,
      "vote_count": 24,
      "budget": 0,
      "overview": "Mystery writer Cornelia Van Gorder has rented a country house called \"The Oaks\", which not long ago had been the scene of some murders committed by a strange and violent criminal known as \"The Bat\".Meanwhile, the house's owner, bank president John Fleming, has recently embezzled one million dollars in securities, and has hidden the proceeds in the house, but he is killed before he can retrieve it.",
      "similar": [
         189,
         10285,
         949,
         336843,
         910,
         996,
         1939,
         8834,
         845,
         72784,
         9272,
         1923,
         2163,
         223,
         9411,
         1645,
         2252,
         2832,
         12162,
         1571
      ],
      "original_title": "The Bat",
      "runtime": 80,
      "poster_path": "/kuqbKnzULGFDZEBrOjQooBray5w.jpg",
      "spoken_languages": [{
         "name": "Deutsch",
         "iso_639_1": "de"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Liberty Pictures",
         "id": 20938,
         "origin_country": ""
      }],
      "release_date": "1959-08-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "When Someone SCREAMS ... It Will Be YOU!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Crane Wilbur"],
      "runtime": 80,
      "synopsis": "Murder-mystery writer Cornelia van Gorder [Agnes Moorehead] has leased a large country house called \"The Oaks\". After being in the house for only a few days, Cornelia's longtime maid, Lizzie Allen [Lenita Lane], informs her that the servants are upset over rumors they have heard about the murders committed in the house last winter by the archcriminal who goes by the name of The Bat. They fear he is back, and they're also concerned about rabid bats that have supposedly been released by The Bat. That's hysterical nonsense, Cornelia says as she heads into Zenith to conduct some business at the Zenith City bank. She has another surprise when vice-president and head cashier of the bank, Victor Bailey [Mike Steele], mentions that the bank president and owner of The Oaks, John Fleming [Harvey Stephens], once said that he would never rent the house. Again, Cornelia is not concerned since she rented the house from his nephew, Mark Fleming [John Bryant]. As Cornelia chats with Victor's wife Dale [Elaine Edwards] and Lieutenant \"Andy\" Anderson [Gavin Gordon],a detective with the Zenith City Police Department and a member of the board of directors of the Zenith Bank, Victor is informed that the bank has been looted of over $1,000,000 in bonds and negotiable securities. Since the only two people with access to the vault are Victor himself and bank president John Fleming, who is currently away on a hunting trip in the Northwoods, Victor is arrested and attempts are made to contact Fleming. Meanwhile, at his lodge in the Northwoods, John Fleming informs his hunting partner and physician, Doctor Malcolm Wells [Vincent Price], that he has just embezzled over $1,000,000 from the bank and he needs help in covering it up. His plan is to murder their hunting guide and disfigure the body enough that Wells can pass it off as Fleming. After \"Fleming\" is declared dead and buried, the two of them will split the million. The money is currently hidden in the Fleming family crypt in Zenith, he explains. Wells recalls a time, however, when Fleming was very sick and, in fever, talked about hiding the money in a hidden room in The Oaks. When Fleming announces that, if Wells doesn't go for the deal, he'll kill Wells and call it a \"hunting accident,\" Wells turns his shotgun on Fleming. I ain't afraid of ghosts, Lizzie tells Cornelia when they read in the paper of John Fleming's death. Although the rest of the staff, except for Warner [John Sutton], the chauffeur, have quit their jobs, Lizzie intends to stay with \"Miss Corny\" under any circumstances. Because there's a storm brewing, Lizzie and Cornelia check to be sure all the doors and windows are shut. Lizzie suddenly sees a black-clawed hand reach through the front door, just about to grab Cornelia's throat. Lizzie's screams scare him off; Cornelia calls the police. They send someone over to check the grounds, but no one is found. Cornelia and Lizzie go upstairs and lock themselves in a bedroom. Meanwhile, The Bat has cut a hole in the front-door window, unlocked the door, and entered the house. As Cornelia and Lizzie try to sleep, he opens the transom into their room and releases a bat that flits around for a moment, lands on Lizzie's arm, and bites her. Concerned that the bat may be rabid, Cornelia phones Dr Wells. He's in his laboratory conducting an experiment (on a bat!), but he comes over to look at Lizzie. He dresses her arm and gives her a sleeping pill. After examining the bat, he proclaims that it doesn't look sick but that he won't know for sure until he examines its brain under a microscope. Meanwhile, Lt Andy has taken advantage of Dr Wells' absence and let himself into the lab where he snoops around and notices the experimental bat and a figure of a large bat in one of the windows. Andy then drives over to The Oaks, arriving just as Wells is leaving. Andy points out the hole in the glass where The Bat gained entrance and assures Cornelia that an officer will keep watch on the house for the rest of the night. Several days/weeks? have gone by, and Victor Bailey's trial is coming up. His secretary, Judy Hollister [Darla Hood], apparently has some information that will help to acquit him, so people are beginning to suspect that John Fleming robbed his own bank. Lt Anderson, concerned that his holdings at the bank will be wiped out if the money isn't found, pays a visit to Mark Fleming. Mark reveals that he hasn't received a dime of his inheritance from his uncle because the money is nowhere to be found. Meanwhile, Cornelia has managed to retain John Fleming's old maid, Jane Patterson [Riza Royce]. When Dr Wells, Dale Bailey, and Judy Hollister drop by for tea, they all discuss the possibility that it was John Fleming who actually robbed the bank. Cornelia suggests that Fleming may have hidden the money in The Oaks, and Dale phones Mark to see whether there are any floorplans of the house. Mark isn't sure why she would want the floorplan, so Lt Andy suggests that maybe Uncle John DID steal the money and hid it in the house. Mark agrees to come over that evening and help look for the plans. Come over Mark does, but he lets himself into the house with his own key while Cornelia, Dale, and Judy are eating dinner. He moves aside a grandfather clock and opens a panel to a secret closet. While he looks over the floorplans, The Bat enters the house and sneaks up behind, clobbers Mark, and makes off with the floorplans. After dinner, Cornelia is amazed to hear the grandfather clock striking the hour, when it hasn't done so in years. They notice that the clock has been moved, then Dale sees the panel behind it. They open the panel to find Mark Fleming...dead. Lt Anderson and Dr Wells are notified after the police are called. After seeing the claw marks on Mark's throat, Anderson proclaims it the work of The Bat. Later that night, after the police have combed the house for clues and Mark's body has been taken to the morgue, Lt Anderson remains to make sure all the windows and doors are locked. As he checks the rooms, he doesn't notice that Warner is watching him. After the ladies have gone to sleep, Cornelia and Lizzie in one room, Judy and Dale in another, The Bat comes in through the unlocked front door. First, he cuts the phone line. He then goes up to the third floor and into a storage room where he starts tapping on the walls. The noise wakes up Judy and Dale. Thinking she may be able to find the hidden money and clear her husband, Dale sneaks up to the third floor. The Bat locks her in the room and runs downstairs. On the way down, he runs into Judy and kills her, then he flees out the front door, after first being struck in the neck by a poker thrown by Cornelia. Shortly thereafter, Lt Andy comes in the front door. He explains that he was chasing someone on the grounds and asks as to the whereabouts of Warner the chauffeur. Warner suddenly comes in the front door and explains that he was following Anderson when he was suddenly hit on the head. It's then that Anderson remembers seeing a wanted poster with Warner's picture on it, but Warner says that he was tried and acquitted. He vehemently denies being The Bat. Suddenly, Dr Wells walks in the front door. He had an accident about a mile down the road, he says, and walked back to the house to use the phone. Andy notices blood on Wells' neck. Hmmm, could Dr Wells be The Bat? Several nights later, after the house had been searched from top to bottom without finding any money or a hidden room, Cornelia decides to conduct an investigation of her own. When the detective on duty falls asleep in his chair, Cornelia goes up to the third floor to look around in the storage room where The Bat was tapping on the walls. Measuring the distance between the storage room and the room next to it, Cornelia notices a loss of about five feet between the two rooms. She pounds on the walls, then on the panels of a fireplace. Suddenly, one of the panels opens up, revealing a switch that allows the fireplace to swing open. Cornelia has found the hidden room. It is empty, except for a safe in the wall. As she kneels before the safe, the fireplace swings closed, trapping her in the room. Meanwhile, The Bat has gone to Dr Wells' lab where he hangs a note on the wall. It says: \"Here lies The Bat -- threatened with exposure he destroyed himself.\" As The Bat turns around, Wells walks into the room with his gun drawn. The doctor taunts The Bat with the fact that he knows where the money is hidden and that he's going to shoot The Bat and put his own sign on his own chest. Just as Wells cocks the gun, The Bat leaps at him. They struggle, the gun goes off, and it is Wells who is shot. Cornelia's pounding on the walls wakes Lizzie, who notices that Cornelia's bed is empty. She goes down to the parlor and tries to wake up Detective Davenport [Robert Williams], only to find him drugged into sleep. Lizzie wakes the maid who goes to get Warner, only to find him missing. The detective calls headquarters to alert Lt Anderson only to find that he's been sent to investigate the death of Dr Wells. The three of them -- Lizzie, Jane, and Davenport -- look outside for Cornelia, but she doesn't answer their calls. Suddenly, Lizzie notices a light on the third floor and redirects everyone up there. The air in the hidden room is rapidly depleting. Cornelia can barely manage call out. She tells them to hit the panels over the fireplace and then passes out. Lizzie gives each panel a pound, finds the switch, and opens the fireplace just in the nick of time. Outside the house, The Bat is slinking around in the bushes. He has started the garage on fire, but Cornelia is wise to him. That fire was set to get us out of the house, she tells everyone. Instead of leaving, they turn out the lights and wait. A few minutes later, The Bat appears. When The Bat enters the hidden room, Davenport fires a shot. But The Bat is quicker and shoots Davenport. He then turns to the ladies who are hiding behind some boxes. Just as he's about to open fire on the ladies, he is shot from behind. Warner enters the room, his gun smoking. They remove the hood from over the Bat's face to find ... Lt Anderson. [Original synopsis by bj_kuehl]",
      "writers": [
         "Crane Wilbur",
         "Crane Wilbur"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0052602/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2MzAzNDIyMV5BMl5BanBnXkFtZTcwNzM3MDcxMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Vincent Price, Agnes Moorehead, Gavin Gordon | See full cast and crew »"],
      "reviews": [
         "Some people don't like to watch anything that's not in color...they don't know what they're missing. Some people look down at anything made in the fifties or sixties as hopelessly hokey...and they don't know what they're missing either. The Bat is a taut, suspenseful story, and one which proves gore isn't strictly necessary in order to be frightening. Agnes Moorhead shows plenty of spunk, and the great Vincent Price steals every scene in which he appears. The cinematography of this film is excellent...note the use of dark shadows to conceal and hide peoples' identities, just as the dark mask hides the Bat's face. Jump out of your skin as that eerily-clawed hand appears in frame for the first time. Ignore the truly awful fake-looking bat that appears for a few seconds. No movie's perfect. And play the adult version of the \"Scooby Doo\" mystery game...where you try to figure out who are the red herrings and who is the real murderer. It's probably not who you think it is.",
         "Agnes Moorhead (Endora of \"Bewitched\" fame) is a sheer delight as a cagey old bird of a mystery writer, and Price is wonderful in his seemingly dual role. As has been lamented here before, the brevity of Price's screen time is somewhat disappointing but that is the only factor which disappoints. I found this to be an inventive and disingenuous endeavor full of red-herrings and wrong turns. Figure this one out for yourself. Puzzle the clues, weed out the characters set here as distractions, look past the deliberate contrivances and solve the mystery on your own. Excellent entertainment with a splendid darkling atmosphere which I found enormous fun to view. While this is not up to \"Gaslight\" or \"Rebecca\" standards, there are many worse ways to spend a late Saturday night, or a rainy Sunday afternoon. It rates a 7.5/10 from... the Fiend :.",
         "This film is a lot better than you might expect. It follows the story of a wayward million dollars that is believed to be hidden within the walls of an old house. The inhabitants of the house are a female writer and her crew of servants.... oh, and a prowler known as 'the bat', who evidently wants the fortune for himself. The Bat is notable for a great macabre atmosphere that creates a sense of claustrophobia, as the house is in the middle of nowhere. It's also notable for an early performance from Vincent Price, who appears as the doctor, Malcolm Wells. Price was better known in 1959 for the William Castle classic \"House on Haunted Hill\", but 'The Bat' is still an able entry in his list of acting credits. Price evidently grew as an actor throughout the 60's and 70's, but his early performances always have that x-factor that would go on to instill the man in the hearts of horror fans forever, and his performance here has that also. The story itself has lots of room for tension and intrigue, and it makes best use of it as the film is constantly intriguing, and many scenes, particularly the ones involving the menacing bad guy, are filled with suspense. The film is at it's best when 'the bat' is on the prowl, and features several lovely shots of the fiend poking his arm through various crevices in the house. The house itself is riddled with various traps and secret passages in true haunted house style, and it adds to the inventiveness and effectiveness of the movie. The film gives the twist away far too early, however, and it kind of spoils the ending as it turns out that, logically, there's only one person who the bat could possibly be. It doesn't really matter though, as the film is always a lot of fun and if you're a fan of Vincent Price (and who isn't?!), or just classic horror movies in general, I highly recommend this movie.",
         "At least the third filmed version of story dealing with master criminal known as the \"Bat\" that steals and robs and kills. This version is probably the most brutal and certainly the most suggestive. Although shot on an extremely limited budget, The Bat is a pretty good little thriller, thanks in large part to the performances of Vincent Price and Agnes Moorehead and a pretty good script. The story is one of those types that keeps throwing red herrings at you so you will have no idea who the real Bat is. I had no idea who the real Bat was. It also makes good use of a creepy old mansion and has some good comedic, subtle relief. Watch for Darla Hood of Little Rascals fame in a smaller role.",
         "Cornelia (Agnes Moorehead) is a mystery writer who temporarily moves into a mansion to attempt to get some work done. She later learns that the homeowner embezzled money and hid it in somewhere in the house. After he turns up dead, Cornelia and her houseguests find that someone knows about the money and will stop at nothing to get it. Could it be the notorious spikey-fingered murderer, \"The Bat\"? This is a fun little mystery with a delicious performance by the always fabulous Agnes Moorehead. Vincent Price co-stars as the slightly creepy (of course!) town doctor. One of the most intriguing things about the movie is the refreshing treatment of the lead heroine. She has no love interest--something you don't see often in 50s horror movies. Her only reliance is upon her tough (and slightly butch!) maid, and her independence has garnered admiration by her female houseguests (one of which is played by Little Rascal Darla Hood). Unfortunately, the movie doesn't really capitalize much on the potential of its \"big creepy house with a claw-gloved murderer on the loose\" premise, and seems to run out of fuel towards the end. Once the body count starts, the actors look like they couldn't care less. But overall, this is an enjoyable and often creepy mystery with terrific performances by Moorehead and Price. My Rating: 6.5/10",
         "The Bat, while no Citizen Kane, is still a lot of fun. It gives some very good talent the opportunity to ham it up (Vincent Price made a career of it) while providing some rather rare brutal killings in a 50's movie. Price is brilliant as usual. Check out the moment when Agnes Moorhead mentions that the Bat is looking for money and that it's probably in the house. Price knows where the money is (talked about early on so no plot spoil) and his eyes lilt ever so slighty when Moorhead talks about it. A great subtle moment from a great actor. The other actors are put through their paces and turn in decent performances. The problem seems to be the casting of Moorhead. Her character goes from flighty to deep to strong to vulnerable and in fifty other directions as the movie goes on. Moorhead, though a very solid actress, just doesn't seem to be very convincing as a reclusive and somewhat eccentric author and she really doesn't have much to do until the end. The other problem with the Bat is that the killer's identity is as obvious as Natalie Portman's dual role in Star Wars Episode One, especially when people start getting killed. Otherwise, the movie is a nice little diversion that isn't too long and is a great view for a late Saturday night.",
         "I already encountered quite a few opinions and reviews that labeled \"the Bat\" as one of Price's LEAST entertaining movies. Okay, either I'm too biased about this magnificent actor's work or either I just know crap about horror cinema but I thought it was a GREAT movie!! Granted, the screenplay is a little too ambitious and too many characters are introduced, but overall this is an exciting and well-plotted thriller that satisfies the fans of haunted house stories as well the typical \"whodunit\" mysteries. The always-amazing Price is part of a well-filled cast and the events take place in an old, luxurious mansion. One million dollar worth of cash has been stolen from the bank, the loot is hidden somewhere in the house and there's a maniacal killer with a dedication for rabbit bats on the loose. Let the fun begin! The temporary tenant of the mansion, who happens to be a murder-story author, starts her own search for the killer's identity. \"The Bat\" is low on visual effects and make-up, but the constantly tense atmosphere and mysterious characters make up for that. The film could have used a little more action instead of all the talking but it remains an absolute pleasure to behold Vincent Price as a sneaky crook. The old \"Oaks\" mansion is a genuinely creepy horror location and the \"Bat\" character is a cool and imaginative villain. Certainly not the absolute highlight of Price's impressive career, but nonetheless a warmly recommended movie for his fans.",
         "THE BAT is a film based on the novel/play by Avery Hopwood and Mary Roberts Rinehart that was very popular in the twenties and early thirties. There were two previous film versions; one silent version made in the twenties and an early sound version made in 1930, the latter version mostly recalled today because it was one of the first films shot in 70mm and what we today call \"wide screen.\" Watching this 1959 version, I couldn't help get the feeling that this film belongs to era more remote than 1959. This kind of plot, with its creaky old mansion, secret passage ways, mysterious masked killer, hidden money etc., had just about vanished from the screen since the mid thirties. Other films of this type include the various versions of CAT AND THE CANARY and SEVEN KEYS TO BALDPLATE. Apparently someone noticed a film of this type hadn't been made in a while and it was a long time since the last version of THE BAT had been filmed. This 1959 version is none-the-less a very entertaining \"killer lurking around spooky old mansion\" thriller. The entire cast is excellent, including stars Vincent Price and Agnes Moorehead. The film very effectively keeps the killers identity from the audience until the very end. But when the killers identity is revealed, it begins to make sense when one thinks about. Perhaps of interest to today's viewers is how the killer some what resembles Freddy Kreuger. Despite being an entertaining thriller, THE BAT didn't inspire a revival of this genre.",
         "The cast and story are good enough to make this version of the mystery of \"The Bat\" watchable, though probably not as good as the earlier movie versions of the story. Agnes Moorehead is this film's strongest point, and Vincent Price also helps, although his role is much more limited. The story is one of the familiar kinds of 'dark house' mysteries, and it is done adequately, but it could have been better. The story is set up very well in the early scenes of the movie, with a lot of possibilities centering around the house that Moorehead's character has rented. But then, while it holds your interest for the rest of the time, it slows down quite a bit, and it never really makes full use of the potential that it has established. The story also has some unfortunate holes. The country house atmosphere is convincing enough to work for the most part, but it could easily have been better with more detail. Overall, it's worth seeing for anyone who likes the genre, as long as you don't expect too much.",
         "Female mystery writer, renting a bad luck-ridden estate in the country, is terrorized by a serial killer nicknamed \"The Bat\" (who dons a black hat, black mask, and black gloves complete with sharp claws!). Seems our blood-thirsty fiend is after a million dollars pilfered from the local bank and believes the loot is hidden in the writer's house. \"Who is it?\" mystery with hilariously overripe dialogue, a frivolous, fluttery-nervous atmosphere, and a lack of logic at every turn. Director Crane Wilbur also penned the script, an adaptation of a stage play dating back to the 1920s. It gets by sheerly on the talent of its leads, Vincent Price (as a sinister doctor) and Agnes Moorehead (with her pithy delivery and incredulous expressions). Nifty opening theme music by Alvino Rey, crisp cinematography by Joseph Biroc. Tolerable. ** from ****"
      ],
      "genres": [
         "Horror",
         "Thriller",
         "Mystery"
      ],
      "productionCompanies": ["Liberty Pictures"],
      "summaries": [
         "Mystery writer Cornelia Van Gorder has rented a country house called \"The Oaks\", which not long ago had been the scene of some murders committed by a strange and violent criminal known as \"The Bat\". Meanwhile, the house's owner, bank president John Fleming, has recently embezzled one million dollars in securities, and has hidden the proceeds in the house, but he is killed before he can retrieve the money. Thus the lonely country house soon becomes the site of many mysterious and dangerous activities.",
         "A crazed killer known as \"The Bat\" is on the loose in a mansion full of people."
      ],
      "budget": 0
   },
   "movielensId": 2814,
   "movielens": {
      "languages": ["Deutsch"],
      "releaseDate": "1959-08-09",
      "dvdReleaseDate": "2004-06-29",
      "directors": ["Crane Wilbur"],
      "runtime": 80,
      "movieId": 2814,
      "title": "The Bat",
      "mpaa": "",
      "actors": [
         "Vincent Price",
         "Agnes Moorehead",
         "Gavin Gordon",
         "John Sutton",
         "Lenita Lane",
         "Darla Hood",
         "Elaine Edwards",
         "John Bryant",
         "Harvey Stephens",
         "Mike Steele",
         "Riza Royce",
         "Robert Williams"
      ],
      "imdbMovieId": "0052602",
      "originalTitle": "The Bat",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["lK-wWMupWqI"],
      "plotSummary": "Mystery writer Cornelia Van Gorder has rented a country house called \"The Oaks\", which not long ago had been the scene of some murders committed by a strange and violent criminal known as \"The Bat\".Meanwhile, the house's owner, bank president John Fleming, has recently embezzled one million dollars in securities, and has hidden the proceeds in the house, but he is killed before he can retrieve it.",
      "tmdbMovieId": 35813,
      "avgRating": 2.55769,
      "releaseYear": "1959",
      "numRatings": 104,
      "posterPath": "/kuqbKnzULGFDZEBrOjQooBray5w.jpg"
   }
}