{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "poison",
            "id": 351
         },
         {
            "name": "pilot",
            "id": 3203
         },
         {
            "name": "dying and death",
            "id": 3737
         },
         {
            "name": "airplane",
            "id": 3800
         },
         {
            "name": "drugs and addiction",
            "id": 33785
         }
      ],
      "imdb_id": "tt0103617",
      "video": false,
      "title": "Iron Eagle III",
      "recommendations": [
         11955,
         34390,
         61403,
         26042,
         18188,
         91445,
         28737,
         11037,
         26881,
         44126,
         26340,
         39242,
         19386,
         32631,
         26883,
         19086,
         19002,
         7269
      ],
      "backdrop_path": "/w2NidHq95YYbq744H8WK3BGZD0Z.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 17,
               "character": "Charlos Chappy Snclair",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040bb5",
               "name": "Louis Gossett, Jr.",
               "profile_path": "/ggWZg5ADOjhMLqfr9canl7gNTGD.jpg",
               "id": 20959,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe432fc3a36847f8040bad",
               "name": "Rachel McLish",
               "profile_path": null,
               "id": 20957,
               "order": 1
            },
            {
               "cast_id": 24,
               "character": "Kleiss",
               "gender": 2,
               "credit_id": "5755f874c3a3680cc70001fa",
               "name": "Paul Freeman",
               "profile_path": "/gWRX09kyrzTFFehwE53cJtps2fx.jpg",
               "id": 652,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Leichmann",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040ba5",
               "name": "Horst Buchholz",
               "profile_path": "/bNyMxUU2aVaqDfoqRhnIjQJe3jo.jpg",
               "id": 5789,
               "order": 3
            },
            {
               "cast_id": 21,
               "character": "Palmer",
               "gender": 2,
               "credit_id": "5755f8239251416e360001d0",
               "name": "Christopher Cazenove",
               "profile_path": "/sck3PP8PepiasZ4gZ19PE5FBXQZ.jpg",
               "id": 67567,
               "order": 4
            },
            {
               "cast_id": 22,
               "character": "Horikoshi",
               "gender": 2,
               "credit_id": "5755f8349251416e250001d2",
               "name": "Sonny Chiba",
               "profile_path": "/ntFUKxaPHR5E7OWuyp0mdEZPfdk.jpg",
               "id": 2537,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Stockmann",
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040ba9",
               "name": "Fred Dalton Thompson",
               "profile_path": "/wk6ihO1JvxBwfvPGkYLKMHpQcGb.jpg",
               "id": 17874,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Simms",
               "gender": 2,
               "credit_id": "5755f8589251416e2a000212",
               "name": "Mitchell Ryan",
               "profile_path": "/2GTRqLcW8uPlFdTkEqcZDpxrXS6.jpg",
               "id": 14312,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Doyle",
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040bb9",
               "name": "Rob Estes",
               "profile_path": "/yeMUVAtKXbHlohrcHNwwBZjTtwI.jpg",
               "id": 20960,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Chico",
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040bb1",
               "name": "Ray Mancini",
               "profile_path": null,
               "id": 20958,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040b6b",
               "name": "Stanley Neufeld",
               "profile_path": null,
               "id": 20949,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b71",
               "name": "Ron Samuels",
               "profile_path": null,
               "id": 20950,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b77",
               "name": "John Glen",
               "profile_path": "/uR9zerOtAOSAC7rSuGLyAv03vtv.jpg",
               "id": 10179,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b7d",
               "name": "Kevin Elders",
               "profile_path": null,
               "id": 20951,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b83",
               "name": "Alec Mills",
               "profile_path": null,
               "id": 10668,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b89",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b8f",
               "name": "Bernard Gribble",
               "profile_path": null,
               "id": 20954,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040b95",
               "name": "Kevin Elders",
               "profile_path": null,
               "id": 20951,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe432fc3a36847f8040b9b",
               "name": "Jo Napoleon",
               "profile_path": null,
               "id": 20955,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040ba1",
               "name": "Mario Kassar",
               "profile_path": null,
               "id": 3986,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040bbf",
               "name": "Sidney J. Furie",
               "profile_path": "/mGzfybmbXz06h5aUxW3frPtvaLH.jpg",
               "id": 64508,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe432fc3a36847f8040bc5",
               "name": "Robb Wilson King",
               "profile_path": null,
               "id": 21640,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.98236,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 2038,
      "vote_count": 20,
      "budget": 0,
      "overview": "Chappy discovers a drug-smuggling scheme at his own air base. It turns out that the lives of some village people in Peru are at stake, and he decides to fly there with ancient airplanes and friends to free them.",
      "similar": [
         744,
         27932,
         76163,
         334,
         87502,
         858,
         813,
         1562,
         37834,
         27582,
         225574,
         745,
         10145,
         390051,
         1597,
         1374,
         408,
         335,
         594,
         5559
      ],
      "original_title": "Iron Eagle III",
      "runtime": 98,
      "poster_path": "/qPdxlQGQ4SUpDU2CPpXODeqPDkv.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Seven Arts Pictures",
            "id": 14159,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Carolco Pictures",
            "id": 14723,
            "origin_country": ""
         }
      ],
      "release_date": "1992-01-09",
      "vote_average": 3.6,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Iron Eagle Collection",
         "id": 123251,
         "poster_path": "/bAXtdm522B1kVaripFoZLJRU7Ba.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["John Glen"],
      "runtime": 98,
      "synopsis": null,
      "writers": [
         "Kevin Elders",
         "Sidney J. Furie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0103617/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNzYxNTQ0NDg2Nl5BMl5BanBnXkFtZTcwMTMyNTYyMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Louis Gossett Jr., Rachel McLish, Paul Freeman | See full cast and crew »"],
      "reviews": [
         "Directed by John Glen, best known for his work on the James Bond series, Iron Eagle III is a decent enough aviation-action-B-Movie. Louis Gossett Jr.'s Chappy is back in action, this time flying vintage World War Two aircraft instead of modern jet fighters. It's a good change of scenery, even if the German Me-109 and Japanese Zero are actually American aircraft in disguise: a P-51 B stands in for the Me-109, and a whitewashed Texan shemps it as a Zero. The plot is all to familiar: A heroic group goes rogue to take on the drug cartel. Except this time the cartel happens to be under the command of an Ex-Nazi. John Glen is a competent action director and makes the most out of what was no doubt a budget considerably smaller than the typical 007 film. The acting is mixed, and we receive different levels of performance from the different actors. Gossett probably tuns in the best performance of the group. Fans of aviation movies will no doubt find at least some elements of the movie pleasing. It does feature some beautiful aircraft, most notably the British Spitfire and American P-38 Lightning. An authentic Me-109 and Zero would have greatly added to the film, but at least the Spitfire and Lightning are the real deal. At one point the WWII planes take on some lower end jet fighters, and some humor and nostalgia ensue. As one pilot in the movie likes saying \"technology is no match for seasoning.\" It's a fun concept to see the propeller driven dogfighters-which by the end of WWII were approaching their twilight, as electronic warfare began to develop- taking on that which made them obsolete, and defeating them. Apart from Gossett, there are a few recognizable actors in the film. Sonny Chiba plays the pilot of the Zero. Mitch Ryan of \"Dharma and Greg\" fame plays General Simms. Tom Bower as DEA agent Crawford is also recognizable, as you've probably seen him in bit roles in other movies. Second to Chappy, the most featured character in the movie is Rachel McLish's Anna. Her greatest asset is her physical presence on the screen. Her most remarkable scene is her first, when she escapes from her chains, muscles popping out everywhere. Her dialogue isn't the best to work with, and her delivery is adequate, nothing more. But that's not to say I didn't enjoy watching her. After all, this is an action movie, not a drama. The video cover box makes her out as Rambo with an X chromosome, but her character is more vulnerable than that, which I suppose is a good thing since it adds realism. All things considered, Aces: Iron Eagle III is an enjoyable B-grade action movie. The producers were wise to change the scene for this movie, as Iron Eagle I and II featured F-16's. Iron Eagle III isn't perfect, but at least it's not a complete rehashing of the first two movies-a commendable effort.",
         "Maybe it's just cause I'm kinda partial to great flying and big-busted women who kick butt, but \"Aces: Iron Eagle 2 is the most fun I've had watching a movie all year (the other highlight being \"Princess Diaries 2, but that's another story). After seeing the original, pathetic \"Top Gun\" wannabee (aircraft engaged in \"aerial combat shooting static displays, COME ON!), I skipped \"Iron Eagle 2\". However, there were some things I wanted to see after watching the previews and seeing the poster. Yeah, those things belonging to Rachael McLish, the only body builder of EITHER gender who ever got my cigar puffing (Yeah, I know this is sexist as hell, but I'm on a roll and it's THAT kind of movie). No nudity, darn it, but McLish is hot and handles herself well, especially with a couple of machine guns. Besides, how many movie's do you get to see with Sonny (\"Streetfighter\") Chiba, Horst (\"Magnificent Seven\") Bucholz and Senator Fred Thompson of the great state of Tennessee, not to mention, the downright neat (with the right script) Lou Gossett, Jr.? Yeah, \"Aces\" is predictable, but that's part of its charm. It was probably also fun for former 007 director John Glen to work with people who can actually enjoy their work without trivializing it. HEY ROGER MOORE AND TIM DALTON: PAYING ATTENTION? Just wish McLish would've had more exposure ... I give \"Aces: Iron Eagle 3\" a \"7\". MISS MCLISH: DO YOU HAVE ANY OUTTAKES? THE RIGHT ONES WOULD BE WORTH AN \"8\".",
         "Aces: Iron Eagle 3 is a pretty good movie despite it's bad reviews I've read between critics and other IMDB users. I didn't really go mad for the original Iron Eagle and I thought Iron Eagle 2 was rubbish but Aces: Iron Eagle 3 does get my approval. I like the idea of four different men from different countries coming together as one to fight on the same side. One huge flaw in this movie is the plot, there's no way old WW2 fighters, no matter how good they look, could take on modern jet fighters...it could be done, maybe if the modern fighters had no wings! Overall a good entertaining \"TopGun\" style movie, if a little unrealistic. 6/10",
         "this was an absolute thrill to watch. i was very suprised to see rachel mclish do so well in this movie. her muscularity made her perfect for this. i especially liked the close up on here beautiful, bulging arms. a great cast makes this a must see",
         "The third entry to take off the runway \"Aces: Iron Eagle III\" happened to be the only feature from the series not to have director / writer Sidney J. Furie involved and he was replaced by director John Glen (who would be well known for his contributions to the 007 cycle). However Louis Gossett Jr. would return as everybody's favourite pilot Charles 'Chappy' Sinclair. Everything about this one is fairly far-fetched, lively and over-the-top, but for me it would have to be the most enjoyable of the series. Far better than the tepid last film. This b-grade effort plays out as if \"Top Gun\" met \"Rambo\" in a drug war, but with a twist as the planes used here are vintage aircrafts manned by veteran fighter pilots of different cultures. America, England, Germany and Japan are teaming up to battle corruption in an American Air force base and a German drug lord (played by Paul Freeman with venomous aplomb) living it up in South America. Gossett Jr. seems to be having a good time in the role, along with other actors Hortz Buchholz, Sonny Chiba and Christopher Cazenove. The chemistry between the four simply crackles. Also bodybuilder Rachel McLish would appear for some flexing of her muscles and to kick some ass --- doing her best impersonation of \"Rambo\". There are some more recognisable faces turning up; Fred Dalton Thompson, Mitch Ryan, Juan Fernandez, Tom Bower, J.E. Freeman and a comical turn by Phill Lewis. Streaming through it is a comic-book tone, where it balances out its serious side (honour and pride) with some clowning humour (witty exchanges aplenty) and a wicked death here or there (death by bell anyone). Again like the other films in the series, it's slow to start off --- characters gelling, plans are being schemed and investigations are occurring, but when it takes flight. It's time to go up against the odds. Director Glen comes to the stage, constructing blistering action set-pieces of genuine excitement (which wouldn't be out of place in a Bond presentation) and stellar airborne sequences --- especially the cat mouse scenes with the old-school planes up against the F-16s. Maybe unbelievable, but it gets the blood pumping along with Harry Manfredini's soaring music score. Senselessly clichéd, but fun action escapism. \"You want miracles. Why don't you call the pope.\"",
         "I love movie's that include vintage war planes in the plot, and this is no exception- even though the ME-109 and Japanese Zero were substituted by a repainted P-51B and a T-6 Texan. But it was still a fun b movie ride. Directed by John Glen, best known for his work on the James Bond series, the story follows Chappy Sinclair (once again played by Louis Gossett, Jr.) who is now flying part time in an air show act, with him flying a P-38 Lightening. Joining him in the show are three washed up WWII vets: Palmer from Great Britain, piloting a Supermarine Spitfire (beautiful airplane); Leichman from Germany, piloting an Me-109 (the P-51B I mentioned earlier, but still magnificent looking none the less); and Hirokoshi, piloting the Zero. The action starts when a deceased friend's sister approaches Chappy for help in taking down a Nazi drug lord who is holding her Peruvian village hostage. With her and a street wise hustler by his side, Chappy and the vets out fit the planes with air to ground rockets and set out to prove that its about the man, not the machine. The action in this movie is awesome, considering the budget, and its a fun concept seeing these pilots coming together and putting past former differences past for one final battle. If you love antique fighters and aren't a nitpick, then this is the movie for you.",
         "This film incorporates most of the clichés, (republican) political themes,and formulae of modern military fiction, and tells a story about aging planes and the aging men who fly them fighting to avenge the honor of a fellow pilot and put a dent (more of a bomb crater) in the drug war. The film also adds some characterization and entertaining action sequences, and attempts, though not very effectively, to employ comic relief (Phill Lewis' character). Lou Gossett Jr, Sonny Chiba, Chris Cazenove, and Horst Bucholtz play a team of exhibition fliers who put on air shows in authentic and semi-authentic WWII planes. Gossett also has a 'day job' at an air force base which is due to be closed. When one of Gossett's younger colleagues loses his plane and the wreckage is found to have been stuffed with cocaine, Chappy (Gossett) goes into action. Meanwhile in Peru - where all of this will ultimately lead - our female lead, Anna escapes imprisonment by an ex-Nazi drug-lord who has taken over her small town. Anna is an athlete and appears to be about 23 years old. The character is played by Rachel McLish - who is, as of 2007, 51 years old. The film is 15 years old, so she was in her mid-30s when she made it. I had to look up her age three times before I could believe what I was seeing. McLish is not a bad actress, though not quite up to the level of the rest of the cast. She is, however, excellently physical, and would have made a great action star (I wouldn't be surprised if this option were still open to her). A quarter of the way through the film, these two plots are about to coalesce. If you're a fan of military fantasy, you just might enjoy this fairly silly but very pretty film. Others should probably avoid it.",
         "Let me put it this way: if you're looking for a movie with lots of action, plenty of explosions, Sonny Chiba (!), a cast as integrated as an old \"Star Trek\" episode and the wonders of Rachel McLish, you MUST see \"Aces: Iron Eagle III\". The first one was pretty good in a cheesy, '80s way; the second was more or less forgettable (tell the truth, I can't remember one character from it)... but \"Aces\" - It has everything an action fan could want. ...that is, if you haven't seen \"Top Gun\", \"Die Hard\" or any other movies with explosions, planes, Louis Gossett Jr., etc... etc.... But Rachel McLish. Sighhhhh.... Excuse me, where was I? Oh yes, Rachel. What a woman. Not only is she stronger than any of the guys in this film, but she shoots, fights, speaks Spanish and strangles guards with chains better than Bruce Willis ever dreamed of. Looks better in a t-shirt, too. Two and a half stars for \"Aces\". Good stunts, explosions.... Great use of a former Ms. Olympia.",
         "This movie was total nonsense, but still I kept watching. The action is quite good and plenty of explosions. Absolutely ludicrous plot. Theres a bit where the Spitfire pilot shoots down a jet with a grenade launcher while he hangs out of the cockpit. Nonsense but great stuff. Its got Horst Bucholtz in as well.",
         "This movie is just a strange plot.Imagine a german a japanese person and an american named Chappy who all have planes from their country during WW2.No this isn't a joke its the movie Iron Eagles 3 Aces .This flick does have its moments though.If you're looking for a good war movie id recommend Top Gun or Iron Eagle and Iron eagle 4.This is only for Iron Eagle buffs."
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Carolco Pictures",
         "Seven Arts Productions",
         "Aces Eagles Productions"
      ],
      "summaries": [
         "Chappy Sinclair is back. This time he tries to help a woman, whose South American village has been taken over by a former Nazi, who is now a cocaine dealer and who uses her village as his base of operations. She manages to escape and goes to the States and meets up with Chappy. When Chappy tries to get help from the Air Force, he discovers that the General he is speaking to, is the Nazi's partner. So, he along with three ageing pilots, take some vintage fighter planes and go there to try and help.",
         "Chappy discovers a drug-smuggling scheme at his own air base. It turns out that the lives of some village people in Peru are at stake, and he decides to fly there with ancient airplanes and friends to free them."
      ],
      "budget": 0
   },
   "movielensId": 2817,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1992-01-09",
      "dvdReleaseDate": "2004-10-05",
      "directors": ["John Glen"],
      "runtime": 98,
      "movieId": 2817,
      "title": "Iron Eagle III",
      "mpaa": "R",
      "actors": [
         "Louis Gossett",
         " Jr.",
         "Rachel McLish",
         "Paul Freeman",
         "Horst Buchholz",
         "Christopher Cazenove",
         "Sonny Chiba",
         "Fred Dalton Thompson",
         "Mitchell Ryan",
         "Rob Estes",
         "Ray Mancini"
      ],
      "imdbMovieId": "0103617",
      "originalTitle": "Iron Eagle III",
      "genres": [
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Chappy discovers a drug-smuggling scheme at his own air base. It turns out that the lives of some village people in Peru are at stake, and he decides to fly there with ancient airplanes and friends to free them.",
      "tmdbMovieId": 2038,
      "avgRating": 1.70157,
      "releaseYear": "1992",
      "numRatings": 764,
      "posterPath": "/qPdxlQGQ4SUpDU2CPpXODeqPDkv.jpg"
   }
}