{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0113438",
      "video": false,
      "title": "Iron Eagle IV",
      "recommendations": [44535],
      "backdrop_path": "/sJBLbYkxfV9OZjyjd5uFtIH6XS9.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 6,
               "character": "Charles 'Chappy' Sinclair",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d2b",
               "name": "Louis Gossett, Jr.",
               "profile_path": "/ggWZg5ADOjhMLqfr9canl7gNTGD.jpg",
               "id": 20959,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Doug Masters",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d2f",
               "name": "Jason Cadieux",
               "profile_path": null,
               "id": 101791,
               "order": 1
            },
            {
               "cast_id": 8,
               "character": "Wheeler",
               "gender": 1,
               "credit_id": "52fe45aec3a368484e068d33",
               "name": "Joanne Vannicola",
               "profile_path": "/ey5bBhPg0o931O3K8mMqu8MrffP.jpg",
               "id": 78686,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Peter Kane",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d37",
               "name": "Max Piersig",
               "profile_path": null,
               "id": 101793,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "Dana Osborne",
               "gender": 1,
               "credit_id": "52fe45aec3a368484e068d3b",
               "name": "Karen Gayle",
               "profile_path": null,
               "id": 101795,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Malcolm Porter",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d3f",
               "name": "Ross Hull",
               "profile_path": null,
               "id": 101797,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Kitty Shaw",
               "gender": 1,
               "credit_id": "52fe45aec3a368484e068d43",
               "name": "Rachel Blanchard",
               "profile_path": "/AmP996UJu7DABlNyuMUxMJPimy5.jpg",
               "id": 52478,
               "order": 6
            },
            {
               "cast_id": 13,
               "character": "Rudy Marlowe",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d47",
               "name": "Dominic Zamprogna",
               "profile_path": "/8iC5CVTtE2hJteoZswP0Lldd6L3.jpg",
               "id": 58905,
               "order": 7
            },
            {
               "cast_id": 14,
               "character": "Wilcox",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d4b",
               "name": "Sean McCann",
               "profile_path": "/sp4Ci5WLATw889RNLS1RJZuN3es.jpg",
               "id": 17646,
               "order": 8
            },
            {
               "cast_id": 15,
               "character": "Amanda Kirke",
               "gender": 1,
               "credit_id": "52fe45aec3a368484e068d4f",
               "name": "Victoria Snow",
               "profile_path": "/vVF1FXN6ij5dBJxLabwWYruDvnN.jpg",
               "id": 101798,
               "order": 9
            },
            {
               "cast_id": 16,
               "character": "Sgt. Osgood",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d53",
               "name": "Jason Blicker",
               "profile_path": "/pDFZFGUQPDF0kt2izRPz4LhNCfd.jpg",
               "id": 44169,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Gen. Kettle",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d57",
               "name": "Al Waxman",
               "profile_path": "/8bZfhAZbKTHt2qi5B86Q4WNAGRo.jpg",
               "id": 36172,
               "order": 11
            },
            {
               "cast_id": 18,
               "character": "Luther Penrose",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d5b",
               "name": "J.D. Nicholsen",
               "profile_path": null,
               "id": 101799,
               "order": 12
            },
            {
               "cast_id": 19,
               "character": "Maj. Pierce",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d5f",
               "name": "Dean McDermott",
               "profile_path": "/bk3qrCTtDMGd3KXtOrUXyQ26EyA.jpg",
               "id": 65771,
               "order": 13
            },
            {
               "cast_id": 20,
               "character": "Cpl. Fincher",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d63",
               "name": "Aidan Devine",
               "profile_path": "/aq6ZhaqQnhQnvHOtdyeeNSVuPNR.jpg",
               "id": 237,
               "order": 14
            },
            {
               "cast_id": 21,
               "character": "Capt. McQuade",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d67",
               "name": "Matt Cooke",
               "profile_path": null,
               "id": 44237,
               "order": 15
            },
            {
               "cast_id": 22,
               "character": "Amn. Cameron",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d6b",
               "name": "Jeff Pustil",
               "profile_path": null,
               "id": 101801,
               "order": 16
            },
            {
               "cast_id": 23,
               "character": "Col. Birkett",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d6f",
               "name": "Chas Lawther",
               "profile_path": null,
               "id": 101803,
               "order": 17
            },
            {
               "cast_id": 24,
               "character": "Lt. Mara",
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d73",
               "name": "Kevin Hicks",
               "profile_path": null,
               "id": 101804,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d0f",
               "name": "Sidney J. Furie",
               "profile_path": "/mGzfybmbXz06h5aUxW3frPtvaLH.jpg",
               "id": 64508,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d15",
               "name": "Michael Stokes",
               "profile_path": null,
               "id": 101788,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d1b",
               "name": "Mark Amin",
               "profile_path": null,
               "id": 58048,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45aec3a368484e068d21",
               "name": "Joseph Newton Cohen",
               "profile_path": null,
               "id": 64935,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45aec3a368484e068d27",
               "name": "Peter R. Simpson",
               "profile_path": null,
               "id": 35329,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         }
      ],
      "popularity": 2.513746,
      "production_countries": [],
      "id": 28737,
      "vote_count": 10,
      "budget": 0,
      "overview": "While Chappy Sinclair is saddled with a bunch of misfits and delinquents for his flight school, he turns to his protégé Doug Masters to assist him in rounding them into shape for an important competition. During their training, they stumble upon a group of subversive air force officers who are dealing in toxic waste as a sideline.",
      "similar": [],
      "original_title": "Iron Eagle IV",
      "runtime": 96,
      "poster_path": "/6z5GC92OoaXT1EOdVb1rwSGtusC.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1995-01-01",
      "vote_average": 2.8,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Iron Eagle Collection",
         "id": 123251,
         "poster_path": "/bAXtdm522B1kVaripFoZLJRU7Ba.jpg"
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Sidney J. Furie"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Michael Stokes"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113438/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIxMDAzNjYwNV5BMl5BanBnXkFtZTcwNzk5NTYyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Louis Gossett Jr., Jason Cadieux, Joanne Vannicola | See full cast and crew »"],
      "reviews": [
         "This movie was good at least I thought so. I liked the way they brought Doug back into the story, but I wish they got the same actor who played him in the first movie but oh well. Some elements of the movie were kinda silly, like the fact that 2 guys and a bunch of kids single handedly took down some evil plot or the fact they tried to accomplish this by using outdated planes. I found that If you don't look to much into the story, Iron Eagle IV makes for a good time killer. It also helps not to know which movie it is. I at had only seen the first movie so I assumed that Iron Eagle IV was Iron Eagle II. Maybe this helped make it a good movie. If I were to have known it was Iron Eagle IV I might not have watched it, but I'm glad I did.",
         "Movie is watchable. It isn't Gone With the Wind or even Top Gun, but it is fun. That's all of my review of the movie I recommend that all of the negative reviews be tossed because the content proves that none of them watched the movie. Did all of ya'll (Yeah, I'm from Dixie) get together and decide to pan this movie as an addition to your pointless evening? You can't spell either. Get a life. BTW I was an Air Force officer and a flier. The enlisted guy can call me Sir or Colonel.",
         "Doug Masterson has been shot down, but he's not dead as we've been lead to believe, instead he bailed out at the last second and became a POW in Russia. Now, he's out and living the life of a crop duster and possible alcoholic, fun times. Sidney J. Furie returns to finally tell a further adventure tale of Chappy and Doug, but this time with a different actor taking over Doug's role. I always wonder what the original actor was doing that was so much better then this. The two team up, all be it reluctantly on Dougy's part, to try and teach some delinquents how to fly planes...and also fight with some corrupt air force guys. It's not a bad movie, but with is tight bottom of the barrel budget, and some borderline acceptable performance, this one is just barely watchable.",
         "Fortunately, this is the last! Since the first part, the iron eagles have only degrade it either at the history and role of different characters! Being a huge fan of the first two films, it is really sloppy! And I do not mince words! By analyzing many parts of the film, we see that the filmmakers have taken parts one and two films in the series ... RIDICULOUS! When I started the film, I wondered if it was not a remake of two comic actors were playing so poorly. I'm so done everything to get them to my belief that the sequences (3 and 4) would be tempting that I am even more disappointed! Regards, AKmiva",
         "As an US Air Force veteran, a former flight attendant, and aviation enthusiast, this and all the Iron Eagle movies are wrong in so many ways. However, just like a train wreck and I need a big dose of unreality, I'm actually watching this. So, this was filmed in Canada, eh? Wondered why I saw a lot of planes with Canadian registrations. It's funny, the main character was complaining about antiquated T-6's while he's working on an even older aircraft. I'm surprised I didn't see anyone mention that the MiG-29's at the beginning of the movie were F-4 Phantom II's. They look nothing like MiG-29's. Now Chappie is in uniform. About that... In the mid early to mid '90's they did try to change our uniforms. The jacket is sort of close to what they tried to do, but instead of 4 buttons I think it was three. Then again, I wore BDU's 99.9 percent of my enlistment and so did the officers I worked with. Interesting they went with that uniform in this cheesy movie. Boo for me for watching this trash, but if there is flying involved, I'm probably going to check this out. I would not recommend this movie to anyone. But if you are really board and have a pretty good beer buzz on and can't sleep, but all means watch it.",
         "Chappy turns to Doug Masters for help dealing with flight school misfits... kind of funny, considering Doug Masters was blown up in midair within the first two minutes of \"IRON EAGLE II\", so how is he there to help Chappy out? The first movie is a classic 1980's us-versus-the-terrorists flick, and done back when Louis Gossett Jr. actually had a career. It also showcased a young Jason Gedrick, who is sorely missed here. This is one of those franchises where 1. there should have been no sequels, 2. the entire cast save the wisened old codger has changed, 3. it gets worse and worse as it goes on, ala the Delta Force/American Ninja/Kickboxer franchises.",
         "The ONLY reason to see this third sequel to the classic IRON EAGLE is because Rachel Blanchard is in it. She saves this from being a complete waste of time. The dialogue, music, and flight sequences are really bad, but Rachel Blanchard's excellent performance makes up for all that. Now I know a lot of you won't think she gave an excellent performance, but it was certainly a whole lot better than the other performances in this movie.",
         "whomever thought of having sequels to Iron Eagle must be shot. In this case once was enough. Iron Eagle was a good movie to watch. Even though it is unrealistic, it is still entertaining. Iron Eagle II has a senseless plot and can be used to as a cure to insomnia. I didn't even bother to watch Iron Eagle III, but from looking at the R rating, I assume it's more violent than the past 2 movies. Well, Iron Eagle IV is probably the most inane sequel. Lou Gossett Jr. returns as the always delightful \"Chappy\" Sinclair. Another Jason returns to fill the role of Doug Masters (Canadian Jason Cadieux, who looks just like Jason Gedrick from the first Iron Eagle). But wait(Here comes a possible spoiler).....Wasn't Doug killed in Iron Eagle II? The writers must've been desprate for a story so they revived Doug Masters by saying he was a prisoner of the Russians. This movie was the cheapest done of all the Iron Eagle films. Why do movie makers find it neccessary to make sequels to unappealing movies? (ex. Police Academy movies). I have always liked Gossett Jr.'s work in these films. He was the only one holding this turkey together. Let's hope this was the last of the Iron Eagle sequels. let it rest in peace.",
         "The first Iron Eagle was really fun to watch even it was unworthy of belief. The second one was bad (I didn't watched the third one) but this is unbelievable bad...... Jason Cadieux can`t act, Jason Gedrick was much better as Doug Masters and how in the world got Louis Gosset Jr. in this piece of garbage!?!! The Canadian Joanne Vannicola is the worst actress ever. Don`t watch this movie even when you are hopeless......",
         "Well, I certainly didn't expect there to be four movies. The first movie was ok, but the Second movie with Mark Harmon was great the Best in the series. The third movie shakes on interesting and the fourth movie is just impossible. How can Doug masters help Chappie when he was killed in flight engagement in the beginning of the first movie? It baffles me how people can die in one movie and come back in another, two down the line. ***News flash**** That stuff only works in Soap Operas, not in the movies."
      ],
      "genres": [
         "Action",
         "Drama"
      ],
      "productionCompanies": [
         "Trimark Pictures",
         "Norstar Entertainment"
      ],
      "summaries": ["While Chappy Sinclair is saddled with a bunch of misfits and delinquents for his flight school, he turns to his protégé Doug Masters to assist him in rounding the into shape for an important competition. During their training, they stumble upon a group of subversive air force officers who are dealing in toxic waste as a sideline."],
      "budget": 0
   },
   "movielensId": 2818,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-01-01",
      "dvdReleaseDate": "1999-03-09",
      "directors": ["Sidney J. Furie"],
      "runtime": 96,
      "movieId": 2818,
      "title": "Iron Eagle IV",
      "mpaa": "PG-13",
      "actors": [
         "Louis Gossett",
         " Jr.",
         "Jason Cadieux",
         "Joanne Vannicola",
         "Max Piersig",
         "Karen Gayle",
         "Ross Hull",
         "Rachel Blanchard",
         "Dominic Zamprogna",
         "Sean McCann",
         "Victoria Snow",
         "Jason Blicker",
         "Al Waxman",
         "J.D. Nicholsen",
         "Dean McDermott",
         "Aidan Devine",
         "Matt Cooke",
         "Jeff Pustil",
         "Chas Lawther",
         "Kevin Hicks"
      ],
      "imdbMovieId": "0113438",
      "originalTitle": "Iron Eagle IV",
      "genres": [
         "Action",
         "Adventure"
      ],
      "youtubeTrailerIds": ["JHP24dSM9ZM"],
      "plotSummary": "While Chappy Sinclair is saddled with a bunch of misfits and delinquents for his flight school, he turns to his protégé Doug Masters to assist him in rounding them into shape for an important competition. During their training, they stumble upon a group of subversive air force officers who are dealing in toxic waste as a sideline.",
      "tmdbMovieId": 28737,
      "avgRating": 1.61538,
      "releaseYear": "1995",
      "numRatings": 481,
      "posterPath": "/6z5GC92OoaXT1EOdVb1rwSGtusC.jpg"
   }
}