{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0010418",
      "video": false,
      "title": "Male and Female",
      "recommendations": [
         63923,
         43983
      ],
      "backdrop_path": "/vT12OZIUBvcOUZWy0QBLAUeJ2ai.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "William Crichton - The butler",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168d2f",
               "name": "Thomas Meighan",
               "profile_path": "/f00ZeOS43NQMqW9IIHE9azL1Wj4.jpg",
               "id": 98970,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Lord Loam",
               "gender": 0,
               "credit_id": "52fe4879c3a36847f8168d33",
               "name": "Theodore Roberts",
               "profile_path": "/yFoHvwngWYfwS3FxPHZbVCKUox2.jpg",
               "id": 148787,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Honorable Ernest 'Ernie' Wolley",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168d37",
               "name": "Raymond Hatton",
               "profile_path": "/dtzBcur5aco03B8kRguRc3IiLON.jpg",
               "id": 90333,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lord Brockelhurst",
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168d3b",
               "name": "Robert Cain",
               "profile_path": null,
               "id": 148788,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Lady Mary Lasenby",
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168d3f",
               "name": "Gloria Swanson",
               "profile_path": "/4s8YEUboEF7DxdXXZ8HnaeovR2p.jpg",
               "id": 8629,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Tweeny - the scullery maid",
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168d43",
               "name": "Lila Lee",
               "profile_path": "/2J5uviIuh72bFjnTb8r0tGCt40r.jpg",
               "id": 98002,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "The king's favorite",
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168d47",
               "name": "Bebe Daniels",
               "profile_path": "/rkOFYpvLvdBZkhqFYh9SIp2FR15.jpg",
               "id": 30000,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Susan - Maid #2",
               "gender": 1,
               "credit_id": "54535fb6c3a3681473000ed1",
               "name": "Julia Faye",
               "profile_path": "/zOoz6IVKVabPOVVR7nB09QCHx64.jpg",
               "id": 130494,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4879c3a36847f8168d1f",
               "name": "Cecil B. DeMille",
               "profile_path": "/hQHlLlfyKbPGw2dS28JFvGjhXR5.jpg",
               "id": 8636,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4879c3a36847f8168d25",
               "name": "Jeanie Macpherson",
               "profile_path": null,
               "id": 148786,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4879c3a36847f8168d2b",
               "name": "J.M. Barrie",
               "profile_path": "/1j5F4WZ62hVkZhfXW9s32WDCPFG.jpg",
               "id": 14687,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.993208,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 53761,
      "vote_count": 4,
      "budget": 0,
      "overview": "Gloria Swanson plays a spoiled maiden who always gets her way until shipwrecked with her butler, then learns which qualities are really admirable in a person.",
      "similar": [],
      "original_title": "Male and Female",
      "runtime": 116,
      "poster_path": "/uVCT5kpdx1YiT432rKbvVZaOXIx.jpg",
      "spoken_languages": [],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1919-11-23",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Cecil B. DeMille"],
      "runtime": 116,
      "synopsis": null,
      "writers": [
         "Jeanie Macpherson",
         "J.M. Barrie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0010418/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYxMzU4Mjg1Nl5BMl5BanBnXkFtZTgwMDE5MjAwMzE@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Thomas Meighan, Theodore Roberts, Raymond Hatton | See full cast and crew »"],
      "reviews": [
         "Very solid Cecil B. DeMille production of JM Barrie's play, \"The Admirable Crichton\" with a few DeMille flourishes. Crichton (Thomas Meighan) is a very proper butler in a staid British home. Of course he has a distant crush on Lady Mary (Gloria Swanson), a very pampered and spoiled young lady. Tweeny the household maid (Lila Lee) has a crush on Crichton. The family, headed by a silly old man (Theodore Roberts) decides to take a sailing trip to the South Seas and gathers up a party of family and friends. Of course they run the yacht into a rock and are washed ashore on a deserted island. The rich are all nitwits and haven't a clue how to do anything for themselves. They assume Meighan and Lee will continue to wait on them. Wrong. Slowly it occurs to everyone that there is a new order on the island. The crafty and self-sufficient Meighan sets out to build a shelter, a fire, harvest food, etc. while the rich sit and watch. Their attempts to copy him are sadly disastrous. Eventually they \"join\" the former butler's group with Meighan as a sort of king. Among the items that have washed ashore after the wreck is a book of poems that talks about a Babylonian king. In a typical DeMille moment, Swanson daydreams about her life in a Babylonian court. The sequence that follows ranks among the most famous in silent film history as Meighan becomes the Babylonian king who sentences the reluctant maiden (Swanson) to the lions' den as his jealous courtesan (Bebe Daniels) gleefully watches. The scene is much shorter than I remembered as the fabulously gowned Swanson walks in among the lions. The famous scene of the bare-backed Swanson with the roaring lion atop her was very real (no double). And so the merry band of islanders, under King Crichton, goes on for a few years until, just before the marriage of Swanson and Meighan), they are \"rescued\" and returned to their former lives (and stations). Meighan and Swanson are terrific. Roberts is funny as the old man. The supporting cast includes Julia Faye (as a maid), Robert Cain (as Swanson's boring suitor), Edmund Burns (as the vicar), Raymond Hatton (as the silly ass Ernie), Mildred Reardon (as Lady Agatha), and Rhy Darby (as the pitiful Lady Duncraigie who marries her chauffeur). Logic aside, this is a stylish and solid film and features a ravishing 20-year-old Gloria Swanson in one of her first big hits for DeMille. Another famous scene is early in the film as Swanson prepares to taker her morning bath, a ritual that includes several maids, gallons of rose water, and another of DeMille's groundbreaking interior designs. A must see for fans of silent films.",
         "Thomas Meighan (as the admirable Crichton) is head butler for an aristocratic British family; he is obviously quite taken with luscious Gloria Swanson (as Lady Mary Lasenby), but unable to cross class barriers. The household's scullery maid Lila Lee (as Tweeny) is in love with Crichton. The threesome, and some others, go out yachting; when cross currents hit, the ensemble is shipwrecked! Turns out, the servant class has far more advanced survival skills. Who knew? Ms. Swanson is the film's main attraction; her bathing and showering scenes, near the beginning of the film, helped clean-up at the box office. Note that whenever there is nakedness afoot, DeMille has an object cover-up Swanson's figure, however. Though not as famed, Swanson's later wet spot, when she is nearly drowned in the bowel of the sideswiped yacht, is far superior. Swanson and Ms. Lee perform well, actually, with the material given. Loved the \"upper crust\" lady complaining about limp toast! Mr. Meighan delivers the movie's finest performance; the other players have moments, but Meighan is outstanding in the pivotal role of Butler Crichton. From the moment he checks the mansion for dust, he is delightful; the actor makes the movie even more interesting when the suppressed desire for Swanson begins registering on his face. A couple of smaller roles are noteworthy: Wesley Barry is great as the peeping Buttons, indicating what Cecil B. DeMille's \"Male and Female\" is really all about (more or less). You should also keep an eye on Bebe Daniels during the \"King of Babylon\" imaginary sequence; she is terrific as Meighan's right-hand lady. Silent film veterans Guy Oliver and Clarence Burton inexplicably disappear, after the shipwreck. Theodore Roberts and Raymond Hatton are around much longer, thankfully. The film is recommended, and DeMille obviously expert - but it's one of the more ludicrously-themed silent era classics preserved for modern scrutiny. Apparently, in adapting \"The Admirable Crichton\" for DeMilledom, the director substituted sex for satire. AND, he gets his titillating re-title \"Male and Female\" from no less than God Himself! quoting, \"So God created Man in His own image, in the image of God created He him: Male and Female created He them.\" There is also a oddly placed bow to the good ol' U.S.A. With all its oddities, it's still a fun film. ******** Male and Female (11/23/19) Cecil B. DeMille ~ Thomas Meighan, Gloria Swanson, Lila Lee",
         "In 1952 humorist S.J. Perelman contributed a piece to The New Yorker magazine devoted to Cecil B. DeMille's silent drama Male and Female. He was a teenager when the movie was first released in 1919, and found it so enthralling he sat through it twice. More than thirty years later Perelman, by then a middle-aged playwright and essayist, saw the film again at the Museum of Modern Art and recorded his impressions. It goes without saying for anyone familiar with the man's work that his piece is hilarious, but what's surprising is how little he exaggerated. I read his essay long before I saw the movie itself, and assumed that when he quoted title cards or described the action he was employing artistic license to get laughs, but no; he described the film with journalistic accuracy and yet his article is laugh-out-loud funny. Time has not been kind to Male and Female, that is, if DeMille honestly intended to say something profound about class and gender relations, but viewed in the proper spirit the movie is still quite entertaining. Certainly it offers sumptuous production values and top-notch cinematography (and happily, survives in beautiful condition), while most of the performances are surprisingly nuanced. It's the storytelling technique that lacks subtlety, for DeMille was a moralist who could never make his points delicately when there was a sledgehammer handy. The story is based on J. M. Barrie's 1902 stage play \"The Admirable Crichton,\" a satire on the English class system that has been staged repeatedly and adapted into all sorts of movies over the years, and no wonder: it presents a deeply satisfying fantasy of virtue recognized and bogus class distinctions overturned\u0097temporarily, anyway. Crichton, dignified butler in a household full of pampered, lazy snobs, proves to be the most useful person present when the whole gang is shipwrecked on a remote island in the South Seas. In the version made in the '30s, We're Not Dressing with Bing Crosby and Carole Lombard, this premise was turned into a musical comedy, while a 1957 English adaptation followed the satirical elements of the play more closely, but DeMille had his own distinctive approach to the material. As the title suggests, Male and Female plays up the romantic/erotic aspects of the role reversal, giving audiences of 1919 some of the steamiest situations then permissible. The naughty tone is set early on, when an impish serving boy who works in the stately household of Lord Loam peeks through bedroom keyholes, giving us our first look at each major character via \"keyhole shot.\" The most dramatic intro is reserved for the beautiful, haughty Lady Mary (Gloria Swanson), who rises from her luxurious bed and is promptly accompanied by serving girls into her marbled bathroom for a descent into a sunken tub\u0097and celluloid immortality! This bathing sequence was an instant sensation, and lives on in the textbooks as the most famous such scene in silent cinema. Today it's a little difficult to imagine what all the fuss was about, but I'll bet your eyes won't wander from the screen. Miss Swanson was at the peak of her youthful beauty at this time, with a special charisma all her own. Once the plot gets under way the opening sequences set up the thesis question: can lovers who cross class boundaries find happiness, or is \"kind-to-kind\" the only formula that works? The question is put to the test on a South Sea voyage when the Loam family's rented yacht hits the rocks, splinters apart, and strands them on an uncharted island, along with loyal Crichton and scullery maid Tweeny (the adorable Lila Lee), who is slavishly devoted to him, but well aware of the charged relationship between he and Lady Mary. Crichton soon establishes himself as the only person present who knows how to live on an island: he can build a fire, hunt, and cook a good meal, so his authority is grudgingly recognized. Two years pass, and here's where the inescapably silly elements of the story kick in. Crichton is now the unquestioned but benevolent ruler of an idyllic jungle paradise. Like the Swiss Family Robinson \u0097or Gilligan and his friends\u0097 our castaways live in elaborate \"primitive\" huts that look like rustic vacation cabins where everyone wears designer pelts. Clothes horse Gloria even has a Peter Pan-style hat with a feather! We note the altered relationship between the one-time butler and his former employers: Lady Mary, who commanded Crichton with such hauteur in the opening scenes, now literally fights with Tweeny over the privilege of serving him his dinner. And it's finally explained why Mary and Crichton repeatedly yet unwittingly quote a passage of Victorian poetry concerning antiquity. It seems that, in a past life, Crichton was a Babylonian King and Lady Mary was a Christian slave, a defiant captive the King was unable to subdue, thus compelling him to feed her to \"the sacred lions of Ishtar.\" (This is all enacted in a jaw-dropping flashback played absolutely straight.) The slave's dying curse is that the King will suffer for his deed throughout the ages, and so now, naturally, she is his superior and he waits on her\u0097although on the island, of course, their roles have reverted to what they once were, back in ancient Babylon. After that bizarre episode there is little left to do but arrange for the timely rescue of the castaways and then conclude with Barrie's ironic finale, in which the class system reasserts itself and all our characters revert to type. Crichton earns himself a happy ending, however, and so does the long-suffering Tweeny. This movie was a smash hit in its day, and it remains a kitschy treat for silent film buffs who enjoy exquisitely produced hokum. If you can find a copy of Perelman's essay it may help to have it handy as a sort of Viewer's Guide while you watch Male and Female: he captures its grandeur as well as its absurdity with admirable precision.",
         "The silent films of Cecil B DeMille, scripted by his long-time collaborator (and mistress) Jeanie MacPherson were often bizarre, overwrought and sometimes just plain silly. Once in a while however they hit the nail right on the head. Male and Female, heavily adapted from JM Barrie's play The Admirable Crichton, is a powerful drama with some strong performances, DeMille's direction at its most lyrical, and MacPherson's storyline only occasionally veering off the rails. The majority of DeMille films from this part of his career begin with a lengthy title card with some kind of moral or motto. However, Male and Female opens with images \u0096 the crashing sea, a sunset \u0096 before getting onto the intertitles. The typical DeMille silent would then follow this up by introducing us to each of the main characters with a title followed by a shot of them. Male and Female is no exception, but it works these introductions into the film's world and draws the audience in by making them point-of-view shots of a young servant peeping through the keyholes into his masters' and mistresses' bedrooms. The acting style that DeMille had encouraged and developed in his silent pictures since the mid-1910s was largely naturalistic, but with the occasional broad theatrical gesture to highlight a dramatic moment. It was a style that reduced the need for intertitles, without resorting to ridiculous pantomiming. The two leads, Gloria Swanson and Thomas Meighan are both perfectly suited to this style. Meighan was probably the finest male actor DeMille had worked with since Sessue Hayakawa (in 1915's The Cheat), and his performance here is mesmerising. Swanson is also great as usual, although I have to say that although it was her run of pictures with DeMille that made her name, she didn't do her best work with him. Her talent was put to far better use in later features such as Queen Kelly and Sadie Thompson. Aside from the performances, it's the dramatic story and its presentation that makes Male and Female so memorable. Only the basic plot of Barrie's play remains, and this is a typical DeMille/MacPherson story of the reversal of fortune and forbidden love \u0096 probably the strongest of this kind that they did before the slant in DeMille's films became increasingly moralist (and, of course, religious). Although DeMille loved these tales of class and inequality (he was at that point a socialist as well as a Christian), it is the impossible love between the two leads that is at the heart of this story. The real tragedy of Male and Female has nothing to do with the selfish pomposity of the aristocrats \u0096 it is the fact that the love between the rich woman and the poor man can only exist in this fantasy world of the remote island. This is set up from the beginning with the subplot of Swanson's friend who marries her chauffeur and becomes a social outcast. The final scenes in which the various love triangles are resolved are incredibly moving. The only significant wrong note in Male and Female is a brief and rather pointless flashback to ancient Babylon. These historical inserts had been en vogue since Griffith's Intolerance (a more influential film than some would have us believe), but this one is rather lacklustre and it's hard to see exactly how it fits the main story. It appears more of an excuse for DeMille to work in some epic grandeur (from 1918 to 1922 he only made contemporary dramas and comedies) and MacPherson to explore her interest in reincarnation. The story does need a dramatic highpoint at the stage where the flashback comes in, but they could have done better than the Babylon sequence. Overall however Male and Female is free of much of the preachiness, questionable morality and plot holes that mar many of Jeanie MacPherson's screenplays. Male and Female was Paramount's highest grossing film of 1919, which is no surprise. DeMille's steady flow of captivating images and his emphasis on acting performances are at their best here. In certain aspects it may appear dated, but as with many of DeMille's films we have to suspend our dependence on realism and plausibility. Of course, the island where the action takes place, with its convenient abundance of edible wildlife, sailing distance from England yet remote enough to be shipwrecked for two years, could never really exist \u0096 but it's an unreal place created to serve the story. Taken as the silent melodrama that it is, this is a stunning motion picture.",
         "A fairly ridiculous upstairs downstairs silent film romance/cast-away adventure. There are two parts to this film \u0096 the first two hours and the last 20 seconds. Those final 20 second color all which come before it in a most surprising manner. But first, the initial two hours. We begin in Victorian England. Virtuous, intelligent, hard working servants must wait on inept, frivolous and decadent aristocracy. Lady Mary Lasenby, Gloria Swanson's character is the most conceited of them all \u0096 haughtily lounging, extravagantly bathing in rose scented water and obnoxiously ridiculing Crichton, the intelligent and industrious butler, about her morning toast. After establishing this social dynamic, De Mille turns everything on its head by having the group's ship wreck on a deserted island while out on a pleasure cruise (a la Gilligan). Castaway on the island the 'law of nature' prevails over Victorian hierarchy and Crichton is soon established as the group's leader because of his bravery, industriousness and intelligence. Crichton is the leopard-skin wearing king, building a little village on the island equipped with numerous contraptions even The Professor would marvel at. Further, previously vain and bratty Lady Lasenby falls in love with Crichton. They are to marry, but mid \"I do\" a ship arrives to save them. Instantly, before the first English sailor has disembarked to rescue them, the Victorian hierarchy demands all of them return to their previous roles. After years as the leopard-skin king Crichton is instantly the butler again. Victorian social rules supercede Crichton's natural skills and he must return a servant; Victorian social rule supercede Lady Lasenby's love, and she knows they can never marry. To drive home the point of how disastrous their marriage would be despite their love, Lady Lasenby's friend, who stooped to marry her chauffeur, arrives to see Lady Lasenby penny less and shunned, the proof of society's condemnation of those who break the rules. And here is where the first movie ends \u0096 a tragic love story about the constraints of Victorian society - not unlike Age of Innocence or many other comedies of manners. But then you have the final scene in the last 20 seconds. Previously we learned Crichton is leaving for America and says marring Tweeny, the maid, to escape the unbearable condition he has returned to in England. Cut to the final scene. There is a startling change of scenery \u0096 a little wood house out on the American prairie. Crichton is just coming home from plowing the fields of their farm and Tweeny is out to meet him. They embrace and kiss, the film ends, and the poignancy of De Mille's final statement reworks everything in the previous two hours. De Mille's statement is about the promise of America, and its effect is more powerful than just about any political speech I can recall. Crichton is happy and will be happy because here in America we reward based on natural ability and hard work. We have seen what Crichton is capable of, and De Mille wants us to imagine his accomplishments in a land that will allow him to flourishes. It is American democratic propaganda second only to It's a Wonderful Life in effectiveness. An astounding political accomplishment considering America is not even a thought in this film until the final scene. The single stationary shot of Crichton walking from his field to his wife is a stirring, persuasive tribute to the American dream. Regardless of whether you buy the propaganda or not, it is worth a viewing to see how effectively De Mille presents it. This film is also noteworthy because it is the first time De Mille directed Swanson, a collaboration made famous by Sunset Blvd. Should you see it? If only to compare it with It's a Wonderful Life as an endorsement of the American dream.",
         "Delightful silent film about a shipwrecked British family and their servants, with a great cast; story based on James Matthew Barrie's classic play The Admirable Crichton. The class structure in Britain at the time is gently ridiculed throughout and therein lies the fun. Special mention goes to Thomas Meighan's incredible performance as the butler Crichton who falls in love with the aristocratic daughter of Lord Loam, Lady Mary. Thomas was so manly, tall, muscular and handsome, completely fascinating to watch in this role, and every other role I have ever seen him in. No wonder he was so popular as a leading man in silents. As far as I am concerned he stole the show. You couldn't take your eyes off him. Gloria Swanson brings a vulnerability to her role, which in the beginning is pretty unsympathetic. During their time on the island she grows the most emotionally, and one cannot help but feel sad for her at the end. Her character gets the fuzzy end of the lollipop (a philandering future hubbie), and the scullery maid Tweeny (pixie Lila Lee) gets the Grand Prize and moves to America to start a new life with Crichton. One strange thing about this version: there was a crew of men on board the boat, but after the shipwreck they are not seen or heard from again. What happened to them? Only Lord Loam and his children and two servants survive, as far as we can determine. Yet we see this crew rowing away from the site of the wreck, two years go by, and they are never accounted for. Odd. The musical score is pretty here but sounded a bit synthetic at times. I would have preferred a straight piano score, her piano moments were lovely. I really enjoyed this silent film. But then I have read almost everything James Barrie has written, so it's not surprising I would love Male and Female, based on his play. I just wish at least one of the silent versions of his \"The Little Minister\" would have survived, especially the one with Betty Compson.",
         "In the beginning we are introduced to a genuine old British aristocratic family: the spoiled, lazy Lady Mary, her quirky father and her younger sister. And, of course, Lady Mary is engaged to another aristocratic parasite, Lord Brockelhurst. And, on the 'other side of the fence', are the servants: butler Crichton, who is secretly in love with Lady Mary (although this is of course 'impossible': you can't break out of your 'caste'...), and maid Tweeny who in turn is in love with Crichton. A typical picture of old aristocratic England... ... Until one day, when the blue-blooded clan starts out on a South Sea cruise - and are stranded there on a lonely island; without luxury, without lodgings, even without food. And NOW it shows WHO is able to survive when being put to the test: Crichton with his energy and inventive spirit soon becomes the leader of the 'Swiss Family Robinson', while Lady Mary, completely helpless on her own, must admit that now HE's the strong man, HE's the 'King' (he even dreams of being the King of Babylon and she his Christian slave...) - and falls in love with him, while Tweeny jealously has to stand by and watch... BUT if they'll ever be rescued and return to England, will everything be as it was before?? This early work of Cecil B. De Mille already shows pretty clearly his vivid fantasy and love for ancient settings and costumes, as well as his belief in old-fashioned morales and institutions. The best part is, of course, when Crichton becomes the 'King', wild and strong, far away at last from his stiff butler image (Thomas Meighan, with his cocksure and almost a little menacing expression, somehow seems to look here like a kind of Rudolph Valentino 10 years older...), and Lady Mary alias Gloria Swanson, in the new surroundings of the wilderness, at last becomes a REAL woman. But - will it last??",
         "This is one of several silent movies that are still interesting to watch. \"Male and Female\" is an early effort by Cecil B. DeMille, and it stars Gloria Swanson, who was about 20 when it was made. Her co-star is Thomas Meighan, who was 20 years her senior and the bigger star in 1919 when \"Male and Female\" was made. But adorable Lila Lee steals the show as the scullery maid, Tweeny. Silent movies were very different from talkies. The beginning of the movie introduces the viewers to the cast of characters and tells who plays each role. The introduction is unnecessary and very leisurely, reminding us that audiences in 1919 were very unsophisticated. The title role is Crichton, the family butler to the family of Lord Loam. DeMille has Meighan introduce his character very elegantly, making Crichton admirable from our first view of him (the movie is based on a play called \"The Admirable Crichton\"). All characterization is done in mime, of course, so the camera lingers on Meighan's face as Crichton's emotions flicker across. Meighan was quite a good actor, effortless and devoid of the mugging we often associate with silent films (most of our experience is with clips from the Keystone Kops, it seems to me). Lila Lee is equally good here, playing a maid who is in love with Crichton, but who can see his secret crush on Lady Mary Lasenby (played by Swanson), a love which must never speak its name because it crashes against the boundary of class. The family sails to the South Pacific with Crichton and Tweeny in tow, and they apparently run aground on Santa Catalina which substitutes for a tropical paradise. It is here that roles reverse completely, as Crichton somehow knows all the skills not only to survive, but to live in royal comfort: after two years on the island, they have a forge (and appear to have made their pots and pans so well they can be used as mirrors), a potter's wheel, a lovely home, more food than they can eat, and Crichton is treated as the king, with Tweeny and Lady Mary having a cat fight to see who gets to serve his dinner to him. The lack of sophistication in early movies is either charming or damning depending on your point of view. They use bows which are barely able to launch the arrows out of the frame of the film; parts of the island are clearly a movie set with palm trees and brush, but outside views really do look like they were shot on Santa Catalina, a mountainous island without trees; there's no indication of how these people were able to get iron, but we have a large smelting operation with bellows and kiln made of apparently fireproof bricks. We let those objections pass. Since this is a C.B. DeMille movie, we have a fantasy scene from Babylon which is more interesting than the movie, foreshadowing DeMille's rise as the master of spectacle with a cast of thousands and sets to match. In the fantasy, Crichton plays a Babylonian king, Tweeny his would-be queen, and Lady Mary the Christian slave captured but refusing to kneel. Crichton tells her to accept his advances willingly or go to the lions; Lady Mary of course chooses death before debauchery. These scenes show DeMille already advanced in setting up tableaux and scenery which are beautifully composed and shot.* Our hero and his charges are rescued and returned to England where the roles are unreversed, and Crichton returns to being a servant, unable to marry Lady Mary, who has learned to love him. Instead, Crichton accepts Tweeny as his wife, they emigrate to America, and live happily ever after as farmers. At the end, we see Lady Mary accepting the offer of marriage from a suitor who acknowledges that her love will always be with the absent Crichton, and the last shot of her fades with Swanson showing an empty sadness. We then dissolve into Crichton and Tweeny on their farm, and the movie ends with their embrace, both obviously in love. I'm sorry to have missed what I think would have been some excellent character development in seeing how Tweeny made Crichton's love bloom, apparently making him forget Lady Mary. To Lee's credit, I think she could have pulled it off. And I miss Lady Mary's remorse in choosing not to marry Crichton for love, choosing instead to maintain her peerage and her money. This is an interesting movie in spite of its shortcomings. We see Gloria Swanson at the start of her career; many of us remember her better for her role in \"Sunset Boulevard\" (released in 1950**) where she played the aging actress with the constant refrain, \"I'm ready for my close up, Mr. DeMille.\" In 1919, Thomas Meighan was at his peak, a manly man with a soft streak for beautiful women. And Lila Lee had not yet suffered her several failures of luck, work, and health. We also see that DeMille was not at his best with naturalistic scripts and that his segue into epic movies was a good career move. *Silent movies can be truly beautiful, as the directors, lighting directors, and cinematographers worked together to create shots as compelling as still photograph. The silent camera can linger on an empty shot, then have a character enter and pose, beautifully lighted in luscious black and white while we admire the tableau. For some reason, none of this works in color. Black and white film made better photographers of its directors. DeMille showed his genius for sets and spectacle in the Babylon fantasy, while letting the main story fall to mere competence. **\"Sunset Boulevard,\" of course, is a remarkable movie in its own right. The cast included not only Gloria Swanson but Cecil B. DeMille himself, Eric von Stroheim, Buster Keaton, Hedda Hopper, and other well-known actors.",
         "For someone who has seen Bing Crosby and Carole Lombard in We're Not Dressing you will get a nice musical and comedy treat as Bing sings some nice songs and comedy is nicely handled by Burns&Allen and Leon Errol. But while the broad comedy aspects of The Admirable Crichton are handled well there, the broad range of James M. Barrie's story is done in the Cecil B. DeMille silent film Male And Female. Starring of course DeMille's latest discovery Gloria Swanson. Elliott Dexter a DeMille silent regular was unavailable so Thomas Meighan takes the title role as the butler on Theodore Roberts estate. He has two daughters and a silly sot of a nephew in Raymond Hatton. The daughters are Gloria Swanson and Lila Lee. We have class distinctions in America, but they're not as rigid as they are in the United Kingdom. It's those aspects that are dealt with in Male And Female not the Americanized We're Not Dressing. Meighan has it bad for Swanson, but the rigid class structure makes that union impossible. But when they're shipwrecked on a tropical island while on a cruise the social order is reversed. Theodore Roberts by dint of his title tries to assert his authority. But Meighan as the man with the most knowledge on how to survive upsets that in a hurry. Unlike the Crosby/Lombard film, these folks are here for a few years and thinking even with the social order reversed, it's not like Robinson Crusoe with no one to converse with for years. Barrie both satirizes and deals with the subject class seriously. As for DeMille he gets to do one of his spectacle type sequences in a flashback when the cast imagines they're in ancient Babylon with Meighan as king. In that flashback is a young Bebe Daniels who was getting started and she would shortly being starring in DeMille silent films. DeMille in his autobiography pays compliments to a new member of his team Mitchell Leisen who did the costumes. He would be a DeMille regular until he went out on his own as a director. I liked the film and I'll let you others decide whether there is more Barrie or more DeMille in this film.",
         "\"Male and Female\" (1919) is now available from Alpha in a 57 minutes version. Well, actually it's not what you would call a version. My guess is that some collector or library had a pristine 16mm copy, but somehow managed to mislay reel two. So, in the Alpha version we get a sudden cut of the yacht sailing away from merry England to a scene in ancient Babylon. So although we encounter the lions all right, we miss all the stuff about the shipwreck, the arrival on the island and the sorting out of who's-in-charge. But we do see the rescue and all the back-in-England scenes. Enough of the film survives at Alpha to sustain our interest and appreciate all the fine acting from Thomas Meighan (a subtle, well-shaded performance), Gloria Swanson (in her vampish element here), Lila Lee (as the entrancing Tweeny) and most particularly Rhy Darby \u0096 in her only movie appearance \u0096 as the lovely, titled lady who wants to marry her chauffeur (played with just the right blend of lower-class charisma by Henry Woodward)."
      ],
      "genres": [
         "Adventure",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Lord Brockelhurst, his unwilling betrothed Lady Mary, his butler Crichton and scullery maid Tweeny are on Lord Loam's yacht which is wrecked leaving them all to cope on a desert island. Class distinctions fall apart for the time being.",
         "Lady Mary Lasenby is a spoiled maiden who always gets her way until shipwrecked with her butler, then learns which qualities are really admirable in a person."
      ],
      "budget": 0
   },
   "movielensId": 2821,
   "movielens": {
      "languages": [""],
      "releaseDate": "1919-11-23",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Cecil B. DeMille"],
      "runtime": 116,
      "movieId": 2821,
      "title": "Male and Female",
      "mpaa": "",
      "actors": [
         "Thomas Meighan",
         "Theodore Roberts",
         "Raymond Hatton",
         "Robert Cain",
         "Gloria Swanson",
         "Lila Lee",
         "Bebe Daniels",
         "Julia Faye"
      ],
      "imdbMovieId": "0010418",
      "originalTitle": "Male and Female",
      "genres": [
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Gloria Swanson plays a spoiled maiden who always gets her way until shipwrecked with her butler, then learns which qualities are really admirable in a person.",
      "tmdbMovieId": 53761,
      "avgRating": 2.9697,
      "releaseYear": "1919",
      "numRatings": 33,
      "posterPath": "/uVCT5kpdx1YiT432rKbvVZaOXIx.jpg"
   }
}