{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0181733",
      "video": false,
      "title": "On the Ropes",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5469da46eaeb816b58002e9b",
               "name": "Nanette Burstein",
               "profile_path": "/2FSwFLtjklTI2CWiNIozXCPj3l.jpg",
               "id": 96439,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5469da56eaeb816b58002e9f",
               "name": "Brett Morgen",
               "profile_path": "/6rmyfx5DTf0FPYBSICDkxc6DOcW.jpg",
               "id": 102109,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [],
      "popularity": 0.07189,
      "production_countries": [],
      "id": 113273,
      "vote_count": 2,
      "budget": 0,
      "overview": "The story of three young boxers and their coach who is determined to guide them in a positive direction in and out of the ring.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         394117,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "On the Ropes",
      "runtime": 94,
      "poster_path": "/6LNzYl7oH9ui7baYbo0UG9if8rJ.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-01-01",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "The real fight is outside the ring.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": [
         "Nanette Burstein",
         "Brett Morgen"
      ],
      "runtime": 94,
      "synopsis": null,
      "writers": [],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0181733/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMTE4MTk0Nl5BMl5BanBnXkFtZTcwOTc5MTYyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sam Doumit, Martin Goldman, Harry Keitt | See full cast and crew »"],
      "reviews": [
         "On the Ropes(1999) is one of the most powerful documentaries to come out of the USA in many years. It deals with the fortunes and injustices of the boxing world. The most tragic segment of this film is the story of the woman boxer who went to prison for a crime she didn't comment just because of the lousy justice system and the fact that she didn't have much money. What seen on the screen is probably the most realistic depictions of boxing life that has ever been shown at the cinema. Has to be one of the greatest documentaries of all time. Anyone who interested in boxing or wants to be a boxer should watch this film to learn of the realities of this brutal sport.",
         "The award winning, Oscar nominated, and critically acclaimed documentary \"On The Ropes\" takes the audience into a New York ghetto gym where young boxers trapped in the slums and projects struggle and sweat tirelessly for a shred of hope that they may some day leave the hopelessness of their life behind. The film offers a limited look at the underbelly of boxing, something which few boxing fans ever see, as it examines the painful existence and enormous courage of three young boxing hopefuls. Unlike other sports where professionals scout college campuses cutting deals for big money, this little indie documentary shows the real and often raw deal and may help answer the one question so often asked about the sport of boxing: Why in the hell would anyone want to step into a ring and risk getting beat up? (B+) Note - yes, I watched it again.",
         "I got this documentary from my local library--the smaller selection allows movies that you normally wouldn't notice to stand out. Very powerful, very emotionally involving story of three aspiring boxers from Brooklyn and the trainer who loves them. I think Tyrene could really be a great boxer, and,***possible spoiler*** as a lawyer, I found her plight embarrassing. It inspired me to make a difference where I can, actually.***end of spoiler*** I also would like to keep my eye on George, who looks like a special fighter. Harry seemed to be a wonderful man, and his story was really my favorite. Nominated for an Academy Award, On the Ropes is better than almost anything else you could see. Truly.",
         "On the Ropes does for boxing what Hoop Dreams did for basketball except in half the time. The film is primarily about how boxing and being part of the extended family of the gym helped three young adults turn their lives around and how, by guiding his proteges, their trainer and mentor also has found a niche and redemption for himself. You do not have to like or even be interested in boxing to enjoy this film. I would love to be able to see the sequel and follow everyone a few years from now.",
         "On The Ropes(1999) is a documentary of great power and great tragedy. I consider it about life and boxing the same way that Hoop Dreams was about life in basketball. It follows the lives of three people and the paths they walk in life. It is the best documentary of the final year of the 20th Century. On The Ropes is an excellent non fiction film about boxing and is one that should be viewed more than once.",
         "I thought the most compelling story was Tyrene's. I wish that more of the movie had focused on her. Went to the movie in a totally down mood, really feeling sorry for myself. Man, you don't know how rough and unfair life can be until you've heard Tyrene's story. Lord, help me not to complain about my petty problems when there's so much real struggle and hardship in the world.",
         "A beautiful documentary about three young boxers training for the Golden Gloves and their trainer Harry Keitt. It is a story about life, loyalty, friendship etc... I have never seen anything so good. And the best is that it is the real and cruel world! A must see!",
         "This is a great documentary which focuses on the trials and tribulations of three young boxers and their coach, who train at the same community boxing gym in the rough Bedford Stuyvesant neighborhood of Brooklyn. Harry Keitt is the driving force behind the gym, an ex-con, reformed drug addict who founded the gym as a means of outreach to area youths who might otherwise be caught up in crime or drugs themselves. Tyrene Manson is one of the boxers who the film follows, trying to train while at the same time dealing with raising two girls who were left orphaned when Tyrene's aunt, a drug addict, died of AIDS. Also in the house is her aunt's widower, also HIV positive and still using and dealing drugs. The second boxer the film follows is Noel Santiago, also hailing from a broken home, and in the process of forsaking his schooling because of the delusion that he will be able to succeed as a professional boxer. The third boxer profiled is George Walton, who came up through Coach Harry's gym and went on to win the city-wide Golden Gloves championship. George is, after this, courted away from Harry's gym by a sleazy and seemingly unscrupulous boxing manager who promises him the stars in his professional career and leaves him with not much to show for it. The stories being told in this film all have classical story arcs to them, and indeed play out as great drama. But the real genius on display here is that the whole picture is, and the people who we are rooting for to succeed through their hardships are shown warts and all. When coach Harry accompanies George to a training camp in Vegas after he is taken over by a new management team, the coach freely admits to an interviewer that he would leave graciously if offered a generous cash settlement. This statement is rendered doubly ironic and heartbreaking because the coach doesn't realize that the new management isn't making any money for George at all, and are reduced to accepting professional fights where the only payment to the fighters is made in free tickets to sell for profit. Meanwhile, Tyrene is facing troubles of her own. Her drug-addicted uncle is busted for selling cocaine to an undercover cop, so the cops raid Tyrene's house (where the uncle lives) and she is arrested and charged with possession with intent to sell after a small amount of cocaine is found in the raid. Although Tyrene swears (and it would appear obvious) that the drugs belonged to her uncle, she is nonetheless charged, and since she is on public assistance, is provided with an overworked and underpaid public defender, who paints a blunt picture for Tyrene: it's your word against the cop's, and juries tend to believe the cops. Despite her attorney's advice, Tyrene chooses to go to trial and fight the charges against her; the trial, when it begins, happens to coincide with Tyrene's Golden Gloves appearances. She fights the fights of her life, and makes it to the finals even though she is under incredible psychological duress from the trial. Unfortunately, court dates for the trial force Tyrene to forfeit the final bout because she is unable to make weigh-in on time. Tyrene's story is perhaps the most alarming in the movie, showing the systemic challenge's facing poor black people in this country. Although she swears her innocence, and the film makes a convincing argument on her behalf, it is as if her guilt is presupposed in the legal system: \"oh, a black woman on welfare found with crack? it must have been hers.\" This is what makes it all the more depressing when she is finally sentenced to 4 1/2 to 9 years, at the height of her boxing potential. The third boxer is Noel Santiago. His is the most melancholy story. Cocky to the core, Santiago forsakes schoolwork and study in the name of his boxing career, which he is sure is about to take him on a meteoric rise to the top of the pugilistic world. This he does despite the warnings of his coaches and his mother, a reformed drug addict. When his time finally comes to fight in his first amateur bout, he is soundly knocked out shortly into the first round. He quickly quits boxing, but coach Harry convinces him to come back, enticing him with the chance to go to Vegas and train for free. Noel jumps back into his training with renewed vigor, and experiences the thrill of his first victory when he returns to fighting. These dreams soon sour again, when he is defeated in a decision in the second round. His also turns out the happiest of the three stories, as he enrolls back into school upon realizing his limits. The three stories, interwoven, give a real idea of the difficulties that the poor of the nation live through every day, conditions unimaginable to those in comfortable middle class existences. Every day is a struggle for the subjects of this movie, which they face with courage and humanity, which is the essence of what is captured in this film. From Tyrene's climactic speech at her sentencing hearing, to the emotional reunion of George with Coach Harry after he flees from his new management team, this film buzzes with the life force of a class of people who show a shining resilience in spite of all that is dealt them from life's sometimes cruel deck. NOTE: to all you hip-hop musicologists out there, the soundtrack features some obscure cuts from MF Doom and his crew.",
         "\"On The Ropes\" provides a rare but shallow look into the brutal sport of boxing by focusing on the lives three young boxers and their trainer. At the center of the film is Harry Keitt, a man with a checkered past whose quest to help boost kids-gone-wrong from the projects into a productive life via the ring is his personal salvation. What this earnest film does best is demonstrate how boxing can provide structure, discipline, purpose, and the hope of success and greatness for ghetto kids who have what it takes. The film also clearly shows what it takes it a lot."
      ],
      "genres": [
         "Documentary",
         "Drama",
         "Sport"
      ],
      "productionCompanies": [
         "Highway Films",
         "Learning Channel (TLC), The",
         "Magnolia Mae Films"
      ],
      "summaries": ["The story of three young boxers and their coach who is determined to guide them in a positive direction in and out of the ring."],
      "budget": 0
   },
   "movielensId": 2824,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-01-01",
      "dvdReleaseDate": "2000-04-25",
      "directors": [
         "Nanette Burstein",
         "Brett Morgen"
      ],
      "runtime": 94,
      "movieId": 2824,
      "title": "On the Ropes",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0181733",
      "originalTitle": "On the Ropes",
      "genres": [""],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of three young boxers and their coach who is determined to guide them in a positive direction in and out of the ring.",
      "tmdbMovieId": 113273,
      "avgRating": 3.54392,
      "releaseYear": "1999",
      "numRatings": 148,
      "posterPath": "/6LNzYl7oH9ui7baYbo0UG9if8rJ.jpg"
   }
}