{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "screenwriter",
            "id": 888
         },
         {
            "name": "muse",
            "id": 9304
         }
      ],
      "imdb_id": "tt0164108",
      "video": false,
      "title": "The Muse",
      "recommendations": [
         48345,
         88818,
         23570,
         36873,
         25758,
         34014,
         28761,
         6393,
         33657,
         47881,
         63988,
         250622,
         12519,
         210599,
         78146,
         67058,
         92331,
         106038,
         49462,
         35196
      ],
      "backdrop_path": "/bsHBjV8TIMpj4zLNSvjaBp2yYHY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Steven Phillips",
               "gender": 2,
               "credit_id": "52fe46679251416c9105354d",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah Little",
               "gender": 1,
               "credit_id": "52fe46679251416c91053551",
               "name": "Sharon Stone",
               "profile_path": "/n28skoawvqAymYr6gRSm2pfro0i.jpg",
               "id": 4430,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Laura Phillips",
               "gender": 1,
               "credit_id": "52fe46679251416c91053555",
               "name": "Andie MacDowell",
               "profile_path": "/znSR45ZcNNlb1sNP1gYmVACYI2a.jpg",
               "id": 1533,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Jack Warrick",
               "gender": 2,
               "credit_id": "52fe46679251416c91053559",
               "name": "Jeff Bridges",
               "profile_path": "/xms1RAY6q7Lzp7wNeRCB0kzhucn.jpg",
               "id": 1229,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Cybill Shepherd",
               "gender": 1,
               "credit_id": "52fe46679251416c9105355d",
               "name": "Cybill Shepherd",
               "profile_path": "/nBm4ciBF2s3ynzxHMkcFpmiODgc.jpg",
               "id": 1036,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Jennifer Tilly",
               "gender": 1,
               "credit_id": "52fe46679251416c91053561",
               "name": "Jennifer Tilly",
               "profile_path": "/bNB0BTnPAdAAHuCQSprMk4smBMD.jpg",
               "id": 7906,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Julie Phillips",
               "gender": 1,
               "credit_id": "52fe46679251416c91053577",
               "name": "Monica Mikala",
               "profile_path": null,
               "id": 156755,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mary Phillips",
               "gender": 0,
               "credit_id": "52fe46679251416c9105357b",
               "name": "Jamie Alexis",
               "profile_path": null,
               "id": 183407,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe46679251416c9105357f",
               "name": "Catherine MacNeal",
               "profile_path": null,
               "id": 157673,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Josh Martin",
               "gender": 2,
               "credit_id": "52fe46679251416c91053583",
               "name": "Mark Feuerstein",
               "profile_path": "/zYtVRDBZErmwVIffCuk5ig8CSTN.jpg",
               "id": 11365,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Hal",
               "gender": 2,
               "credit_id": "52fe46679251416c91053587",
               "name": "Bradley Whitford",
               "profile_path": "/66brylvzWLg94TRMd6QFrVyMOei.jpg",
               "id": 11367,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Phyllis",
               "gender": 1,
               "credit_id": "52fe46679251416c9105358b",
               "name": "Stacey Travis",
               "profile_path": "/peARleY7mDjxph4fFfeWnV4LMFe.jpg",
               "id": 31714,
               "order": 11
            },
            {
               "cast_id": 16,
               "character": "Lorenzo Lamas",
               "gender": 2,
               "credit_id": "58fd081c925141640b024f30",
               "name": "Lorenzo Lamas",
               "profile_path": "/xgRJ7sGcbCXyHwqc4gcUW9iDTi5.jpg",
               "id": 11366,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46679251416c91053567",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46679251416c9105356d",
               "name": "Albert Brooks",
               "profile_path": "/kahlMTdygrPJ28VYRhKPavYD9hs.jpg",
               "id": 13,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe46679251416c91053573",
               "name": "Monica Mcgowan Johnson",
               "profile_path": null,
               "id": 11368,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5910c910c3a36864d403831b",
               "name": "Thomas E. Ackerman",
               "profile_path": "/xFDbxk53icM1ofL4iCIwB4GkUxN.jpg",
               "id": 11371,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 3.214483,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 37718,
      "vote_count": 42,
      "budget": 0,
      "overview": "What happens when a screenwriter (Brooks) loses his edge, he turns to anyone he can for help... even if it's the mythical \"Zeus's Daughter\" (Stone). And he's willing to pay, albeit reluctantly, whatever price it takes to satisfy this goddess, especially when her advice gets him going again on a sure-fire script. However, this is not the limit of her help, she also gets the writer's wife (MacDowell) going on her own bakery enterprise, much to the chagrin of Brooks, who has already had to make many personal sacrifices for his own help.",
      "similar": [
         59436,
         277547,
         2757,
         1826,
         310593,
         824,
         599,
         86838,
         2309,
         294016,
         2639,
         4723,
         451,
         290,
         27294,
         50356,
         11515,
         1812,
         266,
         17057
      ],
      "original_title": "The Muse",
      "runtime": 97,
      "poster_path": "/rYOluleGWoXJUgaV3yelNreimbO.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "October Films",
         "id": 236,
         "origin_country": ""
      }],
      "release_date": "1999-08-27",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "In Goddess we trust.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Albert Brooks"],
      "runtime": 97,
      "synopsis": null,
      "writers": [
         "Albert Brooks",
         "Monica Mcgowan Johnson"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0164108/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUzNTczNjQ5OV5BMl5BanBnXkFtZTcwNzkxOTMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Albert Brooks, Sharon Stone, Andie MacDowell | See full cast and crew »"],
      "reviews": [
         "Albert Brooks's The Muse may be under-rated, but I found it OK. Brooks has always made movies that are good for a feel-food time, and this is a good example. Brooks plays a troubled writer who needs help to get his edge, so he gets a Muse (Sharon Stone is not her best, but good at being annoying) who inspires to do things. Cute comedy has many cameos some movie buffs might find hilarious. I find it entertaining. Cameos include James F. Cameron, Jennifer Tilly, Rob Reiner, Steven Wright (not as himself but he gives the funniest part as Stan Spielberg) and in the best cameo of the year, Martin Scorsese as himself, who interests Brooks in a remake of Raging Bull \"Thin and Angry.\" Worth a gander, but not as many laughs as Bowfinger. A",
         "Albert Brooks at his best. Very very funny. The short appearances of James Cameron and Martin Scorcese are hilarious, but the best laugh I had in years was the short conversation of Albert Brooks (Steven) with Mario Opinato (European man) at the party. Although it already passed 30 minutes from that scene I was still laughing, and still do whenever I think of it. Despite Brooks latter works, The Muse is somewhat inferior, but still hilarious... and what´s the point in a comedy? To make people laugh, and I sure did laugh with this one.",
         "Albert Brooks is funny. He has an interesting and unique way of telling story with humor, wit and sincerity. He is not afraid of appearing to be 'un-hip'. Actually that is the charm of most of his work. He has been compared to Woody Allen but I think that his work is much more universal. Woody's giant persona gets in the way of his stories whereas Brooks actually becomes a character. He does not play himself and does not comment of things. He 'plays' characters like a real actor. The Muse is just as brilliant as Defending Your Life and Across America. Andie MacDowell is good when a good script guides her. Sharon Stone was made for the role of the Muse. Her energy is sexy, ditzy as well as forceful. There are some cameos in this movie that are priceless and lend an air of authenticity to the side of Hollywood that most people have no access to. I have seen this movie a hundred times and it never fails to make me laugh.",
         "Albert Brooks has long been one of the most underappreciated filmmakers working in the movie industry today. Less acerbic, but often just as funny as Woody Allen, Brooks looks at the world through a slightly askew, charmingly off beat prism, invariably placing himself in the center of his films as the average Joe persona put-upon by the daily frustrations and absurdities we all face as we struggle to make it though our often harried modern lives. His latest charmer, \"The Muse,\" provides even more of a fantasy insider's view of Hollywood than Steve Martin's recent \"Bowfinger.\" Brooks portrays a fairly successful screenwriter who is suddenly experiencing steady rejection of his most recent script as studio after studio turns thumbs down on the project. Driven by desperation, he enlists the aid of a tempermental Muse, played winningly by Sharon Stone, an actual descendant of Zeus who moves her way around the Hollywood bigwigs, inspiring hit movies as she goes - or so her many devotees think. Part of the fun of the film comes in the latter portion of the film when doubt is cast on the validity of her credentials, which speaks humorous volumes about the state of mental health in that crazy land known as Hollywood. In fact, the film is at its freshest in scenes in which Brooks gently skewers the crass insensitivity, lack of creativity and general madness of the movie industry itself - and he has enlisted quite a number of major Hollywood big shots to appear in amusing cameo roles that mock their own self-importance and that of the business they are involved in. Despite the occasional thudding one-liner, Brooks' script floats along much like a muse itself, fluffy, amiable and charming. The lovely Andie MacDowell, as Brooks' understanding and supportive wife, adds immensely to this air of breezy likability. \"The Muse,\" unlike so many modern comedies, manages to captivate and entertain without working itself up into a frenetic frenzy and without breaking into a sweat. This is a film, rather, to relax into and simply let the author take you where he wants you to go. The journey, luckily, is a fun one.",
         "I know that most people are very demanding of the movies they watch. That being said, I guess I'm not one of them. I have owned \"The Muse\" for about three years, and I usually watch it about once a year, after being reminded of its existence on cable/HBO. I always enjoy it every time I watch it. I think Sharon Stone portrays her character with class and humor; not to mention that she is one of the most stunning women ever to be in motion pictures. While I do think that by the end of this movie, you'll probably have had enough of Albert Brooks' whiney, monotonous voice, some of his lines and \"sound effects\" are rather funny. Andie MacDowell is a beautiful woman, and while her characters are never really memorable, I feel she is a good actress, and entertaining to watch in movies. This movie is a light-hearted, film of mindless entertainment. Certainly, it is not one for the \"Hall of Fame\", but if you're looking for an amusing story, with attractive scenery (who doesn't like looking at Hollywood mansions), and a plot you don't have to race to keep up with, \"The Muse might be for you.",
         "Albert Brooks makes a Decent Attempt with his 1999-comedy 'The Muse'. Its a light-hearted film, that doesn't tax your brains. 'The Muse' is a comedy about a neurotic screenwriter & his modern-day muse. 'The Muse' is entertaining, but only in portions. While the first-hour is funny & well-paced, the second-hour takes a dip. The Writing isn't tight, nor is the pace. Brooks's Screenplay succeeds in the first-hour, but later-on, everything slows down. Brooks's Direction, on the other-hand, is very well-done. Performance-Wise: Brooks can never be doubted as an actor. He's exceptional, as always. Sharon Stone enacts the nagging/materialistic chick delightfully well. Andie MacDowell is natural to the core. Jeff Bridges is winsome in a cameo. Martin Scorsese & James Cameron are fun in one-scene appearances. On the whole, If you want to get Amused...Watch 'The Muse'.",
         "Catherine Tramelle. Carly Norris. Sally Eastman. May Munro. Ellen the gunwoman. Nicole Horner. Cindy Ligget. Elizabeth Halperin. Gwen Dillon. Princess Bala. Ginger McKenna. From Merciless killer to shrewd mistress. Sharon Stone wasn't much of a comedian. In this \"The Muse\", I see a completely different Stone and her talent in comedies. Ever since \"Sphere\", Stone has been giving different but good performances. She actually can be very versatile and has the ability to try different roles. As for the rest of the actors, Jeff Bridges is better than Albert Brooks and Andie McDowell. I would say that Sharon Stone's best performance ever is Ginger McKenna Rothstein in \"Casino\". However, even though I do not consider this one the best film of hers, I do enjoy this very first comedy that she did her best in. The Muse = the intriguing!",
         "There were some parts of Albert Brooks' new film \" The Muse\" that really amused me. However, there were others that did not amuse. This somewhat creative and witty tale is about a veteran screenplay writer who turns to a Muse for inspiration. Brooks plays the screenplay writer and Sharon Stone is the Muse. My first basic instinct was dubious when I found out that Stone would play this character. However, I do have to admit after watching the film that Stone's performance was very inspirational. Brooks' screenplay is enriched with cleverness and insights into the very competitive writers' hollywood. The one story that the narrative could have done without out was the Muse's role to inspire Brook's wife, dolefully played by Andie Mcdowell, to start up a cookie business. It was just one big cookie monster disaster that is not characteristic of Brooks' ingenious writing. Another drawback was its sudden unrevealing climax that could have been written up a little bit more creatively. Now! Albert don't get neurotic now! Besides these little quirky points, I do give the marginal thumbs up for everyone to cruise and go check out \"The Muse.\" *** Average",
         "Brooks, once a prominent writer who's now neurotic and struggling after everyone starts telling him he's losing his edge, resorts to desperate means and acquires the services of a benevolent but bizarre and demanding muse (Stone) to try and recapture the essence of his onetime brilliance. However, his life is soon turned upside down by all of her awkward, off-the-wall methods of improvement. There's plenty of crisp dialogue, laugh-out loud moments, and amusing cameos to hold your attention, but the film is marred by too many comic gaps in the script. Still, it's a good way to pass the time, and their are some sharp observations of the Hollywood movie process. **½",
         "Brooks is the West-Coast doppelganger of Woody Allen, despite the fact that he's about twenty years younger & takes on characters decidedly white-bread Middle American Gentile. All of Brooks' movies are about him entering a critical transition period of life (or death). Like Allen's films, his variations on this familiar theme range in quality. 'The Muse' is a solid effort. Most Brooks films have funny zingers; this one has a whole filmful plus a clever story to boot, and a big-budget cast. The more you know about Hollywood and the motion picture industry (I recommend 'The Big Picture' by Epstein), the more true-to-life you understand the film to be, and thus the funnier the jokes become. I'm not sure why it did poorly, and reading others' comments yields little insight. All I can say is that Brooks is never a fully sympathetic character--he is always at least partly to blame for his predicament--never quite the \"aw-shucks\" underdog. At least this time he and Johnson introduce other characters who are even more sympathetic to generate audience goodwill. Not to mention that the two leading ladies are both stunningly good-looking. Plus the whole Hollywood self-referencing is a lot of fun. Bottom line is, I believe that this is among the best of Albert Brooks' films. It has many winning qualities which permit it to transcend the Brooks formula. It shares a certain affinity with another wry comedy, \"Being There\"; both are stories about people being drawn in by the mysterious among us."
      ],
      "genres": ["Comedy"],
      "productionCompanies": ["October Films"],
      "summaries": [
         "What happens when a screenwriter (Brooks) loses his edge, he turns to anyone he can for help... even if it's the mythical \"Zeus's Daughter\" (Stone). And he's willing to pay, albeit reluctantly, whatever price it takes to satisfy this goddess, especially when her advice gets him going again on a sure-fire script. However, this is not the limit of her help, she also gets the writer's wife (MacDowell) going on her own bakery enterprise, much to the chagrin of Brooks, who has already had to make many personal sacrifices for his own help.",
         "With his career on the skids, a Hollywood screenwriter enlists the aid of a modern day muse, which proves to test his patience."
      ],
      "budget": 15000000
   },
   "movielensId": 2829,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-08-27",
      "dvdReleaseDate": "2000-02-15",
      "directors": ["Albert Brooks"],
      "runtime": 97,
      "movieId": 2829,
      "title": "The Muse",
      "mpaa": "PG-13",
      "actors": [
         "Albert Brooks",
         "Sharon Stone",
         "Andie MacDowell",
         "Jeff Bridges",
         "Cybill Shepherd",
         "Jennifer Tilly",
         "Monica Mikala",
         "Jamie Alexis",
         "Catherine MacNeal",
         "Mark Feuerstein",
         "Bradley Whitford",
         "Stacey Travis",
         "Lorenzo Lamas"
      ],
      "imdbMovieId": "0164108",
      "originalTitle": "The Muse",
      "genres": [
         "Fantasy",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Uk4_YsGglEg"],
      "plotSummary": "What happens when a screenwriter (Brooks) loses his edge, he turns to anyone he can for help... even if it's the mythical \"Zeus's Daughter\" (Stone). And he's willing to pay, albeit reluctantly, whatever price it takes to satisfy this goddess, especially when her advice gets him going again on a sure-fire script. However, this is not the limit of her help, she also gets the writer's wife (MacDowell) going on her own bakery enterprise, much to the chagrin of Brooks, who has already had to make many personal sacrifices for his own help.",
      "tmdbMovieId": 37718,
      "avgRating": 2.78931,
      "releaseYear": "1999",
      "numRatings": 1768,
      "posterPath": "/rYOluleGWoXJUgaV3yelNreimbO.jpg"
   }
}