{
   "tmdb": {
      "original_language": "sr",
      "keywords": [
         {
            "name": "bus",
            "id": 992
         },
         {
            "name": "barge",
            "id": 165364
         }
      ],
      "imdb_id": "tt0169145",
      "video": false,
      "title": "Cabaret Balkan",
      "recommendations": [112095],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1002,
               "character": "The Man on the Bus Who Thinks He's Tough",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e2f",
               "name": "Ivan Bekjarev",
               "profile_path": "/iVWtShUdFvV42e8oBRgy1CdZYXU.jpg",
               "id": 1009300,
               "order": 0
            },
            {
               "cast_id": 1004,
               "character": "Topi, the Ex-Student Revolutionary Trafficker",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124e33",
               "name": "Vojislav Brajović",
               "profile_path": "/9IS8AEw9tGeVhiu2UdzmdANPS2q.jpg",
               "id": 1043211,
               "order": 1
            },
            {
               "cast_id": 1005,
               "character": "The Bosnian Serb Mother",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e37",
               "name": "Mira Banjac",
               "profile_path": "/c3FRLLrPOKMpJ8NPGho6XT9tYSs.jpg",
               "id": 38004,
               "order": 2
            },
            {
               "cast_id": 1006,
               "character": "Dimitri, the Crippled Ex-Cop from the Local Cafe",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e3b",
               "name": "Aleksandar Berček",
               "profile_path": "/oCJGA05tHMrxRA7uP1R96IZu8gc.jpg",
               "id": 54187,
               "order": 3
            },
            {
               "cast_id": 1007,
               "character": "John, the VW Driver",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e3f",
               "name": "Bogdan Diklić",
               "profile_path": "/eeBGTf9wabGxMoIXderNQS9LAiV.jpg",
               "id": 4641,
               "order": 4
            },
            {
               "cast_id": 1008,
               "character": "The Lady on the Bus with the Hat and Fox Stole",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e43",
               "name": "Milena Dravić",
               "profile_path": "/uVCXhbyelkkoCCVmaaEKYVKOGeD.jpg",
               "id": 110976,
               "order": 5
            },
            {
               "cast_id": 1009,
               "character": "The Chain-Smoking Taxi Driver",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124e47",
               "name": "Nebojša Glogovac",
               "profile_path": "/dNJ7hcjRPaqvZ12COudPZRzydW9.jpg",
               "id": 36651,
               "order": 6
            },
            {
               "cast_id": 1010,
               "character": "",
               "gender": 1,
               "credit_id": "52fe4720c3a36847f8124e4b",
               "name": "Mirjana Karanović",
               "profile_path": "/rFnxxJrRCNYNj6UsJu7xWo8O9IR.jpg",
               "id": 4635,
               "order": 7
            },
            {
               "cast_id": 1011,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124e4f",
               "name": "Miki Manojlović",
               "profile_path": "/mIQ7f8wQ18AAGkrR7qMIsurosDM.jpg",
               "id": 48791,
               "order": 8
            },
            {
               "cast_id": 1012,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124e53",
               "name": "Dragan Nikolić",
               "profile_path": "/ydDrKZvNldL5ZZqvTQsXkVFlbdM.jpg",
               "id": 38123,
               "order": 9
            },
            {
               "cast_id": 1013,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e57",
               "name": "Ana Sofrenović",
               "profile_path": "/wNH3XmjO5Y2b6mFvBvE0IZC5oWP.jpg",
               "id": 32358,
               "order": 10
            },
            {
               "cast_id": 1014,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124e5b",
               "name": "Danilo 'Bata' Stojković",
               "profile_path": "/r7BbcGe77W0eURlXtFh0qyxe9Yc.jpg",
               "id": 226302,
               "order": 11
            },
            {
               "cast_id": 1015,
               "character": "",
               "gender": 0,
               "credit_id": "52fe4720c3a36847f8124e5f",
               "name": "Ljuba Tadić",
               "profile_path": "/dZWFU3f9ZQEn8Uy6YojbQcmKlJn.jpg",
               "id": 1043275,
               "order": 12
            },
            {
               "cast_id": 1016,
               "character": "",
               "gender": 2,
               "credit_id": "52fe4720c3a36847f8124e63",
               "name": "Sergej Trifunović",
               "profile_path": "/4AR7yKBsAPgXLA5GmirVY4fzxoE.jpg",
               "id": 66027,
               "order": 13
            }
         ],
         "crew": [{
            "gender": 0,
            "credit_id": "52fe4720c3a36847f8124e2b",
            "name": "Goran Paskaljević",
            "profile_path": "/bJ2DZee9WkmkoopIEFPLx7xmBFU.jpg",
            "id": 1009298,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.780653,
      "production_countries": [
         {
            "iso_3166_1": "RS",
            "name": "Serbia"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "GR",
            "name": "Greece"
         },
         {
            "iso_3166_1": "MK",
            "name": "Macedonia"
         },
         {
            "iso_3166_1": "TR",
            "name": "Turkey"
         }
      ],
      "id": 47144,
      "vote_count": 6,
      "budget": 0,
      "overview": "The film takes place in Belgrade in the mid nineties of the twentieth century, when the brutality and violence are becoming part of everyday reality. A series of separate stories each linked inheritance situations. The painful atmosphere of increasing brutality from which you can not see the output as the main motiv is repeated in the question of accountability: \"Who is guilty?\"",
      "similar": [
         1637,
         1402,
         924,
         238636,
         267,
         574,
         19133,
         1677,
         17689,
         16520,
         44754,
         10536,
         43904,
         99324,
         25330,
         24010,
         12684,
         346651,
         14703,
         2143
      ],
      "original_title": "Bure baruta",
      "runtime": 102,
      "poster_path": "/9YZY9mEje6dsdoGgBybdI8ftlmX.jpg",
      "spoken_languages": [{
         "name": "Srpski",
         "iso_639_1": "sr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "MACT Productions",
            "id": 393,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Eurimages",
            "id": 850,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ministère de la Culture",
            "id": 10901,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Canal (II)",
            "id": 31157,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vans",
            "id": 36746,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Mine Film",
            "id": 57301,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Stefi S.A.",
            "id": 76880,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Gradski Kina",
            "id": 83478,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ticket Productions",
            "id": 83479,
            "origin_country": ""
         }
      ],
      "release_date": "1998-08-01",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Federal Republic of Yugoslavia",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Goran Paskaljevic"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Dejan Dukovski",
         "Dejan Dukovski"
      ],
      "originalLanguage": "Serbian",
      "imdbLink": "http://www.imdb.com/title/tt0169145/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0ODc5ODgxOV5BMl5BanBnXkFtZTYwOTkyMjk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Mira Banjac, Ivan Bekjarev, Aleksandar Bercek | See full cast and crew »"],
      "reviews": [
         "If you know at least something about the events that took place in former Yugoslavia during the 1990s, you should be able to understand this movie. Many people have misinterpreted this movie as a vicious depictment of some sick Serbian mentality or an exaggerated vision of a post-war Serbia. None of this is true. The theme of \"Cabaret Balkan\" is not violence. A great parallel can be made between \"Cabaret Balkan\" and \"A Clockwork Orange\". The violence in both movies is not the theme - it's merely an extreme way of proving an important point. The oppressors and the oppressed. The small fish and the big fish. The dogs and the sheep (rock fans might find interesting similarities between this movie and Pink Floyd's \"Animals\"). There seems to be certain hierarchy present in \"Cabaret Balkan\". The passive majority is constantly oppressed by the violent minority, many of whom themselves are victims of \"bigger fish\". The passive majority is always ready to turn a blind eye, to look the other way or, as a scene from the movie so visually illustrates, sit on a different side of the bus. Who should the war be blamed on? Is it the government's fault? Or is the fault of the people who elected the government? Should the criminals in power take the blame or the people who let them stay in power? A key scene of the movie which takes place in the bus seems to tell us the most about this issue. \"You finally stood up to me\", says the young bully to the old man who refuses to play along and answer his insulting questions. In a way, the young bully on the bus is the only real hero of \"Cabaret Balkan\". He is the only one with the guts to stand up for his rights - everyone else would much rather look the other way, ignore the situation and mind their own business. The original title of the movie - \"Powder Keg\", draws its name from an old nickname the Balkan peninsula earned at the beginning of this century - a powder keg ready to explode, with multitudes of people constantly fighting wars, making up, then fighting again. After all, isn't that what all the characters in the movie do? The strange mentality of the Balkan people cannot be easily explained, so director Paskaljevic takes it into extremes and creates extremely surreal scenes, like the one in the boxing ring and the bar. Fight. Drink. Fight. Drink. War. Peace. War. Peace. What's it going to be? Doesn't matter, as long as we're all in \"good health\".",
         "This movie impressed me a lot, however the fine details and message of this movie might very easily escape the unwary viewer. I was lucky to watch the movie with a friend from Ex-Yugoslavia who could point out what exactly lied behind every small gesture or circumstantial hints hidden in a single sentence. The characters in this movie are in a constant dilemma, half self-inflicted, half caused by higher powers. Yugoslavia at that time is isolated - mentally, economically, morally. There is no valve to let of the steam, so the people take on themselves, murdering, plundering, threatening and raping. Almost every character is shown to be not fully guilty, but nevertheless brought down by their own acts of violence. The bus scene especially shows that the Yugoslavian people have forgotten to take their fate in their own hands. A young men is fed up with the system, his wasted life and the apathy of his people in general. The best scene in the movie for me Tragic-comically ends this scene like the whole movie. The whole plot takes place one day before the Dayton agreement, another twist of fate, that just on this day those people lose their lives for nothing and absolutely nothing. When you watch this movie you have to realize the deeper message has been made for the Yugoslavian audience to show them the mechanizations of their lives and their own guilt going with it. He tries to hammer this in the minds of the viewers hence the compressed plot and intermingling of scenes. A masterpiece.",
         "A great movie. Someone should surely dislike it, but surely it will be impressed in your head and heart like the explosion of millions of bombs...a bang in my heart, absolutely stupend and upsetting...the bombs are inside of everyone, ready to explode and destroy your minds and bodies.",
         "Very bleak and disturbing movie ridden with dark symbolism and utterly depressing resolutions. But what else would you expect from a film depicting a day in Belgrade on the eve of NATO's bombing campaign against Serbia. It is a great film though, but which deals with the dakrest subject matter, focusing on a society in the throws of agony, continuous degradation of the social fabric, and erosion of humanity under extreme conditions. You can accuse it of being pretentious, self-indulging, or of trying to cover its supposed lack of substance by overwhleming use of violence, but you are living *here* in your cozy apartments, with your salaries and plentiful consumer goods while many people *there* actually experienced the life that is depicted in this movie. \"Cabaret Balkan\" is one gutwrenching scream of anguish and despair in the face of the harsh reality that people had to endure, and still do, judging by the latest news from Yugoslavia.",
         "As truth can be defined by the observer, it is also guided by the artist. This film is as close to truth in film as one can get. The state of the Balkans is one which cannot be easily defined, but understood, if you understand its peoples. The truth of this film lies in the reactionary maelstrom that has been the Balkans for a very, very long time. The film ties the lives together of many, equally bizarre characters and events which are tied together artistically by a collage of madness and life on the edge of it. Please do not miss this film, and watch it several times if possible.",
         "Brutal sense of humor. Unflinching look at the base nature of man in a perverted world. No redemption pedaled in this film. Exhilarating and devastating at the same time. Best thing I've seen in years. If you like Cabaret Balkan I'd recommend \"No Man's Land\".",
         "There where at least twenty or more characters who took us through the streets of Belgrade in one crazy soul-searching period. Each character has a destiny to meet and each one affected by the Balkan States of political chaos. While the neighboring states continue to abuse the human condition, our symbolic characters are tearing at each other on the streets of Belgrade, in one form or another. Every character represents a state of nationality or the social mayhem drowning them. There is the two boxing buddies who turn on each other after revealing past truths, (the same as the peaceful neighbors of different nationalities who turn on one another when the war heated up). There is the Taxi driver who took revenge on a police officer, (the power of police enforcement riddles the country with corruption ). The man who returns back home to reclaim his lost love after a five year absence and a pocket full of money, (commenting on people who left the country to make their wealth overseas then coming back to buy their privileges). The young Bosnian Serb refuge who teams up with the underworld to make ends meet because it is the only way to survive in a hopeless situation, (commenting on the power of the underworld, taking control of restless and lost youths with no place to go). There are so many criss-cross factors that director Goran manages to inter-weave them all in a Robert Altman style. There are some tales that take the pleasure away from the more interesting small tales, but each one had to be told so as to cover the whole spectrum of the Balkan States in a sea of frenzy.",
         "This is an extraordinary film by one of the world's most talented film makers, a dark yet compassionate metaphor for the ongoing tragedy of the Balkans. It was a distinct honor for me to participate in a small way in this production.",
         "Guilt is probably the major theme in this great Yugoslavian film, which is a mixture of interrelating stories taking place in Belgrad during one eventful night. The film ends with one of the main characters being stoned while he's yelling \"I'm innocent\". Whether he did actually try to steal gasoline from cars, the deed he was accused of, is irrelevant (besides, if he did, the gasoline was meant for his family, which had none); and thankfully the director Paskaljevic leaves this question unanswered. More important is the fact that right before the hypothetic theft he was taking part in the torturing of a young couple, so his claim of innocence doesn't really correspond to the truth. On the other hand, a mob which tries to kill a young man for stealing gas doesn't have a much higher position on the moral scale. What Bure Baruta shows is a post-war country where the ethics of people are so dimmed, that none of them can really call himself innocent. These people commit horrible acts in the name of love, hate, or both. Even the film's most sympathetic character, an old bus driver, ends up killing the man who tried to hijack the bus. But none of these people are thoroughly guilty, either, because what they are is what the war has done to them. The bus driver kills not because he likes to, but because he's tired of the chaos his country has descended into. The irony lies in that the hijacker probably felt the same way, he only expressed himself differently. It is the film's strength that even the worst of it's characters are not monsters, and in the end we can't really condemn single one of them. Otherwise we would be in that mob stoning that young man. Although I've given examples of the stories contained in Bure Baruta, they are only facets of the full spectrum the film paints before us. Bure Baruta is one of the greatest European films of the last decade, and quite possibly the best post-war depiction ever made for the big screen.",
         "There are so few movies out there of this caliber. Though certainly a visceral movie, there is a feeling of connectedness with the characters that (though somewhat negated by the foreign language) makes this more than just an intense viewing. Sure, at the end, I breathed a sigh of relief and let go of the knot in my stomach, but the best part of this movie is its study of human nature on the edge. What makes this movie so awful to watch is not that the characters can be so evil, but that you know that they aren't inherently so. Please go see this movie now."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Canal (II)",
         "Eurimages",
         "Gradski Kina"
      ],
      "summaries": ["In Beograd, mid-1990s, 20 people's paths crisscross one night in rage and theater. A callow youth dents a car; its owner hunts him down and trashes his father's flat. Michael, back from abroad, hopes to reclaim Natalia; her new, younger lover seems outclassed. A Bosnian drives a bus to eke out subsistence; his son works the Black Market for a sadist. A cabby buys drinks for a cop he crippled in revenge. Swarthy friends at a gym confess betrayals of each other; violence erupts, then one menaces a woman on a train. Another young woman, traumatized when a knife-wielding youth commandeers her bus, calls for help and ends up with a gun at her head. It's a cabaret macabre."],
      "budget": 0
   },
   "movielensId": 2830,
   "movielens": {
      "languages": ["Srpski"],
      "releaseDate": "1998-08-01",
      "dvdReleaseDate": null,
      "directors": ["Goran Paskaljević"],
      "runtime": 102,
      "movieId": 2830,
      "title": "Cabaret Balkan",
      "mpaa": "R",
      "actors": [
         "Ivan Bekjarev",
         "Vojislav Brajović",
         "Mira Banjac",
         "Aleksandar Berček",
         "Bogdan Diklić",
         "Milena Dravić",
         "Nebojša Glogovac",
         "Mirjana Karanović",
         "Miki Manojlović",
         "Dragan Nikolić",
         "Ana Sofrenović",
         "Danilo 'Bata' Stojković",
         "Ljuba Tadić",
         "Sergej Trifunović"
      ],
      "imdbMovieId": "0169145",
      "originalTitle": "Bure baruta",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["TspwDRrmGEA"],
      "plotSummary": "The film takes place in Belgrade in the mid nineties of the twentieth century, when the brutality and violence are becoming part of everyday reality. A series of separate stories each linked inheritance situations. The painful atmosphere of increasing brutality from which you can not see the output as the main motiv is repeated in the question of accountability: \"Who is guilty?\"",
      "tmdbMovieId": 47144,
      "avgRating": 3.47619,
      "releaseYear": "1998",
      "numRatings": 147,
      "posterPath": "/9YZY9mEje6dsdoGgBybdI8ftlmX.jpg"
   }
}