{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0160216",
      "video": false,
      "title": "A Dog Of Flanders",
      "recommendations": [],
      "backdrop_path": "/wB9ef8SW2zNDrQypfccqbApsycG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Jehan",
               "gender": 2,
               "credit_id": "52fe4a3fc3a36847f81c3509",
               "name": "Jack Warden",
               "profile_path": "/pD98exbwlD4f9QmQd0N8Sa7j6pw.jpg",
               "id": 5251,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Nello",
               "gender": 0,
               "credit_id": "59b0bb66c3a3682c6207e9bd",
               "name": "Jeremy James Kissner",
               "profile_path": "/b5nXEmEKdmHVHD2MZNNm4HuLTRi.jpg",
               "id": 1226764,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Young Nello",
               "gender": 2,
               "credit_id": "52fe4a3fc3a36847f81c350d",
               "name": "Jesse James",
               "profile_path": "/pRhPAFeMr0waquHAUz0gQoSrT2o.jpg",
               "id": 10135,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Michel",
               "gender": 2,
               "credit_id": "52fe4a3fc3a36847f81c3511",
               "name": "Jon Voight",
               "profile_path": "/c7BvyqlvqDkfkFqSBUCiR21fvTh.jpg",
               "id": 10127,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Anna",
               "gender": 1,
               "credit_id": "52fe4a3fc3a36847f81c3515",
               "name": "Cheryl Ladd",
               "profile_path": "/wiNxMI8JwbRZ2MvuUzp861Gja4x.jpg",
               "id": 36169,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "William",
               "gender": 2,
               "credit_id": "52fe4a3fc3a36847f81c3519",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Cogez",
               "gender": 2,
               "credit_id": "52fe4a3fc3a36847f81c351d",
               "name": "Steven Hartley",
               "profile_path": "/4VDSVnGHlMnQ1Nac3CdNRo9sPF1.jpg",
               "id": 113910,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Stephens",
               "gender": 2,
               "credit_id": "52fe4a3fc3a36847f81c3521",
               "name": "Andrew Bicknell",
               "profile_path": "/4lkCkXl4IhbuO7DTmwdTt6WTSXJ.jpg",
               "id": 47525,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Aloise",
               "gender": 0,
               "credit_id": "52fe4a3fc3a36847f81c3525",
               "name": "Farren Monet",
               "profile_path": null,
               "id": 1188924,
               "order": 8
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4a3fc3a36847f81c3501",
            "name": "Kevin Brodie",
            "profile_path": null,
            "id": 40220,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 0.415949,
      "production_countries": [],
      "id": 104896,
      "vote_count": 8,
      "budget": 0,
      "overview": "Poor but happy, young Nello and his grandfather live alone, delivering milk as a livelihood, in the outskirts of Antwerp, a city in Flanders (the Flemish or Dutch-speaking part of modern-day Belgium). They discover a beaten dog (a Bouvier, a large sturdy dog native to Flanders) and adopt it and nurse it back to health, naming it Patrasche, the middle name of Nello's mother Mary, who died when Nello was very young. Nello's mother was a talented artist, and like his mother, he delights in drawing, and his friend Aloise is his model and greatest fan and supporter.",
      "similar": [],
      "original_title": "A Dog Of Flanders",
      "runtime": 96,
      "poster_path": "/w65gcoD1zwmaPLM0gM8s9eynGcj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-08-27",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Kevin Brodie"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Ouida",
         "Kevin Brodie"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0160216/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI5Mzg1NTY1MF5BMl5BanBnXkFtZTcwMzczOTEyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jack Warden, Jeremy James Kissner, Jesse James | See full cast and crew »"],
      "reviews": [
         "I don't know why they named this \"A Dog Of Flanders\" because the dog doesn't really have the lead in this movie. I think they used it to make people think it was a \"Lassie Come Home\" kind of movie. Yes, the dog is 'whipped' by a cruel master in the beginning and he does stay by the side of the little boy throughout the story but he doesn't do anything so outstanding that the movie should be named around his character. SPOILERS Be that as it may - I cried with this film and really didn't want to rent it because all animal/child stories can make me cry. I hate to see any animal or child mistreated and I figured that might happen. The little boy is orphaned by his dying mother and raised by his Grandfather in a poverty shack with a landlord who is your typical Simon Legree. The dead mother was a talented artist and the boy inherits the gift. He works to become a famous artist and falls under the wing of a rich art/patron/teacher who keeps running off to Rome. There are false accusations against the boy over the burning of a barn, the landlord tosses him out of the shack after his Grandpa dies, the dog does cause the accidental death of his original cruel master when the cruel master tries to take him away from the boy. The end is sort of hokey but caught me off guard because I really thought the kid died. By the end of the film I was crying like a baby and applauding the movie itself. I recommend it if you're in the mood for a good 'break my heart' movie.",
         "A simple, pure, nearly unadulterated pleasure, with extraordinary performances and a lovely epiphany at the end. It might be the last movie of the century to representing the paradigm of what moviemaking during the studio era aspired to.",
         "Gorgeous scenery and decent child actors (at least for Nello) make this better than a lot of live action children's movies, but it's no Old Yeller or even a Fly Away Home. It doesn't have the period depth that the book had, and at times the characters seem to have societal views out of the 1990's (such as Alois saying that \"Money doesn't make people happy,\" even though at that time people without money (to summarize one of Samuel Johnson's essays) had no leisure time to find happiness, as they were too busy furnishing themselves with what they needed merely to survive). I would have preferred they kept a little truer--allowing children to make comparisons between their society and past societies lets them use their minds to make their own decisions, something a lot of children's movies don't allow (you listening, Eisner?). There are some good things, though. The relationship between Alois and Nello is less platonic than any of the other versions, making the father's reaction (fear that Alois will end up marrying Nello) more realistic--in the dubbed Japanese anime version released a year or so ago, I couldn't help thinking they seemed more like brother and sister than potential lovers. In this version, they seem only a few couple years away from sexual awakening--they finally seem like the young adolescents they're supposed to be. Spoilers: Probably the biggest change in this version is the ending. Oh, sure, they still go through the motions of Nello's death, but he has a new age vision of his funeral and then returns to his body. Now here's the quandary--is it okay to do something like that? Sure, many literary and film critics have panned Oui'da's story and its ending as being fundamentally flawed--basically, just a glorified tear-jerker that is a sort of children's version of Dicken's A Christmas Carol. But it is also a religious story (in some way Nello and/or Patrasche are supposed to represent Jesus (the dog was whipped, after all), and Reuben's was famous for his religious paintings), so removing the death sort of removes the soul of the piece and renders it more palpable to our current PC/ACLU/Amnesty International public consciousness. It should be noted, though, that Kevin Brodie hints at the ending during the lovely Gypsy scene: when the fortune teller reveals that they have known each other in past lives (i.e. the earlier movie incarnations that were true to the original ending), she says something like, \"You will finally find happiness in this life.\"",
         "The guy who said \"worst-ever\" evidently has no heart. The movie was good and the character of Nello is sweet and good-hearted. I've been to both Antwerp and Flanders as a child and this story brought back memories. The movie is based on the classic book, and sure, the plot isn't all about the dog, but do you really want it to be? If the story was, then the other reviewer might have something to really complain about. I suppose since the central character is a child he objects to that? As to Jon Voight's performance--he's a supporting character--he's not supposed to be in the spotlight, although his character proves to be important later on. I hope the actor who played Nello gets more work; I see a lot of potential in him. If you are a parent your child should like this film, though there is some violence and people do die.",
         "I remember when I saw \"A Dog of Flanders\" at the age of 10. I was enchanted by the movie, and inspired by it, especially since I was highly interested in art. Sure, it has some clichés, and the film seems a bit amateur, but it's a nice welcome from some of these movies being churned out by Hollywood. It's a movie the family can watch, although, younger children most likely won't be entertained by it... it is a purely emotion-driven movie, not one with endless car chases and explosions. For a school report, I took \"A Dog of Flanders\" and put it into context with \"the hero's journey\" which the movie is... a humble hero's journey (look it up, and you'll see what I mean.) But most of all, it is the timeless tale of love and forgiveness, which is a lesson we must all learn, particularly in the world climate we live in today. I invite you to watch and hopefully enjoy. I know I did.",
         "Upon going into the theatre to see this film, i had my doubts as to its quality; it was after all billed as somewhat of a childrens film. My original reason for seeing this movie was because i own a Bouvier des Flandres; the breed of dog featured in it. All i can say now is its a good thing i bought a Bouvier or i would have missed one of, in my opinion, the best films in years. Go on all you want about whatever other films you enjoyed in the past few years; for me \"A Dog of Flanders\" tops them all. Not in a long time has a film touched me emotionally as well as \"pleased the eye\". Im not a great reviewer of movies, but i know a good one when i see it and this is definately one of this years best.",
         "A DOG OF FLANDERS / (1999) ** (out of four) By Blake French: \"A Dog of Flanders\" is a sweet, gentle, lovely motion picture about a young boy's desires and relationships with his everyday neighbors. It is the kind of movie that has its heart in the right place, but the quality of filmmaking is just not present. I feel a subtle guilt for giving the film a negative review because \"A Dog of Flanders,\" directed by Kevin Brodie, is of such innocence and kindness. But the movie has an appearance quality of an callow amateur-contrived dialogue, typical costume designs, shameless sets-not surprisingly its filmmakers are fairly new at this business. Bruce McGill (\"The Legend of Bagger Vance\") and the veteran actor Jon Voight are a few of the recognizable names in the cast. Many of the remaining performers are either not remotely popular or dried out has-beens, even though they do a considerably good job at portraying the tender characters. \"A Dog of Flanders\" has been done before, on TV and in the movies. This is not to say there's no reason to refresh Ouida's sentimental fable since most of us probably have not seen any of the previous versions. Here, we get the same kind of sappy scenes and heavyhearted noble messages, dealing with issues like poverty, trust, death, passion, self confidence, following your dreams, hopelessness, regret, mistakes, and or course, love. The film is not really about a dog, though but about a boy who lost his mother at an early age and raised by his poor elderly grandfather. The boy, named Nello (Jeremy James Kissner), finds a dog left for dead in the snow and adopts him (her?) and falls in love with both the dog and a rich girl named Aloise (Madylin Sweeten). Because of his social status, her philistine father wants his daughter to have no part with Nello. Nello also becomes friends with an proficient artist, Michel de la Grande (Jon Voight), who takes an interest in the boy's drawings and encourages him to enter a big art contest. Jon Voight is good in his role, feeling confident and classy, a major step up from his performance in the painfully rotten horror flick \"Anaconda.\" Jeremy James Kissner provides the film with an empathetic performance that is sweet and sweet-tempered. Jack Warden portrays a character with frailty and charm. However, there are just too many familiar clichés in the plot to recommend the picture. Many kids will find it boring and tedious, as will many adults. \"A Dog of Flanders\" has enough spirit and the right attitude, but the rest of the essential elements of a successful movie just are not here.",
         "This movie is wonderful, and very well-cast. I am so pleased to have the DVD. I originally had hoped to obtain the 1940's classic, starring Donald Crisp, and still hope to, in future. However, this 1999 version is great. Jon Voight is a favorite, as is Jack Warden. The fact that it is filmed entirely on location, in Flanders, is a plus, as well. It just proves that remakes of movies are sometimes just as good, if not better than, the original. And this is the case, with A Dog of Flanders. I have been to Belgium (Brussels, and Brugge), but not Flanders. Perhaps one day, I will have that pleasure. I have never before seen a Bouvier dog, and am very impressed with that breed of dog. At the end of the movie it says that Bouviers are not for everyone-I wonder why that is? I would be anxious for an explanation of that statement. Thank you, Linda Huthmaker, Torrance, California",
         "During a terrible winter storm, Mary is dying and must see that her baby Nello is taken care of. She leaves him with his grandfather Jehan, who is poor but loving. Several years later, Nello is old enough to help Jehan with his milk deliveries in Antwerp. The two have little money and must strive to stay one step ahead of the evil landlord. But they are happy with their lives. It's quite unusual to see a young boy work hard and demand little without complaining. Nello considers William the Blacksmith to be a friend. On one of his deliveries, Nello sees \"a dog of Flanders\" who appears to be dead. He is not, but we saw the dog being beaten by its cruel owner (for parents, I should point out the dog is not visible during the beating, but it is obvious what is going on). Nello revives the dog and takes him home. Nello's mother was a talented artist, and Nello has inherited his mother's ability. Years later, Nello considers his neighbor Aloise Cogez not just a pretty model for his drawings, but also a potential girlfriend. Aloise's father Nicholas will not accept his daughter having anything to do with a poor boy; Nicholas grew up the poor son of a tinker but worked hard building the farm of his wife Anna into a successful business that by this time includes a mill. Anna is more willing to accept Nello but feels she must obey her husband. The former owner of the dog recognizes the animal he abandoned and demands his return. Nello will not do it, which results in a fight that some children might find disturbing. Artist Michel LeGrand believes Nello has the ability to become a great painter, and he teaches Nello what he needs to know. Eventually, Nello decides to enter a contest which will help him pay his mounting bills. The death of his grandfather leaves him with no family and no other means of income other than his art (although he is still able to deliver milk, supposedly). This is a very good family film. Most of the leading performers do a good job. There is a minimum of offensive content. Most importantly, the movie teaches lessons about determination and hard work, and being happy regardless of your situation. Not that hard work always leads to rewards, but that just makes determination that much more important.",
         "This was a great film that the whole family can enjoy. It reminds us that not everyone is born with a silver spoon in their mouth even though they may possess a great talent. The story is of course dramatic and is about a boy's struggle to become an artist even when faced with obstacles of a financial and personal nature. Warner Brother's deserves a thumbs up for this fine film."
      ],
      "genres": [
         "Family",
         "Drama"
      ],
      "productionCompanies": ["Woodbridge Films"],
      "summaries": ["Poor but happy, young Nello and his grandfather live alone, delivering milk as a livelihood, in the outskirts of Antwerp, a city in Flanders (the Flemish or Dutch-speaking part of modern-day Belgium). They discover a beaten dog (a Bouvier, a large sturdy dog native to Flanders) and adopt it and nurse it back to health, naming it Patrasche, the middle name of Nello's mother Mary, who died when Nello was very young. Nello's mother was a talented artist, and like his mother, he delights in drawing, and his friend Aloise is his model and greatest fan and supporter."],
      "budget": 7000000
   },
   "movielensId": 2831,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-08-27",
      "dvdReleaseDate": "2000-03-07",
      "directors": ["Kevin Brodie"],
      "runtime": 96,
      "movieId": 2831,
      "title": "A Dog Of Flanders",
      "mpaa": "PG",
      "actors": [
         "Jack Warden",
         "Jeremy James Kissner",
         "Jesse James",
         "Jon Voight",
         "Cheryl Ladd",
         "Bruce McGill",
         "Steven Hartley",
         "Andrew Bicknell",
         "Farren Monet"
      ],
      "imdbMovieId": "0160216",
      "originalTitle": "A Dog Of Flanders",
      "genres": [
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Poor but happy, young Nello and his grandfather live alone, delivering milk as a livelihood, in the outskirts of Antwerp, a city in Flanders (the Flemish or Dutch-speaking part of modern-day Belgium). They discover a beaten dog (a Bouvier, a large sturdy dog native to Flanders) and adopt it and nurse it back to health, naming it Patrasche, the middle name of Nello's mother Mary, who died when Nello was very young. Nello's mother was a talented artist, and like his mother, he delights in drawing, and his friend Aloise is his model and greatest fan and supporter.",
      "tmdbMovieId": 104896,
      "avgRating": 2.8,
      "releaseYear": "1999",
      "numRatings": 100,
      "posterPath": "/w65gcoD1zwmaPLM0gM8s9eynGcj.jpg"
   }
}