{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "london england",
            "id": 212
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0120747",
      "video": false,
      "title": "The Very Thought of You",
      "recommendations": [
         64523,
         35944,
         43079,
         268536,
         24811,
         38509,
         19076,
         10381,
         2091,
         46924,
         30237,
         63777,
         12723,
         5332,
         220820,
         63437,
         47818,
         36709,
         174378,
         319910
      ],
      "backdrop_path": "/eccvENoRqvsGkgOH8fk5luSmnoi.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 10,
               "character": "Martha",
               "gender": 1,
               "credit_id": "52fe444ec3a36847f808e463",
               "name": "Monica Potter",
               "profile_path": "/eHLvw07VvLiqDkacrsMhMj2lNzp.jpg",
               "id": 2140,
               "order": 0
            },
            {
               "cast_id": 11,
               "character": "Frank",
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e467",
               "name": "Rufus Sewell",
               "profile_path": "/f2PNMnztHluTOw8YfCJUZ2pKfbe.jpg",
               "id": 17328,
               "order": 1
            },
            {
               "cast_id": 12,
               "character": "Daniel",
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e46b",
               "name": "Tom Hollander",
               "profile_path": "/w3jpQ0Lcus7voaq0tKGd4xv2X1D.jpg",
               "id": 2441,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Laurence",
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e46f",
               "name": "Joseph Fiennes",
               "profile_path": "/qbGRmhRN3f2prrgcTDmBGAa46Qd.jpg",
               "id": 12763,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Pedersen",
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e473",
               "name": "Ray Winstone",
               "profile_path": "/kLh8zKA9M8dCOvr44dGdczxMoz4.jpg",
               "id": 5538,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Fluggast",
               "gender": 1,
               "credit_id": "52fe444ec3a36847f808e477",
               "name": "Debora Weston",
               "profile_path": null,
               "id": 49346,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "-",
               "gender": 0,
               "credit_id": "52fe444ec3a36847f808e47b",
               "name": "Jan Pearson",
               "profile_path": null,
               "id": 49347,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Julian",
               "gender": 0,
               "credit_id": "52fe444ec3a36847f808e47f",
               "name": "Rebecca Craig",
               "profile_path": null,
               "id": 49349,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "-",
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e483",
               "name": "Paul Bigley",
               "profile_path": "/fqRomZYLJatugmtuCdQHvnI9u14.jpg",
               "id": 49350,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "",
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e48d",
               "name": "Steven O'Donnell",
               "profile_path": "/doDFS7fPEsF5IQOp6mZAPIOZLnA.jpg",
               "id": 79885,
               "order": 10
            },
            {
               "cast_id": 23,
               "character": "US Ground Stewardess",
               "gender": 1,
               "credit_id": "5a0112fc92514156e600aff8",
               "name": "Lorelei King",
               "profile_path": "/fCePl4nc105Na96L5SMbTfnroGs.jpg",
               "id": 7032,
               "order": 11
            },
            {
               "cast_id": 24,
               "character": "Icelandair Official",
               "gender": 2,
               "credit_id": "5a011309925141572e00aa4f",
               "name": "Hamish Clark",
               "profile_path": "/5iQFBiSWzjgePbCZb5mH8EpACJm.jpg",
               "id": 196796,
               "order": 12
            },
            {
               "cast_id": 25,
               "character": "Taxi Driver",
               "gender": 2,
               "credit_id": "5a011315925141572e00aa73",
               "name": "Steve Speirs",
               "profile_path": "/cCNJouXVxnXJv9j26PaEWJxIkOE.jpg",
               "id": 25441,
               "order": 13
            },
            {
               "cast_id": 26,
               "character": "Bus Driver",
               "gender": 2,
               "credit_id": "5a011320c3a368071100b1fb",
               "name": "Rob Brydon",
               "profile_path": "/iCa4EjmVk9DT9YywWGgPSgjDok2.jpg",
               "id": 47632,
               "order": 14
            },
            {
               "cast_id": 27,
               "character": "Audition Actor #1",
               "gender": 0,
               "credit_id": "5a011338c3a368071100b225",
               "name": "Luke de Lacey",
               "profile_path": null,
               "id": 42280,
               "order": 15
            },
            {
               "cast_id": 28,
               "character": "Audition Actor",
               "gender": 0,
               "credit_id": "5a01135c925141573a00b05e",
               "name": "Luke de Lacey",
               "profile_path": null,
               "id": 42280,
               "order": 16
            },
            {
               "cast_id": 29,
               "character": "Audition Actor",
               "gender": 2,
               "credit_id": "5a01136ac3a368071100b27b",
               "name": "Stephen Mangan",
               "profile_path": "/3pr7Bf98Dej4991wKDDreBvoPAA.jpg",
               "id": 21345,
               "order": 17
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e435",
               "name": "Peter Morgan",
               "profile_path": "/gxmjM2MQ2HmGPKHrbkqBrl1ZXaH.jpg",
               "id": 15730,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe444ec3a36847f808e43b",
               "name": "Grainne Marmion",
               "profile_path": null,
               "id": 27816,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e441",
               "name": "Ed Shearmur",
               "profile_path": null,
               "id": 1999,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e447",
               "name": "David Johnson",
               "profile_path": null,
               "id": 5432,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e44d",
               "name": "Michael Bradsell",
               "profile_path": null,
               "id": 23865,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe444ec3a36847f808e453",
               "name": "Mary Selway",
               "profile_path": null,
               "id": 668,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e459",
               "name": "Max Gottlieb",
               "profile_path": null,
               "id": 49344,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e45f",
               "name": "Mark Raggett",
               "profile_path": null,
               "id": 49345,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe444ec3a36847f808e489",
               "name": "Nick Hamm",
               "profile_path": "/7bJGwFFw1X9ek7mDxeQjjeKJ6uH.jpg",
               "id": 6361,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe444ec3a36847f808e493",
               "name": "Anna B. Sheppard",
               "profile_path": "/q4XKRDuAeHtBsuYDq8gLgr75bCN.jpg",
               "id": 6688,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 2.017296,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 6373,
      "vote_count": 16,
      "budget": 0,
      "overview": "Laurence recounts to his neighbour how his life long friendship with Frank and Daniel has been overturned in just three days by their each independently meeting, and falling for, Martha, who has no idea of their connection. Slowly the tale unfolds, the narrative moving backwards and forwards gradually filling in the gaps until we see the whole picture",
      "similar": [
         3134,
         634,
         10735,
         8810,
         170,
         281,
         948,
         298312,
         4638,
         1581,
         762,
         296096,
         146216,
         691,
         10212,
         11564,
         43923,
         133805,
         2142,
         321258
      ],
      "original_title": "Martha – Meet Frank, Daniel and Laurence",
      "runtime": 88,
      "poster_path": "/4j4Vr6iwFp5Myba8Zz8uHy2tGjw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "Banshee",
            "id": 2079,
            "origin_country": ""
         }
      ],
      "release_date": "1998-05-08",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "Two's Company. Three's a Crowd. Four's a Disaster.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Nick Hamm"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Peter Morgan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0120747/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3ODgwMjg4Nl5BMl5BanBnXkFtZTcwODYwOTMyMQ@@._V1_SY317_CR10,0,214,317_AL_.jpg",
      "actors": ["Stars: Joseph Fiennes, Monica Potter, Rufus Sewell | See full cast and crew »"],
      "reviews": [
         "I will agree that this film was predictable in some ways, but had a few strategically placed plot twists that made up for it. Monica Potter is beautiful, funny and charming as the object of three lifelong friends' affection. I liked Joseph Fiennes in Shakespeare In Love but he's absolutely wonderful here. I didn't think he and Gwyneth Paltrow shared much chemistry in Shakespeare but here he has a warm and special chemistry with Ms. Potter. It really looks like they are in love, and I love the way when he repeated his ideal of the perfect woman, they filled in the gaps. This is an underrated but enjoyable romance, along the lines of Sliding Doors.",
         "I saw this film with the title \"The Very Thought of You\" and think that \"Martha, Meet Frank, Daniel and Laurence\" is far more apropos and distinctive, although a bit of a mouthful to casually mention the film to friends. I expect that far too few persons will see this delightful film. I was particularly charmed by Laurence's description of the \"perfect woman\" and even more charmed when (as if I might have missed it) it was replayed! The film is worthy of smiles and laughs throughout, with an especially funny moment which rippled through the audience in laughter for many moments into the next scene. It is artistically directed and edited, intelligently written, and well acted (except when Monica Potter seemed to sound like Julia Roberts -- I can't imagine why she would want to do that). Interestingly, Joseph Finnes is also outstanding in one of the films that I believe is among the best of the decade: \"Shakespeare in Love.\" I find the implausibility of this is irrelevant -- it's an 83-minute movie that sets out to capture a mood, tell a story, and entertain. I expect that many will easily brush this film off as \"cute and sweet\" but I personally would love to see more films that are as well-constructed and intelligent.",
         "I seen this at the video store but passed it by because I thought it was the typical Sarah Michelle-Melissa Joan-Freddie Prinze-Katie Holmes type of romantic comedy. I didn't realize it was a British movie(otherwise I might have given it a second look at the video store) and caught it on cable. I was pleasantly surprised by the acting. I liked the fact that it didn't go the typical sex route, although I didn't think about that until the movie was over. I was pleasantly surprised that it was a British film, it seemed more in the Hollywood vein, not as dark and gritty as a lot of British cinema. The mood of the film was cheerful, upbeat and somewhat witty. I particularly liked the technique of going back in the story to fill in the gaps of the storyline. It reminded me of an old fashioned type of movie; and I have to admit the lead actress did remind me of a Julia Roberts type. Very entertaining.",
         "I happened to flick across the beginning of this film last night on cable. I missed the title, but saw \"Joesph Fiennes\", \"Rufus Sewell\", and \"Ray Winstone\" - and decided it was worth a look. Though the beginning was a tad slow (the first five minutes makes you think it's going to be very depressing), this is actually a sweet comedy about love and friendship and the nature of \"love at first sight\". Joesph Fiennes is heart-stoppingly beautiful, with his lovely puppy-dog eyes put to good use in his character as an overly-sensitive young man wedged between two aggressive friends who are less-than-sensitive. I dislike most \"romance\" films; yet this one was different, for a reason I can't quite put my finger on. It tugs at your heart, and for all it's improbable situations (de rigeur in most romantic comedy), it rings true to life. Definitely a good film for watching on a rainy afternoon.",
         "This was a great British film that deserves a good pat on the back. Not only did the film put together such a wonderfully presented cast that went together so realistically, so precise(including the sexy Joseph Fiennes), but it was a fantastic film with an original and laughable plot (which is better than seeing the same story over and over again). A great film that I enjoyed immensely.",
         "I'm a fan of Joseph Fiennes, so naturally, this was a film I've been wanting to see for ages. And it didn't disapoint me one bit! The plot is basiclly three English friends meet an American girl within three days, at seperate times, and they all fall for her. First, I was excited to see a romantic comedy set in Britain ... I always look forward to those. And then, despite the ending being pretty predictable, I came to the conclusion that this is definately one of the best Romantic Comedy films I've ever seen. Monica Potter does a great job at Martha, the American girl who's had enough of her life in America so buys the first plane ticket to anywhere for $99, and ends up in London. There were one liners from Martha that made me laugh so much. Tom Hollander is a great Daniel, the rich and spoilt British guy who's a bit of a ladies man, and just loves to get a rise out of Frank. It's by not trying to be funny that makes us love and laugh at Daniel. Hollander does a great job at achieving this. Joseph Fiennes ... is there any criticism you can give this man? He's perfect for the role of Laurence, and that's why it works so well. When you look into his eyes, you can dive deep into his soul, and he has the sort of face which you love. Laurence is the romantic and sensitive character, and I can't imagine a better person than Fiennes playing him. Rufus Sewell as Frank steals the show. Frank is the funniest character, despite how serious he is. Frank, the depressed and failed actor who is constantly getting into arguements with Daniel, will have you laughing your ass off! I can't think of a time when he said something I didn't laugh at. If you're not a big fan of Romantic Comedies, this movie is worth watching, just for Sewell. Stars out of 10 : 10",
         "Martha (Monica Potter) is single, sexy and she's so sick of her life she's off to London with the last of her money. Daniel (Tom Hollander) is single, successful and after one look at Martha he thinks he's in love. Frank (Rufus Sewell) is one of Daniel's friends, despite the fact he is always trying to get one up on him. Lawrence (Joseph Fiennes) is another of Daniel's friends, and he is always caught between Frank and Daniel as they jostle for supremacy. The casing and script are both strong, and the feel of the movie is nice and original, even with the usual clichés in the romance element. It's funny, it's romantic and it has sex appeal for both men and ladies, so obviously its worth a watch; if you don't try it, you'll never know. 7/10",
         "If you are looking for simplicity with little twists here and there - just enough to make it amusing but not too much to be thought-provoking -then this movie would be a good place to start. It's definitely a low-budget film, you can really tell from the color quality. Clever, feel-good script - really aims to entertain instead of being profound, although it's probably a good idea to lay off the cheesy, over-used lines like \"she's different from any woman I've ever met\" and \"do you believe that things happenned for a reason?\". Good line up of cast. Tom Hollander and Rufus Sewell really shines as Daniel and Frank, they play off each other beautifully and show a bit of versatility which is nice (both are well known dramatic actors). Joseph Fiennes was okay - Laurence doesn't really provide much. He's the long suffering lovesick puppy type which Mr. Fiennes has obviously played quite a few times before. He somehow fits in less naturally here as if he's gone straight from a stage production and hasn't really got time to shake off the character. Very good vocal (still got the elizabethan twinge in it)and not much facial expression. I do enjoy the idiosyncracies like Laurence drawing something whenever he feels stuck in the middle. And how he's occasionally being called \"Florence\". Monica Potter provides a very Julia Roberts style performance, which isn't saying much of her own quality as an actress. I was watching this movie with a roomate the other day and she said \"It's a movie that makes you want to fall in love\" - I myself was just looking for a comedy and was getting it just fine from this movie. So for whatever reason, you'll enjoy it.",
         "This is a British film. It means that noboby will take you for a fool. This is a romantic comedy, but a MALE romantic comedy! Three guys takes the place of one Meg Ryan. In that sense, it makes it very original, with a subject very déjà vu. I also love the fact that the film is short, that some of the gags are very funny without having to howl all the time. The gag of Fiennes talking to a psychologist who is not is funny. Good young actors too!",
         "I don't really know why I've written that this movie is useless. I think it's obvious that it won't change your mind or your life, won't make you cry or laugh (OK, you can smile sometimes), won't be successful, won't be anything. It's just a movie, an ordinary movie in such a competitive world. Here in Brazil, a competitive place too, I went to one multiplex (I hope that's the name for these theatres with 7, 8, 9 (...) screens there) to watch \"Teaching Mrs. Tingle\" (I'm really embarrassed now). Unfortunately, the movie was sold-out, I had already watched \"The Sixth Sense\" twice, I really didn't want to watch \"Bowfinger\", the teen-trash \"American Pie\" again, the horrible \"End of Days\", and the most horrible \"Letters from a killer\". So, I tried the unique \"watch-able\" movie there, the unique romance, the unique that still had some tickets in that competitive world: \"Martha, Meet Frank, Daniel and Laurence\". The Brazilian name, \"Mero Acaso\" (in a free translation, Mere Chance or Pure Fate) is one good summary for this movie about one American woman that moves to England and, by fate, develop three relationships with three guys. These three guys are friends but they don't know that they're seeing the same woman. Interesting? Not very much. In fact, the original title tells the story. I watched it without knowing that she would meet the three, so really enjoyed. It was relaxing, fast, cute, romantic but like films made for television. No big plot, no big camera moves, no big cast, no big musics, no big budget... (although some of the best movies I've ever seen were very cheap). And it had some awful stereotypes: the American girl was blond, feminist, modern, on (bad) fashion, colored, with a huge suitcase. The British guy was shy, out of fashion, polite, bla, bla, bla. It's perfect to watch at your house eating popcorn. The truth is that I'm lucky. This movie is much better that \"Teaching Mrs. Tingle\", at least. Thanks God that we live in a competitive world!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Banshee",
         "Channel Four Films"
      ],
      "summaries": [
         "Laurence recounts to his neighbour how his life long friendship with Frank and Daniel has been overturned in just three days by their each independently meeting, and falling for, Martha, who has no idea of their connection. Slowly the tale unfolds, the narrative moving backwards and forwards gradually filling in the gaps until we see the whole picture.",
         "A young American girl goes to England to \"find herself\" when she meets three best friends, all of whom fall in love with her. Two friends are in pursuit of her, but she is in pursuit of the third friend. He struggles with his own guilt, because he feels he is betraying his friends to be with her."
      ],
      "budget": 0
   },
   "movielensId": 2834,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-05-08",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Nick Hamm"],
      "runtime": 88,
      "movieId": 2834,
      "title": "The Very Thought of You",
      "mpaa": "R",
      "actors": [
         "Monica Potter",
         "Rufus Sewell",
         "Tom Hollander",
         "Joseph Fiennes",
         "Ray Winstone",
         "Debora Weston",
         "Jan Pearson",
         "Rebecca Craig",
         "Paul Bigley",
         "Steven O'Donnell",
         "Lorelei King",
         "Hamish Clark",
         "Steve Speirs",
         "Rob Brydon",
         "Luke de Lacey",
         "Luke de Lacey",
         "Stephen Mangan"
      ],
      "imdbMovieId": "0120747",
      "originalTitle": "Martha – Meet Frank, Daniel and Laurence",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Laurence recounts to his neighbour how his life long friendship with Frank and Daniel has been overturned in just three days by their each independently meeting, and falling for, Martha, who has no idea of their connection. Slowly the tale unfolds, the narrative moving backwards and forwards gradually filling in the gaps until we see the whole picture",
      "tmdbMovieId": 6373,
      "avgRating": 3.27163,
      "releaseYear": "1998",
      "numRatings": 208,
      "posterPath": "/4j4Vr6iwFp5Myba8Zz8uHy2tGjw.jpg"
   }
}