{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0163579",
      "video": false,
      "title": "Chill Factor",
      "recommendations": [
         50116,
         82360,
         27993,
         26789,
         14809,
         219575,
         9458,
         18621,
         41590,
         16379,
         65137,
         10550,
         26180,
         39140,
         37641,
         34309,
         2165,
         31659,
         15720,
         21241
      ],
      "backdrop_path": "/yAzH9bu7bUrPNnSqct50ezsPITT.jpg",
      "revenue": 11263966,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 14,
               "character": "Arlo",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b49",
               "name": "Cuba Gooding Jr.",
               "profile_path": "/yu8Q3ImFu3RJne585jjgeQO2Boo.jpg",
               "id": 9777,
               "order": 0
            },
            {
               "cast_id": 15,
               "character": "Tim Mason",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b4d",
               "name": "Skeet Ulrich",
               "profile_path": "/id0y6bKmNSpr2pYU2Qkiv11EyvR.jpg",
               "id": 22108,
               "order": 1
            },
            {
               "cast_id": 16,
               "character": "Col. Andrew Brynner",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b51",
               "name": "Peter Firth",
               "profile_path": "/o7zbRKlhY8v9mhxyBvAwou7l200.jpg",
               "id": 22109,
               "order": 2
            },
            {
               "cast_id": 17,
               "character": "Dr. Richard Long",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b55",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 3
            },
            {
               "cast_id": 19,
               "character": "Col. Leo Vitelli",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b59",
               "name": "Daniel Hugh Kelly",
               "profile_path": "/6eZZbAZsupu3WHHtW3tud3o0F1u.jpg",
               "id": 22111,
               "order": 5
            },
            {
               "cast_id": 21,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b5d",
               "name": "Judson Mills",
               "profile_path": "/8BtHA3PROogd3F5iHHncetpJSW2.jpg",
               "id": 22113,
               "order": 7
            },
            {
               "cast_id": 22,
               "character": "Carl",
               "gender": 0,
               "credit_id": "52fe433cc3a36847f8044b61",
               "name": "Jordan Mott",
               "profile_path": null,
               "id": 22114,
               "order": 8
            },
            {
               "cast_id": 23,
               "character": "Vaughn",
               "gender": 1,
               "credit_id": "52fe433cc3a36847f8044b65",
               "name": "Hudson Leick",
               "profile_path": "/qDlDHfKDcBHuNunEd2lA0kg2uDE.jpg",
               "id": 87282,
               "order": 9
            },
            {
               "cast_id": 24,
               "character": "Telstar",
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b69",
               "name": "Kevin J. O'Connor",
               "profile_path": "/1yeYRXpTbDYLMKUNT4hNQJTJsUX.jpg",
               "id": 18916,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044afd",
               "name": "Hugh Johnson",
               "profile_path": null,
               "id": 22100,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe433cc3a36847f8044b03",
               "name": "Drew Gitlin",
               "profile_path": null,
               "id": 22101,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b09",
               "name": "Mike Cheda",
               "profile_path": null,
               "id": 22102,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b0f",
               "name": "James G. Robinson",
               "profile_path": null,
               "id": 4700,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b15",
               "name": "John Powell",
               "profile_path": "/fFRYoiZxBtP4Gs0CAphU7F5mDk.jpg",
               "id": 11098,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b1b",
               "name": "Hans Zimmer",
               "profile_path": "/7IjJpvGtCfY0DsritmfCh2iX9I4.jpg",
               "id": 947,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b21",
               "name": "David Gribble",
               "profile_path": null,
               "id": 22103,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe433cc3a36847f8044b27",
               "name": "Pamela Power",
               "profile_path": null,
               "id": 22104,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe433cc3a36847f8044b2d",
               "name": "Pam Dixon",
               "profile_path": null,
               "id": 18457,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe433cc3a36847f8044b33",
               "name": "Jeremy Conway",
               "profile_path": null,
               "id": 22105,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe433cc3a36847f8044b39",
               "name": "Fredda Slavin",
               "profile_path": null,
               "id": 22106,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe433cc3a36847f8044b3f",
               "name": "Claudette Didul",
               "profile_path": null,
               "id": 17979,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "52fe433cc3a36847f8044b45",
               "name": "Deborah Everton",
               "profile_path": null,
               "id": 22107,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "563aa0109251417819000128",
               "name": "Guy Williams",
               "profile_path": null,
               "id": 1401803,
               "department": "Crew",
               "job": "Technical Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 2.954752,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 2162,
      "vote_count": 38,
      "budget": 70000000,
      "overview": "A store clerk and an ice cream truck driver are thrown together when a dying scientist entrusts them with a deadly chemical kept in ice. This chemical will kill every living thing once it melts. They have to take the chemical codenamed 'Elvis' to the next nearest military base while being chased by terrorists who want it to hold the country for ransom.",
      "similar": [],
      "original_title": "Chill Factor",
      "runtime": 101,
      "poster_path": "/Teyo0W5euwLChQvFT0NQDfbvcQ.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Morgan Creek Productions",
            "id": 10210,
            "origin_country": ""
         },
         {
            "logo_path": "/6rFNo5taSC9i0Sxnl81nucQMsw9.png",
            "name": "Warner Bros. Pictures",
            "id": 174,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-09-01",
      "vote_average": 5.1,
      "belongs_to_collection": null,
      "tagline": "This Fall, Action is served on the rocks, with a twist.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Hugh Johnson"],
      "runtime": 102,
      "synopsis": null,
      "writers": [
         "Drew Gitlin",
         "Mike Cheda"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0163579/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIwNjQzNjgwMV5BMl5BanBnXkFtZTcwMjM4NzEyMQ@@._V1_SY317_CR12,0,214,317_AL_.jpg",
      "actors": ["Stars: Cuba Gooding Jr., Skeet Ulrich, Peter Firth | See full cast and crew »"],
      "reviews": [
         "This film was complete trash, but in a good way. I've always looked upon Cuba Gooding Jnr as a semi decent actor but if this is the kind of film he is going to be starring in, then I can see him descending the same way as Charlie Sheen. You can see from the outset that the makers tried to make one of those high octane action thrillers, which are ten-a-penny these days. But when you've got a budget that would struggle to finance an episode of quantum leap, then maybe making a film of this kind wasn't such a good idea. They make use of computer graphics in a lot of the action scenes which, to be honest, doesn't look the worst I have ever seen, but still prompts you to snicker at how bad it is. The most ridiculous of which occurs at the end of the movie, when a chemical weapon which we have been told has the power to blow up basically a quarter of America, detonates in a tunnel. At this point we are subjected to rotten computer graphics which are so bad that I instantly had flashbacks of Dean Stockwell and the film-making atrocity that was the Langoliers. But the story is complete nonsense, so even with a budget the size of Lord of the Rings, there would be no way of making the whole thing believable anyway. So you can perhaps see where the producer was coming from i.e. lets make a cheap action thriller and we'll plaster Cuba Gooding's face over the front cover and we'll maybe make some money. It would've have been better if Eric Roberts had been given the leading role.",
         "Good action flick about regular guys turned defenders of the American people. Cuba Gooding is great as an excitable type, while Skeet Ulrich is the cool one. Once the story is set up, the action is non stop with a lot of \"Edge of your seat\" scenes. Cuba & Skeet deliver some good comedy lines to take a bit of the edge off the intensity of this film. Their relationship as friends grows throughout the movie so it gives you a good feeling & brings some believability to how they react to each other in tough situations. If you like fast, hard hitting action with a bit of humor thrown in, this movie is for you!",
         "The whole plot was tired and foolish, must of us know that. I myself happen to like cheesy and stupid action movies. Cuba was funny, as I thought he might be, even Skeet turned out to have slight humor in his bones. This is one of those movies where two guys hate each other at first, but end up becoming the best of pals. If you like dumb jokes, and asinine plots, you'll LOVE this movie!",
         "A scientist (David Paymer) develops a biological lethal weapon and accidentally kills eighteen persons involved in the project. Col. Andrew Brynner (Peter Firth) is blamed and goes to prison for ten years. Along this period, he gets crazy and decides to get and sell the weapon. A convenience store clerk (Skeet Ulrich) and an ice-cream trucker driver (Cuba Gooding Jr.) receives this weapon from the injured Dr. Richard Long, with an advice to keep it below 50 F, and try to escape from the colonel's team. This movie is not bad. Indeed it is a little bit above the average of this type of action movie. There are some terrible cuts of the scenes. Although being forgettable, it is not a bad entertainment. My vote is six. Title (Brazil): \"Suando Frio\" (\"Sweating Cold\")",
         "CHILL FACTOR is one of those movies that you enjoy for its duration but does not live long in the memory.The main story takes a little longer than it needs to to get under way but once it does the movie races along to an exciting and dare I say suspenseful climax and emerges victorious as a pleasing and involving action flick. Skeet Ulrich and Cuba Gooding Jnr.,actors unfamiliar to me work well together as two likeable guys transporting some kind of explosive \"macguffin\" in an ice cream truck to protect it from psychopathic terrorists on their trail.The standout performacehowever,comes from Hudson Leick who portrays the villainous warrior woman Callisto on XENA WARRIOR PRINCESS.She plays the tough mercenary hench(wo)man to bad guy Peter Firth and she can play evil like no other actress around today;Leick can wither with a glance and helps make CHILL FACTOR a movie to seek out.More from her please.",
         "This film is, I believe, a bit underrated. Cuba Gooding stars in this action drama about a terrorist and a really nasty chemical weapon. In my opinion, it deserves a bit more than the 4.8 rating that it has accumulated. I gave it a 6. I found the interaction between the two heroes, portrayed by Gooding and Skeet Ulrich, to be quite what I'd expect from people under similar circumstances. There is intrigue and lots of action, enough to satisfy any action film freak. The story is decent and the screenplay is well-written. I thought the execution was OK but nothing to write home about. All in all, a \"Not Bad\" action flick that shouldn't disappoint.",
         "Over the past few months, I've been taken in by some movies that have been deemed 'cinematic masterpieces' by some. I've also had the 'pleasure' of watching TV-movies that can be found at the bottom of the bargain bin in some video stores. This movie is neither. It is not a 10/10 movie masterpiece, nor is it a bargain-bin, third-rate, C-list, avoid-at-all-costs tape. It sits right in the middle of the spectrum. It is watchable and entertaining, yet not exactly worthy of the Oscar or Golden Globe awards. It was action-packed, fun to watch and a great way to spend a Saturday night at home, either by yourself or others. Out of ten, I give this film a 7. It lost 3 points for the somewhat hollow acting, but still, it was a fun movie, if you don't take it seriously.",
         "Repeat Review. Reviews #1-97: http://www.imdb.com/user/ur3825387/comments Reviews #98-#100: http://www.imdb.com/user/ur5060215/comments Reviews #101-#104: http://www.imdb.com/user/ur5339193/comments ---------- (Original Date of Review - August 26, 2004) ---Minor Spoilers--- Cuba Gooding Jr., and Skeet Ulrich star in this decent but funny action/thriller directed by Hugh Johnson. Cuba plays an ice cream delivery man named Arlo while Skeet plays as a connivance store clerk in Montana named Tim Mason. David Paymer plays a role at the beginning of the movie that lasts about 30 minutes and he plays the best friend of Mason who is a scientist named Richard Long. The movie starts on an island in which some sort of military establishment is. Dr. Long is in charge of this radio-active bomb named Elvis that he's been working on for a long time. Him and his assistant decide to test it out but it goes all wrong and Long's boss comes in named Bryner. If the bomb were to reach 50º Fahrenheit, it would blow up and massacre anything in it's 5-mile radius, that exact radius of the island. The bomb reaches 50º, which must be the CHILL FACTOR and it blows up. 17 soldiers are severely killed and in the scientist shelter, the military boss, Long, and his assistant survive. Next scene, the boss is charged for all of it even though it was all Long's fault. The boss goes to jail for 10 years. Next scene, 10 years later, Bryner comes out and seeks revenge. Now in Montana, he assembles a small team of smart assassins to travel with him to avenge what Long did to him. Meanwhile, Arlo (Gooding) is doing a 4 AM ice cream shift and Mason (Ulrich) is doing a connivance store night shift. The assassins invade the research center of Long and he gets shot. Already some plot holes. Long barely makes it to Mason's store, almost dead while Arlo is there to deliver $400 worth of ice cream. Long tells his best friend that he's about to die and that he needs him to bring the remaining radio-active bomb that detonates at CHILL FACTOR to the military base. This time, this Elvis is much more stronger than the 5-mile radius one. Long said he needs Arlo's ice cream truck to keep the temperature down on the bomb. Long dies, and Arlo and Mason are off to put the bomb in its proper place with Arlo's ice cream truck while the assassins are on him. Thus concludes the first 35 minutes of the movie. Note that Arlo doesn't appear in the movie until 25 minutes in. The adventure (with this twisted plot) is on. Tensions flare, in comedy as Arlo wants to get the hell away from Mason and far away as possible but Mason threatens him with a revolver forcing him to continue driving during the early parts of they're trip. They soon find out that Bryner is on their tail and they have to improvise or die. Overall, Chill Factor is a decent action/thriller with good comedy in it but somewhat fails to impress. Maybe it's the lacking, holed plot. Good effort by Cuba and Skeet though. If you got some time and you want a good buddy film, check this one out. My Rating: 7/10 Objectively: 6/10 Subjectively: 7/10 Eliason A.",
         "---Minor Spoilers--- Cuba Gooding Jr., and Skeet Ulrich star in this decent but funny action/thriller directed by Hugh Johnson. Cuba plays an ice cream delivery man named Arlo while Skeet plays as a connivance store clerk in Montana named Tim Mason. David Paymer plays a role at the beginning of the movie that lasts about 30 minutes and he plays the best friend of Mason who is a scientist named Richard Long. The movie starts on an island in which some sort of military establishment is. Dr. Long is in charge of this radio-active bomb named Elvis that he's been working on for a long time. Him and his assistant decide to test it out but it goes all wrong and Long's boss comes in named Bryner. If the bomb were to reach 50º Fahrenheit, it would blow up and massacre anything in it's 5-mile radius, that exact radius of the island. The bomb reaches 50º, which must be the CHILL FACTOR and it blows up. 17 soldiers are severely killed and in the scientist shelter, the military boss, Long, and his assistant survive. Next scene, the boss is charged for all of it even though it was all Long's fault. The boss goes to jail for 10 years. Next scene, 10 years later, Bryner comes out and seeks revenge. Now in Montana, he assembles a small team of smart assassins to travel with him to avenge what Long did to him. Meanwhile, Arlo (Gooding) is doing a 4 AM ice cream shift and Mason (Ulrich) is doing a connivance store night shift. The assassins invade the research center of Long and he gets shot. Already some plot holes. Long barely makes it to Mason's store, almost dead while Arlo is there to deliver $400 worth of ice cream. Long tells his best friend that he's about to die and that he needs him to bring the remaining radio-active bomb that detonates at CHILL FACTOR to the military base. This time, this Elvis is much more stronger than the 5-mile radius one. Long said he needs Arlo's ice cream truck to keep the temperature down on the bomb. Long dies, and Arlo and Mason are off to put the bomb in its proper place with Arlo's ice cream truck while the assassins are on him. Thus concludes the first 35 minutes of the movie. Note that Arlo doesn't appear in the movie until 25 minutes in. The adventure (with this twisted plot) is on. Tensions flare, in comedy as Arlo wants to get the hell away from Mason and far away as possible but Mason threatens him with a revolver forcing him to continue driving during the early parts of they're trip. They soon find out that Bryner is on their tail and they have to improvise or die. Overall, Chill Factor is a decent action/thriller with good comedy in it but somewhat fails to impress. Maybe it's the lacking, holed plot. Good effort by Cuba and Skeet though. If you got some time and you want a good buddy film, check this one out. My Rating: 6.5/10 (A Mid 6.5) Eliason A.",
         "Cheesy, predictable plot, with no movement. Stereotypical from beginning to end. The lighting and camera angles reminded me of something from a made for TV movie. While the movie tried to be funny, it was far from it."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": ["Morgan Creek Productions"],
      "summaries": [
         "Ten years after a covert military experiment on a remote Pacific island went wrong and killed eighteen servicemen and his assistant, Dr. Richard Long is still trying to forget the havoc that the experiment caused. Living in the small town of Jerome, Montana, Long still does scientific experiments at the local base, and he enjoys his time fly-fishing with Tim Mason, who works at a local diner. Long is visited by Colonel Andrew Brynner, a former military officer who took the blame and served ten years in Leavenworth Federal Prison for Long's experiment. Now a free man with a score to settle, Brynner has assembled a team of terrorists, including an icy blond named Vaughn. Brynner plans to steal and then sell \"Elvis\" -- Long's highly volatile, blue crystal substance -- to the highest international bidder. Unfortunately for him, Long, who gets killed, has already delivered \"Elvis\" to Mason, along with directions that the substance must remain below fifty degrees Fahrenheit, or it will detonate and vaporize everyone within several hundred miles of it. After Mason and Arlo, a wisecracking ice cream delivery man, have a run-in with Brynner, they try to get the substance to Fort Magruder. They don't exactly get along with each other -- Arlo only agrees to transport the substance in his ice cream truck because Mason held a gun on him -- but they find a common bond in trying to avoid Brynner, who will stop at nothing to get the substance.",
         "Two mis-matched men, Arlo, an Ice Cream truck driver, and Tim a convenience store clerk, are forced to team up with each other, and get on each others nerves, when through a series of circumstances, they get possession of a top-secret, bio-warfare weapon, when heated to over 50 F, detonates and releases a lethal cloud of radioactivity in which a disgruntled, former U.S. Army officer and his team of alienated, former Army soldiers-turned-terrorists, want to use against the government for making them the scapegoats years earlier for their handling of the virus and covering up the existence of the weapon. With time running out, and the outdoor temperature rising, Arlo and Tim must outwit their pursuers and try to find a way to dispose of the weapon before they both become dead meat.",
         "A new biological chemical weapon that explodes up to temperatures over fifty degrees Fahrenheit, falls into the hands of two men who try to make sure that it doesn't get stolen by a terrorist."
      ],
      "budget": 70000000
   },
   "movielensId": 2835,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-01",
      "dvdReleaseDate": "2005-09-20",
      "directors": ["Hugh Johnson"],
      "runtime": 101,
      "movieId": 2835,
      "title": "Chill Factor",
      "mpaa": "R",
      "actors": [
         "Cuba Gooding Jr.",
         "Skeet Ulrich",
         "Peter Firth",
         "David Paymer",
         "Daniel Hugh Kelly",
         "Judson Mills",
         "Jordan Mott",
         "Hudson Leick",
         "Kevin J. O'Connor"
      ],
      "imdbMovieId": "0163579",
      "originalTitle": "Chill Factor",
      "genres": [
         "Action",
         "Comedy",
         "Thriller"
      ],
      "youtubeTrailerIds": ["2NXMDa9QaHw"],
      "plotSummary": "A store clerk and an ice cream truck driver are thrown together when a dying scientist entrusts them with a deadly chemical kept in ice. This chemical will kill every living thing once it melts. They have to take the chemical codenamed 'Elvis' to the next nearest military base while being chased by terrorists who want it to hold the country for ransom.",
      "tmdbMovieId": 2162,
      "avgRating": 2.32837,
      "releaseYear": "1999",
      "numRatings": 504,
      "posterPath": "/Teyo0W5euwLChQvFT0NQDfbvcQ.jpg"
   }
}