{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gay",
            "id": 237
         },
         {
            "name": "meditation",
            "id": 1532
         },
         {
            "name": "coming out",
            "id": 1862
         },
         {
            "name": "party",
            "id": 8508
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "gay interest",
            "id": 10199
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0126810",
      "video": false,
      "title": "Bedrooms and Hallways",
      "recommendations": [
         84303,
         41645
      ],
      "backdrop_path": "/fMg6AIFoNscExxZB0muMZE31Pxq.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Brendan",
               "gender": 2,
               "credit_id": "5706d89a9251412b0e0003ab",
               "name": "James Purefoy",
               "profile_path": "/mi2jfhx57kJ7dDvhoCJyDaEkICR.jpg",
               "id": 17648,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Sybil",
               "gender": 1,
               "credit_id": "5706d8b2c3a3686511000354",
               "name": "Harriet Walter",
               "profile_path": "/vfpIPsC27D1ONVres7j3DgWYzdN.jpg",
               "id": 17477,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Sally",
               "gender": 1,
               "credit_id": "5706d8c7c3a368650900037a",
               "name": "Jennifer Ehle",
               "profile_path": "/lZsU6KrXXkIVtcvJmlPKwPRtBkn.jpg",
               "id": 49971,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Leo",
               "gender": 2,
               "credit_id": "5706d8e29251412b01000382",
               "name": "Kevin McKidd",
               "profile_path": "/5MahWq6XoSuThdSLvVXUDa2LlkP.jpg",
               "id": 9013,
               "order": 4
            },
            {
               "cast_id": 5,
               "character": "Darren",
               "gender": 2,
               "credit_id": "5706d8f79251412b0100038b",
               "name": "Tom Hollander",
               "profile_path": "/w3jpQ0Lcus7voaq0tKGd4xv2X1D.jpg",
               "id": 2441,
               "order": 5
            },
            {
               "cast_id": 6,
               "character": "Jeremy",
               "gender": 2,
               "credit_id": "5706d91bc3a3686516000430",
               "name": "Hugo Weaving",
               "profile_path": "/fZ3wXniGrqbHk4eRt9gE2pSz4Jy.jpg",
               "id": 1331,
               "order": 6
            },
            {
               "cast_id": 7,
               "character": "John",
               "gender": 2,
               "credit_id": "5706d92e9251412b0900038a",
               "name": "Paul Higgins",
               "profile_path": "/tQfmzAHy7vc7wEZsS3XKyNrX0p0.jpg",
               "id": 71084,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Angie",
               "gender": 1,
               "credit_id": "587161d6925141355700d2ba",
               "name": "Julie Graham",
               "profile_path": "/tTHLCb74VfmsVafX9gAm2ZiZ0Vt.jpg",
               "id": 47735,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Keith",
               "gender": 2,
               "credit_id": "587161e4925141355900d89f",
               "name": "Simon Callow",
               "profile_path": "/pOABmGHa7h1CQ1oG4Q6PyuCbwqL.jpg",
               "id": 4001,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Terry",
               "gender": 2,
               "credit_id": "587161f2925141356900db65",
               "name": "Con O'Neill",
               "profile_path": "/4KNmOgl9o7y4D4guacJYvW7rOzF.jpg",
               "id": 96279,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Adam",
               "gender": 2,
               "credit_id": "58716208925141355900d8aa",
               "name": "Christopher Fulford",
               "profile_path": "/cwIbWnN0npv00ysuReNXyXxhGKR.jpg",
               "id": 6970,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "5706d87bc3a368651600040d",
               "name": "Rose Troche",
               "profile_path": "/qoIvZQukkKMlRef5NT9AjbiUh3J.jpg",
               "id": 172993,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5706d9a09251412b110003a7",
               "name": "Alfredo Troche",
               "profile_path": null,
               "id": 1602463,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.075686,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 40694,
      "vote_count": 13,
      "budget": 0,
      "overview": "At the suggestion of a friend, gay Leo (Kevin McKidd) enters therapy after many failed relationships make him fear for his social life. In a group session (led by Simon Callow), Leo comes clean about his feelings for a straight member of the group (James Purefoy), which leads to an affair between the two. The situation becomes further complicated by the appearance of Leo's high school sweetheart (Jennifer Ehle), who still has feelings for him.",
      "similar": [
         449176,
         184352,
         26280,
         10938,
         338189,
         413666,
         380874,
         47643,
         160165,
         26933,
         383526,
         258034,
         11421,
         26371,
         376867,
         4927,
         425193,
         428493,
         383559,
         52799
      ],
      "original_title": "Bedrooms and Hallways",
      "runtime": 96,
      "poster_path": "/7U8mT0R9GCwujbzBuL8s2Xs6XHC.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [{
         "logo_path": "/8T8OOQe3Xei2mW0DQepwQG1IMT0.png",
         "name": "StudioCanal",
         "id": 694,
         "origin_country": "FR"
      }],
      "release_date": "1998-08-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "Re-model Your Love Life.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Rose Troche"],
      "runtime": 96,
      "synopsis": null,
      "writers": ["Robert Farrar"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0126810/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1OTMxODA3M15BMl5BanBnXkFtZTcwMTY1MDE2MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin McKidd, Julie Graham, Simon Callow | See full cast and crew »"],
      "reviews": [
         "I found this film to be immensely enjoyable and entertaining until the last 20 minutes or so. At that point, it ran out of gas. The ending reminded me of awards show speeches in which the recipient is urged to \"wrap it up\" as the music swells behind him/her. The sudden pairing off of all the characters feels forced and lacks credibility. I felt quite let down.",
         "OK, I don't kid myself that this is the typical gay love life but since when are straight romances in real life as they are on the screen? This movie is well-balanced with comedy and drama and I thoroughly enjoyed myself. It was a riot to see Hugo Weaving play a sex-obsessed gay real estate salesman who uses his clients' houses for his trysts with the flaming Darren (Tom Hollander). And having seen him in Priscilla, Queen of the Desert only the day before, he is probably one of the most secure-in-their-masculinity actors around. :) Anyway, the plot flowed smoothly and the male-bonding scenes were a hoot. Thumbs up! 8/10",
         "This is a gentle romantic comedy about the diversity of human sexuality and in some ways not unlike an Ealing comedy with its friendly pokes at New Agers and estate agents. It was very well worth it alone though for the Jane Austen send up scene - handsome James Purefoy striding about in breeches saying 'I've been out all day whipping stable boys - would you like a whipping, boy' to footman Kevin McKidd who nearly orgasms on the spot. This is a bit of a cinematic in joke anyway as several of the cast (Purefoy, Ehle and Walter) have all starred in recent Austen adapataions. There are several belly laughs too - this is one for curling up with someone of the same or opposite sex, and having a cuddle and glass of wine whilst you enjoy it.",
         "Though I saw this movie dubbed in French, so I'm sure it lost something in the translation, lack of accents, etc., it was an excellent, fun movie for a lonely night in a hotel room--a real pick-me-up that portrayed accurately and positively the complexities of individual sexuality, gender role, and finding a place within the communities to which one is supposed to belong--male, gay, urban, 30-ish, etc. I was very proud of French television for showing such an honest and positive portrayal of the gay community. While the fact that the gay lead character ends up somewhat \"straight\" in the end is mildly disappointing, that's life, and that happens sometimes. This is a great movie, whether alone or with a date! A really enjoyable experience.",
         "Leo (Kevin McKidd), handsome, gay, and a bit vacuous, turns 30, still without a special someone in his life. His West London flatmates, the ragingly camp Darren (Tom Hollander) and liberated flight attendant Angie(Julie Graham) throw a surprise birthday party for him. Leo is mortified and retires to his room to watch TV - \"the place is full of people I don't want to see.\" We see why this is by way of flashback through the past few months of Leo's life. Highlights include some very funny scenes in a new age mens' encounter group facilitated with voyeuristic aplomb by Keith (Simon Callow), an affair with Brendan, a hunky Irish cafe owner (an unrecognisable James Purefoy), and reunion with an old female flame Sally (Jennifer Ehle). Tucked into this plotline are the sexual adventures of Darren and real estate agent Jeremy (a straight acting Hugo Weaving). Their scene is making love in the houses Jeremy has for sale while the owners are out, until one day an owner unexpectedly returns with Darren still handcuffed to the bedposts. Darren explains himself as an S & M a-gram sent to the wrong address. The theme of the film is gender bending. Sexual identity is not set in concrete and given the right circumstances and person many of us can swing between gay and straight. This is hardly an original insight but this film tackles the issue with zest and a great sense of fun. A highlight was the men's group back to the wilderness camp, where the men, having failed to find anything to eat in the forest, call up for Chinese takeaway on a mobile phone. A few things grate. Keith's wife (Harriet Walter), author of a book called \"The Obsolete Penis\" seems to have strayed in from another movie and Brendan looked a bit too disheveled to be the front man in a trendy cafe operation. Rose Troche, responsible for the rather didactic lesbian comedy \"Go Fish,\" directs with a much lighter touch here and takes full advantage of Robert Farrer's light hearted but occasionally poignant script. The tone is comedy rather than comic and we do care a bit at the end how it's going to work out for Leo, colourless as he is. Compared with a conventional romantic comedy like \"Notting Hill\" this film derives its tension from the unexpected rather than the inevitable, and gives the audience a lot more stimulation on the way. As for me, I'll never entrust the keys of my house to a real estate agent again.",
         "OK, so this film is well acted. It has good direction but the simple fact is that it undermines what all gay and lesbian people have been fighting for all these years. The straight man \"deciding to be gay\" and the gay man \"Deciding to be straight\" I did enjoy it up until the last 20 minutes, after that i got really offended. As what usually happens in these films the straight actors play the main parts and the out gay actors play the secondary straight roles. The leads are played by handsome men but don't let that distract you from the fact that this is a a film that leaves you feeling unfulfilled. All the romance and relationships you hope would happen do not. Unless you are a priest that is in which case god bless straight woman who cure our homos.",
         "Rose Troche introduced herself to us in 1994 with the small budget, pleasant lesbian love story called Go Fish which was set in the United States. Her very assured Bedrooms And Hallways moves its locale to urban England and follows the will I, won't I musings of Leo (Kevin McKidd). He's fallen for five o'clock shadowed Irishman Brendan (James Purefoy) but Leo fears he might have got himself into trouble. He's terrified of falling in love with a straight man. But is Brendan straight or gay or both? He's just come out of a long standing relationship with a woman. The two men meet at a men's s group run by a serious eyed and voiced Keith (Four Weddings and a Funeral's Simon Callow). It would seem that Rose Troche and her team find a lot that goes on at these groups to be pretty funny. There's much clasping of the \"honesty rock\" and a particularly apt solution to catering. Meanwhile the sexually unambiguous characters get their fair shake. The flag is flown strongly for all sexual inclinations. Very camp Darren (Tom Hollander) knows what he wants. He's having a great time with Jeremy a real estate agent played with terrific intensity by Australian actor Hugo Weaving. They sneak into people's houses which are on the market to have sex. Leo is wavering, he's showing some interest in women as well as in Brendan and Darren is incensed, expecting calls from the sex police. Meanwhile Angie and Sybil have no qualms about being happily heterosexual. But all remains fluid. Bedrooms and Hallways is a cheerful comedy romance with a homosexual bent. It gathers pace in its final third when, as in nearly all comedy romances, everyone finds a mate and/or a lover. There are plenty of laughs in what is a smart, impressive new movie from Rose Troche. Things have changed over the years in films. The boys and girls used to be nearly ten years younger in these sorts of comedies and we were used to them finding a life long, heterosexual partner in the final reel, to then live happily ever after. These days a three night trial liaison is probably more than can be expected, a situation which more suitably fits the thirty somethings these films are about.",
         "This is a thoroughly enjoyable, well-acted film. It is funny and sometimes hilarious. The finale is a bit disappointing, since it tries to wrap everything up into too neat a package. The film is better remembered for its priceless vignettes: the Jane Austen staging, the camping trip as examples. B & H does not attempt to mirror the predominant attitudes toward homosexuality and bisexuality. Most of the characters are quite accepting of sexual diversity. In that sense it is a joyous vacation from homophobic society. And it is a celebration of a flexibility, a loosening of rigid sexual categories--perhaps a happy harbinger of things to come.",
         "*Spoilers* I enjoyed this film, but for a reason many seem to be deriding. I found the idea of Leo's attraction to Sally very interesting, from the point that everyone has someone or something in their past that makes them think \"What if?\" Brendan, I felt was using Sally as a way of anchoring himself in 'normality', a safeguard in case the whole gay thing didn't work out. (Which is pointed out to him in the film, by a character I presume he later sleeps with.) I think Leo could be straight, at least for a while, but only with Sally, and eventually, she's going to get hurt. All in all, an enjoyable contrast to the usual generic RomCom fare",
         "The biggest tragedy surrounding this thoroughly delightful movie is its lack of U.S. distribution. I was fortunate enough to see this film at the Boston International Festival of Women's Cinema, and highly recommend it to anyone who gets a chance to see it. Terrific performances, and thoughtful script and great direction from the talented and funny Rose Troche all combine to make this film a winner!"
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "ARP Sélection",
         "British Broadcasting Corporation (BBC)",
         "Pandora Cinema"
      ],
      "summaries": [
         "Keith runs a male bonding group, which was meant to be macho fun, but acts as therapist as dreaded-unmanly emotional and even relational problems prove unavoidable. Openly gay Leo is delighted to find hunky, straight Brendan is a closet-bi and becomes his lover. Things risk ending ugly as it turns out Brendan's girlfriend is Leo's school ex and still able to seduce him.",
         "A man enters therapy after many failed relationships and is disconsolate about having any social life. In the group session, he comes clean about his feelings for another group member which leads to a homosexual affair. Then the situation is complicated by the re-union with his original high school sweetheart and the whole thing transcends into sexual ambiguity.",
         "At the suggestion of a straight friend, gay man Leo joins a men's group, where he causes some upsets by declaring his attraction to one of its members."
      ],
      "budget": 3000000
   },
   "movielensId": 2837,
   "movielens": {
      "languages": [
         "English",
         "Deutsch"
      ],
      "releaseDate": "1998-08-01",
      "dvdReleaseDate": "2000-08-22",
      "directors": ["Rose Troche"],
      "runtime": 96,
      "movieId": 2837,
      "title": "Bedrooms and Hallways",
      "mpaa": "",
      "actors": [
         "James Purefoy",
         "Harriet Walter",
         "Jennifer Ehle",
         "Kevin McKidd",
         "Tom Hollander",
         "Hugo Weaving",
         "Paul Higgins",
         "Julie Graham",
         "Simon Callow",
         "Con O'Neill",
         "Christopher Fulford"
      ],
      "imdbMovieId": "0126810",
      "originalTitle": "Bedrooms and Hallways",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "At the suggestion of a friend, gay Leo (Kevin McKidd) enters therapy after many failed relationships make him fear for his social life. In a group session (led by Simon Callow), Leo comes clean about his feelings for a straight member of the group (James Purefoy), which leads to an affair between the two. The situation becomes further complicated by the appearance of Leo's high school sweetheart (Jennifer Ehle), who still has feelings for him.",
      "tmdbMovieId": 40694,
      "avgRating": 3.33726,
      "releaseYear": "1998",
      "numRatings": 212,
      "posterPath": "/7U8mT0R9GCwujbzBuL8s2Xs6XHC.jpg"
   }
}