{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0157183",
      "video": false,
      "title": "West Beirut",
      "recommendations": [
         38880,
         86440,
         64835,
         30805,
         47200,
         67381,
         44281,
         54144,
         177579,
         26232,
         53103
      ],
      "backdrop_path": "/iLaILsqFnaafJ27MTL8WO2QzlR0.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Tarek Noueri",
               "gender": 0,
               "credit_id": "53bb0bb10e0a2619710000f3",
               "name": "Rami Doueiri",
               "profile_path": null,
               "id": 1338646,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "",
               "gender": 0,
               "credit_id": "53bb0bc00e0a261974000100",
               "name": "Naamar Sahli",
               "profile_path": null,
               "id": 1338647,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Omar",
               "gender": 0,
               "credit_id": "53bb0be20e0a26197800011e",
               "name": "Mohamad Chamas",
               "profile_path": null,
               "id": 1338648,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "May",
               "gender": 0,
               "credit_id": "53bb0bff0e0a26197c000110",
               "name": "Rola Al Amin",
               "profile_path": null,
               "id": 1338649,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Hala Noueri - Tarek's mother",
               "gender": 1,
               "credit_id": "53bb0c1c0e0a26196e000125",
               "name": "Carmen Lebbos",
               "profile_path": null,
               "id": 225883,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Riad Noueri - Tarek' father",
               "gender": 1,
               "credit_id": "53bb0c380e0a261978000133",
               "name": "Carmen Lebbos",
               "profile_path": null,
               "id": 225883,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Neighbor",
               "gender": 0,
               "credit_id": "53bb0c560e0a26197f0000f5",
               "name": "Liliane Nemri",
               "profile_path": null,
               "id": 1338650,
               "order": 7
            },
            {
               "cast_id": 9,
               "character": "Oum Walid - the madame",
               "gender": 0,
               "credit_id": "53bb0c830e0a261978000146",
               "name": "Leïla Karam",
               "profile_path": null,
               "id": 1338651,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Hassan - the baker",
               "gender": 0,
               "credit_id": "53bb0c9a0e0a26196b000144",
               "name": "Mahmoud Mabsout",
               "profile_path": null,
               "id": 1338652,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Roadblock Militiaman",
               "gender": 0,
               "credit_id": "53bb0caf0e0a26197400012d",
               "name": "Hassan Farhat",
               "profile_path": null,
               "id": 1338653,
               "order": 10
            },
            {
               "cast_id": 12,
               "character": "Bakery Militiaman",
               "gender": 0,
               "credit_id": "53bb0cc40e0a26197800015a",
               "name": "Fadi Abou Khalil",
               "profile_path": null,
               "id": 1338654,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4789c3a36847f813b17d",
               "name": "Ziad Doueiri",
               "profile_path": "/pBApkpVNsR4V8UaG6S9xLMKfWKn.jpg",
               "id": 148455,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "53bb187bc3a368661e0001dc",
               "name": "Ziad Doueiri",
               "profile_path": "/pBApkpVNsR4V8UaG6S9xLMKfWKn.jpg",
               "id": 148455,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 0.564084,
      "production_countries": [
         {
            "iso_3166_1": "LB",
            "name": "Lebanon"
         },
         {
            "iso_3166_1": "BE",
            "name": "Belgium"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "NO",
            "name": "Norway"
         }
      ],
      "id": 49184,
      "vote_count": 7,
      "budget": 0,
      "overview": "In April, 1975, civil war breaks out; Beirut is partitioned along a Moslem-Christian line. Tarek is in high school, making Super 8 movies with his friend, Omar. At first the war is a lark: school has closed, the violence is fascinating, getting from West to East is a game. His mother wants to leave; his father refuses. Tarek spends time with May, a Christian, orphaned and living in his building. By accident, Tarek goes to an infamous brothel in the war-torn Olive Quarter, meeting its legendary madam, Oum Walid. He then takes Omar and May there using her underwear as a white flag for safe passage. Family tensions rise. As he comes of age, the war moves inexorably from adventure to tragedy.",
      "similar": [],
      "original_title": "West Beyrouth",
      "runtime": 105,
      "poster_path": "/mevHjimIVDlQEPYlYnYNmUNYrdh.jpg",
      "spoken_languages": [
         {
            "name": "العربية",
            "iso_639_1": "ar"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Radio Télévision Belge Francophone",
            "id": 792,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Exposed Film Productions AS",
            "id": 5006,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Norsk Rikskringkasting (NRK)",
            "id": 5404,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ministère de la Culture de la Republique Française",
            "id": 11694,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "La Sept ARTE",
            "id": 19136,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Douri Films",
            "id": 26890,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ciné Libre",
            "id": 84496,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "ACCI",
            "id": 88165,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "38 Productions",
            "id": 88166,
            "origin_country": ""
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-09-01",
      "vote_average": 8.3,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": null,
      "budgetCurrency": "$",
      "directors": ["Ziad Doueiri"],
      "runtime": 105,
      "synopsis": null,
      "writers": ["Ziad Doueiri"],
      "originalLanguage": "Arabic",
      "imdbLink": "http://www.imdb.com/title/tt0157183/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc2ODQ3Mzk5Nl5BMl5BanBnXkFtZTYwMzM0MTk5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rami Doueiri, Naamar Sahli, Mohamad Chamas | See full cast and crew »"],
      "reviews": [
         "i have seen this movie, and i am a Lebanese. this movie is an alienation of history and is in no way related to the historical course that the Lebanese war took. it is not recommended to build a view of the Lebanese war, based on this movie. it describes the beginning of the war in a unilateral point of view and is one-sided. too bad the director couldn't make a better movie with the good plot he had. more historical reviews and interviewing many still-alive witnesses would have helped. the Lebanese haven't yet produced a movie about the war that meets their expectations, and the mere fact that the issue of the war is not yet solved amongst different communities make sit difficult to produce a movie about it now.",
         "\"West Beirut\" is a plotless, non-story, non-documentary, meandering slice-of-life flick about a teenage boy's life in the early days of the Lebanese civil war when Beirut became divided into East and West. Although the film examines Beirut civilian life under the pall of war, it doesn't deal with any specific issue sufficiently to give it purpose. It's not particularly entertaining, evocative, or compelling; does not chronicle events well; is a poor study in history; and is void of romance, mayhem, comedy, suspense, or any of the things which people go to movies to see. \"West Beirut\" has the \"feel\" of a make-it-up-as-you-go low budget journeyman drama. Recommended only for those with special interest in Lebanon.",
         "It will not be the last film on the Lebanese war that you'll ever see, because the industry is just getting on its feet, but it is most certainly the most selfcentered of all. It depicts the somehow distorted facts of the life of one Ziad El-Doueiri(the director) in an attempt to show you all fine people what is the Lebanese war. It is far more complicated than this simplified version of it. Even we cannot figure it yet. Let talk about the film itself. The script is pathetic, there is no story, it seems to me like a student film with a little more of a budget (gee man, I wanna a bus and a lot of machine guns and I want them to go boom, so please can we do that?) with no real ending. The dialogs are simple, no real one anyways, just a little bit of statements and a lot of shouting from a character. But in this nightmare, some scenes are worth it, like the bicycle scene and the underwear scene. Better yet, and in defense of this film, I must say that it is an overall \"chemin initiatique\" for the boys, and this we understand very clearly. But if you noticed my use of the term \"film\" and not \"movie\" to indicate the subject, it's because in no way good or bad, this film can be rated a movie, for its lack of entertaining and logic. All in all, it's an over-rated, distorted events piece of film. And what bother me most, is that some of the Lebanese viewers found it very bad, but very good for Lebanese industry. Though it's tragically true, it also very pathetic. Well, let's hope for the best, in the best of worlds possible.",
         "Far from a great movie, but definitely an education. Sometimes I think that I have lived so long in this age of mass visual communication that my experience of, thankfully remote, horrors is endless. The depressing adult world depicted here is a generation away and my memory contains only occasional headlines. This despite \"Beirut\" having entered into common parlance as a metaphor for the dereliction and deprivation often evident in our poorer and less socially minded council estates. Ziad Doueiri's film cleverly interweaves the facts with the emotions of ordinary people and the result deserves a round of applause if not a standing ovation. Film review over. Technology review. Did I ever in my wildest dreams of the mid-seventies imagine that I would share such a global platform as this with the likes of many of the commenters below me? For them this movie must be all too real. Nice one guys. Rave on Internet. Rave on IMDB. Ron",
         "Thank God for IFC and the Sundance Channel here in the U.S. Without these two channels, there are so many films that I otherwise would never have known about less alone actually watched: especially living in the heart of Los Angeles, Studio Capital of the World. I was lucky enough though to stumble upon West Beirut and I just fell in love with it. Somebody in the user comments section said that it was \"a very beautiful and funny film if you are arabic\", but I'd have to strongly disagree because as a westerner and and an american I found it perhaps even more funny and beautiful as a result of where I come from. Not to get into politics, but it's kind of hard not to, it is so refreshing and wonderful and eye opening to see a film with arab characters in their homeland living their lives the way they really did and would instead of only knowing that part of the world from the violence that is constantly strewn about on the evening news and the constant 'propaganda machine' of american media which seems to be totally controlled and run nowadays by corporations and pharmaceutical companies. This movie, for me, just reinforced the idea that we are all alike no matter where we live on this planet and I find it sad to think that the only way I have to find out and appreciate a history lesson on Beirut or the life of the lebanese is through a film. Being an american, if you listen to our government at all, it would be a really bad idea to travel to the middle east. And so without films like this, it would be impossible for me to experience the oneness of all of us or a glimpse of a country and it's culture. What a beautiful idea it would be to cut out the Bush administration and all the other governments for a month out of the year and allow everyone from each country to go and look at the other side. I think we'd all benefit strongly. Until then, I'll thank movies like West Beirut for being made and allowing me the luxury of being part of another world for a couple of hours. A great film.",
         "Outstanding filmmaking and accurate description of the state of mind that people were in during the Lebanese civil war. There was one distortion of facts though; The bus featured at the beginning of the film was not full of civilians, it was filled with terrorists from the Palestine liberation organization, I did not appreciate the deliberate distortion of history.",
         "I was glad to have seen this film, since it showed me a part of the world that I have never seen in such detail before. And despite having no first-hand knowledge of the country, I nonetheless felt there was an authenticity and sincerity about the film that appealed to me. I have heard that there are some inaccurate details, but \"West Beyrouth\" does not presume to explain any of the larger historical or political events. Rather, it wishes to communicate something of the experience of living in a world being torn apart by forces that can seem nearly incomprehensible by those caught between them. And in that goal, I felt the film enjoyed some success. I was interested by all the characters as they were introduced, but as the film progresses most of them wind up going in circles, repeating themselves, or just standing idly by. The story, which starts out effectively, loses its narrative drive, and things muddle ahead until eventually the movie is over. I thought it was a shame that a film that so vividly evoked a place and time, could not offer a story of similar strength. The performances are good, though, and there is some fine music by Stewart Copeland as well. \"West Beyrouth\" may function better as a glimpse into history than as an engrossing cinematic work, but I still felt it to be worthwhile viewing.",
         "In 1974's Beirut Tarek is a normal kid \u0096 making Super 8 movies, hanging out with friend Omar and getting in trouble at school. Conflicts are fun distractions and even when civil war proper erupts between Muslims and Christians, it is all still a bit of a game to Tarek, giving him time off school and interesting things to see. However with the city split in two, Tarek's mother wants to leave but his father insists they will be fine to stay. Meanwhile Tarek befriends May, a Christian girl living in his building; but as the conflict deepens tensions rise and the war becomes less of a game and more of a tragedy. I am usually interested in films that draw on personal experience because sometimes they can be very enjoyable and interesting and I accept the risk that some will be so personal that the director/writer loses sight of what he is doing and will make a film that doesn't translate well to those without the same degree of personal insight. So with West Beyrouth I was interested enough already and wasn't coming to it as some of the Tarantino completest that seem to have seen it. The film deals with a time and a place that I will not claim to fully understand or even know that much about \u0096 I have always been more interesting in political/religious wars that are closer to home for me than in the complexities of the Middle East etc but this film doesn't concern itself with making points; it is more about growing up during this time. As such I felt it missed out on a chance to provide a wider understanding, although it did open the doors for a more personal view of the conflict. As the latter the film does work pretty well as I can't really think of another \"coming-of-age\" story set in such a place. The problem with it though is that, like a \"you had to be there\" joke, it doesn't totally translate to the screen in terms of being an engaging narrative. Yes, the period and place are very well delivered and the direction is blessed with real experience but the story didn't draw me in and it did feel like a collection of personal memories, strung together the best they could have been but not really that good a story. The cast are also pretty mixed. The director's own brother, Rami, is quite good in the lead but he is more \"in\" the scenes rather than being of great interest himself \u0096 or rather, I didn't feel he enabled me to emotionally buy into the film. Al Amin is gorgeous and seems a lot more natural, shame the film didn't use her more. Chamas was selected for the role after picking a fight with the crew and he is generally good enough to do the job, but for large sections it does feel like he is trying too hard and maybe overdoing his delivery. Supporting roles are all OK but these three were the key and they were generally OK if not anything wonderful. Overall this is an OK film that is an interesting enough look at the conflict from the point of view of trying to grow up in it. The direction is good and has a personal touch along with a good eye for time and place but as writer Doueiri isn't as confident and his collection of memories don't manage to come together in an engaging narrative. Worth watching once if you're after a \"teen\" film that is different from the usual US collection of jocks and nerds, but not a completely satisfying film on the whole.",
         "Well you certainly don't become an expert on Late 20th century Lebanese politics by watching this movie. But for those of us with an outside interest and a yawning gap of understanding and knowledge, this movie is superb \"edutainment\". It both educates and entertains. The transition of the civil war through the eyes of these youngsters, as the movie goes on is moving. It starts off more or less as an adventure. It takes time to dawn on the characters that the civil war is tearing their lives apart. The family debates about whether to stay or go are very moving. We know many people in the Lebanese community here in the UK, many of them (or their parents) must have gone through those heart-wrenching decisions back then. The \"romance\" between the Muslim boy(s) and the Christian girl is also moving. It avoids the trap of descending into a Levantine Romeo & Juliet, however it seems a shame that the girl seems to just drift out of the story-line just at the point that we are all falling in love with her! See it, it will be worth it.",
         "When making a film about divisive national conflicts, a familiar device is to frame the historical subject matter in a rites-of-passage narrative. This device produces a number of effects - a contrast between life as the audience knows it, and a historical reality they do not; by following a child's awakening, growing experience and knowledge of the world, it can reveal history and war as a lived experience, and not as something isolated in a textbook; it can show the progress of history as a kind of fall from innocence, as if any child's entering adulthood forces him to acknowledge shocking truths that are merely intensified in a war situation. 'West Beirut' tells the tale of Tarek, a gawky, humungously hootered smart aleck and class clown whom we first see disrupting assembly by blaring Lebanese over a megaphone during 'La Marseillaise'. For some reason, his liberal-left parents have sent him to a French school - this is the first historical nuance the viewer is expected to pick up on: if s/he doesn't, tough. These opening sequences, messing about with his cousin Omar at school, furtively smoking and staring at attractive relatives, winding up obese neighbours, have something of the freewheeling joy found in a contemporaneous film about adolescence ('West Beirut' is set in 1975), Louis Malle's 'Murmur of the Heart'. Except, even at this stage, everything is fraught, riven by division - the two languages Tarek speaks, the different religions among whom he co-exists; the different levels of space he inhabits. When he is punished and thrown out of class for disrupting the anthem, he witnesses the beginning of war, the shooting of the passengers on a bus. Again, we are expected to know which side is which, what they're fighting for etc. The main thing is, Tharek's expulsion and the beginning of the war seem to be intimately mixed, almost as if his transgression caused it; and so beings a pattern that shapes the film. Everything you would expect from a rites-of-passage film is here, but tainted by the war environment - Tarek's first girlfriend is a Christian, making him aware of religious bigotry; his accidental visit to a brothel, his first sexual experience, brings alive to him the division of his city - it's always the subculture that suffers in situations like this. 1970s Lebanon is surprisingly Westernised and liberal, but a general retrenchment occurs, and Omar is expected to go to Mosque. It suddenly becomes dangerous to know the 'wrong' people, and the pressure of this division extends beyond friends into the family itself, between a pride that refuses to be bullied (Tarek's father), and a fear that just wants to get out (his mother). One of the great things about this film is the way it brings you into a war situation - like us, the characters don't really know what's happening, they have no context - this is random, present-tense, frightening, where the morning cock crow is replaced by bombs as an alarm clock; where military 'protection' is no different from gangsterism. Doueiri's handheld style, used initially to heighten the vividness of youth, can easily adapt to the urgency of war, flitting between the two. The film never betrays either, never suggests childish games are somehow less important. Omar is a young filmmaker, filming his friends and the city around him. One subplot centres around a film developer on the other side of the city border. A recurrent motif is of looking, being a voyeur, getting to know the world through accessing and interpreting visual information. This may be a biographical portrait of the director as a Young Artist. But, in its modest way, 'West Beirut' performs the same function as Nabokov's 'Speak Memory', using memory, nostalgia, autobiography, not as a comfy escape, but as an artistic weapon against a totalitarian present."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "38 Productions",
         "ACCI",
         "Centre National de la Cinématographie (CNC)"
      ],
      "summaries": ["In April, 1975, civil war breaks out; Beirut is partitioned along a Moslem-Christian line. Tarek is in high school, making Super 8 movies with his friend, Omar. At first the war is a lark: school has closed, the violence is fascinating, getting from West to East is a game. His mother wants to leave; his father refuses. Tarek spends time with May, a Christian, orphaned and living in his building. By accident, Tarek goes to an infamous brothel in the war-torn Olive Quarter, meeting its legendary madam, Oum Walid. He then takes Omar and May there using her underwear as a white flag for safe passage. Family tensions rise. As he comes of age, the war moves inexorably from adventure to tragedy."],
      "budget": 800000
   },
   "movielensId": 2839,
   "movielens": {
      "languages": [
         "العربية",
         "Français"
      ],
      "releaseDate": "1998-09-01",
      "dvdReleaseDate": null,
      "directors": ["Ziad Doueiri"],
      "runtime": 105,
      "movieId": 2839,
      "title": "West Beirut",
      "mpaa": null,
      "actors": [
         "Rami Doueiri",
         "Naamar Sahli",
         "Mohamad Chamas",
         "Rola Al Amin",
         "Carmen Lebbos",
         "Carmen Lebbos",
         "Liliane Nemri",
         "Leïla Karam",
         "Mahmoud Mabsout",
         "Hassan Farhat",
         "Fadi Abou Khalil"
      ],
      "imdbMovieId": "0157183",
      "originalTitle": "West Beyrouth",
      "genres": [
         "Romance",
         "Drama",
         "Comedy"
      ],
      "youtubeTrailerIds": ["Rbk-kzR3qiY"],
      "plotSummary": "In April, 1975, civil war breaks out; Beirut is partitioned along a Moslem-Christian line. Tarek is in high school, making Super 8 movies with his friend, Omar. At first the war is a lark: school has closed, the violence is fascinating, getting from West to East is a game. His mother wants to leave; his father refuses. Tarek spends time with May, a Christian, orphaned and living in his building. By accident, Tarek goes to an infamous brothel in the war-torn Olive Quarter, meeting its legendary madam, Oum Walid. He then takes Omar and May there using her underwear as a white flag for safe passage. Family tensions rise. As he comes of age, the war moves inexorably from adventure to tragedy.",
      "tmdbMovieId": 49184,
      "avgRating": 3.72791,
      "releaseYear": "1998",
      "numRatings": 215,
      "posterPath": "/mevHjimIVDlQEPYlYnYNmUNYrdh.jpg"
   }
}