{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0117169",
      "video": false,
      "title": "New York Cop",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Toshi",
               "gender": 0,
               "credit_id": "52fe4abdc3a36847f81df2ef",
               "name": "Toru Nakamura",
               "profile_path": "/gWoWSRKhnf5EPwQxbAMKFfZDeHT.jpg",
               "id": 74195,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Hawk",
               "gender": 2,
               "credit_id": "52fe4abdc3a36847f81df2f3",
               "name": "Chad McQueen",
               "profile_path": "/bQxqP7npaJTSxhsNoaEllaYypwa.jpg",
               "id": 23920,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Maria",
               "gender": 1,
               "credit_id": "52fe4abdc3a36847f81df2f7",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Konen Li",
               "gender": 2,
               "credit_id": "52fe4abdc3a36847f81df2fb",
               "name": "Conan Lee",
               "profile_path": "/xAE76Nkhyqu7BLLTwz4z7w7kcRq.jpg",
               "id": 26783,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Ferrara",
               "gender": 2,
               "credit_id": "59d1eb9fc3a3687916038d34",
               "name": "Andreas Katsulas",
               "profile_path": "/z1bbvx6O7VWGrtxCFugo5aCyqMS.jpg",
               "id": 43773,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Mr. C",
               "gender": 2,
               "credit_id": "59d1eba7925141143303c2c2",
               "name": "Tony Sirico",
               "profile_path": "/fRMfKSHLqmzepAaZjZjCtSHYvFg.jpg",
               "id": 21385,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Tito",
               "gender": 2,
               "credit_id": "59d1ebaf92514113ef03c66e",
               "name": "Manny Pérez",
               "profile_path": "/hIM6huonhBNgxwfKc7t23pW60Ns.jpg",
               "id": 72983,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mario",
               "gender": 2,
               "credit_id": "59d1ebb8925141143303c2de",
               "name": "Jon Seda",
               "profile_path": "/zYDXb5F4IyzuODWSuGa2mLU8HMz.jpg",
               "id": 288,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Sledge",
               "gender": 2,
               "credit_id": "59d1ebc3c3a36878c9039f4d",
               "name": "Manny Siverio",
               "profile_path": null,
               "id": 4438,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Emilio",
               "gender": 2,
               "credit_id": "59d1ebcec3a36878c9039f61",
               "name": "Larry Romano",
               "profile_path": "/5oWKhp3sos6MWdF6n8H6X5oU8b0.jpg",
               "id": 61233,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Powell",
               "gender": 2,
               "credit_id": "59d1ebd792514113eb03a8da",
               "name": "Eric Lutes",
               "profile_path": "/dWSKOCf5x6fGZBIh1HiSPAQpL0B.jpg",
               "id": 134083,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Babes",
               "gender": 0,
               "credit_id": "59d1ebed925141468f031cb6",
               "name": "Theresa Lynn",
               "profile_path": "/teNfOifiK75KHLtdeaBKEQQlM4V.jpg",
               "id": 185529,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Man in Porno Shop",
               "gender": 0,
               "credit_id": "59d1ebfb925141144803af5d",
               "name": "Cliff Cudney",
               "profile_path": null,
               "id": 1437861,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Biker Dirty Joe",
               "gender": 0,
               "credit_id": "59d1ec05c3a36878d7037f71",
               "name": "Vic Noto",
               "profile_path": null,
               "id": 88447,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "54d5d7909251416b93001949",
               "name": "Tōru Murakawa",
               "profile_path": null,
               "id": 129957,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "54aa27ef9251415679000cf3",
               "name": "Hiroshi Kashiwabara",
               "profile_path": null,
               "id": 66156,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "54aa27fa9251415646000cf5",
               "name": "Jiro Ueno",
               "profile_path": null,
               "id": 1409109,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 0.001018,
      "production_countries": [
         {
            "iso_3166_1": "JP",
            "name": "Japan"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 109560,
      "vote_count": 0,
      "budget": 0,
      "overview": "Allegedly based on a true story, this film follows the life of Toshi, a Japanese man living in America and working with the New York City police. After being recommended for undercover work, Toshi decides to go after a gang lead by Hawk. Hawk and Toshi soon become friends, although Hawk's second-in-command, Tito, is suspicious of the newcomer. Will Toshi be able to bring the gang down, or will his cover be blown before he can finish the assignment?",
      "similar": [],
      "original_title": "New York Cop",
      "runtime": 93,
      "poster_path": "/5kXO783UrTaKZE3wn0KZv3RubZc.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "广州话 / 廣州話",
            "iso_639_1": "cn"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Distant Justice Joint Venture",
            "id": 42935,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "TOEI",
            "id": 7260,
            "origin_country": ""
         }
      ],
      "release_date": "1993-08-14",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "The toughest city in the world deserves the toughest cop.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tôru Murakawa"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "Hiroshi Kashiwabara",
         "Jiro Ueno"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0117169/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQxNDY0MjMxOV5BMl5BanBnXkFtZTYwNzg3NjA5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Tôru Nakamura, Chad McQueen, Mira Sorvino | See full cast and crew »"],
      "reviews": [
         "This movie, \"New York Cop\" has nothing particularly new to offer genre fans, but the story, despite its' familiarity, is engrossing. It is refreshing to see a cop movie with actors you don't necessarily recognize, so as to create a more authentic atmosphere in a sense (not to say that the acting was great). A cop struggles with gangsters and partners and loyalty, which is typical, but the action sequences in the film are tense and exciting. Mira Sorvino is in this film, which is interesting to see given the direction her career took, although she plays nothing but a novel role here. Still a good cop film.",
         "***SPOILERS*** Gritty and realistic New York City photography and tough guy Chad McQueen's, Hawk, sensitive and protective feelings towards his kid sister Maria,Mira Sorvino. Hawk in the film is not just the only non-Hispanic member of an all-Latin street gang \"The Brotherhood\" but it's leader as well! The hero in the movie Toshi, Toru Nakamura, as an undercover cop in Manhattans crime ridden East Village is so bad in trying to speak the English language that you have to wait and hear the people he's talking to answer him! Thats about the only way you can figure out just what he's talking about. Toshi's boss Capt. Brodsky, Steve Boles, comes across as the most clueless person in the movie. Capt. Brodsky not only placing the Japanese-American cop in the mostly Hispanic East Village, where he sticks out like a sushi chef in an Italian pizzeria. Toshi goes around the poor and burnt-out neighborhood undercover in expensive designer cloths and smells, from slapping on his face, of exotic and imported colognes. After getting into a altercation with a number of \"The Brotherhood\" gang members Toshi ends up getting rescued by \"The Brotherhood's\" leader Hawk's sister Maria. After having a few words with Toshi, when he found him at Maria's place the next morning, Hawk invites him to join his organization after Toshi can show him how tough he is. Going to the local biker clubhouse to collect money that they owe Hawk Toshi catches the biker's head man in bed ,getting it on with his woman, and after he tries to attack him Toshi has him bloodied and dangling from a four story window. Toshi now a respected member of the gang get's in touch with his contacts in the police department in tracking down their gun running activities for the NYC Mafia. Capt. Brodsky letting not only Toshi in on what's going down and where to be when the big shipment of guns come in he unknowingly tips the mob off with his private secretary in the NYPD Marge,Suzanne Tino, being the mob boss' Mr. C, Tony Siverio, main squeeze. The movie \"New York Cop\" also has one of the most obnoxious hit-men in gangster film history with Ferrara, Andreas Katsulas. Ferrara drives around in a taxi cab, actually picking up costumers between hit's, gunning down all of Capt. Brodosky's undercover men. Hawk's second in command Tito, Manny Perez, always felt that Toshi was working undercover for the cops. After a blotched meeting and gun exchange with a local Brooklyn street gang when not only did the local homeboys try to rip off \"The Brotherhood\" but the police just happened to show up unannounced convinced Tito that his suspicions about Toshi were right. Hawk for some reason didn't go along with Tito wanting to whack Toshi since he earlier got mixed singles from Mr.C himself about the undercover cops. It seemed that his police secretary girlfriend Marge was out to lunch when Capt. Brodsky was on the phone with Toshi.The usual underling taking over from his brainless boss scene then follows with Tito blasting Hawk and again Toshi taking off and escaping, this time in handcuffs. Finally confronting Mr.C & Co, together with the off-the-wall hit-man Ferrara Toshi in a one man demolition squad and shoot-out puts an end to them as well as this whole unbelievable movie. \"New York Cop\" is nowhere as bad as you would have though it would be after watching it for the first ten minutes or so. The movie really picks up later and becomes a pretty good cop/action/thriller when you start not to try to understand what exactly Toshi is saying. The mumbling line that Toshi delivers after he blasts Ferrara away would even make Clint Eastwood's Dirty Harry blush.",
         "Nyû Yôku No Koppu (New York Cop) 3/10: The generically named New York Cop is a run of the mill undercover cop story taking place in early nineties New York City back when the lower east side still had crime, drugs and ethnically diverse homeless. Filmed on location this Japanese production has a decent enough action, a plot (that while certainly muddled) moves along nicely and that whacky over the top Japanese racism that cracks me up every time. In fact it is at times as insane as an Italian exploitation film such as Escape from the Bronx. (Hillbilly rednecks in Manhattan? Staten Island I could believe but the Meatpacking district?) It does have one fatal flaw however. It stars Tôru Nakamura. Toru doesn’t speak English well. In fact he really doesn’t speak at all. To cover the fact he really doesn’t speak at all. He instead makes those noises that the teachers in the Peanuts cartoons used to make. And to cover up that fact he speaks at such a low volume you will be straining to hear a word. This isn’t always fatal to a film. I’ve seen dozen of badly dubbed European exploitation films where a character or two is unintelligible. But Toru is in almost every bloody scene and it becomes irritating quickly. Now you may defend him by admitting that not every kung-fu cop can be Jackie Chan. This of course is a fair argument if Jackie Chan wasn’t already in the film with a small role. In fact the rest of the cast is so above board one wonders if the lead cardboard cutout isn’t somebody’s nephew or something. Along with Jackie Chan is Mira Sorvino as the love interest with the Eighties hair and sweater. Tony Sirico (Paulie from the Sopranos) as the Mob guy: Relative unknown Chad McQueen (Who easily gives the best performance in the film) as the “good guy” gang leader and Sorvino’s overprotective brother. Hell it even has a decent run by Andreas Katsulas (The one armed guy in the Harrison Ford version of the Fugitive) If they had given Chan the lead role and tighten the story a little bit this could have worked. Of course if you are going to go to the trouble of making a good movie you might want to jettison the Serpico reject undercover cop, the horrible musical soundtrack during the Sorvino sex scene, and the Dukes of Hazard rejects gang. I was in the Lower east side of New York in the early nineties and I still don’t recall any large group of hillbillies flying confederate flags."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama"
      ],
      "productionCompanies": [
         "Distant Justice Joint Venture",
         "S.T.P. International Inc.",
         "TOEI & Sunstripe Pictures Inc."
      ],
      "summaries": ["Allegedly based on a true story, this film follows the life of Toshi, a Japanese man living in America and working with the New York City police. After being recommended for undercover work, Toshi decides to go after a gang lead by Hawk. Hawk and Toshi soon become friends, although Hawk's second-in-command, Tito, is suspicious of the newcomer. Will Toshi be able to bring the gang down, or will his cover be blown before he can finish the assignment?"],
      "budget": 0
   },
   "movielensId": 284,
   "movielens": {
      "languages": [
         "English",
         "广州话 / 廣州話"
      ],
      "releaseDate": "1993-08-14",
      "dvdReleaseDate": "2004-05-25",
      "directors": ["Tōru Murakawa"],
      "runtime": 93,
      "movieId": 284,
      "title": "New York Cop",
      "mpaa": null,
      "actors": [
         "Toru Nakamura",
         "Chad McQueen",
         "Mira Sorvino",
         "Conan Lee",
         "Andreas Katsulas",
         "Tony Sirico",
         "Manny Pérez",
         "Jon Seda",
         "Manny Siverio",
         "Larry Romano",
         "Eric Lutes",
         "Theresa Lynn",
         "Cliff Cudney",
         "Vic Noto"
      ],
      "imdbMovieId": "0117169",
      "originalTitle": "New York Cop",
      "genres": [
         "Action",
         "Thriller",
         "Crime",
         "Drama"
      ],
      "youtubeTrailerIds": ["AcJamsBwsPM"],
      "plotSummary": "Allegedly based on a true story, this film follows the life of Toshi, a Japanese man living in America and working with the New York City police. After being recommended for undercover work, Toshi decides to go after a gang lead by Hawk. Hawk and Toshi soon become friends, although Hawk's second-in-command, Tito, is suspicious of the newcomer. Will Toshi be able to bring the gang down, or will his cover be blown before he can finish the assignment?",
      "tmdbMovieId": 109560,
      "avgRating": 2.8,
      "releaseYear": "1993",
      "numRatings": 40,
      "posterPath": "/5kXO783UrTaKZE3wn0KZv3RubZc.jpg"
   }
}