{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cemetery",
            "id": 1227
         },
         {
            "name": "secret",
            "id": 1328
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "paranoia",
            "id": 2340
         },
         {
            "name": "grave",
            "id": 2968
         },
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "hypnosis",
            "id": 3363
         },
         {
            "name": "tools",
            "id": 6100
         },
         {
            "name": "clairvoyance",
            "id": 9681
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "disappearance",
            "id": 10941
         },
         {
            "name": "psychic",
            "id": 14742
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "neighborhood",
            "id": 180523
         },
         {
            "name": "repressed memory",
            "id": 184987
         },
         {
            "name": "hearing voices",
            "id": 227655
         }
      ],
      "imdb_id": "tt0164181",
      "video": false,
      "title": "Stir of Echoes",
      "recommendations": [
         2637,
         12149,
         10972,
         10212,
         1551,
         1073,
         9276,
         10307,
         9877,
         8843,
         9529,
         2163,
         10894,
         11804,
         2655,
         12590,
         11427,
         2291,
         2046,
         12103
      ],
      "backdrop_path": "/kwdmLQgWOmx9oXDpC6KwA2YJOFC.jpg",
      "revenue": 21133087,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 9,
               "character": "Tom Witzky",
               "gender": 2,
               "credit_id": "52fe44659251416c75033317",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Maggie Witzky",
               "gender": 1,
               "credit_id": "52fe44659251416c7503331b",
               "name": "Kathryn Erbe",
               "profile_path": "/eB6H3pSImCJLBq83eH3oy8s9yrL.jpg",
               "id": 49824,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Lisa Weil",
               "gender": 1,
               "credit_id": "52fe44659251416c7503331f",
               "name": "Illeana Douglas",
               "profile_path": "/w2O2SOXzwtJu9eytb3hGS7T8ftR.jpg",
               "id": 7796,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Frank McCarthy",
               "gender": 0,
               "credit_id": "52fe44659251416c75033329",
               "name": "Kevin Dunn",
               "profile_path": "/85thH2pUn2tPP97QhnYQI7MBiCW.jpg",
               "id": 14721,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Harry Damon",
               "gender": 2,
               "credit_id": "52fe44659251416c7503332d",
               "name": "Conor O'Farrell",
               "profile_path": "/ieA8GBJTx0vGmZ0bcDvTOxYAIa0.jpg",
               "id": 119521,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Sheila McCarthy",
               "gender": 1,
               "credit_id": "52fe44659251416c75033331",
               "name": "Lusia Strus",
               "profile_path": "/qbXs16CG5qIyEc2CSfigwZSxDte.jpg",
               "id": 19293,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Jake Witzky",
               "gender": 0,
               "credit_id": "52fe44659251416c75033313",
               "name": "Zachary David Cope",
               "profile_path": "/aCnDhbD47OcfKGYaMOeA8zHAOUs.jpg",
               "id": 69979,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Bobby",
               "gender": 0,
               "credit_id": "52fe44659251416c75033335",
               "name": "Stephen Eugene Walker",
               "profile_path": null,
               "id": 1060579,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Vanessa Damon",
               "gender": 0,
               "credit_id": "52fe44659251416c75033339",
               "name": "Mary Kay Cook",
               "profile_path": null,
               "id": 191611,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Lenny",
               "gender": 2,
               "credit_id": "52fe44659251416c7503333d",
               "name": "Larry Neumann Jr.",
               "profile_path": "/wn6Ji5i1NoDVJjw3gCfzDIkGk4j.jpg",
               "id": 946311,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Samantha Kozac",
               "gender": 1,
               "credit_id": "52fe44659251416c75033341",
               "name": "Jennifer Morrison",
               "profile_path": "/sqn3ySCTYw82vtW10oqrmtg3B9L.jpg",
               "id": 41421,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Debbie Kozac",
               "gender": 1,
               "credit_id": "5803035a9251413db3002d43",
               "name": "Liza Weil",
               "profile_path": "/7CG2MTcP37fhgJyGztHLK6rGpq6.jpg",
               "id": 55546,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44659251416c750332eb",
               "name": "David Koepp",
               "profile_path": "/3A7kfyMXaVjGcSbGdRD25msbHcj.jpg",
               "id": 508,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44659251416c750332f1",
               "name": "David Koepp",
               "profile_path": "/3A7kfyMXaVjGcSbGdRD25msbHcj.jpg",
               "id": 508,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe44659251416c750332f7",
               "name": "Judy Hofflund",
               "profile_path": null,
               "id": 37926,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44659251416c750332fd",
               "name": "Gavin Polone",
               "profile_path": null,
               "id": 35974,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44659251416c75033303",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44659251416c75033309",
               "name": "Fred Murphy",
               "profile_path": "/oLzSw5wj6X3H5FYIQuXruf8TkaW.jpg",
               "id": 17765,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe44659251416c7503330f",
               "name": "Jill Savitt",
               "profile_path": null,
               "id": 17766,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44659251416c75033325",
               "name": "Richard Matheson",
               "profile_path": "/qpcAG1Rpic5EWY8LMPN3e1R6TKs.jpg",
               "id": 12415,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 8.495905,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11601,
      "vote_count": 412,
      "budget": 12000000,
      "overview": "After being hypnotized by his sister in law, Tom Witzky begins seeing haunting visions of a girl's ghost and a mystery begins to unfold around her.",
      "similar": [
         8834,
         2654,
         949,
         44214,
         201085,
         452507,
         1939,
         22681,
         223,
         521,
         49950,
         2655,
         16825,
         44925,
         1586,
         2502,
         10285,
         431,
         1124,
         681
      ],
      "original_title": "Stir of Echoes",
      "runtime": 99,
      "poster_path": "/pjdmvS3I5HElkJHzCNkqn5o8Kjf.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Artisan Entertainment",
         "id": 2188,
         "origin_country": ""
      }],
      "release_date": "1999-09-10",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Stir of Echoes Collection",
         "id": 143757,
         "poster_path": null
      },
      "tagline": "In every mind there is a door that should never be opened.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["David Koepp"],
      "runtime": 99,
      "synopsis": "Tom Witzky (Kevin Bacon) is a phone lineman living in a working-class neighborhood in Chicago with his pregnant wife Maggie (Kathryn Erbe) and his son Jake (Zachary David Cope), who possesses the ability to commune with the dead. At a party one evening, Tom challenges Maggie's sister Lisa (Illeana Douglas), a believer in paranormal activity and psychic telepathy, to hypnotize him. After putting him under, Lisa plants a post-hypnotic suggestion in Tom urging him to \"be more open-minded.\" Tom then begins experiencing visions of a violent scuffle involving a girl who he later learns is Samantha Kozac (Jennifer Morrison), a 17 year-old that disappeared from the neighborhood six months prior. While Tom and Maggie attend a high school football game, Jake is overheard by his babysitter, Debbie Kozac (Liza Weil), as he speaks with Samantha. Debbie gets upset and snatches Jake, running off with him in the night. Meanwhile, Tom senses Jake is in danger and rushes home but finds him gone. Tom then sees strange flashes of red light that eventually leads him to the 'L' station where Debbie is speaking with her mother about Jake. When Tom and Maggie confront her, Debbie angrily questions them about her sister Samantha, explaining that she had an intellectual disability: having the mental capacity of an 8 year-old and thus, a child's tendency to trust strangers. Tom denies knowing her to Debbie, but admits to Maggie that she's the girl in his visions. Tom becomes obsessed with Samantha and begins probing members of the community about her disappearance. This attracts the attention of his landlord Harry Damon (Conor O'Farrell), Tom's friend, Frank McCarthy (Kevin Dunn) and their respective sons Kurt Damon (Steve Rifkin) and Adam McCarthy (Chalon Williams), who all dismiss Samantha as a runaway teen. During an afternoon walk, Jake and Maggie encounter a funeral where Chicago policemen are saluting in a ceremony; here a policeman named Neil (Eddie Bo Smith Jr.) immediately recognizes Jake's unique talent and invites Tom to a private gathering of like-minded people to learn more about what is happening to his son. Maggie withholds her conversation with Neil from Tom and goes to the meeting herself where Neil tells her the spirit that contacted Tom has asked for something and will continue to get upset if it doesn't get done. As predicted, Samantha begins plaguing Tom, eventually leading to his insomnia. He goes back to Lisa demanding she undo what she did, but when she hypnotizes him he's told by the spirit to dig. Tom complies and begins digging holes in the backyard and eventually tears up the house in a desperate attempt to appease Samantha. While Maggie and Jake attend her grandmother's wake at a relative's house, Tom inadvertently knocks down a shoddy brick wall in the basement and discovers Samantha's decomposed remains wrapped in a plastic sheet. He receives a vision showing him that before his family moved in, Adam and Kurt lured Samantha into the house to rape her. When she resisted, they unintentionally suffocated her and hid her body. Tom brings Frank back to the basement to disclose to him the crime and Frank breaks down and admits that Adam and Kurt had already confided their secret to him and Harry. Frank pulls out a gun and demands to be alone. As Tom leaves the basement, he hears a single shot and assumes that Frank committed suicide. Harry and Kurt suddenly show up and Harry, in his capacity as landlord, voices displeasure with the torn up house. They corner Tom with the intention of killing him to silence him, but Maggie arrives back home and Harry takes her hostage. Frank suddenly emerges from the basement and fatally shoots both Kurt and Harry in order to save Tom and Maggie. Tom then notices Samantha's spirit putting on her glasses and coat, smiling as she walks down the road and disappears. Afterwards, the family packs up a U-Haul and moves out of the house. Meanwhile, Samantha's mother and sister are finally able to give her a proper funeral and burial. Tom and Maggie smile happily as they drive away but Jake, however, tries to cover his ears to drown out the sound of the overlapping voices in his head.",
      "writers": [
         "Richard Matheson",
         "David Koepp"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0164181/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU0OTAyMDQzNV5BMl5BanBnXkFtZTcwNTg1NjYyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Bacon, Zachary David Cope, Kathryn Erbe | See full cast and crew »"],
      "reviews": [
         "(A) The Sixth Sense and Stir of Echoes must have been the two movies of '99 that I enjoyed the most. Both had good scripts and stories; they were interesting, mysterious, dark, weird -- those are my kinds of movies! They are also a proof that the mysteriousness of ghosts is something we will never tire of or not think to be intriguing. Stir of Echoes was somewhat similar to Sixth Sense but it was also in many was DIFFERENT. First of all, it (SOE) is dealing with hypnosis and has a more 'criminal' as well as supernatural theme. This movie is spectacular and the reason it was not recognized as such, is because it was released just a few weeks after The Sixth Sense - a movie which had already satisfied the audience with its supernatural theme. And because The Sixth Sense was such a hit, Stir of Echoes was shoved aside and didn't get the recognition it deserved. Don't get me wrong! I loved Sixth Sense, but this movie is also very good and if you liked The Sixth Sense, I highly recommend you see it!",
         "Stir of Echoes is a very good horror thriller in the traditional sense. It's the story of a guy who gets hypnotised and develops precognitive psychic abilities which he can't control. Kevin Bacon is excellent and shows he can be a leading man, while the rest of the cast performs well. Sets, special effects and cinematography are all very good - nothing flashy but solid. It has shocks and suspense, especially in the first half, and although it could be accused of being a little clichéd, it never strays too far into the 'seen it all before' category. The second half of the film turns into a more traditional thriller but still holds up well, unlike similarly themed movies such as 'What Lies Beneath.' This is because it is pleasingly short, lasting around 90 minutes (the correct length for a film of this type). There are some plot strands that aren't explained, but this can be forgiven because of the film's running time. Although not mind blowing, it has a decent payoff at the end and left me satisfied that I'd just watched a good movie. Not a great one, but a good one. Pick this one up cheap on DVD.",
         "In 1999, the media was in a frenzy about a new film that used real things to terrify and excite its audience. Stir Of Echoes was not it. Partly due to the studio's financial difficulties, Stir Of Echoes came and went by itself, unsung and unappreciated. Which goes to show that recognition in the Hollywood system does not go to innovators or the best storytellers. It is all about marketability, and while Stir Of Echoes had this, the companies involved in making or distributing it did not seem to want to spend the cash involved in taking advantage. Either that or Artisan and Fox decided to use it as their tax write-off for that year. I have not read the novel by Richard Matheson, so I cannot comment on how faithfully the film follows its source. But that is irrelevant. When compared to its more big-name competitor, at least Stir Of Echoes has the courtesy to acknowledge its source. The film updates the story to a more modern era, thus saving a few dollars, since period pieces are expensive to make. In fact, the dramatic angle of the film keeps it rather cheap, since effects shots are few and far between. Not to mention the effects that do appear are fairly simple in nature. Indeed, Stir Of Echoes only cost about thirteen million to make, according to estimates. Which makes it all the more peculiar that Fox was unwilling to invest a little more effort in publicising the film. Kevin Bacon is in fine, fine form as the film's central hero, a regular guy called Tom Witzky. Kathryn Erbe is also in great form as his wife, Maggie. Illeana Douglas is decidedly odd as his sister-in-law, Lisa. But the real surprise here is child performer Zachary David Cope. After the pretender, that pile of sachaarine garbage called The Sixth Sense, child stars had such a bad reputation that Zachary deserves a medal for portraying such a genuinely likable, layered character. Indeed, director David Koepp took one hell of a risk by placing so much of the responsibility for the plot on his shoulders. That it pays off is a testament not only to the strength of Zachary David Cope's performance, but to the strength of the material he was given. Indeed, all the best scenes in Stir Of Echoes involve interaction between Zachary, Kathryn, and Kevin. I do think this film has its faults. Chief among them is that the story needed another ten minutes to properly develop. Plot threads like the group of psychics, a member of which helps put Kathryn Erbe's character on the path of greater understanding, needed better resolution. One moment, Maggie is asking this policeman why her husband is obsessed with a scene of memories to the exclusion of his job. The next moment, not only are details like the job forgotten, so too is the group and the policeman. Smoothing out intricate plot points such as this would have helped the story no end. In the end, however, Stir Of Echoes is proof that the artistic work one does not hear about may just be the one that has more merit. If nothing else, it is worth watching to see a small ensemble cast that excels. Even small performances like Liza Weil's demonstrate a sense of dramatic flair that has long fled most of the rest of Hollywood. It is for this reason that I gave Stir Of Echoes an eight out of ten. It is worth watching just to see how badly misdirected the hype machine often is.",
         "Actually, I found this movie more satisfying than \"Sixth sense\". It doesn't have a stunning payoff like \"sixth sense\" (what film does?), but until the, in some ways hasty, conclusion, it's well made, scary and, since I have a knowledge of occult things through a good friend, rather believable. Kevin Bacon is credible in his part and so do Illeana Douglas. Kathryn Erbe however is stuck with nothing to do for large chunks of the movie. Effectively and atmosphericly shot, with some effective jolts that made me jump. To some, the conclusion may be a little simple and drawn-out, but I thought it was satisfying and filled to the brim with suspense. I find that the digging in the cellar/garden is a nice build-up for the finale, not that it goes on forever as a previous reviewer stated. It's only one thing that bothers me about the ending, and it is that too little is explained and a few threads of the story are totally abandoned. But that's only a minor complaint. For the most part, this is a creepy, interesting, well-made, scary and well played little thriller.",
         "The biggest problem with Stir of Echoes is the timing of the release. As we all know it was released at the same time as The Sixth Sense and the subject matter is coincidentaly very simular. This film not quite as good as the Bruce Willis classic because i dont think the twist is quite as dramatic. The thing that compares favourably to The Sixth Sense is that Stir Of Echoes is thoroughly entertaining from the first minute. Kevin Bacon Stars as a father who is hypnotised by his sister in law, which results in the opening of his mind to the spirit of a girl who was murdered in his house. His son already had the powers to speak to dead people and together they try to solve why the girl keeps contacting them. The young boy is brilliant in the roll as is Kevin Bacon and the whole film keeps you on the edge of the seat. The way this is filmed is stunning, especially when he is first hypnotised, i nearly went under myself! A Very entertaining movie. 8 out of 10.",
         "Before 1999 this type of supernatural thrillers/horror didn't really existed. This all changed after the release of \"The Sixth Sense\". It was an huge hit and the movie was the talk of the year. It launched a totally new genre of movies. Every movie of the same 'type' released after \"The Sixth Sense\" was considered by everyone lame, unoriginal and a rip-off and a movie to quickly cash in after the success of \"The Sixth Sense\". \"Stir of Echoes\" was released only a month after \"The Sixth Sense\" and people wanted to know nothing of it. Completely unfair, also since I thought that the script was even being written before \"The Sixth Sense\" was and I also thought that filming completed earlier but yet it was released later in cinemas. Who knows what would have happened to this movie if it was released before \"The Sixth Sense...It surely would had been appreciate more than it was now. I'm glad that the movie by now is finally starting to receive the credit it deserves. You also have to remember that in 1999 these type of movies were still fresh and new, so everything about it was original. However by todays standards the movie perhaps doesn't really seem that original anymore, since dozens like this sort of movie are being made every year now. The story is greatly written by David Koepp, who really is one of the best writers in the business. Everything is build up perfectly slowly and mysteriously. You never know what is going to happen next and the movie offers more than enough surprise. In the beginning you really don't know what the movie is going to be about or were its trying to head to. You don't know if its real what is happening or is it just the main character imagining things. It provides the movie with mystery and an uneasy atmosphere. The movie above all is a supernatural thriller (that also definitely has some similarities by the way with \"The Sixth Sense\", which also might be a reason why it was received so coolly) but the movie also features some real horror elements. And remember again, this was all quite new and refreshing for 1999 standards. I was actually quite blown away by the movie when I first saw it, which must have been in 2000 or something. Kevin Bacon is really know for being the biggest Hollywood lead and he normally plays supporting roles, especially before this movie. This movie is perhaps the first one that truly allows Bacon to shine and show his skill as an actor and proof to the world that he can really carry a movie. It was nice and refreshing to see Kathryn Erbe in something different than \"Law & Order: Criminal Intent\" for a change. She plays such a different character. It shows how good as an actress she actually is. The movie is well directed by David Koepp himself and he knows how to bring his own story to the screen. The movie further more features some nice special effects, that are used only in the right places. The movie is still definitely much better and more refreshing than most genre movies being released today. Deserves to become a real genre-classic! 9/10 http://bobafett1138.blogspot.com/",
         "Stir of Echoes (1999) tells the story of Tom, a middle aged man who, after being hypnotized, starts seeing things. This is the start of a suspenseful psychological thriller that sucked me in and did not let go until the credits rolled. The acting by all the lead and supporting characters is more than adequate. Kevin Bacon is right at home in his role of a somewhat bitter individual who undergoes heavy changes throughout the film. He does a great job, as do the other actors. The film is shot in a sober and down-to-earth way, giving it a serious tone. Plot wise, the movie is also more than decent, with only a few small plot holes which will only bother the most scrutinous of viewers. The movie's plot does however remind some viewers of other thrillers, mainly The Shining and The Sixth Sense (another 1999 release which overshadowed Stir of Echoes with a larger marketing campaign and larger overall budget). Some aspects of the story are indeed less than original, but the movie as a whole feels different and is very enjoyable. Overall, the movie falls just short of greatness in its genre. I found the quality and depth of the story to be good, but not quite as good as some of the afore mentioned greats in the thriller/horror genres. even still, I recommend this film to every fan of thrillers and suspense.",
         "I have always admired and marveled at Kevin Bacon's versatility as an actor. From the likable fish-out-of-water guy who trips the light-fantastic through a piece of fluff like FOOTLOOSE, to putting everything on the line to play a pedophile in the unnerving THE WOODSMAN, there's hardly anything he can't - or won't do - to show his amazing range. That being said, STIR OF ECHOES still holds what is for me one of his all-time Top Five performances. He plays Tom Witzky, a regular mug living with his family in a working-class suburb of Chicago. Though he loves his family, hotter-than-hot wife Maggie (Kathryn Erbe) and precocious son Jake (Zachary David Cope), he's also a man becoming bored with his life. He wants to do and be something more than who and what he is. Obviously, the old adage \"be careful what you wish for\" went right over Tom's head. At a party for family and friends, Tom volunteers to be hypnotized by his flaky sister-in-law, Lisa (the always excellent Illeana Douglas), who makes a powerful suggestion to Tom that his mind takes literally. What happens next will change his life and everyone's around him forever. A 'doorway' has been opened inside Tom's head that allows him to communicate with the dead, and for them to reach out and touch him...whether he wants to or not. When the \"nightmares\" that he's been having begin to intensify, Tom knows he must find a way to close that doorway for good before he loses his family...and his sanity. The urgency is heightened when he discovers how sensitive he was before the hypnotic suggestion, in the most chilling way possible...it seems that son Jake can see and talk to the dead as well. In the tradition of THE CHANGELING, LADY IN WHITE and THE SIXTH SENSE, the focus of Tom's visions comes from one apparition in particular, who won't leave him or his family in peace until he can figure out what it wants and why. The situation provides fodder for one intense and terrifying performance, and with help from a strong supporting cast, Bacon comes through like a champ. When movies like this are adapted from older works by classic authors, I usually proceed with the greatest caution. But Richard Matheson's creepy novel has been skillfully transformed by David Koepp, a man who knows a little bit about balancing thoughtful plotting and dialogue with outright terror, (as in APARTMENT ZERO) and the outstanding job he does here will make you think twice the next time somebody wants to 'put you out' at a party with something more than just shots of Captain Morgan...",
         "Tom (Kevin Bacon) has hypnotized by his sister-in-law, played by Illeana Douglas, and from then on his life's a little....well, weird. He sees a ghost of a disappeared girl, and he's not the only one - his young son's been seeing the spectre for weeks. What unfolds after that is that Tom slips further and further into imminent madness. His wife Maggie (Kathryn Erbe) can't fathom his insanity, and it's driving her up the wall, as both of the men in her life are increasingly distant and non-communicative. So what happened to Tom when he was under hypnosis? His sister-in-law claims there's a door in everyone's mind that's never been opened, and it sure looks like Tom's door is wide open, with a big neon sign over it, inviting him to run through with abandon. What's behind all of this freakiness? There's a mystery afoot, but it turns out to be a little more standard and predictable than one would hope with the solid premise. Can't fault the actors, though - this is an unusual role for Bacon, who here comes off as a tough, strong, blue-collar kind of guy - he and his family are close to what one might call white trash, but they're never portrayed as being mean-spirited or hateful. This is just one of those cases where weird stuff happens to nice folk, kind of like the clan in \"Poltergeist.\" So this is a stylish psychological/supernatural thriller with game performances by a capable cast. It's watchable and full of chills, but the ending's a little pat.",
         "I mean, apart from that being the original book's name. There's no direct reference to the title anywhere through the movie. That's the only thing that bothered me through the whole movie, really. Guess it just unsettled me. Except that Einstein wasn't a Gemini, he was born in March. He was a Pisces. But that's irrelevant. There are lots of little things that make this movie great. There are so many bits where you expect something to happen, but it doesn't. That makes you look for the next one, when it really *must* happen this time, for sure. And it doesn't. Again. So you're kept on the edge of your seat, waiting for something scary to jump up and frighten you half to death. But it doesn't. For all its spooky and weird subject-matter, Stir of Echoes keeps it simple, and in doing so makes itself even more climactic. Where The Sixth Sense was spooky, this movie is frightening. It's like when you watched Dr Who as a kid and hid behind the couch because you couldn't bear to watch. Kevin Bacon is fantastic, and loses his mind quite convincingly. The 'Dig' sequence, along with the total madness that follows, reminds me of Stephen King's The Tommyknockers. And that book was spooky enough. Zachary David Cope (why do all kids have three names nowadays?) is also brilliant as little Jake, although Kathryn Erbe as Maggie leaves a little to be desired. She's too flat - not enough emotion. And I love the way all the little things are tied up, especially the end sequence with Jake in the car... If you liked The Sixth Sense, this is not quite the same standard, although it's pretty close. If you didn't like The Sixth Sense because you didn't think it got personal enough, this one's for you. Although I don't think anyone's going to get remotely close to the ending of The Sixth Sense for a very very long time. 7½/10."
      ],
      "genres": [
         "Horror",
         "Mystery"
      ],
      "productionCompanies": ["Artisan Entertainment"],
      "summaries": [
         "Tom's a regular guy, a utilities lineman, married, with a young son, his wife is pregnant; he hangs out with long-time pals in a Chicago neighborhood. At a party, his sister-in-law hypnotizes him, and he goes into a deep trance. Before waking him, she suggests that he keep his mind open. That night he sees flashes of violence and the ghost of a young woman. His young son, too, is \"a receiver,\" but while the boy is calm and coherent in his conversations with spirits, Tom is confused and agitated. Over time, the young woman's story comes to the surface, and Tom begins a hunt for her body that puts him and his usually understanding wife, Maggie, in grave danger.",
         "Tom Witzky is a lineman for a utility company. He's a typical working-class guy who lives in Chicago with his pregnant wife Maggie and his son Jake. Tom likes to hang out with his friends, who include Frank McCarthy and Harry Damon. One night at a party, Tom ends up in a discussion with Maggie's sister Lisa, who believes in psychic communication and the power of hypnosis. Tom challenges Lisa to hypnotize him, and she plants in him a post-hypnotic suggestion to be more open-minded...with results that were never, ever expected. That night, he sees images of violence and the ghost of Samantha Kozac, a young woman who disappeared from the neighborhood some time ago, and is now believed to be dead. Jake also sees Samantha's ghost, but while Jake is calm about it, Tom always seems angry that the images won't stop coming. Jake's baby-sitter Debbie Kozac is Samantha's sister, who is still distraught because of Samantha's disappearance. When Debbie discovers that Jake has been talking to Samantha's ghost, Debbie becomes frantic, and she thinks Jake may know where Samantha is. Determined to figure out what's going on, Tom begins a hunt for Samantha's body, and it's a hunt that threatens to kill Tom, Maggie, and Jake, because there is someone who does not want Samantha's body to be found.",
         "After being hypnotized by his sister in law, a man begins seeing haunting visions of a girl's ghost and a mystery begins to unfold around her."
      ],
      "budget": 12000000
   },
   "movielensId": 2841,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-10",
      "dvdReleaseDate": "2000-02-01",
      "directors": ["David Koepp"],
      "runtime": 99,
      "movieId": 2841,
      "title": "Stir of Echoes",
      "mpaa": "R",
      "actors": [
         "Kevin Bacon",
         "Kathryn Erbe",
         "Illeana Douglas",
         "Kevin Dunn",
         "Conor O'Farrell",
         "Lusia Strus",
         "Zachary David Cope",
         "Stephen Eugene Walker",
         "Mary Kay Cook",
         "Larry Neumann Jr.",
         "Jennifer Morrison",
         "Liza Weil"
      ],
      "imdbMovieId": "0164181",
      "originalTitle": "Stir of Echoes",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["Daa5VOnUWsA"],
      "plotSummary": "After being hypnotized by his sister in law, Tom Witzky begins seeing haunting visions of a girl's ghost and a mystery begins to unfold around her.",
      "tmdbMovieId": 11601,
      "avgRating": 3.50714,
      "releaseYear": "1999",
      "numRatings": 5041,
      "posterPath": "/pjdmvS3I5HElkJHzCNkqn5o8Kjf.jpg"
   }
}