{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "suspense",
         "id": 9937
      }],
      "imdb_id": "tt0133412",
      "video": false,
      "title": "Best Laid Plans",
      "recommendations": [
         37722,
         9401,
         18530,
         12257,
         13163,
         25723,
         2162,
         294261,
         18451,
         52654,
         26626,
         44015,
         25269,
         18220,
         80919,
         15513,
         18561,
         31083,
         46286,
         44267
      ],
      "backdrop_path": "/5K6HGqZyqDkaoIKZUT3HFq51tRP.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Lissa",
               "gender": 1,
               "credit_id": "52fe478b9251416c7509d3cf",
               "name": "Reese Witherspoon",
               "profile_path": "/a3o8T1P6yy4KWL7wZG6HuDeuh5n.jpg",
               "id": 368,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d3d3",
               "name": "Alessandro Nivola",
               "profile_path": "/lLlaotVNM6dhjXj7GWVLSedugct.jpg",
               "id": 4941,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Bryce",
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d3d7",
               "name": "Josh Brolin",
               "profile_path": "/x8KKnvHyPvH16M6waAnY1OeCtA8.jpg",
               "id": 16851,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Lawyer",
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d3e7",
               "name": "Gene Wolande",
               "profile_path": "/wRmAsVCe1h7W6BiJdB3uLbeo9Bj.jpg",
               "id": 152993,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "5573d0a49251413efe000b22",
               "name": "Terrence Howard",
               "profile_path": "/MZeLxOH0PgL7xcvt865WVBvQDw.jpg",
               "id": 18288,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Barry",
               "gender": 0,
               "credit_id": "5573d0dac3a368246a0009a9",
               "name": "Jamie Marsh",
               "profile_path": "/yionBHUzuqCy8SsltfIrdRYwaJk.jpg",
               "id": 94553,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Lawyer Secretary",
               "gender": 0,
               "credit_id": "56b7d07f9251414c45007baa",
               "name": "Teddy Vincent",
               "profile_path": "/b7MrAudSvo4R1eGYjlgffMK2ARH.jpg",
               "id": 1313808,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Realtor",
               "gender": 1,
               "credit_id": "56b7d0a0c3a36806ee00e03b",
               "name": "Jane Morris",
               "profile_path": "/rlLOLLBijORKa48OaxVeZE8CJ0j.jpg",
               "id": 13451,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Diner Waitress",
               "gender": 1,
               "credit_id": "56b7d0e3c3a3684816007c15",
               "name": "Rebecca Klingler",
               "profile_path": "/lqCpN7GtQ5ZF6iqwAJTuGOWXrXt.jpg",
               "id": 944614,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe478b9251416c7509d3dd",
               "name": "Ted Griffin",
               "profile_path": null,
               "id": 1886,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe478b9251416c7509d3e3",
               "name": "Mike Barker",
               "profile_path": "/ofsfGSt8LQYOhD5nIrugDQAw4xX.jpg",
               "id": 77964,
               "department": "Directing",
               "job": "Director"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Crime",
            "id": 80
         }
      ],
      "popularity": 6.474372,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18621,
      "vote_count": 42,
      "budget": 0,
      "overview": "Rich, successful Bryce meets beautiful Lissa at a bar one night and invites her back to his house, not suspecting for a moment that Lissa isn't really who she seems. What unfolds next is a dangerous, tangled web of double-crosses and seduction.",
      "similar": [
         274,
         10285,
         1949,
         2832,
         949,
         4638,
         189,
         181283,
         336843,
         158011,
         910,
         996,
         654,
         1939,
         8834,
         12150,
         371608,
         845,
         28902,
         72784
      ],
      "original_title": "Best Laid Plans",
      "runtime": 92,
      "poster_path": "/cuGI1gMEAaAdvtS8u031f2kY5GH.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Fox 2000 Pictures",
            "id": 711,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Dogstar Films",
            "id": 17422,
            "origin_country": ""
         }
      ],
      "release_date": "1999-04-09",
      "vote_average": 6,
      "belongs_to_collection": null,
      "tagline": "Keeping a relationship alive can be murder",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mike Barker"],
      "runtime": 92,
      "synopsis": "A used, but still burning, cigarette falls on a small stack of paper, setting it alight. Nick (Alessandro Nivola) stands in a bar in the small town of Tropico, Nevada. He sits at his booth where he's joined by a college friend named Bryce (Josh Brolin), who's almost finished accreditation toward becoming an English teacher. The two fall into small talk ranging from where-are-they-now regarding some of their college acquaintances, to a 1960's sexual game that promoted adultery. Outside, a young blonde woman (Reese Witherspoon) steps out of a cab; the camera first panning along her legs, and then up to her face. Looking pensive, she steps into the bar, walking past the booth where Nick and Bryce are sitting. Bryce turns slightly, ogling her as she walks past. A clenched hand, gripped by another at the wrist, jerks up and down at the head of a bed. Bryce calls Nick at two in the morning, frantically pleading for him to come over right away. Bryce says he's in very serious trouble and in desperate need of immediate help. Nick is delayed by a roadside brush fire, but makes it to a lavish house that Bryce is house-sitting on behalf of the owners. Bryce pours two drinks, and tells Nick that he'd gotten laid earlier in the evening, but it's what happened afterward that has him in such terrible trouble. The blonde girl who'd come into the bar, named Kathy, had picked Bryce up after Nick left, and talking and another round of drinks led to Bryce bringing her home with him and eventually they had sex. By that time, Bryce was drunk, events passing at a blur, and he already can't remember all the fine details. After they were done, Kathy told Bryce that she was going to take a cab home... and call the police to file rape charges against Bryce. The fact that Bryce had started to get intoxicated and couldn't remember all the details between Kathy showing up at the bar, and his calling Nick for help, makes him very frightened that he wouldn't have any adequate defense in court. He can't swear under oath that she never abruptly tried to back out of making love with him. But the worst part of it is, Kathy never left the house-- Bryce tells Nick, she's downstairs. Bryce takes Nick to the basement, and turns on the lights. Kathy sits on the floor at the base of a pool table, and she's bound and gagged; steel cuffs with long chains shackling her wrists to a wooden rod at the base of the pool table. In a total panic over the rape accusation, Bryce had dragged the girl down here, and she's now his captive. Bryce and Nick start to argue hotly. Nick demands Bryce produce the key to Kathy's wrist cuffs, so he can unlock them and then drive the girl home, byt Bryce refuses to do this, until he can be assured that his teaching career won't be ruined. Nick hears Kathy starting to cry and turns his attention to her. He pulls her gag away from her mouth and asks if Bryce had wrongly touched, or hurt her, after she told Bryce he'd raped her. Kathy has a cut on her lip from falling down when Bryce pulled her down here, but she admits that Bryce hadn't touched her after he'd chained her to the pool table. Other than that, she's terrified at being held captive, and she sobs that she just wants to go home and forget any of this ever happened. But back upstairs, Bryce reveals there's still more to the problem. Dumping the contents of the girl's purse on a coffee table, he shows Nick two drivers' licenses Kathy has; one for the state of Nevada, listing her name as Katherine Lowell and her birth year as 1977... and the other one from Texas, listing her name as Jennifer Bigby, and her birth year as 1982. One of them must be fake, and because people typically make fake ID's listing them as older than they really are, for the purpose of accessing facilities and services with a minimum age requirement (like the bar where Nick and Bryce had gone to), instead of vice versa, Bryce believes the real one is the Texas license, which would make the girl only sixteen years old. This means that even if she didn't try to back out of having sex, her age still makes Bryce guilty of statutory rape. Bryce is certain this means he can kiss his teaching career goodbye before it's even started. Bryce wants to get Kathy out of the house and out of his life, but he's desperate to try and assure her silence. Her fake ID means he won't trust her word, and he has nothing to bribe her with, and she's too frightened to try and threaten her. Nick suddenly says he can try to do that. He's already played 'good cop,' and now he can pull a reversal, and try to scare her into compliance. Nick goes downstairs where Kathy still lays, shackled to the base of the pool table. But as he squats down beside her, he tells her, 'we're fucked,' and she answers, 'you're telling me;' revealing that it's Bryce who's only scratched the surface of what's really going on... The scene shifts to four months earlier. Nick is at work at the Tropico Recycling company; the primary source of the town's income. It's the day of his father's funeral, and his relief is very late in arriving. Hurrying home, he changes clothes and races to get to the funeral services, accidentally running down his neighbor's cat. As the vet prepares to euthanize the cat, it's shown that Kathy, whose real name is Lissa, works at the veterinary clinic. When Nick exits the animal hospital and finds his car has a flat, Lissa drives him to the cemetery where the priest still waits for him. She stands outside her pickup and watches the ceremony. Afterward, the two have lunch at a diner and start to bond, talking about why they're still living in a dead-end town like Tropico. Both of them are struggling to build futures for themselves so they can each find a good place to live. As they're preparing to part way for the night, they turn to look at each other one more time, and the camera cuts to the two of them kissing madly as they go into Nick's house, and then having sex. Nick had come back to Tropico to care for his father during his last months, and was looking to quietly collect any inheritance due him and use it to make a life for himself. But, arriving at the office of his father's lawyer, he gets double whammied: an autopsy on his father showed a chronic liver condition that he omitted from his life insurance forms on purpose, meaning they're refusing to pay out on the policy. Worse, Nick's father owed $200,000 in back taxes, and the IRS has seized all of the property for public auction. Nick is personally not liable for any of the tax burden, but it means he has no inheritance of any kind to collect. He's now stuck with no money in a dead-end job in a dead-end town. The only thing Nick seems to have going for him, is his budding relationship with Lissa, who's growing close to him. The two of them eke out their day to day lives in Tropico as best they can, until one day Nick's co-worker, Barry, introduces him to a shady man named Jimmy (Terrence Howard), who works for an even shadier employer. Trying to avoid telling him everything, they only say that Jimmy's employer moves various 'stash' around from house to house to foil potential search warrants, and tonight it's at Jimmy's house. He and Barry are planning to stage a burglary to steal $40,000 worth of it. But they need a driver. They offer Nick a fourth of their cut if he acts as driver. The job goes off without a hitch, leading Nick to reveal to Lissa that he'd been dishonest about going to a game with Barry, and he's ready to start looking into finally leaving Tropico. Lissa agrees to go with him. But the next day at work, a menacing looking man comes up to Nick and demands he get into a nearby car with him. In the front passenger seat is a Bad Ass Dude (Rocky Carroll, character unnamed, will be referred to as BAD for Bad Ass Dude), apparently Jimmy's boss, who knows about the theft. Nick is brought to a hideout where Jimmy is tied to a chair and apparently being tortured for his part in the robbery, and BAD mentions that Barry wasted no time at all skipping town, most likely for fear for his hide. When Nick says his cut of the theft was $10,000, BAD tells him that for $15,000, they'll be square and reparations will be complete. He has until Sunday to get it, and if he tries to run, they'll hunt him for the rest of his life. On finding out what's happened, Lissa looks to help Nick out, but Nick doesn't want her involved because of how dangerous BAD is. But raising the money he needs proves near impossible. Checking his answering machine, Nick finds that Bryce is calling, and he's in Tropico again. With nothing to lose, Nick calls him back. Bryce brings Nick the house he's house-sitting at, belonging to a very wealthy man named Beaumont. Remembering Nick was interested in history, Bryce shows Nick that Mr. Beaumont has a Note authored by Abraham Lincoln himself; a stay of execution for one of Mr. Beaumont's ancestors, who deserted the Union Army during the Battle of Vicksburg. The note is written on the back of a 19th century $5 bill. The bad news comes before Nick can even approach Bryce about a possible loan: Bryce's parents, who have money, have cut him off in something Bryce calls a 'benign toughlove policy without the benign part.' Although preparing to start a career as a professor, the starting salary will be very poor. Nick goes to see Charlie, a thrift shop owner and finds that a genuine Lincoln signature would net him a six-figure profit, although not so simply as Nick would hope. First, if it's registered, it's immovable. If unregistered, he'd have to wait sixty days and it would require the right fence. Nick suspects Charlie has suggested he could be such a fence, and negotiates a cut for him. The trick is, exactly how to steal it. Lissa sees Nick doesn't trust Bryce enough to bring him 'in' on it; Nick says that if caught, Bryce would rat them out in a heartbeat, like he did with two people he worked with at cheating on college midterms. Lissa comes up with an idea to make sure Bryce wouldn't report such a theft: make him think he'd get in even more trouble by doing so, than if not. One way is by tricking him into thinking he's committed some form of crime, such as arson... or rape. When Nick says that statutory could work, Lissa quickly understands what Nick means and angrily leaves the house. When Lissa returns the next day, she sees a photograph sent to Nick; Barry's been found and murdered. This frightens Lissa enough that she agrees to go through with the plan. Nick shows that, despite his gratitude, he hates himself for just coming up with the idea. Later, he offers her another chance to back out of it. When she stays silent, he tells her that soon as she's given Bryce the necessary scare, she should hurry out of Tropico. Driving to the bar, Nick pauses near a bridge and throws his cigarette out of the car window. Unknown to Nick, it lands on some dried paper and starts the brush fire. We return to the first scene with Nick meeting Bryce at the bar; Bryce telling a vulgar joke as Lissa walks in and takes a seat; Nick passing by Lissa en route to the bathroom and telling her he loves her. She asks simply why he thinks she's going through with the plan. Lissa relocates to a seat closer to Nick and Bryce's booth, and initiates contact by giggling when Bryce spills some of his drink on his shirt. He invites her to join him and Nick. She sits and introduces herself as Kathy. Nick returns from the bathroom and excuses himself, saying he needs to leave. The scene of Bryce holding one of Lissa's wrists as they have sex, is again shown, and we return to Nick and Lissa in the house's basement; Lissa still shackled to the base of the pool table. Nick is in shambles over what's happened to Lissa, and he tries to comfort her. Lissa tells him she has the Lincoln Note, but Bryce has the key to her cuffs. After Lissa gave her 'pitch,' she says Bryce lost his cool and grabbed her as she tried to get out of the house, dragging her down the stairs before putting her in the basement. Despite having roughed her up a bit when pulling her down the stairs, Lissa writes Bryce off as harmless, just a bad drunk. The trick is how to get out of the house. Nick says he has two ideas. The first one is to break the pole at the base of the pool table so they can escape; the complication is that Bryce has spent the past two hours studying the two fake ID's Lissa was carrying. Right now he only knows one is fake, and he only thinks he knows which one, and why. If he figures out both are fake, he'll report the theft of the Note once he notices it missing. Cut to Nick and Bryce back upstairs; Nick and Lissa are going with 'option two.' Nick fabricates a whole story about how 'Kathy' is going to turn them both in for kidnapping and rape, that her uncle is a lawyer and both of them are going to fry for what they've done to her. Bryce falls apart even further; once he's put on a sex offender registry, he can forget about working at any kind of respectable job. Bryce now wants to kill Lissa, he's so angry with her. Just at that second, a commercial for Tropico Recycling, which both Nick and Lissa starred in, starts to come on, and Nick has to do a distraction to keep Bryce from noticing. He picks a fight over Bryce playing him for a fool, and tells Bryce that if he wants to kill Lissa, he should just come out and say so, without making suggestions to lead Nick on. Nick then takes control, 'leading' Bryce along the 'difficult' question of killing Lissa to keep her silent. He sets the hook by telling Bryce it's his decision and Nick will abide by whatever Bryce decides. When Bryce decides to go through with it, Nick says he'll do the actual murder, saying it's why Bryce called him. He takes the key to Lissa's wrist cuffs and goes back downstairs. A few moments later, Nick comes back up, carrying Lissa, as if he'd killed her. Nick assures Bryce he can get Lissa out of the house and off the property, but they realize they forgot to take her purse. Lissa starts to get very scared about being locked in the trunk and almost blows the whole thing when Bryce comes back out with the purse. Things start to go more awry when Bryce refuses to stay in the house alone, insisting on coming with Nick. Nick tries to calm Bryce by turning on the radio, but there's no room for calm when they're accosted by carjackers who steal the car-- with Lissa still in the trunk. Nick knows it wasn't a random carjacking, however. Sending Bryce home, he races back to his own house, barely getting there in time to answer a call. One of BAD's men is making the call, and also standing right outside to bring Nick to BAD's hide out. BAD reveals that he's chosen to collect early in case Nick was thinking of running. He turns a chair around, showing Lissa bound and gagged; BAD is holding her for ransom of an additional $10,000. Nick says he can get 20 in three or four hours, which BAD agrees to, saying Freddy will drive him back, and Lissa will stay as a hostage, while Nick goes to get 'Daddy's money.' Nick suddenly stops; BAD shouldn't know anything about Nick's father. He takes a step back, and hears a crackling sound. Looking down, he sees broken peanut shells... similar to the ones Barry dropped just before they staged the 'robbery.' Turning, he sees a closed door and bursts through it; revealing Barry and Jimmy sitting on a sofa, very much alive. What they 'stole' wasn't cocaine, but baking flour. BAD isn't a big crime boss, but merely a finance major with tuition to pay. The whole thing was a screw job because they thought that Nick had inherited a lot of money from his father and the house, and they could easily bilk him out of twenty grand. The whole plan having fallen apart, they let Nick and Lissa go, with a 'gentleman's agreement' that Nick appearing to have kidnapped Lissa is their insurance against Nick's turning them in. Nick and Lissa walk in a daze, passing by a diner, wnere Nick says he has to see Charlie within two hours. At least he can still sell the Note and get the money. Lissa is disgusted by this, angrily tearing into Nick about how they're about to sink to the exact same point as Barry, Jimmy and crew, screwing Bryce like they'd tried to screw him. It was never about the money; it was about the Nick and Lissa being stuck in a dead-end town for their whole lives. Seeing a new side of Nick, Lissa turns and walks away, entering the diner. Nick follows her inside, still hoping to try and salvage the one thing he has going for him. Inside, Nick finds Bryce. It was the nearest diner where he could get something to eat. Bryce drops the bombshell that his conscience over 'Kathy's' murder won't let him rest, and he has to confess... which, Nick knows, means turning him in as well. As if he hasn't lost everything already, Nick reaches his breaking point. He tells Bryce off, calling him out on a lifetime of crude, boorish behavior and that Nick is through with him as a friend. He takes out the stolen Note and returns it to Bryce, confessing the whole screw job he and Lissa tried to pull, showing that Lissa, on her way out to catch a cab, is alive and well, and if she leaves him now, he'll never be able to make it up to her; something he desperately needs to do. Nick follows Lissa outside as the cab arrives. Lissa opens the cab door and stops; looking at Nick for several minutes. Then she shuts the door again and lets the cab go. Best Laid Plans closes with Nick and Lissa starting to go on a walk together. Their financial future and ability to leave Tropico is still in question, but their personal future looks to be on the track to reconciliation and a readiness to face their futures together.",
      "writers": ["Ted Griffin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0133412/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODI1MTUxMTU1OV5BMl5BanBnXkFtZTcwNzc3NDYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Alessandro Nivola, Reese Witherspoon, Josh Brolin | See full cast and crew »"],
      "reviews": [
         "This was a pleasant surprise. I really didn't know what to expect, but what I got was a very intelligent movie with more than enough twists and turns to keep things rather unpredictable. It took a little too long to get everything set up properly, and it perhaps had one twist too many, but overall, it was a great film with strong performances by Alessandro Nivola and Reese Witherspoon. Definitely worth checking out.",
         "When I decided to see the movie, I didn't expect much of it, not more than a level of an usual Saturday night entertainment. But to my surprise, the movie, which first appeared to be a usual sentimental love story, evolved into a decent thriller. Directing is very good at this point, characters are quite \"fresh\", especially the drug dealer with the knowledge of the theory of economics. Actors also do a good job, especially Reese Witherspoon, although she doesn't get as much screen time as Nivola, her presence can be felt. The plot has some very unexpected turns, which make it very good, and the script is also above average. I give it 7/10, not a masterpiece, but some good entertainment.",
         "I just picked Best Laid Plans up at the video store simply because there was nothing that looked better. Well, even though this isn't a great film, it was probably better than all those other videos in the store that day! Best Laid Plansd is a dark crime thriller about Nick (Alessandro Nivola) who needs to raise some cash urgently to pay off some mob debts. He enlist his girlfriend Lissa (Reese Witherspoon) to seduce an old college buddy, Bryce (Josh Brolin), out of his cash and to cry rape. However, things do not go to plan when Bryce takes Lissa hostage and asks Nick for advice on what to do. Director Mike Barker has really gone for the Tarantino side of filmmaking, which he does impressively. Surprisingly, Best Laid Plans is actually better than some of the Quentin Tarantino projects, including Reservoir Dogs and Jackie Brown. It is more intriguing and clever than those two films due to an excellent screenplay and some really good performances; particularly from the rather unlikeable Alessandro Nivola and the stunning Reese Witherspoon. Not faultless, but perfectly watchable and recommendable. I rate Best Laid Plans 7 out of 10.",
         "Screenwriter Ted Griffin takes a page out of the David Mamet book with this story of the things we do for love and money, and how desperation has a way of leading even the most forthright among us into regions beyond the known. And the fact that there is no such animal as a sure thing is pointedly expressed in `Best Laid Plans,' a drama/thriller directed by Mike Barker, and starring Reese Witherspoon and Alessandro Nivola. The film begins with a meeting in a bar between Nick (Nivola) and Bryce (Josh Brolin), old college chums who have not seen one another since graduation. Over a few rounds of drinks, they get reacquainted; Bryce is back in town to teach, while Nick has secured employment at the local recycling establishment. They do the good-to-see-you-again thing, and Nick leaves. But at about two o'clock in the morning, he gets a call from Bryce, who begs him to come over to his house (actually one he's watching for some friends who are out of town). Nick doesn't want to go, but Bryce sounds desperate and he can't refuse. What he finds when he gets there is something totally out of left field. Suffice to say, it involves a young woman named Lissa (Witherspoon), whom Bryce picked up in the bar just as Nick was leaving. It's not a pretty situation, and Bryce doesn't know what to do; so it falls to Nick to figure it out. And now, having crossed that proverbial line in the sand, Nick's involved, too. Or so it seems. But then again, maybe there's more to this than meets the eye. There's just something about this whole set-up that instinctively tells you that what appears to be, ain't necessarily so. The question is, what is it-- and who is doing what to whom exactly? Barker has fashioned a fairly involving film from a story that initially seems somewhat convoluted, but which evolves, and later can actually be regarded as having a plot that is quite intricate and credible, making the comparison to Mamet entirely valid. The difference between this film and one of Mamet's, however, lies in the fact that Barker simply doesn't have that Mamet touch when it comes to presenting the material. He does a decent job, but lacks the finesse, the eye for detail and the grasp of what it takes to achieve that necessary sense of mystery that could have taken it to a much higher level. It lacks that sense of fear and menace, and the urgency it needed to be really effective. Barker does manage to give you enough to sustain interest, but his pace is wanting; there are moments when the pulse of his film simply flatlines. Nivola is clearly the star of the show, and his performance is passable, but he lacks that extra something, that quality, that would have made his character anything special or memorable. Nick is believable, but too common; there's simply nothing distinctive enough about him to make you care much what happens to him one way or the other. On one hand, it's good acting-- the character is real-- but he's a guy who leaves you fairly nonplused; he needs a hangnail, as it were, a flaw that would have at least made him interesting. Witherspoon gives a good performance, but this character is certainly not a stretch for her, by any means. Lissa, like Nick, is rather nondescript, and Witherspoon does little to spark much interest in her. In her defense, however, Barker really doesn't afford her the time nor the opportunity to do much exploring by way of characterization. But she is watchable, and fans of hers, especially, will no doubt find her work here satisfying. As Bryce, Josh Brolin is disappointing, giving a one-note performance that is flat and forced. Granted, his character is supposed to be something of a nerd, but he puts nothing into it; a bit of nuance would have done wonders for his portrayal, and it's the kind of character that is ripe with opportunity, like a blank canvas just waiting to be shaded and textured. But Brolin dropped the ball, and Bryce ends up being completely forgettable. The supporting cast includes Gene Wolande (Lawyer), Jonathan McMurtry (Vet), Rocky Carroll (Bad Dude), Jamie Marsh (Barry), Michael McCleery (Recycling Owner), Michael G. Hagerty (Charlie), Terrence Dashon Howard (Jimmy) and Sean Nepita (Freddie). A very average movie, but with enough twists and turns to keep it interesting, `Best Laid Plans' nevertheless comes off as inexplicably lackluster, given the storyline. This one had the potential of being a real edge-of-your-seater, but instead fails to stir the blood much at all. Performances aside, the story alone makes it worth a look; just don't expect too much. It takes some effort to get into it initially, and by the end you'll be reflecting on what a great movie this `almost' was. I rate this one 6/10.",
         "Long live Mike Barker! This fairly fresh feature director has pulled off one of those rare tributes to the film noir scene, which once coloured the movie scene in the past. There have been worthy efforts, but this one seems to have it all right. The movie starts as most movies from Mike Barker start. Circumstances found as in the traditions of working class realism found in the films of Ken Loach and the novels of Alan Silitoe, colour the first couple of scenes. The story starts with a scene in which is explained that Bryce (Josh Brolin) has 'accidentally' raped a minor. He calls his old university buddy friend Nick (Nivola) to help him out. At this moment the story rewinds to 4 months earlier and we can peak in the history to see how this problem started. Nick has just lost his father, found out he doesn't get any money, and works at a recycling plant. He than engages in some criminal activities, which turns horribly sour and he ends up owing 15,000 dollars to a local criminal. Now, that's all you need to know about the storyline, there are so many plots and twists that even the most critical movie fan would be impressed by the surprises that are being thrown at you. The last time I experienced such a feast, was during the Usual Suspects, and that is quite a compliment. Reese Witherspoon (Lissa, nick's girlfriend and the 'raped' minor) pulls off one of her more impressing acting roles since 'Freeway' Although a bit more constraint than her role in Freeway, her presence definitely enriches the movie. Allessandro Nivola (Nick) will await a big future. His nonchalance acting and worried looks, will make him the perfect actor for sub-blockbusters. Finally one of his bigger roles after movies such as Inventing the Abbotts and Face/Off. Josh Brolin is less appealing, but even he is not bad enough to ruin this movie. Mike Barker continues his strong line of work, after The James Gang in '97. And in a sort of way, this movie resembles his previous to some aspect. In both movies poor families take center stage, and in both movies they are resulting in criminal activities because of the financial trouble they are in. Barker is definitely one of the most artistic directors around (up there with Scorsese), but one wonders if he doesn't overdue it a bit sometimes. Even these minor negative things can't make me change my mind that this is a great movie, cinematic wise, with a well written script, that the characters are well thought out and acted, and that Barker has proven himself once more that he is a major talent. Bravo!",
         "Like the title might suggest, I'm sure there were some great ideas behind this movie, but they got lost trying to come together. It's a fairly watchable thriller for most of the running time, mostly due to Nivola and Witherspoon giving muted performances. But the problem with this kind of thing is that it just isn't clever enough to really outsmart the audience. It isn't necessarily that you know what's coming, but the fact that you know SOMETHING is coming, some kind of twist, that it has to be pretty off the wall to take you in. Unfortunately, here the movie plunges into farce and it's a let down after an often tense, and well calculated build-up. Still, Nivola is always nice to watch :-)",
         "In brief this film should have done better than it did. The cast are good, the cinematography is very pleasing. The sets and costumes are great. The soundtrack is also pretty good. Really good story that improves the more you watch it. At least you will think a little bit during and after the film as so many situations are raised. Makes living in small town America look pretty desirable. Also makes you think about the people you grow up with. Give it a shot!",
         "This is basically an idiot-plot movie. It is a succession of forks in the road for various characters. At each fork the character is offered two or more choices. One is normally by far the easiest, sanest, and most obvious choice, which would almost certainly remove him from harm's way, and of course, end the movie. The other is the choice only an idiot would make, putting him into even more trouble, and of course, allowing the movie to wallow along until the next choice. Some of these choice scenes fall out of the sky, never being set up in the slightest, making the story-telling crime far worse. In the scene in the rich guy's house, there are innumerable choices which would resolve the situation. All are ignored by the characters. They actually work at making the situation worse so that they can then make the idiot choice. This is a movie clearly written by a very young man. How do I know this? Because young writers, particularly young men, for reasons known only to them, worship the plot device where coincidences combine. It is acceptable in story telling to have coincidences, accidents, and pure bad luck drive the characters into worse and worse trouble, but never to get them out. In this movie, these coincidences at time do both. How do the bad guys know that the good guy will be driving his car past a point where they all just happen to be lying in wait? Only because the screenwriter said so, that's why. And it's idiotic. And the fire by the road? What's that about? It could have been an effective setup for a final, and very satisfying twist, but it wasn't. This was clearly a low-budget movie and they either spent a lot of money on all those fire trucks and police cars or the local government threw them in to have a movie shot in their hick town. Either way, it was a huge amount of set up for no payoff. And finally, the director disease. He should pay more attention to his characters and less to his camera. If you are going to plant your actors on a rotating platform so that they and your camera can continually rotate 360 degrees, thereby spinning the room, you should do one of two things. Either have the actors saying dialog so compelling that the spinning room goes unnoticed, or have them saying no dialog, so that the spinning room has some meaning. Otherwise you have the audience wondering what the heck is going on. And if you're going to have a door looming in the foreground, constantly moving, either assign it some significance or have a grip hold it still. There was no fancy camera angle left unexplored in this movie. Unfortunately there was a lot of story, character, and motivation also left unexplored.",
         "Lissa (Reese Witherspoon) accuses Bryce (Josh Brolin) of rape, and then the film unfolds in interesting ways as we see how Nick (Alessandro Nivola) plays a part in her past and their future. The film relies on the universal desires for love, sex and money. Bryce just wants to get laid, Lissa pretty much just wants love but Nick wants both love and money. His plans to get that money get in the way of other dead-end criminals also wanting money. As the film's title suggests, no plans go quite as according to plan. The various twists in getting the plans foiled weren't particularly ingenious but they were well done. I never quite knew what was coming next, but I always wanted to find out. A crime drama thriller with some crimes but minimal violence, and although it seems a bit slow there is enough intrigue to keep the suspense level, or at least interest, up. \"Best Laid Plans\" stars three great actors at the beginning of their careers, and each proved why they have become the respected-stars they are. I recommend it to fans of crime drama thrillers and to fans of Reese Witherspoon, Josh Brolin, or Alessandro Nivola.",
         "SPOILERS - Note to self: Boyfriend gets suckered into being the driver for $40,000 drug heist, turns out to be fake, all were in cahoots to get $20,000 of his inheritance to help pay college tuition, inheritance was actually zero, thinking he was really in trouble he and girlfriend (Witherspoon) attempt to pull off heist of pardon signed by Abe Lincoln, that goes awry, friend (Josh Brolin) drags and ties Witherspoon in basement of house he is sitting for, boyfriend pretends he smothers her, carries her out, car is highkacked, he eventually discovers the scam. But they leave town together, broke, but maybe wiser. The writing and nicely convoluted story are clever, no one really gets killed, or even harmed. However lots of bad language. Glad I saw it, being a fan of Witherspoon, it is always interesting to see what she does with a role. Josh Brolin is also excellent."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "Dogstar Films",
         "Fox 2000 Pictures"
      ],
      "summaries": [
         "Nick is caught in a dead end job in a dead end town. About the only thing going well for him is Lissa, his new girlfriend. A chance to make some easy cash, and a way out of town, only leads to more trouble. Also caught in the web of sex, thefts, gangsters, kidnappings and murder is Nick's college friend, Bryce.",
         "A seemingly simple plan to steal money goes increasingly awry."
      ],
      "budget": 7000000
   },
   "movielensId": 2842,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1999-04-09",
      "dvdReleaseDate": "2000-02-22",
      "directors": ["Mike Barker"],
      "runtime": 92,
      "movieId": 2842,
      "title": "Best Laid Plans",
      "mpaa": "R",
      "actors": [
         "Reese Witherspoon",
         "Alessandro Nivola",
         "Josh Brolin",
         "Gene Wolande",
         "Terrence Howard",
         "Jamie Marsh",
         "Teddy Vincent",
         "Jane Morris",
         "Rebecca Klingler"
      ],
      "imdbMovieId": "0133412",
      "originalTitle": "Best Laid Plans",
      "genres": [
         "Drama",
         "Thriller",
         "Crime"
      ],
      "youtubeTrailerIds": ["6yCcxhVFQdc"],
      "plotSummary": "Rich, successful Bryce meets beautiful Lissa at a bar one night and invites her back to his house, not suspecting for a moment that Lissa isn't really who she seems. What unfolds next is a dangerous, tangled web of double-crosses and seduction.",
      "tmdbMovieId": 18621,
      "avgRating": 3.20114,
      "releaseYear": "1999",
      "numRatings": 440,
      "posterPath": "/cuGI1gMEAaAdvtS8u031f2kY5GH.jpg"
   }
}