{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0178988",
      "video": false,
      "title": "Whiteboyz",
      "recommendations": [
         14530,
         44647,
         14963,
         126442
      ],
      "backdrop_path": "/nnueg4WN1BnrfsD9RKHv2PqrZnY.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Flip",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d359b",
               "name": "Danny Hoch",
               "profile_path": "/xW84pRsS0w674ckDoUFwZICkmYL.jpg",
               "id": 124909,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sara",
               "gender": 1,
               "credit_id": "52fe45a8c3a36847f80d359f",
               "name": "Piper Perabo",
               "profile_path": "/mbppilPlKFHes1kGouS3kRMxzgq.jpg",
               "id": 15555,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Don Flip Crew #1",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35a3",
               "name": "Dr. Dre",
               "profile_path": "/lPcS1QAULXTZP53ogsYSW4bZAOe.jpg",
               "id": 2041,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Don Flip Crew #2",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35a7",
               "name": "Fat Joe",
               "profile_path": "/dKAyXMKReHmcf03B6Uol3QpZyOA.jpg",
               "id": 59785,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Khalid",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35ab",
               "name": "Eugene Byrd",
               "profile_path": "/ab4zEcqdBSjpaz4CPQ2Z6q4rLmO.jpg",
               "id": 342,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "James",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35f1",
               "name": "Dash Mihok",
               "profile_path": "/jnruNUJv57nNtO66SR3oJ5tQuM5.jpg",
               "id": 6066,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Trevor",
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35f5",
               "name": "Mark Webber",
               "profile_path": "/s7QzjQ8qiaN7P2MSMa5NWkmefbd.jpg",
               "id": 4451,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Foreman",
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d35fd",
               "name": "William N. Mayberry",
               "profile_path": null,
               "id": 1102477,
               "order": 8
            },
            {
               "cast_id": 21,
               "character": "Traitor",
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d3601",
               "name": "Eric Rivas Quiroga",
               "profile_path": null,
               "id": 1102478,
               "order": 9
            },
            {
               "cast_id": 22,
               "character": "Himself",
               "gender": 2,
               "credit_id": "563bcec992514178190025ef",
               "name": "Snoop Dogg",
               "profile_path": "/qj4dRFASr1LCxFvCg8hZ73ZlO2r.jpg",
               "id": 19767,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35b1",
               "name": "Marc Levin",
               "profile_path": null,
               "id": 82286,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d35b7",
               "name": "Garth Belcon",
               "profile_path": null,
               "id": 1078460,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35bd",
               "name": "Danny Hoch",
               "profile_path": "/xW84pRsS0w674ckDoUFwZICkmYL.jpg",
               "id": 124909,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d35c3",
               "name": "Garth Belcon",
               "profile_path": null,
               "id": 1078460,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35c9",
               "name": "Danny Hoch",
               "profile_path": "/xW84pRsS0w674ckDoUFwZICkmYL.jpg",
               "id": 124909,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35cf",
               "name": "Marc Levin",
               "profile_path": null,
               "id": 82286,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35d5",
               "name": "Richard Stratton",
               "profile_path": null,
               "id": 1005504,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d35db",
               "name": "Henri M. Kessler",
               "profile_path": null,
               "id": 1078475,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35e1",
               "name": "David Peipers",
               "profile_path": null,
               "id": 1078483,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45a8c3a36847f80d35e7",
               "name": "John Sloss",
               "profile_path": null,
               "id": 3727,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45a8c3a36847f80d35ed",
               "name": "Mark Benjamin",
               "profile_path": null,
               "id": 1001798,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 0.31971,
      "production_countries": [
         {
            "iso_3166_1": "FR",
            "name": "France"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 40879,
      "vote_count": 5,
      "budget": 0,
      "overview": "In a virtually all-white Iowa town, Flip daydreams of being a hip-hop star, hanging with Snoop Doggy Dogg and Dr. Dre. He practices in front of a mirror and with his two pals, James and Trevor. He talks Black slang, he dresses Black. He's also a wannabe pusher, selling flour as cocaine. And while he talks about \"keeping it real,\" he hardly notices real life around him: his father's been laid off, his mother uses Food Stamps, his girlfriend is pregnant, James may be psychotic, one of his friends (one of the town's few Black kids) is preparing for college, and, on a trip to Chicago to try to buy drugs, the cops shoot real bullets. What will it take for Flip to get real?",
      "similar": [],
      "original_title": "Whiteboyz",
      "runtime": 92,
      "poster_path": "/k5hHP3JaD6wak6ovkuZL7Ggqzyz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "BAC Films",
         "id": 5821,
         "origin_country": ""
      }],
      "release_date": "1999-09-10",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "They dreamed of the ghetto...But they woke up in Iowa.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Marc Levin"],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Garth Belcon",
         "Danny Hoch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0178988/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3MTU4ODE2M15BMl5BanBnXkFtZTcwODg3MzcyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Danny Hoch, Dash Mihok, Mark Webber | See full cast and crew »"],
      "reviews": [
         "As I read reviews of this movie I just can't keep feeling like most of you just don't get it. I'm reading comments here on IMDb like \"white boys trying to act like they are black (c'mon that is terrible)\" or \"can someone say Wigger...\". You are missing the point. This movie is simply one big satire of young white teenagers who grow up in decent or rich environment (or Iowa) idolizing the ghetto life that they see on MTV and trying to mimic it. As a product of a large city public school system in the mid nineties I saw these kinds of kids every day. It's pretty depressing actually. Low self-esteem kids with terrible identity disorders trying so desperately to find themselves. Or not? Maybe most of them just don't know how to act. Whatever it is I'd have to say that this movie was on point with every aspect of this kind of lifestyle. For someone like me, who went to school with kids like this, Whiteboyz is a hilarious movie! Flip dog is just so incredibly lost in his gangster world, working out scenarios with Khalid before his talks to him, rapping in front of the mirror, etc. Khalid even tries to explain this to Flip and Flip is so lost he just doesn't understand what he is telling him. Khalid was probably the most normal kid in the movie. He respected his Mom, he has aspirations to go to college, and wasn't all about getting in trouble. What was the most revealing about what this movie was trying to do was the scene where James comes out of his \"gangster\" act and starts ranting racial slurs. Did James have multiple personalities? No. How could you miss the point after seeing that? There are plenty of people I'd like to show this movie to but sadly they won't get it. It's definitely one of the funniest movies I've ever seen. It was acted out perfectly and just down right hilarious. Unfortunately, most of the people just don't get it. Recommended as a wake up call to all you gangster white boys out there that grew up in a stable home. Cheers!",
         "I love this movie. It hits the nail on the head portraying suburban white kids trying to be thugs by imitating rappers from MTV. You tend to find more of these kids in backwoods towns and deep in the suburbs than in the inner city and this movie seems more like a non-fiction representation of that ridiculous subculture. They even address the fact that these kids weren't dressing the same years ago or listening to the same music. Basically, acting like these kids is similar to deciding to dress like a cowboy because you start to like country music. Anyone who doesn't like or appreciate this movie - the joke's on you, thug life with a North Carolina jersey.",
         "It took me a few days of flipping past this movie before I finally convinced myself to see what it was about, but I was surprised to find that it was actually entertaining. Whiteboys looks into the lives of farmtown white kids obsessed with black \"gangsta\" rap and the lifestyle that seems to surround it. This movie is filled with funny moments but also has some pretty serious moments. As I read the other comments, I noticed the main people offended was from Iowa, and everyone else just had something go over their head. I can say that even though I've never met any white boys this stupid, it is some wannabees out there who may have saw this movie and saw themselves a little bit. I found it funny the way they saw Khalid because I see that happen all the time. I can't tell you how many times someone has came to me assuming that I automatically know where to get drugs from. On the flip side, it is also some black kids in suburbia who idolize a thug lifestyle and wish to try to live it out,too. So really it not so much about race as it is dealing with growing up, coming of age, and finding yourself and all those things. Oh yeah, you can throw in rebelling from your parents, too. It was intersesting to see how the characters had changed by the end of the movie. I guess I'm done rambling now, but this is definitely worth renting when you've ran out of big name moives to rent, personally I'd buy the DVD but wouldn't spend more that $15 to buy it.",
         "This movie is a landmark film. It may well serve as the most important tool available to young white males to illustrate how incredibly stupid they look trying to be black. I firmly believe that if this movie is shown in schools there may yet be hope for a future for Caucasians everywhere. Stoop Dogg was instrumental in making this film and that's important to note due to the fact that he's come far enough in his career that he no longer needs to placate young \"wiggers\" by reassuring them that they don't look stupid trying to act black, and has gone so far as to make them look stupid directly and make a movie about it. This film did not enjoy wide distribution due to the entertainment industry's fear that white people would stop buying C rap music and they would lose those dollars. I applaud Fox's decision to distribute this film and will make every effort to support them in all of my movie watching choices in the future.",
         "I saw this movie on HBO during my senior year of high school (2000-2001) and thought it was great, and it had a message. It is definitely a message that needs to be spread. Back in the town I grew up in in Upstate New York, the \"whigger\" thing (white n 1gger) was really big to the point where I was probably the only kid in my town who still dressed normal and listened to heavy metal and punk instead of rap. It really got to be aggrivating because I couldn't relate to hardly anybody accept my close circle. Then I saw this movie and after the end, I am thinking that all of these kids at my school should take a look at this movie and then take a look at themselves. I loved Danny Hoch's performance by the way. As far as a rating, I give this movie a 7 on my scale of 0 to 10.",
         "i can understand why the makers of this film would want to exaggerate the situation, but i didn't think it need to be set in Iowa. as previous users have mentioned, Iowa is not drug- and black-free, but its image is of wholesome, all-white nostalgia. i didn't really buy Danny Hoch's Flip as an Iowa native, he still sounds too Brooklyn. i think it would have been better if it taken place in Jersey, but i understand the director's desire to show just how far Flip stretches. That said, i think it's a brilliant, if flawed, movie. it spends a bit too much time watching Flip do his misguided thing, before getting to the climax in Cabrini-Green. Hoch is great at affecting that 'what the hell is going on?' look, and tho this may sound weird, he doesn't overplay the character, except when he's in full blown hip hop mode. other than that his character is completely believable. he nails that character so well, the guy we've all known who has some idea in his head so large he can't hear anything else. Until he takes it too far.",
         "Someone needed to make a movie like this, a commentary on how white suburban teenagers have latched onto hip-hop and \"ghetto\" culture, and made it part of their identity, when in reality they don't have a solitary clue of what it means to be Black in America. Someone needed to make a movie that made the point that white America's affinity for Black culture rarely translates into actual understanding of Black people as actual human beings, or into an understanding of their situation. Someone needed to make a movie that showed hip-hop-as-consumed-by-white-kids as what it is: a new version of a very old theme in American popular culture -- the Black man as dirty savage, cunning and dangerous, yet stupid and witless at the same time. But \"Whiteboys\" is not this movie. The movie can't seem to decide if it's a comedy or a cutting social commentary, or both. So it fails as both. The central problem is that the main characters are stereotypes themselves, the East Coast-imagined version of what someone in Iowa is supposed to be like. It's impossible to believe that Flip and his gang are for real. Flip especially comes off as a delusional mental patient, not as a misguided, out-of-touch kid. The images of farm life were as cartoonish as the images of hip hop life the movie was mocking. Perhaps this was part of the point, but all of the overlapping of targets of parody just made the whole matter confusing. The movie would have been much better off if had ditched the whole Iowa-farmer theme, stopped reveling in stupid images of kids rapping in farm fields, and instead focused on a group of kids in Any-Suburb USA, the kind of kids that we all have met -- privileged white kids who are drawn to the false glamor of ghetto life presented on TV, utterly oblivious to their own privileged station in life.",
         "I get the feeling that this film might've been advertised as a comedy, but yes, it does border on some serious issues that should be acknowledged. Still, there are several scenes in WHITEBOYS that had me busting up, most notably Flip's daydreaming sequences, which has him imagining about being accepted by urban thugs just because he's \"down\" with hip-hop. Overall,I ended up being impressed by this film. Well acted, well written, and well filmed. I would'nt mind catching it again!",
         "I think the movie portrays what is wrong w/ youth these days. Its funny, because im in my mid 20s now and could relate to Flips feelings. Basically, the movie is about an Iowa white kid who thinks he's a gang banger. He goes to Chicago and finds out that things are different. I wish more of the movie would have been based in Chicago rather than in Iowa. It would have been a little better. Overall, I think its a interesting movie. Nothing too special, but I didnt fall asleep. In conclusion, If Piper Perabo reads this, please email me! :)",
         "Danny Hoch is Flip, a kid living in Iowa who believes that he is a white man trapped in a black man's body. He raps with constant yo yo yo motherf****** and the other common words used in the genre. Along with two other aspiring wiggers, the trio travel to the infamous Cabrini Green housing projects in Chicago with the intent of becoming big time drug dealers. The delusional Flip becomes entangled with some real life gangsters with interesting results. The fantasy sequences are an unnecessary distraction which interrupts the flow of the story. The acting is superb; most especially by the lead, Danny Hoch. He is Eminem with a better sense of humor. Eight Mile is a better movie, as is Gridlock'd with Tupac Shakur. Even so, White Boyz is worth the ride."
      ],
      "genres": [
         "Drama",
         "Comedy"
      ],
      "productionCompanies": [
         "Bac Films",
         "Canal+",
         "Fox Searchlight Pictures"
      ],
      "summaries": ["In a virtually all-white Iowa town, Flip daydreams of being a hip-hop star, hanging with Snoop Doggy Dogg and Dr. Dre. He practices in front of a mirror and with his two pals, James and Trevor. He talks Black slang, he dresses Black. He's also a wannabe pusher, selling flour as cocaine. And while he talks about \"keeping it real,\" he hardly notices real life around him: his father's been laid off, his mother uses Food Stamps, his girlfriend is pregnant, James may be psychotic, one of his friends (one of the town's few Black kids) is preparing for college, and, on a trip to Chicago to try to buy drugs, the cops shoot real bullets. What will it take for Flip to get real?"],
      "budget": 0
   },
   "movielensId": 2845,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-10",
      "dvdReleaseDate": "2005-01-11",
      "directors": ["Marc Levin"],
      "runtime": 92,
      "movieId": 2845,
      "title": "Whiteboyz",
      "mpaa": "R",
      "actors": [
         "Danny Hoch",
         "Piper Perabo",
         "Dr. Dre",
         "Fat Joe",
         "Eugene Byrd",
         "Dash Mihok",
         "Mark Webber",
         "William N. Mayberry",
         "Eric Rivas Quiroga",
         "Snoop Dogg"
      ],
      "imdbMovieId": "0178988",
      "originalTitle": "Whiteboyz",
      "genres": [
         "Comedy",
         "Drama",
         "Music"
      ],
      "youtubeTrailerIds": ["ryZR8L98x40"],
      "plotSummary": "In a virtually all-white Iowa town, Flip daydreams of being a hip-hop star, hanging with Snoop Doggy Dogg and Dr. Dre. He practices in front of a mirror and with his two pals, James and Trevor. He talks Black slang, he dresses Black. He's also a wannabe pusher, selling flour as cocaine. And while he talks about \"keeping it real,\" he hardly notices real life around him: his father's been laid off, his mother uses Food Stamps, his girlfriend is pregnant, James may be psychotic, one of his friends (one of the town's few Black kids) is preparing for college, and, on a trip to Chicago to try to buy drugs, the cops shoot real bullets. What will it take for Flip to get real?",
      "tmdbMovieId": 40879,
      "avgRating": 2.36275,
      "releaseYear": "1999",
      "numRatings": 51,
      "posterPath": "/k5hHP3JaD6wak6ovkuZL7Ggqzyz.jpg"
   }
}