{
   "tmdb": {
      "original_language": "ja",
      "keywords": [
         {
            "name": "cat",
            "id": 977
         },
         {
            "name": "fight",
            "id": 1721
         },
         {
            "name": "chicken",
            "id": 2479
         },
         {
            "name": "barn",
            "id": 3875
         },
         {
            "name": "pig",
            "id": 4931
         },
         {
            "name": "milk",
            "id": 7486
         },
         {
            "name": "survival",
            "id": 10349
         },
         {
            "name": "dog",
            "id": 15162
         }
      ],
      "imdb_id": "tt0097050",
      "video": false,
      "title": "The Adventures of Milo and Otis",
      "recommendations": [
         23438,
         187542,
         65157,
         17971,
         11243,
         15170,
         30059,
         20308,
         6878,
         20721,
         19736,
         15718,
         264364,
         12518,
         21299,
         9409,
         3288,
         6174,
         79500,
         37969
      ],
      "backdrop_path": "/stie1TiQf5fwkpsWCX3kJaw6UIe.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ebe5",
               "name": "Dudley Moore",
               "profile_path": "/k8eIgFXm7shx5ARrIkUuvrqB1hL.jpg",
               "id": 56819,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Poetry Recitation",
               "gender": 1,
               "credit_id": "52fe4750c3a36847f812ebf5",
               "name": "Kyoko Koizumi",
               "profile_path": "/sd0moXkdKHPkSBu9T3VBh1OBb7g.jpg",
               "id": 79456,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec23",
               "name": "Milo",
               "profile_path": null,
               "id": 1116684,
               "order": 2
            },
            {
               "cast_id": 14,
               "character": "Himself",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec27",
               "name": "Otis",
               "profile_path": null,
               "id": 1116685,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Narrator",
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec2b",
               "name": "Shigeru Tsuyuki",
               "profile_path": null,
               "id": 1116686,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ebe1",
               "name": "Masanori Hata",
               "profile_path": null,
               "id": 85311,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ebeb",
               "name": "Masanori Hata",
               "profile_path": null,
               "id": 85311,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe4750c3a36847f812ebf1",
               "name": "Mark Saltzman",
               "profile_path": null,
               "id": 126623,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ebfb",
               "name": "Hisashi Hieda",
               "profile_path": null,
               "id": 1116679,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec01",
               "name": "Masaru Kakutani",
               "profile_path": null,
               "id": 82952,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4750c3a36847f812ec07",
               "name": "Haruo Shikanai",
               "profile_path": null,
               "id": 1116681,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "57210d2fc3a368118e0008d0",
               "name": "Ryuichi Sakamoto",
               "profile_path": "/sznCz9OIUYxBgNhn7hsd9LK5jsN.jpg",
               "id": 11382,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57210d379251414235000934",
               "name": "Michael Boddicker",
               "profile_path": null,
               "id": 69161,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "57210d3e9251414494000869",
               "name": "Hideo Fujii",
               "profile_path": null,
               "id": 1116682,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "57210d459251414240000960",
               "name": "Shinji Tomita",
               "profile_path": null,
               "id": 1116683,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 3.465,
      "production_countries": [{
         "iso_3166_1": "JP",
         "name": "Japan"
      }],
      "id": 47951,
      "vote_count": 63,
      "budget": 0,
      "overview": "The story of two animals and their adventures. Milo, the cat, and Otis, the dog, are two animals who grew up together on the same farm. One day, the two are separated and begin a journey to find each other. The adventurous, and often perilous quest finds the two animals traveling across mountains, plains, and snow-covered lands searching for one another.",
      "similar": [
         9598,
         16859,
         75174,
         10340,
         290512,
         281957,
         336843,
         9986,
         5876,
         7191,
         9433,
         9447,
         6878,
         10345,
         11228,
         371645,
         249,
         3980,
         244316,
         36040
      ],
      "original_title": "Koneko monogatari",
      "runtime": 90,
      "poster_path": "/lBxvuwlwdOYkSuIUkVm4ddtbM2Y.jpg",
      "spoken_languages": [{
         "name": "日本語",
         "iso_639_1": "ja"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Fuji Television Network",
         "id": 3341,
         "origin_country": "JP"
      }],
      "release_date": "1986-06-27",
      "vote_average": 6.7,
      "belongs_to_collection": null,
      "tagline": "Milo is one lucky cat. He's got nine lives and a best friend.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Japan",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Masanori Hata"],
      "runtime": 90,
      "synopsis": null,
      "writers": [
         "Masanori Hata",
         "Mark Saltzman"
      ],
      "originalLanguage": "Japanese",
      "imdbLink": "http://www.imdb.com/title/tt0097050/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1MDcyNDk0Nl5BMl5BanBnXkFtZTYwNDkxNzg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Kyôko Koizumi, Dudley Moore, Søren Kragh-Jacobsen | See full cast and crew »"],
      "reviews": [
         "Ever since I was 5 or 6 I would always go to the local video store and ask to rent the same movie ( Milo and Otis ) until my mom finally bought it for me. Milo and Otis is one of the few films of all time that cannot be classified into any genre. It is a film meant for all, a true celebration of life. If you have a heart, which you all do, then you will deeply feel this celebration. It's emotional and spiritual level cannot be surpassed or defined. Some shallow people get turned off because they think the animals have been hurt. If you only knew Masanori Hata's life. He has his own island, Hakkaido, where he spent 4 or 5 wonderful years loving and viewing these animals behaviors, and is one of the biggest animal lovers of all time. Why would he put these animals in harm's way, him of all people? I would worry more about Hollywood films than him, because he is such a deep, devoted person to all animals. Watch this film, young or old, and you will be touched in a very genuine way. It truly is a celebration of life. Watch for symbols of all sorts and be led into this unhindered, unpredictable, and yet insecure and innocent loving world. This story will take you to that special place and invite you to experiance life, and will as assuredly inspire and move you. See for yourself...",
         "I first saw this movie because the kids demanded to see it. I was pleasantly surprised to find that \"Milo and Otis\" is incredible! Sure, it is \"cute\" enough for kids of all ages-- but it is also meaningful and real for adults, even if it might be best enjoyed as an allegory or fable. The scenes are beautiful, and the cinematography is amazing, in the stunning Japanese naturalist style. The story is bold and loving; I found humor, interest, and positive encouragement and -- dare I say it so cornily? -- life lessons. Because it is so charming, as well as entertaining, I found it to be an excellent \"date\" video! The kind of women I am attracted to most, tend to find this movie (at least for one viewing) a pleasant alternative to regular fare. I rate it a solid \"10,\" and recommend it to adults-- You'll enjoy it!",
         "\"The Adventures of Milo and Otis\" is a wonderful film about a pair of cute animals, an orange cat named Milo and a pug named Otis, who have been separated from each other and their home. Milo and Otis, best friends since birth, grow up on a small farm and lightheartedly enjoy their youth together, having fun with the other animals and playing games, their favorite being hide-and-seek. One day, Milo finds the perfect hiding spot in a box tied to a pier on the river, but the game turns serious when the box starts to float downriver away from the farm. Otis, loyal friend that he is, runs alongside the box, trying to help Milo, but eventually, the two animals are separated and lost from home. The movie follows the two animals on their quest to reunite and find their way home, as they tumble through exciting adventures and close calls. Directed by Masanori Hata, \"Koneko monogatari,\" to cite the film's original title, was produced and released in Japan in 1986, achieving box office success in the Asian country. The film made its way to the United States and was released in 1989 by Columbia Pictures. The American edition is 76 minutes long, 14 minutes shorter than the Japanese version's 90 minutes. The American version is narrated with charm and enthusiasm by Dudley Moore, who creates distinct characters using nothing more than his voice. The film works on nearly all levels. Although some heard-hearted adult viewers may find its plot simplistic and its humor childish, we must not forget that the film is, after all, a fable made for children. That the movie speaks to an adult audience with respect and profundity is to its credit and an indication of its brilliance. The cinematography by Hideo Fujii and Shinji Tomita captures the Japanese countryside beautifully, and the filmmakers show themselves to be masters of color and composition, depicting moments of true beauty such as the gentle trickling of water from a stalactite in a cave. The film features a gentle instrumental score by Ryuichi Sakamoto that nicely complements the action. The song \"Gonna Take a Walk Outside today\" by Michael Boddicker bookends the American version. Often compared to and, unfortunately, confused with the Disney film \"Homeward Bound: The Incredible Journey,\" \"The Adventures of Milo and Otis\" is by far the superior film. The Disney film also features animals (in this instance, two dogs and a cat) trying to make their way home. The film surrounds this adventure home with an inane subplot involving the animals' owners (a family led by Robert Hays), who are searching for their lost pets. The Disney film lacks any subtlety or charm, dragging its animal heroes (voiced by Sally Field, Michael J. Fox, and Don Ameche) through sappy moments of forced sentimentality and contrived plot developments. Whereas \"Homeward Bound\" features plain cinematography and lacks the ambition to speak to an older audience or comment on real issues, \"The Adventures of Milo and Otis\" strongly addresses topics like loyalty and friendship. Never pandering to its audience, the film even depicts the tension and jealousy that can arise between friends who become distanced when a love interest develops for one of them. Although the Disney film was released with greater publicity and fanfare, \"The Adventures of Milo and Otis,\" a hidden gem, is far better. \"The Adventures of Milo and Otis\" is a simple fable and its characters exist in a magical world that seems untouched by human civilization. Although Milo and Otis live on a farm, their masters are never referred to or seen, nor is there any sign at all of humankind. A locomotive that nearly runs Milo down represents the only existence of humanity in the film, a possible comment on the lethal power of technology and the destructive side of human nature. By depicting cooperation and friendship between animals (some of which are natural enemies), the film seems to set their interaction as an example to us quarrelsome humans. However, let us not drift from the film's central theme. Above all, \"The Adventures of Milo and Otis\" is a wonderful film about the enduring qualities of loyalty and friendship and, as such, is entertaining for younger and older viewers alike.",
         "I read once where it took the filmmakers four years to make this movie. I don't doubt it. It must have taken great patience to wait and train these animals to do some of these amazing scenes. Where have you ever seen a cat nursing on a pig or a dog hitching a ride on top of a sea turtle, etc.? There are some incredible scenes involving a number of animals. The scenery here is pretty, too. All of the above means that adults should enjoy this as much as the kids. There is nothing offensive in this nothing....nothing. Dudley Moore's storytelling narration is a bit annoying in the beginning but settles down and is just fine, even humorous in spots. Overall, he did a credible job. The movie is short but actually could have been better had it been trimmed another 10 minutes to about 80. If you love animals, you really have to check this film out. Even if don't, the footage is so unique it's worth a look.",
         "Sure, the end result was a very cute movie, but now that I am a parent I would never allow my son to see this film. Every scene includes some horrible thing done to the animal 'actors' in order to get a particular shot. Cats and dogs thrown off cliffs into ocean breakers, riding down whitewater rivers in a box, chased by predators, shaking and wet and caked in snow... it really is a nonstop montage of abusive scenes. The movie was filmed in Japan so it did NOT have the American standard of animal supervision, and it is interesting to note that the disclaimer at the end does NOT say that no animals were harmed. I would never want my son to think that it was ok to treat animals this way, nor would I want to support the film industry in making films this way. The animals in this movie had no idea that it was all \"just pretend\" nor did they give consent. They probably thought they were about to die any number of times during the filming, and that is assuming that none did die, which I'm not too sure of. I think it is important to consider the moral ramifications before viewing this movie or showing it to children.",
         "As a young boy, I had an almost-obsessive love of animals and adventure, and so it should come as no surprise that 'The Adventures of Milo and Otis' was one of my all-time favourite childhood films. Unfortunately, the battered and overused VHS tape on which I had initially watched the film had, for years, been tragically misplaced, and so I'd never had an opportunity to relive the joys and wonders of a film I'd loved for so long. Luckily, however, whilst browsing through a table of children's DVDs at a store, I happened upon this familiar title, and so I wasted no time in snatching it up and purchasing it. Time and maturity, it seems, has done little to dilute the absolute cinematic magic of this extraordinary film. Originally a darker Japanese film entitled 'Koneko monogatari {A Kitten's Story / The Adventures of Chatran},' the extensive 400,000 feet of footage from one-time director Masanori Hata was taken by Columbia Pictures and completely changed, trimmed (from 90 to 76 minutes) and Westernised into the adorable children's tale of a cat named Milo and his canine best friend, Otis. Whilst the Japanese version \u0096 a huge box office success in its home country \u0096 had been narrated by Shigeru Tsuyuguchi, British comedy actor Dudley Moore helmed the American version, providing the voices for all the creatures in the film. Notably, 'The Adventures of Milo and Otis' doesn't contain a single human actor, though we certainly do see traces of human habitation, most noticeably in a train and in Milo and Otis' beloved farmhouse. The film begins at the aforementioned farm, with a pregnant feline mother giving birth to a litter of cats in the upper floor of the barn. One young kitten, Milo, proves himself to be more adventurous and troublesome than his siblings, and an unexpected tumble from the barn loft sees him meeting a young pug puppy by the name of Otis. There is an oddly-touching moment when Otis announces himself to be not a cat, but a dog. Milo tentatively replies, \"but... deep down inside, we're all cats, right?\" Despite being of stereotypically opposing species, Milo and Otis form a life-long friendship, becoming the best of companions and accompanying each other on their numerous exciting adventures. One day, however, during their favourite game of hide-and-seek, Milo jumps into a wooden box beside the jetty, and it is suddenly swept downriver by the current. Otis, seeing his friend in distress, does his best to help, but he is not quick enough to prevent Milo from drifting further and further away from the farmhouse. As the uneasy cat begins to stray into scarily unfamiliar territory, he faces an array of difficult adversities \u0096 including a hungry bear, a flock of seagulls, a venomous snake and a cavernous pit \u0096 though he can always rely on the fact that his good pal Otis will always be in hot pursuit, despite his own share of potentially hazardous situations. Contrary to what some have commentated, 'The Adventures of Milo and Otis' is most certainly a children's film at heart, with a wonderful message of dedication, loyalty and friendship. Perhaps some parents may feel tentative about the scene in which both Milo and Otis' female companions give birth to litters of youngsters; however, it's hardly graphic or obscene in any real way, successfully translating, I thought, the wonder of life and birth. The footage, which was filmed over four years, breathtakingly captures the splendour of the Japanese countryside, containing countless truly inspired moments of photography from cinematographers Hideo Fujii and Shinji Tomita. The lovely field of blossoms, where the kind-hearted doe teaches Milo to frolic, springs straight to mind as a particularly memorable moment. Additionally, adults should also enjoy the narration from Dudley Moore, whose gentle voice and subtle humour speaks to both kids and adults. There is also that infectious theme tune, \"Walk Outside,\" written by Dick Tarrier and performed by Dan Crow. It is unfortunate that a continuous spate of controversy has slightly tarnished this lovely film's name. It is not uncommon to come across completely unfounded claims that animals were tortured and even killed during the making of the film. After carrying out some research of my own, I can find absolutely no substantiated evidence to support these allegations, most of which were probably concocted based on a single viewing of the film. Indeed, there are moments during 'The Adventures of Milo and Otis' when our favourite animal characters appear to be in potentially dangerous situations. Rather than being evidence of clear cruelty, it would be more accurately described as clever film-making. It is often remarkable to realise how effectively carefully-chosen camera angles, quick cuts, slow-motion and trained animals can be used to create the illusion of mortal peril. Additionally, the closing credits proclaim that \"the animals used were filmed under strict supervision with the utmost concern for their handling.\" Though some have affirmed that these titles explicitly avoid the use of the term \"no animals were harmed,\" I venture that this phrase was never of customary-use until after 1989, the year of the film's US release. Unfortunately, the American Humane Association has not issued an animal cruelty review for the film, which would have finally put an end to all the heated debate. Contrary to what some have stated, my humble research has discovered that director Masanori Hata was a respected zoologist who owned a private animal farm near Hokkaido. Also taking into account the large time-span over which 'Milo and Otis' was filmed (in many cases, Hata simply let his animal actors roam free and filmed their natural actions), it seems unlikely that such an animal-lover would allow any of his mammalian friends to come to harm. I regret that so much of my review has been dedicated to such a grim topic, since this is truly a remarkable children's movie, brimming with wonder and magic that is sure to inspire all who see it.",
         "this movie is excellent, kids love it and it's fun for adults, too. the animals are adorable, and the narrator is perfect. i love the complete absence of humans throughout the movie. far preferable to other animal movies in which the animals talk (which is just an cheap way of getting around the communication problem in animal movies). instead of a slap-dash disney-type production, this is more like a storybook that someone has really taken the time to bring to life.",
         "I originally looked up this movie on IMDB because something triggered my memory of this delightful movie. 25 now, I have not seen this movie in many years, so I was slightly surprised (Though I should not have been) when other viewers commented on the inhumane treatment of animals during the filming of this movie. As an initial note- STOP COMPARING THESE ANIMALS TO STUNTMEN! Stuntmen and women have the free will and prerogative to perform in movies or not. Animals do not have the same choice. By virtue of the fact that animals can't drive themselves to auditions or to the movie set, it should be clear that OWNERS, not ANIMALS made the decisions to be in this and other movies. The comparison is inane. I thoroughly enjoyed this movie as a young teen, but recognize now that the price undoubtedly paid by these animals was not worth 90 minutes of viewing enjoyment. If you choose to be entertained by a story of friendship between species, go to your local ASPCA and adopt a cat and a dog. The bond will be genuine, and the amusement value will last much longer than 90 minutes and you'll be promoting compassion to animals rather than abuse and mistreatment.",
         "Throwing kittens off a cliff for entertainment? I couldn't believe my eyes. Shocking. I wonder how many cats died making that particular shot. The animal abuse in this movie is so apparent, it's amazing this got aired at all. My girlfriend and me tried to watch this, hoping for a sweet movie; we own a pug and kitten, we did not know what was in store for us. The rest of the night we will spend comforting our pets, they are in a state of shock! I would love to put the people making money of this through the same horrors they put the animals through. Great movie if you hate cats. article about the animal abuse in this movie: http://theculturalgutter.com/movies-2/is_milo_in_heaven_mommy.html",
         "\"Koneko no Monotagari\" is a rather enjoyable animal flick about a dog and cat going their own ways in the Japanese wilderness,running into danger and eventually finding their mates.The Japanese version is way better,despite the graphic kitten/puppy birth scene. It's cute but not overly cute and the narration and poem makes it sound so much like a storybook.I prefer this over \"Babe\" any day!"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "productionCompanies": ["Fuji Television Network"],
      "summaries": [
         "The story of two animals and their adventures. Milo, the cat, and Otis, the dog, are two animals who grew up together on the same farm. One day, the two are separated and begin a journey to find each other. The adventurous, and often perilous quest finds the two animals traveling across mountains, plains, and snow-covered lands searching for one another.",
         "The adventures of a young cat and a dog as they find themselves accidentally separated and each swept into a hazardous trek."
      ],
      "budget": 0
   },
   "movielensId": 2846,
   "movielens": {
      "languages": ["日本語"],
      "releaseDate": "1986-06-27",
      "dvdReleaseDate": "1999-08-31",
      "directors": ["Masanori Hata"],
      "runtime": 90,
      "movieId": 2846,
      "title": "The Adventures of Milo and Otis",
      "mpaa": "G",
      "actors": [
         "Dudley Moore",
         "Kyoko Koizumi",
         "Milo",
         "Otis",
         "Shigeru Tsuyuki"
      ],
      "imdbMovieId": "0097050",
      "originalTitle": "Koneko monogatari",
      "genres": [
         "Adventure",
         "Drama",
         "Family"
      ],
      "youtubeTrailerIds": ["JZSqJWeZXaA"],
      "plotSummary": "The story of two animals and their adventures. Milo, the cat, and Otis, the dog, are two animals who grew up together on the same farm. One day, the two are separated and begin a journey to find each other. The adventurous, and often perilous quest finds the two animals traveling across mountains, plains, and snow-covered lands searching for one another.",
      "tmdbMovieId": 47951,
      "avgRating": 3.24835,
      "releaseYear": "1986",
      "numRatings": 1667,
      "posterPath": "/lBxvuwlwdOYkSuIUkVm4ddtbM2Y.jpg"
   }
}