{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "friendship",
            "id": 6054
         },
         {
            "name": "queens new york city",
            "id": 155954
         }
      ],
      "imdb_id": "tt0102741",
      "video": false,
      "title": "Queens Logic",
      "recommendations": [
         256467,
         37041,
         33525,
         43370
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Dennis",
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141259",
               "name": "Kevin Bacon",
               "profile_path": "/rjX2Oz3tCZMfSwOoIAyEhdtXnTE.jpg",
               "id": 4724,
               "order": 0
            },
            {
               "cast_id": 7,
               "character": "Grace",
               "gender": 1,
               "credit_id": "52fe47a7c3a36847f814126d",
               "name": "Jamie Lee Curtis",
               "profile_path": "/c4poMDwQ0nUj81m4WPriiv96ExZ.jpg",
               "id": 8944,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Carla",
               "gender": 1,
               "credit_id": "52fe47a7c3a36847f814125d",
               "name": "Linda Fiorentino",
               "profile_path": "/aKadq5uC9CjCKtkMYPYECNcGz3s.jpg",
               "id": 9625,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Eliot",
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141261",
               "name": "John Malkovich",
               "profile_path": "/tCtiWZbKKRgHhLxFCIPfveYAsdc.jpg",
               "id": 6949,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Al",
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141265",
               "name": "Joe Mantegna",
               "profile_path": "/vd83KyKwcNrxd6EDcezGv16xhsL.jpg",
               "id": 3266,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Ray",
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141271",
               "name": "Ken Olin",
               "profile_path": "/7H4y3RIHaKQfxheKm20ChDBldDa.jpg",
               "id": 129723,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Vinny",
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141275",
               "name": "Tony Spiridakis",
               "profile_path": "/m3SkKw2wET74Gd8cjy1I62VFzXx.jpg",
               "id": 151286,
               "order": 6
            },
            {
               "cast_id": 6,
               "character": "Monte",
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141269",
               "name": "Tom Waits",
               "profile_path": "/3XXe20xrdgUaOchQt5YOQqqSH6u.jpg",
               "id": 2887,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Patricia",
               "gender": 1,
               "credit_id": "52fe47a7c3a36847f8141279",
               "name": "Chloe Webb",
               "profile_path": "/isaPs4B2d5WNr0bLCuxdYvjoY0X.jpg",
               "id": 43476,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Marty",
               "gender": 2,
               "credit_id": "59864699c3a368329b0079fb",
               "name": "Michael Zelniker",
               "profile_path": "/zaFwqfrzss8U4hvLE7DxksKVxKK.jpg",
               "id": 27813,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Maria",
               "gender": 1,
               "credit_id": "598646abc3a368324200741a",
               "name": "Kelly Bishop",
               "profile_path": "/rXjKYHafK17IiqgjWvmZYdmpdo9.jpg",
               "id": 728,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Jeremy",
               "gender": 2,
               "credit_id": "598646bac3a368324200742b",
               "name": "Terry Kinney",
               "profile_path": "/hv6CObyItPeEg5eJzzTb4L1j6DP.jpg",
               "id": 11067,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Jack",
               "gender": 2,
               "credit_id": "598646c6c3a3683276006721",
               "name": "Ed Marinaro",
               "profile_path": "/aDf2e7Tuh9MMHvZNkTM7lBvILPI.jpg",
               "id": 50707,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe47a7c3a36847f8141255",
               "name": "Steve Rash",
               "profile_path": "/t7sZbMXWCHp80p5tPFTnsPY037h.jpg",
               "id": 54590,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "59864670c3a368329b0079c7",
               "name": "Tony Spiridakis",
               "profile_path": "/m3SkKw2wET74Gd8cjy1I62VFzXx.jpg",
               "id": 151286,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "59864675c3a3683251006bbf",
               "name": "Tony Spiridakis",
               "profile_path": "/m3SkKw2wET74Gd8cjy1I62VFzXx.jpg",
               "id": 151286,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "5986467e9251413d4200706d",
               "name": "Joseph W. Savino",
               "profile_path": null,
               "id": 1864311,
               "department": "Writing",
               "job": "Story"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.749409,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 49792,
      "vote_count": 8,
      "budget": 0,
      "overview": "When childhood friends Al, Dennis and Eliot get together for Ray's wedding, which may or may not happen, they end up on a roller-coaster ride through reality. During one tumultuous, crazy weekend, they face adulthood and each other with new found maturity and discover what Queens Logic is all about. This comedy takes a look at friendship, loyalty, and love.",
      "similar": [
         4629,
         44564,
         23168,
         1429,
         40807,
         77338,
         68718,
         50544,
         41630,
         862,
         13,
         72105,
         28178,
         19913,
         8065,
         489,
         509,
         8839,
         277547,
         290762
      ],
      "original_title": "Queens Logic",
      "runtime": 100,
      "poster_path": "/3hFeEhS6xr7f0JUNu5m0okitJai.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Carolco Pictures",
            "id": 14723,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Seven Arts Pictures",
            "id": 14159,
            "origin_country": ""
         }
      ],
      "release_date": "1991-02-01",
      "vote_average": 5.8,
      "belongs_to_collection": null,
      "tagline": "We're Talkin' Human Experience Here!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Steve Rash"],
      "runtime": 108,
      "synopsis": null,
      "writers": [
         "Tony Spiridakis",
         "Joseph W. Savino"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0102741/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI3OTk3NjMzMF5BMl5BanBnXkFtZTcwMzExMzgzMQ@@._V1_SY317_CR51,0,214,317_AL_.jpg",
      "actors": ["Stars: Kevin Bacon, Linda Fiorentino, John Malkovich | See full cast and crew »"],
      "reviews": [
         "Queens Logic is an excellently written film about a bunch of late thirty somethings who are still trying to figure out how to get their act together. I worry that this film is only going to be accepted locally (i.e. New York, Long Island target audience) when it really has a multitude of universal levels to it. The acting was brilliant--absolutely brilliant, from Kevin Bacon to Linda Fiorentino, Joe Mantegna and John Malkevich. The actors really understood these complex characters (Malkevich is SO good once again it's scary). And the writing and direction could not have been better for these roles. Congratulations for writing a script with so many thoughtful, intelligent and original characters which reflect so well on the time and all of our struggles to figure out what it is that makes us happy--and to do it so humorously as well. This is one of those rare very smart and very funny films. Like I said though, people who are not necessarily from the New York area may not buy or believe these characters, but I guarantee you there are so many people like them. Guarantee it. They're great people with same problems as everyone else. They just choose to deal with them on their own terms and in the best format they know how: with Queens logic.",
         "Released in 1991, this movie captures a quality New York possessed in the late eighties. The characters seem genuinely capable of making the wisecracks the script has them make. They're middle-class urbanites who are capable of desperate violence. Yet, they are not particularly violent. They are haunted by the hardscrabble lives of their parents. The story involves a group of people in their early-to-mid-thirties. They've known each other since childhood. The plot is this: Will the scheduled marriage between two members of this group actually take place? While he is not the lead actor here, John Malkovich plays a character who embodies the dilemma each one of the characters faces. Each one wishes he were somewhere else and yet each one would give his right arm for anybody else in this circle of friends. Unlike his friends, he is gay, but what he has in common with them is the sense that the upper-class will have nothing to do with him. He is dating an upwardly-mobile man and his confrontation with him is still refreshing thirteen years after this movie was filmed. Many movies and TV series have dealt with this milieu, but very few have pulled it off. It is not entirely believable--there's an over-the-top story-line with Jamie Lee Curtis as a smooth-talker who enchants the edgy Joe Mantegna--but it's assertive. QUEENS LOGIC is well worth viewing.",
         "I never really had any true friends when I was growing up (I was weird, okay), but I know that the best friends are the ones who stay around. \"Queens Logic\", an under-looked , sleeper indie film (unless you look really hard in the discount DVD bins) starring a name cast, proves that in the largest borough of New York City. Wedding jitters plague Ray (Ken Olin of \"thirtysomething\" and a producer of \"Alias\"), since he's a talented painter born and residing in Queens, and is about to marry longtime sweetheart Patty (Chloe Webb) a hairdresser with a philosophical outlook. His other pals from childhood, fish marketer cousin Al (the talented Joe Mantegna of \"Criminal Minds\"), Al's right-hand man Eliot (John Malkovich of \"Changeling\"), visiting musician Dennis (Kevin Bacon) and working actor Vin (Tony Spiridakis, who co-wrote the film with Joey Savino) help him out by throwing a decent bachelor's party (men and women invited), but they each have their problems. Despite his jester charm, Al's Peter Pan persona irritates his frustrated wife Carla (the sexy Linda Fiorentino); Eliot's a homosexual who has no desire to play \"the love game\"; Dennis's still struggling on making it big in Los Angeles and Vin gets one-night stands but no romance. Adulthood: IT SUCKS! But not this film. Director Steve Rash (\"The Buddy Holly Story\", \"Can't Buy Me Love\" and the two DTV sequels to \"Bring It On\") is competent, but the actors help out more, pumping the tale with humanity, especially Mantegna's breezy, arrested development demeanor, Malkovich's non-stereotypical attitude and Webb's down to earth perspective. Also entertaining is Jamie Lee Curtis as a high society dame, who gives Al a lesson about maturity in a colorful way, and rocker Tom Waits as a gravel-voiced but likable lowlife associate of the gang. Look for a pre- \"Will & Grace\" Megan Mullany as a drunken conquest of Vin's. The film's soundtrack is littered with rock and disco tunes from the 1970s, the decade the guys grew up. Likable, poignant, sly, funny and a love letter to its' backdrop (Queens's Hellgate Bridge is prominent here), \"Queens Logic\" reminds us, despite how we grow up or wherever we are in our lives, the neighborhood we grew up is part of us and vice versa, and the best friends we have reminds us of that.",
         "I grew up in queens in the mid seventies and it's not much different. Look, the film works. It works on so many levels, I can't begin to catalog them all. But for me, it works because, at the end of the day and looking back over thirty years, I knew a few of those guys. Everone has a dream, and the dream has a way of changing as you grow up. But is is rarely the same one you started with. You want to be happy? find a girl you can climb to the top of a building with and howl. Howl your heart and soul out and don't ask why. Or find a woman who \"is Queens\" and don't let her go. And, after all is said and done, it's not always about climbing a bridge. Acting in a movie or painting a masterpiece. What it's about dear readers, is what this movie is about. Friendship that lasts.",
         "I love this film and I can't understand why it hasn't been more popular. Try and get hold of a copy if you can. The cast is amazing - Joe Mantegna, John Malkovic, Linda Fiorentino, Jamie Lee Curtis ( in her best ever role), and Kevin Bacon all giving restrained but emotional performances. The soundtrack is wonderful too. An eclectic mix of songs that work perfectly. It took me a long time to track down the song from the closing credits but it was worth it. It's one of those films that you can watch if you're feeling a bit down and it will lift your mood. Especially recommended if you've had a pointless argument with a loved one!",
         "I have seen a ton of reviews of this movie over the years and I am always shocked and disappointed as to how \"low\" the movie is rated. This is simply one of the best movies ever made. It's that simple. Look at the cast: John Malkevich, Joseph Montegna, Chloe Webb, Linda Fiorentino, Kevin Bacon, Jamie Lee Curtis, Ken Olin, and on and on (including Tom Waits - hysterical as Monte). It is sweet and funny and engaging and the sound track is super. I have the DVD and I have lent it out to friends dozens of times and the before and after is always the same: before \"never heard of it\" - after \"loved it\" --- and it doesn't matter the age or gender or politics of the viewer. Sure it helps if they are from some urban area as opposed to a rural area. And it helps if childhood friendships still mean something to them. But even if you're a lifelong lonely country boy, you should love this movie.",
         "Sentimental, nostalgic and supposedly authentic portray of some people and their relations with great music (Joe Jackson et al.) around a wedding under Hellgate Bridge in Queens. Anger, frustration and ideals reach the surface as we get to know these figures. One of them gives the advice: 'Wanna be happy for the rest of your life? Fall in love with your wife.' Probably the best advice a young man whose dreams don't come together can get. Tom Waits was two years later in Altman's 'Short Cuts' that also deals with several relationships and has no plot. Short Cuts however is more solid and intelligent. This movie is not exceptional in any way, but I've seen it three times already because I think it's a nice movie with good acting about a day in the lives of some young people and that makes me feel good. The chosen music tells about half of the story. That's a very good choice of director Rash, especially since there is no real plot. SO, if you're a person who needs a plot, then don't watch this movie. In that case try 'Chinatown' instead, or 'the Maltese Falcon'. Or kick in another open door :) I don't understand why so few people like this film. But then again I also liked Jade (Friedkin, 1995) and Last Seduction (Dahl, 1994): plotfilms with suspense. Maybe it's just because I like common denominator Linda Fiorentino very much. There is no challenging intellectual material in Queens Logic. 8/10",
         "It is a shame that I could not give this movie a much higher rating. The acting was great. Kevin Bacon played Dennis, a struggling actor in L.A. who returned home for his friend Ray's (Ken Olin)wedding. Bacon does a terrific job playing someone who is superficially cheerful, hiding his insecurities and loneliness. The other actors and actresses were also very good. Joe Mantegna plays Al, an extroverted person, who isn't afraid to be himself. John Malkhovich also does his usual good job, playing Eliot, a man trapped in the machoistic World of Queens, yet struggling with his homosexuality. Perhaps the best scene is when Eliot tells a \"pesky\" homosexual to \"bug off\", because he just doesn't like him. This movie could have been a lot more, but it tried to do too much, didn't explain to the viewer what was going on, and became predictable by the ending. First of all, we never understand why exactly Al's wife, played by Linda Fiorentino, leaves him so suddenly and violently. All we know is that she is mad at him. We similarly understand that Ray is having second thoughts about getting married. We understand that Eliot is kind of an angry character. We never really find out why. Eliot befriends a homosexual pianist. We never really find out much about the pianist, except that he is rather mild mannered. There are also things that just don't help the plot much. Jamie Lee Curtis plays a character who is never really developed well, and in the end we have no idea why she behaved the way she did (and how this changed Al's life). Another scene that doesn't work is the swimming pool scene. Al's wife steals Al and all four or five of his buddies clothing, yet somehow he has spare clothing for all of them in his car. This movie could have been a good movie. Instead, it was confusing and not very well written.",
         "After watching Dogma for the umpteenth time on Comedy Central, I became a Linda Fiorentino fan along with others out there who wondered what happened to this promising actress since 2002. I have seen other films. This one shows that she can play a desperate housewife who can be both strong and vulnerable to her husband played by Joe Mantegna. Jamie Lee Curtis is underused in this role. Fiorentino and Chloe Webb's characters form a believable friendship on screen that I wonder why Linda hasn't worked in five years is a mystery to me. Anyway, it's an all star cast featuring besides Webb, Mantegna, and Fiorentino but also Kevin Bacon, Ken Olin, John Malkovich, and Jamie Lee Curtis. The storyline needs some work. I loved the scene where Carla steals the guys' clothes while they are skinny dipping in a pool. The movie is about a reunion of friends who get together for a wedding that may or may not happen anyway. I plead that Linda gets work soon again because she is really one of the best actresses out there playing strong women rather than weak and superficial.",
         "The only non famous movie on my top 25 list is Queens logic. I dont know why I relate to this movie. Its got a little of everything I like in a movie- comedy, male bonding or whatever you call it, good music, romance, fighting, pain, and a host of other things. Not to mention the incredible cast."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Carolco Pictures",
         "New Line Cinema",
         "New Visions Pictures"
      ],
      "summaries": [
         "When childhood friends Al, Dennis and Eliot get together for Ray's wedding, which may or may not happen, they end up on a roller-coaster ride through reality. During one tumultuous, crazy weekend, they face adulthood and each other with new found maturity and discover what Queens Logic is all about. This comedy takes a look at friendship, loyalty, and love.",
         "An ensemble of friends gather in Queens, their old stomping grounds, for the wedding of Ray and Patricia, an artist and a beautician. Al and Eliot sell fish, one is married and chases women, the other is gay and lonely. Dennis, a failing musician, comes back from L.A.; Vinnie, an actor, comes over from Manhattan; Monte drifts in. Can Ray get past feeling superior to the down to earth Patricia? Will Al's wife Carla convince him to stop philandering? What is it about Queens that inhabits these characters, including a gay man living in a homophobic neighborhood? Can guys this old still come of age? Answers come out during the rooftop bachelor party."
      ],
      "budget": 0
   },
   "movielensId": 2849,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1991-02-01",
      "dvdReleaseDate": "1999-08-31",
      "directors": ["Steve Rash"],
      "runtime": 100,
      "movieId": 2849,
      "title": "Queens Logic",
      "mpaa": "",
      "actors": [
         "Kevin Bacon",
         "Jamie Lee Curtis",
         "Linda Fiorentino",
         "John Malkovich",
         "Joe Mantegna",
         "Ken Olin",
         "Tony Spiridakis",
         "Tom Waits",
         "Chloe Webb",
         "Michael Zelniker",
         "Kelly Bishop",
         "Terry Kinney",
         "Ed Marinaro"
      ],
      "imdbMovieId": "0102741",
      "originalTitle": "Queens Logic",
      "genres": [
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": ["cHYQ1GJU464"],
      "plotSummary": "When childhood friends Al, Dennis and Eliot get together for Ray's wedding, which may or may not happen, they end up on a roller-coaster ride through reality. During one tumultuous, crazy weekend, they face adulthood and each other with new found maturity and discover what Queens Logic is all about. This comedy takes a look at friendship, loyalty, and love.",
      "tmdbMovieId": 49792,
      "avgRating": 2.89706,
      "releaseYear": "1991",
      "numRatings": 204,
      "posterPath": "/3hFeEhS6xr7f0JUNu5m0okitJai.jpg"
   }
}