{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "suicide",
            "id": 236
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "hallucination",
            "id": 3298
         },
         {
            "name": "scientist",
            "id": 14760
         },
         {
            "name": "drugs",
            "id": 14964
         },
         {
            "name": "killer",
            "id": 15127
         }
      ],
      "imdb_id": "tt0106402",
      "video": false,
      "title": "Beyond Bedlam",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Stephanie Lyell",
               "gender": 1,
               "credit_id": "52fe4900c3a36847f8184727",
               "name": "Elizabeth Hurley",
               "profile_path": "/fVcP55KQlaIcOrlHoBGf671kmZb.jpg",
               "id": 13918,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Terry Hamilton",
               "gender": 2,
               "credit_id": "548de933c3a3681d4b002b3f",
               "name": "Craig Fairbrass",
               "profile_path": "/z5WnSqwkM0Ax0Z47etVNmcew5Pn.jpg",
               "id": 51799,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Marc Gilmour",
               "gender": 2,
               "credit_id": "548de949c3a368153b0027eb",
               "name": "Keith Allen",
               "profile_path": "/qLaiCqSlCrcGWETlMWQ4VTJTo9Z.jpg",
               "id": 20056,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Scott",
               "gender": 2,
               "credit_id": "548de970c3a36820b5005524",
               "name": "Jesse Birdsall",
               "profile_path": "/pCN4ozHAznWkDflzeoXukFzF1ou.jpg",
               "id": 137952,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Matthew Hamilton",
               "gender": 2,
               "credit_id": "555407aa9251416dd9000deb",
               "name": "Craig Kelly",
               "profile_path": "/2pQlke638guhP5Fc3FqLYs2YsUx.jpg",
               "id": 18019,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Judith",
               "gender": 1,
               "credit_id": "55543469c3a368208300177a",
               "name": "Anita Dobson",
               "profile_path": "/9gX1DJ2CAfGJZA1bmR2rh3kEDMP.jpg",
               "id": 148543,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4900c3a36847f8184723",
               "name": "Vadim Jean",
               "profile_path": "/oJoE2pf2fLL2tu7eDypw4IBmsUZ.jpg",
               "id": 70905,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "548de9c492514122f9004fad",
               "name": "Vadim Jean",
               "profile_path": "/oJoE2pf2fLL2tu7eDypw4IBmsUZ.jpg",
               "id": 70905,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "548de9dac3a36820b8005198",
               "name": "John Brosnan",
               "profile_path": null,
               "id": 1063134,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "57a379afc3a368295b0035ab",
               "name": "Rob Walker",
               "profile_path": null,
               "id": 1237175,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 0.744943,
      "production_countries": [{
         "iso_3166_1": "GB",
         "name": "United Kingdom"
      }],
      "id": 56428,
      "vote_count": 5,
      "budget": 4800000,
      "overview": "An experiment gone awry places a neurologist (Elizabeth Hurley) and a homicide detective (Craig Fairbrass) in a psychopath's (Keith Allen) nightmarish world.",
      "similar": [
         429733,
         4771,
         357096,
         22825,
         15069,
         15762,
         36647,
         3597,
         22307,
         9538,
         12521,
         168098,
         28355,
         341006,
         321258,
         9373,
         9424,
         2048,
         96,
         979
      ],
      "original_title": "Beyond Bedlam",
      "runtime": 89,
      "poster_path": "/h7hwxnIC997ceboreSmEZo82bAw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Metrodome Films",
         "id": 11139,
         "origin_country": ""
      }],
      "release_date": "1994-04-22",
      "vote_average": 3.8,
      "belongs_to_collection": null,
      "tagline": "Psychological Terror Beyond Your Wildest Nightmares",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["Vadim Jean"],
      "runtime": 89,
      "synopsis": null,
      "writers": [
         "John Brosnan",
         "Vadim Jean"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0106402/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMDkzNTg0OF5BMl5BanBnXkFtZTcwMzk2NTAyMQ@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Craig Fairbrass, Elizabeth Hurley, Keith Allen | See full cast and crew »"],
      "reviews": [
         "As a big horror fan I've learned by this time not to expect all horror movies to be perfect, but it's nice if they at least make sense. This film (playing as NIGHTSCARE on the movie channels, the American ones at least) starts out with the promise of a somewhat intriguing premise and quickly devolves into a confusing mess. The plot, such as it is, gives us Elizabeth Hurley as a doctor studying \"neurotransmitters in the brain\" and delving into unethical medical substance injection in an attempt to cure crazy people, or something like that. It doesn't really matter, since before long the toe-sucking, blood-inking bad guy is chasing Liz and her prospective boytoy around in dreams-within-hallucinations. Is it live? Is it Memorex? Does anyone care? Note to producers: even the unscientific viewer will know that saying things like \"neurotransmitters in the brain\" is like saying \"wires in the radio.\" In other words, the movie is ridiculously vague, relying too much on downright stupid plot twists and underdone action scenes to get its feeble point across. I'm not sure that the English have a right to complain about the sorry state of American film, when they are turning out cheese like this. 3/10. Dumb stuff.",
         "Oh, the pain, the pain! This was a truly awful movie. I saw it on video as Nightscare, and it claimed to be as good as Hellraiser. Dr. Lyell (Elizabeth Hurley) has developed an injection that is supposed to supply the neurotransmitter that psychopaths lack, giving them the positive social traits everyone else has. She apparently only tested it on one other person other than the serial killer Gilmour - herself. Two people die under strange circumstances in the apartment building she lives in. Detective Hamilton feels Gilmour must be involved. None of these characters are interesting, and the acting all around is pretty sub-par. What is going on is unclear, not so much because of any surreal or Lynchian, etc. elements at work, but poor storytelling, editing, directing, etc. Apparently the drug gives Dr. Lyell bad dreams that come true. Or perhaps they create a link whereby Gilmour can make Lyell's dreams come true. However, Lyell and Hamilton both see and feel things happen to them while they are awake, that apparently Gilmour is causing while he is also awake. Lyell and Hamilton encounter people from their lives who are now dead, including people they inadvertently killed themselves. Lyell and Hamilton realize these people are dead, and the dead people tend to repeat whatever they say like broken records, and yet Lyell and Hamilton can't stop themselves from listening to the dead and conversing with them. At other times, Gilmour can apparently transfer himself out of his cell, and transform himself into other people. A mess. The ending is truly awful, the sort of open ending one would expect from someone who hoped to make a sequel. Please, let there be no sequel to this, please!",
         "Gorgeous Elizabeth Hurley is a scientist doing experiments on the human brain in abnormal psychology research. She believes that her new serum will reverse the effects of the unstable properties in the minds of sociopaths such as Gilmour (a Hannibal Lecter like serial killer very well acted by Keith Allen). An unsuspecting side-effect results in Gilmour's ability to create dream-like hallucinations in the minds of Hurley and boyfriend, Craig Fairbass as they relentlessly try to track down Gilmour without being driven to suicide first. This is the British film-makers attempt to blend psychological horror with the \"serial killer loose in a hospital\" sub-genre, and it results in a very confusing and dis-jointed mess. Although, Keith Allen delivers a knock-out performance as a twisted, violent maniac, and the direction along with the overall atmosphere is genuinely scary. Hurley's performance is competent enough (dig those beautiful eyes!), but the violence and tension are beat down by a plot that rarely makes sense due to nonsensical pseudoscience overtones and unexplained suggestions about sexual morality and sin. Nonetheless, It's worth seeing for Keith Allen's acting and its creepily effective mood.",
         "Yes, this is that film, the one where the luscious Liz Hurley decided it was time to do her bit for tabloid journalists everywhere and stripped. Is is worth it to see her? It is a dark and strange film. Hurley is a scientist experimenting with a new drug to control psychos. She is using it on a grade A psychopath Marc Gilmour (Keith Allen) when Terry Hamilton (Craig Fairbrass), a policeman who death with Gilmour in the past finds out and tries to stop her. Too late. The drug enables Gilmour to make his dreams become real. He never leaves his cell, but is manipulating the world around them, using their guilt and fears to terrorize them. It all sound a little preposterous, and it is confusing to follow. The ending is most unsatisfactory.",
         "One of the taglines of this film says : Hannibal Lector meets Freddy Krueger...Well, that's misleading. It should say \"Crap meets utter Crap\" or at least \" We ripped off Hannibal Lector and Freddy Krueger.\" To put it in a few words: this film is very very bad.Beyond Bedlam tries sooo hard to be a strong psychological thriller but it fails in every possible way. There are too many pointless twists and sentimental crap that you don't care about anyway. There even isn't ONE good scene or original element in it. I've seldom seen such a horrible film. I was tired of it after the first 15 minutes. But I still watched it till the end credits rolled. I don't know why neither... Normally, when I see a piece of junk like this, I try to seek at least one good point in it. In this case this isn't even possible. OK, I could name the gorgeous body of the delicious Elizabeth Hurley... But that's hardly worth renting isn't it ? You can find her in all her glory over the net on more than 1.000.000 pages. I really like to believe that she CAN act. She doesn't prove it in this film, though. Liz is like the whole film : inferior. WARNING : HERE MAY BE TINY SPOILERS ... yeah, like you care :-) A horrible psychopath ( appearance obviously stolen from Anthony Hopkins ) is being treated with a new drug. It's supposed to \"cure\" him but of course it has the opposite effect...He becomes more evil. This psycho, Gilmore ( bad choice of name by the way ; even the Gilmore girls themselves were scarier ) now has the gift to enter his victims dreams and to terrorize them there...now, where have I heard that before ??? He uses this new mind-toy to play with the doctor ( Liz ) and the cop who once caught him. Gilmore faces them with their lost relatives and they don't like that of course. Also I would to aim a little word to the writer and director of the junk. What the hell was that ending about ??? That's not what we call and open ending... That's called an UNFINISHED PROJECT ! the rules are rather simple: you get the idea that the villain dies once or maybe twice and then you end the whole thing by suggesting he might come back. Not like this !! You have to check that out for yourself, ladies and gentlemen, it's too stupid for words. In conclusion: I wish I could say this is one of those \"so bad its good\"-films, but no. It's just bad. Period. My humble opinion on Beyond Bedlam : 2 / 10 . One point for each of them lovely Liz Hurley breasts...",
         "Yes, this is that film (AKA Nightscare), the one where the luscious Liz Hurley decided it was time to do her bit for tabloid journalists everywhere and bared her breasts. Is is worth it to see her? It is a dark and strange film. Hurley is a scientist experimenting with a new drug to control psychos. She is using it on a grade A psychopath Marc Gilmour (Keith Allen) when Terry Hamilton (Craig Fairbrass), a policeman who death with Gilmour in the past finds out and tries to stop her. Too late. The drug enables Gilmour to make his dreams become real. He never leaves his cell, but is manipulating the world around them, using their guilt and fears to terrorize them. It all sound a little preposterous, and it is confusing to follow. The ending is most unsatisfactory.",
         "Story revolves around elizabeth Hurley's characther creating a drug that can cure psychos and make them normal, however instead of curing the psycho it allows him to have the ability to make dreams real. Interesting plot however executed EXTREMELY poorly, Now If I was evil and had the ability to control dreams I would do things more on the Freddy Krueger Level all this guy did was make the two main characters see dead people. And the one time I thought Bedlam had some balls by making A dead criminal begin to Rape Hurleys character, for some reason he saw it fit to call the good guy of the movie and Warn him LOL basically the entire movie made no sense and for some reason Bedlam can make dead people come alive and control dreams but he couldn't win a fist fight against the good guy in the movie...",
         "Basically the only reason i watched this film was for Craig Kelly. As it happens he was only in it for 5 mins, so anyone else thinking of doing the same thing..don't, its not worth it(although he does look cute). Craig Kelly aside i thought this film lacked the power to reach its potential...because it certainly had some, the ideas were there, the plot was actually ok, but sadly they tried too hard to make it surreal and it ended up as one gigantic confusing mess. I was quite confident that Liz Hurley and Keith Allen might be able to save it (from reading the back review u aren't exactly running for the counter) but the acting in this was pretty awful. The lead male was terrible, Keith Allen was good enough, but he wasn't saying much, so that leaves Craig Kelly...who..despite all my biased..i must truthfully admit was pretty good for the small role he had. So contrary to all i said at the beginning if the only reason you are watching this is for Craig Kelly then i must say thats a pretty good reason, at least u know there's one bit u will enjoy, because quite frankly the rest of it is a pile or c**p and not worth the bother. If anyone wants to rewrite it though then i'd probably watch it again cos like i said its definitely got potential :)"
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": ["Metrodome Films"],
      "summaries": ["Dr.Stephanie Lyell works for Neurological Research, and is testing a seemingly safe personality-altering drug on Marc Gilmour a notorious Serial Killer. But when a pair of bizarre suicides occur at Dr. Lyell's apartment complex, Homicide Detective Terry Hamilton connects the mysterious deaths to the drug's diabolical side effects on Gilmour. Only after they too begin to experience horrible dreams and hallucinations do Terry and Stephanie realize they are trapped in Gilmour's nightmarish world, from which there is no hope of escape."],
      "budget": 3000000
   },
   "movielensId": 285,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-04-22",
      "dvdReleaseDate": null,
      "directors": ["Vadim Jean"],
      "runtime": 89,
      "movieId": 285,
      "title": "Beyond Bedlam",
      "mpaa": "R",
      "actors": [
         "Elizabeth Hurley",
         "Craig Fairbrass",
         "Keith Allen",
         "Jesse Birdsall",
         "Craig Kelly",
         "Anita Dobson"
      ],
      "imdbMovieId": "0106402",
      "originalTitle": "Beyond Bedlam",
      "genres": ["Horror"],
      "youtubeTrailerIds": [],
      "plotSummary": "An experiment gone awry places a neurologist (Elizabeth Hurley) and a homicide detective (Craig Fairbrass) in a psychopath's (Keith Allen) nightmarish world.",
      "tmdbMovieId": 56428,
      "avgRating": 2.36932,
      "releaseYear": "1994",
      "numRatings": 88,
      "posterPath": "/h7hwxnIC997ceboreSmEZo82bAw.jpg"
   }
}