{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "single parent",
            "id": 641
         },
         {
            "name": "church service",
            "id": 4636
         },
         {
            "name": "burned alive",
            "id": 9786
         },
         {
            "name": "psychopathic killer",
            "id": 10024
         },
         {
            "name": "psychotronic",
            "id": 164218
         },
         {
            "name": "video nasty",
            "id": 189921
         },
         {
            "name": "proto-slasher",
            "id": 233450
         },
         {
            "name": "church of satan film list",
            "id": 239678
         }
      ],
      "imdb_id": "tt0076150",
      "video": false,
      "title": "Alice Sweet Alice",
      "recommendations": [
         16154,
         37936,
         28050,
         26774,
         27346,
         22307,
         55538,
         40969,
         68146,
         20465,
         27328,
         38446,
         39261,
         4288,
         30924,
         40364,
         13555,
         11226,
         38996,
         28043
      ],
      "backdrop_path": "/rpmfuzmTDdJJN9EnkcZV1cRSjpA.jpg",
      "revenue": 0,
      "reviews": [{
         "author": "Milo_Jeeder",
         "id": "58a24cfc925141538b00045a",
         "content": "I'd like to know why films like \"Alice Sweet Alice\" aren't mentioned nearly as much as they deserve nowadays. The fact that this film is overlooked and forgotten, makes me realize that many horror fans in training wheels are somehow missing out on a horror gem that is worthy of their attention. I suppose it is because people mostly tend to eulogize those films that try to be figurative and subtle even if are not enjoyable whatsoever. I find it hard to believe that this film was to a certain degree inspired by Nicolas Roeg's \"Don't Look Now\", because if I have to be honest, the only connection I can see, would be the usage of raincoats throughout the entire film as an emblematic element. One of the main differences between these two films is precisely what I was mentioning before: in \"Don't Look Now\", Mr. Roeg tried offers a pitiful excuse for a horror film full of fake and nonsensical symbolism and mind-games, while \"Alice Sweet Alice\", delivers pure and crude horror at its best with a very agreeable twist in the end. I know this is an independent horror film that probably didn't even get much attention when it came out, but honestly, I don't see why. This is one of those films that came out during the mid 1970s in which the stories were pretty plain at first sight and the ending could be somehow taken for granted.\r\n\r\nIn \"Alice Sweet Alice\", the attention is mostly focused on the main character's psychology, which is Alice Spages (Paula Sheppard), an introverted 12 year old girl who lives with her mother (Linda Miller) and her spoiled little sister Karen (Brooke Shields). In this gruesome family drama, we see Alice as a manifest outcast who constantly tries to get her mother's attention by tormenting her little sister, who is obviously the one everyone loves and prefers. Fortunately (or perhaps unfortunately) for Alice, her sweet sister Karen is brutally murdered during the day of her first communion by the hand of a merciless killer wearing a mask and a yellow raincoat. As it is expected, all the fingers start pointing directly to Alice, since her jealousy and strange withdrawn manners match with her sister's perplexing slaughter Regardless of the obvious feelings surrendering Alice, her mother refuses to believe that her only daughter left is a raging murderess and confronts everyone who stands in her way just to prove the world that her sweet little girl is incapable of killing a bug. Sadly, Alice's violent behavior and the evidences don't help very much. While Mrs. Spages and her former husband Dom desperately try to convince the others that their sweet Alice is not a premature murderess, the body count increases in the most dreadful ways and the victims are coincidentally Alice's declared rivals.\r\n\r\nClearly, this film could be taken as some kind of overlooked slasher film, but I myself find it compelling enough to be compared to some of the most respected horror gems that people worship nowadays. Nevertheless, \"Alice Sweet Alice\" is a simple film when it comes to the way it was filmed and the lack of pretentiousness made it forgettable for some 'serious movie fans'. All I know is that this film will be highly appreciated by most horror fans and anyone who is in the mood to see a well-done psychological horror gem that doesn't try to emulate complex situations to captivate the audience and trick them into believing that there's any form of symbolism at all. It's a horror film that includes vicious murders and a respectable body count, without turning into a pointless butchery that can only cling to gore. The psychological and 'respectable' side is present here as well, but Mr. Alfred Sole simply didn't need to brag about it and deceive the audience with misleading sequences.",
         "url": "https://www.themoviedb.org/review/58a24cfc925141538b00045a"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Catherine Spages",
               "gender": 0,
               "credit_id": "52fe4476c3a368484e024605",
               "name": "Linda Miller",
               "profile_path": null,
               "id": 136913,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Mrs. Tredoni",
               "gender": 1,
               "credit_id": "52fe4476c3a368484e024609",
               "name": "Mildred Clinton",
               "profile_path": "/5I4nUygYaychamcsADshsy7CI22.jpg",
               "id": 136914,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Alice Spages",
               "gender": 1,
               "credit_id": "52fe4476c3a368484e02460d",
               "name": "Paula E. Sheppard",
               "profile_path": "/qrH8yH34DTNKzh2mPwFkgbsBhIi.jpg",
               "id": 136247,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Dominick 'Dom' Spages",
               "gender": 2,
               "credit_id": "52fe4476c3a368484e024611",
               "name": "Niles McMaster",
               "profile_path": null,
               "id": 136915,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Aunt Annie DeLorenze",
               "gender": 0,
               "credit_id": "52fe4476c3a368484e024615",
               "name": "Jane Lowry",
               "profile_path": null,
               "id": 136916,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Father Tom",
               "gender": 2,
               "credit_id": "52fe4476c3a368484e024619",
               "name": "Rudolph Willrich",
               "profile_path": null,
               "id": 136917,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Detective Spina",
               "gender": 0,
               "credit_id": "52fe4476c3a368484e02461d",
               "name": "Michael Hardstark",
               "profile_path": null,
               "id": 136918,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Mr. Alphonso",
               "gender": 0,
               "credit_id": "52fe4476c3a368484e024621",
               "name": "Alphonso DeNoble",
               "profile_path": null,
               "id": 136919,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Jim DeLorenze",
               "gender": 2,
               "credit_id": "52fe4476c3a368484e024625",
               "name": "Gary Allen",
               "profile_path": null,
               "id": 129665,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Karen Spages",
               "gender": 1,
               "credit_id": "52fe4476c3a368484e024629",
               "name": "Brooke Shields",
               "profile_path": "/zOyzH2LjJ3CbzpiJcAmpsiC7d1O.jpg",
               "id": 15110,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Dr. Whitman",
               "gender": 1,
               "credit_id": "52fe4476c3a368484e02462d",
               "name": "Louisa Horton",
               "profile_path": "/fXKiQBvzKSwnRwuS6jVQndlJg0.jpg",
               "id": 132358,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Detective Brennan",
               "gender": 2,
               "credit_id": "52fe4476c3a368484e024631",
               "name": "Tom Signorelli",
               "profile_path": "/wq0Yk64YGgpjFS3JE68WYdbdc5C.jpg",
               "id": 71347,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Pathologist",
               "gender": 1,
               "credit_id": "52fe4476c3a368484e024635",
               "name": "Lillian Roth",
               "profile_path": "/BfKyqtPc6YB1FHzBix2PJUChgA.jpg",
               "id": 136920,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Father Pat",
               "gender": 2,
               "credit_id": "52fe4476c3a368484e024639",
               "name": "Patrick Gorman",
               "profile_path": "/5cGqMcS0M3NX9jaMGf2Lfop7eLq.jpg",
               "id": 136921,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Angela DeLorenze",
               "gender": 0,
               "credit_id": "52fe4476c3a368484e02463d",
               "name": "Kathy Rich",
               "profile_path": null,
               "id": 136922,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4476c3a368484e0245f5",
               "name": "Alfred Sole",
               "profile_path": null,
               "id": 136911,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4476c3a368484e0245fb",
               "name": "Rosemary Ritvo",
               "profile_path": null,
               "id": 136912,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4476c3a368484e024601",
               "name": "Alfred Sole",
               "profile_path": null,
               "id": 136911,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.716322,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 23761,
      "vote_count": 73,
      "budget": 340000,
      "overview": "Alice is a withdrawn 12-year-old who lives with her mother and her younger sister, Karen, who gets most of the attention from her mother, leaving Alice out of the spotlight. But when Karen is found brutally murdered in a church, suspicions start to turn toward Alice. But could a 12-year-old girl really be capable of such savagery?",
      "similar": [
         24124,
         948,
         1402,
         5486,
         382591,
         10632,
         11521,
         44247,
         30666,
         67822,
         46885,
         32148,
         84191,
         8692,
         154537,
         19634,
         173032,
         92380,
         6167,
         424506
      ],
      "original_title": "Alice Sweet Alice",
      "runtime": 98,
      "poster_path": "/scjfMHHjZRKkmhoqPtNJmMfpcs4.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Harristown Funding",
         "id": 6114,
         "origin_country": ""
      }],
      "release_date": "1976-11-13",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "If you survive this night... nothing will scare you again.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Alfred Sole"],
      "runtime": 98,
      "synopsis": "New Jersey, 1963. Alice Spages ( Paula E. Sheppard) is a 12-year old girl who lives with her mother, Catherine ( Linda Miller), and her younger 10-year-old sister, Karen ( Brooke Shields). Their father, Dominic ( Niles McMaster), is divorced from Catherine, and has recently re-married. Catherine and the girls live in a humble apartment, and their lives are very much centered on their Catholic parish. Both Alice and Karen go to the small Catholic school associated with their church, and all of the students wear church-issued yellow rain slickers as part of their uniforms. Karen is just about to make her first holy communion, but Alice seems to be jealous of the attention that Karen is getting because of it. Alice appears to have some major emotional problems. In the opening scene, Alice, Catherine and Karen are visiting the young priest Father Tom ( Rudolph Willrich) at the rectory, discussing Karen's upcoming first Holy Communion. Alice startles the rectory's housekeeper, Mrs. Tredoni ( Mildred Clinton), by wearing a bizarre transluscent mask, and she terrorizes Karen by stealing her doll and luring her to an abandoned building. While inside the building, Alice frightens Karen with the mask and briefly locks her in a room alone, threatening to never return her doll if she tells their mother about the incident. In the family's apartment, Alice takes Karen's communion veil and models it herself in a mirror; Karen causes a commotion over it and Catherine has to intervene. Things go from bad to worse on the day of Karen's communion. As the parishioners sit in the pews waiting for the children to enter the sanctuary, Catherine and her younger sister Annie ( Jane Lowry) notice that Alice is not with them. Annie sends her daughter Angela ( Kathy Rich) to look for Alice. Before Karen can join the rest of the girls who are dressed in their white communion dresses and veils, she is attacked by a figure in one of the school's yellow rain slickers, wearing the same translucent mask that Alice wears. The figure strangles Karen and then stows her body in a hollow bench, setting it on fire. Just before burning the body, the killer snatches the small cross that Karen wears around her neck, ripping the pendant from her body. Alice then appears among the younger girls, in Karen's place and wearing her veil, awaiting holy communion. Annie is outraged and urges Catherine to put a stop to it immediately. Shortly after, a nun notices the smoke and discovers Karen's body, her screams summoning the rest of the congregation. Annie sees Karen's body and melodramatically tells Catherine that her daughter is dead. Catherine breaks down crying. Alice slips Karen's veil into her pocket. Dominic returns for Karen's funeral and Catherine weeps when she sees him. The domineering Annie imposes herself on Catherine and Alice, insisting that she will stay with them to help Catherine with anything she needs. Alice is resentful of Annie's presence, and wants to stay home with her mother instead of going back to school. Annie's obvious dislike for the girl gives way to accusations about Karen's murder; Annie points out the fact that Alice's whereabouts during the murder are unaccounted for. Catherine seems to be unwilling to admit that Alice acts strangely, insisting that nobody understands Alice like she does. She has to smooth over a confrontation between Annie and Alice, sending Alice on an errand to defuse the argument. Catherine has Alice take the rent check to the family's landlord, Mr. Alphonso ( Alphonso DeNoble), who lives in one of the lower apartments of the building. Alphonso is a grotesque man, extremely obese and living in an apartment full of kittens; we see him feeding the kittens, referring to himself as \"mommy\", and then eating some of the moist cat food himself. Alphonso has repeatedly made jabs at Alice regarding Karen's death; he aligns himself with Alice's Aunt Annie, saying that Alice must have had something to do with Karen's murder. He also tells Alice that he knows about the odd shrine she has in the basement of the building, where she keeps various objects that she has either found or stolen, including the mask and Karen's missing doll. He tells Alice that Karen will return from the dead to collect her doll. When he makes inappropriate advances toward Alice and begins to touch her in a lewd manner, Alice throttles one of the kittens and strangles it to death and yelling \"you never do that again!\", upsetting Alphonso and allowing her to escape. Meanwhile, the detectives investigating Karen's murder summon Alice's school records from the parish. When Dominic visits the police station to discuss Karen's case, he becomes hostile when Detective Brennan ( Tom Signorelli) suggests that he would like to question Alice about the murder. He phones the rectory to talk to Father Tom, with whom he is apparently familiar; at first his phone call is intercepted by Mrs. Tredoni, who is fiercely protective of the priests and the elderly monsignor who reside there. Tom picks up an extension and talks to Dominic, asking if they can meet in person. Dominic seems unaware of Alice's emotional problems, which have resulted in a number of questionable incidents at school. Father Tom tells him that Alice has a knack for causing trouble and making it seem like an accident. Alice goes into the basement to her shrine, where she keeps her strange items, one of them being a jar full of large cockroaches, which she keeps alive by feeding them. She also still has Karen's doll. Alice puts on her mask. Upstairs, the mysterious figure wearing the yellow rain slicker and mask is creeping around the hallways. Annie goes to leave the apartment and she is attacked by the figure. The killer stands on the landing and slashes at Annie's legs and feet was she walks down the stairs, seriously wounding her with a kitchen knife. Before the killer can administer the death blow, Annie's screams summon Mr. Alphonso, who sees the killer's outfit and immediately identifies it as Alice. As the masked raincoat figure flees, Annie, who is hysterical and terrified, drags herself out into the street in the pouring rain, where Catherine finds her. Dominic and Father Tom happen to pull up at the same time, in Father Tom's car. Tom and Catherine rush Annie to the hospital, while Dominic goes into the building to look for the person who attacked Annie. In the basement, he finds Alice at her shrine, terrified; she claims she saw Karen, apparently believing what Alphonso told her about Karen returning to claim her doll. Dominic comforts her; like Catherine, Dominic doesn't believe that Alice could be a killer. At the hospital, Catherine tries to get Annie to recant her story about being attacked by \"Alice\", but Detective Cranston ( Ted Tinling) shows up to question Annie and she becomes hysterical, screaming that Alice was the one who stabbed her. They bring Alice into the police station to question her, giving her a lie detector test. Although Alice does not implicate herself, she gives a number of strange responses; one of the things that the lie detector machine reveals is that Alice sincerely believes that Karen is the one who attacked Aunt Annie. Alice resents being questioned, even lashing out at the policemen's lie detector machine, deliberately throwing it on the floor when they leave her alone with it. Although the police cannot charge Alice with either Karen's murder or Annie's slashing, they still feel she may be responsible for one or both, and they order her to have a psychological evaluation at the Sara Reed Children's Hospital. Catherine and Dominic are furious, but try to make the best of it. They visit Alice at the hospital together, discussing the case with the doctor who examines her, Dr. Whitman ( Louisa Horton). Dr. Whitman's evaluation seems especially damning, suggesting that Alice is schizophrenic and possibly dangerous. Whitman refuses to allow Alice to be released. Dominic and Catherine have a quiet moment back at Catherine's apartment, when Catherine gets a strange phone call consisting of nothing but breathing; we see the caller is wearing the translucent mask. When the caller hangs up, Catherine assumes it was Annie; since Annie identified Alice as her attacker, Catherine vowed to disown Annie forever. Discussing the recent tragic events of their lives, Dominic and Catherine both agree that Alice could not have been responsible for all that's happened. Dominic suggests that perhaps Angela was the one who attacked Annie, which could explain why Alice thought she saw Karen, since they all wear the same yellow raincoat. Catherine, however, points out that Angela is an overweight young girl, and Karen was very petite, so it would be unlikely for Alice to confuse them. They wind up holding each other and beginning to make love, but are interrupted by a phone call from Dominic's wife, which breaks the mood. Dominic returns to his hotel in time to receive a phone call from a sobbing voice; the caller identifies herself as Angela, saying that she ran away from home and needs Dominic to help her. She asks him to come to the abandoned building, the same one where Alice scared Karen at the beginning of the movie. When Dominic arrives, he sees the figure in the yellow raincoat and mask off in the distance. When he follows her into the building, she attacks him with the kitchen knife, stabbing him in the shoulder. Still unsure of who it is, Dominic follows her up a staircase, where the figure surprises him and bludgeons him repeatedly with a brick. With Dominic unconscious, the figure binds him with a cord and rolls him over to a loading door; the drop over the precipice is three or four stories to the ground. Dominic regains consciousness and realizes he is about to fall to his death. The killer removes the mask to reveal Mrs. Tredoni underneath. She rants about Dominic's relationship with Catherine, revealing that she knows that Alice was conceived before Dominic and Catherine were married. Dominic screams for help, but the area is too desolate for anybody to hear him. He uses his teeth to grab the crucifix that Mrs. Tredoni wears, the same one that she pulled from Karen's body the day she killed her. Mrs. Tredoni notices it and uses the brick to try and smash in Dominic's teeth. He refuses to give up the cross, swallowing it instead. Mrs. Tredoni, now furious, pushes him over the ledge and he falls to his death. Mrs. Tredoni then goes to the church, where a group of children are being instructed on how to make their first confession. Father Tom is the one who is going to hear the children, but he goes into the confessional to find that Mrs. Tredoni is already in there, changing out of the costume she wears to impersonate Alice. She pretends she is seeking to make a confession, and claims she feels guilty about having thoughts regarding the Monsignor; she says that he is in such poor health that she sometimes wishes he would pass away. Father Tom tells her she is a good woman, and that she doesn't need to come to confession about this since her thoughts are not sinful. He praises her for the care she has given himself and the other priests, and she is ecstatic when he calls her a friend. The next day, Catherine becomes worried when she does not hear from Dominic, and she goes to the rectory to look for him; she reasons that since he has been borrowing Father Tom's car, he may be there. She is greeted by Mrs. Tredoni, who tries to get rid of her but finally allows her in to wait for Father Tom. Mrs. Tredoni is gutting fish for that evening's dinner, and she brings Catherine into the kitchen after preparing coffee for her. Catherine is uneasy, when Mrs. Tredoni reveals that she also had a daughter who died on the day of her first holy communion, Mrs. Tredoni seizes the kitchen knife and brandishes it toward Catherine while calling her a whore for having her own child out of wedlock. Father Tom returns and interrupts their conversation, telling Catherine that Dominic's body has been discovered. Catherine weeps in frustration and horror. Dominc's murder suggests that Alice is no longer a suspect, and Catherine is able to take her home. After they return, the figure in the yellow rain slicker and mask enters Alphonso's apartment while he is sleeping, and places the jar of roaches from Alice's secret shrine on his chest. Removing the mask, the figure reveals itself to be Alice herself. Catherine catches her leaving Alphonso's apartment, but Alice explains that she was only saying 'hello' to him after returning from the hospital. Catherine praises her for being kind to him, and they leave to go to mass. Outside, Detective Cranston is watching the building as protection for Alice and Catherine. When they leave the building, Mrs. Tredoni slips in the back through the basement, wearing the yellow rain slicker and mask. She goes up to Catherine's apartment, apparently planning on murdering the first person she sees, but she finds the door locked. As she knocks on Catherine's door, Alphonso awakens and reacts in horror when the roaches begin to crawl over him. He starts screaming and alerts Cranston that something is wrong. Mrs. Tredoni hears it too, and she panics that he is drawing attention to the scene too soon. She runs back down the stairs, but Alphonso emerges and sees her running past his apartment. Thinking her to be Alice, he grabs her and starts to manhandle her, so she pulls out the kitchen knife and stabs him in the chest several times. He stumbles back into his apartment and dies. When Mrs. Tredoni tries to escape through the basement, Cranston smashes down the front door and sees her. In her panic, she has forgotten to put the mask back on, and he easily identifies her. Still wearing the yellow slicker, Mrs. Tredoni returns to the church and enters the sanctuary during service, making her way to where Alice and Catherine are sitting. Outside, the police arrive and discuss the best way to apprehend Mrs. Tredoni. Father Tom warns them not to try and confront her, as she is too close to Alice and her mother. Tom believes he can convince Mrs. Tredoni to come peacefully, since she adores him. During communion, Alice, Catherine, and Mrs. Tredoni all come up to the front side by side. Father Tom gives Catherine the wafer, but skips Alice. He also skips Mrs. Tredoni, instead leaning toward her and quietly asking her to go with the police. Mrs. Tredoni becomes indignant and asks why he will not give her communion; becoming furious, she shouts \"But you give it to the whore!\", pointing at Catherine. In a rage, Mrs. Tredoni pulls out the knife and stabs Father Tom through the throat. The congregation reacts in horror. Mrs. Tredoni clutches Father Tom to her as he dies, his blood pouring over the yellow rain slicker. Alice remains curiously detached from what is happening. In the confusion, a few policemen run into the church and arrest Mrs. Tredoni, while Alice has claimed Mrs. Tredoni's bag. Alice, still having not received communion, walks out of the church and pulls out the knife briefly, fondling the handle and smiling to herself (insinuating that Alice might one day adopt Mrs. Tredoni's murderous killing spree herself).",
      "writers": [
         "Rosemary Ritvo",
         "Alfred Sole"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076150/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5ODc1MDIyMl5BMl5BanBnXkFtZTcwNTM1MzI0MQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Linda Miller, Mildred Clinton, Paula E. Sheppard | See full cast and crew »"],
      "reviews": [
         "\"Alice, Sweet Alice\" (aka \"Communion\"), is an excellent horror film. It was years before \"Halloween\" and \"Friday the 13th\", and for some reason this movie stuck with me. I saw it years ago, and just re-rented it recently, and found it to be better on the second viewing. This film revolves around Alice Spages, a 12 year old girl. She comes from a divorced, strict Catholic family, and her little sister, Karen, gets most of the attention, while Alice is sort of left in the dark. We get the idea that Alice might have some problems and you can surely tell she is jealous of her sister. Then, on Karen's first holy communion, she is strangled to death and lit on fire in the church by someone wearing a yellow rain slicker and a creepy plastic mask. The police believe Alice had something to do with her sister's murder, and commit her as their target. Then, the mysterious person in the yellow rain slicker strikes again, this time stabbing Alice's Aunt while she's walking down the stairs of an apartment complex. As more murders continue, we begin to question - could a 12 year old girl really be capable of murder? Or could it be someone else? I can say this movie is pretty disturbing, seeing an innocent girl murdered in a church before her first communion is quite sinister. Director Alfred Sole gives the viewer some heavy Catholic imagery throughout the film, contrasting it with the brutal events taking place. There is obviously much thought and detail put into the complex characters, as well as the complicated but intriguing plot. The score is extremely eerie, just listening to the score alone is enough to give anyone the chills. Without the score I think this movie would have lost much of the ambiance that it has. Alice's sister, Karen, is played by a very young Brooke Shields, and this movie is probably most known for having her name branded on it, even though she dies very soon in the film. Paula Sheppard (who was actually 19 years old at the time) plays Alice, Karen's violently jealous sister, and her performance is probably the best of the entire film. I absolutely loved the staircase attack on Alice's aunt, it was unexpected and very well done. Overall, \"Alice, Sweet Alice\" is an effective Catholic shocker that has been either forgotten about or is very unknown. A spooky score, some eerie religious imagery, and a brutal staircase slashing make this a complete classic. I was lucky enough to be able to pick up the Anchor Bay DVD release, because now it's long out of print and nearly impossible to find. The DVD release is great, if you're able to get your hands on it (for a reasonable price), definitely get it. 9/10.",
         "\"Alice, Sweet Alice\", unfortunately listed here under its more tame alias \"Communion\", is a modest but sublime thriller that excellently fits in the superior horror decade that were the 70's. It's in fact a thriller with just that tad bit extra\u0085 Despite of the modest budget Alfred Sole had to work with, his film doesn't look dated like many others and the influence it had on the slasher sub-genre is amazing. Who killed little Karen Spages during her first communion service? This question with a seemly obvious answer keeps you entertained and \u0096 especially \u0096 frightened throughout almost the entire film. Too bad the story loses some of its impact around the hour, due to a few tedious sequences and unexciting dialogs. Luckily, Sole rapidly continues where he left off and delivers us a truly marvelous finale where even Hitchcock himself would show respect for. There's a terrific catholic atmosphere and symbolism featuring in this film, stressed extra by the chilling musical score. Although the movie more or less became famous because it introduces Brooke Shields, it's in fact Paula E. Sheppard who gives away a flawless and imposing acting performance as Alice. She has this brilliantly nihilistic glance in her eyes that makes you feel uncomfortable. \"Alice Sweet Alice\" is definitely a film I would recommend to every horror fan. It contains several highly memorable sequences like, for example, all the ones involving the fat filthy and perverted neighbor. Fundamental horror viewing for Gothic lovers.",
         "This is a brilliant, original, thought-provoking horror movie that has festered in obscurity for some time. Despite a laserdisc release and a slew of alternate titles -- \"Alice Sweet Alice\" and \"Holy Terror\" are but two -- it is still virtually unknown. At the time of its release, PR wags made a big deal that it featured Brook Shields in her first on-screen role. PR wags did not make a big deal of the fact that there had not been anything like it ever before and that it featured an amazing newcomer, Paula E. Sheppard, in a chilling role as a deeply disturbed schoolgirl who may or may not be responsible for a slew of gory murders. Add to those a strong Catholic subtext and hints of child abuse and you've got one incredible ninety minutes of mental and physical mayhem. Director Alfred Sole, who also made the flawed but fascinating \"Tanya's Island\" and the rotten \"Thursday the 12th\" (aka \"Pandemonium\") creates unbelievable tension and always places his characters (who are very well written) before the horror. Plotting, characterization and suspense are so expertly mixed the film doesn't even feel like a genre piece at times ; instead, it feels like a European drama...but one circling a potent giallo. As noted, Sheppard is superb as Alice; Linda Miller is exemplary as Alice's tormented mother Catherine and Jane Lowry as the domineering Aunt Annie turns in a powerhouse performance. And playing Alice's obese, perverted neighbor to chilling perfection is the late Alphonso DeNoble. The scene in which he comes close to molesting Alice is priceless for its economy and authenticity. From the excellent photography to the super-creepy score by Stephen Lawrence, \"Communion\" is compelling until the final body hits the church floor.",
         "\"Alice, Sweet Alice\" is the first horror movie i ever saw, and i've seen many since. But nothing, in my book, compares to this classic, as-yet-undiscovered little gem. First off, the acting is SUPERB, and Puala Sheppard's portrayal of Alice is close to flawless. Second, the atmosphere is amazing, offset by an excellent and eerily haunting musical score. If you are a fan of 70's horror, this one is the best of it's kind, not only for the aforementioned, but also because it captures the essence of the 70's both in it's rainy, New Jersey setting, and in the grainy feel of the way it was filmed. Talks of a proposed sequel to this movie are in the works for 2005, and although it will most likely be doomed to straight-to-video hell, i am still eagerly anticipating it with high hopes. Original and entertaining, although some may find it slow paced for their taste, i gave it 10/10 *'s because in my opinion, it's a near-masterpiece.",
         "Alice Spages (Paula Sheppard) is a rebel and problematic twelve year-old girl that lives with her divorced mother Catherine (Linda Miller) and her younger sister Karen (Brooke Shields). Catherine gives more attention to Karen, neglecting her older daughter. During the first communion of Karen, the girl is strangled by a woman dressed with a St. Michael's yellow coat and a mask. Alice takes her place in the line wearing her veil that she claims she had found on the floor and becomes the prime suspect of the police. When Catherine's sister Annie (Jane Lowry) is stabbed on the leg several times, she accuses Alice and the girl is sent to psychological evaluation under the protest of her parents and their friend Father Tom (Rudolph Willrich). Alice's father Dominick Spages (Nies McMaster) seeks evidences to prove the innocence of Alice. \"Communion\" is a creepy and stylish horror movie of the 70's and practically the debut of Brooke Shields in the cinema with a minor but important participation. The dramatic story discloses insanity through weird characters in a period of heavy rain and using the Catholic principles of communion, sin and guilty, giving an atmosphere that recalls Dario Argento's movies. The relationship among Catherine, Father Tom and Dominick is not clear, especially because the Catholic Church requires celibate from the priests. In one moment, Catherine is ready to leave town alone, and she says to Father Tom that Alice would be better with him, giving an indication that Alice might be Tom's daughter. If my guess is right, the behavior of fanatic Catholic Annie that apparently blames Catherine for getting married pregnant of Alice is explained, and the conclusion is perfect, with Mrs. Tredoni saying that \"children should pay for the sins of their parents\"; calling Catherine of whore; and stabbing Father Tom. My vote is seven. Title (Brazil): \"Comunhão\" (\"Communion\") Note: ON 29 May 2012, I saw this film again on DVD.",
         "From beginning credits to the final segment, Alfered Sole's \"Alice Sweet Alice\" is a chillingly gripping horror flick. With it's haunting soundtrack, alarming murder scenes, and horrifying Catholic imagery this movie will be forever embedded in your mind. It also boasts the very first screen appearance of a young Brooke Shields, who has a very brief role as young Karen Spages, a young girl who is brutally murdered in church during her first Communion. This murder sets the pace for the entire film. There are no wasted segments or \"fillers\" in \"Alice Sweet Alice\" each scene is essential and captivates your attention. The characters grab your attention as well from the morbidly obese Mr. Alfonso the landlord to the manipulative and constantly interfering Aunt Annie. Of course, the character of Alice is the most intriguing as the viewer wonders whether this strange young girl is truly capable of cold blooded acts of murder or is there something even more sinister happening? There are lots of surprises and shocks that will grab the attention of first-time viewers and leave most horror fans coming back for more and there is also a surprisingly generous amount of blood-letting in this film. This film came in at #88 on Bravo's list of the top 100 scariest moments in cinema history.",
         "While most horror films deliver momentary shock, this low budget flick, one of the first to feature Brook Shields, really works. I went around for several days after seeing it very, very chilled by it. Director Sole should be noted for his superb Hitchcockian style(proof that he was influenced by Hitch: a movie poster of PSYCHO, subtly placed in a scene). Camera angles, minor character development, the use of religious imagery to convey a sense of dis-ease--this is one helluva little film. Alice lives with her divorced mother and sister Karen in early 1960's New Jersey. Karen is enjoying all the attentions that normally accompany a Catholic girl's first communion, and Alice, a volatile and moody girl, is jealous of her sister. As Karen waits in an side room with the other girls waiting to enter the church sanctuary to receive her first communion, a figure in a yellow hooded raincoat and clear mask strangles Karen with her rosary, stuffs her corpse in a bench, and places a lighted candle inside with the body. And all in the first thirty minutes of the movie! Of course, Alice is seen slipping into the church late, and the suspicion begins. Has she or hasn't she. The scene where the gruesome burned corpse is discovered is great, with a shot of a fan blowing the smoke into the congregation. The juxtaposition of the sacred with the profane(or insane, as the case may be)was and is disturbing. The scenes in the apartment of Karen and Alice's mother are claustrophobic, as are those in the priest's rooms. The exteriors of city streets are filmed under overcast skies. And the other characters . . . the bald, grotesquely obese landlord, who mopes around his apartment in urine-stained bermuda shorts with numerous cats while playing selections from SHOWBOAT on a Victrola, could have been the main character in another horror film. But a big part of this film's disturbing vibe comes from the stridently anti-Catholic tone. The fact that the killer attacks and kills Karen in a church on her first communion is bad enough, but the tone is such that Catholic ritual and tradition takes on an insane, chilling patina. Psychosis and tradition meld into a weird brew that gives more chills than a dozen chainsaw wielding maniacs. If you crave an intelligent, well-crafted pyschological horror film brimming with disturbing atmosphere and twisted imagery, this is the one.",
         "When young Karen Spages is strangled and set on fire in a Catholic Church at her first communion, her disturbed older sister Alice is the central suspect, because of her jealously towards her. Her estrange father Dominick arrives in town for the funeral. Catherine her mother and Dominick believe Alice is an innocent victim, but when her Aunt Annie is attacked by someone in a yellow slicker and plastic doll mask, she believes it's Alice. The police take Alice in, where she tries to convince them that Karen is alive and stabbed Annie. And their lie detectors goes on to prove it. Dominick with the help of father Tom try their best to investigate just who might be behind the actual attacks. Alfred Sole's effectively accomplished direction, atmospheric handling and astutely symbolic, psychological tampered plot really do go real long way to covering the flawed aspects of the commendable production. In what might have damage other films, only goes on to be a minor quibble here because there are so many glowing factors, which are amazingly pulled off for an impressive low-budget effort. This is one of my favourite 70's horror oddities, which breaths a fresh air in its premise's circuitously glum layout, an ominously nasty streak, purposely stinging jolts and being filmed on authentic locations in New Jersey. What makes the unusually cunning and certainly unpredictable plot compelling, is that so much can be read from it, like it's penetrating thoughts on Catholicism too the prolific character developments involving the hardships of family life, but there's no lying about its true intentions, which did kind of got mingled with the baffling conclusion. Making repeat viewings a must, to pick up on those minor details. Some fundamental devices in the plot show up; the usual police investigation is the glaring one, but it never draws away from the main focus and adjustably installs itself into the material. There are some odd and eccentric characters written in also, which catch onto the emotional ride. Some might think the tension will evaporate, as just after halfway through the killer is unmasked, but the story's slow rising sinisterness early on eventually leads to a brooding intensity that actually seems to fester up, for the thrilling final third with one powerful conclusion to boot. Sole does a vividly lucid job in the director's chair with moody imagery, creative viewpoints and uneasy composition, backed up by disquietingly stylish jolts timed with utter perfection. However in spots it can drag with it's deliberately slow pace and a densely thorough script, which can labour along. Maybe it was a tad too long. Also illustrating the film's disorienting air and unsettling suspense was John Freeberg's gracefully skilled cinematography and Stephen Lawrence's playfully chilling, but occasionally harrowing musical score, which expertly went hand-to-hand to craft out an overwhelming tenor. The killer goes around in a shiny yellow slicker, white gloves and the chilling doll mask they wear, actually gives me the creeps. The performances are noting to write home about and might be gauche in some cases, but there's no denying that the matchless Paula E. Shepherd is startlingly convincing as the creepy Alice. Linda Miller does exceptionally well as Alice's heart-aching mother Catherine and Niles McMaster brings a solidarity to his performance as Alice's stalwart father Dom. Jane Lowry can get fittingly overbearing as the haughty Aunt Annie and the unforgettable Alphonso DeNoble keeps it all vile as the grubby landlord. Even with the high billing that Brooke Shields receives, her debut performance is efficient and her death memorable, but not worth all the fuzz for only 15 minutes. Mildred Clinton, Rudolph Willrich, Michael Hardstark, Tom Signorelli, Lillian Roth and Gary Allen go on to give able support. An uncomfortably staggering affair with many dimensions to its story and inspired craftsmanship by Sole and co, which go on to make it a very good unappreciated gem of the 70s.",
         "Creepy little sleeper that's heavily inspired by Nicholas Roeg's seminal Don't Look Now(1972). There is a lot of focus on the motif of innocnece and guilt. One of the most religious horror films ever made. The ideals of the church play a prominent role in the plot of the film. Like in Don't Look Now(1972), there is the image of a child with a rain coat wearing a mask. Every character in the film with the exception of Father Tom is unlikable and unsympathetic. The main character Alice is the creepiest protagonist to appear in a horror movie. There is a interesting Oedipus relationship between Mrs. Tredoni and Father Tom. The direction by Alfred Sole is excellent and the story is compelling to follow. Linda Miller does a fine job as the mother of Alice, Catherine. There are some parts of the film that remind me of the giallo, Don't Torture A Duckling(1972). Both Alice Sweet Alice(1976) and Don't Torture A Duckling(1972) deal in their own way with the loss of innocence motif. Better than most horror movies done in the mid to late 1990s. The late Paula E. Sheppard gives a powerful and scary performance as the title character, Alice. The murder scenes are well filmed and realisticly staged. Alice Sweet Alice(1976) was known mostly as the film debut for future model and actress Brooke Shields. The character of Karen is extremely unlikable. Its easy in the first act of the story to sympathize with Alice because she treated horribly by her mother compared to her sister. Brooke Shields plays her character very well. The attempted murder of Aunt Annie played by Jane Lowry is stylish and unpredictable. Alice although not a murder by the end of the film is someone who is capable of murder. The mask worn by the killer predates the masks worn by the murderer in Halloween(1978), and Valentine(2001). Even some parts of the story reminds me of Halloween(1978). Alice Sweet Alice(1976) is an emotionally fullfilling horror pic that has developed a cult following over the years.",
         "Terrifically good sleeper horror from director Alfred Sole rises to a level much higher than it's low-budget appearance. Is young Alice the masked murderer that's targeting her family? Communion, better known as Alice Sweet Alice, is an engulfing and sharply-made shocker that seems to have been lost over the years. The story is a splendidly twisted murder mystery that boasts a good amount of suspense and some well-rounded characters. Sole directs this movie with some true skill and style, with lots of inventive cinematography and making great use of the rustic filming locations of Paterson, New Jersey. He also uses the imagery of the killer's mask and the catholic symbols in a creepily effective manner. There's plenty of good shocks to be had in this film as well, in fact the horrific stairwell-knifing is powerful to Hitchcockian proportions. This film is so well-made that it's a wonder Sole hasn't gone on to become better known in the cinematic world. The elegant music score is also a great addition to this thriller. Cast-wise the film is great as well. Paula Sheppard (who was 19 years old at the time) plays her bratty 12 year old character very convincingly. Linda Miller is strong as Sheppard's understandably distraught mother. Mildred Clinton is excellent as the stern house keeper. Niles McMaster is good as Sheppard's estranged father, as is Jane Lowry as the hateful aunt. Rudolph Willrich is also memorable as father Tom. Look for young Brook Shields as Alice's little sister. Communion is a striking and haunting little thriller that deserves a wider audience. For horror and thriller fans a like, it's a great find! *** 1/2 out of ****"
      ],
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "productionCompanies": ["Harristown Funding"],
      "summaries": [
         "Alice Spages is a withdrawn 12 year old girl who lives with her mother, Catherine, and her younger sister, Karen. Karen gets most of the attention from her mother, and Alice is often left out of the spotlight. But when Karen is found brutally murdered in a church before her first holy communion, all suspicions are turned towards Alice. But is a twelve year old girl really capable of such savagery? As more people begin to die at the hands of a merciless killer, Alice becomes more and more likely of a suspect.",
         "Alice Spages is a rebel and problematic twelve year-old girl that lives with her divorced mother Catherine and her younger sister Karen. Catherine gives more attention to Karen, neglecting her older daughter. During the first communion of Karen, the girl is strangled by a woman dressed with a St. Michael's yellow coat and a mask. Alice takes her place in the line wearing her veil that she claims she had found on the floor and becomes the prime suspect of the police. When Catherine's sister Annie is stabbed on the leg several times, she accuses Alice and the girl is sent to psychological evaluation under the protest of her parents and their friend Father Tom. Alice's father Dominick Spages seeks evidences to prove the innocence of Alice.",
         "After a young girl is brutally murdered during her first communion, her strange and withdrawn older sister becomes the main suspect."
      ],
      "budget": 340000
   },
   "movielensId": 2853,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1976-11-13",
      "dvdReleaseDate": "1999-08-24",
      "directors": ["Alfred Sole"],
      "runtime": 98,
      "movieId": 2853,
      "title": "Alice Sweet Alice",
      "mpaa": "R",
      "actors": [
         "Linda Miller",
         "Mildred Clinton",
         "Paula E. Sheppard",
         "Niles McMaster",
         "Jane Lowry",
         "Rudolph Willrich",
         "Michael Hardstark",
         "Alphonso DeNoble",
         "Gary Allen",
         "Brooke Shields",
         "Louisa Horton",
         "Tom Signorelli",
         "Lillian Roth",
         "Patrick Gorman",
         "Kathy Rich"
      ],
      "imdbMovieId": "0076150",
      "originalTitle": "Alice Sweet Alice",
      "genres": [
         "Horror",
         "Mystery",
         "Thriller"
      ],
      "youtubeTrailerIds": ["C_CHiI1V4gE"],
      "plotSummary": "Alice is a withdrawn 12-year-old who lives with her mother and her younger sister, Karen, who gets most of the attention from her mother, leaving Alice out of the spotlight. But when Karen is found brutally murdered in a church, suspicions start to turn toward Alice. But could a 12-year-old girl really be capable of such savagery?",
      "tmdbMovieId": 23761,
      "avgRating": 2.88961,
      "releaseYear": "1976",
      "numRatings": 231,
      "posterPath": "/scjfMHHjZRKkmhoqPtNJmMfpcs4.jpg"
   }
}