{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "submarine",
            "id": 339
         },
         {
            "name": "music",
            "id": 6027
         },
         {
            "name": "blase",
            "id": 9528
         },
         {
            "name": "the beatles",
            "id": 11697
         },
         {
            "name": "color",
            "id": 181235
         }
      ],
      "imdb_id": "tt0063823",
      "video": false,
      "title": "Yellow Submarine",
      "recommendations": [
         704,
         14831,
         47217,
         26851,
         42464,
         20561,
         15788,
         42597,
         15374,
         5185,
         20556,
         27375,
         13776,
         982,
         90034,
         53079,
         987,
         10907,
         632,
         828
      ],
      "backdrop_path": "/eKZiD3VZo0cXvsjRMuFDIeK2TzZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 11,
               "character": "Chief Blue Meanie (voice)",
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e50f",
               "name": "Paul Angelis",
               "profile_path": "/yKSGlHjXSO2GwdZOo5kH2TqAkkL.jpg",
               "id": 27652,
               "order": 1
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5662b9039251412ac4003322",
               "name": "John Lennon",
               "profile_path": "/oVQZxiY6RTuICdkVN6nF8XJYJVe.jpg",
               "id": 10592,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5662b911c3a3682c010033c1",
               "name": "Paul McCartney",
               "profile_path": "/v7FagbD9EY4MVUtcrk9ESjPWV7q.jpg",
               "id": 10215,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5662b91dc3a3682c010033c6",
               "name": "George Harrison",
               "profile_path": "/3U4WXM0pNb7ob7gvQCnZ3sJYgB9.jpg",
               "id": 10593,
               "order": 7
            },
            {
               "cast_id": 20,
               "character": "Himself",
               "gender": 2,
               "credit_id": "5662b926c3a3682bcd003280",
               "name": "Ringo Starr",
               "profile_path": "/26c4q3Uz3OFAR8rWcXAI5Q1xvZX.jpg",
               "id": 10594,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4e3",
               "name": "George Dunning",
               "profile_path": null,
               "id": 71253,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4e9",
               "name": "Al Brodax",
               "profile_path": null,
               "id": 71254,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e4ef",
               "name": "Jack Mendelsohn",
               "profile_path": null,
               "id": 71255,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e4f5",
               "name": "Lee Minoff",
               "profile_path": null,
               "id": 71256,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b59251416c7503e4fb",
               "name": "Erich Segal",
               "profile_path": null,
               "id": 56873,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e501",
               "name": "John Williams",
               "profile_path": null,
               "id": 71258,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b59251416c7503e507",
               "name": "Brian J. Bishop",
               "profile_path": null,
               "id": 71259,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44b69251416c7503e521",
               "name": "Paul McCartney",
               "profile_path": "/v7FagbD9EY4MVUtcrk9ESjPWV7q.jpg",
               "id": 10215,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe44b69251416c7503e527",
               "name": "Al Brodax",
               "profile_path": null,
               "id": 71254,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Fantasy",
            "id": 14
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 6.688165,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 12105,
      "vote_count": 138,
      "budget": 0,
      "overview": "The Blue Meanies take over Pepperland, draining it of all its color and music, firing anti-music missiles, bonking people with green apples, and turning the inhabitants to stone by way of the pointed finger of a giant blue glove. As the only survivor, the Lord Admiral escapes in the yellow submarine and goes to Liverpool to enlist the help of the Beatles.",
      "similar": [
         20575,
         786,
         525,
         502526,
         450794,
         6477,
         3902,
         6575,
         10186,
         14831,
         8873,
         31802,
         37896,
         193613,
         63973,
         468775,
         17000,
         13576,
         27962,
         17356
      ],
      "original_title": "Yellow Submarine",
      "runtime": 90,
      "poster_path": "/l2u1MDnR89ptsKZDxIF4LFTiBWP.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Apple Corps",
            "id": 3797,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "King Features Production",
            "id": 16915,
            "origin_country": ""
         }
      ],
      "release_date": "1968-07-17",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Nothing Is Real.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "£",
      "directors": ["George Dunning"],
      "runtime": 90,
      "synopsis": "Once upon a time or maybe twice there was an unearthly paradise called Pepperland, 80,000 leagues under the sea. Pepperland is inhabited by a group of music lovers who dwell in peace and harmony. The peace of Pepperland is threatened by an attack of the Blue Meanies, who hate all music and beauty. Their attack freezes the inhabitants of Pepperland and destroys all of their art and natural beauty. One inhabitant of Pepperland is the uniformed Fred, who is named Admiral by the Lord Mayor and sent off in Pepperland's Yellow Submarine to seek help in the surface world. Young Fred, as he is called by the ancient Lord Mayor, escapes just in time as the mayor is Bonked by the attacking Blue Meanies. (Song:Yellow Submarine) over credits Fred arrives in Liverpool, England and spies upon a lonely Ringo (Song: Elanor Rigby) and follows him home in the submarine. Ringo is made confused and nervous by the sneaky sub and fails to find help from a Bobby (policeman). Fred knocks on Ringo's door, explains the plight of Pepperland and asks him for help. Fred enters the cavernous, weird mansion labled The Pier then is picked up in Ringo's car. Ringo is sympathetic but wants to ask the others, so they start to look for Ringo's mates. They first meet the Frankenstein Monster who turns into John, the leader of the Beatles. They find George meditating atop a mountain in the next room, yet also driving in Ringo's car. \"its all in the mind\" explains George helpfully. Finally, Paul appears from one of the mansion's many doors from an adoring crowd. The Beatles decide to help Old Fred as they have christened him. They depart immediately aboard the Yellow Submarine. Non-animated montage of various scenes of London and the English countryside speed by, giving the illusion of flying as the submarine takes off. (The creshendo of music is from the song \"A Day in the Life\". ) The Beatles learn the workings of the submarine from Old Fred (Song: All Together Now) as they go beneath the waves. They sail into the Sea of Time and become very young and then very old Senile Delinquents (Song: When Im Sixty Four). They leave the Sea of Time and enter the Sea of Science. (Song: Only a Northern Song). Finally they arrive in the Sea of Monsters, where a throng of bizarre creatures dwell, some of whom threaten the submarine. But disaster is always averted by the pressing of a random button. That is, until Ringo hits the Panic Button and is hurled onto the back of a galloping monster. The rest of the Beatles manage to rescue him, but soon after they are swallowed by the dreaded Vacuum Thrask. The Thrask then swallows the entire sea of monsters. The Thrask has nothing left to suck up until it notices its own tail. It sucks up the tail and disappears up its own existence. Luckily, this causes the Yellow Submarine to be thrown clear. The Submarine motor has malfunctioned and they come to rest in the blank nothingness that is Nowhere Land. The Beatles notice that there is an inhabitant here, the tiny, poetry spouting Nowhere Man. He introduces himself as Jeremy Hillary Boob, Phd. Jeremy fixes the motor and goes back to his meaningless activities. (Song: Nowhere Man) Ringo feels sorry for Jeremy and invites him aboard. They sail for a while, but the submarine conks out again. The Beatles and Jeremy get out to try and repair the ship. Jeremy fixes the screw with bubble gum, but this causes the Yellow Submarine to take off with Old Fred and leaves the rest stranded. They realize that they are in the Foothills of the Headlands. John questions the heads and meets a lady friend. (Song: Lucy in the Sky with Diamonds). They realize that they must be near Pepperland since the ground is covered with pepper. The pepper causes the heads to sneeze, blowing our friends all the way to the Sea of Holes. They remember Old Fred told them that the way to Pepperland was via the Sea of Holes to the Sea of Green. They search the holes and Ringo puts a hole in his pocket. Jeremy is kidnapped by a lurking Blue Meanie while the others are searching for a way out. Finally, they find the Sea of Green and end up in Pepperland just as Old Fred arrives in the Yellow Submarine. Old Fred suggests that the Lord Mayor can be revived by music, and the Beatles hum a tune and the Lord Mayor is UnBonked. The mayor notices that the Beatles strongly resemble Sgt. Pepper's Lonely Hearts Club Band. He suggests that they disguise themselves as the band and rally the land to rebellion. Since their instruments were lost in the Sea of Monsters, they sneak past the sleeping Blue Meanies to the Bandstand where all of the musical instruments are being held. They find instruments, and band uniforms belonging to Sgt. Pepper's Lonely Hearts Club Band. They hide until dawn and make their escape. They are almost caught when George steps on a bagpipe, but they escape and begin to rally and unfreeze the people of Pepperland. (Songs: Sgt. Pepper's Lonely Hearts Club Band and part of A Little Help From My Friends). The Beatles then dispatch a group of giant Blue Meanies called Apple Bonkers by standing on each other's shoulders and bonking the giants and their Blue Meanie Sergeant with a huge Baldwin Apple. The Chief Blue Meanie and his henchman Max notice what is going on and dispatch the Dreadful Flying Glove to stop the Beatles. However, Glove is defeated by John as he sings (Song: All You Need is Love). Meanwhile, Ringo rescues Jeremy, who gets a boost to his confidence when he accidentally knocks out his guard with a falling apple. The Beatles then come across a giant Glass Globe, which encases the real Sgt. Pepper's Lonely Hearts Club Band. They were trapped at the start of the Blue Meanie attack by an Anti-Music Missile. They cannot open the globe until Ringo remembers that he has a hole in his pocket. He uses the hole to open the globe and Sgt. Pepper's Lonely Hearts Club Band is released. The dopplegangers are greatly amused by their resemblance until the blue four-headed dog attacks. Our heroes confuse and defeat the dog by hiding in a player piano (Song: Hey Bulldog). <the Hey Bulldog sequence was omitted from the original theatrical release> Jeremy confronts the Chief Blue Meanie and defeats him by quoting poetry that causes the Chief to burst into bloom with pink flowers. The Blue Meanies all run away in confusion. The Beatles and Jeremy call on the Blue Meanies to change their ways and join them in the musical fun. The Chief Blue Meanie and Max have a change of heart and the Blue Meanies join and party with their new friends. (Song: Its All Too Much) The real Beatles (in a live action sequence) reprise their adventures. John then warns that there are newer and bluer meanies sighted near this theatre! So, the Beatles go out singing. (Reprise: All Together Now).",
      "writers": [
         "Lee Minoff",
         "Lee Minoff"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0063823/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA4NjkxNzMxNV5BMl5BanBnXkFtZTcwMTM1MDQ3Nw@@._V1_SY317_CR2,0,214,317_AL_.jpg",
      "actors": ["Stars: Paul McCartney, George Harrison, Ringo Starr | See full cast and crew »"],
      "reviews": [
         "Over 35 years later, this is still an innovative animated film: colorful, clever and different. In fact, you'd have to look hard to find a more colorful film ever made. The Beatles characters are fun, spouting a number of good puns and inside jokes concerning lyrics from some of their past songs. The bad guys here, the \"Blue Meanies,\" are also fun to watch and really different from anything you've seen. This is wild stuff which can appeal to adults even more than kids. The only improvement I would have made would have been to shorten it a bit. Even at a fairly short 90 minutes, some could have been trimmed. The DVD is fine, except for the last 30 minutes when it gets grainy. However, the 5.1 surround sound more than makes up for that, affording the viewer to hear all these famous Beatles songs in a better format that surrounds you as a CD could never do.",
         "The music of the Beatles had galvanized an army of very creative artists who have accomplished the impossible, and created the movie that parallels the elegance and beauty of the music that inspired it. Many people feel that this film is a miracle, and I have the same feeling, especially when I'm watching it breathlessly from the beginning to its end. Similar to the way the Beatles themselves have created many of their masterpieces, this film is the result of a \"controlled chaos\". Lennon remarked that many of his imagery and lyrics were just conceived off the top of his head, which is precisely the thing that gives them the freshness and spontaneity we adore. Same is with the rich and fulfilling imagery of this film -- it is obviously an outcome of the 'shoot from the hip' approach. It sounds unbelievable, but the film's ending (the most brilliant piece of all), was thrown in during one hectic weekend! Knowing this, it is not surprising to learn that the principal artist who designed the look and feel of the \"Yellow Submarine\" movie, almost went blind after finishing it (he set a grueling schedule of sleeping only four hours every other night during the making of the film! -- it took him several years to regain his health) On a personal level, this film works as some kind of revelation for me. It is impossible to put it into words, but the film stirs the deepest, most contradictory emotions in me. It transcends space and time, and has the ability to bring me into the state where the regular, everyday thoughts do not apply. In that respect, it is as strong as the best Beatles songs. Many criticisms of this movie are sadly missing the point. To criticise the animation as being jerky and unrealistic amounts to criticising Picasso for not painting more photo-realistic canvases. Misses the point entirely. To criticise the understatement-laden dialogue is to miss the finer points of comedy, insisting on the Three Stooges slapstick only. To say that the story line is incoherent is to betray the sitcom-infested mind in the sad state of commercial-induced eating disorder. I must confess that I had approached the viewing of this film with a huge dose of skepticism. I thought it's going to look and feel lame, with a dated and naive hippy/psychedelia cliches. Boy, was I in for a shock! My rating: 11 out of 10",
         "'Yellow Submarine' is a visual stunner and an extremely well-scripted movie. There are lots of Beatles in jokes, George's fascination with Indian music and John's fascination with scientific theories are lampooned, the Beatles' power is joked about (\"Nothing's Beatle Proof!\") and poor old Ringo is just plain made fun of. The movie itself is arguably the most psychedelic ever made. The Beatles' descent into Pepperland is just one psychedelic scene after the other. The animation isn't great, but everything is just done so strange and fun that it becomes absolutely irresistible. The colors, landscapes, and creatures are just really different and vivid and vibrant. The songs are fit in very, very well (although \"Nowhere Man\" is undoubtedly the best sequence). Overall this works great as a musical or as an animated film, and there's definitely a lot of priceless, subtle dialog. I would name it one of the top 20 animated films of all time, really. Definitely worth watching, just because there simply isn't any movie like it. 10/10",
         "\"Yellow Submarine\" is a great film but it's not because of the plot or even the whimsical, non-sequitur filled dialogue. \"Yellow Submarine\" works best as a series of loosely connected music videos that pre-date MTV by 12 years. If you grew up with MTV and you think that most music videos consist of 80's Hair-Metal bands \"in concert\" or rappers in hot tubs with women in bikinis, take a look at some of the musical numbers in \"Yellow Submarine\". You have \"Only a Northern Song\" which is presented with Andy Warhol style pop-art images. \"Nowhere Man\" is a whimsical, trippy, rainbow colored cartoon. \"When I'm Sixty Four\" is illustrated by a \"Sesame Street\" style numerical countdown. Even \"All Together Now\", for which The Beatles themselves actually appear on screen, contains little camera tricks and quick cut edits that are common tools of more recent music videos. The two best segments in the movie, in my opinion, are \"Eleanor Rigby\" and \"Lucy in the Sky with Diamonds\". \"Eleanor Rigby\" uses black and white still photos of what is apparently Liverpool rotoscoped with occasional splashes of color to illustrate the dreariness of the lives of \"all the lonely people.\" The full-color rotoscoped images for \"Lucy\", such as the can-can dancing chorus line and the horse running in the field, are beautiful. If you are a fan of The Beatles, great animation, or music video, this film is for you.",
         "Next to FANTASIA, YELLOW SUBMARINE is one the best animated feature films ever made. We will always remember the sixties pop-art imagery along with some of the best dialog to grace cartoon-land (\"I haven't had so much fun since Pompeii....\"\"I'm a born lever puller.\") not to mention some of the best music to come from the best set of musicians the 20th century has produced! This is a kid's film at heart (wild adventures in strange distant lands, weird monsters, loud over bearing villians....) My only criticism is in the re-mastering, in 1999. The song \"Hey, bulldog...\" is added toward the end (A scene where the fab four meet up with a bunch of the Blue Meanies' bulldogs, and defeat them with the power of music.) The scene looks hastily slapped together,like something out The Beatles cartoon series (which was hated by the real life Liverpool lads. That's why they were originally not too thrilled with the announcement of this animated film.) There is a reason why these scenes are deleted, to allow classics like this to flow so easily on the screen. Anyway, a great, great classic.",
         "if this is a magic land, then this is Pepperland. If this is a magic film about this magic land, then this is Yellow Submarine. I believe, and many will agree with me on that, YS is the cleverest and most wonderful artifact of the hippie era. Here, you see no blatant drug references, no rude words, no endless acid space jams. No, here, the essence of the Flower Power time is represented as a smart, vivid, multicolored fairy tale. The idea that music may save the world and that the yellow submarine may be an escape from bleak, dull gray world is great. But even if we put this philosophizers aside, we view hilariously funny, colorful, brisk movie, with The Fab Four as a brilliant cast. And the lines! They are great, as when Ringo does exactly what the captain told him not to, or when The Nowhere Man starts his unforgettable gibberish, or when at the very end the real Bealtled appear, with all those quips and jokes. This is like a sweet, long, and very kind dream. May it never end!",
         "I bet you're thinking, \"another Beatles movie?\" but that's not really what this is. A wonderfully vibrant and gorgeous cartoon, and a treat for the eye and ear. This is how vivid and bright all cartoons should be. Great soundtrack of course, and the Beatles make a real cameo at the very end. Watch if you are a Beatle fan like me, or simply if you want a fun cartoon. They did a wonderful job remastering and cleaning it up.",
         "I will readily admit that I don't watch too many movies,unless I have heard good reviews about them or if it is an art film. While perusing the movies at the local library, I was attracted to the bright yellow case this movie was in. (I didn't know what it was at the moment.) Being a Beatles aficionado(sp?), I checked it out and brought it home. My husband was thrilled as he saw it when he was 5! Oh man. Get ready for a visual feast of color and sound.(and humor!) I was literally glued to the screen for the duration of the film. I mean, if you take your eyes off of it for just a second you will miss something. I love bright vivid contrasting colors so this was great, but it may hurt your eyes if you're into earthtones. I found it a great escape from reality and very light hearted. The art is fabulous. FABULOUS!!! I have seen a great many things in my life but NOTHING like this. Truly unique. Thanks for reading.",
         "What COULD compare? Yellow Submarine is 130,000 frames (90min x 60sec x 24 frames/sec) of classical, pop, tribute (to earlier animation styles), and original art from Da Vinci to Warhol to Picasso to Popeye to unbridled hallucination, drawn to a best-of-Python screenplay of non-sequiturs, puns, and pokes at institutions from cold-war antagonists to (governor) Reagan's paranoid National Guard deployment against counterculturists. It's a feast for the senses and sensibilities. One can revel in the flashing, dancing colors and art styles--most of which well-shame anything Disney ever attempted and make today's phony-depth digital claptrap look like spilled esophageal reflux. The soundtrack is a condensed spectrum of the range with which Lennon/McCartney/Harrison composed, from deeply contemplative (Eleanor Rigby) to near-post-adolescent exuberance (Harrison's contributions) to silly-love-song filler showtunes (All Together Now). The dialog exchanges keep viewer's verbal senses on the edge of their seats. The theme undercurrents lightheartedly appeal nostalgically to those who were drawn to it in its theatrical release, historically to those who still wonder 'what the 60s was all about', without getting in the way of sheer artistic ebullience. If you're an adult, it helps to like animation and British-invasion-era music (or Mozart, Bach, Beethoven, Rodgers & Hammerstein, for that matter). If you're an adult watching it with your kids (there's nothing offensive), be prepared for them to groan at Disney/Pixar/Nickelodeon rubbish from then on, and say \"I want more of THAT!\"",
         "\"Yellow Submarine\" is my favorite movie of all time! The animation is a perfect psychedelic display that would make Peter Max proud, and rival anything out of the Disney studios. This movie made me love the Beatles, and might just do the same for you. And, if you can, be sure to see the version with the \"Hey Bulldog\" sequence. I'd never seen that one until recently, during its revival. So that was a special bonus!"
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Comedy",
         "Fantasy",
         "Musical"
      ],
      "productionCompanies": [
         "Apple Corps",
         "King Features Production",
         "TVC London"
      ],
      "summaries": [
         "The singing group, The Beatles, at the height of their popularity, made this cartoon of a land that is taken over by the Blue Meanies. They are recruited by an escapee to come and bring joy (and music) back to the land. The techniques are quite psychedelic in the cartoons and much care was taken to have the walks and mannerisms of the individual Beatles cartoons match the originals.",
         "The Beatles are spirited away in the eponymous yellow submarine to save Pepperland from the dreaded Blue Meanies. Along the way, the singing saviors encounter a surreal feast for both the eyes and ears: phantasmagorical creatures, outrageous landscapes, and colors that throb and vibrate to each and every Beatle song on the soundtrack. It's a drug-free, hallucinogenic journey for the armchair tripper, the peak of which is undoubtedly (and not surprisingly) the \"Lucy in the Sky with Diamonds\" sequence. An incredible film experience at all levels, \"Yellow Submarine\" manages to capture exquisitely and in visual form the beauty and madness of the incomparable Beatles. And to think 1968 also included Kubrick's \"2001!\"",
         "The Beatles agree to accompany Captain Fred in his Yellow Submarine and go to Pepperland to free it from the music hating Blue Meanies."
      ],
      "budget": 250000
   },
   "movielensId": 2857,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1968-07-17",
      "dvdReleaseDate": "1999-09-14",
      "directors": ["George Dunning"],
      "runtime": 90,
      "movieId": 2857,
      "title": "Yellow Submarine",
      "mpaa": "G",
      "actors": [
         "Paul Angelis",
         "John Lennon",
         "Paul McCartney",
         "George Harrison",
         "Ringo Starr"
      ],
      "imdbMovieId": "0063823",
      "originalTitle": "Yellow Submarine",
      "genres": [
         "Animation",
         "Fantasy",
         "Music"
      ],
      "youtubeTrailerIds": ["8O1KRnniOw8"],
      "plotSummary": "The Blue Meanies take over Pepperland, draining it of all its color and music, firing anti-music missiles, bonking people with green apples, and turning the inhabitants to stone by way of the pointed finger of a giant blue glove. As the only survivor, the Lord Admiral escapes in the yellow submarine and goes to Liverpool to enlist the help of the Beatles.",
      "tmdbMovieId": 12105,
      "avgRating": 3.5746,
      "releaseYear": "1968",
      "numRatings": 5201,
      "posterPath": "/l2u1MDnR89ptsKZDxIF4LFTiBWP.jpg"
   }
}