{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "cyborg",
            "id": 679
         },
         {
            "name": "post-apocalyptic",
            "id": 4458
         },
         {
            "name": "sequel",
            "id": 9663
         }
      ],
      "imdb_id": "tt0113948",
      "video": false,
      "title": "Nemesis 2 - Nebula",
      "recommendations": [
         30522,
         60173,
         87699,
         107079,
         41775,
         49299,
         36837,
         113674,
         107096,
         29852
      ],
      "backdrop_path": "/TzMsr6Haai9Lj7jV5V91ute48P.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Alex",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a15f",
               "name": "Sue Price",
               "profile_path": null,
               "id": 230665,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Nebula",
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a163",
               "name": "Chad Stahelski",
               "profile_path": "/hr82USXEc8XWvdnH0TpyddMpi7j.jpg",
               "id": 40644,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Emily",
               "gender": 1,
               "credit_id": "52fe469bc3a368484e09a167",
               "name": "Tina Cote",
               "profile_path": null,
               "id": 94648,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Po / Juna",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a16b",
               "name": "Earl White",
               "profile_path": null,
               "id": 94663,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Zumi / Rebel #2",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a16f",
               "name": "Jahi J.J. Zuri",
               "profile_path": null,
               "id": 94656,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Zana",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a173",
               "name": "Karen Studer",
               "profile_path": null,
               "id": 1263308,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Tribal Chief",
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a177",
               "name": "Shelton Baily",
               "profile_path": null,
               "id": 1263309,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "U.N. Chief",
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a17b",
               "name": "Jon H. Epstein",
               "profile_path": null,
               "id": 91897,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Lock",
               "gender": 1,
               "credit_id": "52fe469bc3a368484e09a17f",
               "name": "Sharon Bruneau",
               "profile_path": null,
               "id": 1041315,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ditko",
               "gender": 1,
               "credit_id": "52fe469bc3a368484e09a183",
               "name": "Debbie Muggli",
               "profile_path": null,
               "id": 975563,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a14f",
               "name": "Albert Pyun",
               "profile_path": "/3Bxq2mHND331bCi79eoCXB9MapK.jpg",
               "id": 63937,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe469bc3a368484e09a155",
               "name": "Albert Pyun",
               "profile_path": "/3Bxq2mHND331bCi79eoCXB9MapK.jpg",
               "id": 63937,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe469bc3a368484e09a15b",
               "name": "Rebecca Charles",
               "profile_path": null,
               "id": 192841,
               "department": "Writing",
               "job": "Characters"
            }
         ]
      },
      "genres": [
         {
            "name": "Science Fiction",
            "id": 878
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 1.084655,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63105,
      "vote_count": 14,
      "budget": 0,
      "overview": "It has been 73 years since Alex failed and the Humans lost the Cyborg Wars. Since then, the Humans have been enslaved. Scientists have developed a new DNA strain, which could signal the end of the Cyborgs, and they inject it into a volunteer. When the Cyborgs learn of the woman and the baby they list both for termination.",
      "similar": [
         14092,
         263115,
         9323,
         12140,
         11633,
         87101,
         861,
         5548,
         97020,
         76341,
         8810,
         9355,
         534,
         281,
         604,
         605,
         335984,
         280,
         5550,
         9739
      ],
      "original_title": "Nemesis 2 - Nebula",
      "runtime": 83,
      "poster_path": "/mY7SX6aBDumSweQMTCdfrIbMLAa.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Imperial Entertainment",
            "id": 21437,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Filmwerks",
            "id": 7954,
            "origin_country": ""
         }
      ],
      "release_date": "1995-09-26",
      "vote_average": 4.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Nemesis Collection",
         "id": 286948,
         "poster_path": "/nKAGlTL97Sp1zIy3f6rGEqjyjGG.jpg"
      },
      "tagline": "The Future Just Got Darker",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Albert Pyun"],
      "runtime": 83,
      "synopsis": null,
      "writers": [
         "Rebecca Charles",
         "Albert Pyun"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0113948/",
      "coverLink": null,
      "actors": ["Stars: Sue Price, Chad Stahelski, Tina Cote | See full cast and crew »"],
      "reviews": [
         "I have a certain affection for the first \"Nemesis\" film. I know that everyone considers it to be pretty bad, but at least it was fast-moving and enjoyable. This first sequel doesn't have the original's non-stop action and narrative force, and it's awfully reminiscent of both \"The Terminator\" (in its \"messianic\" myth) and \"The Predator\" (in the look of the monster that pursues the heroine). But as B-movies go it's still somewhat above average, and Sue Price, the starring female bodybuilder, is not only impressively built but very appealing, too. (**)",
         "Albert Pyun is the writer and director of many a straight-to-video action movie (just look on the bottom shelf of your local video store). Generally dreadful, his films are cocktails of bigger, better ones, but this one does stand out from the crowd. I first rented this a couple of years ago, and I actually quite enjoyed it. It's about Alex (body-builder Sue Price) who was adopted by a tribe in Northern Africa, after her mother was killed by theives. Raised by the way of the warrior, she's a tough kind of cross between 'Alien slayer' Ripley and 'cyborg dodger' Sarah Connor. However, she's completely human either. She is in fact genetically modified (as explained in an introductory voice-over) and can jump and run and fight much better than anybody else. So, when a cyborg (the Nebula of the title) is sent back from the future to kill, she has her work cut out. Yes, it is like T2; yes, the cybergenetic villain is basically the PREDATOR; and yes, the budget was about £2.50. But, it is very entertaining in a half-drunk, don't-quite-know-what's-going-on state of mind. The action scenes are a tad flat, and of course there is a whole encyclopedia of cliches, but if you except if for a low-budget action movie, which it most definitely is, then you just sit back and enjoy it. It's crap, but it's good crap, and at least it can admit it.",
         "In 2077, the cyborgs have won the war against humanity which they started in the first part. Baby Alex is sent back in time to 1980, so she can safely grow up in the 20th century - and become the star of part 2. Stranded in Africa, the girl is raised by a native tribe who is one day attacked by Nebula, a warrior from the future. Her enemies did obviously discover Alex finally, and she has got only a knife at first to fight the heavily armored cyborg. So she is mostly on the run, also attacked by human enemies, (a rebel army), and on top of that, she also tries to rescue 2 American girls. Sounds like a mission impossible, doesn't it? But Sue Price in her first movie is quite a show with her muscles. Pyun dared giving the Stallone/Schwarzenegger role to a woman, and then look at the locations: a fight against a robot - that's something you'd expect to happen on a space station or a dark rainy city a la Blade Runner. Instead, Pyun takes us into a bright, sunny Africa (shot in Arizona, though) and the first third of the movie is just about Alex' initiation as a warrior, with dialogs in the tribe's language and subtitles. Strong colors and wide angle shots of barren landscapes make it look really good. The remaining two thirds of \u0084Nemesis 2\" are less remarkable: a constant battle, you can't get some popcorn before the next grenade explodes. Since the hunter has got a lot more technical options (radar, infra-red, audio scanning, laser, whatever), his prey stands no chance normally, but has a strong survival instinct. The ending titles already announce \u0084Nemesis 3: Time lapse\". I watched the 4 Nemesis movies (which I watched first in the 1990s) again now in chronological order for my reviews and voted 7/7/5/5.",
         "This is an excellent film for female body-builder & female action fans! I think that Sue Price did a great job in this film series (Nemesis 2,3,4) and proved to be a great fighter. She has a very striking appearance and a will of iron to resist the powerful Nebula (Nemesis 2). Though not a film of great value and Sue Price's acting skills not the best to have met in my life, the movie itself was something awesome, a priceless gem for fans of female body-builder action! Well, some parts of Nemesis 2 have been copied by other famous sci-fi films, such as Terminator or Predator, but that's not the point. The point is that A.Puyn casted in that film a very talented body-builder who put all of her energy and body talent to show us the best she can do. I really enjoyed that film and watched with the same enthusiasm Nemesis 3 (a rather boring sequel) and Nemesis 4 (a much more interesting sequel than 3). What a pity it hasn't shown yet on DVD :-(",
         "Naming the absolutely most pathetic piece of crap in cinematic history is not an easy task, candidates being so abundant, but Nemesis 2 has been my personal favorite ever since I saw it. It was so funny we had to rent it again the next day, and again I laughed so hard I was literally rolling on the floor. (This usually only happens when I see Monty Python's \"Scott of the Antarctic\".) Throughout the whole movie, an overwhelming what-the-heck-feeling firmly grasps the viewer. I'm utterly confounded that this clumsy home video ever made it to production stage. It's supposed to be a sequel, yet has no apparent connection whatsoever with the first film. The hero has the same name, but this time \"Alex\" is female, although it took us half way into the movie to stop guessing, what with all the muscles and the barbarian-nomad outfit! There is really no plot at all, it's merely a prolonged chase scene, only it's so slow-paced and senseless that calling it a chase scene makes it sound way more interesting than it really is. There is almost no dialogue, which is just as well considering the quality of it, and then the film suddenly just comes to an abrupt end after a blatant action scene with lots of gasoline explosions, without ever really explaining what it was all about. Luckily, it never gets boring, because there's something silly and phony going on at all times! Terrible movies are usually just tedious, but Nemesis 2 is such a perfect mixture of over-seriousness and utter nonintentional wackiness that it's truly entertaining. Rent this film, or buy it even, you won't be disappointed!",
         "Bodybuilder Sue Price plays Alex, a girl who grew up in an African tribe. Everybody lies to her about her true origins, but once she passes a toughness test and beats her main tribe bully to a pulp, the main man finally lets her see the time machine she came out of 20 odd years ago. Meanwhile a cyborg called Nebula who looks like a cross between The Fly, Predator and the evil alien wife from the Outer Limits episode, zeroes in on Alex and sets on a path of total annihilation. That's how this film starts and it's relatively well made for a video feature. The rest of the movie is non stop Sue running around in little clothing, kicking, stabbing and shooting Nebula and various goons and that's it. But, to Albert Pyun's credit, he's smart enough to blow up as many buildings as he can on camera. What this movie lacks in plot, and it really does lack in plot, it makes up for with explosions. And Sue Price, who's quite feminine looking despite being ripped as hell.",
         "Sequels in general are hard to do. If the previous film is well liked then the filmmakers of number 2 have got to try and live up to that. But if we're talking sequels to direct to video or limited release films the bar may not be so high. The first 'Nemesis,' a film that is probably director Albert Pyun's most talked about, was a flop at the box office and quickly went to video. It would be discovered by film lovers who enjoy a good piece of cheesy low budget entertainment from time to time. It's not great art by any stretch of the imagination, but it has it's charms. Pyun would go on to make 3 sequels, all shot back to back, and I'm sure no one expected something better than the first. This first sequel certainly isn't that, but it has a certain charm all it's own. Pros: Actors are game. Nice score. Beautiful desert landscape and photography. Effortless pace. Pyun infuses this with some style. Also kudos to him for not repeating himself and instead trying to take the series in a new direction, while still having some ties to the first film. Impressive android suits. Cons: Virtually plot less. Dated visual effects. Many disposable characters. Lacking in memorable action scenes. Some plot holes. Final thoughts: I have to admit I was disappointed that this wasn't a new adventure for the character of Alex Rain from the first film. I wanted to see him up against some new opposing force, but I guess it just wasn't meant to be. What we got instead is still fun to watch if you enjoy these type of movies and still makes a for a good double feature with the original. Now I just need to track down Nemesis 3: Time Lapse. My rating: 3/5",
         "In this sequel to the original & surprisingly good NEMESIS, ALEX RAIN, a female warrior named after the original hero ALEX RAIN, from quiet a few years ago, is the only one who can save humanity from a lethal cyborg who wants to wipe out our planet. Second film is totally worthless & cheap, despite it's interesting story & villains, NEMESIS 2 is an extremely dull sequel, that nowhere near matches up with the thrills or action not to mention acting talent of the original, no wonder OLIVER GRUNER didn't want to come back! Like I mentioned above in my brief synopsis of the films plot, ALEX RAIN is a female warrior named after Gruners character & that's another problem, NEMESIS 2, uses the old cliché storyline in this case, we are informed that the hero of the original failed to stop the cyborgs & was killed. I mean it's the easiest way out of getting out of writing in the original hero of the movie when you can't fit him/her into a new storyline or can't get the old actors who played them back, or if they want to compose a new hero, just kill the original hero/heroine off, say that they died many years ago of some disease, have them fighting bad guys elsewhere, or just ignore the previous movie or movies & start an in name only sequel or ignore them & say they never happened. But no matter what the excuse may have been, I doubt that it would have made this movie or it's sequels any better, while the stories & villains were well written, it's to cheap to be any good mostly the whole movie is set in the desert (an affordable location) & the action is dull, as are the performances & even ALBERT PYUN'S direction is not up to what it was in the original. Skip this one, even if you liked the first one, you'll probably have a hard time sitting through it & the next two installments. Supposedly this was shot back to back with Parts 3 & 4 & no doubt the budget the producers had wasn't all that big to begin with. No wonder these are so dull & cheap looking...Followed by NEMESIS III: PREY HARDER. *1/2 stars",
         "This Film was Great when i first seen it, that was about 10 years ago. i cannot hardly remember this film but i can remember that cyborg (nemesis) i just call him or it \"Arnie\", and if it had a woman who was a body builder who played Alex i think her role name was then this is the film i want to watch one last time! if anyone out their has this film could they please get in contact? i know i have a really slim chance of finding anyone who even commented on this but its a shot I'm willing to take! but this film was great when i watched it, i mean a cyborg that cannot be killed following and trying to kill Alex it was great when i was little, but the scenes seemed enclosed and cramped, I've never seen the first but i have been told its better than this one if its true then maybe i was wrong and my little mind played tricks on me, anyways thanks ghostfacekillah20032004@hotmail.com",
         "The original film is a bit of a cult classic in the B-movie genre, trashy sci-fi hokum that somehow just kinda works with its gritty low budget feel. This sequel is more of the same accept Mr Pyun merrily rips off two classic sci-fi films left right and centre. Humans have developed a new DNA strain that could put a stop to the cyborg threat. Its injected into a pregnant female who then escapes back in time to Africa 1980. There she is killed by hunters but the child is saved and raised by natives. Now comes the copyright infringements, the cyborgs send a killer cyborg back in time to terminate the child who is now a very muscular adult female with a great ass. So that's a certain sci-fi flick ripped right there, then for the duration of the film another sci-fi is ripped off completely as we follow this bounty hunter predator as it hunts this female. I might add this cyborg bounty hunter has its own light bending camouflage, it growls like an alien creature, it has some kind of body armour suit and mask, its own HUD in its mask giving it various tracking and voice analyzing tricks and it has its own shoulder mounted laser...ring any bells yet? But that's not all, what really amazed me is it took around 12 minutes before we get to see the films title. It took a further 25 minutes before we even get a word of English out of the main heroine! the film is spoken entirely in a native African language (I think, could be gibberish) by everyone for a good chunk of the film. So basically I had no clue what was going on, guess that's why there is a bit of narration at the start and those handy bounty hunter screen readouts. As we delve deeper into the film we are given plenty of running action, plenty of chase sequences, then more running, and some more, and yet more! Most of the latter half of the film is watching the heroine run for cover whilst explosions go off around her. There is some kind of plot involving treasure and some guerrilla type fighters but to be honest I'm not really sure what all that was about. The main plot seemed to be our muscle bound heroine running from the Predator rip- off creature. I've never seen so much running in a film! running from things getting blown up, so many buildings, so many missed shots by this so called top cyborg bounty hunter Nebula. All this and hardly any dialog I kid you not. Anyway it all ends as you'd expect surprise surprise. Despite all this it actually looks OK in places, Pyun isn't too bad at slow motion high octane action, a low budget John Woo if you will. The location isn't too bad either really, meant to be Africa but filmed in the US, it does the job though, not too shabby. Its all utterly ludicrous of course, some of the back flips and somersaults through the air are insanely daft, and she firing a gun at the same time! Thing is the film starts off reasonably sensible but just sinks into this overblown over the top nonsense...still its somehow quite enjoyable. Sue Price all greased up as the lead heroine helps of course. 6/10"
      ],
      "genres": [
         "Action",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Filmwerks",
         "Imperial Entertainment"
      ],
      "summaries": ["It has been 73 years since Alex failed and the Humans lost the Cyborg Wars. Since then, the Humans have been enslaved. Scientists have developed a new DNA strain, which could signal the end of the Cyborgs, and they inject it into a volunteer. When the Cyborgs learn of the woman and the baby they list both for termination. To escape, she takes a stolen Cyborg ship and transports back in time to East Africa in 1980, where the mother is killed, but the baby is saved. It takes 20 years, but the Cyborg bounty hunter Nebula finally locates the girl, named Alex, and travels back in time to terminate her."],
      "budget": 0
   },
   "movielensId": 286,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-09-26",
      "dvdReleaseDate": null,
      "directors": ["Albert Pyun"],
      "runtime": 83,
      "movieId": 286,
      "title": "Nemesis 2 - Nebula",
      "mpaa": "R",
      "actors": [
         "Sue Price",
         "Chad Stahelski",
         "Tina Cote",
         "Earl White",
         "Jahi J.J. Zuri",
         "Karen Studer",
         "Shelton Baily",
         "Jon H. Epstein",
         "Sharon Bruneau",
         "Debbie Muggli"
      ],
      "imdbMovieId": "0113948",
      "originalTitle": "Nemesis 2 - Nebula",
      "genres": [
         "Science Fiction",
         "Action",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "It has been 73 years since Alex failed and the Humans lost the Cyborg Wars. Since then, the Humans have been enslaved. Scientists have developed a new DNA strain, which could signal the end of the Cyborgs, and they inject it into a volunteer. When the Cyborgs learn of the woman and the baby they list both for termination.",
      "tmdbMovieId": 63105,
      "avgRating": 2.01316,
      "releaseYear": "1995",
      "numRatings": 114,
      "posterPath": "/mY7SX6aBDumSweQMTCdfrIbMLAa.jpg"
   }
}