{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0173390",
      "video": false,
      "title": "Sugar Town",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 22,
               "character": "Clive",
               "gender": 0,
               "credit_id": "58f3d637c3a36807df015968",
               "name": "John Taylor",
               "profile_path": "/1S121MAHLZfcDjv3zbe0o9LxSIB.jpg",
               "id": 599196,
               "order": 0
            },
            {
               "cast_id": 13,
               "character": "Nick",
               "gender": 2,
               "credit_id": "52fe4acf9251416c750eede5",
               "name": "Michael Des Barres",
               "profile_path": "/kKXCivEKwYYVirhyIVsqxTlGi5.jpg",
               "id": 65334,
               "order": 1
            },
            {
               "cast_id": 14,
               "character": "Jonesy",
               "gender": 2,
               "credit_id": "52fe4acf9251416c750eede9",
               "name": "Martin Kemp",
               "profile_path": "/ofABQvYhvP4evuyl8JLvghzMLbs.jpg",
               "id": 47652,
               "order": 2
            },
            {
               "cast_id": 11,
               "character": "Gwen",
               "gender": 1,
               "credit_id": "52fe4acf9251416c750eeddd",
               "name": "Jade Gordon",
               "profile_path": "/i3JihtnShYCgWomrmGtKDW3RC5f.jpg",
               "id": 180730,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Burt",
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eeded",
               "name": "Larry Klein",
               "profile_path": null,
               "id": 1116373,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Carl",
               "gender": 2,
               "credit_id": "52fe4acf9251416c750eedf1",
               "name": "John Doe",
               "profile_path": "/EuDIT3BBTqkkLKD8wgp7MwuGCx.jpg",
               "id": 42746,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Kate",
               "gender": 1,
               "credit_id": "52fe4acf9251416c750eedf5",
               "name": "Lucinda Jenney",
               "profile_path": "/nhKWN1oWThSgz0AnUDOcQTubh3r.jpg",
               "id": 5148,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "In Utero Baby",
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedf9",
               "name": "Marion Moseley",
               "profile_path": null,
               "id": 1116374,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Violet",
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedfd",
               "name": "Veronica Nommenson",
               "profile_path": null,
               "id": 1116375,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Rose",
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eee01",
               "name": "Elena Nommenson",
               "profile_path": null,
               "id": 1116377,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Eva",
               "gender": 1,
               "credit_id": "52fe4acf9251416c750eee05",
               "name": "Rosanna Arquette",
               "profile_path": "/rQMQYQUF9QzD6oDfkP6tsjmyZhS.jpg",
               "id": 2165,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4acf9251416c750eeda3",
               "name": "Allison Anders",
               "profile_path": "/rsfxpcNEdmNqZyNcct0J695LhBK.jpg",
               "id": 3110,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4acf9251416c750eeda9",
               "name": "Allison Anders",
               "profile_path": "/rsfxpcNEdmNqZyNcct0J695LhBK.jpg",
               "id": 3110,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4acf9251416c750eedaf",
               "name": "Kurt Voss",
               "profile_path": null,
               "id": 21404,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4acf9251416c750eedb5",
               "name": "Kurt Voss",
               "profile_path": null,
               "id": 21404,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedbb",
               "name": "Nancy Griffin",
               "profile_path": null,
               "id": 1116371,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedc1",
               "name": "Daniel Hassid",
               "profile_path": null,
               "id": 115312,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedc7",
               "name": "Nanda Rao",
               "profile_path": null,
               "id": 112751,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedcd",
               "name": "Larry Klein",
               "profile_path": null,
               "id": 1116372,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedd3",
               "name": "Kristian Bernier",
               "profile_path": null,
               "id": 21409,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4acf9251416c750eedd9",
               "name": "Chris Figler",
               "profile_path": null,
               "id": 960413,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 0.586071,
      "production_countries": [
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 142132,
      "vote_count": 2,
      "budget": 0,
      "overview": "Look at the lives of struggling L.A. scene rock stars follows main character, Gwen, on her quest for the top. Working as an assistant to a film production designer, she tries to steal her boy friend who is a music producer by offering sexual favors. The producer meanwhile is trying to orchestrate a comeback for a former glam band comprised of Michael Des Barres, John Taylor and Martin Kemp. Rosanna Arquette plays the former movie star wife of the lead singer, who is fretting because she has just been offered the role as the mother of one of the new ingenious. Beverly D'Angelo also shows up as a millionairess who agrees to bankroll the group, but only if she gets a roll in the hay with the lead singer. All of the career problems, including drug proclivity, are represented in this film.",
      "similar": [
         258480,
         10735,
         27586,
         244772,
         401898,
         858,
         634,
         3981,
         112160,
         437557,
         17130,
         43923,
         11634,
         141,
         242224,
         394117,
         376867,
         297762,
         370663,
         376660
      ],
      "original_title": "Sugar Town",
      "runtime": 92,
      "poster_path": "/eKUemqyt6OSyZENeHgTZUwIGN8r.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Channel Four Films",
            "id": 181,
            "origin_country": "GB"
         },
         {
            "logo_path": null,
            "name": "October Films",
            "id": 236,
            "origin_country": ""
         }
      ],
      "release_date": "1999-09-17",
      "vote_average": 5.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Allison Anders",
         "Kurt Voss"
      ],
      "runtime": 92,
      "synopsis": null,
      "writers": [
         "Allison Anders",
         "Kurt Voss"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0173390/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTYzNTM5NzI2MF5BMl5BanBnXkFtZTYwODY5Mjg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jade Gordon, John Taylor, Michael Des Barres | See full cast and crew »"],
      "reviews": [
         "Everyone was saying to me not to get this on DVD cos its rubbish! But when I first watched it, I really enjoyed it. OK, it may seem a bit cut off at the end but the storyline was really good. It rounded up showbiz life in LA well and gave an insight to how celebrities live. The acting I thought was good too - especially watching John Taylor, who I thought had only one use and that was on a bass guitar. He really surprised me especially at the end as he watched his wife get on well with his \"son\". Martin Kemp was good also - so Duranies and Spandau fans are equal!! For a movie that took about a week to make, its really good and I advise you to watch it, see what you think. Its a film that cannot be judged unless you have seen it all the way through.",
         "Check it out. It's really sweet and funny and well-written. Good performances by all, but especially Jade Gordon, John Taylor (yes, from Duran Duran!), and Rosanna Arquette. They make you write four lines before they'll accept my comments so I'm just going to say I enjoyed it.",
         "I loved it. It's a good movie. Very Allison Anders-y (if you've seen any of her other films, you know she has a distinct style). Little stories told in parallel, sometimes intersecting, sometimes not. There is no Grand Plot, no apocalyptic scene...just characters, people, doing their thing. Kept my interest completely (yes, even in scenes that didn't include John Taylor *wink*) from start to finish, and I refuse to divulge any critical details, because the movie's better if you go into it not knowing too much. WILL, however, say a few things: * JT is _really_ good in it! Who knew he'd be such a good actor? Yes, he's playing himself, basically, but still. He does a _great_ job. *Proud Johnfan Moment* :) * Michael Des Barres is, as usual, delightful and hilarious. * Martin Kemp employs a kickass Cockney accent (but then, he IS on EastEnders nowadays, and is also quite good. (who knew these musicians could act?!!) * The woman who played Tita in the movie \"Like Water For Chocolate\" is in Sugar Town. * Allison used real Duranies to play fans in the movie, bless her. One, Alyse, even uses her real name when 'Clive' (played by John) signs an autograph for her. * some of the dialogue is unintentionally hysterical, because it SO parallels the real lives of the actors-- e.g. Clive remarks to his bandmates that they were all in \"seminal bands [of the 80s]\", and it is also mentioned later in the film that \"in the early 80s, our singer landed no fewer than 42 magazine covers in _one year_...\", prompting giggles from me and surely any other fan of 80s pop bands. What's it ABOUT??? I'm not telling. Surprise is good. The best line in the movie is Clive's: \"Because on that tour I made a point...of only getting blow jobs.\" (he's denying that he had sex with a fan) (I howled) K. -- kellygirl",
         "As usual, another Allison Anders film has come into my radar screen, and, as usual, I enjoyed it. Allison has a wonderful way of taking real life and showing it with non-judgmental truth. She takes the old adage of theatre \"holding a mirror to life\" and puts in on film. Sugar Town, as with all of her works, creates rich characters in a short time. Despite having so many characters get a significant chunk of the plot, the characters are based on recognizable truisms. You know who these people are quickly enough without it feeling stereotyped or one-dimensional. It gives you the sense that you know them quickly, quickly enough to get into the twisted maze of interconnected lives she weaves for her characters. The actors cast in this script, while admittedly playing parts written with them in mind, slip into their skins with ease. Noteworthy moments for me include the first time I've looked at Beverly D'Angelo and NOT wondered where Chevy Chase was hiding their vacation plans. Michael Des Barres was deliciously bad, nevermind the typecasting. John Taylor's acting debut surprised me. As a fan of his for a number of years, I'd seen his early \"acting\" attempts in Duran Duran videos and the odd British sci-fi show \"Timeslip\". They weren't exactly Oscar material. Here, he proves that he can carry a script as well as a tune, and not get upstaged by a cute kid in the process. The world will not change because of this movie, nor was I moved to any form of emotional revelation. What I did get was a good laugh and a bit more affirmation that I'm quite glad I let the teenage dream die and never tried to move into the music industry.",
         "Yes, I am a sucker for Rosanna Arquette. She actually did very well in this film as a former horror film actress married to the lead singer of a rock band that is trying to make a comeback. Rockers include John Taylor from Duran Duran, Michael Des Barres from Detective, John Doe from X, and Martin Kemp from Spandau Ballet. Also features Ally Sheedy (High Art, Man's Best Friend) and Beverly D'Angelo (American History X, Vegas Vacation). Vincent Berry (Free Willy 3: The Rescue, \"Manhattan AZ,\" Baby) was really cute as a son, who was a product of a rock concert get together, and dropped at the door by mom. Turns out he is a big fan of horror movies and that helps with bonding with the lovely Rosanna. Cool.",
         "\"Sugar Town,\" Allison Anders and Kurt Voss's comedy-drama about life on the fringes of the music world, doesn't have an actual story per se - it's more of a collection of vignettes that don't make a unified whole, but if it's a mess, it's a likeable one. Following an ambitious young singer (Jade Gordon), a production designer (Ally Sheedy) who makes friends with her, a session guitarist with a pregnant wife who gets a shot at a tour with a Latin singer, a group made up of former British rock stars (amusingly, all played by actual former British rock stars) whose big deal is dependent on Beverly D'Angelo's lust for one of them (\"If she had a teenage daughter... but you know how Nick is about having sex with adult women\"), and Rosanna Arquette coping with a) getting offered a role as Christina Ricci's mother and b) finding her ex-rock star husband may or may not have fathered a son on tour. The movie's casual tone leaves a few of these lines unresolved, and if it's a bother that the movie's most unsympathetic character never gets hers, the movie's abrupt ending seems more of a natural progression than a mistake on the part of the writers. References to Fiona Apple and Blur already make it seem a bit dated, but there are plenty of fun moments throughout (such as Michael Des Barres' attempt to pick up Bijou Phillips in a bar and the sight of Arquette bonding with her stepson). Not overly significant, but worth seeing. And it's nice to see Rosanna Arquette in a good movie for once - when her character comments that she hasn't been getting decent scripts, us fans know what she means.",
         "Allison Anders' best movie is a terrific ensemble piece, and what an ensemble! Seemingly playing themselves are ex-Duran Duran and Spandau Ballet members John Taylor and Martin Kemp, X frontman John Doe, Michael Des Barres (whose self-parody here deserves some kind of award), plus great turns from Rosanna Arquette, Beverly D'Angelo, Ally Sheedy, someone named Lucinda Jenney (I love her whoever she is) and a number of other actors who barely seem to be acting, they are so natural and the dialogue so true to life. This is one of those rare movies of perfectly observed little details, with not a false note struck; plus it gives a droll and utterly believable glimpse inside the LA music and production worlds. You care about each character, even the detestable ones (like central figure Gwen) and there are about 20 characters to follow. Reminds a bit of an early Alan Rudolph piece but breezier and less self-conscious. I give SUGAR TOWN 8 stars, or 3 1/2 on Len Maltin's scale. I live for movies this good.",
         "I must admit that I'd never heard of this movie before I came across it at Blockbuster. I decided to pick it up for the cast, not being a particularly big Anders fan. I was rewarded with a low-key, funny and enjoyable 90 minutes. Perhaps it was the short filming period (and I suspect a fair amount of ad libbing by the cast), but the thing I liked best about this movie was that everyone seemed so relaxed and natural. In many cases, I'm sure the performers were less acting and more riffing on their own lives and those of people they've encountered over the years. With the exception of the two \"blond ambition\" wannabes, everyone in the movie exhibited at least some redeaming characteristics. While I won't say I was particularly drawn to any of the characters, neither was I repulsed by any of them. They all seemed more or less products of their past lives, with the inevitably warped perspective living the \"star\" lifestyle brings. All in all, a fun way to spend an hour and a half.",
         "This movie was so much fun. It boasted an incredible cast -- Roseanna Arquette, Michael Des Barres, Beverly D'Angelo, John Doe, Lumi Cavazos, Ally Sheedy, John Taylor of Duran Duran, etc. It gave an inside peek into the lives of mostly has-been rock stars who are still struggling to create and, in some cases, survive. Various stories are interwoven throughout the film and the sweetest and most believable was that of John Doe's character and his family. I found the last scene between him and his wife incredibly touching. Michael Des Barres was scintillating and hilarious, as usual. His scenes with Bjou Philips and Beverly D'Angelo were priceless. Lumi Cavazos was sexy as hell and Richmond Arquette about broke my heart. Great film. Great sets, too -- I wondered if the homes actually belonged to the actors. Ally Sheedy's just looked so lived in and real. I did wonder why she would hire the gal Roseanna Arquette's character recommended -- but I'll say no more. See the movie and have fun!",
         "Caught this Movie on the TV early one morning. The synopsis sounded promising being a Los Anglino with some history in the music biz and having some first hand experience with \"Has Beens\" colliding with \"Soon To Be Has Beens\" and their actress girlfriends and wives. This movie sucked on so many levels. Bad writing, bad lighting, bad sound editing, bad make-up, bad.. bad... bad... One scene where two fawning fans appear unannounced at a rockers door was just plain awful. And (**spoiler, maybe**) when Ally Sheedy's character is talked into wearing a painters smock on a first date (she's a designer for God's sake!) by a just befriended \"housekeeper\" ( she can afford a housekeeper and is THIS stupid!!!?) The more I think about it there was a real dislike for women in general throughout this whole flick. I will say that for one of these \"Lookee, musicians acting like musicians!!!\" vanity projects it wasn't as bad as Paul Simon's \"One Trick Pony\". But that ain't saying much."
      ],
      "genres": [
         "Comedy",
         "Music"
      ],
      "productionCompanies": [
         "Channel Four Films",
         "October Films"
      ],
      "summaries": ["Unimpassioned look at the lives of struggling L.A. scene rock stars follows main character, Gwen, on her quest for the top. Working as an assistant to a film production designer, she tries to steal her boy friend who is a music producer by offering sexual favors. The producer meanwhile is trying to orchestrate a comeback for a former glam band played by Michael Des Barres (of Power Station fame), John Taylor (from Duran Duran), and Martin Kemp (from Spandau Ballet). Rosanna Arquette plays the former movie star wife of the lead singer, who is fretting because she has just been offered the role as the mother of one of the new ingenious. Beverly D'Angelo also shows up as a millionairess who agrees to bankroll the group, but only if she gets a roll in the hay with the lead singer. All of the career problems, including drug proclivity, are represented in this film."],
      "budget": 250000
   },
   "movielensId": 2865,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-17",
      "dvdReleaseDate": null,
      "directors": [
         "Allison Anders",
         "Kurt Voss"
      ],
      "runtime": 92,
      "movieId": 2865,
      "title": "Sugar Town",
      "mpaa": "R",
      "actors": [
         "John Taylor",
         "Michael Des Barres",
         "Martin Kemp",
         "Jade Gordon",
         "Larry Klein",
         "John Doe",
         "Lucinda Jenney",
         "Marion Moseley",
         "Veronica Nommenson",
         "Elena Nommenson",
         "Rosanna Arquette"
      ],
      "imdbMovieId": "0173390",
      "originalTitle": "Sugar Town",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "Look at the lives of struggling L.A. scene rock stars follows main character, Gwen, on her quest for the top. Working as an assistant to a film production designer, she tries to steal her boy friend who is a music producer by offering sexual favors. The producer meanwhile is trying to orchestrate a comeback for a former glam band comprised of Michael Des Barres, John Taylor and Martin Kemp. Rosanna Arquette plays the former movie star wife of the lead singer, who is fretting because she has just been offered the role as the mother of one of the new ingenious. Beverly D'Angelo also shows up as a millionairess who agrees to bankroll the group, but only if she gets a roll in the hay with the lead singer. All of the career problems, including drug proclivity, are represented in this film.",
      "tmdbMovieId": 142132,
      "avgRating": 2.98675,
      "releaseYear": "1999",
      "numRatings": 151,
      "posterPath": "/eKUemqyt6OSyZENeHgTZUwIGN8r.jpg"
   }
}