{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "parent child relationship",
            "id": 970
         },
         {
            "name": "virgin",
            "id": 2389
         },
         {
            "name": "vampire",
            "id": 3133
         },
         {
            "name": "transformation",
            "id": 4375
         },
         {
            "name": "supernatural powers",
            "id": 4769
         },
         {
            "name": "undead",
            "id": 10327
         },
         {
            "name": "night club",
            "id": 10712
         },
         {
            "name": "lifting person in air",
            "id": 11441
         },
         {
            "name": "werewolf",
            "id": 12564
         }
      ],
      "imdb_id": "tt0089175",
      "video": false,
      "title": "Fright Night",
      "recommendations": [
         18086,
         11415,
         1694,
         10925,
         1547,
         11298,
         15762,
         16288,
         9529,
         16281,
         19185,
         8408,
         9638,
         11133,
         8913,
         24929,
         11879,
         14029,
         9003,
         26515
      ],
      "backdrop_path": "/v4wzMG8phQyPVlKTMUNt1i33GM5.jpg",
      "revenue": 24922237,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jerry Dandrige",
               "gender": 2,
               "credit_id": "52fe44879251416c75037fb9",
               "name": "Chris Sarandon",
               "profile_path": "/1Wf3WoXEdPqGyO6onKfFkseDFef.jpg",
               "id": 14541,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Charley Brewster",
               "gender": 2,
               "credit_id": "52fe44879251416c75037fbd",
               "name": "William Ragsdale",
               "profile_path": "/njtQMv0vm9uNzSdVTqjYTu1TzNd.jpg",
               "id": 31467,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Amy Peterson",
               "gender": 0,
               "credit_id": "52fe44879251416c75037fc1",
               "name": "Amanda Bearse",
               "profile_path": "/i91qgAMfLAhzVB3uMLFzJrwxrgn.jpg",
               "id": 18981,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Peter Vincent",
               "gender": 2,
               "credit_id": "52fe44879251416c75037fc5",
               "name": "Roddy McDowall",
               "profile_path": "/2vwhHtQoICsqrKB5YVzFPiPKtdA.jpg",
               "id": 7505,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "'Evil' Ed Thompson",
               "gender": 2,
               "credit_id": "52fe44879251416c75037fed",
               "name": "Stephen Geoffreys",
               "profile_path": "/fsC0ksIFEjfnPl7OuYEJY5VjemZ.jpg",
               "id": 75020,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Billy Cole",
               "gender": 2,
               "credit_id": "52fe44879251416c75037ff1",
               "name": "Jonathan Stark",
               "profile_path": "/Alykv40kPzEeJAiDdKmv4TzX4B3.jpg",
               "id": 119941,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Bouncer",
               "gender": 0,
               "credit_id": "52fe44879251416c75037ff5",
               "name": "Nick Savage",
               "profile_path": null,
               "id": 995980,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Detective Lennox",
               "gender": 2,
               "credit_id": "54d46deec3a36871c100a4b8",
               "name": "Art Evans",
               "profile_path": "/oFxv6KQdXU30MY00ASwoMqbKVAg.jpg",
               "id": 56183,
               "order": 7
            },
            {
               "cast_id": 15,
               "character": "Jonathan",
               "gender": 2,
               "credit_id": "5935d173c3a3685bf900376f",
               "name": "Bob Corff",
               "profile_path": "/rRvuvjrRl3ZeWvGqSI4hrqfvGVT.jpg",
               "id": 1210734,
               "order": 8
            },
            {
               "cast_id": 16,
               "character": "Judy Brewster",
               "gender": 1,
               "credit_id": "59c079039251417dd4008629",
               "name": "Dorothy Fielding",
               "profile_path": null,
               "id": 51550,
               "order": 9
            },
            {
               "cast_id": 17,
               "character": "Hooker",
               "gender": 1,
               "credit_id": "59c079109251417db000842b",
               "name": "Heidi Sorenson",
               "profile_path": "/4Kn5kwUgRe3YC24qaTg0VTfJIC.jpg",
               "id": 1213767,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44879251416c75037fcb",
               "name": "Tom Holland",
               "profile_path": "/yYNJTyRwKoUT27Dp9fIO9rWwO3s.jpg",
               "id": 64796,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c75037fd1",
               "name": "Tom Holland",
               "profile_path": "/yYNJTyRwKoUT27Dp9fIO9rWwO3s.jpg",
               "id": 64796,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c75037fd7",
               "name": "Herb Jaffe",
               "profile_path": null,
               "id": 27240,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c75037fdd",
               "name": "Brad Fiedel",
               "profile_path": null,
               "id": 2722,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c75037fe3",
               "name": "Jan Kiesser",
               "profile_path": null,
               "id": 43529,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44879251416c75037fe9",
               "name": "Kent Beyda",
               "profile_path": null,
               "id": 13584,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [{
         "name": "Horror",
         "id": 27
      }],
      "popularity": 8.581278,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11797,
      "vote_count": 352,
      "budget": 9000000,
      "overview": "Nobody believes teenager Charley Brewster (William Ragsdale) when he discovers that his suave new neighbor, Jerry Dandrige (Chris Sarandon), is a vampire. So when the bloodsucker starts stalking Charley, he turns to has-been actor Peter Vincent (Roddy McDowall), famed for portraying a ghoul hunter. Unfortunately for the would-be vampire slayers, Dandrige has set his sights on Charley's girlfriend (Amanda Bearse) in this clever spoof of the horror genre.",
      "similar": [
         7131,
         10012,
         49017,
         29095,
         138,
         277,
         24021,
         2907,
         36647,
         6114,
         1547,
         52520,
         628,
         346672,
         52587,
         7091,
         18239,
         9738,
         8698,
         834
      ],
      "original_title": "Fright Night",
      "runtime": 106,
      "poster_path": "/jE0YbuFlmaZUWeVTyYNpzYXjIbn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
            "name": "Columbia Pictures",
            "id": 5,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Delphi IV Productions",
            "id": 7401,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vistar Films",
            "id": 7402,
            "origin_country": ""
         }
      ],
      "release_date": "1985-08-02",
      "vote_average": 6.9,
      "belongs_to_collection": {
         "backdrop_path": "/qFkOju5f8h7SayY33Zm8A1dl943.jpg",
         "name": "Fright Night Collection",
         "id": 98168,
         "poster_path": "/4u9zOuYFwfks3ZO2FvgduYnjUi2.jpg"
      },
      "tagline": "There are some very good reasons to be afraid of the dark.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Tom Holland"],
      "runtime": 106,
      "synopsis": "Charley Brewster, is a normal, average teenager living with his divorced mother in a unnamed suburban township. One evening, Charley looks out his window and sees his new neighbors moving in the next door and appear to be carrying what looks like a coffin. Intreged with his new neighbors, Charley begins to spy on them. One day, a young woman (obivously a call girl) shows up at Charley's house by accident looking for another address and Charley directs her to the house next door. The next morning at school, Charley sees a news broadcast about the police finding \"another murder victim\" from an unknown serial killer who decapitates female victims and drains the bodies of blood. Another evening later, Charley, suspecting something sinister about his new neighbors, spies on the house next door and sees Jerry Dandridge bitting the neck of a young teenage girl. He tells his mother what he saw, but she passes it off as Charley's imagination. Charley tries to tell his friend \"Evil Ed\", and girlfriend Amy Peterson, but neither of them believe him, and begin to worry about Charley's mental well being. Another day later, Charley calls the police with information about one of the murder victims and a detective accompanies him to the house where they meet Billy Cole, Jerry Dandridge's \"roommate\" who lets them in and shows them around the house. Finding nothing, the detective decides to leave, but Charley tells him to check the basement, which Billy seem adament about letting them go down there. The detective forces Charley to leave with him and tells him not to ever call on him again, thinking that Charley has an overactive imagination. Suspecting that Jerry Dandridge is a vampire, he seeks advice from Evil Ed about how to fight vampires. Evil Ed tells him, from watching movies and documentaries about suspected vampires, that vampires are super strong, have no heartbeat or pulse, have vulnerabilites to holy water and crosses. They also cast no reflection in a mirror and they and can only be killed by fire, decapitation, sunlight, or a wooden stake through the heart. Ed also tells Charley that a vampire cannot enter a person's home without an invitation. Charley goes home, but finds Jerry Dandridge in his living room waiting for him... having been invited in by Charley's mother. Dandridge is seemingly friendly and tells Mrs. Brewster about Charley showing up at his house today, and she reprimands Charley not to do it again. That evening, Charley begins to fortify the house, knowing that Dandridge can enter whenever he feels like it. However, Dandridge enters the house from a second floor window and hides in a closet in Charley's bedroom. When Charley gets ready for bed, Dandridge suprises him and threatens to kill him for snooping around and nearly revealing his secret that he indeed is a vampire. When Dandridge tries to choke Charley to death, he stabs the vampire in his right hand with a pensil. Wounded and angry, Jerry Dandridge terrorizes Charley by revealing his true vampire demonic image, complete with red eyes, fangs, claws, and a roaring with a wolf-like rage, but waking up Charley's mother. Dandridge flees and threatens to kill Charley tomorrow night. The next morning, Charley then seeks out help of favorite vampire killer, Peter Vincent, a former actor who hosts TV segments of horror movies that Charley watches and who claims to be a real vampire hunter. Charley confronts Vincent at the studio where he works and tells him that his neighbor is a vampire and is going to kill him. Vincent, like everyone else, brushes off Charley's claims as an overeager teen with an overactive imagination. Charley does not go to school that day (because he finds his car totaled after Dandridge apparently trashed it the other night after their confrontation). Evil Ed and Amy visit Charley at his house and finds him secluded in his bedroom with crosses hanging everywhere. Hearing him talk about Peter Vincent, Evil Ed and Amy visit him at his apartment where they tell him about their friend and persuade him to prove to him that vampires don't exist. Vincent calls Dandridge at his house and offers to come over the next night with Charley to debunk Charley's theory that he is a vampire. The following evening, Vincent, Charley, Ed, and Amy pay a visit to Dandridge's house where Billy lets them in and introduces them to Jerry Dandridge. Vincent tries to show Charley that Danridge is not vampire by having him drink a vital of holy water, as well as him holding a cross. Charley is still not convinced and says that crosses only work on vampires if a person has faith to use it, and the holy water that Dandridge just drank isn't real holy water. However, after Vincent sees Jerry casts no reflection in his small compact mirror he gets scared, and gathers up Amy, Charley, and Ed, and they all leave. Mr. Vincent hurries to his car, and then he drives away fast. Dandridge finds the mirror dropped by Vincent on his way out and leaves as well. As Charley, Amy and Ed walk away, Evil Ed decides to leave Charley and Amy by walking in a dark alley. He runs down an alley, and it gets darker. All the sudden Jerry Dandridge appears, who wants Ed to become a vampire. At Peter Vincent's apartment, he huddles scared and tries to shake it off, from feeling scared. Just then Evil Ed knocks on Peter Vincent's door. Vincent opens it, and begins conversing to Evil Ed casually, as he knows nothing of the hideous, undead Evil Ed is now. Suddenly Evil Ed attacks Mr. Vincent, who places a cross upon Evil Ed's forehead, which burns. A scalded Evil Ed slinks away, threatening Mr. Vincent by telling his \"Master\". Charley and Amy find Dandridge following them and he chases them to a local nightclub where Dandridge sees that Amy resembles his lost love. He uses his vampire charm to hypnotize her and dance with him. When Charley intervenes, Dandridge restrains him and two bouncers appear, in which Danridge morphs into his fanged, red-eyed vampire self and kills both bounders with his superhuman strenght. Dandridge escapes from the nightclub in the confusion and chaos with Amy, and he and tells Charley to meet him later at his house or he will kill her. Charley runs back to Mr. Vincent, who makes him grab a cross before he enters his apartment. Charley persuades Peter Vincent that they must confront Dandridge and kill him before the night is over. The duo get ready, and go to Jerry's house. By then, he has already turned Amy into a half-vampire. As Charley and Vincent enter the house, Dandridge appears on the top of the stairs and says: \"welcome to\"Fright Night\"... for real. Vincent hesitates for a moment, and his faith Is too weak to keep Dandridge at bay with his cross. However Charley has faith and the vampire covers in fear from his crucifix. But Billy Cole comes to his master's aid and knocks Charley off the staircase, rendering him unconscious. Vincent panics and runs to Charley's house. Charley wakes up to find himself locked in a room with Amy (who is now a half-vampire). Dandridge leaves a stake for Charley, giving him a choice:to kill Amy or not and risk getting killed by her when she fully turns in the morning. Vincent flees to Charley's house to hide out, only to be confronted by Evil Ed, who transforms himself into a wolf and attacks Vincent again. Vincent defends himself by breaking a wooden table leg and kills Evil Ed by stabbing him through the heart, who then morphs back into his human form as he dies. Vincent then returns to the Dandridge house where he frees Charley and they confront Billy again. Vincent shoots him several times with a gun, but Billy (a sort of zombie-like slave/familiar) keeps advancing towards them, and Charley finally kills him with Vincent's wooden stake by stabbing him through the heart in which Billy melts into a gooey mess of blood and green slime. Charley and Vincent have another confrontation with Dandridge, who is kept at bay with their crucifix's, and they see that dawn is approaching. Dandridge transforms himself into a bat and flies away. Charley and Vincent venture down to the basement to find Dandridge's coffin to kill him while he sleeps. Just when they find the coffin, Amy, now a fully turned vampire, enters and attacks them. While Charley tries to keep her away, Vincent manages to open Jerry Dandridge's coffin and tries to drive his wooden stake through his heart, but Dandridge wakes up and Vincent stabs him, but misses his heard. The vampire rises from his coffin, pulls out the wooden stake and breaks in two. But when he attacks Vincent, Charley begins smashing in all the basement windows, allowing the sunlight to hit Dandridge. Using a mirror, they reflect the sunlight and finally manage to kill Dandridge by blasting him with the rays and he bursts into flames and within seconds his body is redused to dust and bones. With Jerry Dandridge's death, the still-alive Amy is apparently released from his curse and becomes human once again. In the final scene, the movie ends just where it began with Charley and Amy back in his room watching a horror movie hosted by Peter Vincent on the TV, who announces his dedicating the movie to his friend Charley for making him belive that vampires are real. The movie is left open ended, when Charley looks out at the Dandridge house next door, now dark and vacant, he briefly sees a pair of red eyes staring at him from the darkness. But instead of telling Amy, he decides to let it go and goes back to her for another make-out session on his bed. The voice of Evil Ed is heard saying \"oh you're so cool Brewster!\"",
      "writers": ["Tom Holland"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0089175/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxNzA2NjUyOF5BMl5BanBnXkFtZTgwMzQzNTcxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Chris Sarandon, William Ragsdale, Amanda Bearse | See full cast and crew »"],
      "reviews": [
         "I would consider myself a film fan with somewhat intellectual preferences and I have a passion for European art house pretentious stuff, so when Fright Night was recommended to me I dismissed it in a snobby \"80s special effects vampire horror movie? A title that rhymes? No, thank you!\" kind of way. HOWEVER, I have a feeling it may be the single best film I have ever seen, of any genre or time period. It has a witty script, fabulous special effects and some of the best acting I have seen, particularly Evil Ed later on in the film. There are moments of suspense, hilarity, tenderness (for example with Peter Vincent and the dying wolf) and believable every day life. This film didn't actually scare me but it did make me laugh very very hard. A special mention must be made of Chris Sarandon as I think his performance really stood out. Evil is not as easy to portray in stories as people think, but Sarandon does the most believable evilness I think I have ever seen, coupled irresistibly with the sexiest seduction scene ever (is it wrong that I wanted him to win in the end because he was so gorgeous?). If vampires really did exist, I think they would be exactly like Jerry Dandridge, except maybe without the same scary 80s vampire mask and claws. My advice is SEE THIS FILM, and don't have any preconceptions about it.",
         "Is it the 80's cheesiness (fashion, clichÃ©s, music)? It's impressive F/X? The story? Who knows. Time made justice to \"Fright Night\", one of the best vampire movies ever and probably the best of the 80's. When it came out in 1985 the Slasher genre was on it's highest peak and as Peter Vincent said to Charlie, \"his generation prefers movies where a masked looney kills virgin innocents\" (or something like that). When nobody cared about Vampires \"Fright Night\" came out with a tremendous potential on it's story, actors, and make up; the basic elements that a Slasher movie needs. The result is an entertaining, chilling, and very well done horror movie better than expected. *SPOILERS* Charlie Brewster an average boy finds out that his neighbor is a vampire. He has doubts until Jerry Dandridge his vampire neighbor appears on his bedroom and threatens him to death. Nobody believes Charlie and after a series of events not only his life is in danger but also his girlfriend's. Charlie finds in Peter Vincent, t.v.'s popular \"Vampire Killer\" character his only hope to save his girlfriend. In order to accomplish what he wants, Charlie and Peter Vincent will face the deadly Jerry Dandridge, his guardian Billy Cole, and their attacks. ACTING. You can't go wrong when a great actor like Mr. Chris Sarandon carries the entire movie on his back with his performance. His character, Jerry Dandridge completely steals the show. Sarandon made the character. Roddy McDowall as Peter Vincent is a pleasure to watch. His character has an admirable quick evolution in the movie. First he's the vampire killer t.v. character that after meeting a REAL vampire knows what fear is like. Then after dealing with fear, he recovers faith and that makes him stronger in every aspect. William Ragsdale is good as Charlie Brewster, the teen main character in the movie. The boy that discovers that his neighbor is a real vampire but nobody believes him. Good character. Special mention to Stephen Geoffreys as Evil Ed for being one of the weirdest but likable characters ever to appear in a horror movie. His performance is truly evil and humorist. A nice touch. Amanda Bearse (from Married with Children fame) is also a good addition to the cast, she delivers an o.k. performance. Jonathan Stark as Billie Cole, Jerry's guardian, delivers a solid performance. This is one of the best casts that you can get from an 80's horror movie. DIRECTION. The 80's craziness was never this creepy. Tom Holland makes a terrific job this time. This man is behind key horror movies from the 80's like \"Child's Play\" and the surprisingly good \"Psycho II\" among others. His camera work in \"Fright Night\" is great. He knew how to combine perfectly the 80's feeling (something that nobody has ever described for it's madness) with the Vampire movies basic rules. The idea of watching a Vampire movie from the 80's could make you think the worst but luckily it's a great idea. Excellent job Mr. Holland. F/X/SCORE/CINEMATOGRAPHY. The f/x and make-up are very ahead of it's time. You can't get better gore effects! The scene of Evil Ed's death (when he's a werewolf) is amazing. On it's time I'm sure that it shocked more than once. Also, Billy Cole's death and the ending are great scenes that will please the horror audience's eyes. Great use of gore and f/x. Enough said. The score is great. The 80's pop metal and club music fits perfect with the feeling of the movie. The club scene is something you haven't seen. In the tense and thrilling scenes the music works perfect. The cinematography is pretty good. The use of lightning on dark settings is very good. Watch the DVD version for a different experience. I love the lines from the movie. I can assure that \"Fright Night\" is something you haven't seen. Don't get fooled by the 80's big hair, laughable fashion, and clichÃ©s. The movie stands alone. Be prepared for a real FRIGHT NIGHT!",
         "I will start off by saying that I am a gigantic fan of Fright Night. It all started when the film made its premiere on HBO. The one part that stuck in my head (besides Sarandon's looks) was \"Evil Ed's\" transformation from wolf to human. Scared the crap out of me. Well, a couple years later, hitting sixth grade, I found the video at a video store and fell in love with it all over again. A friend and I began huge fans, buying Fangoria magazines and collecting the comic series. I remembering making my parents rent the movie for me so I could watch from evening till seven in the morning! Phew! Now, some girls would have crushes on things like, New Kids On the Block. Not me! I was infatuated with Chris Sarandon's seductive performance as Jerry Dandridge. Hey, any woman would be nuts not to find this man hot. Definition of tall, dark, and handsome. He could of bit me in a neck and I would of never cared. As I am at the age of 27, I still have my first and only copy of the film that was boughten for me on my 12th birthday, a tad worn but still plays. I have more of a appreciation for the movie. For all the actors and actresses. I have the movie memorized, word for ward, even if I go like a year without watching it again. But recently I began to realize that the 20th anniversary for this great horror classic is coming around the bend. I had started a script myself, which I know will fail to be noticed, for such a special occasion. Bringing back all the characters from part one and two, except Peter Vicent since no one but Roddy MacDowall could do the part. I just want everyone to know that Fright Night is the definition of the perfect eighties Horror film. It is original with it's characters, setting, and the all around story itself. But it also shows the hard work that had gone into it to create those undoubtedly, scarier then crap Dandridge, Evil, Amy, and Billy Coal transformations. Chris Sarandon himself stated it was hell to do the make up for the movie but his character was worth it. I would rather see a film with special make up effects then with the modern computer animation special effects. More work and artistic, hands on talent went into movies like Fright Night. That's why Fright Night stands out as a eighties classic vampire flick. I personally would like to thank all the actors for the gift of entertainment when making the film. Also the brilliant minds and talented men and women who worked on the film. Fright Night is a movie that has fond memories for me in my child hood. Chris Sarandon will always be my first movie star crush. Dang, he is still hot today! I can't help but still imagine Jerry Dandridge as my perfect, eye candy neighbor. I would recommend anyone to view this movie. Appreciate it as a art form of entertainment with the taste of horror mixed in there. Enjoy it and love it! One final statement..... LONG LIVE FRIGHT NIGHT!!!!!!!!!",
         "Before I first watched Fright Night, I admit I was unsure about what to think about it. All I knew about it was from what I had been told from my Dad (though his likes/dislikes are generally on par with mine, they sometimes border on plain stupid). But when I saw it to the end, I was almost totally converted. Although the beginning is a bit cheesy and reminiscent of stereotypical horror B-movies, it soon becomes clear that this is part of what makes Fright Night so original. All the typical horror film genres are there: horror, romance, comedy (well maybe comedy isn't a typical horror element); but what makes this horror flick stand out a mile-and-a-half from the rest is that it's a very offbeat tale. It's creepily cheesy but gets away with it because it's atmosphere is so good. All this and I haven't mentioned the acting or special effects yet. Sarandon seems to give such an effortless performance as the vampire and as a result is almost perfect. I had thought of what a modern day vampire would be like before I saw Fright Night; but Jerry Dandridge just blew all these ideas away and has to be the coolest (and I don't often use that word) and sexiest vampire ever, and is one of my favourite movie villains. Roddy McDowall can't hold a candle to Sarandon but is still very good, and Stephen Geoffreys is one of the funniest and memorable movie characters ever to grace a film screen too. The special effects are good for 1985 and unlike where in modern films the SFX are the main point in the movie, here they add to the already present chilling atmosphere. And although on the one hand, Fright Night is quite dated, it also captures the atmosphere and the essence of the 80s. The soundtrack is excellent for the film, but paradoxically not very memorable (apart from one or two good songs). [I wish I'd been born before 1981 (maybe 1961) so that I could have lived in the late-70s and 80s, and would have memories of the best music from that time, and not the boybands/Beatles clones/dance ditties (not decent tunes mind) we have now.] All in all an (almost) perfect film: watch it and you'll (most likely) enjoy it and watch it again and again.",
         "While with his girlfriend Amy Peterson (Amanda Bearse) in his bedroom, the teenager Charley Brewster (William Ragsdale) sees a coffin being transported to the house on the next door. A couple of days later, he concludes that his neighbor Jerry Dandrige (Chris Sarandon) is a vampire, who is committing some recent unsolved murders. Charley decides to look for help first his friend Evil Ed Thompson (Stephen Geoffreys), since the policemen do not believe on his accusation. Jerry is upset and promises to kill Charley. Later, he meets Peter Vincent (Roddy McDowall), a middle aged man, who is a vampire killer in a television show but does not believe on vampires in the real life. Amy and Ed seek out Peter Vincent, and the group tries to prove to Charley that Jerry is not a vampire. 'Fright Night' is one of my favorite vampire movies, indeed a cult-movie in Brazil. I do not know how many times I have seen this film in my life, but yesterday I saw it on DVD for the first time and I was not disappointed, since the Brazilian DVD offers two choices (widescreen and fullscreen). There is just a trailer in the extras, but it suffices. Chris Sarandon is incredibly funny and sexy in this role; the movie has a perfect combination and timing of the genres of horror and comedy; the 'Van Helsing' of the story, Peter Vincent, is a fantastic joke with the names of the great Peter Cushing and Vincent Price; the special effects were state of art in 1985. My vote is nine. Title ('Brazil'): ' A Hora do Espanto' ('The Fright Hour') Note: on 14 January 2012, I saw this wonderful film again.",
         "Why is Fright Night my all time favorite horror movie within the vampire content? Well, simply because of the films actors and the story line itself. In the past month or so I have had the chance to reminisce on the fact that I had always adored this movie. Sitting down and taking the time to watch it through again as I had once done years ago when Fright Night was my inspiration to dive into the horror writing area with great vampire characters with memorable appearance and expression. From the villainous immortal to the pathetic immortal. Remembering my youth, not that long about, about close to twenty years ago I was introduced to Fright Night on a cable movie channel. The part I remembered the most was Evil Ed's transformation from wolf to man. Why that stuck out, probably played on my fear of werewolves (funny I know). As I got older I found that I was madly in love with the character Jerry Dandridge, just by the fact of Chris Sarandon's wonderful portrayal of the creature of the night. Just is seduction and sexiness. But also the fact that he was pure evil with all the vampire cunningness. Having the movie given as a birthday present at the age of twelve made my life peachy. Watching as much as I can. Now as a adult I understand more about the movie. It's contents, the story line and the effort that was put into making it a graphic film with horror and terror. Fright Night is a perfect example of the greatest of special effects for the 80's. It was battling against movies like Nightmare On Elm Street and others that played on fears. This is a classical story because it creates a modernized vampire and also shows what happens when a young teen gets nosey. With that, you think of what you might do when if a vampire lived nextdoor to you! But with all the actors and actresses, only one stood out from the rest. Chris Sarandon is a talented actor who deserves praise for his performance, which many seem to appreciate. I think any person with a horror taste should take the time to watch this classic movie and see what is definitely the most original and breath taking movie of its time. I can go on and on about this movie, but I am limited. But the time is ended. Please, take the time and watch the movie if you haven't seen it or haven't seen it in a along time. Thanks",
         "After all this years (20) of vampire slaughtering, Blade's karate Vs vampire flicks, or even Carpenter's Rambo characters, Fright Night still offers the scent of a classic. Tom Holland's masterpiece holds by itself because of a great cast and a plot that gathers every single cliché of the genre and plays a bit with humor and a lot of effective spooks. Roddy Mc Dowall steals the movie with his over the hill terrified looser character. Even special effects are bizarre today as they're a craftsmanship result giving some scenes a bizarre concept that takes you directly into Roger Corman's \"B\" world. A true pleasure to watch from time to time. Happy 20 years",
         "'Fright Night' is a movie that has stuck with me for years. Recently I was able to get it on DVD and have been watching it and trying to convince my friends to watch it ever since. It has it's flaws but time has been kinder, I think, to 'Fright Night' than it has been to either 'Near Dark' or 'The Lost Boys.' Chris Sarandon is great and charismatic in his role as the new next-door neighbor. He gives a deep performance and it seems like he's having a lot of fun in every scene. William Ragsdale isn't bad either as he tries with greater desperation and anxiety to convince people that the vampire exists and win allies to help him destroy it. My favourite performance comes from Roddy McDowall. Like Donald Pleasance later in his career, Roddy McDowell could reasonably be accused of acting in anything if there was a paycheck involved; this has damaged his reputation somewhat. I think 'Fright Night' and his performance as Peter Vincent definitely falls in the plus category rather than negative. He is great at hiding behind masks and is constantly performing for the other characters. As an actor, the part required versatility, compassion and depth. Had they been able, Peter Cushing or Vincent Price would have also played the part splendidly -- McDowell's character is of course a tribute to both these actors and I think that he was simply fantastic. So many of the moments in 'Fright Night' compete to be my favourite but I think it comes in the final third of the film. Peter Vincent has run out of masks to hide behind and becomes a very tired, very frightened and very old man. Redemption isn't out of reach -- but he's going to have to work for it. I mentioned earlier that 'Fright Night' has aged fairly well. There is decent gore and make-up so anyone looking for that will likely be satisfied. Music can kill films and age them more quickly than anything else. It works here where it might fail in other films. The strength of 'Fright Night' though are it's performances and the sense of fun that it has. Definitive vampire film? No, but a lot better than many, many, many of the pretenders to that title. Rewarding, fun, and worth a look.",
         "I incorrectly assumed this might be some dumb teen vampire flick when it came out about 20 years ago, but that wasn't the case. It was simply a very entertaining horror flick with a good mixture of suspense, comedy and good special- effects. The kids - William Ragsdale, Amanda Bearse and Stephen Geoffreys - are all excellent but the two adults - Chris Sarandon and Roddy McDowell - steal the show. Sarandon is very cool as the vampire; cocky, arrogant and smooth. He is easily the best character in the movie. McDowell does a nice job as the reluctant vampire slayer. The special-effects are good and the film is played strictly for fun, even with the suspenseful scenes. In fact, it reminds me of the word \"camp\" because it's so hokey in spots. Yet the film definitely has its scary moments. Note: I watched this 3-4 times on the tape so I am familiar with most of the film and after seeing the DVD, I swear several short scenes are missing (such as Bearse's quick shower scene). I've never come across something like this before.",
         "For a time vampires were a big deal and were a big draw at the Box Office. Hammer Films made numerous films about the undead and the US made their share as well. But of course people's tastes change over time and by the early 1980s vampires weren't nearly as popular as they had once been. Then it was killers in masks and zombies devouring the living that dominated the big screen. However, the sub-genre would enjoy a resurgence the same way that films about werewolves did. Tom Holland, who would go on to direct the first in the 'Child's Play' series, wrote and directed a very hip and thrilling new take on the vampire film. Over 25 years later it's still one of the best the genre has to offer. Pros: Amazing performances all across the board. Brilliantly written and directed by Holland. Stunning cinematography. Memorable score and fun 80s soundtrack. Fast paced from start to finish. Made with an obvious affection for the genre. Often very funny, including some snappy dialogue. Great special and make-up effects that have aged well. Even though there is much humor here, there are still some chilling sequences and images throughout. Cons: Dated in some aspects. At times predictable. Final thoughts: What Tom Holland has made here is a film that pays homage to the great vampire films and mythology while also effectively bringing them up to date. This is without question one of the most thoroughly entertaining Comedy/Horror films not only of it's time, but ever. It's a case of all the right ingredients coming together at the right time. Even 'The Lost Boys,' which is great in it's own right, doesn't match it. My rating: 5/5"
      ],
      "genres": [
         "Comedy",
         "Horror"
      ],
      "productionCompanies": [
         "Columbia Pictures",
         "Vistar Films",
         "Columbia Pictures Industries"
      ],
      "summaries": [
         "For young Charley Brewster, nothing could be better than an old horror movie late at night. Two men move in next door, and for Charley with his horror movie experience, there can be no doubt that their strange behavior is explained by the fact that they are a vampire and his undead day guardian. The only one who can help him hunt them down is a washed-up actor, Peter Vincent, who hosts Charley's favorite TV show, Fright Night. Vincent doesn't really believe that vampires exist, but does it for the money...",
         "Charley Brewster (William Ragsdale) believes that his next door neighbor Jerry Dandridge (Chris Sarandon) is a vampire. His belief is strengthened when mysterious deaths of girls are reported. When Dandridge confronts Charley in his own bedroom one night and tries to kill him, Charley concludes that the monster must be destroyed. But since nobody believes his story, he enlists the help of Peter Vincent, the vampire killer from his favorite horror TV show, who is in fact skeptical about vampires existing for real.",
         "While with his girlfriend Amy Peterson in his bedroom, teenager Charley Brewster sees a coffin being transported to the house next door. A couple of days later, he concludes that his neighbor Jerry Dandrige is a vampire, who has committed some recent unsolved murders. Charley decides to look for help first from his friend Evil Ed Thompson, since the policemen do not believe his accusations. Jerry is upset and promises to kill Charley. Later, he meets Peter Vincent, a middle aged man, who is a vampire killer in a television show but does not believe in vampires in real life. Amy and Ed seek out Peter Vincent, and the group tries to prove to Charley that Jerry is not a vampire.",
         "When a teenager learns that his next door neighbour is a vampire, no one will believe him."
      ],
      "budget": 9000000
   },
   "movielensId": 2867,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1985-08-02",
      "dvdReleaseDate": "1999-09-07",
      "directors": ["Tom Holland"],
      "runtime": 106,
      "movieId": 2867,
      "title": "Fright Night",
      "mpaa": "R",
      "actors": [
         "Chris Sarandon",
         "William Ragsdale",
         "Amanda Bearse",
         "Roddy McDowall",
         "Stephen Geoffreys",
         "Jonathan Stark",
         "Nick Savage",
         "Art Evans",
         "Bob Corff",
         "Dorothy Fielding",
         "Heidi Sorenson"
      ],
      "imdbMovieId": "0089175",
      "originalTitle": "Fright Night",
      "genres": ["Horror"],
      "youtubeTrailerIds": [
         "yfuIcuezkUw",
         "a_rgrxuv460"
      ],
      "plotSummary": "Nobody believes teenager Charley Brewster (William Ragsdale) when he discovers that his suave new neighbor, Jerry Dandrige (Chris Sarandon), is a vampire. So when the bloodsucker starts stalking Charley, he turns to has-been actor Peter Vincent (Roddy McDowall), famed for portraying a ghoul hunter. Unfortunately for the would-be vampire slayers, Dandrige has set his sights on Charley's girlfriend (Amanda Bearse) in this clever spoof of the horror genre.",
      "tmdbMovieId": 11797,
      "avgRating": 3.34716,
      "releaseYear": "1985",
      "numRatings": 2398,
      "posterPath": "/jE0YbuFlmaZUWeVTyYNpzYXjIbn.jpg"
   }
}