{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0111342",
      "video": false,
      "title": "La séparation",
      "recommendations": [
         22161,
         42150
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Anne",
               "gender": 1,
               "credit_id": "52fe4aadc3a368484e16117f",
               "name": "Isabelle Huppert",
               "profile_path": "/wGG9v1Uci3sfrbjt0bRXkLrTqjY.jpg",
               "id": 17882,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe4aadc3a368484e161183",
               "name": "Daniel Auteuil",
               "profile_path": "/lWXsmJwL4H2RyJpC8p7hLFl27pZ.jpg",
               "id": 6012,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Claire",
               "gender": 1,
               "credit_id": "52fe4aadc3a368484e161187",
               "name": "Karin Viard",
               "profile_path": "/o12F6rIgJNPAyJa1aUsFSntRmf.jpg",
               "id": 13688,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Vincent",
               "gender": 0,
               "credit_id": "530ddee9c3a3685c0c00282e",
               "name": "Jérôme Deschamps",
               "profile_path": null,
               "id": 93592,
               "order": 3
            }
         ],
         "crew": [{
            "gender": 2,
            "credit_id": "52fe4aadc3a368484e16117b",
            "name": "Christian Vincent",
            "profile_path": null,
            "id": 72005,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.768734,
      "production_countries": [],
      "id": 124475,
      "vote_count": 7,
      "budget": 0,
      "overview": "In Paris, Pierre and Anne have been living together for a couple of years and they have the eighteen months son Loulou, who stays with the nanny Laurence during the day while they work. Their best friends are the couple Victor and Claire, who also is not married but live together. Out of the blue, Pierre feels Anne estranged with him and sooner she discloses that she is in love with another man. Pierre seems to accept her affair but their relationship rapidly deteriorates, and Pierre becomes violent with her.",
      "similar": [],
      "original_title": "La séparation",
      "runtime": 88,
      "poster_path": "/zJn2kuYfk5aXBfpJuCNhsWRzOzH.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1994-11-09",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Christian Vincent"],
      "runtime": 88,
      "synopsis": null,
      "writers": [
         "Dan Franck",
         "Dan Franck"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0111342/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTgyOTg5MzEyOF5BMl5BanBnXkFtZTcwMDk2NDU4MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Isabelle Huppert, Daniel Auteuil, Jérôme Deschamps | See full cast and crew »"],
      "reviews": [
         "When we first meet Anne and Pierre, they seem to be a normal couple. They are dining out with their friends Victor and Claire. The first thing that raises our guard is when we see Pierre caressing Anne's hand at the cinema where they are watching a film. Anne, seems unduly irritated, for a woman that is happily married, when she takes her hand away. Later on, when Pierre meets Anne for lunch, her face reveals she is not physically in the restaurant with her husband; her mind is someplace else. This tightly knitted film, directed by Christopher Vincent, who collaborated on the screen play with novelist Dan Franck, is a visual feast for lovers of the French cinema, as two of the best actors are paired to get inside the couple at the center of the story. It doesn't feel strange that Anne confesses to Pierre that she has fallen in love with someone else. Anne is a woman that seems distant, even with her young son, Loulou, an eighteen months toddler, who must have arrived late in her life. At the same time, she gives the impression that she doesn't hate Pierre. In fact, after confessing to having another love interest, she cuddles in bed with Pierre. Pierre, on the other hand, can't believe Anne could have betrayed him. He is a devoted husband and a loving father to his young son, who is the center of his life. Pierre realizes he will lose custody of Loulou because the French laws favor the mother as the natural custodian. The real surprise comes toward the end, when everything seems lost for Pierre. Anne confesses she has ended the liaison with this mystery man for good. That confession makes us wonder if there was ever such a person. Was Anne testing Pierre's love, or was she suffering boredom from a too normal life and wanted to add a spark to it? We never get to the answer, which will be different for many viewers. The best achievement of this film is the superb acting Mr. Vincent got from his two stars. Isabelle Huppert is an enigmatic Anne. We never know where she is at any given time. In contrast, Daniel Auteuil's Pierre makes us feel the pain that has been inflicted in his heart by Anne's admission of another man in her life. Both actors give wonderful performances, guided by the director. This film is painful to watch because of the raw intensity of what we see on the screen.",
         "An astonishingly accomplished film - Auteuil and Huppert have done nothing better. Auteuil's performance as Pierre is a measured descent into madness. As an ageing soixante-huitard with a love-rival, he tries to hold onto the idealism of his relationship with Huppert's Anne, succeeding only in compounding the confusion and hurt inevitable through his own unchartered humanism. Huppert is the perfect foil for this, a discreetly neurotic idealist herself, trying to conquer her own confusion beneath the surface and simply increasing Pierre's frustration. An acting masterclass. Vincent provides unblinking coverage of the story as it, literally, unravels. His contributions are subtle: Vertigoesque colour symbolism that informs the psychology of the story (he uses blue, grey and dowdy colours for the men and brighter colours, predominantly red for the women) and sparing music, only topping and tailing the piece with the theme of a suite of variations - a quiet but entirely apposite gesture. Its realism, violence, vitality and unselfconscious intelligence are supremely marshaled in what must be the finest French film I've seen. 9/10",
         "La Separation makes you realize the value of true acting ability. Danilel Auteuil & Isabelle Huppert give a masterclass. I never thought that I'd be glad Juliette Binoche didn't turn up for work. The story has all the makings of a soap opera, but the thing that lifts this film is the simply marvelous acting. In other hands I think this movie would slip quietly onto the French equivalent of the Lifetime channel. There are no silences. In this movie one look speaks a thousand words. I struggle to think of any other movie where I have been so entranced by the pure acting of the male and female leads. More emotionally draining than Casablanca. This is a real weepy. Why? Because the acting makes you live the pain.",
         "In Paris, Pierre (Daniel Auteuil) and Anne (Isabelle Huppert) have been living together for a couple of years and they have the eighteen months son Loulou (Louis Vincent), who stays with the nanny Laurence (Laurence Lerel) during the day while they work. Their best friends are the couple Victor (Jérôme Deschamps) and Claire (Karin Viard), who also is not married but live together. Out of the blue, Pierre feels Anne estranged with him and sooner she discloses that she is in love with another man. Pierre seems to accept her affair but their relationship rapidly deteriorates, and Pierre becomes violent with her. \"La Séparation\" is the most realistic film that I have ever seen about the end of a relationship, with the sequential phases of the separation process of a couple. I do not have self-experience but I have witnessed this type of process with friends of mine. Daniel Auteuil is perfect in the role of Pierre and the bitch Anne is tailored for the magnificent actress Isabelle Huppert. The conclusion is unexpected, but sometimes it may happen when the couple has just divorced. I do not know what Anne could expect from Pierre after her betrayal and bad treatment, but if Pierre accepts to return to her, it will probably not last for a long period. In their first fight, they will split again and will not be friends anymore. I had seen this film for the first time on 23 April 2000 and today I have just watched it again on VHS, and it has not aged and is still a great film. My vote is eight. Title (Brazil): \"A Separação\" (\"The Separation\")",
         "Any person who has seen and loved Un coeur en hiver (The Heart in Winter) should see this film as well - it also stars the melancholic Daniel Auteuil. It's almost painful to see him laugh. A film that contrasts the bitterness of betrayal with the sweetness of intimacy, La Séparation delves into the anatomy of a break-up - the growing coolness, lack of concern, estrangement that can exist between two people who still are the primary characters in one another's stories. The couple is not married, but have a home, son, and life in common. Even as they discuss the thing that has come between them, the two cuddle; indeed, were the dialogue silenced for a moment or two, it would be easy to believe they were comforting each other. And indeed, they attempt to soothe each other even as they seem to rend their relationship beyond reconciliation. There is a great reluctance to separate, but is this because of love, comfort, or the fear of starting over? See this movie alone, and don't plan to go dancing afterwards. Buy a bottle of red wine on the way home from the theater (if you are fortunate enough to see it in one).",
         "I wouldn't be surprised if Huppert faked her affair with the mysterious \"lover\" just to solicit her husband's attention. At the end it seems as if she had \"forgiven\" him and tries to win him back to their home. Her interpretations often grab the audience by the throat, leaving spectators often in a state of mesmerizing suspense, and I am using the word \"mesmerizing\" because of her ability to seduce and own the viewers' eyes. She is a woman who has a way with men, she makes them believe what she wants, she makes them want her and agonize over her, over her insane requests and behavior throughout the movies she stars in. After seeing her in some of her movies, I feel comfortable saying that she could have been a good main character in Ozon's \"Sous le Sable\", where the role of the widow is played by a phenomenal Charlotte Rampling (remember when she runs on the beach at the end?).",
         "This was a pretty odd film in that there isn't a whole lot of context for what is occurring and there really isn't any resolution as well. Instead of the typical Hollywood-style film with a firm beginning, middle and end to wrap everything together, this movie is more like a slice taken out of a real couple's marriage--like the viewer is peering in through a keyhole just as a marriage is dissolving. You see the couple in crisis but why and how this all turns out isn't there. Now for some viewers, this will no doubt be maddening--they NEED this information to enjoy the film. However, if you suspend your need for this information and just watch, you'll see that the actors and writers really do a great job of exploring PEOPLE. This really doesn't look like actors acting, but looks like a reality show of sorts. Because of this, this is an exceptional movie technically and gives an unflinching view of heartbreak and loss.",
         "This is a carefully crafted study of the break-up of a marriage. The subtle and powerful performances of Daniel Auteuil and Isabelle Huppert as the couple in question, and Vincent's well-paced direction of a good quality script, deliver a film that does not fall into the usual cliches of this genre. Well worth seeing.",
         "Two of France's great actors give flawless performances as a couple whose marriage is sadly in need of repair. The problem started it seems when they allowed little irritations to accumulate instead of discussing them openly and finding immediate solutions. In a word, this film is about lack of communication between partners. It is so true to life that it's almost painful at times as the couple perpetually nit-pick and argue using hurtful suggestions and criticising every look and gesture. The dialogue is excellent - brief, terse, unforgiving with mounting impatience. As eavesdroppers on their marital problems we become emotionally involved and begin to wonder which of the partners will be the first to crack under the strain. Separation seems inevitable. Early resentments now become uncontrollable outbursts with physical violence. Which partner will leave first? Important to the story is the character of the 18 months old baby, intensely loved by both parents. The sweet innocence of the baby ( Nice little actor!)gives some relief to the bitterness of the sparring parents. Anne asks Pierre:\"What made me fall in love with you?\" She tells him. The answer will surprise you. The ending of the film may surprise you, too.",
         "This disturbing film directed by Christian Vincent has one of Daniel Auteuil's best and most versatile performances. His 'partner', played with icy intensity by Isabelle Huppert, not only has a sadistic streak, but is wholly self-absorbed. She eyes Auteuil as he suffers because of her callous infidelity with the detachment of an abortionist crushing the head of an infant who has dared to scream after supposedly being 'disposed of' from the womb. Auteuil is at his wits' end, raging, cursing, hugging her, crying, discussing it helplessly with his friends, and the eye at the centre of the storm is the imperturbable Huppert, whose glassy stare and frozen visage are as relentless as a harpy. One puzzle: why does Auteuil go around unshaven all the time looking like a vagabond? So does his best friend. Is this chic? Looks a mess to me! Maybe Huppert has given up on trying to persuade him to shave and hates having her face scratched? Although she is the kind of character who would have pulled the wings off flies as a child, Auteuil's charm does not wholly compensate for his defiantly scruffy appearance, and as a tidy gal, that must get up her nose. This gut-wrenching story of the destruction of a relationship is from a novel, and with a screenplay by the author Dan Franck, who wrote the brilliant 1998 book 'Bohemes' ('Bohemian Paris', Grove Press, New York, 2001), perhaps the best survey of the Montmartre and Montparnasse days ever written. Let's hope it is not autobiographical, as if so, he must still be suffering. However, the detail is so precise, I fear it might all be true. There is a fine performance also by Laurent Lerel, as an au pair girl who loves Autueil from afar, and wishes to comfort him in his distress, but he never notices her. What a sad, sad tale."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "CMV Produzione Cinematografica",
         "Canal+",
         "D.A. Films"
      ],
      "summaries": [
         "One night at the cinema, Pierre reaches for out to take Anne's hand. She is annoyed and rebuffs him. He feels rejected. This moment begins the story of the disintegration of a couple... Pierre and Anne live in Paris with their two-year-old child Louis. After the night in the cinema it is clear that Anne is distracted and the small gulf between them seems to widen as time goes on. Lunches, evenings out with friends, there's obvoiusly something wrong. One night after a party, Anne tells Pierre that she is in love with another man. Although her confession is not surprising, Pierre's reaction is. He seems to accept it as a fact of life and refrains from asking the most burning questions. However, as Anne continues to see the other man, Pierre's feelings become more violent and it begins to dawn on them that some thing intangible has happened that can't be put right.",
         "In Paris, Pierre and Anne have been living together for a couple of years and they have the eighteen months son Loulou, who stays with the nanny Laurence during the day while they work. Their best friends are the couple Victor and Claire, who also is not married but live together. Out of the blue, Pierre feels Anne estranged with him and sooner she discloses that she is in love with another man. Pierre seems to accept her affair but their relationship rapidly deteriorates, and Pierre becomes violent with her."
      ],
      "budget": 0
   },
   "movielensId": 2869,
   "movielens": {
      "languages": [""],
      "releaseDate": "1994-11-09",
      "dvdReleaseDate": "1999-08-17",
      "directors": ["Christian Vincent"],
      "runtime": 88,
      "movieId": 2869,
      "title": "La séparation",
      "mpaa": null,
      "actors": [
         "Isabelle Huppert",
         "Daniel Auteuil",
         "Karin Viard",
         "Jérôme Deschamps"
      ],
      "imdbMovieId": "0111342",
      "originalTitle": "La séparation",
      "genres": [
         "Drama",
         "Foreign"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In Paris, Pierre and Anne have been living together for a couple of years and they have the eighteen months son Loulou, who stays with the nanny Laurence during the day while they work. Their best friends are the couple Victor and Claire, who also is not married but live together. Out of the blue, Pierre feels Anne estranged with him and sooner she discloses that she is in love with another man. Pierre seems to accept her affair but their relationship rapidly deteriorates, and Pierre becomes violent with her.",
      "tmdbMovieId": 124475,
      "avgRating": 3.0614,
      "releaseYear": "1994",
      "numRatings": 57,
      "posterPath": "/zJn2kuYfk5aXBfpJuCNhsWRzOzH.jpg"
   }
}