{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0110671",
      "video": false,
      "title": "Nina Takes a Lover",
      "recommendations": [],
      "backdrop_path": "/yoOnBtgmdex4bO7lDQIrmEkL5cB.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nina",
               "gender": 1,
               "credit_id": "52fe4b83c3a368484e18c9f7",
               "name": "Laura San Giacomo",
               "profile_path": "/xOPY9e0HN6zYmI5HrmRSbwygEzy.jpg",
               "id": 1212,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Journalist",
               "gender": 2,
               "credit_id": "52fe4b83c3a368484e18ca13",
               "name": "Michael O'Keefe",
               "profile_path": "/w6ssYHZER9wrZ1fWen6iUEQWYan.jpg",
               "id": 38085,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Photographer",
               "gender": 2,
               "credit_id": "52fe4b83c3a368484e18c9fb",
               "name": "Paul Rhys",
               "profile_path": "/yDTa82q4hIL9bSlHZa15iafkuzE.jpg",
               "id": 80365,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Friend",
               "gender": 1,
               "credit_id": "52fe4b83c3a368484e18c9ff",
               "name": "Cristi Conaway",
               "profile_path": "/5bbfOgGXmNf2MHQn0f6q7aY12bx.jpg",
               "id": 5130,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Paulie",
               "gender": 2,
               "credit_id": "52fe4b83c3a368484e18ca03",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4b83c3a368484e18ca09",
               "name": "Alan Jacobs",
               "profile_path": null,
               "id": 131792,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4b83c3a368484e18ca0f",
               "name": "Alan Jacobs",
               "profile_path": null,
               "id": 131792,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 0.247507,
      "production_countries": [],
      "id": 131957,
      "vote_count": 4,
      "budget": 0,
      "overview": "Laura San Giacomo stars in this sexy comedy about adultery. When Nina's (San Giacomo) husband goes out of town for several weeks on a business trip, Nina hooks up with a photographer. Told from a reporter's point of view, his interviews with Nina and the photographer provide comic insights. Stars Laura San Giacomo, Paul Rhys, Michael O'Keefe, Fisher Stevens and more.",
      "similar": [],
      "original_title": "Nina Takes a Lover",
      "runtime": 100,
      "poster_path": "/24f1paDywuI9FVEmT313Ze8oVHX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Triumph Films",
         "id": 23098,
         "origin_country": ""
      }],
      "release_date": "1995-03-03",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "Sometimes you have to break your vow to keep your promise.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Alan Jacobs"],
      "runtime": 100,
      "synopsis": null,
      "writers": ["Alan Jacobs"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110671/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1MTU5Nzc3N15BMl5BanBnXkFtZTcwNzY4MTUyMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Laura San Giacomo, Paul Rhys, Michael O'Keefe | See full cast and crew »"],
      "reviews": [
         "A surprisingly well written and creative script, which was no simple plot: there are twists and turns, not by pushing or attention hogging actions \u0096 the film just flows from scene to scene, be it recounting or fantasizing or in the present. It's really a gem \u0096 well-cut and put together with facets reflecting, refracting and juxtaposed -- rich in story tone and colorful emotions (at times sensuous suggestions), and the happenings were all set in and around a leisurely paced San Francisco (in a cafe or a studio, for instance). How attractive and alluring is this picture? Writer-director Alan Jacobs made spending time in a shoe store most interesting to follow, especially we are with Laura San Giacomo. Her pairing with Paul Rhys from Britain was more than suitably matched. In the end, it's absolutely fulfilling: the romance between the two key characters is imaginative and real. This film affirms that love can be wondrous and mysteriously romantic at the same time \u0096 you and your partner can be whoever, whenever, whatever you want to make it to be. Love and receive love. Be. Laura San Giacomo was in Steven Soderbergh's 1989 `sex, lies and videotape' with James Spader, Andie MacDowell and Peter Gallagher, and in writer-director Simon Moore's 1992 `Under Suspicion' with Liam Neeson (a very good who dunnit with twists after twists and. . .more). Paul Rhys was in Robert Altman's 1990 \"Vincent and Theo\" with Tim Roth and Johanna Ter Steege (she was the disappearing wife in George Sluizer's 1988 Dutch film \"The Vanishing\".)",
         "The more I see of Laura San Giancomo, the more I like her. She was excellent in \"Pretty Woman\" and her presence was powerful. I'm sure her real personality comes through when she acts. All of the actors were excellent in this movie, and believable. Wouldn't married life be more fun if we could throw away the boring side, and create new characters every now and then? Instead of a husband going out to create a fantasy, it's all there under his own roof. Be who you want to be at any time, not just on Halloween :-) although it would probably be considered an abnormal state of affairs ... then again, from what we see today at the movies or on TV, maybe it would be accepted. For sure, watching this movie would make you want to try when you see the end results. I enjoyed every minute of it. The TV guide only had two and a half stars against it. I would have given it four!!!",
         "It is refreshing to see a movie about married life, that tells it like it is--this movie actually has a involving story! Furthermore, this movie is funny, interesting, well acted, and erotic. If you liked Laura in Quigley Down Under, and Pretty Woman, you'll love her here. Her sweet, vulnerable, yet strong and assertive personality shines as does her comedic ability. This is a terrific date movie--for married folks. Don't miss it.",
         "Though the movie was somewhat slow and Rhys never got a name- only the \"photographer\" this was a pleasant movie to watch on a weekend evening with a glass of sherry. San Giacomo is a very attractive woman and carried off the part nicely. Fisher Stevens added to the sleaze factor of it all. What I liked was the romance evolved and didn't go straight into sex scenes. A believable film about two people who are attracted to each other and because both spouses are gone- follow their hearts- though they are breaking vows.",
         "With all due respect to the other reviewers here, I feel compelled to disagree completely & whole heartedly on their view of this movie. I'd also love to have some of whatever they were smoking which made this movie so stellar for them. I would point out to those considering watching it that the average is 5.3 stars and in my opinion, that is generous. The script is slow, the dialogue juvenile & tacky and, while the actors do their best with it, the performances are most definitely lacking. If you want a \"realistic\" feeling movie about infidelity, try \"Unfaithful\" with Diane Lane and Olivier Martinez. Well written, spectacularly acted & far closer to real than \"Nina Takes a Lover.\""
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Alan Jacobs Productions",
         "Archer Entertainment Group",
         "Sharona Productions"
      ],
      "summaries": [
         "When Ninas husband goes off for a few weeks to work, she meets and starts seeing a photographer. This story is told as an interview by a journalist writing about adultery who is talking with both Nina and the photographer in separate interviews. Through him, we learn much about the couple and their attitudes on adultery.",
         "A reporter who writes a book about infidelity interviews various people about their personal experiences in this matter. One of them is Nina, a young ordinary girl who has a \"different story\" to tell. While her husband was away on a 3-week business trip, she met a man who soon became her lover. With him, she learned things about true love that she didn't even \"touch\" inside her marriage.",
         "A lonely young woman decides to kindle her passions in a fling with a married photographer after feeling challenged by her own best friend's affair."
      ],
      "budget": 0
   },
   "movielensId": 287,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-03-03",
      "dvdReleaseDate": "2004-02-17",
      "directors": ["Alan Jacobs"],
      "runtime": 100,
      "movieId": 287,
      "title": "Nina Takes a Lover",
      "mpaa": "",
      "actors": [
         "Laura San Giacomo",
         "Michael O'Keefe",
         "Paul Rhys",
         "Cristi Conaway",
         "Fisher Stevens"
      ],
      "imdbMovieId": "0110671",
      "originalTitle": "Nina Takes a Lover",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["2IfHLq0k6Q8"],
      "plotSummary": "Laura San Giacomo stars in this sexy comedy about adultery. When Nina's (San Giacomo) husband goes out of town for several weeks on a business trip, Nina hooks up with a photographer. Told from a reporter's point of view, his interviews with Nina and the photographer provide comic insights. Stars Laura San Giacomo, Paul Rhys, Michael O'Keefe, Fisher Stevens and more.",
      "tmdbMovieId": 131957,
      "avgRating": 3.24401,
      "releaseYear": "1995",
      "numRatings": 334,
      "posterPath": "/24f1paDywuI9FVEmT313Ze8oVHX.jpg"
   }
}