{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "lawyer",
            "id": 10909
         },
         {
            "name": "conservative",
            "id": 11937
         },
         {
            "name": "new york city",
            "id": 14512
         },
         {
            "name": "apartment",
            "id": 33632
         }
      ],
      "imdb_id": "tt0061385",
      "video": false,
      "title": "Barefoot in the Park",
      "recommendations": [
         10236,
         11816,
         25431,
         17889,
         1879,
         42597,
         163422,
         65006,
         41806,
         459065,
         226343,
         300488,
         184915,
         429866,
         118898,
         40044,
         77915,
         129014,
         3547,
         98997
      ],
      "backdrop_path": "/9U4dWru2ratYuAEiYbbQkRdyN5w.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Paul Bratter",
               "gender": 2,
               "credit_id": "52fe474f9251416c75094c47",
               "name": "Robert Redford",
               "profile_path": "/b4mJIBWvEyzB8yyZWbmvfzwrdtp.jpg",
               "id": 4135,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Corie Bratter",
               "gender": 1,
               "credit_id": "52fe474f9251416c75094c4b",
               "name": "Jane Fonda",
               "profile_path": "/y1QtAxHn8XOi4cHzDRJUuvK3aFp.jpg",
               "id": 6352,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Victor Velasco",
               "gender": 2,
               "credit_id": "52fe474f9251416c75094c4f",
               "name": "Charles Boyer",
               "profile_path": "/5xjnsNi2vr31yyPyum77aPCuCTE.jpg",
               "id": 29519,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Ethel Banks",
               "gender": 1,
               "credit_id": "52fe474f9251416c75094c53",
               "name": "Mildred Natwick",
               "profile_path": "/h9PKk5neixap3FxWUt4a867iUeV.jpg",
               "id": 12969,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Harry Pepper",
               "gender": 0,
               "credit_id": "52fe474f9251416c75094c57",
               "name": "Herb Edelman",
               "profile_path": "/v11kEIY1NpJ6vb7DR5XjttpAJuZ.jpg",
               "id": 14832,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Harriet",
               "gender": 1,
               "credit_id": "54b68917c3a36812c4000064",
               "name": "Mabel Albertson",
               "profile_path": "/yiLpCHge3tzcwDpvhTz8zwdgS2f.jpg",
               "id": 19098,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Restaurant Proprietor",
               "gender": 2,
               "credit_id": "54b689249251414edc000065",
               "name": "Fritz Feld",
               "profile_path": "/kTS9wZWTKH61e3e7k2LQOuBIle8.jpg",
               "id": 13821,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Frank",
               "gender": 2,
               "credit_id": "54b68940c3a36812d0000037",
               "name": "Ted Hartley",
               "profile_path": "/f3DXyuUZsVjx5rHSp32mQyMMZXX.jpg",
               "id": 59641,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Delivery Man",
               "gender": 2,
               "credit_id": "54b689369251414ee500004b",
               "name": "James Stone",
               "profile_path": null,
               "id": 293139,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe474f9251416c75094c5d",
               "name": "Gene Saks",
               "profile_path": "/svPlh0Jj0yvKJA2Tvqsogci0M85.jpg",
               "id": 69300,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54b688ff9251414edc000062",
               "name": "Neil Simon",
               "profile_path": "/qZ5iSAEcV7hCVYIOrOD4CI2J5Wi.jpg",
               "id": 584535,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54b689059251414ed500004d",
               "name": "Neil Simon",
               "profile_path": "/qZ5iSAEcV7hCVYIOrOD4CI2J5Wi.jpg",
               "id": 584535,
               "department": "Writing",
               "job": "Theatre Play"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.028409,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17887,
      "vote_count": 166,
      "budget": 0,
      "overview": "In this film based on a Neil Simon play, newlyweds Corie, a free spirit, and Paul Bratter, an uptight lawyer, share a sixth-floor apartment in Greenwich Village. Soon after their marriage, Corie tries to find a companion for mother, Ethel, who is now alone, and sets up Ethel with neighbor Victor. Inappropriate behavior on a double date causes conflict, and the young couple considers divorce.",
      "similar": [
         1259,
         1643,
         24420,
         332872,
         316021,
         44564,
         286554,
         11356,
         12531,
         17612,
         1024,
         1278,
         787,
         38,
         13,
         1903,
         50546,
         86331,
         72105,
         46705
      ],
      "original_title": "Barefoot in the Park",
      "runtime": 106,
      "poster_path": "/6CS1n9tKncLCkNfGVS6I6U98aGt.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Nancy Enterprises Inc. (I)",
            "id": 43995,
            "origin_country": ""
         },
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Hal Wallis Productions",
            "id": 3468,
            "origin_country": ""
         }
      ],
      "release_date": "1967-05-25",
      "vote_average": 7.1,
      "belongs_to_collection": null,
      "tagline": "Broadway's barest, rarest, unsquarest love play.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Gene Saks"],
      "runtime": 106,
      "synopsis": null,
      "writers": [
         "Neil Simon",
         "Neil Simon"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0061385/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTMwNjc2MTY0M15BMl5BanBnXkFtZTcwNDgzMDQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Robert Redford, Jane Fonda, Charles Boyer | See full cast and crew »"],
      "reviews": [
         "I'm no great fan of Neil Simon, but this neat adaption of his popular stage success BAREFOOT IN THE PARK brings a smile to my face--and it probably will yours too. The story is quite simple: newlyweds Robert Redford and Jane Fonda have moved into a New York apartment building peopled by eccentrics... and their own tiny apartment has hole in the skylight, no heat, and you have walk up five flights to get there. Redford, a rather stodgy conservative, takes a dim view of the whole thing; Fonda, who has an excessively happy-go-lucky disposition, thinks everything is great fun. Needless to say, they're soon going at it hammer and tongs. This is a very contrived, sitcom-ish plot, but the cast carries it well. Although Redford has remained a great star for forty years, his films have been very hit or miss; here he is well cast, and he plays expertly. During this period of her career, Fonda was very much the perky girl-next-door with a slight sex-kitten spin, and she too is fun to watch. But the real winners here are Charles Boyer, as their eccentric neighbor, and particularly Mildred Natwick, as Fonda's mother. Natwick excelled at playing disconcerted matrons, and this is perhaps the best of the many fine, memorable variations of the type she offered during her long and very enjoyable career. BAREFOOT IN THE PARK won't go down in history as a great film, nor will change your point of view. But it is tremendously good fun, a film I've enjoyed every time time I've seen it--and that is a good many. Recommended; you'll enjoy it. Gary F. Taylor, aka GFT, Amazon Reviewer",
         "This is just one of those movies that can make you feel better if you've had a bad day. Honestly, it's charming, funny, light and I don't know, just the right amount of comedy and romance. Redford and Fonda are perfect together. This is a truly great comedic performance by Jane Fonda, she's amazing in this movie. Then again I am a stickler for her lighter, funnier work from the 60s. But this one stands out as being genuinely funny and well made. I love all the funny little details, like the tuna fish cans, Robert Redford's comment about \"a big cat with a can opener\", Jane Fonda's mother, Jane Fonda doing a \"Cambodian fertility dance\", etc. It is all just too classic for words. Buy this movie if you love 60s cinema and/or its two stars, it's too good.",
         "I happen to prefer 'The Odd Couple' and 'The Out-of-Towners' but 'Barefoot in the Park' is good too. Surprisingly, I didn't find it as dated as 'The Goodbye Girl' which I saw recently. As in all Neil Simon scripts, you'll get the weird situations, the quirky characters and the good lines. (My favourite: \"Who lives in 4D?\" \"A big cat with a can opener.\") True, the movie appears staged, and the 1960s sets are, well, 1960s sets. But who cares. Robert Redford and Jane Fonda were young and attractive. And Charles Boyer steals the show, if that's possible with a Neil Simon script.",
         "Despite the electricity of \"The Odd Couple\" the emotional force of \"Lost in Yonkers\" and the Depression-era angst of \"Brighton Beach Memoirs,\" this remains the best movie made of a Neil Simon play. Like \"The Odd Couple\" it owes most of its enduring success to the chemistry between Jane Fonda and Robert Redford (reprising his role in the Broadway show) as the hapless newlyweds trying desperately to make it work. This is the movie that is responsible for most of the \"mismatched\" romantic comedies we've ever seen, including \"Along Came Polly\" and TV's \"Dharma and Greg.\" It proves that flowery romantic prose isn't what makes a great love story, bold heroes and damsels in distress don't make a good love story. No, what makes a good love story are two people who, from start to finish, makes the audience go \"Oh, God in heaven, please let them work it out!\" The brilliant dialogue of Mr. Simon, the charm of Mr. Boyer and the majestic backdrop of New York City make this a must-see for anyone who loves 1, comedy, 2, love stories or 3, Robert Redford because after this, he never really made another movie that was at all comparable. Oh, I just remembered \"Laughter on the 23rd Floor.\" I guess it's a tie for best Neil Simon movie.",
         "I would recommend this movie to anyone for its simplicity. Though simple and quiet, this movie is stunning. The situation of a young married couple played out almost entirely in their one bedroom apartment adds to this movies basic plot. The nonchalant attitude of a newly married man and his very emotionally free wife is quite exciting. I would normally ask for a lot more from a movie, but in \"Barefoot in the Park\" it is not needed. The superb acting of both Robert Redford and Jane Fonda leave you stoked for the thrilling dialogs that take place between the couple. There is an abundance of humor. The movie simply leaves you feeling casual in a very glamorous world.",
         "Robert Redford and Jane Fonda are at their best in this fast-paced, movie version of Neil Simon's BAREFOOT IN THE PARK. They show you what happens when the honeymoon's over and \"real life\" begins. The interaction between Redford and Fonda is superb and flows smoothly, the acting is brilliant and shines brightly throughout the movie. It's like witnessing perfection. Even the supporting cast is marvelous with their humorous dialog and perfect timing. What I like best is the characters will have you laughing without even half trying. Everything is put together so splendidly. This is one of those movies where everything comes together: the actors, the writing, the scenery, the situation, and of course the performances. In my opinion BAREFOOT IN THE PARK is a rare gem that should be seen by all.",
         "Noted playwright Neil Simon has successfully adapted many of his plays onto film and this 1967 Paramount release ranks as one of his best film adaptations of all. Robert Redford reprises his stage role as a newly married man who along with his new bride (Jane Fonda) gets involved in many hilarious situations as Fonda attempts to help him be more \"free-spirited.\" A 1960's comedy classic.",
         "This film version of one of Neil Simon's early Broadway hits coasts on the likability of its cast and a lot of classic Simon banter. The gossamer-thin plot, about newlyweds who find out they don't know each other as well as they thought, is only a framework to hang a bunch of running gags about drafty New York flats, endless stairs, oddball neighbors and the like. Laughs are plentiful, although as in the rest of Simon's work, one is acutely aware that nobody is so quick with the one-liners in real life. Boy, were they young back then! Robert Redford underplays charmingly as Paul Bratter, up-and-coming lawyer and all-round stick-in-the-mud; Jane Fonda is his new bride Corie, sexy, fun-loving and relentlessly cute to the borderline of annoyance. When you find her schtick getting a little hard to take, concentrate instead on veteran character actors Charles Boyer and Mildred Natwick, who lend spirit and class to their comedic roles. Perhaps the direction by Gene Saks is a tad stagebound (he directed the Broadway version), and the cinematography a bit muddy, but Neal Hefti contributes another sprightly score that does a lot to compensate. Overall, an undemanding, undeniable pleasure.",
         "As my girlfriend noted before I watched for the first time, this is like the original 'Dharma & Greg.' She's the free spirit, he's the button-down lawyer struggling to adjust to the new world into which he's just married. After six days of a honeymoon at the Plaza, where eyebrows are raised amongst the staff because the young lovers never leave the room, conflicts come to a boil at home when she realizes that her new husband isn't such an adventurous fella. Amongst the number of reasons she compiles to determine that they just can't make it after all: he declines an invitation to take off his shoes, in February, to walk barefoot in the park. Of course, with your knowledge of romantic comedies about marital discord, you know generally how it all ends. How the conflict is resolved, beginning with some advice from Mother, may seem realistic and true to some. Others raised on self-empowered heroines may think it's a trite sell-out. There's no question that young Redford fits the bill as Handsome & Charming, but it's a little hard to believe in him as a character who's supposed to be a stick in the mud. Fonda at this point had carved out a niche for herself in Wild, Untamed Belle roles, and she's fine again in that role here. But I must admit it was hard to watch without thinking about Holly Golightly, and imagining a sophisticated presence like Audrey Hepburn in the part, instead. The script also calls for the Mother to comment that she's never seen another couple who looked so much in love, but I really didn't see it. The couple seems at complete odds from their first evening at home. I can't think of a scene that illustrates why the two fell in love in the first place, except that they're both so young & sexy. It's worth watching for the snappy dialogue, the work by Charles Boyer & Mildred Natwick as Mr. Velasco & the Mother, the chance to admire Redford & Fonda in their youth, and as a nice Neil Simon period piece. But it would be no crime for someone to attempt a better, updated remake. It could be done, and you probably can already picture it.",
         "Robert Redford and Jane Fonda are both outstanding actors and compensate each other very nicely in this romantic comedy. This movie has all the quality ingredients needed to make it a classic comedy. Redford, as usual, displays great talent enhanced by the school-girl charisma of Jane Fonda. I love it."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "Paramount Pictures",
         "Hal Wallis Productions",
         "Nancy Enterprises Inc. (I)"
      ],
      "summaries": [
         "New Yorkers Paul Bratter and Corie Bratter née Banks have just gotten married. He is a stuffed shirt just starting his career as a lawyer. She is an independently minded free spirit who prides herself on doing the illogical purely out of a sense of adventure, such acts as walking through Washington Square Park barefoot when it's 17°F outside. Their six day honeymoon at the Plaza Hotel shows that they can get to know each other easily in the biblical sense. But they will see if they can get to know each other in their real life when they move into their first apartment, a cozy (in other words, small), slightly broken down top floor unit in a five story walk-up. While Corie joyfully bounds up and down the stairs, Paul, always winded after the fact, hates the fact of having to walk up the six flights of stairs, if one includes the stairs that comprise the outside front stoop. Beyond the issues with the apartment itself, Paul and Corie will have to deal with an odd assortment of neighbors, most specifically eccentric senior Victor Velasco, who lives in the unusual attic and who would like to consider himself a dirty old man. Corie, worried about her single straight-laced mother Ethel Banks, wants to set her up with Victor. Without Corie or Paul truly realizing it, Ethel and Victor as a twosome is as illogical as Corie and Paul. What happens between Ethel and Victor may be a predictor if Corie and Paul's marriage can make it in the long run.",
         "Paul Bratter, a conservative young lawyer, marries a vivacious young woman, Corrie. Their highly passionate relationship descends into comical discord in a five-flight New York City walk-up apartment.",
         "Combines love and laughs. Paul Bratter is a newly married lawyer. Corrie Bratter is a newly married woman whose main goal in life is to have fun and to have it with Paul. Together they learn how to live and love in an apartment that's laughably small in New York and located on the fifth floor of a building with no elevator. Corrie's mother has some of the funniest lines.",
         "Paul Bratter is Mister Straight. Corie is his new wife, who dedicates her life to the pursuit of fun. As the ecstasy of the honeymoon gives way to the reality of setting up housekeeping in a five-flight walk-up, the harmony of marriage turns to comical discord. The mother-in-law complains meekly. The middle-aged Lothario upstairs flirts. Joy turns to anguish. There is little doubt that the young people will kiss and make up by the end of the picture, just as there's little doubt that mother and the neighbor will find each other.",
         "Paul, a conservative young lawyer, marries the vivacious Corrie. Their highly passionate relationship descends into comical discord in a five-flight New York City walk-up apartment."
      ],
      "budget": 0
   },
   "movielensId": 2870,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1967-05-25",
      "dvdReleaseDate": "1999-09-21",
      "directors": ["Gene Saks"],
      "runtime": 106,
      "movieId": 2870,
      "title": "Barefoot in the Park",
      "mpaa": "",
      "actors": [
         "Robert Redford",
         "Jane Fonda",
         "Charles Boyer",
         "Mildred Natwick",
         "Herb Edelman",
         "Mabel Albertson",
         "Fritz Feld",
         "Ted Hartley",
         "James Stone"
      ],
      "imdbMovieId": "0061385",
      "originalTitle": "Barefoot in the Park",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["rY-uQehpXf0"],
      "plotSummary": "In this film based on a Neil Simon play, newlyweds Corie, a free spirit, and Paul Bratter, an uptight lawyer, share a sixth-floor apartment in Greenwich Village. Soon after their marriage, Corie tries to find a companion for mother, Ethel, who is now alone, and sets up Ethel with neighbor Victor. Inappropriate behavior on a double date causes conflict, and the young couple considers divorce.",
      "tmdbMovieId": 17887,
      "avgRating": 3.57772,
      "releaseYear": "1967",
      "numRatings": 1396,
      "posterPath": "/6CS1n9tKncLCkNfGVS6I6U98aGt.jpg"
   }
}