{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "jazz",
            "id": 1416
         },
         {
            "name": "saxophonist",
            "id": 3018
         },
         {
            "name": "shooting",
            "id": 7281
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "extramarital affair",
            "id": 34094
         }
      ],
      "imdb_id": "tt0125879",
      "video": false,
      "title": "Lulu on the Bridge",
      "recommendations": [
         14279,
         40435,
         24111,
         2088,
         13574
      ],
      "backdrop_path": "/AgfJjk7PSJsmId6hvXsBs0bpvod.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Izzy Maurer",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb59",
               "name": "Harvey Keitel",
               "profile_path": "/4IcHhp1SCKijRxb7kqnxZNJuKdn.jpg",
               "id": 1037,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Dave Reilly",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb5d",
               "name": "Richard Edson",
               "profile_path": "/7YegwxrBppretnwGEEMxEI453Ef.jpg",
               "id": 6396,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Tyrone Lord",
               "gender": 0,
               "credit_id": "52fe461ec3a36847f80edb61",
               "name": "Don Byron",
               "profile_path": null,
               "id": 128886,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Man With Gun",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb65",
               "name": "Kevin Corrigan",
               "profile_path": "/trRjEABsF2BCqn6pib3bYhYIxNH.jpg",
               "id": 18472,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Celia Burns",
               "gender": 1,
               "credit_id": "52fe461ec3a36847f80edb69",
               "name": "Mira Sorvino",
               "profile_path": "/ooyCQtEdE9wIsgC1lZRFo36VzRo.jpg",
               "id": 23931,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Pierre",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb6d",
               "name": "Victor Argo",
               "profile_path": "/kYwuOpT59qqJnssl9R4226yHSAG.jpg",
               "id": 2561,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Bobby Perez",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb71",
               "name": "Harold Perrineau",
               "profile_path": "/dvvViqumTolGoCut6YiGow666z2.jpg",
               "id": 6195,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Hannah",
               "gender": 1,
               "credit_id": "52fe461ec3a36847f80edb75",
               "name": "Gina Gershon",
               "profile_path": "/jaUQhGVmemkSyS5O0fcRkhGTOUq.jpg",
               "id": 11150,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Sonia Kleinman",
               "gender": 0,
               "credit_id": "52fe461ec3a36847f80edb79",
               "name": "Sophie Auster",
               "profile_path": null,
               "id": 128888,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Philip Kleinman",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb7d",
               "name": "Mandy Patinkin",
               "profile_path": "/4yUgIErXR9G70fj6V38YVfzJ4Tv.jpg",
               "id": 25503,
               "order": 10
            },
            {
               "cast_id": 17,
               "character": "Dying Girl",
               "gender": 0,
               "credit_id": "52fe461ec3a36847f80edb85",
               "name": "Holly Buczek",
               "profile_path": null,
               "id": 128891,
               "order": 13
            },
            {
               "cast_id": 18,
               "character": "Catherine Moore",
               "gender": 1,
               "credit_id": "52fe461ec3a36847f80edb89",
               "name": "Vanessa Redgrave",
               "profile_path": "/hGxsPCZkwa30UE0XQdGTB9yT0jz.jpg",
               "id": 13333,
               "order": 14
            },
            {
               "cast_id": 19,
               "character": "'Laughing Man' Escort",
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb8d",
               "name": "David Byrne",
               "profile_path": "/tf4MWnQiv2Yqfxq8I2tBXCdAcKi.jpg",
               "id": 3078,
               "order": 15
            },
            {
               "cast_id": 20,
               "character": "Dr. Fisher",
               "gender": 1,
               "credit_id": "52fe461ec3a36847f80edb91",
               "name": "Peggy Gormley",
               "profile_path": "/jcePgWT2Hr69r2WNXXJJE1K8SFp.jpg",
               "id": 46397,
               "order": 16
            },
            {
               "cast_id": 21,
               "character": "Stanley Mar",
               "gender": 2,
               "credit_id": "57a39feec3a3683835000be9",
               "name": "Greg Johnson",
               "profile_path": null,
               "id": 1319398,
               "order": 17
            },
            {
               "cast_id": 26,
               "character": "",
               "gender": 2,
               "credit_id": "58a7fd6cc3a3686654003941",
               "name": "Willem Dafoe",
               "profile_path": "/xM5lhOR5tWWdIlFpBDeZJx9opIP.jpg",
               "id": 5293,
               "order": 18
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb4f",
               "name": "Paul Auster",
               "profile_path": "/bNKAo8IdtMP6Fd85MfXsKoED7Bb.jpg",
               "id": 46391,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe461ec3a36847f80edb55",
               "name": "Paul Auster",
               "profile_path": "/bNKAo8IdtMP6Fd85MfXsKoED7Bb.jpg",
               "id": 46391,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58a7fd07c3a36866540038f1",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "58a7fd199251415671003daf",
               "name": "Graeme Revell",
               "profile_path": "/g2Nhv2OCV8ygLYxkeDbhlqnrv7Z.jpg",
               "id": 5912,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "58a7fd2bc3a3686679003b4e",
               "name": "Alik Sakharov",
               "profile_path": "/50ZlHkh66aOPxQMjQ21LJDAkYlR.jpg",
               "id": 1318704,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "58a7fd549251415669003aef",
               "name": "Tim Squyres",
               "profile_path": null,
               "id": 1635,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.633428,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42848,
      "vote_count": 7,
      "budget": 0,
      "overview": "This film is about a famous jazz saxophonist, Izzy who's life is forever changed after he is accidentally shot.",
      "similar": [
         339692,
         949,
         507,
         3134,
         11033,
         638,
         298312,
         8810,
         948,
         11564,
         4771,
         431,
         101,
         141,
         341013,
         281957,
         241,
         281,
         793,
         336843
      ],
      "original_title": "Lulu on the Bridge",
      "runtime": 103,
      "poster_path": "/1W6uXRHDiB66U3RKzgYeKWdNpey.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Capitol Films",
            "id": 826,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Redeemable Features",
            "id": 1483,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-06",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Is she real? ..or did he make her up?",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Paul Auster"],
      "runtime": 103,
      "synopsis": null,
      "writers": ["Paul Auster"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0125879/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY5NTAwNzA0MF5BMl5BanBnXkFtZTYwODI3MTc4._V1_.jpg",
      "actors": ["Stars: Harvey Keitel, Mira Sorvino, Richard Edson | See full cast and crew »"],
      "reviews": [
         "This movie is an original - a gem. Fifteen minutes after it was over I began weeping - I was so touched. It is never too late. One can lead a rotten life, but there is always hope - even in the strangest of times - to find love and to become a person worthy of being loved in return. To provide more details would undermine the movie's original theme. Indeed, the description on this web page is not at all what the film is really about. I don't know why the ratings aren't higher. Perhaps the movie is lost on impatient souls who need lots of action to keep their attention intact.",
         "I see that opinions for Lulu are either 'I loved it' or 'I hated it.' There's a good reason. This is a very different film, with spiritual and other-worldly overtones -- it's definitely spooky. I could not have imagined where the story finally ended up, but it requires a lot of imagination to understand it (think, \"Where does the mind go when it loses consciousness? And, what is the real meaning of 'time'?\"). If you don't like it, that's fine -- maybe you just don't get it. Nothing wrong with that -- it's pretty deep. But for me, it's a form of pure entertainment that I cannot find anywhere else. I loved it. I bought a copy on DVD. I tell my friends about it. The ending is a definite surprise, but there are lots of other surprises throughout. Why not find out for yourself?",
         "This is mainly a two-actor film with Harvey Keitel playing a low-key (at least for him!) character and Mia Sorvino playing his young girlfriend. They dominate the story. In an odd way, this is an interesting film although a bit \"soapy\" in parts for my tastes. It has a bit of a mystifying element with this strange stone as part of the story, yet they don't elaborate on it. Actually, this is more of a romance story....but at leaves a number of questions. One doesn't quite figure out Willem Dafoe's character is in here and the ending was very strange and not altogether satisfying, either. Perhaps another look or two would have been a better option before writing this. I haven't read any reviews but I suspect people really got into this film and liked it or were bored to death. Actually, I was somewhere in the middle. I was more interested in the cinematography. Note: \"Lulu\" is named for a character played by silent screen star Louise Brooks.",
         "I didn't know what to expect before viewing this film. Certainly the title gave no clues and was a bit of a turn-off. However, right from the start I found the story to be interesting. It had a lot of twists and turns that kept my interest throughout. It is one of those pictures that you are better not knowing anything, so I won't reveal any of the plot. Suffice to say this script made for enjoyable watching and I am surprised that other viewers did not rate it as highly as I did.",
         "Like many of New York City waitresses, Celia Burns is an aspiring actress. Izzy Maurer, a jazz saxophonist recovering from a gunshot wound, contacts her after finding her name along with a stone having magical properties, one of which propels them into a love affair. Through her talent, and friends of Izzy's ex-wife, Celia is able to land the part of Lulu, one which most actresses could only dream of. Izzy is held captive and Celia chased by a mysterious man claiming to have a doctorate in anthropology who wants the magical stone. It is only at the film's end that the discerning viewer understands what has really transpired. The all star cast does not disappoint.",
         "I saw this little gem of a film last year, forgot about it, then decided to buy it. On a second viewing I realized how much I missed the first time around. The scientific/mythical/mystical/spiritual interpretations are left up to the individual, and I found myself leaning toward the mystical/spiritual, especially when the film-within-a-film (Pandora's Box) entered the plot. While some might have felt this whole episode was irrelevant, to me it was central in a kind of a skewed way that wasn't really developed. Anyone familiar with the myth of Pandora's Box will recognize the significance of the \"rock in the box\" that causes lives to change in a dramatic, profound way. Izzy's state of consciousness during the film is simply a device -an interesting one- to tell a story. Seeing Dafoe and Keitel working together again (first time since Last Temptation of Christ?) was a delight. Both are capable of a tremendous range, but chose restraint in this film, and it worked. The interogation scenes in the warehouse were mesmerizing. I love this film!",
         "Here's a movie that has a Zero Rating at Rotten Tomatoes. It has some tremendously bad acting. The story ends in a way that most viewers seem cheated. Its poorly edited and photographed. But it still worked for me because the idea is so clever that I happily make the leap, completing the movie. Here's the general shape: man is shot and lays dying. He has a vision of girl who he falls in love with, a magical stone causes this. (This is a piece of plaster that falls on him when he is shot.) Its a sweet love story and the magical nature is apt for a movie about an inner movie. But there are two complications that help. One is that our hero is captured and quizzed. Some dreary writing and the roughest parts of the film are associated with this bit. Its the second complication that has a special sparkle. Our girl is an out of work actress who \u0097 again magically \u0097 gets the starring role as Lulu in a remake of \"Pandora's Box.\" This is perhaps the most sexually charged film of all time: a perfect confluence of actress, svengali filmmaker and the cinematic properties of silent film-making. Its a rather clever fold, yeah? A film about an inner film of love that both references and includes a landmark film. Its being made in Joyce's Dublin by a character played by Vanessa Redgrave. More: our guy is particularly fond of \"Singing in the Rain.\" The fact that the girl in this case is profoundly unsexy and unappealing in most ways deepens the notion for me. It works, if you let it. Ted's Evaluation -- 3 of 3: Worth watching.",
         "I got in one hour after it had started. It starred Harvey Keitel, whom I especially like and wanted to watch it because of him. Then Wilem DaFoe was there also, second reason to continue watching. Then, again, Mandy Patikin, number three great actor. I liked the character Harvey was playing, a soft spoken, quiet man, much different than many of his other characters. It was more like his character in 'The Piano'. I was pulled in and couldn't stop watching. I didn't know what had come before, so couldn't completely understand it, but just had to keep watching. As in a mystery, I thought I knew what was going on and I knew I had to see the entire movie at that point. It's more like a play than a movie, and excellently done. Great cinematography. Great suspense. Stunning finish. Really made me think and feel deeply.",
         "Being an eager fan of Paul Austers writing I was very excited to get a chance to watch a film which he had both written and directed. All of his novels are clever, philosophical, and thrilling at the same time. This movie, however, was a huge disappointment! The whole story, the script, and especially the pretentious acting made the watching of this film a semi-horror. Sorry to say, my idol, Paul Auster obviously has achieved a master degree in writing novels, while the form of a movie script seems to suit him all too badly. My hopes for the future are twofold: either Mr. Auster learns from this experience how to do better movies or, simply, he'll stick to what he does best: writing novels! As for all of you who have only seen this film and not read any of his novels: go now! to the library and dig in!",
         "I first separate films such as this (some refer to them as \"art\" films) into two categories. Does the maker(s) take the attitude, \"I'm an insightful, sensitive genius and if you fail to notice you're an imbecile.\" or does he/she/they make an attempt to have the work be interesting and thought provoking to the average person? I put LULU in the latter category. It seems to me the work was truly trying to place some positive human attributes, aspirations, etc., above this life of suffering and sorrow. The acting was also exceptionally good. But even if a film passes the sincerity test, it does not necessarily mean it works and/or is a great film. LULU lacks the sheer audacity of a David Lynch flick, the disturbing impact of a Von Triar movie or the passion of a Herzog effort (I'd throw Aranofsky in, but he's really mainstream). Its enjoyable enough to watch but I didn't find myself torturing myself later on to find answers because I just don't think there was enough behind LULU's creation to make examination efforts worthwhile. I am left with some pleasant thoughts of love and life angst. But LULU just doesn't qualify as a heavy; e.g., like BLUE VELVET, DOGVILLE, or GRIZZLY MAN. Would definitely watch another film by this dude though."
      ],
      "genres": [
         "Drama",
         "Music",
         "Mystery",
         "Romance"
      ],
      "productionCompanies": [
         "Capitol Films",
         "Redeemable Features"
      ],
      "summaries": [
         "A jazz saxophonist loses his capability to play when he is injured in a shooting at a café where he was playing. He sinks into depression when everyone charges in to take care of him, including his ex-wife. However, he discovers a stone with a telephone number attached. Returning the stone, he meets a young aspiring actress who in one of those film coincidences is listening to his music. Soon the two begin an affair which is fouled by his over-obsessiveness with her which costs them both a job at a restaurant.",
         "A famous jazz saxophonist whose life is forever changed after he is accidentally shot."
      ],
      "budget": 0
   },
   "movielensId": 2873,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-06",
      "dvdReleaseDate": "1999-09-21",
      "directors": ["Paul Auster"],
      "runtime": 103,
      "movieId": 2873,
      "title": "Lulu on the Bridge",
      "mpaa": "PG-13",
      "actors": [
         "Harvey Keitel",
         "Richard Edson",
         "Don Byron",
         "Kevin Corrigan",
         "Mira Sorvino",
         "Victor Argo",
         "Harold Perrineau",
         "Gina Gershon",
         "Sophie Auster",
         "Mandy Patinkin",
         "Holly Buczek",
         "Vanessa Redgrave",
         "David Byrne",
         "Peggy Gormley",
         "Greg Johnson",
         "Willem Dafoe"
      ],
      "imdbMovieId": "0125879",
      "originalTitle": "Lulu on the Bridge",
      "genres": [
         "Drama",
         "Mystery",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["EpSvTh-ZFCk"],
      "plotSummary": "This film is about a famous jazz saxophonist, Izzy who's life is forever changed after he is accidentally shot.",
      "tmdbMovieId": 42848,
      "avgRating": 2.96711,
      "releaseYear": "1998",
      "numRatings": 228,
      "posterPath": "/1W6uXRHDiB66U3RKzgYeKWdNpey.jpg"
   }
}