{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "haunted house",
            "id": 3358
         },
         {
            "name": "college",
            "id": 3616
         },
         {
            "name": "abandoned house",
            "id": 8303
         },
         {
            "name": "serial killer",
            "id": 10714
         },
         {
            "name": "slasher",
            "id": 12339
         },
         {
            "name": "ghost",
            "id": 162846
         },
         {
            "name": "fraternity initiation",
            "id": 171260
         },
         {
            "name": "scream queen",
            "id": 188552
         },
         {
            "name": "deformed man",
            "id": 188561
         },
         {
            "name": "trespassing",
            "id": 192170
         },
         {
            "name": "college student",
            "id": 207844
         }
      ],
      "imdb_id": "tt0082511",
      "video": false,
      "title": "Hell Night",
      "recommendations": [
         40229,
         36599,
         70448,
         11226,
         54116,
         25627,
         49684,
         39875,
         39982,
         40364,
         75905,
         65899,
         40095,
         44698,
         64524,
         27743,
         78552,
         84508,
         241432,
         42786
      ],
      "backdrop_path": "/ksS134gaUzp9Qcs7z3P4xwFDLMO.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Marti Gaines",
               "gender": 1,
               "credit_id": "52fe4591c3a368484e0629cd",
               "name": "Linda Blair",
               "profile_path": "/tIoU3CSpjnLi79UfBgNjXNQM1GN.jpg",
               "id": 37366,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Seth",
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629c5",
               "name": "Vince Van Patten",
               "profile_path": "/dhMvaPXLDwQwD6y7I4Ixn5Cs3cE.jpg",
               "id": 98569,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Jeff Reed",
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629c9",
               "name": "Peter Barton",
               "profile_path": "/8ozl7XVYTwprddeyI1J19QMg5pP.jpg",
               "id": 59442,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Denise Dunsmore",
               "gender": 0,
               "credit_id": "52fe4591c3a368484e0629d1",
               "name": "Suki Goodwin",
               "profile_path": "/wqa5LlPl0PLcpV4wknB2DQAl0h2.jpg",
               "id": 100617,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Peter Bennett",
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629d5",
               "name": "Kevin Brophy",
               "profile_path": null,
               "id": 100618,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "May",
               "gender": 1,
               "credit_id": "52fe4591c3a368484e0629d9",
               "name": "Jenny Neumann",
               "profile_path": "/mw9Rfy9hzf9ZHdPKQPglSs0HsAA.jpg",
               "id": 100619,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Scott",
               "gender": 0,
               "credit_id": "52fe4591c3a368484e0629dd",
               "name": "Jimmy Sturtevant",
               "profile_path": null,
               "id": 100620,
               "order": 6
            },
            {
               "cast_id": 23,
               "character": "Older Cop",
               "gender": 0,
               "credit_id": "5a944b029251414174034a7f",
               "name": "Hal Ralston",
               "profile_path": null,
               "id": 1986010,
               "order": 7
            },
            {
               "cast_id": 24,
               "character": "Younger Cop",
               "gender": 0,
               "credit_id": "5a944b11c3a3682502034695",
               "name": "Carey Fox",
               "profile_path": null,
               "id": 1404389,
               "order": 8
            },
            {
               "cast_id": 25,
               "character": "Driver (as Ronald Gans)",
               "gender": 2,
               "credit_id": "5a944b20c3a368250b031d62",
               "name": "Ron Gans",
               "profile_path": null,
               "id": 938767,
               "order": 9
            },
            {
               "cast_id": 26,
               "character": "Party Girl",
               "gender": 0,
               "credit_id": "5a944b2a9251414171032bbc",
               "name": "Gloria Heilman",
               "profile_path": null,
               "id": 1986011,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629c1",
               "name": "Tom DeSimone",
               "profile_path": null,
               "id": 100616,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629e3",
               "name": "Randy Feldman",
               "profile_path": "/iebh0LeaE1kPlpgGYfNMfe5cMik.jpg",
               "id": 56186,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629e9",
               "name": "Bruce Cohn Curtis",
               "profile_path": null,
               "id": 105598,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629ef",
               "name": "Mark L. Rosen",
               "profile_path": null,
               "id": 47979,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4591c3a368484e0629f5",
               "name": "Irwin Yablans",
               "profile_path": null,
               "id": 64059,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e0629fb",
               "name": "Chuck Russell",
               "profile_path": "/vgZnLAHFCi3ZwwEcTSwdvK7pKHF.jpg",
               "id": 26713,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e062a01",
               "name": "Joseph Wolf",
               "profile_path": null,
               "id": 13667,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4591c3a368484e062a07",
               "name": "Dan Wyman",
               "profile_path": null,
               "id": 64050,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e062a0d",
               "name": "Mac Ahlberg",
               "profile_path": "/a1BF9YiCGQ66Mncin2UmYi1g2iN.jpg",
               "id": 4614,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4591c3a368484e062a13",
               "name": "Anthony DiMarco",
               "profile_path": null,
               "id": 31203,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 1,
               "credit_id": "52fe4591c3a368484e062a19",
               "name": "Johanna Ray",
               "profile_path": null,
               "id": 3686,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e062a1f",
               "name": "Steven Legler",
               "profile_path": null,
               "id": 961600,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 0,
               "credit_id": "52fe4591c3a368484e062a25",
               "name": "Lennie Barin",
               "profile_path": null,
               "id": 1273647,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe4591c3a368484e062a2b",
               "name": "Ken Horn",
               "profile_path": null,
               "id": 166269,
               "department": "Crew",
               "job": "Makeup Effects"
            },
            {
               "gender": 0,
               "credit_id": "5960b8b9c3a368293b0bfd5b",
               "name": "Tom Schwartz",
               "profile_path": null,
               "id": 1847198,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.232654,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 28377,
      "vote_count": 42,
      "budget": 0,
      "overview": "Four college pledges are forced to spend the night in a deserted old mansion where they get killed off one by one by the monstrous surviving members of a family massacre years earlier for trespassing on their living grounds.",
      "similar": [
         10781,
         1696,
         39874,
         9299,
         10285,
         2832,
         77949,
         201085,
         948,
         452507,
         440021,
         3600,
         12521,
         984,
         4488,
         5486,
         12662,
         10092,
         2655,
         274
      ],
      "original_title": "Hell Night",
      "runtime": 101,
      "poster_path": "/3HoLXaoobRVNhUQevJJWSO4GkGN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "BLT Productions",
            "id": 4724,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Media Home Entertainment",
            "id": 18329,
            "origin_country": ""
         }
      ],
      "release_date": "1981-08-28",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "Pray for day.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tom DeSimone"],
      "runtime": 101,
      "synopsis": "The film opens with a girl starts to scream hysterically looking upwards to the camera. During a massive college party, Peter Bennett, the president of the Alpha Sigma Rho fraternity, decides to make four pledges: Marti, Jeff, Seth, and Denise told to stay at the historic Garth Manor until dawn on hell night as part of their initiation. Peter and a group of others, along with his friends Scott and May, bring everyone together and tells them about the sordid history of the estate as they walk while he leads them. Peter explains in a long monologue that 12 years prior, the owner and great-grandson of the founder and gold prospector, Raymond Garth, strangled his wife Lillian to death and then proceeded to murder three of his children (Morris, Suzanne, and Margaret) due to their severe deformities. After the carnage, Raymond hanged himself. However, the police never found the body of the youngest Garth child, 14-year-old Andrew. Legend has it, Andrew witnessed the murder of his entire family and may still be living within Garth Manor. After the pledges get set up in the house, Scott and May assist Peter in attempting to scare them with mechanical devices and sound effects until they are quickly murdered one by one by unseen assailants. May gets violently dragged into a pit and decapitated. Scott has his neck broken on the roof by a large, bare-handed man. Peter discovers Scott's body hanging from a wire and runs to escape without telling the pledges, but is attacked by an unknown assailant. He escapes, but gets lost in a garden labyrinth (a la The Shining) and runs into yet another assailant who impales him with a scythe. The audience realizes that there are two killers. Meanwhile, Marti, Jeff, Seth and Denise discover the sound devices and bogus effects throughout the house set to scare them. After Seth and Denise have a sensual moment together, Seth excuses himself to go to the restroom, and a large, deformed hand covers Denise's mouth. Seth returns to discover May's severed head in the bed and runs away hysterically freaked out. As Jeff confronts Seth, they quickly decide to escape and seek help as Jeff and Marti stay behind. Seth tries to climb the spiked iron gate, but stabs his arm on a spike and falls down. Jeff suggests that he take off his boots and try again. Seth agrees and manages to scale the gate. But he promises to return. Seth runs back to the frat house at the university, pounding on the door for help around but no one is there. Jeff and Marti search the house and discover Scott's hanging body with a rope outside a window. Jeff decides to go outside to look for the others and discovers Peter's corpse. As he runs away in horror, the camera focuses on Peter's hand. the gate keys grasped tightly. Jeff informs Marti that the others have been killed so they decide that it must be Andrew Garth, but are unsure. Jeff and Marti lie in wait in a bedroom armed with a pitchfork, a mysterious shape comes up from the floor under a large rug to attack them. Jeff impales it with the pitchfork and it falls into the hole in the floor. Angry at the death of his friends, Jeff decides to go after it. Marti follows. As they walk through an underground tunnel under the house, they discover dead bodies posed at a table with rats crawling on them. They discover Denise's fresh corpse among the bodies. Suddenly, they see a disfigured man heading towards them. After a chase down the tunnels, Jeff fights him but is knocked down a stone flight of stairs, and injured. He and Marti escape through a hidden exit. Meanwhile, Seth arrives at a local police station. After being disgruntled with the police who think he is pulling another Alpha Sigma Rho prank (out of his anger) Seth steals a shotgun from an abandoned office and tries to find any remaining pledges at the frat house. Finding no one except some drunken revellers who leave, he then suddenly carjacks a man without hurting him in the parking lot and manages to return to Garth Manor as a promise to his friends. Seth sees a figure run past him at the front gate of the Garth Manor as he arrives back. Following along the gated fence, Seth finds a bent out bar of the fence where the figure sliped through and enters the manor grounds. Suddenly, Seth gets attacked by a man, and after a long scuffle, he shoots him to death with the stolen police shotgun. Obviously, Seth doesn't realize that there's another killer in the house when he enters and calls out for Jeff and Marti. As they tell Seth the others are dead, an arm suddenly grabs him from out of the shadows and quickly drags him away. A gunshot is heard and only the shotgun appears sliding across the floor. As Marti decides to go for the gun, the other killer leaps out to grab her. Marti escapes as he chases them upstairs to the bedroom. The Garth killer then kills Jeff by throwing him out a window after he helps Marti out safely. Marti makes her way through the garden labyrinth and discovers Peter's dead body. As his body falls on top of her, she sees the keys and has to pry them from his hands. She makes her way to the gate (unaware about the secret opening in the fence a few hundred yards down from the front gate), opens it and hot wires the stolen car Seth had left by the front gate. Driving away, a hideous face appears from the roof as the killer has leaped onto the car. Marti screams as the glass shatters and a large hand tries to grasp her throat. As she tries to escape, Marti backs into the front gate, bending it. As the car skids, Marti fights off the assailant and punches down on the accelerator as she speeds towards the gate, the killer looks in horror as the gate violently impales him. He spews blood, writhes in agony and dies. A stunned Marti shouts out and hits her head on the steering wheel sounding the horn as it fades out and the battery on the car dies as well. In the morning, the body is still on the car. Marti awakens slowly to the light of dawn and manages to get out of the car. It is assumed she's the only survivor. She walks toward the camera in a daze as the end credits roll.",
      "writers": ["Randy Feldman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0082511/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI1NTEyNDg4MF5BMl5BanBnXkFtZTcwNDY5NjYxMQ@@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Linda Blair, Vincent Van Patten, Peter Barton | See full cast and crew »"],
      "reviews": [
         "\"Hell Night\" is a fun little 1981 horror film from the producer of \"Halloween\". The plot is as follows - Twelve years ago, a man savagely murdered his wife and three of their deformed and disabled children, leaving only one son as a survivor, then hanging himself in his family mansion. Now, twelve years after the horrible murders, four college pledges for the Alpha Sigma Ro fraternity/sorority are forced to spend the night in Garth manor for their initiation. All seems to be going well, and the upperclassmen play a few tricks on the newcomers to try and scare them. But the jokes become horrifyingly real when the pranksters and the pledges begin to die. Could it be possible that the fourth son of the Garth family is still lurking somewhere on the grounds? I'd been wanting to see this for quite some time now, and I finally got my hands on the DVD and I thoroughly enjoyed this film. Is it clichéd? Sure it is, very much so, actually. The plot (while it isn't as original as it could be) is well paced and entertaining all the way. It blends both the slasher and haunted house horror sub-genres, and it does it with style. Sure, the horror clichés are present, but these clichés don't take the film down. The mansion was large, old, and creepy inside, adding to the classic haunted-house horror film feeling. Not to mention the pledges are dressed in period costumes reflecting the olden days. The acting was decent, not perfect but good enough. Linda Blair of \"The Exorcist\" is our main leading heroine, and her innocent character of Marti is likable. Peter Barton plays Jeff, and Vincent Van Patten plays the tough surfer dude along with Suki Goodwin as the party girl. All of the actors performed well for the most part, no real complaints there. There are some memorable scenes in the film, especially the rug scene and the chase in the underground tunnels with Marti and Jeff and the old deformed psychopath. Speaking of the villain, he was actually rather creepy and the makeup effects were decent, although we don't really get to see his face until the finale. There are some creative murder scenes that have surprisingly good special effects considering the time the film was made. But the film's overall atmosphere was the best part if you asked me. It kind of reminded me of a Scooby Doo episode with it's style and story, but much more violent than anything you'd ever see on a cartoon show. Overall, \"Hell Night\" is one of the most fun '80s horror films out there. The whole film has a fun, festive tone, and there are some pretty spooky scenes and the atmosphere was perfect in a classic, haunted-house horror kind of way. The atmosphere is killer (literally), there are some scary murders, and Linda Blair is the leading lady! What more can you ask for? Definitely check it out if you are a fan of the genre. 9/10.",
         "I love slasher films and this is one of my favorites....it seems one of the biggest complaints about 'Hell Night' is the lack of blood. Am I the only one here who remembers two other horror classics that have little bloodshed....'Halloween' and 'Texas Chain Saw Massacre' and before you disagree....watch them again. And notice that all the times that Leatherface smacks heads with the hammer and carves bodies with his chainsaw- very little blood hits the ground.....even 'Prom Night' shows black screen when someone is getting hacked up with an axe... And not all slasher films have to have the 'guess who the killer is' theme....in 'Halloween' we knew it was Michael Meyers and 'Chain Saw Massacre' we knew it was Leatherface and his family.... Back to 'Hell Night'...I thought everybody gave really good performances throughout...Linda Blair and Vincet Van Patten standout the most. I enjoyed the background story about the house's history...the house itself was an excellent setting. Character interaction was interesting...it didn't seem like pointless time filler. The killers were alot more scary than most of the slasher villains...plus the fact that they didn't get a lot of screen time which added to the suspense. A very under-rated slasher film. 'Hell Night' and almost any slasher film post 1979 are called 'Halloween' rip-offs...but, remember 'Black Christmas' came out years before 'Halloween'",
         "Overlooked this one when it was released but after seeing the DVD on sale and reading some positive comments on this site decided to part with my cash. Was I disappointed? No. Once you get past the cheesy opening with its gloriously B-movie style credits it turns into one of the more interesting stalk and slash films of the 80's. The set up is simple - 4 frat pledges have to spend the night in a mansion with a sinister past and a killer on the loose... who will survive? Do we care? Well yes, these kids are surprisingly likeable and, by cleverly putting them in pre-20th Century fancy dress in a candle lit house, removes them from the contemporary teen horror genre. The killings are pretty conventional \u0096 decapitation etc.\u0096 but the film then builds up to a tense and exciting final 30 minutes with a few surprises and a brilliantly staged ending. I'm probably over-praising this film somewhat but my expectations were low and my rewards were a decent 6.5/10!",
         "I saw the late night, television version of this movie as a child of 10 and was absolutely terrified. Back then it was perhaps my favorite horror film and I can remember recording it off TV on my Beta VCR. So naturally I thought when I tried the unedited, theatrical version as an adult, that the scares and tension would be gone, only to be replaced by B-movie cheese. Boy was I wrong! Hell Night, much like Friday the 13th and Halloween, is a horror movie that has, for me, stood the test of time. From the creepy setting to the scary villains, and horny, screaming college kids, this one has it all. The acting and characterizations were competent and believable (for a horror movie), with fine performances from all involved. Many of the typical horror clichés and dumb moves by the characters to serve the plot and score more victims were absent here. In fact, most of the characters didn't even realize a psychopath was on the loose until late in the film, when it was really too late. The setting was really milked for all it was worth by the director, with scenes not only throughout the creepy mansion, but a number of them below the house and within the extensive grounds. Some of the blue lighting in the outside sets really lent a spooky, almost supernatural ambiance to several scenes. I can't think of too many flaws here. Some gore hounds have complained about a lack of blood and guts. Did they see the same movie as me? I recall plenty of violent murders. The camera did not linger on them overly, but neither did it quick-cut away instantly like so many films of today. Some of the dialog was cheesy, but I don't have much of a problem with that if the story is good and the characters reactions to their dire predicament are believable. Overall, I found this to be a highly enjoyable, terrifying film experience. Certainly one of the most underrated horror movies.",
         "Group of coed's for pledge night have to spend the night in a manor that local legend says a father went insane and murdered all of his family. The lone survivor, his deformed son, is rumored to be haunting the premises living in the underground tunnels and killing off unwelcomed visitors. Guess what, the legend is true as the coeds start to disappear one by one. Spooky teen slasher builds up a good amount of atmosphere and delivers suspense instead of the usual nudity and gore. It also takes the time to build up characterizations for some of its characters. Linda Blair ( a highly underrated actress) turns in a very appealing, strong & sexy performance and is supported by a better then usual cast, including Peter Barton. The finale is especially exciting. Rated R; Violence.",
         "Linda Blair, everybody's favorite head-tolling girl, stars as an extremely cute college girl named Marti. Together with 3 other students, she's locked overnight in a haunted mansion as some sort of fraternity initiation rite. The house used to be inhabited by a family of weirdoes (figures\u0085) and the deformed son is believed to still dwell around in the tunnels underneath the mansion's basement. While the other fraternity members are playing pranks to increase the eeriness, the real killer comes to interfere\u0085 Of course, you can't really refer to this 'Hell Night' as being a good film. It's an 80's slasher, produced in-between two 'Halloween'-films. The only reason of this film's existence is to raise more money, so you can't be too demanding for plots, logic or credibility. In it's own specific category, this is a more than decent film. I can name you over a thousand similar films that are worse but only a few that are better. It's amazing what a competent director (Tom DeSimone \u0096 specialized in 'Women Behind Bars'-flicks) and a devoted cast (Linda Blair!!) can achieve. There are quite a few suspenseful sequences in Hell Night and the gore is not exploited for once. The settings are decent but sometimes underexposed, which is a bit of a shame. Overall, this a lot more tolerable than the average flick in which teens are slaughtered by the dozen.",
         "Basic Plot = four pledges must spend the night in Garth Manor, twelve years to the day after the previous resident murdered his entire family. Two of the pledges, Marti (Linda Blair, The Exorcist) and Jeff (Peter Barton), ignore the rumours that the now-deserted mansion is haunted by a crazed killer, until one-by-one, members of their group mysteriously disappear. Could this be part of the fraternity prank or is it a demented former tenant seeking revenge? When the seemingly innocent rite of passage turns deadly, these college students will do anything to survive Hell Night.\" Hell Night is a fun way to waste a couple of hours, a definite popcorn flick which isn't a bad thing, the cast are clearly having fun with they're roles, Suki Goodwin, as Denise, is a scream; providing the film's main comedy moments without really grating. She sails through the film on a wave of booze, Quaaludes (whatever happened to those?) and double-ententes. Linda Blair is also as effortlessly likable as you'd imagine, as the slightly tomboyish girl (with the handy mechanic skills). Hell Night never fails to be entertaining,It's the fun early 80's slasher flick - designed for retro thrills, fun scares and popcorn munching. It takes itself seriously enough to stop from descending into self-parody funny to talk about innocence in a film where a bunch of people get carved up in creative ways, but HELL NIGHT is a perfect twilight genre example of the slasher flick before it descended into self parody and rapidly shrinking budgets.",
         "At first glance it seems that Hell Night is just cashing in on the success of proven box office draws, that being, Linda Blair's name from the Exorcist and the slasher genre which was doing so well at the time that Hell Night was made. However for a \"wannabe\" film Hell Night is very well done. The premise of the film is set up nicely and there is enough suspense and cool death scenes to make the film enjoyable. The problem is that after seeing the movie and witnessing the obvious talent behind the camera you realize that Hell Night could have been so much more then it is. Hell Night has several good things going for it, a creepy mansion, creepy tunnels beneath the house and an eerie killer. All three are under used. The mansion and tunnels are rarely seen. The people in the house don't go exploring and when we finally get to see the tunnels, which are mentioned a few times to wet our appetites, we are quickly ushered out of them. The problem here is the film makers focus on realism. Realisticly if you were told to spend a night in a creepy old house would you explore the place? Probably not, ditto for creepy tunnels, especially if you discover evidence of someone/thing living there. Perhaps with a bit more imagination and/or bigger budget the house and tunnels could have been explored a bit more. As it is they are still a good source of suspense. Finally we have the killer. The killer is used quite well and is really eerie looking. The problem is that a couple of interesting things are mentioned and shown about him but we don't learn what exactly is going on (you have to see the movie to know what I mean). It does provide for some interesting conversation after the movie is over but I think the film would have been more enjoyable if questions had been answered. Hell Night is a little slow moving and doesn't keep it's pace going once things start to happen and Linda Blair's acting is atrocious, but that aside Hell Night is a nice addition to the 80's slasher flicks. Good suspense, creepy locations and some nice scares earn Hell Night a 7 out of 10.",
         "This film is everything most slashers are - i.e. redundant, pointless, silly and all the rest of it. However, unlike the majority of the sub-genre; this one isn't all that bad. The plot is hardly original in it's fusion of the haunted house tradition and eighties slasher trash, but at least it gives the film a slight edge over it's less imaginative counterparts. The plot sees a group of four high school 'kids' having to spend a night in a creepy old house as an initiation ceremony for the fraternity they want to join. However, this isn't just a creepy old house and by way of a super-camp story telling sequence, we learn that the master of the house killed himself, his wife and three of his four horribly deformed children. This, of course, means that one survived; and that one, is course, rumoured to still be hanging around the creepy old house. That is, of course, a rumour that turns out be true! What then follows is the usual slasher sort of stuff, with the kids inside getting sliced and diced along with the ones outside, who were just trying to make their new frat-mate's stay a little scarier. Linda Blair, now all grown up since her role in The Exorcist, takes the lead role and does pretty much what you would expect the heroine to do. There's some nice murder sequences in this film, but the gore is never over the top. I actually like over the top gore, but despite not having much of it, it never really harms this film. The murders are stylishly shot, and the way it portrays them allows it to be shocking without the need for a lot of bloodshed. In a sub-genre that is primarily concerned with bloodletting; this is actually quite admirable. The sets are one of the best things about this film. The Gothic mansion gives it that great atmosphere that is usually reserved for haunted house movies. The movie doesn't always make best use of it's settings, however, with too many scenes being restricted to close-up's when a shot that takes in more of the surrounding area would have been better. The fact that the killer is deformed gives it a bit of an edge over the likes of Halloween because aside from there being a killer, you also want to see him to find out how badly deformed he is. It is a disappointment when he's finally revealed...but the wait holds some suspense. On the whole, this isn't all that good; but it's not bad either. Slasher fans will find something to like.",
         "- As part of their initiation, two fraternity pledges and two sorority pledges must spend the night in creepy old Garth Manor. Before entering the house, the pledges are told the story of the Garth family - twelve years ago, old man Garth murdered his whole deformed family before taking his own life. However, some say that at least one member of the Garth clan survived. During the night, some of the other fraternity and sorority members try to scare the four pledges locked in the spooky mansion. But when people start turning up dead, it's obvious that this is no college prank. - For the most part, Hell Night is a standard 80s slasher. A group of young people in an isolated location are picked-off one at a time until only the end girl is left alive. I don't think this is much of a spoiler because most anyone could guess who is going to be left alive at the end of the movie. In fact, it's easy to predict with a fair amount of accuracy the order these people are going to die. The murders aren't extremely violent and some are left to the viewer's imagination. This was probably the result of budget constraints more than anything. The killers' make-up is bargain basement and not nearly as effective as some of the other movies of the period. Some of the acting is terrible and Vincent Van Patten is extremely annoying. - So, if the movie is predictable with poor special effects and acting, why haven't I rated Hell Night any lower? Other than those areas I've mentioned, the movie is reasonably well made. The house is fantastic and almost outshines any of the humans in the cast. Secret passages and long, dark corridors always make for fun in this kind of movie. Hell Night would have actually benefited had more emphasis been placed on the house. The movie is at worst competently directed by DeSimone. He does an above average job of creating atmosphere and creepy moments. And, on a personal level, I always enjoy Linda Blair in just about anything she does. - While it will never be known as a great movie, you could do far worse with a teen slasher than watching Hell Night."
      ],
      "genres": [
         "Horror",
         "Thriller"
      ],
      "productionCompanies": [
         "BLT Productions",
         "Media Home Entertainment"
      ],
      "summaries": [
         "Before being able to join Alpha Sigma Rho fraternity and its sister sorority, four pledges must spend the night in Garth Manor, twelve years to the day after the previous resident murdered his entire family. Some, however, say that one member of the Garth family survived, and still resides somewhere in the now-deserted mansion.",
         "Four college pledges are forced to spend the night in a deserted old mansion where they get killed off one by one by the monstrous surviving members of a family massacre years earlier for trespassing on their living grounds."
      ],
      "budget": 0
   },
   "movielensId": 2878,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1981-08-28",
      "dvdReleaseDate": "1999-09-14",
      "directors": ["Tom DeSimone"],
      "runtime": 101,
      "movieId": 2878,
      "title": "Hell Night",
      "mpaa": "R",
      "actors": [
         "Linda Blair",
         "Vince Van Patten",
         "Peter Barton",
         "Suki Goodwin",
         "Kevin Brophy",
         "Jenny Neumann",
         "Jimmy Sturtevant"
      ],
      "imdbMovieId": "0082511",
      "originalTitle": "Hell Night",
      "genres": ["Horror"],
      "youtubeTrailerIds": ["jrzWXF5SUm8"],
      "plotSummary": "Four college pledges are forced to spend the night in a deserted old mansion where they get killed off one by one by the monstrous surviving members of a family massacre years earlier for trespassing on their living grounds.",
      "tmdbMovieId": 28377,
      "avgRating": 2.24887,
      "releaseYear": "1981",
      "numRatings": 221,
      "posterPath": "/3HoLXaoobRVNhUQevJJWSO4GkGN.jpg"
   }
}