{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "africa",
            "id": 409
         },
         {
            "name": "sword",
            "id": 1938
         },
         {
            "name": "auction",
            "id": 2096
         }
      ],
      "imdb_id": "tt0091431",
      "video": false,
      "title": "Armour of God",
      "recommendations": [
         10975,
         10753,
         21519,
         11205,
         9056,
         11198,
         21521,
         11134,
         11230,
         11537,
         19274,
         9404,
         18764,
         18666,
         21733,
         25539,
         16407,
         12207,
         10044,
         45408
      ],
      "backdrop_path": "/9CYK4p29AlWMBcSSvQKIsjaXLKg.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Jackie Condor",
               "gender": 2,
               "credit_id": "52fe43db9251416c75020bff",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Alan",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c0f",
               "name": "Alan Tam",
               "profile_path": "/kq4eyPidlylCo2Oj88BoaihvFUK.jpg",
               "id": 67689,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Lorelei",
               "gender": 1,
               "credit_id": "52fe43db9251416c75020c13",
               "name": "Rosamund Kwan",
               "profile_path": "/sBNdUQgnvxu7PalhhONzmp5igSI.jpg",
               "id": 65987,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "May",
               "gender": 1,
               "credit_id": "52fe43db9251416c75020c17",
               "name": "Lola Forner",
               "profile_path": "/yzJG2AGWunljqw37UwOLGo0KOqA.jpg",
               "id": 67690,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Bannon",
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c4b",
               "name": "Božidar Smiljanić",
               "profile_path": "/nf8eG6PxylON7ifqjRZlPWvtlSf.jpg",
               "id": 235781,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Grand Wizard",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c4f",
               "name": "Ken Boyle",
               "profile_path": "/tc0kk0wU2C6YelwaCx6d9tKKuV5.jpg",
               "id": 126047,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Chief Lama",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c53",
               "name": "John Ladalski",
               "profile_path": "/ebYMvQGuFDXVbcUyxUhllRXknGD.jpg",
               "id": 126037,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Witch Doctor",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c57",
               "name": "Robert O'Brien",
               "profile_path": null,
               "id": 208229,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Fighter",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c5b",
               "name": "Marcia Chisholm",
               "profile_path": null,
               "id": 1084463,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Man at Auction",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c5f",
               "name": "Boris Gregoric",
               "profile_path": null,
               "id": 1084464,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Fighter",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c63",
               "name": "Alicia Shonte",
               "profile_path": null,
               "id": 1084465,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Fighter",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c67",
               "name": "Vivian Wickliffe",
               "profile_path": null,
               "id": 1084466,
               "order": 11
            },
            {
               "cast_id": 23,
               "character": "Fighter",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c6b",
               "name": "Stephanie Evans",
               "profile_path": null,
               "id": 1084467,
               "order": 12
            },
            {
               "cast_id": 24,
               "character": "Fighter",
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c6f",
               "name": "Linda Denley",
               "profile_path": null,
               "id": 1084468,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c05",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c0b",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c1d",
               "name": "Eric Tsang",
               "profile_path": "/xJJZEKanRVgB7u5G3Fg7Xj9Fuoz.jpg",
               "id": 26724,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c23",
               "name": "John Sheppard",
               "profile_path": null,
               "id": 31901,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c29",
               "name": "Edward Tang",
               "profile_path": null,
               "id": 46318,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c2f",
               "name": "Chua Lam",
               "profile_path": null,
               "id": 64903,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c35",
               "name": "Leonard Ho",
               "profile_path": null,
               "id": 62416,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c3b",
               "name": "Michael Wandmacher",
               "profile_path": null,
               "id": 60102,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43db9251416c75020c41",
               "name": "Bob Thompson",
               "profile_path": null,
               "id": 67691,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43db9251416c75020c47",
               "name": "Arthur Wong",
               "profile_path": null,
               "id": 26731,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54242bc9c3a3681eca002274",
               "name": "Peter Ngor Chi-Kwan",
               "profile_path": "/u2kExDJEmwDieZ5gJiZZFmrOZCl.jpg",
               "id": 235189,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "5a0d1589c3a36812ef006fb1",
               "name": "Cheung Yiu-Jo",
               "profile_path": null,
               "id": 1417165,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 10.561935,
      "production_countries": [
         {
            "iso_3166_1": "HK",
            "name": "Hong Kong"
         },
         {
            "iso_3166_1": "HR",
            "name": "Croatia"
         }
      ],
      "id": 10974,
      "vote_count": 138,
      "budget": 15000000,
      "overview": "Jackie Chan stars as Asian Hawk, an Indiana Jones-style adventurer looking to make a fortune in exotic antiquities. After Hawk discovers a mysterious sword in Africa, a band of Satan-worshipping monks kidnap his ex-girlfriend Lorelei, demanding the sword as ransom as well as other pieces of the legendary Armour of God - a magical outfit dating back to the Crusades.",
      "similar": [
         9732,
         11430,
         10527,
         7350,
         11253,
         1865,
         2454,
         879,
         411,
         9273,
         24,
         37430,
         274857,
         258489,
         616,
         630,
         1735,
         346672,
         284054,
         8009
      ],
      "original_title": "龍兄虎弟",
      "runtime": 88,
      "poster_path": "/AjgHw0FH8DwjB3fL6EWAxl02wgG.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Jadran Film",
            "id": 168,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Golden Harvest Company",
            "id": 2521,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Golden Way Films Ltd.",
            "id": 3054,
            "origin_country": ""
         }
      ],
      "release_date": "1986-08-16",
      "vote_average": 6.8,
      "belongs_to_collection": {
         "backdrop_path": "/rXGl1WJINCV2yFOikNBqYvdyeAn.jpg",
         "name": "Armour of God Collection",
         "id": 146136,
         "poster_path": "/amUwRtyJEiYyGPlbOFJBqAnM5mk.jpg"
      },
      "tagline": "Jackie Chan in his greatest adventure ever!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": [
         "Jackie Chan",
         "Eric Tsang"
      ],
      "runtime": 87,
      "synopsis": null,
      "writers": [
         "Barry Wong",
         "Edward Tang"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0091431/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTIyMjgwMTE3OF5BMl5BanBnXkFtZTcwNjQ1MzMyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jackie Chan, Alan Tam, Rosamund Kwan | See full cast and crew »"],
      "reviews": [
         "This is one of Jackie Chan's best films. A good display of his acrobatics and fight skills at the beginning of the film to fighting 4 woman with high heels at the end. This was my first Jackie Chan film I saw that made me watch his other films. The basic story is that an evil cult who wants all 5 pieces of the armor of god(I can't remember why they want it) knows only one person who is able to get the pieces, the \"asian hawk\"(Chan). They only have 2 pieces of the armour and to get Jackie to get the other 3 pieces, they kidnap his former girlfriend, lorelei(Kwan) who he still has feelings for, even though his best friend,Alan(tam) is dating her. Jackie and Alan must work together to try and find the armour and save her. I recommend watching the original 94min version in Chinese(with english subtitles of course) than the u.s. english dubbed 86min version. Also this movie is where Jackie nearly died - Jumping to a tree on which the branch broke and fell onto a rock. A good humoreous martial art film with alright fight scenes and a not bad plot. 8/10 for me. Recommended mainly for Jackie chan fans.",
         "This movie was actually made before \"Operation: Condor.\" For some reason, they titled this movie as if it were a sequel. When Jackie decided to make this movie, he was being greatly influenced by the smash hit \"Raiders of the Lost Ark,\" and wanted to make a movie in that adventure style. This movie could have been really, really great if it had been made entirely the way Jackie had it envisioned at the start of production. The movie has a great beginning, and then it is destroyed by an agonizing slow middle, and then it picks up again with an action packed ending. The reason the movie has that horrible middle is because of the stunt that went wrong at the beginning of the film. As all Jackie fans know, this is the film that almost killed Chan. In the beginning action sequence, he does this awesome chase scene where he is bounding across the walls of a castle. In the first take, Jackie actually made it across. But being a perfectionist, he tried for a second take. The first take partially broke the branch of the tree he jumps on, and on the second take, the branch broke completely, sending Jackie crashing to the ground and busting his head on a rock. I am mentioning all this because this is the reason the middle of the movie is so slow. Production could only be halted for a short time. They could not wait until Jackie had fully recovered. So, as soon as he was able to get out of bed, they re-wrote the middle part of the movie to exclude all the eye-popping stunts that Jackie had originally planned. They continued filming this lame, muddled attempt at a romance plot until Jackie was more healed. Once Jackie was back to 100 percent, they started filming the movie the way they had originally intended: with amazing stunts and incredible action choreography. The end of the movie picks up with Jackie, his side kick, and the love interest, infiltrating a castle run by monks, and they try to steal a treasure guarded by fiesty amazon women who wear lots of '80s style makeup. As ridiculous as that all sounds, the fight scenes at the end are among the best that Jackie has ever done. Its really amazing and a lot of fun to watch just for the choreography aspect. Check out one of the hardest hits I have ever seen, when one of the amazons comes flying at Jackie from about 8 feet in the air, he kicks her in mid flight, and she spins completely around and slams HEAD FIRST in to the dirt! I don't care if there was a stunt pad there, it is a HARD LANDING! OUCH! There is no way the stunt person walked away from that unharmed. The second movie \"OPERATION CONDOR\" was a lot better as a whole. That is one of my all time favorite Jackie Chan films, and I still watch it over and over again. But PART 2 (the first of the films) is definitely a must-see (despite the confusing title). My recommendation is this: Get the movie, watch the first part until he escapes from the natives, then FAST FORWARD through the entire middle, DO NOT BOTHER to watch it, it is totally irrelevant, and start watching again as they infiltrate the castle. You wont be sorry. Don't believe all the other bad reviews about this film.",
         "First let me say there are two English dubbed versions of this movie. The first version is a faithful translation of the original complete with all the original scenes. Overall the first version is actually more exciting because of the music - the music makes all the actions scenes more heart-pounding and is an excellent example of how sound can affect a scene. I found the current US-released English version less of an adrenaline rush because of the droll music in the action scenes. Furthermore, I found the original English-dubbed version much funnier. There's something charming about the original text - Jackie is actually more arrogant and aloof in the original version, and it helped create a more exciting \"mercenary\" feel to Jackie's character, rather than the more confusing humanitarian/treasure-hunter feel to the new version. Jackie treats Alan Tam's character more harshly and with some funny sarcastic comebacks. In the new version, the witty come-backs were replaced with patient words! Lastly, the most notable change in the new version is the entire \"Lorelei wants the armour in the house\" scene is entirely missing. In the original version, May goes to Jackie's room to look at his baby pictures (Jackie asks May to look at them to get out of the situation where he and Alan were caught in May's bedroom), and both of them are shocked to see Lorelei on his bed. May storms off in disgust. Meanwhile Lorelei goes into the bathroom to prepare the serum, and Alan walks into the bedroom. Jackie has to cover Lorelei and lies to Alan that it is May that is in the bathroom. Both Jackie and Alan go out into the hall and bump into May, and Jackie has to cover his tracks by pretending that Alan knows that Lorelei is in Jackie's bedroom. Naturally May responds with disgust that \"they are such good friends that they share everything, even girlfriends\". Then Alan gets suspicious because May was in the hall not the bathroom, he goes into Jackie's bedroom to see if the bathroom is connected to May's bedroom, and then gets jabbed by Lorelei (which is where the new version cuts back in). The new version is a more streamlined version, and certainly the story flows better. There is actually a romance between May and Jackie which I prefer, whereas in the original version May remains angry with Jackie after she slaps him and they never get past that stage - especially after she gets the impression that Jackie \"shares\" Lorelei with Alan! I was really disappointed, because I had the original English-dubbed version and it was one of my all-time favourite Jackie Chan movies because of Jackie's arrogant character which was a huge departure from the usual benevolent roles that Jackie plays, and because of the music which really made the difference in the action scenes for me. Alas, my original version was a video tape that grew fungus and was therefore ruined - and I have no idea how to get that version again! Jackie's voice in the original English version was dubbed by someone else (the same person that dubbed the English versions for all his movies in the 80s) - and it sounds a lot better than Jackie's real voice which he uses in the new version. Funny thing is the voices actually sound alike sans accent.",
         "This was the first Jackie Chan film I ever saw, and I loved every second of it. The film, which doesn't concentrate on plot as much as it probably should do, revolves around some European monks who steal several pieces from the Armour Of God, and fools Jackie into giving them the other pieces. But ignore the plot, watch this for the excellent jokes, the amazing set piece action sequences topped off by the credible Jackie Chan. Several scenes stand out the most. One being the scene where he is faced with 4 amazon women, and Jackie must defeat them all. Overall, if you want to see a damn good Jackie Chan flick, but aren't interested in plot then you I urge you to see this film.",
         "This is Jackie's version of Indiana Jones. And you know what, I like this one better. It is also the film that nearly killed Jackie, even though the stunt he was doing was a fairly simple one. I really enjoy this movie and charish it because it could have been Jackie's last. Its plot doesn't really matter, because as with all Jackie movies, we are seeing it for amazing action and hilarious comedy. This has both, but im lesser doses. It is almost like a romantic comedy, because it deals with a love triangle between Jackie and two of his former band-mates(he used to be in a band called The Losers, with some girl and Alan Tam). This film is all in good fun, but it doesnt reach the level of martial-arts greatness that Drunken Master 2 or Project A do. Still, check this one out, its really good.",
         "I really enjoyed this movie not just for the spectacular stunts but also the chemistry between Jackie Chan and Alan Tam. It's one of Jackie's most accessible Hong Kong films although it does sag a bit in the middle this is due to a severe accident Jackie had on set during the opening chase sequence. Filming couldn't be halted for long due to budget constraints so a lot of stunt sequences were dropped and more emphasis placed on the comedy (which is hit and miss in places). There are some incredible sequences at the start (an action packed chase)and at the end of the film (infiltrating the enemy base and a crazy escape plan). In between is some so/so comedy romance moments, the interplay between Jackie and Alan works really well at times producing some great comedy moments Alan's unwillingness to fight and his clumsiness when he does so really add to Jackies clowning. The bad guys are a bit of a letdown other than some supposedly female body guards who look like rejects from the Rocky Horror Show which produces an inventive and painful looking fight scene. The monks are fairly inept and it must be said what was really needed is a big boss at the end for Jackie to fight but other than these small complaint its a very enjoyable action flick. Well worth a watch great action with a bit of comedy thrown in for good measure 8/10",
         "This is the film that nearly cost Jackie Chan his life: an early stunt went terribly wrong and he ended up bashing his head hard on a rock. In order to allow Jackie to fully recover from his injuries, much of the planned action was replaced with romantic comedy, and the film unfortunately suffers for it. The result is a fairly enjoyable romp, which starts and ends with some great sequences, but drags rather badly in the middle. Chan plays The Asian Hawk, an adventurer who risks his life to help old pal Alan when his girlfriend Lorelei (Rosamund Kwan) is kidnapped by a religious cult. The cult wish to exchange the girl for a valuable treasure, the fabled Armour of God, but Jackie and Alan attempt a daring rescue instead... Kicking off with a spectacular opening sequence, which sees JC performing some impressive acrobatics before sliding down a steep hill pursued by a tribe of spear wielding natives, Armour of God certainly begins well. And a great car chase soon after makes one believe that they could be witnessing a 'solid-gold' Chan classic. However, after these initial blasts of action, it isn't until the end of the film that we get to see more breathtaking movie mayhem, with the middle section consisting of barely passable comedy and poor romantic subplots. Fortunately, Chan is back on form for the final battle in a cavernous fortress, and we get to see some truly outstanding martial arts as he takes on scores of nasty monks, and, in the film's highlight, a quartet of leather-corset-wearing she-bitches. The action here is hard-hitting and well worth the wait, with loads of poor baddies on the receiving end of some very painful looking kicks and punches. To top it all off, the movie ends with one of the phoniest looking stunts ever, as Chan supposedly leaps off a cliff onto a hot air balloon�a moment so poorly executed that it borders on brilliance. It's a real shame that this film could not be made as it was originally intended, 'cos it might have been truly astounding. As it is, Armour of God is worth seeing�just don't expect to be fully entertained for the whole of its duration.",
         "Long Xiong Hu Di (original title) or ¨Armour of God¨ is a Chinese/Yugoslavia co-production with plenty of action , humor , lots of cool, Jackie style action , being filmed in Croacia and one of Jackie's best . Jackie Chan in his greatest adventure ever ! Jackie Chan and his bumbling sidekick (Tam) are sent on a quest through Europe to find a mysterious treasure held by a shadowy organization of monks . Here Jackie is a ex-member or a musical band , in fact , the musical sequence with the band \"The Losers\" is a spoof of the Hong Kong rock band \"The Wynners\" (they include Alan Tam, Anthony Chan, and Kenny Bee, all three appear in the movie). This Raymond Chow-Golden Harvest production deals with an adventurer , Indiana Jones-alike , and his partner , as two friends attempt to save the damsel in distress (Rosamund Kwan) , meanwhile they face off an evil cult . The pair join forces with the millionaire's daughter (Lola Forner who formerly acted in ¨Wheels and meals¨ or ¨Supercamorristas¨) . Jackie Chan plays an ex-singer-turned-fortune-hunter, whose ex-sweetheart is abducted by a sinister organization . An old friend of Jackie's, turns to him for help to rescue his lover ; they along with a female companion in tow set out in pursuit the nasties . Entertainment , comedy and amusement abound , culminating with a spectacular attack in the hideout fortress of the nasty band led by a monk and his evil thugs along with various leather-clad women. Chinese action comedy full of over-the-top struggles , thrills , ingenious stunts , laughs , slapstick , tongue-in-cheek and excitement . Here Chan plays an Indian Jones-style explorer who must find legendary suit of armour to rescue his ex-fiancée from a sect . This bemusing movie is packed with adventure , car pursuits , intrigue , unstopped action , overwhelming stunt-work and lots of fights but with abundant humor . Jackie Chan is top notch as one army man fighting a group of heinous villains and as always he makes his own stunts like is well showed , though also contains numerous obviously cheated stunts . While filming the stunt where he leaps from a wall onto a tree, the branch Jackie Chan grabbed a hold of broke and he hit his head on a rock, nearly killing him and leaving him with a permanent thimble-sized hole on the right side of his head , the fall also left him hard of hearing in one ear . Watch the outtakes at the final to see the mishap that nearly wounded Chan . Awesome , incredible stunts and brief comic touches , as usual ; the picture is better constructed than Chan's predecessors films , including an ending battle in a cave is a knockout . The lighting-paced storyline slows down at times , marred by extremely silly spots , but frantic action sequences make up for it . Spotlights movie include spectacular brawls , car chases including bounds and leaps , impressive and interminable fights , a breathtaking final struggle between Jackie Chan and several monks and warrior women ; in addition other fine action sequences in overwhelming style . This is an acceptable action movie distinguished by nicely cinematography of the spectacular sequences , and contains agreeable sense of humor as well as previous entries . Jackie Chan usually forms couple to notorious actresses as Maggie Chung and Michelle Yeoh and this time to Rosamund Kwan . This is a passable action movie distinguished by fight sequences , noisy action and packs silly sense of humor as well as Jackie's subsequent entries . This was the first of the Operation Condor movies, but was entitled Operation Condor 2 because it was released in the U.S. after the second film . The second part titled ¨Armour of God : Operation Condor¨ in which sends Chan off to Europe and Africa in search of enormous Nazi gold cache . The picture achieved enough success in China and around the world . However , Jackie Chan's failed at Box-office in his American debut ,¨Battle creek brawl¨ . Chan is a hard-working actor and director throughout his long and varied career . Jackie usually teams up to prestigious Chinese actor Sammo Hung , a fine action star in their own right and also had an American career as successful ¨Martial Law¨ TV series . Both of them starred together several films as ¨Heart of Dragon (1985)¨ which was directed by Sammo . Chan pays overt homage to two of his greatest influences as Charles Chaplin and Harold Lloyd . Jackie went on playing ¨Cannoball¨ , ¨The protector¨ and \"Rumble in the Bronx\", until getting all American success with ¨Shangai Knights¨ , ¨The tuxedo¨ , ¨Around the world in 80 days¨ and ¨Rush hour¨ trilogy , and the recent ¨Karate kid¨. Of course , his biggest hits were ¨The Police story¨ series that won the Golden Horse Award, a Chinese version of the Oscar , the first was titled ¨Police story(1985)¨ directed by the same Chan , it was a perfect action film for enthusiast of the genre ; the following was ¨Police story 2(1988)¨ also pretty violent and with abundant humor touches . It's followed by ¨Supercop¨ or ¨Police story 3¨ and finally , ¨Police story IV : Crime story¨ . The picture was well produced by the great Asian producers Raymond Chow and Golden Harvest production and compellingly directed by Jackie Chan . Rating : Acceptable and passable , the picture has its sensational moments here and there , but also with abundant humor touches mostly provided by its agile star , super Jackie Chan . It's a perfect action film for enthusiast of the genre , being filled with great struggles , stunts and spectacular battles .",
         "�� Ahahahaha! Armour of God is one of the silliest movies I ever had to pleasure of watching. Where else will you see Chinese people in tight 70s suits with 80s hair and eyes wide open as if trying not to be Asian as well as machine gun wielding monks? Early in the movie there is a shootout scene and it is an absolutely amazing piece of work. A bunch of monks gun down a lot of people while a cheesy 80s pop song is being sang in the background and they do the killing in a choreographed manner, loosely to the beat of the song. Oh you have to see it, it is glorious. And all of that unnecessary effort is only to kidnap someone in order to make the main character do something for them that they do not want to pay for. That's the premise, people. And this goody light-headedness is how the whole story is treated. Of course many people watch Jacky Chan for the acrobatics and yes, the fight choreography as well as various driving stunts are very good. The characters travel to a lot of different places and it is fun to travel with them. The visuals are memorable. The things worth liking about this movie, besides the silly antics of Jacky Chan, are rather superficial and depend a lot on the viewer's taste. The main female lead, played by Lora Forner, is very pretty, possibly the prettiest actress I have seen on film except for Zeta-Jones. The car Jacky Chan drives looks cool and has gadgets. Finally, the song when the credits start rolling is pretty good, in a typical cheesy 80s kind of way (you have to get the right version of the film as there are several versions of the credits song). All of the above things combined with the silly overacting and violence makes this a movie for kids, which is why it has taken a special place in many young men's hearts, at least in the East (Russia specifically). Think about it, the makers are almost going down a checklist: hot chick, fast car, violence, adventure, jumping around and silly acting with slapstick � all the things boys are into. The dialogue can be really poor. Of course, there is always a possibility that it the subtitles are just bad and it works better in Cantonese, which is the language the movie is in, but I doubt it because the writing is just too shallow and the acting that accompanies it is just too silly and physical. The acting�gosh. Jacky Chan tries, but sometimes he fails. Alan Tam, who plays a singer, and is a singer in real life, is a much better actor in this. He overacts, but it works, and it is to him that we owe the catchy though cheesy tunes in this movie. I feel like I like this movie for all the wrong reasons, but I still like it.",
         "Jackie Chan is a master of two things: comedy and Martial Arts. However, with \"Armour of God,\" he displays another talent alongside those two: directing. \"Armour of God\" was released back in 1986, during the golden age of action films. It pays a lot of tribute to the \"Indiana Jones\" series, \"Temple of Doom\" in particular. The story revolves around a treasure hunter known as Asian Hawk, played by Chan. He is on a quest to recover the Armour of God from an evil cult and rescue a young woman they kidnapped. Chan does a great job, showcasing his comedic and Martial Arts talents. He does a fine job directing as well. The stunt-work is top-notch (interesting side-note, Chan came close to death in a routine stunt). A definite highlight is the car-chase, being one of the best I have ever seen. The supporting cast is good overall as well. Comedy is added seamlessly, making the film one of Chan's funniest. For fans of action, this is a film definitely worth seeing."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Comedy"
      ],
      "productionCompanies": [
         "Golden Harvest Company",
         "Golden Way Films Ltd.",
         "Jadran Film"
      ],
      "summaries": [
         "Jackie Chan plays an ex-singer-turned-fortune-hunter, who's ex-girlfriend is kidnapped by an evil cult. Her finace, an old friend of Jackie's, turns to him for help - as the kidnappers intended... lots of cooool, Jackie style action and laughs.",
         "Jackie Chan and his bumbling sidekick are sent on a quest through Europe to find a mysterious treasure held by a shadowy organization of monks."
      ],
      "budget": 15000000
   },
   "movielensId": 2880,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "1986-08-16",
      "dvdReleaseDate": "1999-09-21",
      "directors": [
         "Jackie Chan",
         "Eric Tsang"
      ],
      "runtime": 88,
      "movieId": 2880,
      "title": "Armour of God",
      "mpaa": null,
      "actors": [
         "Jackie Chan",
         "Alan Tam",
         "Rosamund Kwan",
         "Lola Forner",
         "Božidar Smiljanić",
         "Ken Boyle",
         "John Ladalski",
         "Robert O'Brien",
         "Marcia Chisholm",
         "Boris Gregoric",
         "Alicia Shonte",
         "Vivian Wickliffe",
         "Stephanie Evans",
         "Linda Denley"
      ],
      "imdbMovieId": "0091431",
      "originalTitle": "龍兄虎弟",
      "genres": [
         "Adventure",
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": ["gAJgFn0yCHo"],
      "plotSummary": "Jackie Chan stars as Asian Hawk, an Indiana Jones-style adventurer looking to make a fortune in exotic antiquities. After Hawk discovers a mysterious sword in Africa, a band of Satan-worshipping monks kidnap his ex-girlfriend Lorelei, demanding the sword as ransom as well as other pieces of the legendary Armour of God - a magical outfit dating back to the Crusades.",
      "tmdbMovieId": 10974,
      "avgRating": 3.29004,
      "releaseYear": "1986",
      "numRatings": 562,
      "posterPath": "/AjgHw0FH8DwjB3fL6EWAxl02wgG.jpg"
   }
}