{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0140397",
      "video": false,
      "title": "Mumford",
      "recommendations": [
         38554,
         45675,
         52654,
         15513,
         39140,
         24073,
         27141,
         31220,
         83489,
         30653,
         14578,
         25872,
         18451,
         18074,
         22625,
         46737,
         76297,
         61410,
         40562,
         41779
      ],
      "backdrop_path": "/twcTqKRiAlK6g8CVKHQGOnmxkti.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Mumford",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c0f",
               "name": "Loren Dean",
               "profile_path": "/7qYin1jdiWuuFobjlacatyojqds.jpg",
               "id": 11628,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Sofie Crisp",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c13",
               "name": "Hope Davis",
               "profile_path": "/m1RBUwfxms0o4PAOaHYaGT0DpAj.jpg",
               "id": 15250,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Skip Skipperton",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c17",
               "name": "Jason Lee",
               "profile_path": "/67wSoVHxlOqtRhh3KJFBYf2qrDJ.jpg",
               "id": 11662,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lily",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c1b",
               "name": "Alfre Woodard",
               "profile_path": "/aCAjUOrV2WG3OaLUvQHVkyk8S2P.jpg",
               "id": 1981,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Nessa Watkins",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c1f",
               "name": "Zooey Deschanel",
               "profile_path": "/6JL7CD40ylCcqirCetEcsFNmU44.jpg",
               "id": 11664,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Althea Brockett",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c23",
               "name": "Mary McDonnell",
               "profile_path": "/4NcE9BcnLB3oWns51r9peH8GhN8.jpg",
               "id": 1581,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Henry Follett",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c27",
               "name": "Pruitt Taylor Vince",
               "profile_path": "/p3xmcGJ7IKCxw42lwQbg4WmwPTA.jpg",
               "id": 3201,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Lionel Dillard",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c2b",
               "name": "Martin Short",
               "profile_path": "/oZQorXBjTxrdkTJFpoDwOcQ91ji.jpg",
               "id": 519,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Dr. Ernest Delbanco",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c2f",
               "name": "David Paymer",
               "profile_path": "/rrI6LgFb1la4PCIYuTB7pjIGgut.jpg",
               "id": 19839,
               "order": 8
            },
            {
               "cast_id": 12,
               "character": "Dr. Phyllis Sheeler",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c33",
               "name": "Jane Adams",
               "profile_path": "/HbQfL01xmV1psnh0WvldIBzDg3.jpg",
               "id": 209,
               "order": 9
            },
            {
               "cast_id": 13,
               "character": "Mrs. Crisp",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c37",
               "name": "Dana Ivey",
               "profile_path": "/12mxrB5iT1TAwCzIZvmcFGLBQ52.jpg",
               "id": 13314,
               "order": 10
            },
            {
               "cast_id": 14,
               "character": "Mr. Crisp",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c3b",
               "name": "Kevin Tighe",
               "profile_path": "/5Q1Z89xsrnLdQWdHLuiaraS89vV.jpg",
               "id": 17770,
               "order": 11
            },
            {
               "cast_id": 15,
               "character": "Jeremy Brockett",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c3f",
               "name": "Ted Danson",
               "profile_path": "/wWm9eDLuPDw29R76KAjg6gIE9dS.jpg",
               "id": 12836,
               "order": 12
            },
            {
               "cast_id": 16,
               "character": "Katie Brockett",
               "gender": 1,
               "credit_id": "52fe4480c3a368484e026c43",
               "name": "Elisabeth Moss",
               "profile_path": "/iSp2t9GYUUgyqTpz25J6hOHH2An.jpg",
               "id": 32798,
               "order": 13
            },
            {
               "cast_id": 17,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c47",
               "name": "Robert Stack",
               "profile_path": "/f1MchlCMVc4LDWEALsodZHPkbIu.jpg",
               "id": 2493,
               "order": 14
            },
            {
               "cast_id": 18,
               "character": "Martin Brockett",
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c4b",
               "name": "Jason Ritter",
               "profile_path": "/tbhsO6zfHVTzDnGzkHhtBPI3OBp.jpg",
               "id": 50095,
               "order": 15
            },
            {
               "cast_id": 30,
               "character": "Newcomer",
               "gender": 2,
               "credit_id": "5a4b3e260e0a262dbb0232f8",
               "name": "Holt McCallany",
               "profile_path": "/5Mw4StSwWwTLyBapXz9nOg7iUl5.jpg",
               "id": 7497,
               "order": 16
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c05",
               "name": "Lawrence Kasdan",
               "profile_path": "/pBAB9NAMRhL2IBYcgLu6P1CdXbW.jpg",
               "id": 8844,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4480c3a368484e026c0b",
               "name": "Lawrence Kasdan",
               "profile_path": "/pBAB9NAMRhL2IBYcgLu6P1CdXbW.jpg",
               "id": 8844,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4480c3a368484e026c51",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "584dc1a392514118f000261c",
               "name": "Stephen P. Dunn",
               "profile_path": null,
               "id": 1193336,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "584dc1be92514118e700250e",
               "name": "Linda Goldstein Knowlton",
               "profile_path": null,
               "id": 1033793,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "584dc1d192514118e00024a8",
               "name": "Jon Hutman",
               "profile_path": null,
               "id": 2243,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "584dc1e492514118e7002536",
               "name": "Lawrence Kasdan",
               "profile_path": "/pBAB9NAMRhL2IBYcgLu6P1CdXbW.jpg",
               "id": 8844,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "584dc1f392514118e90025b3",
               "name": "Charles Okun",
               "profile_path": null,
               "id": 16329,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "584dc203c3a3683224002a05",
               "name": "James Newton Howard",
               "profile_path": "/5UTEMYS7rydwe7ooOmj2dLRFuu2.jpg",
               "id": 1213,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "584dc21f92514118e40026c8",
               "name": "Ericson Core",
               "profile_path": null,
               "id": 21673,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "584dc22e92514118f00026a1",
               "name": "Carol Littleton",
               "profile_path": "/wsQP1noRhkMRujRJ3uVntLXSFLf.jpg",
               "id": 9966,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "584dc27a92514118e70025d4",
               "name": "William Steinkamp",
               "profile_path": null,
               "id": 2241,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.459257,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 24071,
      "vote_count": 34,
      "budget": 0,
      "overview": "In the small town of Mumford, a psychologist of the same name moves in and quickly becomes very popular, despite a questionable past.",
      "similar": [],
      "original_title": "Mumford",
      "runtime": 112,
      "poster_path": "/7h3EpKEOGs1UBw5GyIi22ilXOIj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/ou5BUbtulr6tIt699q6xJiEQTR9.png",
         "name": "Touchstone Pictures",
         "id": 9195,
         "origin_country": ""
      }],
      "release_date": "1999-09-24",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "Some towns have all the fun.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": ["Lawrence Kasdan"],
      "runtime": 112,
      "synopsis": null,
      "writers": ["Lawrence Kasdan"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0140397/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MzExMDU1Ml5BMl5BanBnXkFtZTcwMzg3MzkyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Loren Dean, Hope Davis, Jason Lee | See full cast and crew »"],
      "reviews": [
         "Lawrence Kasdan has never been known for his comedy, per-say. He is perhaps best known as the screen writer on the best Raiders of the Lost Ark and The Empire Strikes Back, as well as his own The Big Chill. Mumford may be the most representative of his talents. It is widely agreed that Kasdan was brought into the Star Wars and Indiana Jones movies to add a bit of humor to the films. This is most noticeable in the change from Raiders of the Lost Ark to the Temple of Doom, as 'Temple' is not nearly as enjoyable as Raiders, as it is missing much of the wit that has become a tired action cliché of late. Kasden has some of the back and forth in this movie, with smart responses that make you smirk. But most of the movie centers around the plot, which is about a man named Mumford that no one seems to know much about but everyone talks to. Throughout the film Mumford helps his patients realize what they need, which seems to be their only problem. Occasionally he takes an active role, but often all he does is listen. Loren Dean plays the role with a carefree attitude that wouldn't work in most films but fits right on the money here. His indifference makes him the perfect person to talk to. The supporting cast, especially Hope Davis, Alfre Woodard, Jason Lee and Mary McDonnell are outstanding, although a lot of attention was paid to casting, and you can tell. Everyone seems to fit their role well. Mumford doesn't have gut-busting laughter or moments of pure hilarity, it rather trucks along in a more traditional idea of comedy, and send-back to the old days of comedy when people cared about atmosphere and character. The biggest achievement of this movie is that nothing is said to take you out of the feeling that you are watching real people, which is a hard thing in comedy these days. The movie doesn't make a huge impact, and, if I weren't so in love with it, it would be quite forgettable, as it probably is to many people. However, it is the only movie in a very long time where I left the theater smiling because I had been emotionally moved. And that's the most impressive thing of all.",
         "This is an odd and interesting film about a man who has the innate ability to listen to people. When he listens, people reveal their secret lives and take off their masks. This is the result of an almost Christ-like empathy that he has. Yet, ironically, he himself doesn't want to face himself. The film makes that point that we are who we think we are. It portrays Socrates' ancient motto \"Know Thyself\" in a very entertaining and intriguing way. The film seems to tell us that genuine human connection is the best form of therapy. A thoughtful and thought-provoking movie -- see it if you can.",
         "There's a moment in MUMFORD where Mary McDonnell, who plays a woman obsessed with buying things, is talking to Loren Dean, who plays the main character, a psychologist whose name, Mumford, is the same as the town he and McDonnell live in, and she gets the look on her face which cartoon characters get when they think of an idea(and the light bulb goes on over their head), and all of a sudden realizes what's wrong with her. In a way, this movie from writer-director Lawrence Kasdan is like that. A lot of people have complained at how slow moving this is, but it's all the better for it to sneak up on you. And instead of just providing quick fix solutions for his patients, Mumford just gently prods and nudges until they find the path for themselves. Of course, this may just be an elaborate way of saying, \"Physician, heal thyself,\" but that may be the point. If you look at this in one way, you might think Mumford is merely a passive character, who only comes to life when he falls in love and when his secret is revealed. But gradually, you come to realize what's going on. Not only is his reticence a cover(a good one until he's exposed), but it's a way of, as I said, just gently prodding his patients to the right path. So he is active, but just in subtle ways. You need a subtle actor to handle that, and Loren Dean does quite a good job in that department. Hope Davis, who if there's any justice in this world will become a star, is also good as the patient he falls in love with. Their scenes together reminded me of the relationship between William Hurt and Geena Davis in THE ACCIDENTAL TOURIST, a Kasdan film this shares a lot with. And the rest of the cast is quite good as well(it's also nice to see Elisabeth Moss, so good in IMAGINARY CRIMES, still getting work, though I hope it's bigger roles in the future). My only complaint was the scene where Mumford explains to Jason Lee(also excellent) and us what his past really was. The details themselves were okay, but the sequence was shot in grainy video stock(I think; I'm not an expert here), which, while it pays off later, is distracting here, particularly with its point-of-view camera. Still, this is a minor quibble for a movie which will leave you with a big smile on your face the entire way through.",
         "Got the chance to see a sneak preview of Mumford and mainly went to see it for Chasing Amy's Jason Lee (as I'm that big of a Kevin Smith fan) and was rather caught off-guard by how good it was. Starting out, the movie is slightly oddly paced and just throws you into the plot with little explanation as to what's up. The script unfolds expertly and does a great job of drawing you into the storyline and the very believable characters. It's extremely funny in a low-key way with most of the humor coming as a quick comment delivered dead-pan. It's the sort of flick where all of the characters are great because they're so quirky that they are funny in and of themselves. The overall message of the movie is also a good one. Definitely reccomended viewing. By the way, you get to see Jason Lee skate a bit. Cool beans.",
         "Mumford was a nice surprise to watch - I didn't know anything about it so had no expectations. However I am surprised that it didn't even get a release in the cinema in the UK - it certainly deserved it. The film manages to combine believable characters, a little suspense, some humour and romance. In fact it manages to get away from the usual Hollywood schmaltz whilst being true to the characters. Definitely worth checking out as it has a lot going for it.",
         "Now here is a different kind of story: a very low-key guy (Loren Dean) pretending to be a psychiatrist in a small town. Dean does a fabulous job of portraying the soft-spoken, easy-going \"shrink\" and is so likable that he makes the film enjoyable. There are a few spots that drag on too long, such as a few scenes with Hope Davis' character but the \"patients\" as a whole are certainly interesting and varied. This is another one of those films that got much press, and undeservedly-so because it's pretty entertaining with a good cast. In addition to the above, we see Alfre Woodard, Mary McDonnell, David Paymer, Martin Short and Ted Danson. If you are familiar with those actors, you'll know why a psychiatrist is needed!",
         "Of all of the comments to date, Jotix describes this film best. It is very reminiscent of some of the work of the great directors of Hollywood's Golden Era: Frank Capra, Ernst Lubitsch and Preston Sturges. I cannot imagine categorizing this film. It is not a pure comedy, although it provides moments of cleverness and humor. But there is also a significant element of dramatic tension. It is certainly no intellectual tour de force, however, it is much more than a way to while away 100 minutes (or whatever the length of the film is). It is not a morality play, although you might find something meaningful to take away with you. It is a finely crafted, subtly nuanced, multi-faceted film, mirroring its title character. You might conclude from other opinions that Mumford (the character) is passive out of timidity or lack of purpose or even in order to preserve his anonymity. However, I believe he is passionate about his \"profession\" and has a very clear philosophy and purpose. I think his therapeutic prescriptions for his \"patients\" represent sympathetic, compassionate and very intentional interventions in their lives. However, his persona is low-key and his methods of intervention are indirect. Thus their dramatic impact seems to be just the natural consequence of the patients' living their own lives - just as the good doctor intends. This kind of subtlety is in short demand and hence supply in the contemporary world of in-your-face computer generated special effects, one dimensional characters and unimaginative dialog. But, if you enjoy films like Grand Canyon, The Accidental Tourist, Local Hero and Passion Fish, you'll like this film. It is driven by a great balance of plot and well developed characters, played by a wonderful ensemble cast.",
         "\"Mumford\" is an unpretentious little romantic comedy with a softspoken, creative way of whetting curiosity and maintaining interest as it wends it's way through it's quirky but charming storyline. Sans the usual commercial \"chick flick\" schmaltz and boasting an R-rating, \"Mumford\" appears to refuse to compromise its freshness. A pleasant way to wile away 110 minutes.",
         "This movie like many others by directed by Lawrence Kasdan, (Silverado, Grand Canyon, Big chill), have a wonderful eclectic cast and real characters. He casts wonderfully gifted actors and gives them deep and authentic characters to flesh out. He also blends various story lines into an incredible weave of celluloid bliss. Mumford unfolds into this deep and layered beautiful story of what impact people have on each other. Whether they realize it or not.",
         "MUMFORD (1999) ***1/2 Starring: Loren Dean, Hope Davis, Jason Lee, Alfre Woodard, Martin Short, Pruitt Taylor Vince, Mary McDonnell, Zooey Deschanel, David Paymer, Jane Adams, and Ted Danson Written and directed by Lawrence Kasdan. 96 minutes Rated R (for sex-related images featuring nudity, drug content, and some language) By Blake French: \"Mumford\" is a cuddly little comedy production with a happy, uplifting atmosphere like the ones found in \"Pleasantville\" and \"The Truman Show.\" Mumford is the name of a small fantasy town, filed with smiling people greeting each other on a daily basis, which is held in upheaval when a small time psychiatrist's true entity is revealed to his various patients. I am getting ahead on myself, here. Before I can explain what happens after the characters discover the secrets about Mumford, the name of psychiatrist also, I must first give you some background information on the characters. The mismatched characters are eccentric and entertaining. They are developed though sessions with Mumford. To make things even more original for the movie is the lack of plot structure here. The conflicts, problems and solutions all exist in each individual character, not necessarily a situation they are placed into. With Mumford included, here are the characters: Sofie Crisp, (Hope Davis), who is nearly bedridden after a severe and almost permanent loss of energy. Henry Follett (Pruitt Taylor Vince) whose mind is overflowing with wild and erotic sex fantasies, but he isn't featured in any of them. Skip Skipperton, (Jason Lee) a young, skateboarding corporate billionaire that is so lonely and without friends that he has spend the last several years designing robots to fit individual's sexual pleasures. Nessa Watkins, (Zooey Deschanel) who has social, smoking, relationship, and obsession issues. Lionel Dillard, (Martin Short) a lawyer who's disturbing images Mumford refuses to listen to. Jeremy Brockett (Ted Danson), who is great to himself but treats his family members like dirt. Dr. Ernest Delbanco (David Paymer) and Dr. Phyllis Sheeler (Jane Adams), the only other two mental health doctors in Mumford who question Mumford's creditability. And finally, there is the Mumford character himself, played by Loren Dean, who has such a compelling flashback sequence developing his entire life in five minutes effectively, we learn that this man also had some problems, he just was willing to turn his life around. This character alone makes the film worth while to see, for his mysterious past life is such a revealing subject that it is hard not to become intrigued. There is much to like about \"Mumford.\" There are the enormously entertaining characters, who are not puppets of the plot, but contain their own personal emotions and motives. A charming, imaginative atmosphere. The direction by Lawrence Kasdan is focused and organized; he seems to know exactly what he wants, and achieves it. The personal territory the film's story covers, a psychiatrist mind, as well as the thoughts of many disturbed individuals, is quite compelling. Also, I think there is an important message here, signifying the need of people to communicate to one another and how important it is to listen to each other--values everyone should have. The conclusion to \"Mumford\" contains no big, extravagant climax. Nor does it completely bring the film's message to a direct close. It is a happy, petty ending in which almost everyone goes home happy, but still lets the imagination wonder. This ending only provides the fact that this is a character and mood movie, not a plot based movie. It ends how it needs to end, assuring this film will stick with the viewer for sometime to come. Brought to you by Touchstone Pictures."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": [
         "Touchstone Pictures",
         "Kasdan Pictures"
      ],
      "summaries": [
         "The story of two Mumfords - one a small town, the other a man. Mumford, the town, is full of people with problems, from a teenage girl who is unhappy with her looks to a local billionaire, \"the king of modems\", who would trade everything away if he could. So when Micky Mumford, the man, turns out to be a psychologist with slightly unusual methods he soon finds a spot in people's heart as someone to whom they can tell their secrets. But Micky too has a secret, and that one's about to hunt him down.",
         "A man is trying to find a new life. During his college years and a short and rough career as an IRS investigator, he becomes involved with drugs. After hitting bottom, \"Dr. Mumford\" (Loren Dean) enters a drug rehab center run by very understanding Monks. During much of his adult life he sees a common thread with people who have confided in him about their problems. All people want is someone to listen to his or her problem. He decides to use his knowledge of computers and ability to manipulate records to create a new identity. He uses the name of a friend from childhood who died very young. He uses this to embark on a career as a psychologist. During a search for a place to settle, he discovers a town named Mumford and sees it as a sign. He establishes a practice in the town and begins to attract patients. Through his common sense approach, many patients begin to experience breakthroughs. Especially for one young woman whom the other 'conventional' treatments have failed. As the movie progresses, the doctor begins to see the reason why many psychologists spend some time in college learning about their trade. His unusual treatments attract the concern of other colleges in the town who eventually file a complaint on his license. Another patient questions his ability to keep patient information confidential. While the one young woman with the tremendous breakthrough in concerned about transference.",
         "In the small town of Mumford, a psychologist of the same name moves in and quickly becomes very popular, despite a questionable past."
      ],
      "budget": 28000000
   },
   "movielensId": 2883,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-24",
      "dvdReleaseDate": "2000-04-18",
      "directors": ["Lawrence Kasdan"],
      "runtime": 112,
      "movieId": 2883,
      "title": "Mumford",
      "mpaa": "R",
      "actors": [
         "Loren Dean",
         "Hope Davis",
         "Jason Lee",
         "Alfre Woodard",
         "Zooey Deschanel",
         "Mary McDonnell",
         "Pruitt Taylor Vince",
         "Martin Short",
         "David Paymer",
         "Jane Adams",
         "Dana Ivey",
         "Kevin Tighe",
         "Ted Danson",
         "Elisabeth Moss",
         "Robert Stack",
         "Jason Ritter",
         "Holt McCallany"
      ],
      "imdbMovieId": "0140397",
      "originalTitle": "Mumford",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["cobXlciIra4"],
      "plotSummary": "In the small town of Mumford, a psychologist of the same name moves in and quickly becomes very popular, despite a questionable past.",
      "tmdbMovieId": 24071,
      "avgRating": 3.43075,
      "releaseYear": "1999",
      "numRatings": 1935,
      "posterPath": "/7h3EpKEOGs1UBw5GyIi22ilXOIj.jpg"
   }
}