{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "high school",
            "id": 6270
         },
         {
            "name": "prom",
            "id": 10266
         },
         {
            "name": "next door neighbor",
            "id": 163933
         }
      ],
      "imdb_id": "tt0164114",
      "video": false,
      "title": "Drive Me Crazy",
      "recommendations": [
         10050,
         20009,
         41044,
         16723,
         6020,
         15037,
         15361,
         10691,
         1550,
         13163,
         10035,
         12312,
         16222,
         24674,
         10642,
         10314,
         14874,
         29406,
         16406,
         76171
      ],
      "backdrop_path": "/oY3yo3RTnYvX27k4R12AjTVSi3N.jpg",
      "revenue": 22593409,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Nicole Maris",
               "gender": 1,
               "credit_id": "52fe45f29251416c75067e95",
               "name": "Melissa Joan Hart",
               "profile_path": "/wCEQaMlzwBr30SBQhfWtaV8JqWy.jpg",
               "id": 78501,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Mr. Maris",
               "gender": 2,
               "credit_id": "52fe45f29251416c75067e99",
               "name": "Stephen Collins",
               "profile_path": "/lVcwUavnFQOpIEBgF0BMJXQ8D4Y.jpg",
               "id": 1756,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Chase Hammond",
               "gender": 2,
               "credit_id": "52fe45f29251416c75067e9d",
               "name": "Adrian Grenier",
               "profile_path": "/qihY533cCB11VYChNN2ym1RfPkU.jpg",
               "id": 5090,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Alicia DeGasario",
               "gender": 1,
               "credit_id": "52fe45f29251416c75067eb3",
               "name": "Susan May Pratt",
               "profile_path": "/iIHOYjPPhHgqcClshtYrJn93ngb.jpg",
               "id": 40980,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Dulcie",
               "gender": 1,
               "credit_id": "52fe45f29251416c75067eb7",
               "name": "Ali Larter",
               "profile_path": "/bREO6OEipl4y077K0mdBUXVuE3i.jpg",
               "id": 17303,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Dee Vine",
               "gender": 0,
               "credit_id": "52fe45f29251416c75067ebb",
               "name": "Keri Lynn Pratt",
               "profile_path": "/qLrUKUM4GEzCuq5VTUFQNaJOB3Z.jpg",
               "id": 77803,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "Mr. Rope",
               "gender": 2,
               "credit_id": "52fe45f29251416c75067ebf",
               "name": "Mark Metcalf",
               "profile_path": "/qjxCggGQH99OkXjDxm33QPIJZcl.jpg",
               "id": 55194,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Mr. Hammond",
               "gender": 2,
               "credit_id": "52fe45f29251416c75067ec3",
               "name": "William Converse-Roberts",
               "profile_path": "/e1u3CfxBa4OhvsewKrDZeZ2uRMV.jpg",
               "id": 31712,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Mrs. Harris",
               "gender": 1,
               "credit_id": "52fe45f29251416c75067ec7",
               "name": "Faye Grant",
               "profile_path": "/3p9JwBPtOptm6kb6tV7QaBQKvyF.jpg",
               "id": 70830,
               "order": 8
            },
            {
               "cast_id": 13,
               "character": "Ray Neelay",
               "gender": 2,
               "credit_id": "52fe45f29251416c75067ecb",
               "name": "Kris Park",
               "profile_path": null,
               "id": 942055,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "David Ednasi",
               "gender": 2,
               "credit_id": "52fe45f29251416c75067ecf",
               "name": "Mark Webber",
               "profile_path": "/s7QzjQ8qiaN7P2MSMa5NWkmefbd.jpg",
               "id": 4451,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Brad Seldon",
               "gender": 0,
               "credit_id": "52fe45f29251416c75067ed3",
               "name": "Gabriel Carpenter",
               "profile_path": null,
               "id": 171871,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe45f29251416c75067ea3",
               "name": "Robert Thomas",
               "profile_path": null,
               "id": 20236,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f29251416c75067ea9",
               "name": "John Schultz",
               "profile_path": "/ePis8HPrAlCrkry1VMaHxsdrq4u.jpg",
               "id": 79656,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f29251416c75067eaf",
               "name": "Kees Van Oostrum",
               "profile_path": null,
               "id": 48311,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 4.078749,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 14429,
      "vote_count": 78,
      "budget": 8000000,
      "overview": "Nicole and Chase live next door to each other but are worlds apart. However, they plot a scheme to date each other in order to attract the interest and jealousy of their respective romantic prey. But in the mist of planning a gala centennial celebration, Nicole and Chase find that the one they always wanted was closer than they ever thought.",
      "similar": [
         19840,
         272693,
         89185,
         10314,
         37725,
         2105,
         449176,
         9880,
         10625,
         15037,
         9655,
         2108,
         10229,
         4951,
         277217,
         26123,
         17130,
         201676,
         11355,
         43923
      ],
      "original_title": "Drive Me Crazy",
      "runtime": 91,
      "poster_path": "/ljg0qL7RPUaP8Td6jQ1yOPVSodK.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Grand March Productions",
            "id": 81132,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Amy Robinson Productions",
            "id": 81133,
            "origin_country": ""
         },
         {
            "logo_path": "/qZCc1lty5FzX30aOCVRBLzaVmcp.png",
            "name": "20th Century Fox",
            "id": 25,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-10-01",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "The last guy she wants is the only one she needs.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Schultz"],
      "runtime": 91,
      "synopsis": null,
      "writers": [
         "Todd Strasser",
         "Rob Thomas"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0164114/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY4NDc4ODU2M15BMl5BanBnXkFtZTcwMzYzNjAyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Melissa Joan Hart, Adrian Grenier, Stephen Collins | See full cast and crew »"],
      "reviews": [
         "This film seems to have provoked a lot of irritation. Personally, I can't see why. I feel it's a classic teen drama with a lot of heart and some very fleshed-out performances. Another poster got it right when they compared it to Sixteen Candles, Breakfast Club and other teen dramas. To criticise the norms of the genre is pointless: it's like complaining that a slasher pic has too much blood and gore. It's a teen high-school drama, *of course* it's going to have jocks vs. geeks, pivotal parties and the leads getting together in the final fade. We all know the destination, it's the journey that counts. And I'd say that journey is pretty wonderful. The film gripped me in the first few minutes. I expected Melissa Joan Hart to turn in a mannered, 'Clueless'-type performance, a pastiche of popular girl gets a heart. But in fact, there was a lot more light and shade to her character, she didn't just flip from one stereotype to another. I thought the whole cast turned in sterling performances. Perhaps they were too good and the naysayers have forgotten these people aren't actually jocks and geeks? Whatever - I'm an old bloke who was touched by this film. It brought back memories of the hell / heaven of secondary school, of how important and fleeting those relationships are. It connected with me. Not every film has to be 'Un Chien Andalou', you know...",
         "It's a teen movie. It's not meant to be analized. The concept was fairly original. Scheming Teen Socialite plots to get a dream date for the school Centennial Dance (NOT the prom, as most descriptions say) and it falls through at the last minute. Her next door neighbor and childhood former best friend is dumped by his girlfriend. The two of them pretend to be a couple to make their former significant others jealous and ward off the scorn of their friends. She makes him over in her immage (of course: \"If you want to get results, you have to go to extremes!\").In the process she learns a little from him as well and they fall in love. The movie also has a cast of secondary characters who are interesting. This isn't Shakespare, folks! It shouldn't be analized to death. It's fun and entertaining. Sit down and watch it and leave the cliff's notes at school. The actors were great (It's nice to see that Melissa can play something besides Sabrina). Adrian Greere and the rest of the cast were great too. The soundtrack was great as well. Get the CD: (You Drive Me) Crazy, Unforgetful You, I Want It That Way, It's All Been Done, Stranded, Faith in You, Is This Really Happening To Me, Steps, Hammer To The Heart, One For Sorrow, Sugar, Regret, Original, Help Me Save The Youth of America from Exploding, and we can't forget \"Keep on Loving You\" by the teen girl rocker group \"The Donnas\". You can get this movie for $5.88 at Wal-Mart!",
         "Well, the plotline was predictable, however, Drive me Crazy is a highly entertaining teenage romp. The dialogue is witty, the theme is good-spirited, and, as in every teen movie, the soundtrack is great. The film has its flaws, however, particularly in Melissa Joan Hart, one of the worst actresses of our time. Thanks to her, an almost entirely likeable character is ruined. Her cute lines are recited flatly, and she adds no wit or life to the film. However, I was very impressed with the actor portraying Nicole's project, Adrian Grenier. His looks and intelligent delivery make the entire film worth seeing. Overall, a cute and cheery romance that does not feature the head cheerleader nor the lowest of the low geek- it presents it's characters and storyline in a fun, believable way, and it'll leave you loving every minute of it.",
         "I think the story of it all is fresh and natural- like what you'd see at my high school, and it teaches you (yes I actually learned something from this movie) that the right person for you may have always been there to begin with, even with all of his imperfections. Adrian Grenier plays Chase Hammond very well with a lot of sarcasm, wit and intelligence. If he went to my high school I'd have snatched him up right away! :) Melissa Joan Hart's character (Nicole) starts out shallow but eventually grows a heart bigger than her high school ego. This movie altogether isn't necessarily the best movie ever made, but it is a funny and serious romp through the final days of high school (love, crushes, the final school dance, peer pressure)- harmless but sweet and full of characters that are likeable and might remind you of people you once knew.",
         "If you don't like teen comedy/drama films, then don't bother seeing this film, you're going to hate it. There is nothing terribly original or spectacular about this film, compared to similar films, but it's still got some good stuff. There really isn't a whole lot of comedy in the film, so I'd be much more inclined to classify this film as a teen drama, so don't watch this film expecting a hilarious movie. The cast is surprisingly good in the film. Melissa Joan Hart does a great job in her first starring role and puts on a pretty good show for the most part. She also looks very attractive throughout the film. The other main character, Chase, played by Adrian Grenier is a new face to me, but does a good job with his role. Ali Larter looks very nice in the film as well and does a fine job in her role. Stephen Collins was another familiar face to me, and does a good job, although his role is rather minor. Susan May Pratt caught my eye in \"10 Things I Hate About You\" and pulls off another good job in this film as well. Keri Lynn Pratt (I wonder if they're related) is another new face to me, but I will definitely keep my eyes open for her future work after seeing her in this film. She is also quite easy on the eyes. The rest of the cast did a good job as well. Nothing to complain about in that respect. Most of the characters were actually rather interesting. I really liked the characters of Ray and Dave, they both seemed like very likeable people and quite the underdogs (gotta root for the underdogs). I also really liked that even the jocks in this film were not really made out to be idiots and jerks (of course one of them in particular was...Eddie). The character, Brad, was the most important jock-character and he wasn't made out to be a bad person or unlikeable person at all, just a guy that Nicole (Melissa Joan Hart) was head over heels for...and then wasn't. Another thing this film really had going for it was that it stayed away from all the gross-out, stupid comedy that is so abundant in most teen movies these days. I can really appreciate a film that doesn't resort to that...sure sometime it's really funny, but most of the time it's just un-needed. If you are the kind of person that likes teen comedy/drama films, then give this one a chance, you just might like it. Other than that, I would recommend you spend your money and time elsewhere. If you do see the film, I hope you enjoy it. Thanks for reading, -Chris",
         "I watched this movie on `Sky' after watching `TOMCATS' on video, so whether my judgement has been affected by that, maybe. As compared to Tomcats this film looked like an Oscar winner, but I must say I did actually really enjoy it in its own right. Its typical teen comedy/drama in the same vein as `TEN THINGS I HATE ABOUT YOU' and `SHE'S ALL THAT' but if you like that kind of film then this will in no way disappoint you. Hart and Grenier play polar opposite next door neighbours who hook up as a sham couple to try and win back the attention of their dates, who dump them on the eve of the schools centenary bash. It doesn't take a genius to guess what happens but its all pretty harmless and a lot of fun. Well worth and hour and a half of your time.",
         "I went to this film expecting it to be just a formula teen film. It does have formula to it -- such as ending with the big dance -- but it actually has some interesting ideas too. It is about the images that people hide behind, the distortions that they manufacture to escape from painful reality. One symbolic scene takes place in a carnival fun house with mirrors that twist and pull reflections into any shape the person wants. This of course is the metaphor for what is happening with all the characters. Another interesting bit of symbolism is the MTV-like video showing the zombie-like behavior of the high school in-crowd compared to images of animals and Nazi rallies. Yes, it's a teen romantic comedy, but it actually has some real thought in it, and the talented cast play characters that show some depth. The film is a pleasant surprise.",
         "Nicole (Melissa Joan Hart) has her eye on a hunky basketball star. She makes the overtures but he casts his gaze on a cheerleader instead. Nicole has been the major planner for an upcoming community dance and now her choice of dates is taken! Meanwhile, next door neighbor, Chase, has been dumped by his eccentric girlfriend. He's sad. Melissa cooks up a compromise. If Chase will pretend to be her guy to make the basketball star jealous, she will do the same for him and his ex. But, first Melissa insists on giving Chase a makeover. Will their schemes result in mutual benefits? And, what about Nicole's absentee father? Will he ever be interested in his daughter's happenings? This movie would make a nice conversation starter for high school teens. Besides its entertainment value, it has some good messages and quandaries about what it means to be in the \"in crowd\" and the \"out crowd\". The stars are quite good looking and have good acting abilities, especially Adrian Grenier. Typical but nice costumes and settings compliment the film, too. If you would like a movie to watch with your teenage daughter or son about self worth and choices in life, this movie would be beneficial. And, you both just might end up giggling and touched.",
         "This one is a guilty pleasure movie of mine. I can't explain why I like it, or if I even do like it, but when it's on I watch it. Sure it has my all time favorite movie babe Ali Larter in it, but you don't see me watching Varsity Blues or American Outlaws. Maybe when I discover what it is I like about this movie I'll post it later.",
         "I was pleasantly surprised at how realistic the characters felt. For once the leading lady was not head cheerleader/prom queen but an average girl with a good intelligence. There were some divisions in pupils, but there were no spotty nerd characters who did nothing but play with computers and watch Star Trek. They actually had an alternate respectable social world. I was annoyed that our sporting hero seemed to be the only guy who scored for the basketball team, but you can't have everything. The relationships were slightly more believable, impulse attractions were short lived, and dormant attraction and friendship was re-awakened in a smooth and acceptable manner. The subtle conniving women were enjoyable to watch. I was expecting a really poor and tacky American High School comedy, but found a quite refreshing change from all the other movies that have been listed in these reviews. And a word of advice... if you hate high school comedies then don't watch it. Personally I can't stand those movies with that old cliche of boy and girl attracted to each other. I mean puleeze."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Twentieth Century Fox Film Corporation",
         "Amy Robinson Productions",
         "Grand March Productions"
      ],
      "summaries": [
         "Nicole Maris is a popular high school preppy senior in Utah who gets her life turned upside down when her perfect date, Brad, falls for a cute cheerleader from another school a month before the school's centennial senior prom. After recovering from the shock, Nicole comes up with a solution to save her reputation: find a guy to appear like they're going steady and to take her to the dance hoping to make Brad jealous. Nicole then hooks up with her next door neighbor, prankster and trouble maker Chase Hammond, and tries to model him in her own image while he's looking to make his long-term girlfriend Dulcie jealous too. However, both Nicole and Chase don't expect their charade to lead it where they never expected it to.",
         "Nicole is popular and stylish and has her sights set on one thing, the gala centennial celebration theme for the prom. She has always been into doing good for the planet. Her second sights are on a date to escort her. But when her dream date invites another girl, Nicole must act fast to find a substitute. She decides to go low and asks her grungy next door neighbor to take her there. But first, he needs a little work done to himself. She gives him a fashion make over to show his true handsome self.",
         "A high school girl must find a substitute date to escort her to the prom."
      ],
      "budget": 8000000
   },
   "movielensId": 2888,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-10-01",
      "dvdReleaseDate": "2000-03-14",
      "directors": ["John Schultz"],
      "runtime": 91,
      "movieId": 2888,
      "title": "Drive Me Crazy",
      "mpaa": "PG-13",
      "actors": [
         "Melissa Joan Hart",
         "Stephen Collins",
         "Adrian Grenier",
         "Susan May Pratt",
         "Ali Larter",
         "Keri Lynn Pratt",
         "Mark Metcalf",
         "William Converse-Roberts",
         "Faye Grant",
         "Kris Park",
         "Mark Webber",
         "Gabriel Carpenter"
      ],
      "imdbMovieId": "0164114",
      "originalTitle": "Drive Me Crazy",
      "genres": [
         "Drama",
         "Comedy",
         "Romance",
         "Family"
      ],
      "youtubeTrailerIds": ["aQvscFSa6vU"],
      "plotSummary": "Nicole and Chase live next door to each other but are worlds apart. However, they plot a scheme to date each other in order to attract the interest and jealousy of their respective romantic prey. But in the mist of planning a gala centennial celebration, Nicole and Chase find that the one they always wanted was closer than they ever thought.",
      "tmdbMovieId": 14429,
      "avgRating": 2.81387,
      "releaseYear": "1999",
      "numRatings": 1276,
      "posterPath": "/ljg0qL7RPUaP8Td6jQ1yOPVSodK.jpg"
   }
}