{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "venice",
            "id": 110
         },
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "fortune teller",
            "id": 663
         },
         {
            "name": "soulmates",
            "id": 815
         },
         {
            "name": "cheating",
            "id": 1332
         },
         {
            "name": "trip",
            "id": 1820
         }
      ],
      "imdb_id": "tt0110737",
      "video": false,
      "title": "Only You",
      "recommendations": [
         12658,
         4587,
         2621,
         12187,
         397,
         12280,
         3064,
         236,
         10879,
         10407,
         11860,
         32221,
         3784,
         11777,
         11521,
         15556,
         10013,
         7300,
         31633,
         11630
      ],
      "backdrop_path": "/qhXZxM7WtnPev0IHsfpR9vPbiJo.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Faith Corvatch",
               "gender": 1,
               "credit_id": "52fe44d7c3a36847f80ad1cf",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Peter Wright / Damon Bradley",
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1d3",
               "name": "Robert Downey Jr.",
               "profile_path": "/1YjdSym1jTG7xjHSI0yGGWEsw5i.jpg",
               "id": 3223,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Kate Corvatch",
               "gender": 1,
               "credit_id": "52fe44d7c3a36847f80ad1d7",
               "name": "Bonnie Hunt",
               "profile_path": "/7spiVQwmr8siw5QCcvvdRG3c7Lf.jpg",
               "id": 5149,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Giovanni",
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1db",
               "name": "Joaquim de Almeida",
               "profile_path": "/AiBNELVvARLrTFdOgEgMZQRiqvA.jpg",
               "id": 22462,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Larry Corvatch",
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1df",
               "name": "Fisher Stevens",
               "profile_path": "/TutpOyw0A6FF5hEoFDYseI2EVN.jpg",
               "id": 26473,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Harry",
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1e3",
               "name": "Billy Zane",
               "profile_path": "/lkwvmo7vVL8TpMCDLRoHjZIkJQ4.jpg",
               "id": 1954,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Leslie",
               "gender": 1,
               "credit_id": "52fe44d7c3a36847f80ad211",
               "name": "Siobhan Fallon",
               "profile_path": "/wVFa8GiY0xdOLFsvGygy9RMtcBc.jpg",
               "id": 6751,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Damon Bradley",
               "gender": 2,
               "credit_id": "5457caddc3a368209f001fa7",
               "name": "Adam LeFevre",
               "profile_path": "/y17YQ7F99kpqJuCUYfOoeArAkKz.jpg",
               "id": 61607,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1e9",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d7c3a36847f80ad1ef",
               "name": "Diane Drake",
               "profile_path": null,
               "id": 56849,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1f5",
               "name": "Robert N. Fried",
               "profile_path": null,
               "id": 54797,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad1fb",
               "name": "Norman Jewison",
               "profile_path": "/umNoz1FsJtvoWKlCsgNOqWlfrgh.jpg",
               "id": 13563,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe44d7c3a36847f80ad201",
               "name": "Rachel Portman",
               "profile_path": "/AkMflxC3EkbWuyPoltQ406EJvue.jpg",
               "id": 3562,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe44d7c3a36847f80ad207",
               "name": "Sven Nykvist",
               "profile_path": "/2S1wtqPzCUlAMVpor5o0YHkme21.jpg",
               "id": 11905,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44d7c3a36847f80ad20d",
               "name": "Stephen E. Rivkin",
               "profile_path": null,
               "id": 1721,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 6.992171,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9058,
      "vote_count": 124,
      "budget": 0,
      "overview": "A childhood incident has convinced Faith Corvatch that her true love is a guy named \"Damon Bradley,\" but she has yet to meet him. Preparing to settle down and marry a foot doctor, Faith impulsively flies to Venice when it seems that she may be able to finally encounter the man of her dreams. Instead, she meets the charming Peter Wright. But can they fall in love if she still believes that she is intended to be with someone else?",
      "similar": [
         1213,
         80752,
         859,
         175,
         439,
         48415,
         931,
         11068,
         844,
         459,
         50270,
         20271,
         24167,
         8429,
         18503,
         1993,
         15096,
         552,
         8906,
         10541
      ],
      "original_title": "Only You",
      "runtime": 115,
      "poster_path": "/eaHH1hnbZ9wIUHjYKlqJUwpTBan.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/rzgMLzPgJ2ZBYnlVwNi8ZDfOMwo.png",
         "name": "TriStar Pictures",
         "id": 559,
         "origin_country": ""
      }],
      "release_date": "1994-09-17",
      "vote_average": 6.4,
      "belongs_to_collection": null,
      "tagline": "A love story written in the stars.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Norman Jewison"],
      "runtime": 115,
      "synopsis": null,
      "writers": ["Diane Drake"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0110737/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk5MDQwODk2MV5BMl5BanBnXkFtZTgwMDY0NTcxMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marisa Tomei, Robert Downey Jr., Bonnie Hunt | See full cast and crew »"],
      "reviews": [
         "What a great romantic comedy set in beautiful Italy, not only are the actors Robert Downey Jr (so handsome and such a talented actor) and the beautiful Marissa Tomei amazing but watching these actors play out such a romantic story and doing things that we would never dream of, to find your one true love. All with her best friend by her side. Brings me back to being 13, dreaming of who I would marry and the romantic innocence of those times. Its not only the romance but the friendships that give you that warm feeling inside, both the men and women in this film have a quiet kind ship with each other as when you see the three men sitting in the boat sharing wine, feeling rejected by women. ( I won't spoil that scene with anyones names) and the kindness of the hotel staff in later scenes. These days so many movies and the reality of the news is full of war, violence and betrayal. Why not put all of that behind you?.. So sit back with your favorite snack, some hot chocolate & maybe your best friend and escape into love, romance, zany impulsiveness and disappear into.... Only You.",
         "What a wonderful movie... It is rather a fairy tale than a romantic comedy. The story is developed nicely and gives us some lessons about love and life and things in between. The actors, especially Marisa Tomei, do a great job in telling us this beautiful story. The finale is exceptional: I will always hope for this kind of support when I am at an Italian airport... Watch this movie when you are in a romantic mood and want to see a film which believes in true love. Or watch it to get into a romantic mood. And enjoy the various plot twists...",
         "Over the past 9 years, this has been what of my guilty pleasures. The story is obviously romantic fluff, but the performances of Marisa Tomei, Robert Downey Jr., and Bonnie Hunt are great and make what would normally be a prosaic love story into a true romantic treasure. Just remember to be prepared to suspend your rational side for a couple of hours. Marisa Tomei is so beautiful in this film, it's understandable why Robert Downey Jr's character falls in love with her at first sight. The Italian scenery is incredible and would make anyone fall in love with Italy. I have since visited this beautiful country and can attest to its romantic atmosphere. It is a great date film and comes highly recommended.",
         "How did I love this movie? Let me count the ways. The locations were beautiful, and I have always thought that Italy was the place for romance - Venice, Rome etc. look gorgeous. It was romantic, so much so that if you didn't believe in destiny before this movie, you will afterwards. Robert Downey Jr and Marisa Tomei's characters seem so suited to one another, except for the slight problem that he has the wrong name! Any fool could see that they were in love from the moment they met! Love the scene when Downey Jr's character reads Tomei's mind about what she is to wear for her date. Audience are practically cursing the screen in hope that Faith and Peter will finally get together. Awesome, magical, glorious!!",
         "This is a truly great romantic comedy. Tomei and Downey both create characters you will love. The dialog sparkles, the location photography is beautiful, the pace keeps moving along and there are a few twists to the plot. It's fluff, but the very best quality fluff you could ask for. A *great* date movie. Guys, even if you think you hate movies like this... give it a chance!",
         "If you want a nice night in with a lady (or just someone who fits that special romantic niche for you - whatever that is), this is a great choice. The acting is endearing, the story is simple straightforward and sweet. It steers clear of sickeningly romantic and sweet which tends to eliminate the male half of the audience when it comes to your classic \"chick flick\". It's easy to see Downey Jnr's talent in this film, a friendly charming drug free character. A wonderful cameo by Billy Zane adds some wonderful moments. I guarantee, you show up with roses, a pizza, a bottle of nice wine and this on DVD - and you'll have a wonderfully sweet night in.",
         "I loved this movie. And for all the stupid mistakes he's made, you have to admit that Robert Downey Jr. can turn in some pretty amazing performances. Marisa Tomei also shines in this incredible fairy tale about looking everywhere to find your one true love. Light, sweet, and absolutely beautiful, \"Only You\" will show that at the most unexpected times (or with the most unexpected people) love can show up. You should be ready for it. Don't let the love of your life slip through your fingers in an Italian airport. 10/10",
         "Faith (Marisa Tomei) has been told by a gypsy AND a ouija board that she will marry a man named Damon Bradley. When he fails to appear before her 30 birthday, she becomes engaged to a podiatrist. However, she accidentally overhears on the phone that a man named DB may be headed to Venice. Faith hops a plane one hour later and begins a search through Italy for the man of her dreams. But, what about the cute American man she meets on the streets of Rome? One could watch this film 100 times and never tire of it. Tomei and Robert Downey, Jr. give funny, vibrant performances that are unforgettable. The lovely scenery of Italy is definitely a bonus and Bonnie Hunt gives an adorable performance as Faith's sister-in-law, as does Fisher Stevens as her brother. Do you want a movie to watch whenever you need a spirit lifter? For the romantic at heart, this film is a treasure to savor over and over.",
         "Marisa Tomei is captivating. Robert Downey, Jr. is perfect in the role. I have seen this movie at least 10 or 12 times and never tire of it. It is light and breezy and just one of those \"feel good movies\". Highly recommended. Guaranteed to make you want to go to Italy!",
         "I thought Downey was wonderful in this movie! He is so romantic! And sweet. He will do anything to show how much he loves Faith (Tomei); even set her up with her soulmate! Robert Downey, Jr was the real star of this film. I was mesmerized by him whenever he was on camera, and when he wasn't, I kept wondering when he would be back! Credit to Marisa Tomei as well! She does a great job playing Faith, a woman who follows her 'soulmate' to Italy only to find her true love. Tomei is very pretty in the film and I love the red dress she wears when first meeting Peter (Downey). Some of her best acting comes at the end, when she realizes her feelings and rushes to tell him. The only bad thing about the movie is that Downey does not appear until 45 minutes into the movie! Did it have to be that long? I know of a few scenes that they could have cut. Other than that, the movie is great. Watch it with someone you love, or even your soulmate."
      ],
      "genres": [
         "Comedy",
         "Romance"
      ],
      "productionCompanies": [
         "TriStar Pictures",
         "Fried/Woods Films",
         "Yorktown Productions"
      ],
      "summaries": [
         "Destiny. Faith (Marisa Tomei) believes that two soul-mates can be united if they find each other. From the Ouija board, she has found the name of her missing half, and it is D-A-M-O-N B-R-A-D-L-E-Y. Later, at the carnival, the fortune teller sees the name Damon Bradley in the Crystal Ball and Faith is convinced. She is told that \"You make your own destiny,...don't wait for it to come to you\", but she is looking for Damon. 14 years later, she is engaged to a dull podiatrist and plans to marry until she gets a call from one of his classmates who is on his way to Venice, Italy. The classmate is Damon Bradley. Rushing to the airport to see her soul-mate, she misses him and the plane, but decides, then and there, to go after him. So Faith and her sister-in-law Kate both board the next plane for Italy hoping to find her Damon.",
         "Schoolteacher Faith Corvatch believes she is destined to spend her life with a man named \"Damon Bradley.\" Just days before she is to marry a podiatrist she may not love, she receives a phone call from a friend of her fiance's named, you guessed it, Damon Bradley. Bradley is on his way to Venice, and Faith decides to spend her Labor Day weekend pursuing her dream man. Accompanying her on the trip is her sister-in-law, Kate, who has just left her husband."
      ],
      "budget": 0
   },
   "movielensId": 289,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1994-09-17",
      "dvdReleaseDate": "1998-03-31",
      "directors": ["Norman Jewison"],
      "runtime": 115,
      "movieId": 289,
      "title": "Only You",
      "mpaa": "PG",
      "actors": [
         "Marisa Tomei",
         "Robert Downey Jr.",
         "Bonnie Hunt",
         "Joaquim de Almeida",
         "Fisher Stevens",
         "Billy Zane",
         "Siobhan Fallon",
         "Adam LeFevre"
      ],
      "imdbMovieId": "0110737",
      "originalTitle": "Only You",
      "genres": [
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["zLrqyfkXt_A"],
      "plotSummary": "A childhood incident has convinced Faith Corvatch that her true love is a guy named \"Damon Bradley,\" but she has yet to meet him. Preparing to settle down and marry a foot doctor, Faith impulsively flies to Venice when it seems that she may be able to finally encounter the man of her dreams. Instead, she meets the charming Peter Wright. But can they fall in love if she still believes that she is intended to be with someone else?",
      "tmdbMovieId": 9058,
      "avgRating": 3.35723,
      "releaseYear": "1994",
      "numRatings": 3383,
      "posterPath": "/eaHH1hnbZ9wIUHjYKlqJUwpTBan.jpg"
   }
}