{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "future",
            "id": 2964
         },
         {
            "name": "genius",
            "id": 6257
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "cyberpunk",
            "id": 12190
         },
         {
            "name": "temptation",
            "id": 162706
         },
         {
            "name": "corporation",
            "id": 188950
         }
      ],
      "imdb_id": "tt0133122",
      "video": false,
      "title": "New Rose Hotel",
      "recommendations": [
         364002,
         36090,
         59357,
         88378,
         49952,
         60971,
         36779,
         113362,
         129129,
         20502,
         32728,
         38845,
         42481,
         114790,
         177229,
         79702,
         91515,
         44038,
         54793,
         5822
      ],
      "backdrop_path": "/qtHLwj02OI26kbHsbsFzPeKsMYM.jpg",
      "revenue": 21521,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Fox",
               "gender": 2,
               "credit_id": "52fe4418c3a368484e00f38d",
               "name": "Christopher Walken",
               "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg",
               "id": 4690,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "X",
               "gender": 2,
               "credit_id": "52fe4418c3a368484e00f391",
               "name": "Willem Dafoe",
               "profile_path": "/xM5lhOR5tWWdIlFpBDeZJx9opIP.jpg",
               "id": 5293,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sandii",
               "gender": 1,
               "credit_id": "52fe4418c3a368484e00f395",
               "name": "Asia Argento",
               "profile_path": "/xT92C6WbaFaJlSLQJGp0ZjYoigS.jpg",
               "id": 18514,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Hiroshi's wife",
               "gender": 1,
               "credit_id": "52fe4418c3a368484e00f399",
               "name": "Gretchen Mol",
               "profile_path": "/46mBoe7xf3pJgQLEYNw6Msniq3r.jpg",
               "id": 15370,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "Madame Rosa",
               "gender": 1,
               "credit_id": "52fe4418c3a368484e00f3a9",
               "name": "Annabella Sciorra",
               "profile_path": "/2rhrUQbnRLI5hS0nZSvtmFHCf2M.jpg",
               "id": 18750,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Distinguished man",
               "gender": 2,
               "credit_id": "52fe4418c3a368484e00f3ad",
               "name": "John Lurie",
               "profile_path": "/izPEjdTrWUy3gPEdJ8f2OOnBW3f.jpg",
               "id": 6394,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Marcelino",
               "gender": 2,
               "credit_id": "563876adc3a3681b4d0219f0",
               "name": "Victor Argo",
               "profile_path": "/kYwuOpT59qqJnssl9R4226yHSAG.jpg",
               "id": 2561,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Hosaka Executive",
               "gender": 2,
               "credit_id": "583db353c3a368359a011908",
               "name": "Ryuichi Sakamoto",
               "profile_path": "/sznCz9OIUYxBgNhn7hsd9LK5jsN.jpg",
               "id": 11382,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Hiroshi",
               "gender": 0,
               "credit_id": "5abec53a925141601b01a8d6",
               "name": "Yoshitaka Amano",
               "profile_path": "/jQdOQcxewRLnbFDssTosBN2ES4n.jpg",
               "id": 90513,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4418c3a368484e00f39f",
               "name": "Abel Ferrara",
               "profile_path": "/spMsMgsJs8qwhLXgQO9VGNm9Rcn.jpg",
               "id": 39104,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4418c3a368484e00f3a5",
               "name": "Abel Ferrara",
               "profile_path": "/spMsMgsJs8qwhLXgQO9VGNm9Rcn.jpg",
               "id": 39104,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4419c3a368484e00f3b3",
               "name": "William Gibson",
               "profile_path": "/mnrprkOYH3nsrEBtb31BMtp8IH6.jpg",
               "id": 150783,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 0,
               "credit_id": "598c56fe92514107fa01063a",
               "name": "Christ Zois",
               "profile_path": null,
               "id": 956657,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "598c5710c3a368068700360c",
               "name": "Edward R. Pressman",
               "profile_path": null,
               "id": 32035,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "598c571dc3a3680687003618",
               "name": "Schooly-D",
               "profile_path": "/bjZxahHeWvgtBcSwa7xzkUiMh7l.jpg",
               "id": 1168192,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "598c572dc3a368738600f9ea",
               "name": "Ken Kelsch",
               "profile_path": "/uOYnWQFm5bdXQPafDsh8YVUZQew.jpg",
               "id": 45535,
               "department": "Camera",
               "job": "Director of Photography"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Mystery",
            "id": 9648
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 3.064967,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 21430,
      "vote_count": 34,
      "budget": 0,
      "overview": "A corporate raider and his henchman use a chanteuse to lure a scientific genius away from his employer and family.",
      "similar": [
         281,
         11309,
         59967,
         9739,
         3509,
         8810,
         2048,
         180,
         605,
         604,
         19959,
         101299,
         97020,
         335984,
         215379,
         2142,
         21356,
         3134,
         9381,
         298312
      ],
      "original_title": "New Rose Hotel",
      "runtime": 93,
      "poster_path": "/zRgR1UEHV7xolS2eE2W1uzH9F5I.jpg",
      "spoken_languages": [
         {
            "name": "日本語",
            "iso_639_1": "ja"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Quadra Entertainment",
            "id": 1438,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Edward R. Pressman Film",
            "id": 6455,
            "origin_country": ""
         }
      ],
      "release_date": "1998-09-05",
      "vote_average": 5.3,
      "belongs_to_collection": null,
      "tagline": "No possession is sacred.  No secret is safe.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Abel Ferrara"],
      "runtime": 93,
      "synopsis": null,
      "writers": [
         "William Gibson",
         "Abel Ferrara"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0133122/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTI4MjA1MzQ4OF5BMl5BanBnXkFtZTcwMDYxMzEyMQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Christopher Walken, Willem Dafoe, Asia Argento | See full cast and crew »"],
      "reviews": [
         "It's hard to believe that a movie directed by Abel Ferrara based on a story by William Gibson and starring Christopher Walken, Willem Dafoe and Asia Argento would be anything less than great, but this movie is just OK. It has a lot of moody atmosphere. Asia A., the lovely Eurobabe who is supposedly ogre-ish horror-meister Dario Argento's daughter (I, for one, won't believe it until I see the blood tests), spends most of the movie in various states of undress (unfortunately, so does Dafoe). Walken is great as always. But literally nothing happens. It's all atmosphere, eerie music, and occasional bursts of softcore groping. Neither Ferrara's visuals, Walken's acting presence, or Argento's tatooed nether regions can ultimately carry a film so totally devoid of conventional plot, suspense, or action. Not a bad film, just a disappointing one.",
         "After reading a number of reviews at imdb--and elsewhere--I have to come-down-on-the-side of the director, Abel Ferrera's vision. This is a GREAT science-fiction film, and for those who are generally-disappointed with it, I have to ask whether they understand what sci-fi IS. If science-fiction isn't about the present (as-filtered through an imagined-future), it generally isn't good, but New Rose Hotel fits this criteria. This is a pretty-old story from the 80s that Gibson had published in \"Omni Magazine,\" it might-have been his first-acceptance. While it is a minor-story, it has dramatic-elements to it that are very-pleasing within-the-structure of the \"Ferrera\" universe: a metropolitan-dystopia, urban and moral-decay, the eternal quest by many for \"power,\" official- corruption, the consequences of murder, sexuality, drugs, how memory works, they all mesh-well with Ferrera's thematic-styles. There are no great moral-lessons here, this is about the aftermath of that paradigm. The only-complaint I have is that the future has caught-up a bit, due to the age of the original-story. With our human-society growing more-restrictive, with the rise of corporate- statism, and the subsequent-decline of the Nation State, New Rose Hotel seems almost \"quaint.\" That should give-us-pause.",
         "When making movies out of fiction, most of the time it doesn't work, unless the original text is purely telegraphic in style. If it's good prose, it's not usually the larger actions that we see that make it good - it's something more ethereal within the style itself that give it quality. William Gibson's noir-influenced techno-satire would seem perfect for adaptation, but anyone who's suffered through (or even enjoyed) JOHNNY MNEMONIC suddenly realizes that the characters' tough-guy dialog sounds utterly preposterous when actually voiced by a human being. In NEW ROSE HOTEL, director Abel Ferrara finds the emotional heart of a very spare Gibson short (one of the best things Gibson's ever written, and blessedly short on actual dialog) and creates a recognizable near- future world and characters who seem as comfortable with this subtly accelerated reality as we of 2005 are with plasma-screen TVs and mobile phones. The structure of the film can be extremely off-putting to those without enormous patience - it's very slow-paced, and halfway through we see the almost the entire story over again, but very slightly changed. As far as I can tell, most of the scenes were shot twice from different angles. The entire point of Abel Ferrara's approach is to visually represent the phrase, \"If only I knew then what I know now\". NEW ROSE HOTEL really needs to be seen at least twice to be understood, and only lets go of the intelligence and daring of the direction and the performances after repeated viewings. Christopher Walken plays Christopher Walken, under the guise of the character \"Fox\", but I've rarely seen Walken so simultaneously comfortable and affected in any other role. Willem Dafoe has to play younger than he looks, and we get to watch his character learn what a fool he's been, writhing with embarrassed disgust and fear as he discovers that the source of his predicament is his own stupidity and sentimentality. A very young-looking Asia Argento plays Sandii with more depth than she is regularly given credit for - her style is so subtle and genuine that she hardly seems to be acting, and as far as I've seen, she isn't, but she's so sexy and vulnerable that I'm more than willing to watch. It's a shame this film is so under-appreciated; it's definitely my favorite Ferrara film, and one of my top two Christopher Walken films. And lots of Asia in her underwear - what's not to love?",
         "New Rose Hotel (1998) was another strange film from Abel Ferrara. Instead of his usual street dramas. Ferrara expands upon the elements that he utilized whilst making BLACKOUT. A dark and moody film that was adapted from a short story that was written by William Gibson. I was surprised by how intriguing and interesting the movie was. I have heard so many negative things about this production that I was a little leery in watching it. But I was impressed by the story, acting and directing. Christopher Walken and Wilhem Dafoe are two losers who are always looking for rich people to swindle. One day they find the perfect pigeon who'll make them a lot of money. But they need a seductress. They find one in Asia Argento (who's smoking hot in this movie). During the bug hustle, Dafoe falls for her and the two make a side swindle. Unfortunately nothing is really as it seems. Instead of running off with Asia, Dafoe tries to play all sides but he winds up with nothing. Before he can split, his mentor Walken kills himself before the hit men can ice him. Dafoe realizes that he's be burned by a better con artist and flees. Hiding from everyone, Dafoe spends the rest of his pathetic life hiding out in a derelict apartment complex The New Rose Hotel where he re-lives the last month of his life over and over until he ends it all. Even though we never see what happens to Dafoe's character, one can assume what happens to him. He has nowhere to go but inside the coffin he's created. The movie is a serious character study about not knowing what you could have and how greed and stupidity make a dangerous combination. I found this movie to be very deep and moving as well. But it's not for everyone. Highly recommended.",
         "New Rose Hotel captures the bleakness and despair of the short story that seems common to William Gibson's writing. I enjoyed the performances of Christopher Walken and Willem Dafoe and the babe was sufficiently babeish to hold my interest though her acting was just OK. The movie peaked too soon and the flashbacks to the film's beginning were too long and repetitious. The short story didn't have enough depth to fill out the movie. William Gibson is heavy on description and atmosphere, a master at it. \"Neuromancer\", his best book, is enthralling even if you don't know what is happening. The screenplay for the movie should have been padded out more in the beginning maybe showing some history of X and some of the babe's motivations clearer. The story was somewhat obscure. If you didn't listen carefully you missed the plot. The movie was flawed but atmospheric and moody enough to be of interest. William Gibson's fans should see it to see how the book's mood was captured.",
         "With a solid plot basis (William Gibson short story), two excellent actors (Christopher Walken, Willem Dafoe) and an interesting director (Abel Ferrara) this movie could have well turned out to be a real hidden gem. Dario Argento's daughter posing as the female lead doesn't have any other qualification for her role than an Italian accent and a nice body -- no screen presence, no femme fatale charisma, no \"edge\" -- and the budget has obviously been someone's lunch money for a week, but those things alone would not have done too much damage. However, there are some bigger issues with this film. In the beginning of the movie there's way too much singing in the bars, and it's all bad. I've been to karaoke bars where the performers have been significantly more talented. All of them. No kidding. And near the end the movie falls apart, mainly thanks to way too many flashbacks -- they are not of just one or two key scenes, but of umpteen, in a peculiar \"here's the movie again in case you missed it\" fashion. They are annoying as such, and as a result you probably lose your focus and, consequently, your grasp of the plot. What you end up having instead of a real movie is a 90 minutes long artsy collection of insubstantial sleazy moving pictures with nudity. In short, the first half of the movie does not get your hopes up too high, yet the latter half is disappointing. Kind of an achievement, I suppose. For better or worse, Walken's cool charisma and Argento's numerous nude scenes may still keep you awake through the whole thing. 4/10",
         "SPOILER In the end it's all about Sandi's treason, Dafoe remembering how she betrayed him, and how he let himself be betrayed (he found the key in her passport and at one time she disappears to get the apartment key...except the key is in the door as Dafoe finds out...he had all the signs that allowed him to realize she was going to betray him, still he didn't do anything) he was seduced in the same way Hiroshi was. He wanted to get away with herself and the money, and all he gets is a stab in the back, she's gone and there's nothing he can do about it except remembering all this in the dark room of New Rose Hotel (the way he remembers the sex scenes reminds me a bit of the character in \"Strange Days\" that remembers his happy past with the Juliette Lewis character through the mental video engine). Many will find the ending frustrating, and it is frustrating, it's about a man realizing he's been had.",
         "I think this movie got a bum rap. I actually enjoyed it much more than that travesty Johnny Mnemonic (my apologies to Gibson, I know he liked it). Note to Hollywood, Ice-T does not go good with everything, and the deranged preacher bit has been overdone. But here I think Abel Ferrara really made a world in line with what I envisioned when reading the short story, any of Gibson's short stories. It's not a future where everything is blinking lights and super speed CGI, it's a future where most people live in the slums, and the rest have a clean, aerodynamic, one-button-for-everything lifestyle. The premise, a couple of corporate \"headhunters\" trying to seduce a brilliant researcher away from a billion dollar multinational with a geisha type mole, is the kind of premise that Gibson is famous for. It's a single incident revolving around human emotions but having worldwide implications because the man is so brilliant he could change the course of science. The acting is great of course: Willem Dafoe, Christopher Walken, and an early glimpse of Asia Argento. The story doesn't hit you over the head explaining events like most films, but Ferrara never does, and half the fun is suddenly realizing what's happened, the check mate, on your own. If you want action, go see Johnny Mnemonic, if you want deep, see this film.",
         "This movie seem to go all out for the ambience of what it could be like in the near future, giving us a look of the cold and bleak world that is set out for us. It doesn't quite succeed like in Blade Runner, probably due to its small budget, limited settings, which were mostly indoors, but it gave it a good run for the money. On the plot side, I think it might have been better if the flashback method of the original story were used. This will avoid the replay of the first 2/3 of the film onto the final 1/3. Plus it would have also lead us to see how X (William Dafoe), being a person who frequents high caliber hotels all over the world, ended up in a porta-crypt. Also, there seem to be too many ambiguous plot lines or cues that's either meaningless or completely open to interpretation. What's the significance of the tattoo on Sandii's (Asia Argento) belly? Was her deception both ways toward X? If it was, it was not implied at the end. Christopher Walken, William Dafeo were both good in the film, with Walken putting his quirky improvisations to his character and Dafeo serious and troubled as usual. The surprise was Asia Argento, who's sultry performance proves that not all non English speaking actresses has to act as if they are reading lines like the way Penelope Cruz does. Overall, a satisfactory film, giving a good visual and feel, but not dense enough in plot to make complete sense or to fill out the 90 minutes the movie takes.",
         "This film is based on a William Gibson short story by the same name in a collection of shorts titled \"Burning Chrome\". This story itself is less than a dozen pages with no quotation marks appearing anywhere in the print. From this short story with absolutely no dialog, master director Able Ferrara crafts a haunting film that is primarily dialog driven. The small cast's intimate conversations, which are woven together into a disjointed collage, are the heart of the film. One might assume that this divergence from the original media's style would result in a derivative work that no longer held true to the essence of the original. This is wonderfully not the case. This is one of my favorite Ferrara films, precisely because it translates the written work so aptly. This film is not intended for mass market appeal, but is instead uncorrupted artistic expression. I do not believe that this film was intended by the director to be a financial success (I wish it were so I could see more like it) but to be an artistic success. The film is technically a science fiction work because it is set in the future. This is a future of gritty realism. The filth, violence, and crime of our present has not been washed away by the years. It is omnipresent as always. Ferrara has used very few \"special effects\" to indicate future technology as there was no need to do so. In the decadent underworld that is his setting, said future tech is in cell phones and surveillance equipment which are subtle background, not flashy foreground. There are no laser guns or flying cars. This is a story about memory and feeling. It has a tendency to be non-linear. The music selected and performed in the film is a perfect compliment to the shadowy, disjointed imagery. The acting from everyone including the three principals, Walken, Dafoe and Argento, is superb. Ferrara films often involve small tight-knit casts with soulful dialog and this is more of the director and his cast at their best. This is a film from a lover of film to lovers of film."
      ],
      "genres": [
         "Drama",
         "Mystery",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Edward R. Pressman Film",
         "Quadra Entertainment"
      ],
      "summaries": [
         "Maas and Hosaka are two large Corporations in the future world. They are fighting to get control over the best minds of the world. The best is Hiroshi and at the moment he is working for the Maas Corporation. Fox has accepted an offer to persuade Hiroshi to go over to the Hosaka Corporation. Sandii is a little Italian girl from Japan and she should be the way to get to Hiroshi. X is the man who should train Sandii to break Hiroshi's Heart. But if X falls in love with Sandii? And if the Hosaka Corporation breaks the agreement? And if Sandii is not a little Italian girl?",
         "In the not-too-distant future, two New York businessmen plot to play two multinational rival corporations against each other, with a little help from a shady Italian street woman, to obtain an important Japanese businessman for the company they work at, only things are not always as they appear.",
         "Manhattan in the not-too-distant future seems a lot like Tokyo. Two friends who live on the margin try for one big score. One is Fox, older, limping, philosophical. The other is X. They stand to make $100 million from Maas, a conglomerate, if they can steal the secrets of a genetics company, Hosaka, and its genius leader, Hitoshi. They enlist Sandii, a call girl, to fly to Merrekech, where Hosaka's laboratory is, to seduce Hitoshi. During the set up, X falls in love with Sandii; Fox is cynical about the relationship. She heads for Morocco; Maas is ready to wire $100 million to a Swiss bank account; X fears for Sandii's safety. Will it all work out?"
      ],
      "budget": 0
   },
   "movielensId": 2892,
   "movielens": {
      "languages": [
         "日本語",
         "English",
         "Deutsch"
      ],
      "releaseDate": "1998-09-05",
      "dvdReleaseDate": "1999-12-14",
      "directors": ["Abel Ferrara"],
      "runtime": 93,
      "movieId": 2892,
      "title": "New Rose Hotel",
      "mpaa": "",
      "actors": [
         "Christopher Walken",
         "Willem Dafoe",
         "Asia Argento",
         "Gretchen Mol",
         "Annabella Sciorra",
         "John Lurie",
         "Victor Argo",
         "Ryuichi Sakamoto"
      ],
      "imdbMovieId": "0133122",
      "originalTitle": "New Rose Hotel",
      "genres": [
         "Drama",
         "Mystery",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["fphxoLT24Q4"],
      "plotSummary": "A corporate raider and his henchman use a chanteuse to lure a scientific genius away from his employer and family.",
      "tmdbMovieId": 21430,
      "avgRating": 2.4491,
      "releaseYear": "1998",
      "numRatings": 167,
      "posterPath": "/zRgR1UEHV7xolS2eE2W1uzH9F5I.jpg"
   }
}