{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "cruise",
            "id": 2799
         },
         {
            "name": "boat accident",
            "id": 3735
         },
         {
            "name": "ship",
            "id": 3799
         },
         {
            "name": "war",
            "id": 6091
         },
         {
            "name": "independent film",
            "id": 10183
         }
      ],
      "imdb_id": "tt0087188",
      "video": false,
      "title": "And the Ship Sails On",
      "recommendations": [
         53156,
         88051,
         54001,
         43444,
         108917,
         40985,
         101382,
         62655,
         2363,
         45213,
         65874,
         48883,
         32934,
         40110,
         93313,
         105067,
         107426,
         8749,
         47439,
         42502
      ],
      "backdrop_path": "/claHLMbK3lVwGDH1T9iV1xxTmOl.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 4,
               "character": "Orlando",
               "gender": 2,
               "credit_id": "52fe4412c3a36847f8080915",
               "name": "Freddie Jones",
               "profile_path": "/mh2aJ6fuzsjsCG8bNyelPuqPHt3.jpg",
               "id": 12517,
               "order": 0
            },
            {
               "cast_id": 5,
               "character": "Ildebranda Cuffari",
               "gender": 1,
               "credit_id": "52fe4412c3a36847f8080919",
               "name": "Barbara Jefford",
               "profile_path": "/czI2NodBaLWy6p5M9BNMpndJUnT.jpg",
               "id": 8926,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Sabatino Lepori",
               "gender": 2,
               "credit_id": "52fe4412c3a36847f808091d",
               "name": "Fred Williams",
               "profile_path": "/7smXq91kZxvmMke3CVDn4qrR4Mq.jpg",
               "id": 44358,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Sir Reginald J. Dongby",
               "gender": 0,
               "credit_id": "52fe4412c3a36847f8080921",
               "name": "Peter Cellier",
               "profile_path": "/khiG54WhC7OL79PuSXUErKzRvVl.jpg",
               "id": 44419,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Teresa Valegnani",
               "gender": 1,
               "credit_id": "52fe4412c3a36847f8080929",
               "name": "Elisa Mainardi",
               "profile_path": "/aeK2epnIFOOX8ad0d34Qzn2wC2U.jpg",
               "id": 44421,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Principessa Lherimia",
               "gender": 1,
               "credit_id": "52fe4412c3a36847f8080931",
               "name": "Pina Bausch",
               "profile_path": "/jnBBrvr0tTz5O5SJwyWV0HgztOO.jpg",
               "id": 402,
               "order": 5
            },
            {
               "cast_id": 12,
               "character": "Ziolev",
               "gender": 2,
               "credit_id": "52fe4412c3a36847f8080935",
               "name": "Maurice Barrier",
               "profile_path": "/hUUvXpAblnR5WWtfc2bnhqGand0.jpg",
               "id": 38499,
               "order": 6
            },
            {
               "cast_id": 16,
               "character": "Edmea Tutua",
               "gender": 1,
               "credit_id": "55b00a2d9251411e1400cfbf",
               "name": "Janet Suzman",
               "profile_path": "/qOgEIzgEC1dPZL5WNalnhhdfeC0.jpg",
               "id": 67026,
               "order": 7
            },
            {
               "cast_id": 8,
               "character": "Aureliano Fuciletto",
               "gender": 0,
               "credit_id": "52fe4412c3a36847f8080925",
               "name": "Victor Poletti",
               "profile_path": null,
               "id": 44420,
               "order": 8
            },
            {
               "cast_id": 10,
               "character": "Lady Violet Dongby Albertini",
               "gender": 1,
               "credit_id": "52fe4412c3a36847f808092d",
               "name": "Norma West",
               "profile_path": "/esFE4CBJE06T6jHpZWZt4Usrp4Q.jpg",
               "id": 44422,
               "order": 9
            },
            {
               "cast_id": 14,
               "character": "Dorotea",
               "gender": 0,
               "credit_id": "55b009f89251411e0f00cda3",
               "name": "Sarah-Jane Varley",
               "profile_path": null,
               "id": 1225042,
               "order": 10
            },
            {
               "cast_id": 15,
               "character": "Il Granduca",
               "gender": 0,
               "credit_id": "55b00a0e9251411e0b00cafb",
               "name": "Fiorenzo Serra",
               "profile_path": null,
               "id": 78700,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4412c3a36847f8080905",
               "name": "Federico Fellini",
               "profile_path": "/iNuDmm889WbZDK4k0qxsjeNnNhV.jpg",
               "id": 4415,
               "department": "Writing",
               "job": "Author"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a36847f808090b",
               "name": "Giuseppe Rotunno",
               "profile_path": null,
               "id": 15131,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe4412c3a36847f8080911",
               "name": "Gianfranco Plenizio",
               "profile_path": null,
               "id": 44418,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4412c3a36847f808093b",
               "name": "Federico Fellini",
               "profile_path": "/iNuDmm889WbZDK4k0qxsjeNnNhV.jpg",
               "id": 4415,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "55b00a44c3a3682ff900be3c",
               "name": "Tonino Guerra",
               "profile_path": "/5fO9Jrbnp0LbvVisSXhLJiVvxaL.jpg",
               "id": 15191,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "55b00a5e9251411e1100d0fc",
               "name": "Franco Cristaldi",
               "profile_path": null,
               "id": 2378,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "55b00a7192514172ef00ad36",
               "name": "Aldo Nemni",
               "profile_path": null,
               "id": 1489527,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "55b00a8492514125da00cacd",
               "name": "Renzo Rossellini",
               "profile_path": "/2ikIa0H6R1RlyHrERar6qb98WmA.jpg",
               "id": 543794,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "55b00a9b9251411e1100d100",
               "name": "Ruggero Mastroianni",
               "profile_path": null,
               "id": 32053,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "55b00ab29251411e0600cbe4",
               "name": "Dante Ferretti",
               "profile_path": "/nKAB8edn2JxVpnyfQAvfQnDJkVd.jpg",
               "id": 2366,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "587d5f5d9251413f3301eacb",
               "name": "Norma Giacchero",
               "profile_path": null,
               "id": 1740212,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Music",
            "id": 10402
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 2.823968,
      "production_countries": [{
         "iso_3166_1": "IT",
         "name": "Italy"
      }],
      "id": 5622,
      "vote_count": 24,
      "budget": 0,
      "overview": "In 1914, a cruise ship sets sail from Naples to spread the ashes of beloved opera singer Edmea Tetua near Erimo, the isle of her birth. During the voyage, the eclectic array of passengers discovers a group of Serbian refugees aboard the vessel. Peace and camaraderie abound until the ship is descended upon by an Austrian flagship. The Serbians are forced to board it, but naturally they resist, igniting a skirmish that ends in destruction.",
      "similar": [
         2142,
         3134,
         298312,
         11564,
         16869,
         2253,
         205,
         769,
         4771,
         227306,
         600,
         281,
         228150,
         339692,
         374720,
         281957,
         324786,
         395834,
         369885,
         445954
      ],
      "original_title": "E la nave va",
      "runtime": 128,
      "poster_path": "/kAJEaXgZ5sO0tBaB9By260JZUQg.jpg",
      "spoken_languages": [{
         "name": "Italiano",
         "iso_639_1": "it"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Societa Investimenti Milanese (S.I.M.)",
            "id": 93143,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Vides Produzione",
            "id": 93144,
            "origin_country": ""
         },
         {
            "logo_path": "/weCaiLyIQXuN7T5SH7zQEjQgUFs.png",
            "name": "Gaumont",
            "id": 9,
            "origin_country": "FR"
         },
         {
            "logo_path": "/4VVSVkcclvNiYzEO8Pxi7CxeiBt.png",
            "name": "RAI 1",
            "id": 7398,
            "origin_country": "IT"
         }
      ],
      "release_date": "1983-10-06",
      "vote_average": 7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Federico Fellini"],
      "runtime": 132,
      "synopsis": null,
      "writers": [
         "Federico Fellini",
         "Tonino Guerra"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0087188/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BODY1NzY3ODkyMV5BMl5BanBnXkFtZTcwODc2NjAzMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Freddie Jones, Barbara Jefford, Victor Poletti | See full cast and crew »"],
      "reviews": [
         "Conventional knowledge has it that the only film of Fellini's worth a damn after 8½ is Amarcord. Earlier this afternoon, I would have gladly agreed, but tonight I have discovered that this is a fallacy. I present to you And the Ship Sails On..., a film that is not only to be ranked alongside Fellini's permanent, almost unquestionable masterpieces, La Strada, Nights of Cabiria, La Dolce Vita, 8½, and Amarcord, but one to be ranked among the best works in cinema. Perhaps this is the most underrated film ever made by a true master, the man who literally was the first filmmaker to be called \"auteur\" by Andre Bazin in an article about Nights of Cabiria. I would describe this film as a close relative of Amarcord's. The style of characterization is identical - instead of of a close character study, the sort of characterization most film lovers tend to like, the characters in these two films are drawn more broadly, with more attention paid to unique physical features and behavioral quirks. This is all in an attempt to have the audience identify the characters - or, more precisely, caricatures (before he made movies, Fellini worked as a caricaturist on the streets of Rome) - in a stereotypical way. Take Titta's parents from Amarcord - they're whom we might draw if we were asked to draw bickering parents. Take the Duke from And the Ship Sails On - could you imagine a teenage, Teutonic duke any other way than Fellini presents him? You could also take it the other way - when you see this odd fellow on screen, do you have any doubt that he is Germanic royalty? The visual style is also similar to Amarcord's - that one was painted with cartoonish colors. And the Ship Sails On is also very colorful, but the palette is more specified here - a beautiful canvas of blue-grays and whites. The narrative styles of the two films differ quite a bit, but still are similar. Amarcord taps the vein of nostalgia - perhaps the most untapped of human emotions - for its affect. And the Ship Sails On seems to be going for absurdist, surreal satire. It's a genre that is more or less dead in the world of cinema, which is why, I assume, this film was such a bomb in 1984 and is relatively unknown today. Why satirize the aristocracy of the WWI era anyhow? That's a good question, but one that is not difficult to answer. I don't believe that Fellini meant the film as any kind of biting satire. It's all done in fun, although the juxtaposition of the rich with the Serbian refugees, whom the ship's crew finds afloat on sinking rafts one night, does ring with a certain painful and ironic truth about how the rich see the poor. Still, even though we might scoff at the way the aristocrats try to trace the roots of Serbian dances back to ancient times, the scene immediately following it, where those aristocrats go down on the deck to dance with the Serbians, is very entertaining and beautiful. The music in that scene, in fact, the music throughout the entire film, made me want to clap and dance. The actors move rhythmically as they progress through the film. I also have to add that Fellini never made a funnier film, at least of the ones I've seen, which are a majority of them (Toby Dammit of the omnibus film Spirits of the Dead comes very close). Most of this film's greatness lies in individual scenes, and thus, as you might guess, the sum is not exactly equal to the parts - at least as far as I saw, there's no real point - the substance is thin. But when style is this beautiful, I say screw substance. Each individual scene ranks among the best ever put to film - the wine glass concert, the scene where sunlight brightens one half of the ship and moonlight the other, the boiler room scene where the great opera singers compete vocally in order to impress the sailors below, the interview with the duke, and the opera singer's funeral. Each scene is so exquisitely created by Fellini and every other artist involved that it is entirely forgiveable if the audience remembers those individual images rather than an overall effect. For me, the combination did have an overall effect: I was so awestruck that I was weeping, though there was nothing onscreen to weep at. 10/10.",
         "A glittering gem of a movie that I feel deserves more attention in Fellini's canon. The motif of the ending of an era and the films positioning near the end of his career make for a particularly poignant expression. I think it is a tendency for most artist's to be seen to be at the height of their power somewhere in mid-life. Although Fellini's most challenging and provocative work preceded And the ship sails on, I can't say any are more poetic than it. It's rich sentimentality beautifully positions individual stories within the tapesty of larger world events oblivious to these characters. This film is also worth seeing if only for the stunning visuals, and the glorious music!",
         "Fellini's worst film? What nonsense! If you want that \"Satyricon\" is waiting for you. Antonioni has called this one of his favorite Fellini films and after seeing it myself, I knew he didn't make that judgment rashly. \"And the Ship Sails On\" is a thoroughly 'modern' film and one of the maestro's best--certainly as good as \"Amarcord,\" and probably better. It is less crudely silly and linear than \"Amarcord\" and harder to understand for anyone not intersted in progressive cinema, much more ambiguous, flexible and prone to take risks. To even breath the climate of opinion which deigns to compare this ambitious masterwork to an overblown piece of commercial fluff like 'Titanic' is nauseating. The fact that both films happen to take place on the deck of a ship is their only similarity and the 'message' of Titanic has absolutely nothing do with what Fellini was trying to say. Fellini doesn't make 'allegories' of society; at his best, he makes 'allegories' of 'allegories.' His sense of humor goes deep enough to include ridicule of people who take allegories too seriously within his allegories, hence his true artistry. And those kinds of people, obviously, sense that the joke is on them, and don't particulary like this film. The level on which Fellini succeeds is invisible to them, outside their conditioning. And often they claim to be bored just to cop-out on having to examine themselves and their ingrained ways of thought and judgment too closely. In fact, you could write a whole book analyzing \"And the Ship Sails On\" solely on its deep artistic value and another on all the great things in this film that certain 'cultured' people don't get because of their particular brand of 'high-brow' conditioning. \"And the Ship Sails On\" is a PURE film, folks, one of the few amidst an ocean of endless mediocrity; and that is the hardest thing to achieve when trying to integrate as many elements as Fellini tries for (he himself has failed many times precisely because he was seeking purity within excess and got lost). He tried for it all and got the balance right this time. It is both satirical and deeply serious, excessive and understated. It is a totally stylized non-sentimental 'sentimental' work in the best sense. It works on many levels and transcends petty criticism from anyone too busy making mountains out of the latest flashy molehill that caters directly to their tastes. This film isn't traditional cinema, it is progressive all right, but it will be ready for you as soon as you're ready for it. Watch it for yourself with an open mind (whenever you're ready for it) and experience the power of art: it's worth more than you've been taught to think it is.",
         "\"E la nave va\" is one of the best films made by Fellini, which I see as the best film director ever. Just two personal comments about it. First, I have seen it in 1985, when in Romania a dark dictatorship saved hard currency by preventing foreign films to be imported. It was presented during a festival arranged by the Italian Embassy. Combine the local cultural desert and the post-modern style of this film and you'll understand why, after the film ended, I wanted to have just a walk-on part on it. My wife just proposed to pay the projectionist to run it again. The second comment is about a strange premonition Fellini had about the conflict in Serbia/Yougoslavia. Each time I see \"E la nave va\", I'm deeply moved about the ending, masterly contrasting bold opera music and the vanishing of a certain Europe.",
         "There is no mistaking a Fellini film, even when you only catch the last 30 minutes, as I did when channel surfing. I made an effort to catch the full film next time it was shown, and was rewarded with a stunning feast. Not one of Fellini's best (or worst excesses) depending on your opinion of Fellini, but images that will stay with me for many years. Like Ken Russell, Fellini can always be depended on to go way over the top and never do anything by halves. The story of a group of rich aristocrats, opera singers, hangers on and just plain rich accompanying the body of a great opera singer to her cremation on the island of her birth in 1914, is shown in Fellini's stylised fashion as an allegory on the decline of Europe in WWI. The opulent excess of the doomed rich lifestyle, which no matter how hard they tried, was never regained, contrasts with the workers slaving in order to enable the rich to enjoy that elegant privileged lifestyle. The scene where the passengers tour the boiler rooms, standing on a cat walk to look down on the stokers shovelling coal into the boilers and trilling arias while the stokers took off their caps to show respect, made me hope the catwalk would collapse and plunge the passengers into the furnace. The stylistic storytelling reminded me of \"Oh what a lovely War\" Joan Littlewood's depiction of WWI as a series of songs and dances by a seaside concert party. If you want reality, you can look out of the window every day and see reality. Sometimes a surrealist view puts a different window on things. The stupendous finale of the movie is enough to make the film worthwhile if nothing else.",
         "Fellini accomplishes more in the first 15 minutes than many directors accomplish in a film. His ending (as always) is equally superb. Don't think I'm suggesting the middle is poor! Watch this instead of Titanic.",
         "When younger, I was a Fellini obsessive - I adored the excess, the humour, the grotesquerie, the sympathetic comedie humaine, the audacious visuals, the beautiful, sad, lonely Marcello Mastroianni. For some reason I hadn't seen one of his pictures for a while, and while his astounding images remained inviolable in my mind's private cinema, the gradual, repeated decline of his critical status made me tread fearfully into this nautical drama. It is clearly his worst film. It always threatens to break into a frenzied dance of the Id, like his best pictures, but never quite does. The acting is generally poor, the dubbing atrocious; the ideas seem to cancel each other out in an aimless mess. Fellini's style is more restrained than usual, with a greater, seemingly restricted, emphasis on content composition and montage. It is clearly the work of a jaded Maestro. And yet it contains more life, wit and magic than most films this year, and, needless to say, it is less silly than Titanic. The story (a group of mourners carrying the body of a celebrated opera singer on a huge liner as World War I breaks out) is open to many allegorical interpretations (ship as nation, empire, class, art, life etc.), none of which quite fit. There is much play on images of moon (Claire de lune tinkles throughout), tides and sunsets - possibly as motifs of decline, but also of the ever-continuing circle that is its opposite, life? The film's tone is ambivalent, nostalgic for an elegant age of art and beauty, yet coldly aware of its inhuman faults. This is epitomised by the trademark Fellini altar ego, a journalist/film narrator, who watches the mixture of tragedy and farce with an amused eye, yet desperately wants to belong, and share in its faded grandeur. There are wonderful set-pieces, and graceful, Kubrickian camera movements. The narrative and characterisation is constantly splintered, mocking the desire of the passengers for order and rank. Imperial folly is angrily lampooned, culminating in a remarkable burlesque dogfight, stylised as a Verdi opera, yielding, in impotent terror, the Force of Destiny. The classical music soundtrack initially seems bland and uninventive, but actually offers, once identified, a stunning, ironic commentary on the actions, pretensions, sadnesses and failures of the characters and the society they represent. The party scene with the Serbs is very moving - loaded with the mixture of anger and regret that constitute the film's heart. The self-reflexivity does not patronise the audience for giving into illusion - the film's 'reality' is in question from the beginning. Film is shown not to be a modern weapon of the future (cinema as an art-form emerged at around the same time as the film was set), but merely a skip for the bricolage of Europe and the past. This pessimism, though, is not despairing - there is great beauty in loss.",
         "This film is strange and beautiful- some of the scenes remain with me though I haven't seen it for 12 years. Most of all I recall the scene where the ship takes on a group of refugees somehow this funeral ship with its cargo of grieving operatic elite and exhausted stateless and utterly impoverished people becomes an image of great compassion and humanity and optimism even. I don't \"understand\" Fellini's films but I \"felt\" this one very passionately.",
         "first five minutes of `E La Nave Va` was what attracted me most from this movie (not meaning that the rest of it was not interesting). i thought that it should be a silent movie but then i realized that there were some inaudible voices coming from the background. then i asked myself whether there's a problem with the sound system or not. but just as i was thinking about this, voices started to be audible. and the black and white movie became coloured when the ashes were taken to the ship with ceremony. i guess the purpose of using black and white and silent cinema techniques before the ship scenes was to underline the fact that the important factor in the film was the ship itself. life without the ship was black and white (probably meaning boring and full of cliches). but when we enter the world inside the ship (or when we enter the world through Fellini's eyes), we see that there are lots of differences from reality. and that makes the ship coloured! Fellini had created so many symbols including the rhinoceros and the ship itself. but these symbols are not so clearly defined so after watching the film, the audience leaves with some question marks. even if you are not interested in the plot, watch this for a good visual treat. Fellini has reminded me that the cinema is an art which underlines the importance of visual structure.",
         "Fellini is a visionary mystic. He sees what he knows before he figures it out. So we have set design, costume design, even character design, before he fills things in with his narratives and allegories. I know this, so don't come to be disappointed when the stories and allegories do not quite work. It is the sign of risktaking that he allows his vision to outrace his sense. Shakespeare thought \"The Tempest\" would be his last play. The technology of the stage had left him behind, so in a sort of final flourish built a play that exploited the new special effects, costume and stage technologies, far better than his contemporaries. And within that he placed a surrogate of himself. The play is full of deep observations on the nature of life and reason. Each of these is essential to his purpose, which was to present himself through ideas. Few of these were necessary to advance the story. Much was made of the plays within the play and who controls what elements of them Fellini similarly believed this to be his final film. At 62, already advised that his heart would give out, he poured everything he wanted to say into this. Yes, he always did that, but this time he used \"The Tempest\" as his guide. Afterwards he would go to Peru for inspiration. The film is folded into a literal opera, an opera about the life of a famous opera star, which morphs from small stories (a singoff in the boiler room) into an opera of war. Orthogonally, the film is folded twice into an inner film being made of the event and an outer film of the film. The way we are introduced to these two devices simultaneously is one of the most trilling beginnings in the history of cinema. There is an inner, inner séance. As a film experience, it is much like \"Duck Soup,\" where the fakery and frippery is exposed and unremarked on: in the thing itself; in the ridiculous pomp of \"royalty;\" in the strutting of the artists, all conflated. I would have been tempted to give this the honor of being one of the two Fellini films I set as fours. That would be because when a man prepares to die, it matters what he says. But it so happens that he thought the same before the two I picked. Ted's Evaluation -- 3 of 3: Worth watching."
      ],
      "genres": [
         "Drama",
         "History",
         "Music"
      ],
      "productionCompanies": [
         "Rai 1",
         "Vides Produzione",
         "Gaumont"
      ],
      "summaries": [
         "In July 1914 a luxury cruise ship leaves Italy with the ashes of the famous opera singer Tetua. The boat is filled with her friends, opera singers, actors and all kinds of exotic people. Life is sweet the first days, but on the third day the captain has to save a a large number of Serbian refugees from the sea, refugees who has escaped the first tremors of WWI.",
         "In 1914, a luxury ship leaves Italy in order to scatter the ashes of a famous opera singer. A lovable bumbling journalist chronicles the voyage and meets the singer's many eccentric friends and admirers."
      ],
      "budget": 0
   },
   "movielensId": 2897,
   "movielens": {
      "languages": ["Italiano"],
      "releaseDate": "1983-10-06",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Federico Fellini"],
      "runtime": 128,
      "movieId": 2897,
      "title": "And the Ship Sails On",
      "mpaa": "",
      "actors": [
         "Freddie Jones",
         "Barbara Jefford",
         "Fred Williams",
         "Peter Cellier",
         "Elisa Mainardi",
         "Pina Bausch",
         "Maurice Barrier",
         "Janet Suzman",
         "Victor Poletti",
         "Norma West",
         "Sarah-Jane Varley",
         "Fiorenzo Serra"
      ],
      "imdbMovieId": "0087188",
      "originalTitle": "E la nave va",
      "genres": [
         "Music",
         "Comedy",
         "Drama"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In 1914, a cruise ship sets sail from Naples to spread the ashes of beloved opera singer Edmea Tetua near Erimo, the isle of her birth. During the voyage, the eclectic array of passengers discovers a group of Serbian refugees aboard the vessel. Peace and camaraderie abound until the ship is descended upon by an Austrian flagship. The Serbians are forced to board it, but naturally they resist, igniting a skirmish that ends in destruction.",
      "tmdbMovieId": 5622,
      "avgRating": 3.5534,
      "releaseYear": "1983",
      "numRatings": 206,
      "posterPath": "/kAJEaXgZ5sO0tBaB9By260JZUQg.jpg"
   }
}