{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "musical",
            "id": 4344
         },
         {
            "name": "giant",
            "id": 189099
         }
      ],
      "imdb_id": "tt0031397",
      "video": false,
      "title": "Gulliver's Travels",
      "recommendations": [
         207249,
         193691,
         48734,
         120672,
         32618,
         48649,
         685,
         146523,
         123742,
         44201,
         31309,
         340336,
         174298,
         67654,
         175916,
         129339,
         144694,
         110760,
         48712,
         19013
      ],
      "backdrop_path": "/u7wiQJGzK7iQS9MgtPnJVOSWOmm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 5,
               "character": "Prince David (singing voice)",
               "gender": 0,
               "credit_id": "52fe4607c3a36847f80e8287",
               "name": "Lanny Ross",
               "profile_path": "/qA7d93HY7h2n7ocDFbkCxQNSJn.jpg",
               "id": 143466,
               "order": 1
            },
            {
               "cast_id": 6,
               "character": "Gulliver (voice)",
               "gender": 2,
               "credit_id": "52fe4607c3a36847f80e828b",
               "name": "Sam Parker",
               "profile_path": null,
               "id": 143467,
               "order": 2
            },
            {
               "cast_id": 7,
               "character": "Gabby (voice) (uncredited)",
               "gender": 2,
               "credit_id": "548f45ab92514122f9007f01",
               "name": "Pinto Colvig",
               "profile_path": "/iHUSTwJAlqn0OzZpjiZwrkRgzXq.jpg",
               "id": 5462,
               "order": 3
            },
            {
               "cast_id": 8,
               "character": "King Little (voice) (uncredited)",
               "gender": 2,
               "credit_id": "548f45c792514122fc0071c6",
               "name": "Jack Mercer",
               "profile_path": "/9CcSlpFjah1PpIT5GwbBBFeYwtC.jpg",
               "id": 1004823,
               "order": 4
            },
            {
               "cast_id": 9,
               "character": "Prince David (voice)",
               "gender": 0,
               "credit_id": "555a3b149251416a2300015c",
               "name": "Cal Howard",
               "profile_path": null,
               "id": 785866,
               "order": 5
            },
            {
               "cast_id": 10,
               "character": "King Bombo (voice)",
               "gender": 2,
               "credit_id": "555a3b1fc3a368777200cb89",
               "name": "Tedd Pierce",
               "profile_path": "/ht68ljmTR1h1Z0sm3Wv99EiOnrz.jpg",
               "id": 375782,
               "order": 6
            },
            {
               "cast_id": 11,
               "character": "Princess Glory (voice)",
               "gender": 0,
               "credit_id": "555a3b2a92514125760004e5",
               "name": "Livonia Warren",
               "profile_path": null,
               "id": 1468772,
               "order": 7
            },
            {
               "cast_id": 12,
               "character": "Princess Glory (singing voice)",
               "gender": 0,
               "credit_id": "5584e246c3a3685034002003",
               "name": "Jessica Dragonette",
               "profile_path": "/hqljNNx78vhWTrAHvcLuNgejT8P.jpg",
               "id": 1238764,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4607c3a36847f80e8273",
               "name": "Dave Fleischer",
               "profile_path": "/343V4i0ekU4crsfk88YtPqFQld7.jpg",
               "id": 143463,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4607c3a36847f80e8279",
               "name": "Jonathan Swift",
               "profile_path": null,
               "id": 143464,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe4607c3a36847f80e827f",
               "name": "Edmond Seward",
               "profile_path": null,
               "id": 120326,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "58d3af149251411faa0132d3",
               "name": "Max Fleischer",
               "profile_path": "/aJ0qMwEE4koHjO7CpUriOOnsgai.jpg",
               "id": 606084,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Animation",
            "id": 16
         },
         {
            "name": "Family",
            "id": 10751
         }
      ],
      "popularity": 2.405037,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 42518,
      "vote_count": 35,
      "budget": 0,
      "overview": "Gulliver washes ashore on Lilliput and attempts to prevent war between that tiny kingdom and its equally-miniscule rival, Blefiscu, as well as smooth the way for the romance between the Princess and Prince of the opposing lands. In this he is alternately aided and hampered by the Lilliputian town crier and general fussbudget, Gabby. A life-threatening situation develops when the bumbling trio of Blefiscu spies, Sneak, Snoop, and Snitch, manage to steal Gulliver's pistol.",
      "similar": [
         812,
         10530,
         11224,
         38757,
         872,
         224141,
         14128,
         16119,
         8587,
         9479,
         10882,
         9444,
         34584,
         9325,
         10545,
         134,
         15969,
         49051,
         81005,
         46195
      ],
      "original_title": "Gulliver's Travels",
      "runtime": 76,
      "poster_path": "/tmbkx9I7t11qKF0e688o0XwcTCj.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Fleischer Studios",
            "id": 8302,
            "origin_country": ""
         }
      ],
      "release_date": "1939-11-10",
      "vote_average": 6.3,
      "belongs_to_collection": null,
      "tagline": "The Amazing Characters in Jonathan Swift's Immortal Fantasy Come To Life !",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Dave Fleischer"],
      "runtime": 76,
      "synopsis": null,
      "writers": [
         "Jonathan Swift",
         "Edmond Seward"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0031397/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY1Mjk2MjQyMV5BMl5BanBnXkFtZTcwMTYxNjgyMg@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Jessica Dragonette, Lanny Ross, Pinto Colvig | See full cast and crew »"],
      "reviews": [
         "Just throw any negative comments you read here from IMD comment contributors in the wastebasket. I don't know what they were smoking. Gulliver's Travels is beautiful! It is just as beautiful now as it was 60-plus years ago when it premiered, perhaps even moreso with the wonderful restoration we have now on DVD. This film doesn't have to compete with anything by Disney, and I don't see how this story has anything to do with Snow White. It stands on its own two feet as a captivating and charming classic story that children can enjoy over and over again, made when animation was really animation, and all the cells were handpainted by artists, instead of slopped together on boring, cookie-cutter computer models. The storyline is perfect and has an anti-war undertone that was a bit daring for its time, made on the eve of World War Two. Even Disney's Snow White didn't have the guts to do that! So kudos to the Fleischer Brothers! The songs are all wonderful and the soundtrack sounds marvellously enhanced on the new DVD version. \"We're All Together Now\", \"All's Well\", \"It's A Hap Hap Happy Day\", \"Bluebirds In The Moonlight\", and especially the haunting \"Come Home Again, Sailor Man\" are all perfect and flow into the action of the film, instead of being placed there with no relevance just to try and get a hit song. These sheet music pieces always sell well on Ebay, highlighting the fact quite clearly that this is one of the most beloved animation movies of all time.",
         "I've seen this many times over the years, and it's one of my absolute favorites. Some folks seem to think the Fleischers have to take a back seat to Disney. NOT !! They were, in many instances ( such as this one), far more inventive than Disney, and their work did not lose touch with common emotions,and had broad-based appeal to all ages, despite technical complexity. Mickey Mouse will never go off the air. But neither will Betty Boop or Popeye. In its own special way, \"Gulliver's Travels\" rivals the Disney features with its complexity, and its lack of laziness. If you really look at it, and keep in mind that this is animation done by hand...the old fashioned way, you will have a keener appreciation for the hard work that went into it. In those days, Disney and the Fleischers had to run the studios like a factory. It took teams of men in units and working shifts to concentrate on just the movements of the characters to make them appear lifelike (not like the computer animation of to-day, or even the TV animation of UPA or Hanna-Barbera in the 1950s). \"Roto-scoping\", a process invented by the Fleischers, made the task that much more daunting. But the Fleischers had to be \"perfectionists/masochists\". The love of their craft shows in the movements, the backgrounds, the stories, and the music...not to mention the characters. I am truly taken with the score. It is warm and dreamy and romantic....tearful to some. Some folks can't get with it, but it's a shame we don't don't hear much real music like that anymore in the mainstream. Win Sharples and Victor Young did a very fine job...one of the best of All cartoon scores. Work on this film appears to have gotten Win Sharples the scoring job for the Fleischers, one he held down after the Fleischers were given the gate by Paramount, and which he continued to hold until Famous Studios was padlocked. I can't recommend this feature highly enough. It's good clean fun, an accurate character study, terrific music, animation...the \"whole nine\".",
         "Talk about unforgettable music! I saw \"Gulliver's Travels\" forty years ago on Saturday-afternoon television, and I can STILL hum much of the Ralph Rainger/Leo Robin score, especially \"Faithful\", \"Forever\", \"Faithful Forever\", \"We're All Together Now\", and \"Orchids in the Moonlight\". What a songwriting team they were. It's impossible to not compare \"Gulliver's Travels\", and its songs, to today's animated product, and it's sad when I try. The knack seems to be lost in all regards. Lanny Ross and Jessica Dragonette, top radio stars of the period, actually enunciate the lyrics, and in tune, and with varying dynamics. What a relief to remember a time when that was mandatory in film music. And we can also luxuriate in the well-drawn visuals, which allows the audience time to wallow in the rich colors and narrative (without the slam-bang short-attention-span cutting that sea-sickened me during \"Atlantis\" and similar Y2K material). Give the youngsters a taste of the Golden Age of animation, songwriting and storytelling with \"Gulliver's Travels\", and take the time to enjoy it with them. Highest recommendation. ****",
         "\"Gulliver's Travels\" is one of the great animated features of its' time. It was made as a response to Disney's wildly successful \"Snow White and the Seven Dwarfs\". Today, \"Gulliver's Travels\" is not accorded the same respect as the Disney pictures and is pretty much forgotten. Why? This is as good as \"Snow White\". After all, it was made by the Fleischer brothers, contemporaries of animation and in my opinion, geniuses. They made the 17 classic Superman shorts that still spellbind people today, including myself. They made those classic 20 minute plus Popeye shorts. Betty Boop, Grampy, Screen Songs, Little Lulu, Gabby (spawned from this feature) the list goes on. Famous Studios was one of the most prolific animation studios of its' time. While purists may complain that it doesn't stay faithful to the book, I think the changes are appropriate. What kid would understand Swift's social satire? What adult would really want to see a wholly faithful cartoon of the book. Besides, we have the 1996 epic film with Ted Danson to go to with accuracy. The songs are surprisingly great considering how some can be overkill in a film like this. The characters are endearing and the story is solid and involving. What more could you ask for? **** out of 4 stars",
         "My mother broght this for me on VHS when I was around six or seven years old. I watched it so much I wore the tape out. While shopping in the grocery store last week I happened upon this classic on DVD. I thought this would be a great way to let my children watch something that I used to watch as a tyke. They loved it. And I even at 27 years old found myself watching it with the same enthusiasm as I did when I was but a mere pup. beatufil animation even in the computer age. Rivals anything done today.",
         "Shipwrecked by a storm in 1699, Dr. Lemuel GULLIVER'S TRAVELS would bring him to a strange island inhabited by tiny little people. While not one of the great animated features (it was only the second released in the United States, Disney's SNOW WHITE AND THE SEVEN Dwarfs in 1937 being the first) GULLIVER'S TRAVELS is an enjoyable film which should bring pleasure to uncritical viewers. Technically it is well made, with Technicolor animation of a generally high quality. The movie's main drawback is that none of the characters really have any 'heart' - they don't come alive on the screen in the way Jiminy Cricket would a year later in PINOCCHIO. However, it is ultimately unfair to compare the Fleischer Studio output with that of Disney. Max & Dave Fleischer had their own star to follow; their contribution - and it would be a considerable one - would be in the realm of the one-reel cartoon. With their POPEYE and BETTY BOOP series they created alternate realities as viable as any produced by other cartoon studios. GULLIVER was their first foray into feature length animation (HOPPITY GOES TO TOWN would be their second in 1941), and eventually they would expend their energies again on the cartoon short subject, including the highly acclaimed SUPERMAN series which would commence in 1941. GULLIVER'S TRAVELS is of course based on the classic novel by Jonathan Swift (with a little nod to Shakespeare's Romeo and Juliet) focusing only on the section dealing with the minuscule kingdoms of Lilliput and Blefuscu. In place of Swift's irony is a great deal of slapstick, but such is the nature of the animated cartoon. The personalities of the royal youngsters, one from each of the rival nations, is left completely unexplored and their romantics is at the expense of more screen time with Gulliver, as are the exploits of the three incompetent Blefuscu spies. The film's main character is actually night watchman Gabby, who isn't very appealing (yet not too repellent to spawn a few further cartoons featuring his exploits). The film is at its best when it de-emphasizes plot for the visuals, as in the binding & transportation of the giant, or when the rotoscoped Gulliver tows the entire hostile fleet from Blefuscu up onto the beach by the ships' anchor chains. Jack Mercer, famous as the voice of Popeye, here speaks for silly King Little. Pinto Colvig (best known as the original voice of Disney's Goofy) provides the vocals for Gabby. Gulliver is voiced by Sam Parker, while Jessica Dragonette & Lanny Ross sing for Princess Glory and Prince David. The film has some pleasant songs including 'All's Well' and the Oscar nominated 'It's A Hap Hap Happy Day.' The two national anthems, 'Faithful' & 'Forever,' are fine romantic tunes which deserve to be rediscovered. It is unfortunate that the Fleischers' remarkable Stereoptical Process, which could produce beautiful 3-D effects, is only glimpsed for a few moments during the opening credits.",
         "The Fleischer studios were best known for their \"Popeye\" and \"Superman\" shorts, but the caliber of animation and story-telling in this 1939 feature-length film were on a par with Disney at that time. Had they not gone bankrupt in 1942, I suspect they would have surpassed Disney in many ways. The idea here was to do Disney's \"Snow White\" one better, and they came very, very close. The restored edition on DVD shows the depth and beauty of the artwork to perfection. Fleischer was even perfecting a \"stereo-optic\" process to add 3-dimensional depth to their images which was used in this film to good effect. The music is typical of the period, rather sugary for today's tastes, and the \"Gabby\" character introduced in this movie isn't nearly as funny as they seemed to think at the time. (Two \"Gabby\" shorts are also included on the DVD; draw your own conclusions.) I can only guess at the reactions of movie-goers who first saw this film in 1939, but I suspect that they were blown away by the sheer scope of the artwork. Gulliver is a \"man-mountain\" to the Lilliputians, and the scale and perspective between him and the \"tiny people\" is perfect throughout the film. The sequence where the tiny townspeople use a variety of skills to truss up the sleeping \"giant\" and cart him (literally!) to their king's palace is, by itself, worth the price of the entire movie. The pacing is a bit slow during the first part of the film, but the filmmakers do a nice job of setting up the conflict between the two tiny kingdoms, which (true to the spirit of Swift's story) is caused by the pride of the rival kings. I would've preferred less \"Gabby\" in this sequence, but I understand they were trying to establish a new character to compete with the Mouse. If you like good animation, you will enjoy this DVD.",
         "I thought that it was well done. The script closely parallel the book. This animation and love ballad must be critiqued in the context of it's time. Filmed in Techi-color and just the second full-length animated feature, it rivalled many of the light musicals on the silverscreen in the 1930's. If you have not seen it, judge for yourself.",
         "..The Fleischer Brothers in Florida wanted to establish an East Coast \"Disney\" Studio, so they turned out some fine shorts and even some cartoon-features ..Production and artwork at times, were very-very good. Though their best efforts may have been the 4O's Superman color cartoons, many fans believe\"Gulliver\" an excellent effort to try and match \"Snow White\"...and as a new cartoon-factory ..they almost did it with this feature. It had some memorable moments to see and songs to hum. This is a real Favorite ...FOR MANY....!",
         "I remember watching very few movies and even less television as a child. This was one of the movies that I would check out periodically from the main branch of the library and I remember it being a very special treat. I had forgotten about it completely until recently I found it laying on a shelf in my local Wal Mart for a dollar. I bought it and watched it a few days later. Looking at it through adult eyes, I saw that yes, the animation was poor, the singing extremely \"60s choir\" and not at all pleasant. The dialog and storyline were hardly complex but then again, what episode of \"Barney\" has complex dialog and storyline? It's a kids' movie and personally, I think kids would benefit far more from watching this than \"Barney\"! Gulliver's Travels is the timeless story of a man who washes up on the shore of a country inhabited by little people. While the town crier strives to inform the king that \"There's a giant on the beach!\", the king is planning a fantastic wedding for his daughter, who is engaged to the prince of a neighboring country. A simple disagreement between the two monarchs leads to war and Gulliver looks to find a way to make peace between them. I laughed harder over this movie than I have over most of Disney's new fare. It's not rocket science, but it's a nice way to spend 78 minutes, especially if you're only five years old or remember this movie from childhood."
      ],
      "genres": [
         "Animation",
         "Adventure",
         "Family",
         "Fantasy",
         "Romance"
      ],
      "productionCompanies": [
         "Fleischer Studios",
         "Paramount Animation"
      ],
      "summaries": ["Gulliver washes ashore on Lilliput and attempts to prevent war between that tiny kingdom and its equally-miniscule rival, Blefiscu, as well as smooth the way for the romance between the Princess and Prince of the opposing lands. In this he is alternately aided and hampered by the Lilliputian town crier and general fussbudget, Gabby. A life-threatening situation develops when the bumbling trio of Blefiscu spies, Sneak, Snoop, and Snitch, manage to steal Gulliver's pistol."],
      "budget": 700000
   },
   "movielensId": 2899,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1939-11-10",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Dave Fleischer"],
      "runtime": 76,
      "movieId": 2899,
      "title": "Gulliver's Travels",
      "mpaa": "G",
      "actors": [
         "Lanny Ross",
         "Sam Parker",
         "Pinto Colvig",
         "Jack Mercer",
         "Cal Howard",
         "Tedd Pierce",
         "Livonia Warren",
         "Jessica Dragonette"
      ],
      "imdbMovieId": "0031397",
      "originalTitle": "Gulliver's Travels",
      "genres": [
         "Action",
         "Adventure",
         "Animation",
         "Family"
      ],
      "youtubeTrailerIds": ["4l_C7TmcTXo"],
      "plotSummary": "Gulliver washes ashore on Lilliput and attempts to prevent war between that tiny kingdom and its equally-miniscule rival, Blefiscu, as well as smooth the way for the romance between the Princess and Prince of the opposing lands. In this he is alternately aided and hampered by the Lilliputian town crier and general fussbudget, Gabby. A life-threatening situation develops when the bumbling trio of Blefiscu spies, Sneak, Snoop, and Snitch, manage to steal Gulliver's pistol.",
      "tmdbMovieId": 42518,
      "avgRating": 3.31507,
      "releaseYear": "1939",
      "numRatings": 730,
      "posterPath": "/tmbkx9I7t11qKF0e688o0XwcTCj.jpg"
   }
}