{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "based on novel",
            "id": 818
         },
         {
            "name": "experiment",
            "id": 1706
         },
         {
            "name": "paralysis",
            "id": 5859
         },
         {
            "name": "revenge",
            "id": 9748
         },
         {
            "name": "rage",
            "id": 14837
         },
         {
            "name": "monkey",
            "id": 15149
         },
         {
            "name": "disability",
            "id": 162735
         },
         {
            "name": "science run amok",
            "id": 209152
         },
         {
            "name": "animal testing",
            "id": 211000
         }
      ],
      "imdb_id": "tt0095652",
      "video": false,
      "title": "Monkey Shines",
      "recommendations": [
         23730,
         13555,
         46885,
         26517,
         19158,
         8973,
         24913,
         49684,
         40095,
         28942,
         24274,
         34311,
         40969,
         10725,
         28153,
         22307,
         40219,
         29514,
         26677,
         11503
      ],
      "backdrop_path": "/gAv8v1OkLbDwNTw33BGcHh3spp3.jpg",
      "revenue": 5344577,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Allan Mann",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e07999d",
               "name": "Jason Beghe",
               "profile_path": "/40zZ4qMshTN1yroHjj508RrmuSZ.jpg",
               "id": 37203,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Geoffrey Fisher",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799a1",
               "name": "John Pankow",
               "profile_path": "/lxIRscTanoBXX0R3lFTChHNfLbv.jpg",
               "id": 59872,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Melanie Parker",
               "gender": 1,
               "credit_id": "52fe45f9c3a368484e0799a5",
               "name": "Kate McNeil",
               "profile_path": "/nYu61OeGsSwBj9lwNyQ50rcd0nu.jpg",
               "id": 104873,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Dorothy Mann",
               "gender": 1,
               "credit_id": "52fe45f9c3a368484e0799a9",
               "name": "Joyce Van Patten",
               "profile_path": "/wEUXn5Zgz88SZlTLZPrecfxGFOO.jpg",
               "id": 14108,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Maryanne Hodges",
               "gender": 1,
               "credit_id": "52fe45f9c3a368484e0799ad",
               "name": "Christine Forrest",
               "profile_path": null,
               "id": 100507,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dean Burbage",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799b1",
               "name": "Stephen Root",
               "profile_path": "/sceCvLiv8xe2jQzrVn39wvosVHG.jpg",
               "id": 17401,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Dr. John Wiseman",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799b5",
               "name": "Stanley Tucci",
               "profile_path": "/omGlTJF2IW5r3L3c5y0qkCt3hFr.jpg",
               "id": 2283,
               "order": 6
            },
            {
               "cast_id": 14,
               "character": "Charlie Cunningham",
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799d7",
               "name": "Tom Quinn",
               "profile_path": "/goJeBvmLYutE2LYCoxGKTPxjGgA.jpg",
               "id": 1115118,
               "order": 7
            },
            {
               "cast_id": 17,
               "character": "Linda Aikman",
               "gender": 1,
               "credit_id": "547a9c39c3a3685c48003f85",
               "name": "Janine Turner",
               "profile_path": "/52pvn7fi9siuBGwntyklTHpHxCI.jpg",
               "id": 51580,
               "order": 8
            },
            {
               "cast_id": 18,
               "character": "Doc Williams",
               "gender": 2,
               "credit_id": "547a9c48c3a36848e300187e",
               "name": "William Newman",
               "profile_path": "/tSFsRnK1jfCc50yinO5MpFnJL3c.jpg",
               "id": 77027,
               "order": 9
            },
            {
               "cast_id": 19,
               "character": "Esther Fry",
               "gender": 0,
               "credit_id": "547a9c56c3a36877f0000340",
               "name": "Tudi Wiggins",
               "profile_path": null,
               "id": 1232929,
               "order": 10
            },
            {
               "cast_id": 20,
               "character": "Party Guest",
               "gender": 1,
               "credit_id": "547a9c6dc3a36835be0012f1",
               "name": "Patricia Tallman",
               "profile_path": "/jl8F0Nv4dQJqg1014baS5eiHWaR.jpg",
               "id": 11768,
               "order": 11
            },
            {
               "cast_id": 27,
               "character": "Anesthetist",
               "gender": 2,
               "credit_id": "58bb4b79925141607302acde",
               "name": "David Early",
               "profile_path": null,
               "id": 15074,
               "order": 12
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e079999",
               "name": "George A. Romero",
               "profile_path": "/zNP7wdy48eNNJAAmM0pYbSelUAd.jpg",
               "id": 14999,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799bb",
               "name": "George A. Romero",
               "profile_path": "/zNP7wdy48eNNJAAmM0pYbSelUAd.jpg",
               "id": 14999,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799c1",
               "name": "Charles Evans",
               "profile_path": null,
               "id": 66876,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45f9c3a368484e0799c7",
               "name": "Pasquale Buba",
               "profile_path": null,
               "id": 15840,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "536a4d11c3a3681231008113",
               "name": "James A. Contner",
               "profile_path": null,
               "id": 104876,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "536a4d22c3a3681218007d0d",
               "name": "David Shire",
               "profile_path": null,
               "id": 8422,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "547a9c85c3a36848e3001886",
               "name": "Michael Stewart",
               "profile_path": null,
               "id": 116394,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 0,
               "credit_id": "547a9ca0c3a3682aa7000dc3",
               "name": "Peter Grunwald",
               "profile_path": null,
               "id": 70206,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "547a9cae925141298a003d04",
               "name": "Gerald S. Paonessa",
               "profile_path": null,
               "id": 1391435,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "547a9cc6c3a36803b800086f",
               "name": "Dianne Crittenden",
               "profile_path": null,
               "id": 1221,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 0,
               "credit_id": "547a9cd39251416bd8000217",
               "name": "Cletus Anderson",
               "profile_path": null,
               "id": 552621,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "547a9ce49251417bd7001b44",
               "name": "Tom Savini",
               "profile_path": "/yOZPKC3TXlxkvx4HoDrhq1PgXrU.jpg",
               "id": 11161,
               "department": "Crew",
               "job": "Makeup Effects"
            }
         ]
      },
      "genres": [
         {
            "name": "Thriller",
            "id": 53
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 6.709401,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 29787,
      "vote_count": 77,
      "budget": 7000000,
      "overview": "A quadriplegic man is given a trained monkey help him with every day activities, until the little monkey begins to develop feelings, and rage, against its new master and those who get too close to him.",
      "similar": [
         281957,
         133805,
         3134,
         994,
         357096,
         8999,
         281,
         979,
         238636,
         395834,
         168098,
         445954,
         22825,
         341006,
         7340,
         398181,
         4771,
         180863,
         562,
         769
      ],
      "original_title": "Monkey Shines",
      "runtime": 113,
      "poster_path": "/ddcNlSKvfLzYzZ44NLTrF3gYNMS.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/wOMD2jDmY6wU2oScXOEgq9hqeNN.png",
         "name": "Orion Pictures",
         "id": 41,
         "origin_country": ""
      }],
      "release_date": "1988-07-29",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "Once there was a man whose prison was a chair. The man had a monkey, they made the strangest pair. The monkey ruled the man, it climbed inside his head. And now as fate would have it, one of them is dead.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["George A. Romero"],
      "runtime": 113,
      "synopsis": null,
      "writers": [
         "Michael Stewart",
         "George A. Romero"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095652/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkxOTk4NDM1Nl5BMl5BanBnXkFtZTcwNzI0ODI1NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Jason Beghe, John Pankow, Kate McNeil | See full cast and crew »"],
      "reviews": [
         "This film has been described as a \"horror film for people who don't like horror films.\" That's an apt description for this underrated psychological/supernatural thriller from Pittsburgh's master horror director, George A. Romero. To date, this is Romero's only studio film, and he had to make numerous compromises to the finished product. (The originally intended ending would have been a killer.) That said, the film still comes off as smart and sharp, with some very good casting. (John Pankow, recognizable from \"Mad About You,\" is really excellent here, and there are nice early performances from Stephen Root, Stanley Tucci, and Janine Turner.) And check out the amazingly good editing in the last 10 minutes. Overall, while this is not first-tier Romero, it's a terrific little horror film.",
         "This is not your run-of-the-mill slasher film. This is a well developed, well-paced suspense-type horror. If what you like it lots of blood and cheap scares punctuated by incidental music, then you should skip this film. If you like a horror involving a few good characters, and a really talented monkey, then take a look. The tension builds slowly. There are a lot of interesting characters, who are neither \"good guys\" nor \"bad guys\" (this includes the killer). The acting is not all that great, but the script is solid. That the monkey may be the best performer in the b=cast says more about the monkey than the human castmembers!",
         "~Spoiler~ I'll have my deranged monkey kill your stupid bird. That's what. Monkey Shines flies low on the horror radar. It's a Romero film that people normally don't recognize. It's not as beloved as Night of the Living Dead or as socially aware as The Crazies, however, I'm going to give it some much deserved credit. I love this movie. Never have I wanted so many people to die so badly while watching a flick. I mean, these people get what's coming to them. The evil, lazy nurse, the jealous mother, the cheating ex-girlfriend, and the vindictive doctor. Take Kathy Bates from Misery and make her every character. You want to see this monkey go ape-sh*t and kill them. It's great. It's every young boy's dream to have a killer monkey and Monkey Shines really brings that to life. This idea has never quite been attempted this way and it's suspenseful as hell. I'd say it succeeded in doing what it tried to do. My only peve is that it introduces a few characters that clearly deserve to die, but don't (the nurse and Stephen Root). Other than that, it's a thoroughly enjoyable thriller. Monkey Shines, shine on.",
         "If you're looking for body count, blood, or bogeymen, this film is not for you. It is more of a psychological thriller than a horror film, though it was billed as horror, likely because of the pseudo-science gimmick that provides the basis for the conflict in the plot. While the film tends to wander a bit (i.e. a sub-plot involving the research head that gets dropped 3/4 of the way through) it stays fairly well focused on the main character and his problems. Aside from the lead, the most effective acting was done by the monkey(s), but the \"real\" actors do a pretty good job of carrying their own. It gives you a little insight into what it's like to be quadriplegic. For a late 80's movie, the style of filming was well done, there is very little cheese, and the special effects didn't overreach. The premise seems a bit farfetched to our currently more sophisticated and informed sense of what's possible on the genetic engineering front. After all, this movie was made 15 years ago. If Romero had gone with either a supernatural cause or a plain animal jealousy angle, it might be less dated, but then again it might have been a little less believable to begin with. Not very horrific, not startling or scary, but worth seeing if you don't mind a slightly slow-paced thriller. I gave it a higher than average score (6 out of 10) just because it didn't make me say \"oh, please!\" too many times unlike other movies from that time--particularly horror films--are prone to do. For example, the pivotal moment is fully supported by plausible input earlier in the film, it's not one of those miraculous developments pulled out of nowhere in the last few seconds before the climax.",
         "\"Monkey Shines\" is an honorable effort that doesn't quite work. It deserves credit for originality, but falls short of the mark. The concept is interesting, but the execution leaves much to be desired. A paralyzed man's life is made easier with the help of Ellie, a monkey trained to help disabled people get by with their daily lives. However, she used to be a lab animal who has had human brain cells injected in experiments. A bond forms between the two, and she acts out his violent desires. The final act does a good job in delivering the goods, but the film takes too long to get going, diluting the overall effect. In fact, at times one almost forgets it's supposed to be a horror movie. When it gets going, it works, although the very ending is a bit much. I'm still not sure the sci-fi gimmick was necessary. Surely they could have done pretty much the same things without it? Something more supernaturally orientated perhaps? Still, I admired Romero's willingness to take chances and try his hand at a more subdued thriller. Jason Beghe does a credible job in the role, and we are offered a rare glance at the frustrations of the disabled. A tighter film would have better achieved the director's goals. **1/2 (out of ****) An Orion Pictures release",
         "George Romero does an excellent job of swapping Zombies for Monkeys. This film may sound ridiculous in the most preposterous way. But then again, we now live in a world of Snakes on a Plane and Burning Bright, so this is a little easier to swallow. In its genre, it is one of the best examples, and I'm not just talking about killer animals. I'm also referring to the stalker/obsessive partner/friend genre. What Romero does brilliantly, is to take a number of characters and the audience on a journey of emotions and self discovery. For example, I started off wanting one of these monkeys. The relationship built up is a genuinely loving one. It's really cute, and this could easily be one of those lifetime inspirational movies. If the monkey wasn't a genetically modified, telepathic, homicidal, psycho monkey. The well trained monkey takes us from tragic victim of experiments, to a loving carer. We get a wonderful cleaning montage, as the monkey helps the friendship expands. The monkey's obsession grows steadily. It starts off with a few temper tantrums and escalates into bananas in the slippers. Soon bananas turn to murder. It's the evolution of all species. None of this would work if it wasn't for a dramatic human connection. Beghe is a law student/athlete that is paralysed. He goes through acceptance, denial, frustration, which is understandable as his girlfriend leaves him for his doctor (a sleazy Tucci), he gets a patronizing nurse, and then his overbearing mother. It's great to see how the characters react to Beghe's quadriplegia, as it enforces Beghe's later anger. Beghe also does a terrific job of facial acting, which is most important as he can't use his body. In a single look he can convey the embarrassment of his mother having to wash him. On the surface, this is a story of a monkey being a bitch to a cripple. But look deep down, REAAAAAAALLY deep, and you'll see a social commentary. For a long time, the monkey is the only one that treats Beghe as an equal. It doesn't throw money at his problem, try and cheer him up, nor can the monkey do everything for him. Romero fills the film with dread, absurdity, and most of all a serious edge that clearly does the film justice. It's easy to mock this film. But the truth is, this could actually happen. Monkeys are creepy and untrustworthy.",
         "Young athletic Allen (Jason Beghe) finds himself paralyzed from the waist down after a truck hits him. An experimental pet monkey is brought in to help him out with his daily routines. However, as Allen's anger grows over his situation he finds out that his pet monkey is going around killing people and carrying out his dark desires. Thoughtful well made cleverly directed horror flick has a scary, intense finale. One of George A. Romero's better latter day efforts. Rated R; Nudity, Profanity, Violence.",
         "This movie's not going to have a fan base larger than Night of the Living Dead or Dawn of the Dead, but it is another example of Romero's uniqueness as s film maker. An original story with an original cast, Romero adds to the horror genre by going somewhere where no other film maker has gone before. Monkey Shines cast includes Christine Forrest who shows her finest performance as the nurse. Worth checking out, so check it out.",
         "Nope, you ain't gonna get zombies in this George Romero offering. Nope, you ain't gonna see ungodly amounts of screen blood ooze out of all kinds of twisted, sick, mangled body parts either. If you are looking for sheer violence of the gory kind - look elsewhere. This Romero film is a thoughtful, intelligent, suspenseful film that spends a lot of its time developing the personalities of its characters as well as the climax of the film. A young man studying to be a lawyer is paralyzed after hit by a truck. He loses his beautiful girlfriend to his surgeon, his mother stays with him and hires an obnoxious nurse with a budgie, and his whole life is upside-down as he must depend on others or machines for everything. A friend from an experimentation lab donates a monkey to him that will help care for him. The monkey initially brings back his zeal for life but soon strange things start to happen....almost a telepathic link of kinds is established between the small capuchin monkey and the wheelchair-bound man. The film builds events very slowly and with a lot of talk. I thought this helped the film as the writing is crisp and the acting more than adequate. The star of the film...the small monkey is a talented little thespian. As strange as this sounds...she with the aid of Romero's direction... actually is able to create some sort of pathos. The scenes where she listens to the tape and hugs her owner are powerful as are the ones where she uses her face to express her emotions. Jason Beghe also does a credible job in his difficult role. The other actors are fine. Maryanne Hodges(Mrs. George Romero) does an outstanding job as the uncaring nurse. Stephen Root of News Radio also has an intriguing role in a plot strand that is left for dead in the end. Although the film is fine in many respects, it has some problems. Most of these problems arise from the script. Some plot elements are never really explained fully. Some plot strands are abandoned. And some characters are over-drawn in terms of stereotypical behaviour. Romero once again tackles a difficult task and does a very credible job overall. The thing I found most unique about the film was his choice of music for the film. It just seemed inappropriate somehow. The only music that really worked was the the music that Ella(the monkey ) heard as she embraced her owner. That was a fine choice.",
         "Offbeat horror film has a paraplegic being given a capuchin monkey named Ella as a companion. Only problem: the cute little monkey has been subjected to genetic experimentation, and has a mind of its its own. Pretty soon, the monkey is up to no good, and the paraplegic is becoming telepathically linked to the increasingly evil simian. George Rnmero made this little gem. The cast is largely unknown, although watch for a young Stanley Tucci as one of the paraplegic's surgeons and John Pankow as the paraplegic's buddy (and mad scientist). A weird little tale that takes its time to get to the nasty stuff, which is just fine with me as the killings are pretty routine."
      ],
      "genres": [
         "Drama",
         "Horror",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": ["Orion Pictures"],
      "summaries": [
         "When Allan becomes a quadriplegic he loses all hope for living until he meets Ella - a monkey trained to fetch and carry for him around the house, obeying him in all things. But Ella is part of another experiment, and when she starts responding to Allan's underlying rage and frustration she has the ability to carry our her master's darkest wishes.",
         "A quadriplegic man has a trained monkey help him with his paralysis, until the little monkey begins to develop feelings, and rage, against its new master."
      ],
      "budget": 7000000
   },
   "movielensId": 2900,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1988-07-29",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["George A. Romero"],
      "runtime": 113,
      "movieId": 2900,
      "title": "Monkey Shines",
      "mpaa": "R",
      "actors": [
         "Jason Beghe",
         "John Pankow",
         "Kate McNeil",
         "Joyce Van Patten",
         "Christine Forrest",
         "Stephen Root",
         "Stanley Tucci",
         "Tom Quinn",
         "Janine Turner",
         "William Newman",
         "Tudi Wiggins",
         "Patricia Tallman",
         "David Early"
      ],
      "imdbMovieId": "0095652",
      "originalTitle": "Monkey Shines",
      "genres": [
         "Thriller",
         "Drama",
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["rpG4R3Sjf4Y"],
      "plotSummary": "A quadriplegic man is given a trained monkey help him with every day activities, until the little monkey begins to develop feelings, and rage, against its new master and those who get too close to him.",
      "tmdbMovieId": 29787,
      "avgRating": 2.69581,
      "releaseYear": "1988",
      "numRatings": 978,
      "posterPath": "/ddcNlSKvfLzYzZ44NLTrF3gYNMS.jpg"
   }
}