{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "evil",
            "id": 156075
         },
         {
            "name": "ice cream man  ",
            "id": 157481
         },
         {
            "name": "mausoleum",
            "id": 162332
         },
         {
            "name": "tall man",
            "id": 162333
         },
         {
            "name": "sentinals",
            "id": 162334
         },
         {
            "name": "sphere",
            "id": 223375
         }
      ],
      "imdb_id": "tt0079714",
      "video": false,
      "title": "Phantasm",
      "recommendations": [
         15158,
         16139,
         16146,
         11298,
         11415,
         18111,
         8973,
         27813,
         20481,
         13567,
         26515,
         16288,
         14510,
         14029,
         15762,
         10925,
         36599,
         28260,
         13555,
         10823
      ],
      "backdrop_path": "/mLXW1TJoutwUVorMncIxOmos6H3.jpg",
      "revenue": 11988469,
      "reviews": [
         {
            "author": "Cat Ellington",
            "id": "58a4955392514165b90061f1",
            "content": "There are tall men, and then there's the \"Tall Man\". I actually saw the trailer, or preview, if you like, for Phantasm while awaiting the start of Invasion of the Body Snatchers in December of 1978. And I remember the trailer quite well, considering that the upcoming film looked scary as the word itself. The part in the trailer that really got to me was the scene in which the main antagonist, the Tall Man, played by Angus Scrimm, is standing outside of some kid's bedroom window (at night) looking in over the kid's head. It freaked me out ... Completely out. And being a horror film buff - even then at such a young age - I'd immediately said to my mother who had been sitting next to me: 'Ooh, ma, I wanna see that movie!' Phantasm looked horrifying ... And I loved horrifying movies. My mother said 'Yes'.\r\n\r\nIt would be the next year, in April of 1979, that we (only my mother and me that time) would finally see Phantasm. And it's scary as hell, I tell ya. Scary as hell. Oh, and as I'd also learned, the kid, whose window it was that the Tall Man stood outside of in the trailer, is named Mike. Scary as hell, I tell ya.\r\n\r\nBe prepared, if you'll be a first time watcher of this cult horror, to scream and jump and feel chills as you're absorbing it. It is just that creepy. And I do believe that Clive Barker (God love him) would later borrow more than a few of the elements from Phantasm for his own cult masterpiece, \"Hellraiser\". I reckon that I'll always believe that to be the truth. Phantasm is sheer and ultimate terror. They just don't make 'em like this anymore.\r\n\r\nWatch this one with the lights on, folks.",
            "url": "https://www.themoviedb.org/review/58a4955392514165b90061f1"
         },
         {
            "author": "simest",
            "id": "58a642dac3a368672e0003d0",
            "content": "PHANTASM is an uneven work, too fantastic to be genuinely scary but ferociously unique and fascinating on numerous levels.\r\n\r\nI think at the forefront there was a desire here to create a warped and entirely original Universe where nothing is as it seems and anything can - and probably will - happen. Logic is quickly cast aside and indeed has no place in the crooked landscape that PHANTASM paints. Into this bizarre, surreal.......even Dali-like twisted cosmos, are thrust a group of characters who - perhaps even by virtue of their acting inadequacies - seem somehow as much a part of the fabric of that Universe, even in their struggles to survive and make sense of it.\r\n\r\nFor me, PHANTASM has a hypnotic effect for all those reasons. Flying sphere drills, a gender bending alien cemetery keeper, hooded shrunken corpses refined for slave labour in some parallel Universe, a severed finger that morphs into a grotesque (if admittedly comical) fly and countless other wild fantasies are all episodic nightmares that work their way into my head and stay there - however well or not they may be executed. They are indeed, the essence of all the darkest, unfathomable episodes that invade our deepest sleep.\r\n\r\nAlso, the film's tendency to bounce us in and out of reality - if indeed there is a reality present at all - without warning, keeps us permanently on unstable ground. Dreams are very prominent and indeed prevalent in PHANTASM. So much so, that by the end there seems no dividing line between that which was real and which was not. In this sense, the film explored the territory that NIGHTMARE ON ELM STREET would later make it's own but somehow achieves a dream-like quality that even Craven's classic would not surpass. Only Dario Argento's similarly bizarre INFERNO comes to mind as a rival to PHANTASM for the closest we might get to a dream realised on film.\r\n\r\nPHANTASM is a unique, mind bending vision of quaint, small town America, infused with hellish fantasies of death, loss and isolation, unleashed from the subconscious mind - perhaps even in the end, from that of it's young, insecure and lonely adolescent protagonist.\r\n\r\nPoe said \"Is all that we see or seem, but a dream within a dream?\"\r\n\r\nPHANTASM presents a case.\r\n\r\nI urge those who are not impressed, to watch it again with these notions in mind.",
            "url": "https://www.themoviedb.org/review/58a642dac3a368672e0003d0"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 15,
               "character": "The Tall Man",
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5cd",
               "name": "Angus Scrimm",
               "profile_path": "/tBDDTCXXybeyzDmFwAuPCb6ePCT.jpg",
               "id": 79584,
               "order": 0
            },
            {
               "cast_id": 1,
               "character": "Michael 'Mike' Pearson",
               "gender": 0,
               "credit_id": "52fe4514c3a36847f80bb597",
               "name": "A. Michael Baldwin",
               "profile_path": "/gGOWFGVokrYR6u36CKrb24OwdQT.jpg",
               "id": 58240,
               "order": 1
            },
            {
               "cast_id": 2,
               "character": "Jody Pearson",
               "gender": 2,
               "credit_id": "52fe4514c3a36847f80bb59b",
               "name": "Bill Thornbury",
               "profile_path": "/2NxCvwkJdpEuZ995uE3PPzoW93X.jpg",
               "id": 58241,
               "order": 2
            },
            {
               "cast_id": 12,
               "character": "Reggie",
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5c1",
               "name": "Reggie Bannister",
               "profile_path": "/4ayBwRs64wGiCpj2HXHGw3HIO9K.jpg",
               "id": 97939,
               "order": 3
            },
            {
               "cast_id": 3,
               "character": "Lady in Lavender",
               "gender": 1,
               "credit_id": "52fe4514c3a36847f80bb59f",
               "name": "Kathy Lester",
               "profile_path": "/ySprO1AURFOEyVhPYc7zzeEvru.jpg",
               "id": 58243,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Fortuneteller's Granddaughter",
               "gender": 1,
               "credit_id": "52fe4515c3a36847f80bb5c5",
               "name": "Terrie Kalbus",
               "profile_path": null,
               "id": 58244,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Sally",
               "gender": 1,
               "credit_id": "52fe4515c3a36847f80bb5c9",
               "name": "Lynn Eastman-Rossi",
               "profile_path": null,
               "id": 97940,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Caretaker",
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5dd",
               "name": "Kenneth V. Jones",
               "profile_path": null,
               "id": 1206256,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Girlfriend",
               "gender": 1,
               "credit_id": "52fe4515c3a36847f80bb5e1",
               "name": "Susan Harper",
               "profile_path": null,
               "id": 981882,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Toby",
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5e5",
               "name": "David Arntzen",
               "profile_path": "/i69iLA0E0fQl0R6GjOgEGIHTY2D.jpg",
               "id": 981414,
               "order": 9
            },
            {
               "cast_id": 21,
               "character": "Bartender",
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5e9",
               "name": "Ralph Richmond",
               "profile_path": null,
               "id": 983639,
               "order": 10
            },
            {
               "cast_id": 22,
               "character": "Tommy",
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5ed",
               "name": "Bill Cone",
               "profile_path": null,
               "id": 981620,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4514c3a36847f80bb5a5",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe4514c3a36847f80bb5ab",
               "name": "Paul Pepperman",
               "profile_path": null,
               "id": 58248,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4514c3a36847f80bb5b1",
               "name": "Fred Myrow",
               "profile_path": null,
               "id": 58249,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 0,
               "credit_id": "52fe4514c3a36847f80bb5b7",
               "name": "Malcolm Seagrave",
               "profile_path": null,
               "id": 58250,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5d3",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe4515c3a36847f80bb5d9",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "59d88d0fc3a36861a30216d6",
               "name": "Don Coscarelli",
               "profile_path": "/zuwHEQlrZ78P1PudZsPO2DfS6KA.jpg",
               "id": 58245,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 0,
               "credit_id": "59d88d229251412505021842",
               "name": "Roberto A. Quezada",
               "profile_path": null,
               "id": 58252,
               "department": "Lighting",
               "job": "Gaffer"
            },
            {
               "gender": 0,
               "credit_id": "59d88d3ec3a368624d0213e9",
               "name": "Dac Coscarelli",
               "profile_path": null,
               "id": 1023502,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "59d88d6092514124c502263c",
               "name": "Kate Coscarelli",
               "profile_path": null,
               "id": 983156,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 9.8055,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 9638,
      "vote_count": 206,
      "budget": 300000,
      "overview": "A young boy and his friends face off against a mysterious grave robber known only as the Tall Man, who keeps a mysterious arsenal of terrible weapons with him.",
      "similar": [
         15158,
         16139,
         16146
      ],
      "original_title": "Phantasm",
      "runtime": 89,
      "poster_path": "/59GIYULisvSYMwawbbtCnjaPMAn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "AVCO Embassy Pictures",
            "id": 494,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "New Breed Productions",
            "id": 22540,
            "origin_country": ""
         }
      ],
      "release_date": "1979-05-03",
      "vote_average": 6.5,
      "belongs_to_collection": {
         "backdrop_path": "/bu33EKctcBJvN5KHR780lWQkyJd.jpg",
         "name": "Phantasm Collection",
         "id": 47770,
         "poster_path": "/xqgAkKmQRrk0UaIbWMak4RRSQm7.jpg"
      },
      "tagline": "If this one doesn’t scare you, you’re already dead.",
      "adult": false,
      "homepage": "http://phantasm.com",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Don Coscarelli"],
      "runtime": 88,
      "synopsis": "In the opening scene, an attractive blond woman wearing a lavender colored dress is making out with a man in a local cemetery, which suddenly ends when the woman pulls out a dagger and stabs the man to death. Meanwhile, 24-year-old musician Jody Pearson is raising his 13-year-old brother Mike in a small southern California town disturbed by the mysterious deaths of its citizens. Reggie, a family man and ice cream vendor, joins the brothers in their suspicions that the local mortician, dubbed \"The Tall Man\", is responsible for the deaths. Mike relays his fears to a fortuneteller and her granddaughter about the possibility of Jody departing and leaving him in the care of his aunt, along with his suspicions about The Tall Man. Mike is shown a small black box and told to put his hand into it. After the box grips his hand, Mike is told by the granddaughter not to be afraid and as the panic subsides, the box relaxes its grip. The notion of fear itself as the killer is established and is what propels Mike towards his final confrontation in the film with The Tall Man. Fearing that Jody will abandon him, Mike follows him one evening to a local bar where he sees him pick up the woman in lavender from the opening scene and follows them to the Morningside Cemetery where Jody and the woman make out with each other. Just then, Mike is scared from his hiding place when a small figure wearing a brown robe jumps out at him. Jody, alerted by Mike's scream, finds him and angrily tells him to go home. When Jody returns to the make out spot, the mysterious woman in lavender is also gone. Mike begins to have horrifying nightmares about the Tall Man and of his dwarf-like minions and determines that something is going on at Morningside Mortuary. After an encounter when he is pinned under a car when one of the dwarfs drops a car on him while he is working in the garage, Mike decides to investigate. The next evening, he goes out, armed with a hunting knife, to Morningside Mortuary and breaks into the building through a basement window. Mike hides when the Tall Man and the cemetery caretaker are seen. Walking down a long hallway at the mortuary, Mike encounters a flying silver sphere, about the size of a softball, coming right at him. The caretaker appears and grabs Mike as the flying sphere comes right at him. Mike ducks in time as the sphere hits the caretaker and drills into his head, spurting out blood. Mike then encounters the Tall Man who chases him to the basement where Mike manages to sever some of the fingers of the Tall Man's right hand. Mike escapes from the mortuary and from two of the Tall Man's brown-robed dwarf minions and runs for home. The next morning, Mike shows Jody the severed finger of the Tall Man which is still twitching with life and bleeding yellow embalming fluid, which Mike is keeping in a small box. When Reggie comes over, and Mike shows them the severed finger, it transforms into a large wasp-like insect which attacks the three of them, but Jody manages to kill it by shoving it into the kitchen garbage disposal. The next evening, Jody goes to Morningside Mortuary to investigate, armed with a .45 caliber pistol, but he is immediately attacked by one of the brown-robed dwarfs in the mortuary basement, forcing him to run. Jody runs into Mike outside the cemetery driving their car when they are chased by a hearse being driven by one of the dwarfs. Jody opens fire on the hearse with his shotgun and forces it off the road. Upon examining the dwarf driver, the two brothers are shocked to find that it is a former friend of theirs (murdered by the woman in lavender in the opening scene) now crushed down to small size. Jody and Mike call Reggie who takes the still alive body of their friend into Reggie's ice cream truck while Jody drops Mike off at a local antique store. There, Mike finds an old photo of the Tall Man in an 19th Century photo during the founding of the town. Mike asks the two young store workers, Sally and Sue, to drive him home. During the drive, Mike tells them to stop the car when they see Reggie's overturned ice cream truck lying beside the road. Mike looks around and finds that the creature dwarf has escaped and Reggie is nowhere to be found. Just then, a group of dwarfs attack Mike and the girls who take control of their car and drives away, while Mike falls out the rear window. Mike goes home and tells Jody about Reggie's disappearance and about the recent attack. Jody decides to go back to the mortuary to look for Reggie and the two girls, and Mike wants to come along. But Jody instead locks him in his room, feeling that it would be too dangerous. Mike, using a buckshot shell, manages to disable the lock on his door and takes a pistol from the house to meet up with Jody, but the Tall Man is waiting for him outside (with his hand fully healed) and forcibly takes Mike into his waiting hearse to drive back to the cemetery. Mike manages to shoot out a tire from the car as it arrives at the mortuary which goes out of control. Mike manages to jump out of the car before it hits a tree and explodes, with the Tall Man still inside. Inside the mortuary, Jody is breaking into a crypt of his parents to find if their bodies are still there. Mike enters the building minutes later and sees his parents unearthed coffins and upon opening one, and finds that they are empty. Mike runs and has another encounter with the lethal flying silver sphere, until Jody shows up and destroys the silver sphere with a blast from his shotgun. The two brothers then encounter Reggie, who claims that he made it to the mortuary and has been hiding in a coffin for the past few hours. Reggie also claims to have found the missing girls in a room and freed them. Mike, Jody, and Reggie then go into another room which is a large open area, filled with storage barrels containing several dwarfs, as well as two long poles which upon close examination, is the gateway to an alien planet. Mike is briefly sucked through, but saved by Jody and Reggie who pull him back. Mike realizes that the Tall Man is using the corpses as slaves to his alien planet, and they have to be crushed to small size because of the planet's intense gravity and heat. When the lights in the building go off, Mike disappears and Jody sets off to find him. Alone in the small room, Reggie decides on a gamble to shut down the humming two-pronged gateway by slamming his hands on the tops of the poles, creating a vacuum which he barely escapes. Outside the mortuary, Reggie encounters the woman in lavender, who stabs him to death with the dagger. Mike and Jody come upon the scene and discover the woman in lavender, who changes into the Tall Man, yet another replica. Mike and Jody are forced to run as the mortuary glows and is apparently destroyed. Back home, Mike and Jody, distraught over the death of Reggie, and that the entire town is either dead or consumed by the gateway vacuum, plot on a way to stop the Tall Man by trapping him in a mine shaft since there seems to be no way of killing him. While Jody sneaks out of the house to go to a remote area near a mine shaft to prepare the trap, the Tall Man arrives at the house and attacks Mike who is forced to run. The chase leads to the mine where the Tall Man falls through a fake ground into the hole and to the bottom where Joey pushes a large boulder to seal the hole, thus trapping the Tall Man. After doing so successfully, Mike suddenly wakes up with a start in his house. Mike is next seen lying by the fireplace with the alive-and-well Reggie sitting next to him. Reggie tells Mike he was simply having a bad dream, something that has been a common occurrence since Jody died in a car crash a few weeks earlier. Mike realizes that Jody is indeed dead as well as his parents... all of whom died in the car accident, and the whole thing with the Tall Man was nothing but his horrible nightmare. Reggie suggests that they go away for a while, and Mike agrees. Mike goes into his room to pack his stuff where the Tall Man is waiting for him behind his door. After Mike was shocked to see the Tall Man behind his door, several arms of the dwarf minions pulls Mike through his bedroom window as he screams",
      "writers": ["Don Coscarelli"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079714/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjAxNDY4MDc5OV5BMl5BanBnXkFtZTYwODU5ODg5._V1_SX214_AL_.jpg",
      "actors": ["Stars: A. Michael Baldwin, Bill Thornbury, Reggie Bannister | See full cast and crew »"],
      "reviews": [
         "Like everyone that has reviewed this film before me, I am going to sing it's praises, however, unlike those before me, I'm not quite sure why. This film did everything it was supposed to do as a horror film. It scared me in a few areas, it was quite gory in others and it was easily one of the ten most quirky and bizarre films I have ever seen. I can't tell you why anything transpires the way it does in here, I can't even tell you why people do the things they do, but I don't really think that is the point of the film. Like David Lynch's Mulholland Drive, this is more of mind altering experience or a dream that just doesn't make any sense. Perhaps this is a film that is esoteric by design and if that is the case then perhaps I should just watch it over and over again until I do have some sort of puerile grasp of it. Dictionary.com's definition of a phantasm is \"in Platonic philosophy, objective reality as observed by the five senses.\" Another definiton it gives is simply, \"a notion\". And if you watch this film from beginning to end you will see why this makes all the sense in the world, yet it is still an abstruse concept that is meant to be exactly what it is. The film begins with a funeral of one of Jody (Bill Thornbury) and Reggie's (Reggie Bannister) best friends. Jody's little brother, Mikey ( A Michael Baldwin) is a precocious kid who can't seem to stay in one place and follows his big brother everywhere he goes. Hence he is at the funeral but is surreptitiously hiding out in the bushes. As the funeral ends, he sees the caretaker lift a casket all by himself and put it into his truck. This is the nascency of the bizaare rituals that encompass the film. Michael decides to investigate the strange looking mansion where the cemetery rests. Once he breaks into the house, he is chased by some strange Jawa looking creatures and by a sphere that seems to come out of nowhere and drains your head of blood. He does escape and finally gets his big brother to believe him when he says that things aren't quite right up at the Morningside Cemetery. Now, up until this point, the film is quite linear. You have your classic set-up, a spooky looking mansion where the dead are taken and your typical stupid characters that do the traditional scary movie things, like going to investigate a haunted house all by yourself, gratuitous breast shots, some eerie music and dark nights. But that is where the title \"typical horror film\" ends and it crosses over into Rod Serling territory. From here on out, it just goes weird, but in a goosebump inducing way that keeps you frozen in your seat. Don Coscarelli can take all of the praise and/or blame for this eccentric film. He wrote, produced, directed, was the DP, the editor and as another reviewer so aptly pointed out, he probably swept the floors at night and fetched coffee for those on the set. This is his incarnation. I also happen to agree with other viewers that say that this film has one of the most haunting yet mellifluous scores which is on par with Carpenter's Halloween theme. Both are intricate pieces to the presence of the film. Words like haunting, eerie, creepy and forbidding all come to mind when you hear the score. It is also uncanny to see some of the similarities to A Nightmare On Elm Street and Phantasm. Nightmare was a little more clear with what it was trying to say but both films have an overtly murky and dream like exploration into realms that many of us have yet to understand. The underlying theme in this film is the unsolved questions that plague many of us when we wonder what happens when you die. Most of us believe that you go to Heaven or Hell. But those are just theories. And if theories are unproven then what is stop you from believing that this movie could really be the answer to those questions? As the tag line for the film so poignantly points out, \"If this one doesn't scare you, you're already dead.\" What if all of this was true? What if you could be stolen and made into something that you did not ask to become? Who is the Tall Man and what is he doing here in our world? One of the most harrowing yet well done plot pieces is when Mikey goes to the girl's house and finds an old picture of the Tall Man sitting on a horse carriage, looking like it is circa 1776. This leaves the viewer ripe with questions. Phantasm will leave you with more questions than answers but I will say this about the film. In a day and age where you get prosaic, banal and myopic efforts like ( take your pick of most of the horror that has \"graced\" our screens since the Scream and Blair Witch craze) and you compare them to films like Halloween, Texas Chainsaw Massacre and Phantasm, you quickly realize that the 70's and early 80's was the genesis of the horror film. I realize horror probably dates back to Nosferatu and it became respected with Psycho, but to look at the films that were born in the 70's and 80's, it's a veritable, indefeasible list of some of the most revered and imitated horror films of all time. Now that I have seen Phantasm I can easily see the mark it has left on other films. 9 out of 10----As I said, I still can't tell you what this film is all about nor can I tell you what it all means or how it all ends, all I can say is that it made me feel something strange with it's disingenuous stroke of the brush. This is a film that absolutely demands a second and third viewing....which is what I am about to do right now. BOY!!!!!!!",
         "Phantasm is possibly my favourite film of all time.Why? It's not about the budget or the hype of a film, but mainly about how this film makes me feel. Phantasm director Coscarelli crafted a little gem of a horror movie that has bought me more enjoyment than any major Hollywood film I can remember. I first saw Phantasm as a kid in the 80's and it has stuck with me ever since. It was great to rediscover this film on a beautifully mastered DVD. For me, Phantasm combines a nightmarish quality that few horror movies achieve with a nostalgic trip back in time to the late 70's. The central theme is that of young Mike being abandoned by his brother Jody, and overcoming his fears. The cryptic nature of the Tall Man's presence adds to the tension, and Myrow's eerie soundtrack is the perfect finishing touch. Like a nightmare, there is no explanation or attempt to pander to desires for a logical conclusion. The little touches such as Jody and Reggie's jam session add to the homely feel of this movie - it's like a well worn pair of jeans. It's crystal clear that no studio executives were in the editing room at the last minute, trying to turn Coscarelli's vision into another mediocre horror film . For the director, this film was clearly a labor of love. Coscarelli is still an outsider from the Hollywood system. I am grateful that he hasn't been sucked into turning out mediocre movies for major studios but has stayed somewhat true to the original spirit of Phantasm. Many of the comments here on IMDB criticize the film for weak FX and poor acting. When viewed in the context of a genre film made by young industry outsiders for $300,000 in 1979, I think the technical values are exceptional. Critics who claim otherwise have no idea of the work involved in the process of creating a movie, especially before the advent of video. I've seen Hollywood blockbusters made for many millions of dollars with great technical values, and yet I can't think of one that I can enjoy time and time again like this film. If you consider yourself a fan of horror movies, you owe it to yourself to own this classic on DVD. 10/10",
         "Two orphaned boys, Mike (Michael Baldwin) and Jody (Bill Thornbury) notice some strange things happening at Morningside Mortuary. Bodies are disappearing from coffins; a lady in lavender has sex with men in the graveyard and then stabs them to death; little midgets in brown cloaks (making sounds like lions) are roaming about and there's a flying silver orb with spikes that embeds itself in people's heads! And then there's the Tall Man (Angus Scrimm) overseeing it all...Soon Mike, Jody and their friend Reggie (Reggie Bannister) are fighting for their lives... The story is pretty thin (and REALLY out of whack at the end), the acting dismal, there's no characterizations or depth and some of the special effects are horrible but...this is STILL a classic horror film. It takes a while to get going (nothing much happens in the first half hour), but when it does there's scarcely a letup. Action leaps into high gear, there's some fairly graphic gore (including the now infamous flying sphere killing), there are plenty of scenes guaranteed to make you jump and the music score is very spooky...right up there with \"Halloween\". Also some of the special effects are impressive (considering there was no budget). Also Bill Thornbury is a VERY attractive man and there's gratuitous male and female nudity. What's even more surprising is Don Coscarelli wrote, produced, directed AND edited this at the age of 24! He's never matched it since and all the sequels really suck...but this stands alone as a classic. A must-see for all horror fans. Also Scrimm is EXCELLENT (and damn scary) as the Tall Man. Trivia: This was awarded an X rating FOUR TIMES because of the sphere killing...Coscarelli went all the way to the head of the ratings board who overturned it and gave it an R--a rare occurrence that the ratings board kept in a gore scene!",
         "\"Phantasm\" is about a young teenager, Mike, who just recently lost his parents. He is worried about losing his older brother, so he follows him everywhere, including a funeral. While hiding in the bushes during the funeral, Mike sees \"The Tall Man\" (played by the creepy Angus Scrimm), the man who runs the funeral home, pick up a casket by himself. Mike begins spying on the man afterwards, fascinated with uncovering the strange events surrounding the funeral home. While investigating, Mike discovers a strange world within the walls of the mortuary, including flying metal spheres with sharp arrows that drain the blood from your head, and many other horrors. Turns out, the Tall Man is from another dimension, and is taking the bodies of the dead and reincarnating them in his world for slaves. Mike teams up with his older brother and the local ice cream man, Reggie, to stop the Tall Man's gruesome work. I remember my mother telling me about how much \"Phantasm\" scared her when she was a teenager, and she rented it one day and I watched it along with her (I was about nine or ten at the time), and it was genuinely one of the most bizarre movies I've ever viewed. Written (as well as directed) by Don Coscarelli, \"Phantasm\" has become something of a horror classic over the years, and deservedly so. Coscarelli's writing here is so unique that it hurts. Everything in this film is surreal and dreamlike, and the entire plot line is so out there that I can't think of another film that can quite compete in terms of strangeness. But, despite it's strangeness, this movie works, in it's own, weird little way. The script is solid and the characters are believable (there are some real-life situations thrown in as well, so there is some sort of viewer-character connections that can be made), even though about ninety-nine percent of this film is something of pure fantasy. But it's quite a scary fantasy, and that's for sure. There are many elements in this film that have become somewhat legendary, among them being the murderous silver spheres and The Tall Man's \"Boyyyyy!\" line. The thing is, among all of the randomness that is \"Phantasm\", this is quite a terrifying movie. A dense feeling of helplessness and foreboding is hiding in every scene, and the cinematography and locations add to this quite a bit. The imagery is bizarre and often very spooky, and the settings are perfect (especially that creepy old funeral home). The viewers themselves are easily caught up in the engrossing story, and the atmosphere is very scary. Michael Baldwin plays our lead hero well, with Reggie Bannister as the ice cream man, and Bill Thornbury as Mike's older brother, Jody. And Angus Scrimm plays his signature role as The Tall Man, and his presence alone makes this film scarier than most of it's genre. And then there's the score to the film, which is equally as effective and just as chilling. The film concludes leaving many questions open-ended and unanswered, but honestly - can you really expect genuine, fulfilling answers when the movie itself is so strange? I think it's good that this film does leave some loose ends, because it goes along with the movie's overall feel. Bottom line - I don't think this movie is for everyone, and it might be just a little bit too weird for some. Honestly, one of the strangest, most out-there films I have ever seen, but in my opinion, that's a good thing. The story is strange but well crafted, and the bizarre imagery and atmosphere make this a painfully unique, scary experience. I can see why \"Phantasm\" has become such a classic of the genre. For me, this film remains a nice little piece of spooky and original nostalgia, and I'm glad my mom decided to scare the daylights out of me with it at such a young age, because I grew to love this movie later on. 10/10.",
         "Phantasm is one of those movies where you have to look beyond the constraints of a non-existent-budget sci-fi/horror flick to see underlying talent. The film suffers from some hammed up acting, classical 1970s character naivety, make-shift and jimmy-rigged special effects that don't quite work, a score that might as well be a series of MIDI files, and a plot that's all but coherent; however, Phantasm maintains a certain original charm and resourcefulness that larger budget films frequently lack. The above paragraph really isn't a complaint (despite how it may sound). On the contrary, I'm impressed with what director Don Coscarelli managed to accomplish with the hand dealt to him. Phantasm could have been an utterly forgettable film on all levels, but instead he managed to leave a number of positive impressions. For one, the frame composition and some key scene transitions transcend budgetary implications (in particular, the Tall Man in the cemetery and the Tall Man slow-motion shot by Reggie's ice cream truck come to mind). Fred Myrow also comes to the forefront with intriguing and memorable synthetic score. My only complaint on the music is the synthesizer it was performed on sounds like an old 80386 game. Still, the notes played transcends the quality of the instrument it's played on. Phantasm's trademark bladed sphere effect, however, did genuinely bother me when they stuck into their victim's skulls. The fact that the soon-to-be-dead have no physical reaction after being slapped in the forehead with a fastball goes beyond my ability to suspend disbelief, and to my dismay the effect has never been amended in later sequels. A simple flinch is all that's needed to sell the effect! Something tells me that the effect, as it stands, is part of the Phantasm trademark, part of the Phantasm charm (for the cult followers anyway), and won't ever get a more realistic edge. Minor silly plot elements aside (Jawa grave robbers, anyone?), my only major gripe deals with the sheer open endedness of the Phantasm universe (vastly exploited in later sequels.) Phantasm is not unlike a comic book, where nothing that happens seems significant since a character can so easily wake up to another reality. Anarchy governs the Phantasm series, no rules apply so reality, fantasy, and parallel universes co-exist in such a fashion that nothing seems to matter anymore. It's like playing a game with Coscarelli in which we must abide by the rules he sets down, and he sets the rules down as he goes when situations apply to him. Why bother playing? Why care? Still, the film has its charms, and there's something fun in the sinister eye-brow raising and growling Tall Man played effectively by Angus Scrimm. I'd caught bits of Phantasm 3 in the past, and came into this film expecting to hate the Tall Man and this entire franchise, yet I found myself grinning at each of his lines. I say if someone can look below a cheap and cheesy surface, Phantasm is full of a pleasant surprises.",
         "There are two things that stand out in this film. The Tall Man (played by Angus Scrimm) and the chrome sphere with hook-like blades that stick out of it. Those are the two main elements when it comes to this horror series directed by Don Coscarelli. The Tall Man comes from another dimension where he takes some of the earth's dead back to his home planet, reincarnates them and turns them into slaves for his world. He even occasionally murders some earth people in order to speed things up. Why wait for them to get old and die natural deaths. That would take too much time, right? And what better earth profession he can hide his identity behind than that of a funeral parlor director. Everything goes smoothly for the Tall Man until Mike Pearson (Michael Baldwin) witnesses him carting a body away that's supposed to be buried in the ground. At first his brother Jody (Bill Thornbury) doesn't believe him, but when Mike shows him a cut-off finger surrounded by 'yellow blood' in a little wooden box he had saved as proof, Jody starts to believe him. Excellent scene of the chrome sphere zooming down the funeral parlor hallway and 'accidentally' digging into the skull one of the Tall Man's henchmen. A little screw appears out of it and starts to bore a hole through his skull, ejecting the excess blood out a hole in the back of the sphere. I wish there was more of the sphere although we'll get to see a lot more of it again in PHANTASM II (1988). I also like the portal gateway scene where if you go through the two chrome poles, you'll get to see the Tall Man's alternative universe where the slaves are busy carrying caskets down a stone pathway. We even get to see Ice Cream Man, Reggie Bannister almost get sucked through it as well. I won't give away the ending but let's just say the Tall Man is temporarily disposed of until the next sequel comes out, although the dream element that's supposed to encompass the whole sequence of events in the film, is a big negative against it. In fact, it brings it down a notch, unfortunately. Even so, I consider PHANTASM to be one of the best horror films of the 1970s. It managed to keep Avco/Embassy in business so they could bring us later horror stuff like ESCAPE FROM NEW YORK (1980); THE FOG (1980) and DEAD AND BURIED (1981) The MGM DVD also has a lot more extras on it than you would expect from other DVDs released by the same company, including 8mm behind-the-scenes footage of the making of PHANTASM; a 1979 interview down in Miami with director Coscarelli and Angus Scrimm; an appearance at a 1989 Fangoria convention by Scrimm, and movie & TV trailers for the film. It's a labor of love by the truest fans of this film. 7 out of 10",
         "After the death of Tommy (Bill Cone), who was stabbed by a woman at the cemetery, Jody (Bill Thornbury) and his friend Reggie (Reggie Bannister) attend the funeral at the Morningside funeral home. Jody is followed by his teenage brother Mike (Michael Baldwin), who has just lost his parents and is afraid of losing his big brother that intends to travel. Mike snoops around the cemetery and sees the mortician known as The Tall Man (Angus Scrimm) carrying Tommy's coffin alone without any help. Mike breaks in the mortuary to investigate the mystery and discovers weird dwarf creatures with yellow blood and dangerous flying spheres that protect the location. When he is chased by The Tall Man, he cuts his finger and brings it home to show Jody to convince his big brother that there is a dark secret in the mortuary. Jody, Reggie and Mike discover that The Tall Man is from outer space and is transforming dead bodies in dwarfs to work as slave in his world. Now they decide that The Tall Man must be destroyed. Will they succeed in their intent? \"Phantasm\" is one of the most weird and original cult movies that I have ever seen. The surrealistic and dreamlike story entwines horror with sci-fi with many twists and bizarre characters and situations. I saw \"Phantasm\" for the first time on VHS in the early 80's and I have just seen it again on DVD and surprisingly the film has not aged, only the clothing, the hair style and the special effects. But for fans like me, it is still attractive and entertaining. My vote is seven. Title (Brazil): \"Fantasma\" (\"Phantasm\")",
         "In 1980, Magnetic Video released the full length 90-minutes long version on video, with a difused glow throughout the entire film. In the latter part of the 1980s, the film was issued again on video, but one sequence (which takes place in near complete darkness in The Tall Man's glowing white room) was accidentally edited out by the people supervising the film to video transfer. This version of the film ran 87/ 88 minutes in length. When Phantasm was issued on DVD in the late 1990s the scene was restored, but the colour balance and the soft diffusion was corrected, which I think robbed the film of some of its atmospheric effect. My review is based on Magnetic Video's 1980 release. This haunting, dreamlike hallucination of a movie was written, directed, photographed, produced and edited by Don Coscarelli, it doesn't make much sense but it's still a great bit of fun to watch with the lights turned out. This kid named Mike convinces his older brother Jody that there is something weird going on at the local cemetery. So he and Jody break into the old mausoleum and find out that it's actually some kind of factory where people are killed by a flying metal ball, crushed down to a height of about 3'2\", dressed up like little monks and packaged up into round metal garbage cans and shipped off for use as slave labour in some other dimension. A dimension ruled and resided over by the six and a half foot tall mortician (known throughout the entire ordeal as just simply \"The Tall Man\") working at this cemetery. When The Tall Man kills another friend of theirs, they decide to put and end to him, or at least try to. This movie has many different layered meanings, over the years some people have said that it's a reference to corporate America coming in (in the form of The Tall Man) and killing off everyone (by turning everything into a 'business') and some have said that this movie is also about a kid's loss of innocence and fears about everyone around him leaving (or in this case dying) Whatever the hell this movie is about, it's still great fun, followed by a couple of really disappointing (and belated) sequels.",
         "\"Phantasm: an apparition of a ghostly appearing figure\" Simply put Phantasm is a visual nightmare transformed into a person's sketchy reality. The emphasis on sleeping and dreams is exactly the message it is getting at. With a perfect score and a quintessentially frighteningly written Horror villain 'The Tall Man' the only downfalls of Phantasm are its lack of quality acting, script, pacing and cheap 1970's horror clichés. In fact the acting and characters become so irritating it is the only element of Phantasm that takes it away from being considered a true Horror classic by most Horror buffs (or maybe it's George Lucas' unauthorized use of Jawa's?). When one scans the Horror elite those films have pretty atrocious acting problems too, so why should Phantasm fail so much? It shouldn't really because Phantasm is just as good as the classics. One of the reason why Phantasm is such a unique film is the well established characters unlike most Horror films; whilst the acting is somewhat absent from the strongly written character it's still enough to redeem the awkwardly delivered lines, odd facial expressions and comical snappy reactions. The films score is also perfect and mesmerizing that fits well by Fred Myrow, it was in fact one of the most powerful elements of the movie that really had me engaged. The stunning visuals and the concept and imagery of The Tall Man (wonderfully portrayed by Angus Scrimm) are authentically creepy, like something one would encounter in a nightmare. (in fact, I had a dream where I was in Hell and I encountered a priest that had been shrunk and dissected by a demon and this was before I saw Phantasm) I know I would be pretty hysterical if The Tall Man was stalking me. It's these points of the film that for me makes Phantasm an atmospheric and creepy horror gem, in fact it brings me back to when I was a five year old child in a video store in the 90's, traumatized by the VHS covers for Hellraiser and The Blob only to eagerly await the day I was old enough to view them. Another reason why Phantasm's atmosphere works so well is the use of white and brightness instead darkness Phantasm's surreal mortuary is a nightmarish treat of white marble walls lined with drawers of the dead, gaping large hallways and The Tall Man's shoes trudging along the tiles that make you feel he's going to jump out of the television screen. From the flying silver balls to the void to another dimension, Phantasm's concept of a ghoulishly eerie tale about a soul keeper is wonderfully mastered and pulled off. No matter how jammed with 1970's horror clichés the use of the shoestring budget and surrealism incorporated into Phantasm makes it a pure Horror gem. It seems all the love goes to over rated films only because they're so talked about and not actually analysed. This movie has creeped me out more than any other Horror classic ever could now and I'm far from the age I was when I used to be scared those films. Phantasm is highly recommended to surrealist, horror and cult fanatics.",
         "I remember staying up late to watch this movie on TV when I was a kid. It scared the hell out of me. Then, for 15 years, I forgot all about it. Recently, I found a $5 VHS copy in the discount bin of my local drugstore and thought: \"What the hell?\" That was the best $5 I ever spent. Phantasm may not make a lot of sense, the story is confusing and seems to have been made up as it went along, but that's kind of the point. It's like watching someone else's fever dream...and that's exactly what it's supposed to be like, because it IS someone else's fever dream. Phantasm is a classic nightmare; totally unpredictable, claustrophobic, paranoid and frightening. 13 year old Michael Baldwin was perfect as the young protagonist, an amazingly refreshing, un-annoying child actor. I was totally convinced by his performance as the lonely teen, desperately chasing after his older brother and displaying just the right amounts of anger, confusion and frustration, yet never giving in to panic even as his world spins out of control. Bill Thornbury as older brother Jody seemed mysteriously detached, yet after repeated viewings, I realized how correct this was in light of the twist ending. He is, indeed, a ghost that Michael simply refuses to give up. Reggie Bannister was completely irresistible as the sweet and gentlemanly Reggie the Ice Cream Man, who manages to remain innocent and lovable even as he suggests ramming a stake through the Tall Mans heart. And the Tall Man, Mr. Angus Scrimm himself...BRRRRR!!! He doesn't have many lines (other than the now-infamous \"BOYYYYYYY!\") but he doesn't need any. His very presence is chilling, and the scene where he stops dead in the middle of a suburban sidewalk in the middle of the day and turns, ever so slowly, to face Michael through a mist of frost emanating from Reggie's ice cream truck, is more frightening than any murder scene set in the dead of night. And need I mention the flying balls? What an original, ingenious invention! This is such an amazing blend of sci-fi, horror and fantasy that I really did not care if it didn't make a whole lot of sense. The flying balls, the dwarves, the yellow blood, and THAT FLY IN THE GARBAGE DISPOSAL!!! Wow. If nothing else, you simply have to give this film and its makers credit for originality. After watching my $5 discount bin copy enough times to remember what a GREAT little movie this is, I went right out and bought the special edition DVD. More money very well spent."
      ],
      "genres": [
         "Horror",
         "Sci-Fi"
      ],
      "productionCompanies": ["New Breed Productions Inc."],
      "summaries": [
         "Mike, a young teenage boy who has just lost his parents, is afraid to lose his brother. This fear causes him to follow his brother to a funeral, where Mike witnesses the Tall Man lift a coffin on his own. Mike decides to investigate and discovers a horrible world where the Tall Man, along with his flying spheres, shrink the to half their normal size and reanimate them as slaves. It is then up to Mike, his brother, and Reggie the ice cream man to stop the Tall man.",
         "After the death of Tommy, who was stabbed by a woman at the cemetery, Jody and his friend Reggie attend the funeral at the Morningside funeral home. Jody is followed by his teenage brother Mike, who has just lost his parents and is afraid of losing his big brother that intends to travel. Mike snoops around the cemetery and sees the mortician known as The Tall Man carrying Tommy's coffin alone without any help. Mike breaks in the mortuary to investigate the mystery and discovers weird dwarf creatures with yellow blood and dangerous flying spheres that protect the location. When he is chased by The Tall Man, he cuts his finger and brings it home to show Jody to convince his big brother that there is a dark secret in the mortuary. Jody, Reggie and Mike discover that The Tall Man is from outer space and is transforming dead bodies in dwarfs to work as slave in his world. Now they decide that The Tall Man must be destroyed. Will they succeed in their intent?",
         "Mike cannot decide what is real and what isn't, and is plagued by vivid nightmares. He gets the shock of his life when he watches, with binoculars, the conclusion of the funeral of his older brother's friend--the mortician (the Tall Man), by himself, lifts the casket into the back of a hearse. Mike heads to the grounds of the mortuary, which is home to very bizarre happenings, including a unique security device. Enlisting the help of brother Jody and ice cream salesman Reggie, Mike attempts to vanquish the Tall Man.",
         "A young boy and his friends face off against a mysterious grave robber known only as the Tall Man, who keeps a mysterious arsenal of terrible weapons with him."
      ],
      "budget": 300000
   },
   "movielensId": 2901,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-05-03",
      "dvdReleaseDate": "1999-09-28",
      "directors": ["Don Coscarelli"],
      "runtime": 89,
      "movieId": 2901,
      "title": "Phantasm",
      "mpaa": "R",
      "actors": [
         "Angus Scrimm",
         "A. Michael Baldwin",
         "Bill Thornbury",
         "Reggie Bannister",
         "Kathy Lester",
         "Terrie Kalbus",
         "Lynn Eastman-Rossi",
         "Kenneth V. Jones",
         "Susan Harper",
         "David Arntzen",
         "Ralph Richmond",
         "Bill Cone"
      ],
      "imdbMovieId": "0079714",
      "originalTitle": "Phantasm",
      "genres": [
         "Horror",
         "Science Fiction"
      ],
      "youtubeTrailerIds": [
         "SBD6-Od1RQI",
         "xQFn0e5d00Q",
         "YeoY5evfTUw"
      ],
      "plotSummary": "A young boy and his friends face off against a mysterious grave robber known only as the Tall Man, who keeps a mysterious arsenal of terrible weapons with him.",
      "tmdbMovieId": 9638,
      "avgRating": 3.18675,
      "releaseYear": "1979",
      "numRatings": 2000,
      "posterPath": "/59GIYULisvSYMwawbbtCnjaPMAn.jpg"
   }
}