{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "missionary",
            "id": 440
         },
         {
            "name": "prostitute",
            "id": 549
         },
         {
            "name": "rain",
            "id": 2217
         },
         {
            "name": "deluge",
            "id": 4875
         },
         {
            "name": "soldier",
            "id": 13065
         },
         {
            "name": "disillusionment",
            "id": 14588
         },
         {
            "name": "lust",
            "id": 14794
         },
         {
            "name": "pre-code",
            "id": 156764
         },
         {
            "name": "persecution",
            "id": 161167
         },
         {
            "name": "record player",
            "id": 168857
         },
         {
            "name": "general store",
            "id": 187261
         },
         {
            "name": "reformer",
            "id": 188618
         },
         {
            "name": "tropics",
            "id": 233544
         }
      ],
      "imdb_id": "tt0023369",
      "video": false,
      "title": "Rain",
      "recommendations": [
         43696,
         121020,
         81110,
         26323,
         1773,
         42669,
         28258,
         43594,
         51394,
         17818,
         50600,
         77966,
         44463,
         44869,
         42641
      ],
      "backdrop_path": "/pjfR28jRDGdiaoiBYg4qj5N86XU.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Sadie Thompson",
               "gender": 1,
               "credit_id": "52fe464fc3a368484e089a2f",
               "name": "Joan Crawford",
               "profile_path": "/18zM03CrzqmF3CuONgeIFkjL62K.jpg",
               "id": 31550,
               "order": 0
            },
            {
               "cast_id": 10,
               "character": "Alfred Davidson",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a27",
               "name": "Walter Huston",
               "profile_path": "/17N08QrQ6Am3hQD5noz5zozGaFH.jpg",
               "id": 19020,
               "order": 1
            },
            {
               "cast_id": 13,
               "character": "Dr. Robert MacPhail",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a33",
               "name": "Matt Moore",
               "profile_path": "/7BwbVt0yCNNJJPeiGbIfzDfr3yt.jpg",
               "id": 61101,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Joe Horn",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a1b",
               "name": "Guy Kibbee",
               "profile_path": "/pqWHnvlW3oDUTHl8KzgBeHJwgQ0.jpg",
               "id": 30002,
               "order": 3
            },
            {
               "cast_id": 4,
               "character": "Sergeant Tim O'Hara",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a13",
               "name": "William Gargan",
               "profile_path": "/b0MLBWskl7cUtbT2BVJ9Lc2U6IH.jpg",
               "id": 87697,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Mrs. Alfred Davidson",
               "gender": 1,
               "credit_id": "52fe464fc3a368484e089a23",
               "name": "Beulah Bondi",
               "profile_path": "/dduvRQRhbwdlbS12nljnHTkChIR.jpg",
               "id": 17755,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Mrs. Robert MacPhail",
               "gender": 0,
               "credit_id": "52fe464fc3a368484e089a1f",
               "name": "Kendall Lee",
               "profile_path": null,
               "id": 232956,
               "order": 6
            },
            {
               "cast_id": 5,
               "character": "Ameena",
               "gender": 0,
               "credit_id": "52fe464fc3a368484e089a17",
               "name": "Mary Shaw",
               "profile_path": null,
               "id": 232955,
               "order": 7
            },
            {
               "cast_id": 2,
               "character": "Hodgson (as Frederic Howard)",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a0b",
               "name": "Fred Howard",
               "profile_path": null,
               "id": 33973,
               "order": 8
            },
            {
               "cast_id": 3,
               "character": "Griggs (as Ben Hendricks)",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a0f",
               "name": "Ben Hendricks Jr.",
               "profile_path": "/wQM6wrEZanNnQ5QoM5ZXWFLZkFd.jpg",
               "id": 229958,
               "order": 9
            },
            {
               "cast_id": 11,
               "character": "Quartermaster Bates",
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a2b",
               "name": "Walter Catlett",
               "profile_path": "/Y5kIRVTNaKuMy8DyrFDP1kwOub.jpg",
               "id": 13819,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe464fc3a368484e089a07",
               "name": "Lewis Milestone",
               "profile_path": "/qBEYKHYyjbMoaJBZtQgVe6fVa5v.jpg",
               "id": 2000,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a39",
               "name": "John Colton",
               "profile_path": null,
               "id": 128436,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 0,
               "credit_id": "52fe464fc3a368484e089a3f",
               "name": "Clemence Randolph",
               "profile_path": null,
               "id": 1185454,
               "department": "Writing",
               "job": "Theatre Play"
            },
            {
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a45",
               "name": "W. Somerset Maugham",
               "profile_path": "/mseHL0TUkLcRXds5Pwjmbec8hyt.jpg",
               "id": 27916,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe464fc3a368484e089a4b",
               "name": "Maxwell Anderson",
               "profile_path": "/fNn8i1ktvg2IKtiImHQlvMBH5wD.jpg",
               "id": 67807,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "56805bb8c3a3682abc006efc",
               "name": "Lewis Milestone",
               "profile_path": "/qBEYKHYyjbMoaJBZtQgVe6fVa5v.jpg",
               "id": 2000,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "56805bc1c3a36860e900d9c9",
               "name": "Joseph M. Schenck",
               "profile_path": "/h4CrbfNzM5W1edUruPjyvl0uxSj.jpg",
               "id": 10520,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "56805bc9c3a3684be900d9a7",
               "name": "Alfred Newman",
               "profile_path": "/498k6KmplSJPvWzAecS7eUnaBNg.jpg",
               "id": 8503,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "56805bd0c3a368607500c51a",
               "name": "Oliver T. Marsh",
               "profile_path": null,
               "id": 127523,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "56805be39251417ddd00e388",
               "name": "Duncan Mansfield",
               "profile_path": null,
               "id": 1465797,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "56805befc3a3682abc006f01",
               "name": "Richard Day",
               "profile_path": "/vzJieFC4Dk7VnKUMIXguf0jNbbf.jpg",
               "id": 8506,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "56805bf79251417def00e7b5",
               "name": "Nate Watt",
               "profile_path": null,
               "id": 144397,
               "department": "Directing",
               "job": "Assistant Director"
            },
            {
               "gender": 0,
               "credit_id": "56805c00c3a3684be900d9af",
               "name": "Frank Grenzback",
               "profile_path": null,
               "id": 1367760,
               "department": "Sound",
               "job": "Sound"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 0.672825,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 61369,
      "vote_count": 10,
      "budget": 0,
      "overview": "A missionary tries to reform a prostitute trapped on a Pacific island.",
      "similar": [
         2832,
         2841,
         466,
         157847,
         50270,
         1554,
         1626,
         2690,
         13855,
         2470,
         1279,
         49010,
         12491,
         47796,
         18167,
         18205,
         42984,
         38077,
         95797,
         63460
      ],
      "original_title": "Rain",
      "runtime": 94,
      "poster_path": "/96QZLgnFYyu18zoTZJIVCb3brkz.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Feature Productions",
         "id": 13914,
         "origin_country": ""
      }],
      "release_date": "1932-10-12",
      "vote_average": 5.6,
      "belongs_to_collection": null,
      "tagline": "A woman without shame. A woman without soul.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Lewis Milestone"],
      "runtime": 94,
      "synopsis": "One drop of rain falls to the ground, then more drops and finally the rain becomes heavy, filling the rain barrel. The rain falls on palm leaves and other tropical plants. We are in Pago Pago, a village in an American Samoa isle, where Marines are stationed. For residents of the village, life is simple, involving fishing. A steamer en route to another port, is temporarily quarantined there when one sailor appears to have contracted cholera. Because of the heavy rains, the ship must stay longer than anticipated. Five passengers on the boat must come ashore. They are Alfred Davidson (Walter Huston), a missionary, his wife Martha (Beulah Bondi), Dr. McPhail and his wife (Matt Moore and Kendall Lee), and Sadie Thompson (Joan Crawford), a prostitute. The only accommodations are at a general store that doubles as a hotel, run by Joe Horn (Guy Kibbee) and his native wife (Mary Shaw). Mr. Horn is a genial and usually drunk innkeeper, who fusses, chortles, philosophizes, and who readily admits that he is escaping from America during the Prohibition years. On the boat prior to disembarking, the quartermaster receives some buddies from the Marine base, and he introduces them to Sadie, whom he had met in a Honolulu establishment of ill repute. They treat her like a friend, a comrade, not a lowly piece of scum or sexual object. Her interest is piqued by the shyest in the group, whom she names Handsome, although he is known as Sergeant Tim OHara (William Gargan). She smokes, jokes, and drinks with the guys, and asks them to take her belongings to the hotel. At the hotel, Sadie sets up her Victrola to play music and dances with Tim and others. Mrs. Davidson is annoyed at the antics of the wanton woman, and complains to Mr. Horn, but he says she is just a friendly person having fun. Mrs. Davidson then confronts the group telling them they should be ashamed to be partying up on the Sabbath. Sadie tells her to mind her own business, yet, in a spirit of compromise, moves the Victrola, music, and party into her own room. Mrs. Davidson persists in complaining about the intolerable noise to her husband. He goes to see the island governor, but is told there isnt any reason to evict the young woman, and anyway it will all stop in a few days. Dr. McPhail, who has a philosophical bent, and the innkeeper Mr. Horn have no objection to Sadie, and make mild comments in defense of her rights, but Mrs. Davidson hardens and insists that her husband put a stop to the activities in Sadies room immediately. The Reverend knocks at Sadies door and enters, shouting ensues, and the Reverend is forcibly ejected by the guys in Sadies room. She comes out and in no uncertain terms tells him to knock and wait to be invited in before he barges into a ladys private room, or else put up with what he got. Sadie Thompson, fights back like lightning whenever something or someone, like Davidson, objects to her lifestyle. The rain does not stop, the hotel guests must stay in close proximity to each other, and from time to time Sadie and the Reverend meet. When only the two of them are present, he talks calmly to her at first, almost sympathetically, because his pastoral duty is to convert sinners, not hate them. Again, at first, she responds well, saying she is sorry to make trouble, and wants to be a good person. But in repeated opportunities their initially respectful conversation turns ugly as he makes demands for an instant, complete turnaround in her behavior. Davidson finds is that his religious persistence annoys her and that Sadie can be as demanding and powerful as he in her responses. The Reverends frustration, amplified by his wifes entreaties, convince him to go back to the governor and threaten him with consequences if he doesnt get rid of Sadie, as the missionary claims to have powerful connections back in Washington. The governor, a weak man, as the Reverend describes him, acquiesces and orders Sadie deported back to San Francisco on the next available ship. Meantime, Tim has fallen in love with Sadie and talks to her about having a future together in Sydney, despite his knowledge of her past. He describes to her how one of his best buddies has married and has a family with a girl who used to work at the same establishment as Sadie, back in Honolulu. As that couple initially met \"illegally\", seeing each other at their worst, they can now appreciate seeing each other at their best. As Sadie has continued to meet with Tim and some of his buddies, and not given up music or dancing or drinking and smoking, the Reverend makes a formal complaint to the military authorities about Tim having attacked him, and Tim is sent to the brig. Sadie is fearful of being sent back to San Francisco, and is without support from Tim, so she weakens and returns to talk to the Reverend, pleading with him to let her wait for another ship a few days more and go to Sydney instead. The Reverend keeps asking her questions, and changes his emphasis somewhat, talking to her about Gods infinite love and forgiveness and the need for repentance about the past, rather than her current behavior, and he begins to have an influence on her. She eventually admits to him that she is wanted in San Francisco for crimes that she did not commit, but was framed for. But the Reverend keeps talking to her about how one must accept suffering, even if unjust, even if she is innocent, because of past sins unrelated to her conviction. She begs Davidson to allow her to remain on the island a few more days; her plan is to flee to Sydney instead. Sadie convinces Dr. MacPhail to try to intercede in her behalf, first with Davidson, then with the governor, but both intercessions are in vain. She confronts Davidson again, not listening to his sermonizing, and yells back at him with such vehemence that he begins to pray out loud instead of listening to her or answering her. As he gets louder and repeats the Lords prayer as a hypnotic incantation, she begins to repeat some of the words, starting with forgive us our trespasses. With each new repetition she learns and repeats more words of the prayer, until she is saying the whole prayer along with him. Soon, Sadie has become another woman through the influence of Davidson and the effect of his prayers. She repents of her old life and is disposed to travel to San Francisco and accept the punishment of the law in expiation for her sins. Davidson feels he has succeeded in saving Sadie's immortal soul by cleansing her from her sins. Eventually Sgt. O'Hara gets out of the brig and comes looking for Sadie. The soldier cannot believe the transformation in Sadie. The \"reformed\" Sadie is much more beautiful with less makeup and a classical dress than the lurid Sadie, yet Tim believes her spirit is broken, that she is a mere shell of her former self. He tries to persuade her to go away with him, rather than return to the U.S. to \"pay for her sins\" as the missionary has convinced her she must, but she is fully under Davidson's spell and refuses. Finally the Golden Gate steamer to San Francisco arrives, and Sadies last evening in the island is in course. The natives are dancing their Polynesian music and their drums emphasize the sensual nature of life in the tropics. Lolling indolently, Joe Horn reads out loud to Dr. McPhail from a small book something that sounds like Ecclesiastes-- for a moment, we nearly believe that Davidson has converted him, too. Then, finishing the passage, he intones, \"Thus spoke Zarathustra.... Good old Nietzsche!\" Meantime, Davidson feels strong emotions at the prospect of being separated from Sadie, and finds himself being led into unfamiliar temptations. He seeks her out and, without using his preaching oratorical style, tells her she need not go to San Francisco after all, and for the first time we see him holding her by her upper arms. He is telling her in a hypnotic voice, over the native drums in the background, that she is now \"radiant, beautiful, one of the daughters of the King\", a moment of sheer unearthly poetry that verges on psychosis, and we believe him. However, she refuses to accept any new plan, and rejects his suggestion that she stay behind, saying she is looking forward to atoning for her sins by her suffering an unjust sentence. Stung by his loss of control over her, he first prays alone, then his face suddenly resolves into a look of predatory lust just before slipping into her room, with the drums implacably beating in the background. The next morning, the fishermen are pulling their nets, and find a dead body in it. It is Davidson, a suicide. The natives first scramble everywhere passing the news, which gets to Dr. McPhail and Horn. They argue as to which of them should go tell Mrs. Davidson. Meantime, Tim has heard the news and comes looking for Sadie. As they approach her door, they hear the jazzy music playing onn the Victrola. When they knock at her door and she appears, she is dressed like the old Sadie, net stockings and high heels and full of bracelets. During the night she found out for sure that Davidson was a total hypocrite, so Sadie switches back to her old self. In spite of being shocked at his suicide, she tells Tim she will to go off to Sydney with him to start a new life. As she leaves the hotel with Tim, they come upon Mrs. Davidson, who tells her humbly, You were right about him, after all.",
      "writers": [
         "John Colton",
         "Clemence Randolph"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0023369/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTg1ODk3NDE0MF5BMl5BanBnXkFtZTgwMTc0MjUzMjE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Fred Howard, Ben Hendricks Jr., William Gargan | See full cast and crew »"],
      "reviews": [
         "RAIN (United Artists, 1932), directed by Lewis Milestone, from the short story about sex, sin and salvation by W. Somerset Maugham, stars Miss Joan Crawford (courtesy of the Metro-Goldwyn-Mayer Company), in one of her most prestigious movie roles that stands in a class by itself. Originating as a 1922 stage play starring Broadway's legendary Jeanne Eagles, it first appeared on screen during the silent era as SADIE THOMPSON (United Artists, 1928), starring Gloria Swanson and Lionel Barrymore. Regardless of its then controversial subject matter, it did well at the box office, earning Swanson an Academy Award nomination. Four years later, it was remade as RAIN. Considering what might have been logical choice in having Swanson and Barrymore reprising their original roles with spoken dialog in place of title cards, Crawford and Walter Huston, forceful screen personalities, were fine substitutes. Unfortunately, lightning or heavy rains didn't strike twice, for that Crawford's sound adaptation reportedly became a box-office flop. The fault might have been for its bad timing, remaking a film so close to its original, and Jeanne Eagles still being in the memory of those who have witnessed her performance on stage, yet had RAIN been distributed a few years later, it might have met with problems with the censors and production code, thus, not having that spark of solid dialog that this version has, and yet, probably would not have had that \"filmed stage play\" appearance either. The camera does take time out for some location viewing of the Cataline Islands, where portions of the film were reportedly lensed. For the benefit of those who are totally unfamiliar with the Maugham story and/or the movie itself, the plot is set in Pago Pago, the Samoan island where a group of steamer passengers are forced to remain because of a minor epidemic on board. And due to the heavy rains, they find they must stay a little longer than anticipated. Among the passengers entering the island's general store/hotel run by Joe Horn (Guy Kibbee) and his native wife (Mary Shaw) are Doctor Robert MacPhail (Matt Moore), a philosopher, and wife, Nina (Kendall Lee); Alfred and Martha Davidson (Walter Huston and Beulah Bondi), a missionary couple, among others. Entertaining the Marines in her state room is Miss Sadie Thompson (Joan Crawford), a prostitute, who enjoys the company of men, playing loud jazzy music and cigarette smoking. She quickly catches the eye of Sergeant Tim O'Hara (William Gargan) but the disapproval of Davidson, who objects to her immoral ways such as drinking and smoking on the Sabbath. At first Davidson forces himself upon her to reform. All he finds is that his religious persistence annoys her and that Sadie can be equally demanding and powerful as he. Sadie tries to meet him half way when she learns that she must return to San Francisco and serve a three year prison sentence, and becomes bitter when Davidson won't give in to her pleas. Eventually Davidson does succeed in saving Sadie's immortal soul by cleansing her from her sins, but in turn, Davidson soon finds himself being lead into temptation and unable to be delivered from evil. For many years, RAIN has earned the reputation as being one of Crawford's mistakes. On the contrary, it's Crawford's performance that keeps the story together. For the first hour, she appears with cat eyes, heavy makeup, curly hair, cigarette, birth mark under the left side of her chin and wearing a tight checkered dress. Her transformation scene occurring later having Crawford's Sadie cleansed from her sins and appearing pure at heart, is surprisingly effective. Walter Huston almost upstages Crawford every which way he can. He, too, gives a solid performance as the Reverend Davidson. The famous scene where Davidson recites the Lord's prayer with the swearing Sadie suddenly reciting the prayer with him, is one of the film's true memorable moments. This scene itself became a clip used for the mid 1970s TV show, \"Don Adams Screen Test,\" for young hopefuls to re-enact this particular scene and win a trip to Hollywood and a part in an upcoming TV show or motion picture. Up to then, RAIN was winning a new audience. Director Milestone was given a difficult task in keeping the pace moving by circling the camera around, moving it at all different angles so not to focus on the central characters for any length of time. His directing technique might not meet with much appreciation today, but his overlooked method as to how to develop the story and characters on a set stage are evident here. Along with forceful dialog, Milestone full takes advantage of this new medium of sound with the use of repeated rain heard falling on the ground and rooftops. The Alfred Newman underscoring benefits the film as well. I first came across RAIN when it made a special television presentation on WNEW, Channel 5, in New York City, June 10, 1973. Preceding the movie was a surprise presentation by Joan Crawford herself giving her profile about working in RAIN. Initially released at 93 minutes, a 77 minute print was presented during its 90 minute time slot with commercial interruptions. By the 1980s, however, RAIN became one of many public domain titles distributed to home video, mostly in full length. Cable television presentations shortly afterwards, ranging from Arts and Entertainment and the Learning Channel (1980s), American Movie Classics (1991-2000) and Turner Classic Movies (TCM premiere March 8, 2007). Columbia updated the Maugham story to post World War I as MISS SADIE THOMPSON (1953) starring Rita Hayworth and Jose Ferrer, with the addition of Technicolor and songs. Of the three screen incarnations of Sadie Thompson vs. The Reverend Davidson (The Prostitute and the Reformer), RAIN (1932) is the best known and revived, especially on rainy day. Although the film itself has aged, the story itself hasn't. (**1/2)",
         "Try to see this on as big a viewing screen as you can, as the film is often quite dark, and Crawford is so beautiful in it you'll want a good look. I loved it! In this second screen version of W. Somerset Maugham's morality tale, \"Rain\", Joan Crawford gives a performance that knocks the rest of the cast off the screen. First made as a silent with Gloria Swanson, the stageplay \"Miss Sadie Thompson\" had been a controversial broadway hit, and young Joan Crawford fought hard to get the coveted role of Sadie. She shed her drawing room manners and designer gowns, researching the part by visiting the red-light district of San Diego to see what the street-walkers of the day looked and sounded like. Her appearance in the film was considered offensive for it's realism, and the film stiffed at the box office. Sadly, it's financial failure relegated Crawford to years of popular but light-weight \"respectable\" roles, before her Oscar-calibre performances of the 1940's and 50's. But for audiences of today, the film is worth reconsidering. The other performers are wooden and stilted but Crawford's performance, embarrassingly natural in 1932, leaps off the screen. The topic matter that was so controversial, even offensive, in the early 1930's is not a hard sell to modern audiences: that bible-thumpers aren't always the good guys, and \"sinners\" aren't always so bad. Further, the feminist aspect of the film is clearer today. As Sadie makes her way around the Pacific, a fun-loving free-spirit often one step ahead of the law, it's the fact that she's a female that draws the ire of the puritanical fire-and-brimstone missionaries: a young man would have gotten away with it. And for us post-Woodstock viewers this touching story strikes a familiar chord: of the harmless, light-hearted kid who hurts no-one but whose very existence is offensive to the powers that be. And it must fairly be said that when she was a young (I think she's about 25 when she made this) she is a strikingly beautiful babe, heavy make-up or not. If you've ever written Crawford off as \"man-ish\" or \"bitchy\" because of roles she did later in her life, check out this movie and take a look at the sexy, vivacious girl who was once described by F. Scott Fitzgerald as \"the personification of the American flapper\"! I found the film fascinating (that's why I went on to look up all the above information).",
         "Joan Crawford was reportedly not happy with her performance in Rain although for the life of me, I can't figure out what she had to be ashamed about. In a few years Rain could not possibly have been made due to the imposition of The Code where no man of the cloth could be anything less than decent. Perhaps Crawford was unfortunately compared to Jeanne Eagels on stage and Gloria Swanson in a silent film adaptation which starred Lionel Barrymore as the sex crazed Reverend Davidson. Still Crawford's Sadie Thompson need not take a backseat to anyone else's. Somerset Maugham wrote the original novel and John Colton adapted it into a play performed on both the London and Broadway stages. Rain is a deceptive work, at first glance it appears quite dated, but in reality its quite relevant for today. My favorite character in this is Guy Kibbee's Horne who runs the hotel/ trading post on that tropical South Sea Island where all the characters are stranded temporarily. Joan Crawford is there and in the same hotel are the Reverend and Mrs. Davidson played by Walter Huston and Beulah Bondi. Kibbee says he left the USA because he saw that 'reformers' like the Davidsons were beginning to dominate the body politic in America and he wanted out. Two things made Rain such a big hit at the time both as a book and play. One was Sigmund Freud who was gaining great popularity talking about repressed sexual desires. Freud would have had a field day analyzing both the Davidsons. It's important to remember that Bondi is just as repressed and uptight as Huston. Freud's writings were not just confined to his profession, they were popularly read by the masses. The second thing was Prohibition. When Kibbee talks about the reformers triumphing (and you have to get the sneer in his voice when he says reformers)he's talking about their greatest triumph, the 18th amendment. The Evangelical Moral Majority types of the day were the ones that brought Prohibition about and America went on its biggest hypocrisy binge because of it. Folks just like the Davidsons inflicted Prohibition and all that went with it on America. Sadie Thompson represents everything the Davidsons say they despise, but what Reverend Davidson wants. It all leads to tragedy. What Maugham is saying and being a gay man himself, knew what it was like to be repressed and show a different face publicly, is just live and let live. Such a simple concept, but one some today have a hard time wrapping their minds around. As for Joan Crawford, she wouldn't have said what she supposedly said about her performance in Rain knowing in the next generation there would be a musical version with a dubbed Rita Hayworth singing with the island kids. Now that one was one for the books.",
         "Despite some hammy acting, especially by a fledgling Joan Crawford, I easily give this movie a 9/10 rating. \"The Code\" refers (in case you don't know) to the morality code put into place in mid-1934 which clamped down very hard on what could be portrayed in the movies. After the code, women that were off-color in any way, shape, or form had to be punished, redeemed through atonement/repentance, or killed off. However, in \"Rain\", Joan Crawford plays Sadie Thompson, a prostitute working on a South Pacific (?) island whom all the service-men seem to adore. They treat her like a friend, a comrade, not a lowly piece of scum or mere sexual object. This, in and of itself, was refreshing to see. And it was from 1932 no less! A group of missionaries are waylaid on Sadie's island due to a torrential rain storm. The head missionary takes an instant dislike to Sadie's character (I believe he is threatened by her free-loving and live-loving spirit), and has the governor of the island extradite her back to the United States, to be prosecuted for some crime that the film does not clearly delineate. There is also a soldier who loves Sadie and who wants to marry her. He knows she's a prostitute. He's had her and so have most if not all of his buddies, but he loves the person she is and wants to spend the rest of his life with her. He is taken to the brig for a week for some petty offense, and during this week the head missionary convinces (brainwashes) Sadie into believing she is a filthy, sinful creature who must pay for her sins. The soldier cannot believe the transformation in Sadie when he gets out of the brig. The interesting thing to me is that as the \"reformed\" Sadie, Joan Crawford is MUCH more beautiful (less makeup, more subdued clothing, softer-focus lighting) than as the lurid Sadie, yet the soldier sees she is much LESS than she was before. He sees the INSIDE of Sadie, and sees she is a mere shell of her former self. He tries to persuade her to go away with him, rather than return to the U.S. to \"pay for her sins\" as the missionary has convinced her she must. I want to avoid spoilers, so I'll just say that events then take place that make Sadie realize she is just fine as she is, and that the missionary was a hypocrite of a human being. It blows me away that the message of this 72-year-old film is more daring than most messages we get from modern-day films. We are still stuck in a post-code madonna/whore view of women that was clearly not in place in the early 30s. Despite the not-best acting in the world, this movie is a must-see for its amazing story and portrayal of a real woman!",
         "For reasons that likely have much to do with her self-perceptions, insecurities, and desires for her screen image, Joan Crawford never liked her performance in this fine film. I do not know why; she was never better. The first talkie of the classic Jeanne Eagels' play \"Rain\", it was effective in every way even though it uses many old-time editing cuts and inserts. They actually worked, and I liked the direction very much, too. Huston was fine as the sanctimonious but sincere preacher trying to convert the \"loose woman\" Sadie Thompson - but in the end loses the battle, something I wish was shown, but then it wasn't in the play or book so I shouldn't expect it. A fine film, and the antique-type music adds to the effect. See the IMDb review of the serviceble Rita Hayworth version, \"Sadie Thompson\", and the horrid movie on the life of the actress, \"Jeanne Eagels\" which contains scenes with Kim Novak trying to recreate the stage play.",
         "Unlike most people, I like both this movie and Crawford's performance, though the sudden and complete change to and from her religion-inspired catatonic state is a bit too rash and unconvincing (not due only to her acting: the film is so constructed). Huston plays a very sinister character. His brainwash on Sadie Thompson is appalling, and the scene when she succumbs while he recites the Lord's Prayer is most disturbing. Milestone's dynamic camera work is indeed overdone, but it is clear that it was a somewhat naïve attempt to counteract the tendency to sluggishness of the early talkies (compare with 'Anna Christie' with Garbo, for instance). The director gives the rain an important role as a powerful surrounding element of nature, almost trying to treat it as a living character, much like what Sjostrom did in 'The Wind'(1929); it doesn't entirely come through, but it was a worthy effort. The quick editing on Crawford's entrance (repeated in the end) is also impressive.",
         "This story, by Somerset Maugham, has been filmed many times in the last seventy-odd years, but this is the first. I cannot say that it is the best of all possible adaptations; a tacked-on sub-plot (involving a romance with an amorous quartermaster) helps the exposition but dilutes the icy cynicism of the basic story, the missionary and his wife are clumsy caricatures of hellfire and brimstone puritanism, while Joan Crawford's \"low-class\" accent is more irritating than it is believable -- one is relieved when she forgets to use it. Yet it shines. The story is told only partially through the script, which seems less wordy than most early talkies: many important points are made purely visually, from the overflowing rainbarrel in the opening sequence to the high-heeled shoe that signals Sadie's return to her prior way of life. The camera *moves*: around tables, in and around groups of people, in and out of doors with incredible smoothness. Crawford's face is also a focus: from her initial \"good-time gal\" flirting with the sailors to the incredible sequence where she (apparently) converts, she leers, pouts, weeps, and more importantly, knows when to stop, in the three scenes she appears (seemingly) without makeup. When Rev. Davidson soothes her in her extremis by telling her in a hypnotic voice (backed by native drums) that she is now \"radiant, beautiful, one of the daughters of the King\" (a moment of sheer unearthly poetry that verges on psychosis), we believe him -- and her. We also believe Huston's face a moment later, as he prays alone, grimaces unreadably, and suddenly resolves into a look of predatory lust just before slipping into her room, the drums implacably beating in the background. Small excellences abound: the natives are portrayed sympathetically, and for the time, fairly accurately-- I especially liked the use of Polynesian music, which, along with the Sadie's hot jazz records, emphasises the sensual nature of life in the tropics. The subject of her profession is handled tastefully, but frankly and with humor: in referring to a friend's marriage to a sister fille de joie, the quartermaster remarks that they initally met \"illegally\" and goes on to say that since they met seeing each other at their worst, they can appreciate seeing each other at their best. A running counterpoint is provided by Dr. McPhail, a more-or-less neutral bystander, and Mr. Horne, the genial (and generally supinely drunk) innkeeper, who fusses, chortles, philosophizes, and gets most of the movie's best lines. Perhaps the best of these occurs sometime after Sadie's conversion: lolling indolently, he reads from a small book something that sounds incredibly like Ecclesiates-- for a moment, we nearly believe that Davidson has converted him, too. Then, finishing the passage, he intones, \"Thus spoke Zarathustra.... Good old Nietzche!\" Sixty-five years later, watching the film on a postage-stamp-sized screen of Real Video, I nearly fell out of my chair.",
         "One of several versions of the often-retold story of Sadie Thompson, \"Rain\" is a tense drama that focuses effectively on the tension between two very different persons, portrayed by Joan Crawford and Walter Huston. While not always convincing, it holds the viewer's attention to the end, and often gives us plenty to think about. Crawford plays Sadie, a young woman with an immoral past, and Huston is Reverend Davidson, a fire-and-brimstone preacher who is stuck with Sadie and several other travelers for a time on a tropical island. A series of confrontations between the two follows, initiated by the reverend, who is outraged by Sadie's character and behavior. The other characters observe, comment, and occasionally try to intervene. Meanwhile, the island is engulfed in an endless, torrential rain, providing an eerily effective backdrop to the story. As the story proceeds, the two characters begin to affect each other in significant ways. Sometimes these changes seem too sudden and not entirely believable, and at other times they are very believable but discomforting in what they reveal about the characters and about human nature. The cast helps get past some awkward moments with some good acting, and this keeps the viewer interested in how it all will turn out. \"Rain\" will not be to everyone's liking, but it is a thought-provoking story that should be of interest to anyone who enjoys psychological drama.",
         "In the movie SCARFACE, Tony Carmonte (Paul Muni) takes Rinaldi (George Raft) and his other gang members for a night of culture - they go to see a play. Carmonte has cultural pretensions, loving to whistle opera arias from MARTHA and other works, usually just before he has someone rubbed out. But he really likes RAIN, and Muni ends up sending his stooge, Vince Barnet, to watch the conclusion of the play while Muni and his gang rub out Boris Karloff. Barnet catches up to Muni later and tells him that \"Sadie\" chose the Marine rather than the \"cloth\" (Minister). Muni likes that, and says \"That Sadie is one smart girl.\" It is not the only time a classic film comments on the play RAIN. In TWENTIETH CENTURY John Barrymore compares another character's behavior to that of the Reverend Alfred Davidson (the Walter Huston performance in this film version). RAIN was considered (in the early 1930s) the greatest stage play since Shakespeare's HAMLET. Certainly it is an engrossing story, based on a short story by W. Somerset Maugham. It's ironic that the play, by John Colton, was not written by Maugham as a a play. Maugham was a successful West End dramatist, whose works are still revived on occasion (in 1990 I saw Glynis Johns and Stewart Granger in a revival of Maugham's comedy THE CIRCLE). But his work was better when he had the leisure to write descriptions of characters and their behavior, or of the settings of his stories. It's his short stories and novels that people still read, not his plays. And RAIN is the only one with any dramatic power - and it wasn't his play. RAIN is set in American Samoa, during the rainy season. A ship lands there, and among those who disembark are Rev. Alfred Davidson and his wife (Beulah Bondi). Both are extremely straight-laced - and apparently happy to be so. Davidson is annoyed to see that the hotel/store owner, Joe Horn (Guy Kibbee) has allowed a \"wanton\" woman named Sadie Thompson to room with there with the Davidsons and Dr. and Mrs. MacPhail. Thompson entertains a large number of American soldiers in her room, and she enjoys playing jazz on her Victrola. Except for the Davidsons, everyone else accepts Sadie. She's really a very friendly young woman, and she makes friends easily. As Mr. MacPhail is a philosopher, and Horn is of a philosophical turn (he keeps reading Ecclesiastes and Nietzche) neither of them really see anything wrong with Sadie. But Davidson is angered by the sinful woman. He has a way of throwing his weight around viciously through his missionary contacts in Washington. Soon he has the soldiers restricted to their barracks, including Sgt. O'Hara (William Gargan) who really cares for Sadie. All protests from MacPhail are ignored (Davidson smilingly forgives the Doctor for his misguided condemnation). Then he turns his attention on Sadie, and forces her to explain why she is the South Seas (it is a criminal matter she is fleeing in the states). He insists that she has to face the criminal charges in order for her soul to be purified. Sadie tries to fight it, but the pressure is too great. However, Davidson's contact with Sadie destroys him. He succeeds in turning her into a true penitent (as he imagines one), but he has become lascivious towards her - and finally has sex with her (we never are sure that it was voluntary or rape). When he realizes what he did, Davidson kills himself. Sadie ends up with O'Hara. The acting in this film was first rate. Because it lost money, Joan Crawford always dismissed it, but her smoldering sexuality bursts every time she appears (Lewis Milestone sets up entrance for her twice in the film which is very suggestive of a \"predatory\" woman). Huston is equally good, especially as the self-admiring, Pharisaical Reverend who sees nothing wrong about pulling political wires to save a soul (or sending that poor person back to face a probably hellish experience that he would never suffer through). His sudden revelation of sexual desire is a little overdone, but not too badly. The supporting characters like Bondi, Kibbee, and those who really see the power-lust in Davidson (Gargan and Kendall Lee, who is MacPhail) give very good account of themselves in the film, as does Walter Catlett as the ship purser who is a friend of Sadie's. If not a perfect film, it is a worthy one. I only hope that one day the Gloria Swanson version made in 1928 shows up so it can be compared to this one.",
         "This has to be one of the most intelligent movies Hollywood produced in the 1930's; I see it comes from Lewis Milestone, who produced the equally-brilliant All Quiet on the Western Front (1930). These films have almost a European look - appropriate, because the novels are by European writers. You've got to admire Milestone for coaxing a sensitive performance out of Crawford, a woman who was happier when hamming it up. No wonder she didn't like her performance here; she was to genuinely ACT. The story deals with the inner nature of a sanctimonious religious hypocrite, something quite relevant now. A lesser director (and novelist) would have turned Sadie into someone unbelievably virtuous, but Milestone and Crawford show us a much more complex character. The other performances are great, too, especially Huston as the tormented evangelist; try comparing him to the chief satanist in The Seventh Victim (1943). The rain itself deserves special mention as a character establishing the insane claustrophobic atmosphere. The stage version was portrayed briefly in Scarface (1932), another great movie from the 1930's."
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Feature Productions"],
      "summaries": [
         "For residents on the idyllic South Seas island of Pago Pago, life is simple until a boat arrives carrying two couples, the Davidsons (who are missionaries), the MacPhails and a prostitute named Sadie Thompson. Davidson is more than just a religious zealot; he's a mad man. When the boat, which was en route to another port, is temporarily stranded on the island due to a possible Cholera outbreak on-board, Sadie spends her time \"partying\" with the American soldiers stationed on the island. Her behavior, however, is more than the Davidsons can stand and soon Mr. Davidson confronts Sadie about her evil ways and offers salvation. When Sadie rebels and the attempted redemption does not go as planned, Davidson arranges to have her sent back to San Francisco, where she fled some years ago due to mysterious personal issues. Davidson soon becomes unhinged and thus begins a series of surprising events which culminate in disaster.",
         "Life is easy in Pago Pago, on an isle in the Pacific. Soon arrives Alfred Davidson, a religious missionary with his wife, Dr. MacPhail with his wife, and prostitute, Sadie Thompson. All of them have a good relationship with the military police lead by Sgt. Tim O'Hara. Sadie settles in the same bungalow where the Davidsons and the MacPhails live. There the girl will wind people up with parties and the music of her phonograph. Even Sgt. Tim O'Hara, nicknamed by Sadie as \"Handsome\", will try to win the heart of her. Sadie's carrying some secrets from her past, some crimes that she has to pay for in San Francisco, so she's trying to scape to Sidney or maybe other place in the Pacific. Alfred can't stand the situation, and he'll move his influences with the governor to make Sadie leaves the isle and returns to San Francisco. Sgt. O'Hara gets very upset with Davidson and he'll try to help Sadie and sends her to Sidney, Australia. But Sadie has become another woman by the influence of Davidson and his prays, she's regretted of her old life and is disposed to travel to San Francisco and confronts justice.",
         "A prostitute finds redemption in Pago Pago thanks to a hard missionary man."
      ],
      "budget": 0
   },
   "movielensId": 2904,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1932-10-12",
      "dvdReleaseDate": "2001-02-27",
      "directors": ["Lewis Milestone"],
      "runtime": 94,
      "movieId": 2904,
      "title": "Rain",
      "mpaa": "",
      "actors": [
         "Joan Crawford",
         "Walter Huston",
         "Matt Moore",
         "Guy Kibbee",
         "William Gargan",
         "Beulah Bondi",
         "Kendall Lee",
         "Mary Shaw",
         "Fred Howard",
         "Ben Hendricks Jr.",
         "Walter Catlett"
      ],
      "imdbMovieId": "0023369",
      "originalTitle": "Rain",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "A missionary tries to reform a prostitute trapped on a Pacific island.",
      "tmdbMovieId": 61369,
      "avgRating": 3.57143,
      "releaseYear": "1932",
      "numRatings": 154,
      "posterPath": "/96QZLgnFYyu18zoTZJIVCb3brkz.jpg"
   }
}