{
   "tmdb": {
      "original_language": "en",
      "keywords": [{
         "name": "woman director",
         "id": 187056
      }],
      "imdb_id": "tt0150574",
      "video": false,
      "title": "Five Wives, Three Secretaries and Me",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [],
         "crew": [{
            "gender": 0,
            "credit_id": "54f39909c3a3681dd400046c",
            "name": "Tessa Blake",
            "profile_path": null,
            "id": 1433989,
            "department": "Directing",
            "job": "Director"
         }]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.008231,
      "production_countries": [],
      "id": 288772,
      "vote_count": 0,
      "budget": 0,
      "overview": "Filmmaker Teresa Blake's portrait of an 88-year-old man with a trail of Texas Exes: Houston oil man, Hollywood playboy, hotshot lawyer and serial monogamist Tommy Blake on a quirky and intimate journey, a daughter looks beyond myth, money, and society -- and all that hair -- in seeking the truth of her father.",
      "similar": [
         258480,
         27586,
         244772,
         401898,
         3981,
         112160,
         858,
         141,
         634,
         437557,
         297762,
         242224,
         376867,
         394117,
         370663,
         10735,
         43923,
         540,
         152532,
         340485
      ],
      "original_title": "Five Wives, Three Secretaries and Me",
      "runtime": null,
      "poster_path": "/jrxeRsWUeenMzpp8Y6mPyq3nJUD.jpg",
      "spoken_languages": [],
      "production_companies": [],
      "release_date": "1999-10-08",
      "vote_average": 0,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.fivewives.com/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Tessa Blake"],
      "runtime": 82,
      "synopsis": null,
      "writers": ["Tessa Blake"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0150574/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM1MzM4NzMwOV5BMl5BanBnXkFtZTcwODE4MTAyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Thomas Walter Blake Jr., Muffet Criner Adickes Blake, Sandra Tessman Blake | See full cast and crew »"],
      "reviews": [
         "\"Five Wives\" etc. is a fascinating and bravely personal documentary that will be loved by any fans of the genre. It echoes McElwee's \"Sherman's March\" in its dissection of southern mores and gender roles. But in her examination of her larger-than-life father -- an oft-married Houston multi-millionaire now in his 70s -- film-maker Tessa Blake's inquiry into her unusual extended family reaches much deeper than even McElwee would dare to tread. Numerous interviews with family friends provide lots of humor, whether or not one is familiar with the milieu, but the film achieves more in it's second half as Blake dares to question herself and her father about the sometimes painful differences between them (mostly centering around Tessa's then-boyfriend, an African-American). A former debutante, the attractive and intelligent Blake is close enough to her subject matter to know exactly where to strike, but it is done so with the loving hand of a daughter who obviously cherishes and respects being her daddy's little girl. The exchange in the final five minutes between Tessa and \"Blakie\" offers better, more intense and heartfelt drama than a decade's worth of TV-movies and chick flicks.",
         "Tessa Blake's \"Five Wives, Three Secretaries and Me\" is an odd piece of work which slowly and patiently mesmerizes the viewer, reeling us to a surprisingly poignant ending. Early on in \"Five Wives...\" I was sure I had the film all figured out -- an often hilarious if somewhat simplistic portrait of the film-maker's father and his wacky, worldly friends. The old coot is an interesting mix of traits: charming, cranky, controlling, creative and -- as one might expect from an 87-year-old southerner -- a racist. But then the film takes a sudden turn for the serious when film-maker/daughter Tessa reveals she lives with a black man. And again, I thought, \"oh, I see where this going...a subtle hatchet job on the evils of racism.\" And again I was surprised to discover that the boyfriend is really only a metaphor for what stands between father and daughter -- not only politics, but age, geography, perspective. One wonders how these two people can ever find a solution. One wonders how this old guy, as the protagonist of a narrative (and make no mistake, this IS a narrative film), can ever evolve enough to effect a change in his world. And herein lies the third surprise of \"Five Wives...\" Tom Blake, charming old coot that he is, isn't our hero at all -- film-maker Tessa herself is the one we watch change and grow over the course of a few short, rich scenes, and it is Tessa who is able to make the tiniest of changes in her father's world, if only by learning to be herself. The film concludes with a scene that is either devastating or full of hope depending on your perspective...I like to think I know which Tessa had in mind. No matter how you crack it, it's a bittersweet tale at best. This film is perhaps the best personal documentary/memoir I have ever seen -- certainly the best of that new generation of films which includes the very moving \"Dear Jesse\" and the interesting, if less successful, \"Family Secrets.\" And lest these comments mislead, let me be clear that the film is also a riot, with actual belly-laughs amid the drama. But the real meat here isn't the comedy, it's the intelligent examination of a culture and a family. This is grown-up film-making for a grown-up audience, and it doesn't beg to be liked. Blake is a patient film-maker, and the film evolves with a languid southern speed. It can be agony waiting for molasses to fall from the jar, but the meal is worth the wait.",
         "This movie was very touching, honest, sad, interesting and complete. However, it leaves Tessa \"without closure\". She wants her father to accept her biracial boyfriend, yet he denies her the opportunity. He quickly ends the conversation as the movie ends. I noticed her tears. The ONE thing she wants him to understand is beyond his social and ethical abilities, which is sad. Money and beauty is all that motivates her father. She loves her biracial boyfriend, yet leaves him, I think, because of her father and what he thinks. Her desire to make her father happy overcomes her own desires for happiness. She does not want to disappoint her father, which is very understanding. She wants to make her father happy, yet wants to be happy herself. This film was excellent. I wish I had her personal email address, which is probably impossible. She knows, as well as I do, that money is not everything in life. Her boyfriend was very intelligent, attractive and fun. Skin color is not significant when it comes to happiness. I wish you happiness, Tessa, if you read this."
      ],
      "genres": [
         "Comedy",
         "Documentary",
         "Family"
      ],
      "productionCompanies": ["Asset Pictures"],
      "summaries": [],
      "budget": 0
   },
   "movielensId": 2909,
   "movielens": {
      "languages": [""],
      "releaseDate": "1999-10-08",
      "dvdReleaseDate": "2003-04-29",
      "directors": ["Tessa Blake"],
      "runtime": 0,
      "movieId": 2909,
      "title": "Five Wives, Three Secretaries and Me",
      "mpaa": "",
      "actors": [""],
      "imdbMovieId": "0150574",
      "originalTitle": "Five Wives, Three Secretaries and Me",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "Filmmaker Teresa Blake's portrait of an 88-year-old man with a trail of Texas Exes: Houston oil man, Hollywood playboy, hotshot lawyer and serial monogamist Tommy Blake on a quirky and intimate journey, a daughter looks beyond myth, money, and society -- and all that hair -- in seeking the truth of her father.",
      "tmdbMovieId": 288772,
      "avgRating": 1.91667,
      "releaseYear": "1999",
      "numRatings": 24,
      "posterPath": "/jrxeRsWUeenMzpp8Y6mPyq3nJUD.jpg"
   }
}