{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sex",
            "id": 572
         },
         {
            "name": "obsession",
            "id": 1523
         },
         {
            "name": "diary",
            "id": 2913
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "student",
            "id": 12105
         },
         {
            "name": "lust",
            "id": 14794
         },
         {
            "name": "art",
            "id": 14893
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "erotic movie",
            "id": 190370
         }
      ],
      "imdb_id": "tt0114151",
      "video": false,
      "title": "Poison Ivy II: Lily",
      "recommendations": [
         18222,
         9264,
         66795,
         153695,
         36979,
         74016,
         110545,
         19568,
         289214,
         36677,
         27458,
         212986,
         36778,
         32013,
         71905,
         192210,
         257258,
         44117,
         221737
      ],
      "backdrop_path": "/5k5QphHPMQqWpcodNVuWBZuXZyD.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Lily Leonetti",
               "gender": 1,
               "credit_id": "52fe476a9251416c75098857",
               "name": "Alyssa Milano",
               "profile_path": "/5ddv9PnPeuoYXzXIbBjREU41K4z.jpg",
               "id": 24967,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Gredin",
               "gender": 2,
               "credit_id": "52fe476a9251416c75098867",
               "name": "Johnathon Schaech",
               "profile_path": "/kHB3nmTs5e4QK6f2QoIMxlGPeJ0.jpg",
               "id": 51670,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Donald Falk",
               "gender": 2,
               "credit_id": "52fe476a9251416c7509886b",
               "name": "Xander Berkeley",
               "profile_path": "/vlZ9FDMk2Xd1WHixPKxnheZoXgR.jpg",
               "id": 3982,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Angela Falk",
               "gender": 1,
               "credit_id": "52fe476a9251416c7509886f",
               "name": "Belinda Bauer",
               "profile_path": "/2YAaeWOjbHig2COD9omZXbirr0e.jpg",
               "id": 44049,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Daphne Falk",
               "gender": 1,
               "credit_id": "52fe476a9251416c75098873",
               "name": "Camilla Belle",
               "profile_path": "/14kdXz89ewkw0aOClxMkSnqLF9X.jpg",
               "id": 38670,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Tanya",
               "gender": 0,
               "credit_id": "56cf2ab09251413e6d002b0f",
               "name": "Kathryne Dora Brown",
               "profile_path": null,
               "id": 1228787,
               "order": 5
            },
            {
               "cast_id": 9,
               "character": "Robert",
               "gender": 0,
               "credit_id": "56cf2ac89251413e59002a97",
               "name": "Walter Kim",
               "profile_path": null,
               "id": 1582756,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Isabel",
               "gender": 0,
               "credit_id": "5828f0579251417b2102fbb4",
               "name": "Kate Rodger",
               "profile_path": null,
               "id": 149542,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe476a9251416c7509885d",
               "name": "Anne Goursaud",
               "profile_path": null,
               "id": 2873,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe476a9251416c75098863",
               "name": "Chloe King",
               "profile_path": null,
               "id": 28899,
               "department": "Writing",
               "job": "Screenplay"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.305338,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 18220,
      "vote_count": 36,
      "budget": 0,
      "overview": "A young and naive college art student becomes obsessed with assuming the identity and personality of a departed coed who used to live in her room, and in so doing causes complications that result in two men, a student and her art professor, lusting after her.",
      "similar": [
         3134,
         979,
         281,
         281957,
         226,
         133805,
         27066,
         357096,
         49950,
         9093,
         13538,
         1259,
         28468,
         8923,
         238636,
         395834,
         263472,
         12619,
         74997,
         445954
      ],
      "original_title": "Poison Ivy II: Lily",
      "runtime": 106,
      "poster_path": "/bYU4DdtGM4JBu5eZNkauDjJhXpN.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
            "name": "New Line Cinema",
            "id": 12,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "CineTel Pictures",
            "id": 17067,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "MG Entertainment",
            "id": 17068,
            "origin_country": ""
         }
      ],
      "release_date": "1996-01-16",
      "vote_average": 4.5,
      "belongs_to_collection": {
         "backdrop_path": "/hFktEH1hJsf4kzTnYjJB8rMiJpl.jpg",
         "name": "Poison Ivy Collection",
         "id": 48188,
         "poster_path": "/wKFflwLibrLXg7U8hcXnzGyziXz.jpg"
      },
      "tagline": "Passion. Seduction. Betrayal. Lily wanted to be just like Ivy.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Anne Goursaud"],
      "runtime": 106,
      "synopsis": "Moans and sexual noises in the half-light. Lily Leonetti (Alyssa Milano) is making love to a man. After the act, he gets up and tells her that \"it's not working out\". She looks devastated for a moment. Cut to Lily arriving to another place. She is a sheltered art student from Michigan attending college in Los Angeles, California. She finds an apartment, and she soon notices her roommates, Tanya (Kathryn Doyle Brown), a friendly lesbian artist who becomes a good friend to Lily, Bridgette (Victoria Haas), a cruel and taunting artist and dancer who initially takes an immediate dislike to her, and Robert (Walter Kim), the silent but talented musician, all art students, aren't quite normal. For the first time out of her village, she is still used to her protected life in Michigan and frequently calls her parents. One day Lily discovers a box of items belonging to Ivy, a girl she has never met before. In the box, she finds nude pictures of the girl and her diary. She is soon drawn to the content, also desiring for the girl's sexual confidence and fearlessness. In art class, Lily has trouble expressing herself, unlike Gredin (Johnathon Schaech), an attractive co-student and sculptor she soon starts dating. Meanwhile, Lily gets a job to pay for her rent, babysitting Daphna (Camilla Belle), the eight-year-old daughter of her art teacher Donald Falk (Xander Berkeley). Slowly, one step at a time, Lily becomes obsessed with Ivy's letters and photos, attempting to take over her image. Soon enough, she cuts her hair short, pierces her belly button, and starts wearing more revealing clothes. Gredin grows even more attracted to her and it doesn't take long before they start having sex. He is unamused by the amount of private time she spends with Donald, though, but she explains it's because of the babysitting. She inspires Donald to perform art again, having noticed that he's long been afraid to express himself. She agrees to pose nude for him, and also finds her own way to express herself in the meantime as well. During this process, he secretly falls in love with her, which has a great deal of impact on his marriage to Angela (Belinda Bauer). However through the movie, it can be shown that Donald's infatuation with Lily soon deepens to obsession. One day, Lily catches Gredin and Bridgette together. Feeling jealous and upset, she starts to rebel, thereby estranging herself from her friends at the apartment building. At a party, Lily enjoys the attention she is getting from men, and she amuses herself, until she sees Gredin intimately dancing with another girl. Trying to make him jealous, she kisses a masked guy, who turns out to be Robert. She eventually spends the night with Gredin, but he dumps her the next day, explaining she has changed too much. Meanwhile, Angela has found Donald's drawing of Lily and thinks he has an affair with her. Donald, already depressed since he saw Lily kissing Gredin, takes it out on Lily. He later claims he is in love with her and tries to kiss her. She is initially unamused by his attempts, but they eventually heavily make out with each other, until they are interrupted. She leaves and soon reunited with Gredin. A few days later, Lily is invited for dinner at the Falk family and brings Gredin with her, which upsets Donald. When they are alone in a room, Donald forces himself upon Lily. She tries to stop him, but has no success. They are eventually caught in the act by Daphna, who runs away and is hit by a car (but luckily, in Gredin's words, ends up \"going to be all right\"). Lily, traumatized by what happened that night, returns home and destroys everything that has to do with Ivy. She is surprised by a psychotic Donald, who attacks her. Gredin tries to save her, but Donald beats him up and even tries to stab him. She tries to run away by going to the roof. He follows her and eventually falls off the roof to his death. In the final scene set a few days later, Lily and Gredin say they love each other, and they finally decide to be with each other... free from the unseen influence of Ivy.",
      "writers": ["Chloe King"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114151/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMzI1NzYyMzc5MV5BMl5BanBnXkFtZTcwMjQwOTYyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Alyssa Milano, Johnathon Schaech, Xander Berkeley | See full cast and crew »"],
      "reviews": [
         "if you're renting a movie just to see Alyssa Milano nude, rent this one instead of her other nudie flick \"embrace of the vampire\". she looks noticeably a lot more toned and sexy and the plot seems more concerned with keeping her clothes off or having her wear almost nothing at all. other than her great body, this movie is quite a chore to try to sit through. there is nothing else to bother with here other than to see Alyssa nude. so, as a nudie flick, it's okay. otherwise this is a pretty bad movie. rating:3 (though Alyssa's body deserves a 9)",
         "Poison Ivy 2: Lily is a great movie, much better than the first. While the original Poison Ivy was very tame (it's only nudity was a brief shot of a bare butt) Poison Ivy 2: Lily contains loads of nudity. Lily arrives at an art college where she takes up with sculptor Gredin and poses nude for her art teacher Donald Falk. Soon Donald is so obsessed with Lily that he tries to rape her and that leads to some tragic consequences for all involved. I did enjoy the original Poison Ivy but enjoyed the 2nd much more because it dared to show more bare flesh and had a good storyline. I recommend that you see both films. Poison Ivy 2: Lily is Rated R for strong sexuality and nudity, adult language, and for some violence. NOTE: Poison Ivy 2: Lily was released in two versions: an R Rated version that trims some sex scenes, and an UNRATED version that contains two more minutes of sexual sequences.",
         "Poison Ivy II stars Alyssa Milano as Lily, a shy and naive Midwestern girl who moves to L.A. to study to become an artist. After feeling like an outcast among her new, more exotic peers, Lily happens upon a journal stuffed away in a closet in her new apartment. The journal contains stories of a confident seductress who gets what she wants and is not afraid to do anything. Lily decides to \"become\" this seductress. Sexy Johnathon Schaech plays her love interest. This movie is very mid '90s--the clothes, hairstyles, music. It is a lot of fun. I first saw this edited for TV a long time ago, but tonight I saw the unedited version on HBO and I must say I had no idea it would be so different. Milano and Schaech give top-notch performances and Xander Berkeley was effective as the creepy, sleazy art professor. The artwork in the film was very beautiful and Joey Krees was too cool as Peter the Performance Artist (surely he has performed in other works?!--nothing listed on IMDb). If you want sensual mid '90s fare, then Poison Ivy II is the one to see.",
         "Alyssa Milano's nudity did not make this movie trashy. This movie was the best one of the Poison Ivy saga. It had a very good plot and was very interesting. I don't think it was just a soft core porn movie, I believe all the nudity had a reason that was directly associated to the plot.",
         "Personally I thought the film was very entertaining. The plot itself was very well planned out and the actors were fantastic. I'd describe this film as a great representation of a 90's genre flick, being that it was sensual and erotic while at the same time providing a thrilling storyline. As a fan of Alyssa Milano I'd say this was one of her best films and Jonathon Schaech did a great job in this film as well. More than just a movie full of sexual scenes, it touches and delves into a topic we can all relate to. I mean how many of us haven't imitated a person we've idolized? It's not unnatural to want to be like someone you thoroughly admire. Overall, this movie was very entertaining and worth the watch. If you're looking for a throwback to the good old 90's while getting to see some sensual action, then this is the movie for you. Definitely better than the first I'd say. But then, why don't you see for yourself?",
         "Well,if you are Alyssa fan like me then this is the one which is surely not to be missed.Extremely tame story line and full of eroticism, the movie don't have much to offer in terms of any substance or plot.Lily(Alyssa Milano) is an art student who comes to California and join the drawing school.She rent the house nearby where she discovers the diary of a women she has never met.The diary is full of erotic desires & nude images which awakes passion in Lily as she become obsessed with the diary,try to mould herself like that women....... But this is only one part of the story.Later its being shown that her art teacher is lustful about Lily,besides she is having a boyfriend also.Though movie is quite predictable and rather slow but there is no doubt that Alyssa Milano looked extremely cute & beautiful and totally the movie belonged to her.Sex scenes in the movie are rather unconventional but interesting.So inspite of having nothing the movie lives to its B-grade sex-flicks standard and as far as Alyssa fans are considered its a feast for them.",
         "wow......Alyssa Milano, dang i'll never watch Who's the Boss the same way ever again. She does have a banging body let me say that much,, as for the movie.. where do i start, well here goes nothing, the premise i thought was okay,, i mean finding a diary, then trying to be somebody y our'e not to gain attention,, hmmm., anyway, she discovers her body, and what she want to do,, she is betrayed, betrays others, and is downright cold. i didn't care for the ending though, but everything else in between made sense to me. This isn't a bad sequel,, i thought the original was better, but this one was more sensual, and had more depth to it sexually than the first. This film reminds me of like a Soft Core Porn almost, sort of like Nicolas Cage in Zandalee, but softer, overall not a bad pic,",
         "Alyssa Milano(\"Who's The Boss?\" and \"Charmed\") plays Lily in the sequel to \"Poison Ivy\". She's very, VERY HOT after doing the TV show \"Who's the Boss?\" The best part of her I couldn't get enough of is her stomach. I really got turned on in the bellybutton piercing scene. That's the part she undergoes her transformation. What was the cause? The diary of Ivy, the first girl who tried to destroy the lives of a rich family. However, since Lily was an art student, the instructor is coming on to her. Much like a role reversal here in the movie. Being sheltered is always a drag when you want to fit in, sometimes pressure is more damaging. The best thing about this movie is more of a learning the errors of the others' lifestyle. Just being yourself is necessary. This movie along with the first one is a definite must see. You won't be sorry! Rating 3.5 out of 5 stars.",
         "Lily is an art student who has moved away from home to start at a new collage, but also she's having trouble trying to fit in with her other pupils and flat mates. That's until she discovers a box in her closest that has some items that belong to a girl named Ivy. From what she gathered from these items that ranged from sexy clothing, her artwork and to diary, she was one fearless and raunchy girl who liked to play games and tease to get what she wants. So, now Lily strings along her guy who she's seeing and that of her married art teacher who slowly has became infatuated with her. Alyssa Milano\u0085 there's no shadow of a doubt that she's best reason for watching this extremely tacky picture; really that's it. When Milano makes her first appearance she looks reasonably daggy, but she sure does look fine either way. The first film, which starred Drew Barrymore and Tom Skeritt I thought, was somewhat dull and rather ordinary. Again this one is no better, but since I'm a sucker for anything that involves Milano, it had me clicked in! This treads the same path of the first flick by presenting a adult thriller that oozes with steamy erotica, so if you like your trashy melodrama, bare flesh and soft core sex, well then this should tickle your fancy. One thing that I thought that the original had over this pointless sequel other then an actual story, was that it had such a heavily grim edge to it. But nuff said about the first film, in-retrospect this one is far more sexy and more steamier than the first. Although the one redeeming factor of the film, of course Milano, can't help that it seems to loose steam soon after it eventually begins. It's hard to put in words, but not much did happen, really. No plot behind the convoluted mess, but to rehash what we've seen before with moments that try to outdo each other, pointless flashbacks of Ivy (not from the first film) and some sequences that miss the point. Even when Milano's character starts acting out the desirable ways of Ivy from her diary it's slightly hypnotic, but that's more to her tempting presence and desirable actions than that of the material. The film's unpleasant ending is one of the things that go beyond the call of nature, but then at least it had some energy going for it, but still it was a bit overwrought. The pacing is at a snails pace and because of that boredom quickly moves in. Since its set amongst an art environment, the whole artiness of it got a bit too shallow for its own sake and it could have destroyed the overall mood, that's if it even had one. But this is what you expect from your run-of-the-mill low budget film that would go straight-to-video without a whimper. Alyssa Milano silky presence evokes such an allurement, but she doesn't just get by with her looks as her performance is definitely above average and Xander Berkeley dished out a more then decent performance. It's just too bad they had to work with such undeveloped characters and a stiff script that was filled with something corny amongst every few lines. Sometimes I thought it was too thick and they had too much to say when it probably would have worked out better with less or none at times. The soundtrack had some sustainable tunes from the easy listening, rock and Gothic\u0085 but sometimes it was just too overwhelming in a very cheesy way. I most likely saw the cut version, which I watched off TV, but that's not what really bother me, it was that there were too many ad breaks which made the film drag even more. It's a real long shot to call this schematic flick good, but for the undemanding its light entertainment. Only for those who enjoyed the original or have a soft spot for Alyssa Milano. Obviously, I'll be going with latter.",
         "There is a certain kind of bizarreness that you only find in low-budget or straight-to-video cinema. Make no mistake, this is an awful film, but it's this straight-to-video charm (which I am going to arbitrarily name \"Ed Wood Charm\")that makes it enjoyable. The dialogue is lame and the plot must have been the result of a fun party game, but it's still enjoyable. Veteran actor Xander Berkeley gives another great performance, despite the material. I was impressed with Alyssa Milano. I used to think she got by on looks, but she gives a damn fine performance in this otherwise damned film. Nice job, Girl."
      ],
      "genres": [
         "Drama",
         "Thriller"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "CineTel Pictures",
         "MG Entertainment"
      ],
      "summaries": [
         "Lily is a sheltered art student from Michigan going to school in California. She finds an apartment and her roommates aren't quite normal. One day she finds a box of items belonging to a girl she's never met before. But in the box are nude pictures of the girl and her diary. Lily begins reading the diary and realizes that she's going to change her life and become a wild woman! She begins dating a guy and at the same time her art instructor begins to lust after her. The struggle begins when her boyfriend thinks she's unfaithful to him and her art teacher becomes obsessed.",
         "A young and naive college art student becomes obsessed with assuming the identity and personality of a departed coed who used to live in her room, and in so doing causes complications that result in two men, a student and her art professor, lusting after her."
      ],
      "budget": 0
   },
   "movielensId": 291,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1996-01-16",
      "dvdReleaseDate": "1999-11-02",
      "directors": ["Anne Goursaud"],
      "runtime": 106,
      "movieId": 291,
      "title": "Poison Ivy II: Lily",
      "mpaa": "R",
      "actors": [
         "Alyssa Milano",
         "Johnathon Schaech",
         "Xander Berkeley",
         "Belinda Bauer",
         "Camilla Belle",
         "Kathryne Dora Brown",
         "Walter Kim",
         "Kate Rodger"
      ],
      "imdbMovieId": "0114151",
      "originalTitle": "Poison Ivy II: Lily",
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["cWeLiFAycR4"],
      "plotSummary": "A young and naive college art student becomes obsessed with assuming the identity and personality of a departed coed who used to live in her room, and in so doing causes complications that result in two men, a student and her art professor, lusting after her.",
      "tmdbMovieId": 18220,
      "avgRating": 2.29958,
      "releaseYear": "1996",
      "numRatings": 711,
      "posterPath": "/bYU4DdtGM4JBu5eZNkauDjJhXpN.jpg"
   }
}