{
   "tmdb": {
      "original_language": "fr",
      "keywords": [],
      "imdb_id": "tt0168740",
      "video": false,
      "title": "L'ennui",
      "recommendations": [
         64414,
         2861,
         3935,
         10613,
         41801,
         73764,
         39340
      ],
      "backdrop_path": "/oEzMMrcxv8O6S7uBTH3tYuwK77i.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Martin",
               "gender": 2,
               "credit_id": "52fe48bbc3a36847f817689d",
               "name": "Charles Berling",
               "profile_path": "/5W9uDe33eFYFNOW5lqJVvlzHkzb.jpg",
               "id": 48576,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Cécilia",
               "gender": 1,
               "credit_id": "52fe48bbc3a36847f81768a1",
               "name": "Sophie Guillemin",
               "profile_path": "/uZOFC6KldipWgYm4o8He8GfBS0x.jpg",
               "id": 67902,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Sophie",
               "gender": 1,
               "credit_id": "52fe48bbc3a36847f81768a5",
               "name": "Arielle Dombasle",
               "profile_path": "/yl6RniErLOkQKxUJjn791WBJB5O.jpg",
               "id": 28626,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Meyers",
               "gender": 2,
               "credit_id": "53f528b70e0a267f8d00301d",
               "name": "Robert Kramer",
               "profile_path": "/tSbaZNs37qLaVic7m4IDZZBz558.jpg",
               "id": 106157,
               "order": 3
            },
            {
               "cast_id": 16,
               "character": "Cécilia's Mother",
               "gender": 1,
               "credit_id": "54f8bdb092514118df001c1d",
               "name": "Alice Grey",
               "profile_path": null,
               "id": 1435402,
               "order": 4
            },
            {
               "cast_id": 17,
               "character": "Cécilia's Father",
               "gender": 0,
               "credit_id": "54f8bdc2c3a36834a5004947",
               "name": "Maurice Antoni",
               "profile_path": null,
               "id": 145089,
               "order": 5
            },
            {
               "cast_id": 18,
               "character": "Momo",
               "gender": 0,
               "credit_id": "54f8bdd49251416f3700478e",
               "name": "Tom Ouedraogo",
               "profile_path": "/vdTjgCezoJLXko66ARW8ONg5Qkr.jpg",
               "id": 1433418,
               "order": 6
            },
            {
               "cast_id": 19,
               "character": "Doctor",
               "gender": 0,
               "credit_id": "54f8bde892514151c6005126",
               "name": "Patrick Arrachequesne",
               "profile_path": null,
               "id": 1435403,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "54f8bd5fc3a36833dc0044a3",
               "name": "Sabine Delouvrier",
               "profile_path": null,
               "id": 1435401,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bbc3a36847f81768ab",
               "name": "Cédric Kahn",
               "profile_path": "/tdNMZ5cTQ4exvV5vRHlbFDZ0tgi.jpg",
               "id": 93903,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bbc3a36847f81768b1",
               "name": "Cédric Kahn",
               "profile_path": "/tdNMZ5cTQ4exvV5vRHlbFDZ0tgi.jpg",
               "id": 93903,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe48bbc3a36847f81768bd",
               "name": "Alberto Moravia",
               "profile_path": "/eEDRQhp7A6J4AMJUIlJcxLOVg1g.jpg",
               "id": 3780,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe48bbc3a36847f81768c3",
               "name": "Paulo Branco",
               "profile_path": "/8kbzoASh1fsk47JOHxSfcZssAyD.jpg",
               "id": 5268,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48bbc3a36847f81768c9",
               "name": "Françoise Clavel",
               "profile_path": null,
               "id": 552349,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "54f8bcbdc3a368351d0047e4",
               "name": "Laurence Ferreira Barbosa",
               "profile_path": null,
               "id": 78121,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "54f8bce99251416ee400444f",
               "name": "Yann Dedet",
               "profile_path": null,
               "id": 6318,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "54f8bcf692514151c600510b",
               "name": "Pascal Marti",
               "profile_path": null,
               "id": 23465,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "54f8bd1dc3a36834a200465b",
               "name": "François Abelanet",
               "profile_path": null,
               "id": 1317962,
               "department": "Art",
               "job": "Production Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.822397,
      "production_countries": [
         {
            "iso_3166_1": "PT",
            "name": "Portugal"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 55107,
      "vote_count": 13,
      "budget": 0,
      "overview": "A philosophy teacher restless with the need to do something with his life meets a young woman suspected of driving an artist to his death. He finds the very simple Cecilia irritating but develops a sexual rapport with her. Obsessed with the need to own and tormented by her inability to respond to him, he becomes increasingly violent in a quest he can't name - a quest that slowly begins to undermine his certainties.",
      "similar": [],
      "original_title": "L'ennui",
      "runtime": 122,
      "poster_path": "/p5gAhWf1rZGJcMs4Kdu6FH9CcG5.jpg",
      "spoken_languages": [{
         "name": "Français",
         "iso_639_1": "fr"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Gemini Films",
            "id": 6584,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Ima Films",
            "id": 30576,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Madragoa Filmes",
            "id": 11143,
            "origin_country": "PT"
         },
         {
            "logo_path": null,
            "name": "Canal+",
            "id": 5358,
            "origin_country": "FR"
         },
         {
            "logo_path": "/h4ZJb3wnffXHeeU6mtcldII84fo.png",
            "name": "Centre National de la Cinématographie",
            "id": 310,
            "origin_country": "FR"
         }
      ],
      "release_date": "1998-11-14",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "France",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Cédric Kahn"],
      "runtime": 122,
      "synopsis": null,
      "writers": [
         "Cédric Kahn",
         "Laurence Ferreira Barbosa"
      ],
      "originalLanguage": "French",
      "imdbLink": "http://www.imdb.com/title/tt0168740/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA5ODMwOTA3Nl5BMl5BanBnXkFtZTcwMDc1NjgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Charles Berling, Sophie Guillemin, Arielle Dombasle | See full cast and crew »"],
      "reviews": [
         "This film is a work of genius, capturing the feeling of Ennui in explicit detail. The sex scenes are just that, scenes of sex. To show passion would be to break out of the male leads feeling of boredom or ennui. The female part if one dimensional to give her no redeeming features, after all the male wants her but can't understand why he wants her as she does nothing for him, his pursuit is simply because he can't control her. If she showed any kind of feelings towards him the film would be finished. The film is about obsession and not being able to do anything else because this obsession controls your life and takes all your energy. I found the film both breathtaking and disturbing in equal measures. Definitely one to watch.",
         "Even though I'm not a philosophy professor nor in mid-life I felt every bit of the emotions that Martin went through. I lived much of the same experience(divorce and then new relationship) he does in this movie. The movie evoked strong emotions in me and was almost painful to watch as Martin became more obsessed over Cecelia. Sophie Guillemin is gorgeous and Cecelia was a perfect counter for Martin. While I rate this movie very highly I'm not sure I ever want to see it again. Much too painful, but also excellent. I've been watching a lot of foreign(mostly French, Italian and Japanese) movies of late and this ranks right near the top.",
         "Very French film in which a jaded, self-centred philosophy professor becomes embroiled in a physically consuming, but emotionally vacant, relationship with a blank young girl. Unpleasant, claustrophobic and sharply humorous, it boasts strong performances from all its cast. But eventually the film's focus, as narrow as that of its central character, starts to become a little wearing. Not wholly successful, but interesting nonetheless.",
         "This movie is pure torture for the viewer. But it is extremely important as well. It reflects on the power relationship between men and women. Power is exercised by sex. The erect male member reduces the woman to a slave. Here the young girl reverses the process by simply ignoring it. All all-consuming vagina turns the power relationship around. He wants to control her, to own her - not only her body but also her mind. She gives him her body but also utilizes his body for her needs. When he is unable to get control of her, he loses control of his own life. I'm glad to have watched this movie but I surely won't watch it again.",
         "When you adapt a work by Alberto Moravia to the screen, you know that human detachment, alienation or themes thereof are going to dominate. That's what happens in 'L'Ennui' -- characters driven by excess, searching for the unsearchable or the unreachable. The ambiguity of the word 'ennui' fits very well: in English translation, the word can mean not only boredom but also human emptiness. This is what I believe director Cedric Kahn was aiming for, and he's certainly on target. This is a descent into an obsessive abyss by Martin, played by Charles Berling with such frenetic neuroticism that he all but leaps off the screen. He lives and suffers through the lives of others. He meets Cecilia, a 17-year-old artist's model, stunningly portrayed by Sophie Guilleman. Martin asks questions about the artist, who died shortly after an obsessive love affair with Sophie. Despite his extensive intellectual training in philosophy (a Moravia-Kahn 'in-joke' here), Martin cannot fathom the emotional emptiness of Cecilia, who is a character straight out of, well, the existential literature of Moravia and Camus (Cecilia reminded me of the latter's Mersault in 'L'Etranger,' a classic study of human detachment). Martin asks Cecelia endless questions about emotional matters, but she cannot answer them. She only understands transient forms of pleasure (never 'happiness'), and her laissez-faire attitude drives Martin into increasing levels of madness. He thinks he loves her, but he has no understanding of love at all, and cannot find the centre of Cecilia's amiable indifference. He screams about 'possessing' her, as if she were a commodity. She neither loves nor hates him; she is simply neutral, which Martin cannot grasp. This is a brilliant work on a difficult subject, although it's perhaps about 20 minutes too long. Slowly and meticulously, Kahn unpeels the layers of the endless human dilemma called love. Once again, the French have delivered a film that just wouldn't see the light of day in Hollywood. I can hear the producers in LaLaLand now: who wants to pay for a film that focuses on a basic philosophical problem: the nature of human existence? Fortunately, we can still see these kinds of films, but they'll never come from Hollywood.",
         "Imagine a relationship divided into two parts: the smaller one is sex and the rest is talking \u0096 about sex, sex and love. Such is the relationship between Martin and Cécilia in this wonderful movie. I say wonderful because although this premise doesn't sound too entertaining throughout almost two hours, I was really amazed and didn't feel l'ennui \u0096 boredom at any phase of the film. Beyond the sex scenes (Sophie Guillemin looks really great, I must say\u0085) and the endless interrogations Martin subjects Cécilia to, the action somehow unfolds and unfolds and in the end we know that we have not only seen a philosophical love film like `Before Sunrise' but a real STORY, a unified whole. Martin's character is precisely copied from real life by author Alberto Moravia and perfectly portrayed by Charles Berling. This kind of man, apparently philosophical, but actually egocentric, possessive and concerned only about himself, is in my opinion the only realistic modern kind of man who is worth building a fictitious story around. Of course, this story shows, with Martin, mainly the negative qualities of the `generation X'-man. Cécilia's character holds some problems for me. Obviously, Cédric Kahn is one of those filmmakers whose movies are perfect entertainment, but you're not allowed to think about them later because you catch on things that are truly unconvincing but would destroy the whole movie if you changed them: the person of Cécilia is like Helena in the Greek mythology. She cannot exist in reality. She is just an ideal, completely freed from every kind of feeling or humanity. She answers to Martin's questions eagerly and tirelessly and she has hardly any opinion about anything and that's what drives him crazy \u0096 that's what the whole movie is built upon. But a Greek Helena doesn't fit into the amazingly realistic world the movie shows: it's impossible to imagine that she had a life before the beginning of the film and will have one after the end. By focusing on Martin and his view alle the time, Cédric Kahn is able to prevent us from realizing this while watching and that's a plus for him. However, it is a remarkable flaw in a movie I enjoyed very much. It's a little bit like in `The Sixth Sense': Show one more scene, and the whole movie becomes senseless.",
         "I came across this movie unexpectedly while watching TV late at night. This is probably the best context you can watch this movie in, as fairly light entertainment, with a story I can generally relate to, a pretty lead actress and a frequency of love scenes that is characteristic only of French art house or Californian porn movies. As a serious film though, \"L'ennui\" does not manage to pull it off -- probably the classic case of a good book being transformed into a lesser movie. The male character comes across as a schoolboy high on testosterone, not the philosophy teacher he is supposed to be (incidentally a position that exists only in French movies where no one ever has to do any real 9 - to - 5 work), the sex scenes in all their explicitness are curiously prudish (the lovers always appear to do it fully dressed and panting as if they had just completed the Ironman contest), and Cécilia's part is just too one - dimensional. Nevertheless, I found the movie entertaining, and it really made me want to read the book (by Alberto Moravia). And you can't say that about too many movies nowadays, can you?",
         "Based on the novel of Alberto Moravia, \"L'Ennui\" tells us the story of a philosphy teacher (Charles Berling) who, just separated from his wife, meets the young and buxom Cecilia, former model of a painter who died making love to her. As their relationship grows, we fall with Berling into despair (when he is unable to quit her even if he wants to) and even jealousy. The famous scholar cannot find relief in his knowledge, nor in his irritated former wife and is therefore condemned to wander alone, following this woman, directly out from a Renoir painting, he love and despise at the same time and his depiction is really living.",
         "Cedric Kahn has directed this film based on a novel by Italian writer Alberto Moravia. It is generally said that making a film based on a book is a daunting task. This is precisely the case with this film. L'Ennui is a real oddball film. It is due to its diaphanous nature as no one is really sure what the real theme of this film is. If viewers decide to ruminate over the film's theme, they will have to choose from some weird options :tumultuous sexual escapades in the life of a failed writer, exploitation of a young girl and lastly gross neglect of her old parents by a young girl. The film also suffers from a fundamental flaw which consists of its characters' vacillatory stances. There is a writer who is facing emotional crisis and is not sure of what he is supposed to do. There is a young girl who allows herself to be exploited. Charles Berling is passable as the writer in question. He outlines his frustration through his anger. Sophie Guillemin is above average in a lackluster performance. Admirers of pleasure in films might want to check it out but they would be grossly disappointed by this film's lifeless scenes of physical love.",
         "Though I agree with burrobaggy that the film becomes irritating part way through, I have to say that this is exactly the point of it. We are forced to watch Berling's character become increasingly obsessed with Guillemin's, to the point where we are not only disturbed, but also completely perturbed by his inability to let go of Cecilia, who seems so wonderfully and completely uninterested and distant (something French actresses do best!). I admit that while I watched the movie, I had to turn it off part way through; I, myself, became so anxious by and annoyed with Martin's obsessiveness. At first, I thought it was because the movie was totally unappealing, even unwatchable. However, once I watched the rest of it and I realised that Kahn probably had every attention of making his subject so intense, so masochistic, and so repetitively annoying in his obsession, the utter irritation and anxiety that the movie provoked in me suggested that not only is the filmmaker very successful in representing pathological behaviour, but also in implicating his audience in that representation."
      ],
      "genres": [
         "Romance",
         "Drama"
      ],
      "productionCompanies": [
         "Gemini Films",
         "Ima Films",
         "Madragoa Filmes"
      ],
      "summaries": [
         "A philosophy teacher restless with the need to do something with his life meets a young woman suspected of driving an artist to his death. He finds the very simple Cecilia irritating but develops a sexual rapport with her. Obsessed with the need to own and tormented by her inability to respond to him, he becomes increasingly violent in a quest he can't name - a quest that slowly begins to undermine his certainties.",
         "Middle-aged Martin confused and irritated from the onset of mid-life crisis, has clung too stubbornly to his belief in platonic love and its incumbent celibacy. He inadvertently meets Cécilia who is rumored to have killed her last lover (a painter) with her voracious sexual appetite. Martin, a philosopher, questions everything he experiences; Cécilia, a seemingly indifferent older adolescent, questions nothing at all. Martin's crisis slowly and agonizingly crescendos, in the face of her confounding simplicity, during their brief and bizarre affair."
      ],
      "budget": 0
   },
   "movielensId": 2910,
   "movielens": {
      "languages": ["Français"],
      "releaseDate": "1998-11-14",
      "dvdReleaseDate": "2000-12-19",
      "directors": ["Cédric Kahn"],
      "runtime": 122,
      "movieId": 2910,
      "title": "L'ennui",
      "mpaa": null,
      "actors": [
         "Charles Berling",
         "Sophie Guillemin",
         "Arielle Dombasle",
         "Robert Kramer",
         "Alice Grey",
         "Maurice Antoni",
         "Tom Ouedraogo",
         "Patrick Arrachequesne"
      ],
      "imdbMovieId": "0168740",
      "originalTitle": "L'ennui",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "A philosophy teacher restless with the need to do something with his life meets a young woman suspected of driving an artist to his death. He finds the very simple Cecilia irritating but develops a sexual rapport with her. Obsessed with the need to own and tormented by her inability to respond to him, he becomes increasingly violent in a quest he can't name - a quest that slowly begins to undermine his certainties.",
      "tmdbMovieId": 55107,
      "avgRating": 2.84559,
      "releaseYear": "1998",
      "numRatings": 68,
      "posterPath": "/p5gAhWf1rZGJcMs4Kdu6FH9CcG5.jpg"
   }
}