{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "secret love",
            "id": 7879
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "stalking",
            "id": 10333
         }
      ],
      "imdb_id": "tt0165874",
      "video": false,
      "title": "The Mating Habits of the Earthbound Human",
      "recommendations": [
         195065,
         76438,
         49970,
         96314,
         68716,
         62721,
         71381,
         29361,
         55998,
         61016,
         21947,
         45830,
         16053,
         127608,
         176079,
         136568,
         50714,
         18631,
         554,
         65142
      ],
      "backdrop_path": "/txakB8hIrkxQCM0KZuFjNnR4evm.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Female",
               "gender": 1,
               "credit_id": "52fe470f9251416c7508c773",
               "name": "Carmen Electra",
               "profile_path": "/oFjqvsVleDaMtuJaLnSJdx7LUOg.jpg",
               "id": 28639,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "The Male",
               "gender": 2,
               "credit_id": "52fe470f9251416c7508c777",
               "name": "Mackenzie Astin",
               "profile_path": "/vmcRaz9K4cX4iOUcMSHsLcw0Two.jpg",
               "id": 60060,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "The Narrator",
               "gender": 2,
               "credit_id": "52fe470f9251416c7508c77b",
               "name": "David Hyde Pierce",
               "profile_path": "/96qVGJhtV6tQkXmJVmbi6BBk1Ll.jpg",
               "id": 11076,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lydia",
               "gender": 1,
               "credit_id": "52fe470f9251416c7508c785",
               "name": "Lucy Liu",
               "profile_path": "/9nbtjqsx3De7hO2XDtrBQ7M9VCH.jpg",
               "id": 140,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Jimmy",
               "gender": 2,
               "credit_id": "56aabf67c3a3681c3b000b5d",
               "name": "Markus Redmond",
               "profile_path": "/yxMbPCGa8rMSrquc8v4UN7QLlWX.jpg",
               "id": 1226835,
               "order": 4
            },
            {
               "cast_id": 12,
               "character": "Lana",
               "gender": 1,
               "credit_id": "56aabf7ec3a3681c5c000bac",
               "name": "Lisa Rotondi",
               "profile_path": "/jDVmNj6WdJN4yn3saxm9dxE35B8.jpg",
               "id": 86273,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Cliff",
               "gender": 2,
               "credit_id": "58655a069251412b8a01fcae",
               "name": "Marc Blucas",
               "profile_path": "/1pDk3uISYLyYOb8mHeyEbjqw7i.jpg",
               "id": 46772,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe470f9251416c7508c781",
               "name": "Jeff Abugov",
               "profile_path": null,
               "id": 81421,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5414e43e0e0a261983002e7c",
               "name": "Jeff Abugov",
               "profile_path": null,
               "id": 81421,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5414e4a5c3a3687db6002d52",
               "name": "Larry Estes",
               "profile_path": null,
               "id": 44026,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "5414e4c20e0a2619a4002df2",
               "name": "Victor Ho",
               "profile_path": null,
               "id": 1363720,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 0,
               "credit_id": "5414e4ef0e0a26198f002f43",
               "name": "Sam Irvin",
               "profile_path": null,
               "id": 1363721,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 0,
               "credit_id": "5414e4ffc3a3687dc1002d60",
               "name": "Michael McCarty",
               "profile_path": null,
               "id": 1201305,
               "department": "Sound",
               "job": "Music"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Science Fiction",
            "id": 878
         }
      ],
      "popularity": 1.60714,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 17198,
      "vote_count": 20,
      "budget": 0,
      "overview": "David Hyde Pierce, playing an alien (credited as infinity-cubed in the opening credits), narrates a courtship in a late-20th century American city as an extraterrestrial nature documentary. The relationship \"footage\" is played straight, while the voice-over (with its most often wildly inaccurate theories) and elaborate visual metaphors add comedy.",
      "similar": [
         8810,
         10017,
         948,
         3134,
         298312,
         185,
         431,
         4638,
         59967,
         170,
         281,
         11564,
         168098,
         2142,
         22825,
         141,
         10285,
         101,
         205,
         681
      ],
      "original_title": "The Mating Habits of the Earthbound Human",
      "runtime": 88,
      "poster_path": "/rk1720rbqtyLCF5vzorcNsmGxPX.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Earthbound Human Productions Inc.",
         "id": 3919,
         "origin_country": ""
      }],
      "release_date": "1999-09-03",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "A How-To-Do-It Guide.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jeff Abugov"],
      "runtime": 88,
      "synopsis": null,
      "writers": ["Jeff Abugov"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0165874/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTU4OTA3MDI3OV5BMl5BanBnXkFtZTcwMTU3NTUxMQ@@._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: David Hyde Pierce, Mackenzie Astin, Carmen Electra | See full cast and crew »"],
      "reviews": [
         "What an original concept! I am not aware of any other film in this style and if there were they would have to be something special. This film is positively brilliant. The basic concept of an alien perspective on human mating habits as being some primitive tribal act is ingenius - because it's true. Remove the elements of modern custom and an act which hasn't changed in over 50,000 years (I'm guessing this number) is all that remains. Simple. The true charm of this film is in the way the (alien) narrator interprets each phase of the mating ritual. The leads where interesting(rather impressed with Carmen for two reasons - the one just mentioned and the other, well, that's rather obvious) and the other supporting cast were right on the money. The only part of the film I couldn't determine relevance was the male lead driving past the running track and seeing the 'sperm men'. I have a few ideas on this one but none that really make much sense. Who cares. A top film nonetheless.",
         "I recently watched this film during the wee hours in the morning off TV and found it an excellent excuse not to go to bed. The film used the format of a '50s nature show to spoof the modern day relationship. It is not the most sophisticated film ever, but I think it makes its point. David Hyde Pierce is quite effective as the alien narrator, using his frank, matter-of-fact tone that is similar to that of his character on Frasier. The basic and almost elemental terms/phrases he uses to describe everyday items makes me think not only about what we, as humans, get wrong when we observe other animals, but also about the truly absurd things we do/own. It is true that the acting of those on-screen is not up to \"awards\" standards, Mackenzie Astin and Carmen Electra fill their stereotypical roles well. Don't go into watch this movie expecting everything, because you won't get it. But if you're looking for a little bit of fun to waste some time, give it a try. I give this film a rating of 3/5.",
         "I caught this movie late one night on cable and am so glad I did. It take an outside look on human relationships to show us just how odd we really are. I recommend this for anyone looking for an incredibly cute comedy. This film left me smiling.",
         "Bored, nothing to do, love a laugh, well this could be the perfect gap filler. Mating Habits of the Earthbound Human (MHOTEH) could have quickly degenerated into the usual 'tit flick', but thanks to some very clever writing & the superb narration of David Hyde-Pierce this movie is lifted above others of its genre. I won't spoil MHOTEH by commenting on various scenes, however, the birth scene is not to be missed. Reality TV, who needs it!. A word of warning though, there is some very strong language & some very visual sex scenes, so discretion is required for younger viewers.",
         "I caught this movie on cable one night after flipping through the channels. I caught the sight of a beautiful women.I did not even know it was Carmen Elecktra in the picture but she looked good. I then notice that David Hyde Pierce was narrating what was trying to be a national geographic special on human mating, from the perspective of outer space aliens.This clever premise plus Miss Elecktra's obvious attributes hooked me for the movie. This was not an especially good movie but it had some charm and the actors played their parts well. This was a pleasant surprise that if you see it on cable it can be diverting. Sure it was predictable and at times cliché ridden; even annoying but I watch to the end and enjoyed most of it. I especially liked the sperms on the track, the spermicide guy and the conception scene. Even though the movie made an attempt to make relationships seem complicated (which they are), the movie was not. Still worth a look, but don't inconvenience yourself.",
         "Other viewers have given the plot details of this mock documentary better than I could. Just want to add that the film is truly hilarious- even to a middle-aged viewer who never heard of Carmen Electra! I still laugh each time I remember lines like(describing films) \" The human female prefers stories about one person dying slowly. The human male prefers stories about many people dying quickly.\" Cheers to this highly original, very funny film!",
         "Some terrifically oddball comments from David Hyde Pierce as an alien commenting on the human mating ritual. Though the story is really follows all of the stereotypes about how people meet (and mate.) There's plenty of great humor, and a few really great laughs. And Carmen Electra... On top of being spectacularly beautiful, she's a decent actress. She first surprised me on the TV show \"Just Shoot Me\" with her great sense of timing and delivery. I'd love to see more of her in funny roles. This is a perfect party movie.",
         "This is a really funny movie and i'm sorry it didn't have the promoting campaign that other worse comedies have. I have seen it on HBO and liked it. Yes, it is stupid; yes, it is full of cliches; yes, it is predictable... but none of these things managed to erase the great fun in this film. A guy and a girl are observed by an alien scientist. All the stages of a relationship, from the meeting point until the first baby is conceived, through the eyes and with the comments of an extraterestrial. As if they were the humans and they were making a documentary for Discovery Channels, and we are just an inferior species. Fun is released from every line of the voice over. You will laugh a lot, and after all that's all that matters. Vote: 7 out of 10.",
         "I watched this at about 1:00 AM one morning. My channel surfing was naturally halted by Carmen dancing at a Disco. The surprising and amusing voice-over of many time Emmy winner, David Hyde Pierce, was also quite an attention getter. What followed was a pretty likeable, playful, and occasionally laugh out loud (sperm runners) spoof of the American dating moors. The male lead nicely portrayed an \"average guy\" in over his head with the stunning Carmen Electra. Her performance here was so easy and unforced, than, along with a couple of late night talk show appearance I've seen recently (namely Craig Kilborn), have really made me a big fan. Don't get the Dennis Rodman thing, but.....? The sex scenes, though tame, had a nice playful spirit, and except for a totally out of character, unnecessary tirade during the childbirth sequence, the movie could have been suitable, and probably appreciated, by a younger audience. Considering what must have been a fairly low-budget, a nice debut by the director. Give it a watch!!",
         "This came on HBO and I'll admit I spent the next five minutes looking for the remote control. (Yeah, that lazy.) But once I got into it, it was actually a really good movie! Apart from some scenes that made it look like a bad Woody Allen picture (okay, I find all of his films bad,) it was really funny. Carmen Electra surprised me -- she's a pretty good actress in this movie."
      ],
      "genres": [
         "Comedy",
         "Sci-Fi"
      ],
      "productionCompanies": [
         "Earthbound Human Productions Inc.",
         "SearchParty Films",
         "Welb Film Pursuits Ltd."
      ],
      "summaries": ["An anthropologist from an alien planet provides voice-over commentary for a documentary look at human courtship, mating, and reproduction: \"complex, perverse, tragically beautiful: the earthbound human.\" The commentary gets some of the details comically wrong (explaining the slap on a newborn's back: \"they don't like the looks of the child so they beat it\"), but gets right the overall idea. We follow Billy and Jenny from their meeting at a club, initial misunderstandings, his losing her phone number, finally connecting, walks on the beach, soulful talks, meeting each other's parents, friends' advice, and the gradual taking of the relationship to new levels."],
      "budget": 0
   },
   "movielensId": 2913,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-09-03",
      "dvdReleaseDate": "2003-01-07",
      "directors": ["Jeff Abugov"],
      "runtime": 88,
      "movieId": 2913,
      "title": "The Mating Habits of the Earthbound Human",
      "mpaa": "R",
      "actors": [
         "Carmen Electra",
         "Mackenzie Astin",
         "David Hyde Pierce",
         "Lucy Liu",
         "Markus Redmond",
         "Lisa Rotondi",
         "Marc Blucas"
      ],
      "imdbMovieId": "0165874",
      "originalTitle": "The Mating Habits of the Earthbound Human",
      "genres": [
         "Comedy",
         "Romance",
         "Science Fiction"
      ],
      "youtubeTrailerIds": ["9D4N4jrKnVM"],
      "plotSummary": "David Hyde Pierce, playing an alien (credited as infinity-cubed in the opening credits), narrates a courtship in a late-20th century American city as an extraterrestrial nature documentary. The relationship \"footage\" is played straight, while the voice-over (with its most often wildly inaccurate theories) and elaborate visual metaphors add comedy.",
      "tmdbMovieId": 17198,
      "avgRating": 3.21368,
      "releaseYear": "1999",
      "numRatings": 234,
      "posterPath": "/rk1720rbqtyLCF5vzorcNsmGxPX.jpg"
   }
}