{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0143746",
      "video": false,
      "title": "Molly",
      "recommendations": [
         302135,
         43079,
         86913,
         5248,
         31342,
         39424,
         24618
      ],
      "backdrop_path": "/iDcUeek1x5D9zJys8kV7n5fsjXE.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Molly McKay",
               "gender": 1,
               "credit_id": "52fe469fc3a36847f8109085",
               "name": "Elisabeth Shue",
               "profile_path": "/44AaIXkbZFkdhSW1kRdzCbfYk6c.jpg",
               "id": 1951,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Buck McKay",
               "gender": 2,
               "credit_id": "52fe469fc3a36847f8109089",
               "name": "Aaron Eckhart",
               "profile_path": "/aRSofX2rMpOhPanB9Wh7veYmFn4.jpg",
               "id": 6383,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Susan Brookes",
               "gender": 1,
               "credit_id": "52fe469fc3a36847f810908d",
               "name": "Jill Hennessy",
               "profile_path": "/maXA4XgLsHLFy2ww3UvI4jUK27z.jpg",
               "id": 50877,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Sam",
               "gender": 2,
               "credit_id": "52fe469fc3a36847f8109091",
               "name": "Thomas Jane",
               "profile_path": "/xAES23Ll0JT0lJADA1SIdTAN0bf.jpg",
               "id": 11155,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Mark Cottrell",
               "gender": 2,
               "credit_id": "52fe469fc3a36847f8109095",
               "name": "D.W. Moffett",
               "profile_path": "/l2IZeyX8WrG2SINrXaA1ibQfLLn.jpg",
               "id": 87956,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Beverly Trehare",
               "gender": 1,
               "credit_id": "52fe469fc3a36847f8109099",
               "name": "Elizabeth Mitchell",
               "profile_path": "/k7Mtxruey23xxZDBWmB7apEHKDy.jpg",
               "id": 31167,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Dr. Simmons",
               "gender": 2,
               "credit_id": "52fe469fc3a36847f810909d",
               "name": "Robert Harper",
               "profile_path": null,
               "id": 41739,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "Jennifer Thomas",
               "gender": 0,
               "credit_id": "58b797eb925141276c000aec",
               "name": "Elaine Hendrix",
               "profile_path": "/2usTUKG0PhNg6YUviYiESKjGvOb.jpg",
               "id": 55422,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "Domingo",
               "gender": 2,
               "credit_id": "58b797f5c3a368352e000ae0",
               "name": "Michael Paul Chan",
               "profile_path": "/c9HqJlG7nuutKW5aYq8ODctCT1w.jpg",
               "id": 17355,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "Brenda",
               "gender": 1,
               "credit_id": "58b797fe9251412736000abc",
               "name": "Lucy Liu",
               "profile_path": "/9nbtjqsx3De7hO2XDtrBQ7M9VCH.jpg",
               "id": 140,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "Gary McKay",
               "gender": 2,
               "credit_id": "58b79809925141272a000aeb",
               "name": "Jon Pennell",
               "profile_path": null,
               "id": 82719,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "Julie McKay",
               "gender": 1,
               "credit_id": "58b79815925141272a000af2",
               "name": "Sarah Wynter",
               "profile_path": "/5eRmuhTtlhJBOmOl5Cam2eBcAHW.jpg",
               "id": 41819,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "Dr. Prentice",
               "gender": 2,
               "credit_id": "58b79823925141273a000bdf",
               "name": "Nicholas Pryor",
               "profile_path": "/jqJVM5jEVq2Xqi8G5fO0iiEnd5O.jpg",
               "id": 13028,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "Jack the Bartender",
               "gender": 0,
               "credit_id": "58b7982e925141272e000ab6",
               "name": "Jay Acovone",
               "profile_path": "/7nTfBxzeO6jBzUSdukF2OWm5uBo.jpg",
               "id": 42547,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Maxine",
               "gender": 1,
               "credit_id": "58b7983b925141272a000b0a",
               "name": "Musetta Vander",
               "profile_path": "/HcCn2iICHNyp2PmEXN72gSuRp9.jpg",
               "id": 1475,
               "order": 14
            },
            {
               "cast_id": 20,
               "character": "Lauris",
               "gender": 1,
               "credit_id": "58b79846925141276c000b30",
               "name": "Athena Massey",
               "profile_path": "/jgQBiApA51pDnUbJAa3gpKsg2dG.jpg",
               "id": 42687,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe469fc3a36847f81090a3",
               "name": "John Duigan",
               "profile_path": "/bLrx4OQz5g1RnlLQc9ungQ4XKqR.jpg",
               "id": 72624,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe469fc3a36847f81090a9",
               "name": "William J. MacDonald",
               "profile_path": null,
               "id": 61820,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe469fc3a36847f81090af",
               "name": "Gabriel Beristain",
               "profile_path": "/zpy2AF6fmOFgZTKcLV1Wa3raQ9N.jpg",
               "id": 10832,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe469fc3a36847f81090b5",
               "name": "Dick Christie",
               "profile_path": null,
               "id": 169410,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 3.013349,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 44857,
      "vote_count": 17,
      "budget": 0,
      "overview": "Molly McKay is a profoundly autistic twenty-something woman who has lived in an institution from a young age following her parents' death in a car accident. When the institution must close due budget cuts, Molly is left in the charge of her neurotypical, older brother, Buck McKay, an advertising executive and perennial bachelor. Buck allows her to undergo an experimental medical treatment, with unexpectedly drastic results.",
      "similar": [],
      "original_title": "Molly",
      "runtime": 102,
      "poster_path": "/4MAsTnS5CeD2Kv6qQffsjiHsZhi.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Absolute Entertainment (II)",
            "id": 67883,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Cockamamie",
            "id": 67884,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Heckerling-Caplan",
            "id": 67885,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1999-10-22",
      "vote_average": 5.4,
      "belongs_to_collection": null,
      "tagline": "Innocence is bliss. See the world through her.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Duigan"],
      "runtime": 102,
      "synopsis": null,
      "writers": ["Dick Christie"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0143746/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY0MTUxMjUwNl5BMl5BanBnXkFtZTcwNDczNzA2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Elisabeth Shue, Aaron Eckhart, Jill Hennessy | See full cast and crew »"],
      "reviews": [
         "This is a touching, bittersweet and wonderful film about an autistic woman who gains full use of her cognitive reasoning through an experimental procedure. Molly (Elizabeth Shue) is a 28 year old autistic who has been institutionalized much of her life. When the institution closes, she is left in the care of her self absorbed brother Buck (Aaron Eckhart). She is recommended for a new experimental procedure which transforms her into a normal young woman. As the story unfolds we see her grow from a child into a woman with many sweet and funny moments resulting from Molly's view of the world through childlike eyes. As her relationship with her brother grows, his transformation is as dramatic as hers. The film was charmingly done with a coming of age quality about it. There were numerous comical and heart warming moments resulting from Molly's misperception of a world she is trying to make sense of. The only thing working against this film is the fact that this ground has been retraced in so many ways that it suffers from the tendency to compare it to other films. It has elements of \u0091Flowers for Algernon', \u0091Rainman', \u0091At First Sight' and \u0091Awakenings'. It is difficult for a film to be fully appreciated when the viewer is mentally comparing it to all these other stories. That is a pity in this case because this really is a lovable story in its own right. Elizabeth Shue gives us marvelous performance as Molly. Her portrayal of autism is realistic and endearing. She is so childlike that you really sense that she has the mind of a 3 year old. Later, as she transitions to the mind of an adult, she retains that childlike naiveté that gives the character a purity and wisdom that is fresh and free from cynicism. It was a wonderful performance that regrettably will not be seen by many since this film lives in obscurity as a single facing on the rental shelves. I rated Molly an 8/10. On an emotional level, I really enjoyed it more than that, but I felt compelled to subtract a couple of points for lack of originality. However, if you enjoy human interest stories this one will certainly touch your heart.",
         "Molly McKay (Elizabeth Shue, very wonderful) has been living in a nursing home for years, after her parents' deaths. She has severe autism and generally answers every question with the word \"no\". One senses, however, that locked inside her being is a woman as bright as she is beautiful. Her older brother, Buck (Aaron Eckhart) has only visited her on rare occasions, as he was going through college and starting his career in advertising. Word comes, however, that the nursing home is closing and that Buck will have to make new arrangements for Molly. Very apprehensive, Buck brings Molly back to his Venice, California apartment, where the chaos soon begins. When a daycare situation goes sour, Buck has to bring Molly to work, where her erratic behavior soon causes the firm to lose a major account. Buck is promptly fired, causing resentment between the siblings. However, a clinic worker, Sam (Thomas Jane) has been a friend to Molly for years and he encourages Buck to be patient and caring. Also, a doctor at the clinic (Jill Hennessey) convinces Buck to let them try a new surgical technique on Molly, one that will allow her to lead a more normal life. Amazingly, after the procedure, Molly does become more verbal and starts to catch up on some of life's moments that have eluded her. But, can it last? This is a very nice film about an important topic, autism. However, instead of focusing on children, this one shines a light on the experiences of an adult with the condition. As such, Shue is wonderful as the brave and bright Molly while Eckhart is equally fine as her confused but goodhearted brother. One must also congratulate Hennessey and especially Jane for giving great turns as well. The setting in Venice is beautiful and the other cinema niceties, such as costumes and photography, are more than adequate. The script is both lightly humorous and tear generating, at the same time, and gives the audience a good look at the autistic individual, trapped inside his or her own body. Even so, one suspects that the film, made in 1999, might be a bit dated as to current discoveries and treatments. But, that matters little, indeed, to the overall enjoyment of the flick. If you are a fan of sweet, thought-provoking stories, told with care and humor, you should make time for Molly. Good golly, you will be entertained and enlightened at the same wonderful time.",
         "A lightweight film, but engaging. I think that the actors did their jobs well, given the flimsiness of the script. I don't regret the time that I spent watching it. It is, however, a knockoff - virtually a remake. I see that I'm far from the only one who recognized \"Charly\" / \"Flowers for Algernon\" in this. I wonder how they got away with it, presuming that it was presented as original work. Those who complain about credibility ought to know that the original story by Daniel Keyes was presented and published as science fiction. And of course, in 1959, far less was known about the mentally challenged. The biggest credibility problem I had was the depiction of Venice with clean streets, nobody passed out on the sidewalk, and windows without bars. Then again, it's a MOVIE. Either an editor or the script girl (excuse me, continuity director) was a little careless here and there, but to be more specific would make this a spoiler. I found it amusing that the more sophisticated (and sexually aware) that Molly became, the more prominently her breasts were shown.",
         "The story may not be original, but it was Elisabeth Shue's performance that captivated me. I am surprised she didn't get more acclaim. Molly is such a difficult character to play and Elisabeth's acting was supurb and incredibly believable. I was just made an even bigger fan of her work.",
         "Loosely cribbed from Daniel Keyes' novel \"Flowers for Algernon\" this moist tale follows experimental surgery subject, Molly who overcomes autism only to regress as the procedure's effects fade. We're supposed to realize that, the mentally disabled are people to - and have something to teach us. But this ham fisted tale ends up communicating a less profound message more along the lines of - some of them like to obsessively line up shoes.",
         "I recently rented Molly and i loved it. Mainly because of Jill Hennessy but also because of the character Molly. After about 30min thru the movie you start to think about how it will feel like being autistic then Molly eventually tells how it feels. The movie is funny, dramatic, interesting and a very beautiful movie. The only thing that i did not like about the movie is the ending.",
         "This movie is about a woman with autism who leaves her group home to live with her brother (sort of like Rainman) and then has surgery which takes her from having the mindset of a 3 year old to that of a genius. For as much as this movie was a remake of flowers for Algernon... it was an awful disappointment. If they wished to make a movie parallel to that, they could have just had someone with mental retardation or borderline MR. Instead, they chose a woman with autism and, in the process, stereotyped everything about autism and degraded those who have autism and those who love them. ALl in all, the movie was crappy and a total waste of time.",
         "\"Molly\" is a movie of epic inspiration. I was so amazed by the story it presented to the viewers. It not only has star power of Elisabeth Shue and Aaron Eckhart, but it also had a great supporting cast in Thomas Jane and Jill Hennessey. One of the best things about \"Molly\" was the intelligent dialogue between everyone. This is a movie that delivers the message that it doesn't matter who the person is or what is wrong with them, they are still a human being and are deserving of respect and love. I can relate with the title character and was glad to see that somebody made a film of this nature and succeeded in making the point in which it was trying to send viewers. I was impressed with this flawless film from start to finish. Not only is \"Molly\" one of the most moving films I've seen but it will literally bring tears to viewers eyes because it is that special. I highly recommend this film. Viewers will not be disappointed by this film since it is that good.",
         "This movie is definitely one of the best movies i've ever seen. Elizabeth Shue was casted perfectly and i can't imagine any one else playing the lead. Another character casted brilliantly was Aaron Eckhart who played Molly's older brother. Molly McKay(Shue) is autistic. She is a 28 year old woman with the mind of a three year old. When the center she is in closes down because its gone broke, she is then put in the care of her older brother Buck(Eckhart). She is then chosen to get an operation by some doctors who think that molly's case is fascinating. Some other familiar faces include Thomas Jane(who plays one of molly's good friend Sam) Jill Hennessy (who plays molly's doctor and brothers girlfriend Susan) and Lucy Lui(who plays Bucks secretary and one of molly's baby sitters) I gave this movie ten out of ten because if mad me laugh,cry, and was romantic. many movies lack those qualities so i advise that you definitely watch this.",
         "This movie is just plain daft; a patchy mix of \"heartwarming\" (i.e. cloyingly sentimental) bonding scenes between cured autistic woman Shue and her initially selfish brother Eckhart, poor editing that seems to dispense with whole chunks of plot (after hastily explained and supremely daft 'ground-breaking' neurosurgery, Shue's regression, once it finally begins, is complete within a couple of scenes), and stultifying cliches. Failing completely to engender any emotional involvement in Molly's predicament, which could have been heartbreaking if skilfully handled, the movie shamelessly strives to manipulate the viewer in almost every scene and quickly outstays it's welcome. Shue's performance is ok, and Eckhart offers solid support, but they're both let down by the material, and before the movie is half over you'll be wondering why they ever made the wretched thing in the first place."
      ],
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "productionCompanies": [
         "Absolute Entertainment (II)",
         "Cockamamie",
         "Heckerling-Caplan"
      ],
      "summaries": [
         "Molly McKay is a profoundly autistic twenty-something woman who has lived in an institution from a young age following her parents' death in a car accident. When the institution must close due to budget cuts, Molly is left in the charge of her neurotypical, older brother, Buck McKay, an advertising executive and perennial bachelor. Molly, who verbalizes very little and is obsessed with lining up her shoes in neat rows, throws Buck's life into a tailspin as she runs off her nurses and barges naked into a meeting at Buck's agency. When Buck consults Molly's (beautiful) neurologist, Susan Brookes, Dr. Brookes suggests an experimental surgery in which healthy brain cells are harvested from a donor and implanted into Molly's brain. While Buck initially balks at the suggestion, he finally consents to the surgery and Molly makes a miraculous \"recovery\" from her autism when she begins to speak fluidly and to interact with her brother, caretakers, and the world, in general. Buck begins taking Molly to social events, like a production of Romeo and Juliet, a baseball game, and expensive dinners. However, after a few months, Molly's brain begins to reject the transplanted cells and she begins to \"digress\" into her former, autistic state. Both Molly and Buck must accept the eventual loss of Molly's \"cure\" and her regression to her previous autistic state. While Buck initially rejects Molly and sends her to another institution, in the final scene of the film, Buck accepts Molly's autism and vows to remain in Molly's life by visiting her at the institution.",
         "A bachelor becomes the unwilling guardian of his autistic, intellectually disabled sister; then an experimental treatment works a dramatic change in her brain and his attitude."
      ],
      "budget": 21000000
   },
   "movielensId": 2914,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-10-22",
      "dvdReleaseDate": "2000-04-25",
      "directors": ["John Duigan"],
      "runtime": 102,
      "movieId": 2914,
      "title": "Molly",
      "mpaa": "PG-13",
      "actors": [
         "Elisabeth Shue",
         "Aaron Eckhart",
         "Jill Hennessy",
         "Thomas Jane",
         "D.W. Moffett",
         "Elizabeth Mitchell",
         "Robert Harper",
         "Elaine Hendrix",
         "Michael Paul Chan",
         "Lucy Liu",
         "Jon Pennell",
         "Sarah Wynter",
         "Nicholas Pryor",
         "Jay Acovone",
         "Musetta Vander",
         "Athena Massey"
      ],
      "imdbMovieId": "0143746",
      "originalTitle": "Molly",
      "genres": [
         "Drama",
         "Comedy",
         "Romance"
      ],
      "youtubeTrailerIds": ["kpAKXwMKVgM"],
      "plotSummary": "Molly McKay is a profoundly autistic twenty-something woman who has lived in an institution from a young age following her parents' death in a car accident. When the institution must close due budget cuts, Molly is left in the charge of her neurotypical, older brother, Buck McKay, an advertising executive and perennial bachelor. Buck allows her to undergo an experimental medical treatment, with unexpectedly drastic results.",
      "tmdbMovieId": 44857,
      "avgRating": 2.33333,
      "releaseYear": "1999",
      "numRatings": 144,
      "posterPath": "/4MAsTnS5CeD2Kv6qQffsjiHsZhi.jpg"
   }
}