{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "civil war",
            "id": 393
         },
         {
            "name": "dwarf",
            "id": 604
         },
         {
            "name": "journalism",
            "id": 917
         },
         {
            "name": "embassy",
            "id": 4123
         },
         {
            "name": "photography",
            "id": 6025
         },
         {
            "name": "indonesia",
            "id": 7348
         },
         {
            "name": "falling in love",
            "id": 13072
         },
         {
            "name": "java",
            "id": 208188
         },
         {
            "name": "1960s",
            "id": 208992
         },
         {
            "name": "jakarta",
            "id": 226610
         }
      ],
      "imdb_id": "tt0086617",
      "video": false,
      "title": "The Year of Living Dangerously",
      "recommendations": [
         19429,
         2075,
         12503,
         11646,
         988,
         16241,
         31583,
         18254,
         18988,
         13776,
         24276,
         25431,
         23518,
         15794,
         31587,
         1058,
         15927,
         5769,
         10170,
         32636
      ],
      "backdrop_path": "/qkeW5XidmGVEQ4VxbGciAl9GzOf.jpg",
      "revenue": 1317657,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Guy Hamilton",
               "gender": 2,
               "credit_id": "52fe44559251416c750310f3",
               "name": "Mel Gibson",
               "profile_path": "/4IsmIFUgoJgUZjen8Ldxnw5YQvG.jpg",
               "id": 2461,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Jill Bryant",
               "gender": 1,
               "credit_id": "52fe44559251416c750310f7",
               "name": "Sigourney Weaver",
               "profile_path": "/gxBIAr3CnBjkNRoPovVJCvEGqP0.jpg",
               "id": 10205,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Billy Kwan",
               "gender": 1,
               "credit_id": "52fe44559251416c750310fb",
               "name": "Linda Hunt",
               "profile_path": "/cytXcZdHAmPJFBGnhwhg0CT40C4.jpg",
               "id": 12516,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Pete Curtis",
               "gender": 2,
               "credit_id": "52fe44559251416c750310ff",
               "name": "Michael Murphy",
               "profile_path": "/ebbKhFgIHugUywSL5udMFNfRxvQ.jpg",
               "id": 4776,
               "order": 3
            },
            {
               "cast_id": 15,
               "character": "Colonel Henderson",
               "gender": 2,
               "credit_id": "558601929251411dec000875",
               "name": "Bill Kerr",
               "profile_path": "/fuo1HA99H92BxZZ245ywIlWExHe.jpg",
               "id": 70753,
               "order": 4
            },
            {
               "cast_id": 16,
               "character": "Wally O'Sullivan",
               "gender": 0,
               "credit_id": "5586019dc3a3682746001c5f",
               "name": "Noel Ferrier",
               "profile_path": "/gqJPlIS2UNhESFh29jXlbgyuBEr.jpg",
               "id": 110010,
               "order": 5
            },
            {
               "cast_id": 17,
               "character": "Kumar",
               "gender": 2,
               "credit_id": "558601a792514137bc001b19",
               "name": "Bembol Roco",
               "profile_path": "/fNhpqvLAmsz4zrBd2eNVId7VAar.jpg",
               "id": 1019408,
               "order": 6
            },
            {
               "cast_id": 18,
               "character": "Kevin Condon",
               "gender": 2,
               "credit_id": "558601b392514137bc001b1d",
               "name": "Paul Sonkkila",
               "profile_path": null,
               "id": 80267,
               "order": 7
            },
            {
               "cast_id": 19,
               "character": "Hartono",
               "gender": 0,
               "credit_id": "558601eb92514137c1001b8c",
               "name": "Domingo Landicho",
               "profile_path": null,
               "id": 1275055,
               "order": 8
            },
            {
               "cast_id": 20,
               "character": "Tiger Lily",
               "gender": 0,
               "credit_id": "558601fc92514137bc001b3a",
               "name": "Kuh Ledesma",
               "profile_path": null,
               "id": 1237958,
               "order": 9
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44559251416c75031105",
               "name": "Peter Weir",
               "profile_path": "/bQzmyhBOqCSrnSmCaRmi2T2b4Zf.jpg",
               "id": 2690,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44559251416c7503110b",
               "name": "Peter Weir",
               "profile_path": "/bQzmyhBOqCSrnSmCaRmi2T2b4Zf.jpg",
               "id": 2690,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "52fe44559251416c75031111",
               "name": "C.J. Koch",
               "profile_path": null,
               "id": 69789,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44559251416c75031117",
               "name": "David Williamson",
               "profile_path": null,
               "id": 28954,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe44559251416c7503111d",
               "name": "Jim McElroy",
               "profile_path": null,
               "id": 67824,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44559251416c75031123",
               "name": "Maurice Jarre",
               "profile_path": "/yJDDi7RKlxHjb7g8NZTEhnS4drG.jpg",
               "id": 2704,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44559251416c75031129",
               "name": "Russell Boyd",
               "profile_path": null,
               "id": 31027,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe44559251416c7503112f",
               "name": "William M. Anderson",
               "profile_path": null,
               "id": 2705,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe44559251416c75031135",
               "name": "C.J. Koch",
               "profile_path": null,
               "id": 69789,
               "department": "Writing",
               "job": "Novel"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "War",
            "id": 10752
         }
      ],
      "popularity": 8.043264,
      "production_countries": [
         {
            "iso_3166_1": "AU",
            "name": "Australia"
         },
         {
            "iso_3166_1": "US",
            "name": "United States of America"
         }
      ],
      "id": 11541,
      "vote_count": 108,
      "budget": 6000000,
      "overview": "Australian journalist Guy Hamilton travels to Indonesia to cover civil strife in 1965. There, on the eve of an attempted coup, he befriends a Chinese Australian photographer with a deep connection to and vast knowledge of the Indonesian people and also falls in love with a British national.",
      "similar": [
         804,
         1949,
         2288,
         625,
         5353,
         396633,
         45046,
         344508,
         300196,
         323924,
         300194,
         300192,
         452518,
         300190,
         344507,
         344509,
         344511,
         344510,
         323923
      ],
      "original_title": "The Year of Living Dangerously",
      "runtime": 115,
      "poster_path": "/3fBuFmNLTDKuL3QOlgeIvLdekJn.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "McElroy & McElroy",
            "id": 8808,
            "origin_country": ""
         },
         {
            "logo_path": "/zcxym93i5BTqqjhVvAhV5HPwYTR.png",
            "name": "Metro-Goldwyn-Mayer",
            "id": 21,
            "origin_country": "US"
         }
      ],
      "release_date": "1982-12-17",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "A love caught in the fire of revolution.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Australia",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Peter Weir"],
      "runtime": 115,
      "synopsis": "A rookie Australian journalist, covering the Indonesian civil war of 1965, must choose between romance and the story that will make his career.",
      "writers": [
         "C.J. Koch",
         "C.J. Koch"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0086617/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM0NzUxMzU5MV5BMl5BanBnXkFtZTcwNjU4NzcyMQ@@._V1_SY317_CR3,0,214,317_AL_.jpg",
      "actors": ["Stars: Mel Gibson, Sigourney Weaver, Linda Hunt | See full cast and crew »"],
      "reviews": [
         "I am a little amazed that, so far, only 40 comments have been entered. Fortunately most are of high quality, and all the important points related to the film are clearly highlighted. So, I will not repeat what has been well said by others. I want to explain one additional point, it has to do with my personal experience but might be interesting to mention. I'm a professional expatriate, living overseas for 25 years. I'm not talking about an American in Paris or an Englishman in New York, I mean African steppes, tropical jungles, Indian slums. Living in a totally foreign country, in a totally strange culture, imperfectly understanding the local language, bewildered by alien logic, you experience a permanent sense of unease. You adapt, you learn to cope, you make what you hope are friends. But you never forget that you are a stranger in unknown territory, and that you are vulnerable. You may peacefully walk on the street one minute, the next minute bullets are flying all around you. In the evening you have a pleasant drink with your neighbour, in the morning you are arrested, accused of being a foreign mercenary. When you travel inland you come at a road block, not knowing if they'll let you pass, or harass you for a couple of hours, or confiscate your car. As a foreigner in developing countries, you are constantly confronted with uncertainty, an intangible menace lurking around the corner. I find that TYOLD transmits this sense of menace very poignantly. Many people have commented on its brilliant sense of place, the accurate depiction of Indonesia and the events that took place at the time. Others mention that you get a very real feeling of the tension and uncertainty journalists in times of upheaval are subjected to. But I would like to extend it beyond journalists. The sense of menace in TYOLD is eminently recognizable by all who have lived in countries where the police is not there to protect you, the laws are not there to make society more civilized, the hospitals are not there to cure you. In TYOLD, the menace is made visible because of the troubles that erupt, but usually you do not have to live through civil war when overseas. Still, the menace is not less real, and the sense of foreboding haunting every expatriate was very convincingly conveyed in the film.",
         "I watched TYLD after a prof recommended it in grad school. I had to rent it from an obscure-movies rental place in Alexandria, Virginia and I now own the picture. There are three elements, mixed together, that make TYLD superb, rich cinema. First, it captures the feel of westerners living abroad, the cluster of expat personalities that you find were you to live or work abroad. Second, it is one of the best love stories ever crafted, with a \"fleeting end of summer feel\" between Mel Gibson and Sigourney Weaver. They are both young; Weaver is stunningly gorgeous. Their romance ends almost as abruptly as it begins. We've all been there. The movie also captures an awesome historical moment and is fascinating Cold War history. The movie is flawless.",
         "15 years after its release, I finally get to see what to my knowledge is the only english-speaking film that tells the story of Indonesia circa the 1965 revolution. A very young Gibson is convincing as the inexperienced but ambitious reported determined to make his mark in telling the story of Sukarno's last moments in power. Equally brilliant is Sigourney Weaver, and yet one feels that this film did not give her the opportunity to show her true calibre. The one who ultimately steals the show, then, is Linda Hunt, playing the enigmatic and passionate Billy, who understands the true psyche of Indonesia better than any of the other foreign characters in this story. When Billy solemnly expresses his disappointment to Guy, proclaiming, \"I created you\", it evoked images of Weir's latest masterpiece, The Truman Show, where Christof has fashioned the persona of Truman Burbank for his TV spectacle. Perhaps a running theme in Peter Weir's work? Must check out... I marvelled at the authenticity of the setting. It certainly looked like Jakarta. The faces, the atmosphere, the buildings, and yet, those scenes were shot in the Philippines, with mainly Filipino actors! Just goes to show the similarity among Indonesia and the Philippines. I see now why this film was never made available in Indonesia (to my knowledge). The last few moments of the film show the stark reality of communist executions by Soeharto's new military regime, horrifying pictures of mere pawns being slaughtered... and the parting message from a self-confessed PKI member:\"Am I stupid for wanting to change my country's condition?\" is one of the best lines in this film.",
         "The film is wonderfully sensate, alive and filled with exotic beauty and deep passions. The colors, textures and sound have a dimensionality that draws the viewer right into the scene, the place the time... when it rains, the viewer can feel the rain, when the hero, Guy is being drowned in a dream, the viewer senses the suffocation... The chemistry between Mel Gibson and Sigourney Weaver, as young lovers in exciting times, is breath-taking! But Linda Hunt is the biggest gem in the movie, playing a little man named Billy Kwan. She is incredibly credible in this role. Few female actresses can believably pull-off playing a male character, but Hunt did it so well that, at first, the viewer feels a familiarity with the person playing Billy without realizing he is being played by a woman. When I realized it, I was totally amazed. Hunt is a great actress well-deserving of the Oscar she won for the portrayal. The film is evocative and enthralling. And so alive, so utterly alive! _The Year of Living Dangerously_ has and is everything a film should be.",
         "In \"The Year of Living Dangerously\" director Peter Weir attempts much and accomplishes most of his goals. It's a socio-political essay on the dangers of Western meddling in Third World countries. It's a fascinating view into the challenges of journalism in a volatile foreign country. It's a steamy romance involving two beautiful, intelligent characters. It's a distinctly Far Eastern morality play that seems to delight in yin/yang paradoxes. Plus it's one of the best films at evoking the mood, texture, and sensuality of life in Southeast Asia. Don't be too harsh on Weir for the lapses in historic accuracy and plotting, because it's a complicated, busy landscape he is painting here. The best things about the film are: -Linda Hunt's amazing performance. Unlike other gender-bending performances (Julie Andrews in \"Victor/Victoria\", Dustin Hoffman in \"Tootsie\") you never once give any thought to the fact that this is a woman playing a man. It's a seamless transition and a performance of immense heart and honesty. The image of a distraught Billy pounding at his typewriter, pleading \"What then must we do?\" while an aria swells around him and the eyes of Jakarta's poor stare at him from his own photographs, is an incredibly moving scene. -The atmosphere created by the combination of Russell Boyd's cinematography and Maurice Jarre's score. Take a look at the scene with Weaver walking through the streets of Jakarta in a tropical downpour. The effect is breathtaking. -The chemistry between Gibson and Weaver. You can feel the heat between them. Unlike other posters here, I believe their romance is one of the film's strong points. I agree that the ending is a bit of a letdown, but it doesn't diminish Weir's accomplishments. \"The Year of Living Dangerously\" is a startling unique film, and certainly one his best.",
         "Peter Weir's movie, set in Sukarno's Indonesia in 1965, can be seen as four films in one. The first is socio-political, focusing on the plight of the impoverished Indonesian people, the impending insurrection by the communist movement, and the bloody, chaotic aftermath of the coup. The second, coloured in Graham Greene-ish tones, has a cast of western journalists and diplomats failing to make sense of what's happening around them, and falling back on sex, drink and cynicism. The third - and most important in commercial-cinema terms - is a convincingly acted romance between rookie foreign correspondent Guy Hamilton (Mel Gibson) and British diplomat Jill Bryant (Sigourney Weaver), culminating in an unlikely and sentimental ending to the film. But it is the fourth of these \"sub-movies\" which is the most intriguing; this concerns the diminutive and enigmatic Australian/Chinese photographer Billy Kwan, an astonishing - and Oscar winning - portrayal by actress Linda Hunt. Billy sees himself as a puppet-master, pulling the strings of friends and colleagues, particularly of Jill and Guy, whom he throws together. But his need to take control also motivates him to help local people, not through indirect and political means, but directly like an early Christian, and this apparently benign course leads to tragedy. Billy is the true heart and conscience of this film. Weir is not entirely successful in weaving these strands together, and leaves a few gaps in both plot and characterisation. He is also occasionally guilty of melodrama (a fault which, in the movie, Jill warns Guy about), especially in the film's closing scenes - though certainly not where he shows communist sympathisers being shot, which is factual. On the whole, however, the movie works on both commercial and artistic levels, and should be seen.",
         "How anyone could have seen this movie and not recognized the depth of its social commentary and personal integrity is beyond me. This movie is written with power and intelligence, is performed impeccably and directed with cinematic genius. If you have not seen this movie, take time out to be touched in your head and heart.",
         "I just caught TYOLD again on PBS, not having seen it for perhaps ten years. Wonder of wonders, compared to many other films of the early '80s, this one is just as riveting as it was when I first saw it and doesn't look like it has aged a minute. In addition I am picking up many nuances of the film that I had never seen before. What I know, and knew, about the tribulations of Indonesia in the 1960's is contained in the reels of this film. The subject matter is so far outside of the typical Western/American perspective that it is amazing that the film got made. Gibson is very good as Guy Hamilton, and his performance is much more lean and energetic than what he has done since - he hadn't had years of Hollywood gloss and Lethal Weapon familiarity to file down his performances into the predictable boxes they have become. Sigourney Weaver is elegant, although her English accent is never really convincing and sometimes disappears altogether. Linda Hunt's portrayal of Billy Kwan is astonishing and won her a well-deserved Oscar in an incredible gender-switching performance that was inspired casting. One thing I never noticed before was how Billy placed each of the three main characters in their perspective as the Indonesian puppets he explains to Guy. Arjuna, the hero who can be fickle and selfish (Guy). The princess he will fall in love with (Weaver's character). And the dwarf, who carries the wisdom for Arjuna (Billy Kwan). I haven't much more to say about this film aside from how much I admire it and recommend it to anyone who hasn't seen it. Beautifully shot, well paced, with good performances and about an interesting and important subject matter, it is well worth your time.",
         "This excellent movie is set in 1965 Indonesia, when an Australian reporter named Gay Hamilton is assigned on his first work as a foreign journalist. His apparently simple mission to Yakarta soon turns hot when he interviews a rebel leader , while President Sukarno was toppling by pressure left from communists and right from military. Guy soon is the hottest reporter with the help of his photographer, a native, half- Chinese midget named Kwan . Eventually Hamilton must confront moral conflicts and the relationship between Billy and him reaches some problems connected with a British diplomatic attaché , at the same time the political upheaval takes place in coup détat. Mel Gibson is good as correspondent covering a conflict and finding himself becoming personally involved when he befriends a free-lance photographer named Billy Kwan and falling for a beautiful Embassy assistant, a mesmerizing Sigourney Weaver .The movie has its touching moments found primarily in the superb supporting performances as Michael Murphy as lively journalist , Bill Kerr as veteran Colonel and of course diminutive Linda Hunt who steals the show as sensible photographer in her Academy Award-winning character, a woman acting a man, and well deservedly prized. Moving and intimate musical score though composed by synthesizer by Maurice Jarre. Atmospheric cinematography that adequate as a mood-piece by Russell Boyd. The motion picture is stunningly directed by Australian director Peter Weir who achieved several hits (Witness, Gallipoli, The last wave) and some flop (Mosquito coast, The plumber). The movie belongs to sub-genre that abounded in the 80s about reporters around the world covering dangerous political conflicts , such as Nicaragua in ¨Under fire¨ by Robert Spottswoode with Nick Nolte , Gene Hackman and Joanna Cassidy, Salvador in ¨Salvador¨ by Oliver Stone with James Woods and James Belushi, and Libano in ¨Deadline¨ by Nathaliel Gutman with Christopher Walken and Hywel Bennett. These movies are very much in the vein of ¨The year of living dangerously ¨.",
         "Ever since I first saw this film, it has been one of my favorite. The performances are not perfect, but the chemistry between the main characters is electric. The semi-fictitious plot (it is said to be somewhat based on a period of the life of reporter Peter Arnet) melds so nicely with the historical events of 1960's Indonesia. Linda Hunt well deserved the Academy Award, but I felt that it should have also been nominated for Best Adapted Screenplay, Director, Film, and Cinematography. The story follows the novel of which it was based better than 95% of the time. The Atmosphere of the film always leaves me awe-struck. By the end I feel like I have lived Guy's life. It is a romantic film with a small dose of action that both men and women should enjoy."
      ],
      "genres": [
         "Drama",
         "Romance",
         "War"
      ],
      "productionCompanies": [
         "McElroy & McElroy",
         "Metro-Goldwyn-Mayer (MGM)"
      ],
      "summaries": [
         "Guy Hamilton is a journalist on his first job as a foreign correspondent. His apparently humdrum assignment to Indonesia soon turns hot as President Sukarno electrifies the populace and frightens foreign powers. Guy soon is the hottest reporter on the story with the help of his photographer, half- Chinese dwarf Billy Kwan, who has gone native. Guy's affair with diplomat Jill Bryant also helps. Eventually Guy must face some major moral choices and the relationship between Billy and him reaches a crisis at the same time the politics of Indonesia does.",
         "1965. Guy Hamilton with the Australian Broadcasting Service (ABS) has been appointed to his first ever foreign posting, which he has been working toward for ten years. It is in Jakarta, Indonesia, covering the volatile political situation of the country under President Sukarno, who of late has been providing support to the unelected Communist Party (PKI). Among the foreign correspondents who have an uneasy alliance with each other, Guy is the neophyte, who doesn't have a full comprehension of what is required to do the job well, especially since his predecessor did not stay to provide him with a primer of the job. He is, however, taken under the wing of dwarf Billy Kwan, a Chinese-Australian photojournalist, who sees something special in Guy, despite Guy being a little rough around the edges. Billy, who is a strong supporter of Sukarno's, provides Guy with what he finds is remarkable access to political stories. Billy also introduces Guy to Jill Bryant, a British Embassy staffer who Billy has always loved himself. Jill is soon scheduled to leave Jakarta and return to London. Nonetheless, Guy and Jill fall in love. A situation in Billy's private life leads to a radical change in his perspective. And Guy comes into some sensitive information, which if he decides to use it, could be the biggest break in his thus far short journalistic career, but could in turn put his life and the lives of those around him, especially Jill, in great danger.",
         "A young Australian reporter tries to navigate the political turmoil of Indonesia during the rule of President Sukarno with the help of a diminutive photographer."
      ],
      "budget": 13000000
   },
   "movielensId": 2919,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1982-12-17",
      "dvdReleaseDate": "2005-02-08",
      "directors": ["Peter Weir"],
      "runtime": 115,
      "movieId": 2919,
      "title": "The Year of Living Dangerously",
      "mpaa": "",
      "actors": [
         "Mel Gibson",
         "Sigourney Weaver",
         "Linda Hunt",
         "Michael Murphy",
         "Bill Kerr",
         "Noel Ferrier",
         "Bembol Roco",
         "Paul Sonkkila",
         "Domingo Landicho",
         "Kuh Ledesma"
      ],
      "imdbMovieId": "0086617",
      "originalTitle": "The Year of Living Dangerously",
      "genres": [
         "War",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": [
         "j2k9d0c4sAM",
         "IL6BqLMZJyA"
      ],
      "plotSummary": "Australian journalist Guy Hamilton travels to Indonesia to cover civil strife in 1965. There, on the eve of an attempted coup, he befriends a Chinese Australian photographer with a deep connection to and vast knowledge of the Indonesian people and also falls in love with a British national.",
      "tmdbMovieId": 11541,
      "avgRating": 3.90889,
      "releaseYear": "1982",
      "numRatings": 2947,
      "posterPath": "/3fBuFmNLTDKuL3QOlgeIvLdekJn.jpg"
   }
}