{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "gunslinger",
            "id": 75
         },
         {
            "name": "desperation",
            "id": 1333
         },
         {
            "name": "outlaw",
            "id": 9503
         }
      ],
      "imdb_id": "tt0068699",
      "video": false,
      "title": "High Plains Drifter",
      "recommendations": [
         8879,
         10747,
         4929,
         10649,
         11916,
         10650,
         17689,
         10651,
         14881,
         10648,
         966,
         26170,
         576,
         17529,
         10015,
         5916,
         21866,
         984,
         6723,
         20187
      ],
      "backdrop_path": "/hST5A6ljJWlbyz5kbh6JV2WONzU.jpg",
      "revenue": 15700000,
      "reviews": [{
         "author": "John Chard",
         "id": "530085cc9251416adb297cec",
         "content": "Supernatural Western?\r\n\r\nA lone gunman with no name and seemingly with no past, rides into the dusky town of Lago. The residents of Lago at first view the stranger with suspicion, but when news that some outlaws that are out for blood are on their way to town, they ask the stranger for his help. \r\n\r\nThis is Clint Eastwood's first Western film that he directed, and it's clear and evident that the guy not only loves the genre that made his name, he also knows what makes it work. Obviously having worked for Sergio Leone, Eastwood was making notes because High Plains Drifter oozes the mythical aura of many of Leone's finest genre offerings. To which, with thanks, the result is one of the best offerings in the 70s for the Oater enthusiast. \r\n\r\nThe film opens with our mysterious drifter slowly coming out of the beautiful sprawling haze and into Lago, it's ethereal, then there's just the sound of the horse breathing and the clop of its hooves that can be heard (the sound mix here is incredible), it's a gloriously mysterious opening that sets the tone perfectly. Yet Eastwood is just toying with us though, for a quick jolt of sex and violence snaps us out of the beatific warmth and into a quite hauntingly cold and morally challenged place. From here on in the stranger will demand all manner of odd things from the residents of Lago, he seems to be toying with them and revelling in their discomfort, with Lago quickly resembling an arid hellhole. You see, Lago has a dark secret, and our mysterious stranger has a purpose, and it's this purpose that makes High Plains Drifter an intriguing and gripping experience. \r\n\r\nA well known fact now is that the great man of the genre, John Wayne, wrote Eastwood to strongly complain about his harsh vision of the West, one can only think the Duke failed to grasp the post Vietnam feel of a 70s made Western. It's a great directorial effort from Eastwood, more so when you marry up his acting performance to his directorial duties. Very much the perfect role, it lets Eastwood accentuate his rugged Western leanings. Eastwood would direct the similarly themed Pale Rider in the 80s and then the genre crown topper Unforgiven in the 90s. A Western great in each decade? Well that will always be debatable, but what we do know is that the Western genre was considerably lucky to have had such a man to keep the genre going for the newer interested wanderers into the Wild West. \r\n\r\nBeautifully photographed (Bruce Surtees) on the shores of Mono Lake, California, it's a film pungent with sex, sadism, retribution and risks. High Plains Drifter is mystical and magnificent and essential Western fare. 9/10",
         "url": "https://www.themoviedb.org/review/530085cc9251416adb297cec"
      }],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "The Stranger",
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b07b",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Sarah Belding",
               "gender": 1,
               "credit_id": "52fe449d9251416c7503b07f",
               "name": "Verna Bloom",
               "profile_path": "/co1h7kjjAITSxzFqXuLPGKxgFvn.jpg",
               "id": 55192,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Callie Travers",
               "gender": 1,
               "credit_id": "52fe449d9251416c7503b083",
               "name": "Marianna Hill",
               "profile_path": "/h3X58tFp2a7Tgt7gNW2sbM6N2EH.jpg",
               "id": 15659,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dave Drake",
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b087",
               "name": "Mitchell Ryan",
               "profile_path": "/2GTRqLcW8uPlFdTkEqcZDpxrXS6.jpg",
               "id": 14312,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Morgan Allen",
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b0bb",
               "name": "Jack Ging",
               "profile_path": "/4RXCV7cDIKaObgUX6VgZrdH4H5J.jpg",
               "id": 95597,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Mayor Jason Hobart",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0bf",
               "name": "Stefan Gierasch",
               "profile_path": "/y4w2yNJYdAcaKddQyCYm4qtmLqO.jpg",
               "id": 52463,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Lewis Belding",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0c3",
               "name": "Ted Hartley",
               "profile_path": "/f3DXyuUZsVjx5rHSp32mQyMMZXX.jpg",
               "id": 59641,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Mordecai",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0c7",
               "name": "Billy Curtis",
               "profile_path": null,
               "id": 102426,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Stacey Bridges",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0cb",
               "name": "Geoffrey Lewis",
               "profile_path": "/8BABD0pjhefIFpKEZwNnLrkn0wl.jpg",
               "id": 18071,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Bill Borders",
               "gender": 0,
               "credit_id": "52fe449e9251416c7503b0cf",
               "name": "Scott Walker",
               "profile_path": "/1K78PuIApUuQbtLPsQIEZGnZLmI.jpg",
               "id": 199813,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Sheriff Sam Shaw",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0d3",
               "name": "Walter Barnes",
               "profile_path": "/m7OtPTdxtRSRFJeAYnBSTFjINgX.jpg",
               "id": 33544,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Lutie Naylor",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0d7",
               "name": "Paul Brinegar",
               "profile_path": "/8YOaYazXeGZLRNcYcson7vym4Tr.jpg",
               "id": 106611,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Asa Goodwin",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0db",
               "name": "Richard Bull",
               "profile_path": "/5TYupEMDpS4UL1lLaYO5ynNB1vF.jpg",
               "id": 31210,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Preacher",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0df",
               "name": "Robert Donner",
               "profile_path": "/6GXjsXEC5a0BoFwq1pad5OqJ5M9.jpg",
               "id": 13875,
               "order": 13
            },
            {
               "cast_id": 24,
               "character": "Bootmaker",
               "gender": 2,
               "credit_id": "52fe449e9251416c7503b0e3",
               "name": "John Hillerman",
               "profile_path": "/sZ44pzr7OJrdxGfsGjTMavFCW2K.jpg",
               "id": 12296,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b08d",
               "name": "Clint Eastwood",
               "profile_path": "/n8h4ZHteFFXfmzUW6OEaPWanDnm.jpg",
               "id": 190,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b093",
               "name": "Ernest Tidyman",
               "profile_path": null,
               "id": 6483,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b099",
               "name": "Dean Riesner",
               "profile_path": null,
               "id": 14776,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b09f",
               "name": "Jennings Lang",
               "profile_path": null,
               "id": 14825,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b0a5",
               "name": "Dee Barton",
               "profile_path": null,
               "id": 55319,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b0ab",
               "name": "Bruce Surtees",
               "profile_path": "/dJsO0sdSi2tM4ZTKVdZrvufiAuO.jpg",
               "id": 792,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe449d9251416c7503b0b1",
               "name": "Ferris Webster",
               "profile_path": null,
               "id": 3643,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe449d9251416c7503b0b7",
               "name": "Robert Daley",
               "profile_path": null,
               "id": 14777,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "59a02c07c3a368480e011ad0",
               "name": "Henry Bumstead",
               "profile_path": "/hmJBS9jdH5q5PrEsF3K48Gumhug.jpg",
               "id": 369,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "59a02c1492514177810125bf",
               "name": "George Milo",
               "profile_path": null,
               "id": 6934,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "59a02c26c3a36847f6012448",
               "name": "James R. Alexander",
               "profile_path": null,
               "id": 1562054,
               "department": "Sound",
               "job": "Sound Designer"
            }
         ]
      },
      "genres": [{
         "name": "Western",
         "id": 37
      }],
      "popularity": 8.885213,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11901,
      "vote_count": 350,
      "budget": 5500000,
      "overview": "A gunfighting stranger comes to the small settlement of Lago. After gunning down three gunmen who tried to kill him, the townsfolk decide to hire the Stranger to hold off three outlaws who are on their way.",
      "similar": [
         10213,
         196,
         49849,
         10046,
         13496,
         9394,
         188161,
         9086,
         12160,
         429,
         33,
         4512,
         44896,
         57201,
         353491,
         338766,
         11697,
         11509,
         1585,
         1368
      ],
      "original_title": "High Plains Drifter",
      "runtime": 105,
      "poster_path": "/557vwDdOIQ07Q1QvTwHVmxHJpXU.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Malpaso Productions",
            "id": 171,
            "origin_country": ""
         },
         {
            "logo_path": "/8lvHyhjr8oUKOOy2dKXoALWKdp0.png",
            "name": "Universal Pictures",
            "id": 33,
            "origin_country": "US"
         }
      ],
      "release_date": "1973-04-19",
      "vote_average": 7.4,
      "belongs_to_collection": null,
      "tagline": "Welcome to Hell",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Clint Eastwood"],
      "runtime": 105,
      "synopsis": "A distant figure on horseback rides through shimmering, midday heat. He's nearer now, a bearded man in a dark cowboy hat and long dusty overcoat--the Stranger ( Clint Eastwood). The Stranger enters the tiny western town of Lago and rides slowly down the main street. The townspeople stop and watch him pass. Freighter Jake Ross ( John Quade) cracks a bullwhip to wake his team of horses. The Stranger, startled, snaps his head around at the source before riding on. The Stranger leaves his horse at the livery stable and walks to the saloon. On the front porch three armed, tough-looking men watch him enter: Bill Borders ( Scott Walker), Tommy Morris ( James Gosa), and Fred Short ( Russ McCubbin). The Stranger exchanges looks with Borders and enters the saloon. From the end of the bar farthest from some locals, he orders a \"beer and a bottle\" from saloon keeper Lutie Naylor ( Paul Brinegar). The three men who were on the porch enter and take positions around him. Borders says, \"Flea-bitten range bums don't usually stop in Lago. Life here's a little too quick for 'em. Maybe you think you're fast enough to keep up with us, huh?\" Everyone freezes, waiting for the Stranger's reaction. He suddenly reaches for the whiskey bottle, scattering the local town folk, and causing the three tough men to tense. As he leaves, he whispers, \"I'm faster than you'll ever live to be,\" He walks across the street to the barber shop, whiskey bottle in hand, and pays for a shave and a hot bath. He hangs his overcoat and gun belt on a coat rack. The barber ( William O'Connell) seats him, drapes him with a smock, and nervously applies shaving cream to his face. The three toughs enter and resume taunting him. The Stranger ignores them, irritating Borders, who suddenly spins the chair. The Stranger shoots Borders in the forehead with a gun hidden under the smock. He then shoots Morris and Short before they can react. He stands and removes the shaving cream with the smock. He puts on his gun belt, replacing a wooden gun stock in the holster with his smoking gun. He steps outside, where the stunned townspeople are creeping over to view the carnage. A dwarf, Mordecai ( Billy Curtis), gives him a cigar and offers a light, asking, \"What did you say your name was, again?\" The Stranger replies, \"I didn't.\" The Stranger walks toward the stable. Callie Travers ( Mariana Hill), a young woman of unknown background, purposefully collides with him. The shoulder of her sleeve is ripped, and she berates him for it. He tells her there's no reason to make a fuss, that she could have asked if she wanted to get acquainted. She angrily insults and repeatedly provokes him. He tries to leave, but she grabs him and insults him again. He returns her insults. She tells him he has \"the manners of a goat\" and slaps the cigar from his mouth. Pushed too far, he tells her, \"You're the one that could use a lesson in manners,\" and drags her, screaming, into the stable. He throws her onto the loose hay and rapes her. The Stranger walks back past the barber shop where townsmen remove the dead bodies left by the stranger and clean up the barbers shop. They stop and watch him pass. He enters \"Belding's Hotel\" and finds the owner, Lewis Belding ( Ted Hartley), at the desk. The Stranger says, \"Room.\" Belding gives him a key, reminding him to sign the register. The stranger merely looks at him and goes upstairs to his room. In the room, he wedges a chair under the doorknob, takes a gulp of whiskey, and lays down to sleep. In a dream, a bloodied man ( Buddy Van Horn) lays in the same position as the sleeping Stranger. The man who is wearing a badge is being whipped in the street by three men. It is dark, but the silhouettes of those watching are clearly the townspeople. The three men whipping him are not shown. The bloody man asks the townspeople for help, but receives none. As he passes out, he says, \"Damn you all to hell.\" The stranger wakes from the dream. The next morning, the Stranger wakes and goes to the barber shop. He asks for his bath which the barber, instantly nervous, orders Mordecai to prepare in the back room. The trembling barber nicks the man he is shaving, Sheriff Sam Shaw ( Walter Barnes), shoos him away. Sam waits until the Stranger has settled into his bath, then asks if he can sit down to talk. Trapped, the Stranger reluctantly gestures that Sam may join him. Sam says that Borders was not a loved man and there will be no charges filed. Callie Travers, who The Stranger had raped in the stable, enters the tub room with a revolver, says \"You dirty bastard!,\" and shoots at the Stranger, who slides under the water. Sam wrestles her for the gun and, as he drags her out, instructs Mordecai to tell the Stranger not to leave town until Sam talks to him. After they're gone, the Stranger comes up for air and says, \"I wonder why it took her so long to get mad.\" Mordecai, who witnessed the rape, responds, \"Because maybe you didn't go back for more.\" In a backroom of the mining office, the prominent men in town are meeting: Mayor Hobart ( Stefan Gierasch) of the general store, Dave Drake ( Mitchell Ryan) and Morgan Allen ( Jack Ging) of the mining company, the undertaker ( Richard Bull), the gunsmith ( Reed Cruikshanks), hotelier Belding, saloonkeeper Naylor, freighter Ross, and the preacher ( Robert Donner). They have learned that Stacey Bridges and his cousins, the Carlin brothers, are to be released from prison that day. These three have sworn to burn the town to the ground. The group was counting on the mining company's hired gunfighters--Borders, Morris, and Short--to defend the town, but The Stranger killed them. Now, they are considering hiring the Stranger. Belding and the preacher don't like it, but the rest are in favor. The meeting is interrupted by Sam entering with still angry Callie in tow. Sam tells them about Callie's shooting outburst. Morgan Allen, her lover, tells her to be patient. Callie says, \"Isn't forcible rape in broad daylight a misdemeanor in this town?\" Allen tells her they need to avoid hysterics. She refers to hysterics not too long ago and spits on him, loudly questioning the manhood of the townsmen. Sam finds the Stranger eating at the hotel and tries to persuade him to defend the town. He says Bridges and the Carlins were troubleshooters for the mining company who were bullying townspeople before being convicted of stealing gold from the mining office. The Stranger suggests they were railroaded, and Sam admits that's why they are mad at the town. The Stranger says Sam can handle it. Sam replies, \"I'm no law man\", adding that his predecessor, Marshal Jim Duncan, was whipped to death in the street by outsiders. More pleading, then Sam says, \"This is a God-fearing town. These are God-fearing people.\" The Stranger replies, \"You like 'em. You save 'em.\" Desperate, Sam says, \"Look, what if we offered you anything you want?\" The Stranger stops in his tracks, turns, and asks, \"Anything?\" In Hobart's store, the mayor and Sam explain that the Stranger \"has a free hand in this town,\" that he can have anything he wants in the town, \"even if it's a squaw or a Mex to keep your bed warm at night,\" and that, as far as preparing the ambush, everyone is ready to follow his orders. The Stranger pockets a handful of cigars. He gives two Indian children each a jar of candy and gives a stack of blankets to an old Indian man Hobart has just scolded for touching the merchandise. On the way out, he encounters Sarah Belding ( Verna Bloom), Lewis's wife, who served his meal earlier and caught his eye. He repeats, \"Anything I want.\" The Stranger visits the boot maker ( John Hillerman) and takes many items, for which Sam says there is \"no charge.\" He does the same at the leather maker ( Jack Kosslyn's) shop. A number of townsmen follow him, carrying his booty. He leads them to the saloon where he orders a round on the house for everyone who's following him. When Naylor complains, Sam delights in saying \"Everyone's got to put something in the kitty.\" Hearing this, The Stranger removes Sam's badge and pins it on Mordecai. Mayor Hobart snickers. The Stranger removes Hobart's hat and puts it on Mordecai's head, making him both sheriff and mayor. Mordecai is thrilled. At the gunsmith shop, Mordecai selects a huge revolver since he \"can't be sheriff without a gun.\" The Stranger informs the townsmen they are now part of the \"City of Lago Volunteers\", tells the gunsmith to give each man a rifle, and orders everyone to report to the street for drills. At the territorial prison, Stacey Bridges ( Geoffrey Lewis), Dan Carlin ( Dan Vadis), and Cole Carlin ( Anthony James) are released, and their gun belts returned. The jailer claims their horses were used for food, so they face a long walk. Dan says, \"Drake and Allen don't seem to have remembered.\" Stacey replies, \"One way or another, they'll remember.\" In Lago, the \"volunteer\" townsmen take shooting positions on the roofs of the taller buildings, while the Stranger watches from a central walkway. Sam and Mordecai gallop through town on Ross's wagon, pulling a trailer loaded with three stuffed dummies on saw horses. The townsmen rain gunfire on the dummies, but score no hits. The Stranger mutters, \"Shit.\" Ross approaches the Stranger from behind, holding a knife, and says, \"I don't remember lending my wagons to be shot up.\" Without looking back, the Stranger says, \"You're gonna look pretty silly with that knife sticking up your ass.\" He draws and fires four shots, beheading each dummy and knocking off Mordecai's hat. He holsters his gun and says, \"You still here?\" Ross replies, \"No, I was just going.\" Sam and Mordecai are excited about the shooting display, Sam saying, \"This is going to be a picnic.\" The Stranger tells them to keep the men practicing. The Stranger asks two Mexican laborers to use lumber from Belding's barn to build picnic tables. When Naylor, who overheard, questions the picnic, he's told he is furnishing the beer and whiskey. Belding arrives. The Stranger overrules his objection to his barn being torn down, and tells him to provide 35 bedsheets for the picnic. Mordecai, the Stranger's new sidekick, says they also need someone to provide a barbecued steer and 200 gallons of red paint. Finally, the Stranger orders Belding to get everyone out of his hotel. Flabbergasted, Belding asks where his live-ins are supposed to go. The Stranger replies, \"Out.\" Bridges and the Carlins come across three men camping. They shoot them and steal their horses and clothes. Now, instead of walking, they are riding at full gallop. At the mining office, Allen and Belding suggest to Drake that hiring the Stranger was a mistake. They argue that convicts always threaten revenge but rarely carry through, and complain that the Stranger's crazy orders have the townspeople turning on one another. Drake wants to wait a few days to be sure. The discussion is heated, and reveals that the townspeople, in addition to Bridges and the Carlins, had a hand in Marshal Duncan's death, or as Drake puts it, \"One hang, we all hang.\" Drake refuses to budge and Allen storms out. At the hotel, the evicted guests are leaving, and Belding and the preacher are outraged. The preacher complains to the Stranger but gets nowhere. Sarah reports the readiness of the Stranger's connecting rooms, \"The best in the hotel. One for entertaining and one for sleeping...if your conscience lets you sleep.\" The Stranger replies, \"I sleep just fine, Ma'am. Care to see for yourself?\" Sarah leaves in a huff. The Stranger tells Belding he wants fried chicken for dinner with the best bottle of wine in town, then leaves. Mordecai giggles and, when the angry Belding swipes at him, dives under the raised walkway. Under the walkway, Mordecai has a flashback to the night of Marshal Duncan's whipping which he viewed from this same position. The whippers are Bridges and the Carlins. As in the Stranger's dream, the townspeople just watch. The exception is Sarah, who tries to stop it, but is restrained by Lewis. In Callie's bedroom, the Stranger enters while Callie is brushing her hair. She gets a gun from the dresser, but he grabs her wrist and controls it. He tells her he wants her company at dinner. She calls him an animal and says she doesn't eat with dogs. He says, \"You might if it's the dog that runs the pack.\" She lets him kiss her and take the gun. She says she needs half an hour to get ready. He returns the gun and leaves. At the hotel, Sarah is serving Callie and the Stranger dinner. She asks, \"Do you have any special request for dessert?\" The Stranger looks at Callie and says, \"No, I've already taken care of that.\" Callie smiles. Sarah leaves, disgusted. In the hills, Cole's horse has come up lame, and he suggests they're pushing too hard. This angers Stacey, who says maybe they should leave Cole. Dan tries to calm Stacey, saying Cole can ride double with him. Stacey says, \"When they find those bodies back there, they'll be a hunting party out for us, and I want time to take one year of my life out of Lago before we move on.\" They shoot the lame horse and ride on, slower now. Allen and Ross meet Mordecai walking at night. He's been drinking. Allen knocks him cold with a left hook. They look up and watch the light go out in the Stranger's hotel room. In the church, Belding speaks to the church-goers, including Drake. He complains that good people have been thrown out of his hotel, which is now being used for \"fornication and sins of the flesh.\" He and Sam argue over who should step in. It gets caustic, and the preacher says, \"Gentlemen, please! Look what's happening to us.\" Belding agrees, adding \"It couldn't be worse if the devil himself had ridden right into Lago.\" In his hotel room, the Stranger sleeps while Callie sneaks out of bed and gets dressed. Outside, Morgan Allen, Jake Ross, and three henchmen carefully ascend the hotel stairs, which creak anyway. Callie leaves the room and shuts the door, just as the men arrive. The men enter the room and beat the covered figure in bed with axe handles. The Stranger, on a ledge outside the window, lights a stick of dynamite and throws it onto the bed. The attackers see it and rush for the door, but only three escape before the room explodes. Outside, the Stranger shoots two attackers as they retreat down the stairs, leaving only Allen, who ducks into the hotel lobby. The Stranger follows and finds Allen holding Sarah in front of him as a shield. As Allen backs away, the Stranger shoots his exposed shoulder. Allen falls backward to the floor, pulling Sarah down with him. Bleeding badly, he releases Sarah, and scrambles out the back door toward the barn. In the barn, Allen mounts a horse and rides out. Callie pleads with him to take her with him, but he brushes her off and rides on. The Stranger has an easy shot at Callie, but lowers his gun, and she runs away into the darkness. The townspeople arrive, having heard the blast. Upset at the damage to his hotel, Belding lets it slip that he knew about the attack. The Stranger hears and is unhappy. He orders the townsmen to begin digging graves, in the dark, for the four men killed. Drake assures the Stranger he had nothing to do with the attack and offers him a bonus to stick with the agreement. The Stranger doubles it, Drake agrees, and the Stranger turns and steps away. Belding whispers to Drake, questioning the large bonus. Drake whispers back, \"Promising's one thing, paying's another. He might just catch a bullet.\" The Stranger says, \"Oh, you and Lewis can grab shovels too.\" The Stranger turns to Sarah, who says \"I don't know where you're going to sleep now. All the rooms are ruined, except for our room.\" The Stranger looks at her and smirks. Sarah backs away, shaking her head. The Stranger takes her elbow and leads her into the hotel. She calls to Lewis for help. Lewis hears, but does not respond. In the Belding's bedroom, Sarah grabs a pair of shears and backs into a corner. The Stranger lays on the bed, and asks what she is doing. She says she's defending herself, citing Callie's rape. The Stranger plays with her, recalling Callie enjoyed it, and acting as if Sarah wants the same. He says, \"I'd like to oblige you, but a man's got to get his rest sometime.\" Sarah, angry at the suggestion, attacks him. He controls her, and forces her to kiss. She stops fighting and submits. The next morning, they are relaxed with each other, Sarah in bed and the Stranger getting dressed. Sarah asks if he has heard of Jim Duncan, who lies in an unmarked grave, adding, \"They say the dead don't rest without a marker.\" As he's leaving, she says, \"Be careful. You're a man who makes people afraid and that's dangerous.\" He replies, \"It's what people know about themselves, inside, that make them afraid.\" At the cemetery, the townsmen are finishing up the four graves. The Stranger is painting something unseen on a sign. At the Strangers behest, Mordecai orders everyone to begin painting the town red. There is grumbling and disbelief, but no dissent. Naylor says, \"I'll paint if you say we got to, but when we get done this place is gonna look like Hell.\" As the tired men tote their tools back to town, the sign is revealed. \"Hell\", in red, covers \"Lago\". Lewis enters the Belding bedroom and tells Sarah there is an important meeting they should attend. She refuses, saying the neighbors make her sick. While defending the neighbors, Lewis reveals that Duncan was killed because he had discovered the mine was on government property and was determined to report it. The mine would be closed, ruining the town. He sees the murder as \"the price of progress\", but Sarah can't live with that anymore. She says, \"I'm packing to leave, Lewis. I won't be coming back.\" In the hills outside town, Bridges and the Carlins see Allen, near collapse, fall from his horse. Bridges sits him up and tries to persuade him to reveal the combination to the safe in the mining office. He promises that, in return, he'll move Allen into the shade and give him water. Allen curses him. Bridges threatens with a pointed stick, but Allen remains defiant. Bridges drives the stick into his neck, and says \"Two sticks of dynamite will take care of that iron box. We don't need him.\" A rifle shot ricochets near Dan's feet, and the three dive behind barely adequate cover. Unbeknownst to them, it's the Stranger, who had been tracking Allen by his blood droplets. Hidden on a ridge above, the Stranger lights a stick of dynamite, leaves it, and changes position. The dynamite explodes while Stacey is firing blindly up the hill, confusing the three, and showering them with debris. Then, from another direction, the Stranger shoots Cole's ear, and the three must hurriedly shift positions. Stacey figures it must be Drake and shouts out, seeking a parley. Getting no response, he fires more shots blindly, and there is another explosion, much closer this time. The three are shook up, filthy, and scratched from the blast. As they listen to the Stranger ride away, still unseen, Stacey screams, \"I'll kill every man in Lago.\" The Stranger rides back to Lago which is now completely red. He tells Mordecai, \"The guests are on their way to the party.\" Mordecai runs down the street, lined with picnic tables, telling everyone to get ready. He finds the prominent men drinking in the saloon. They are scared and all need one more drink before reluctantly moving outside. The Stranger ties up at the hotel, and on his way in, tells the livery boy to get up in the church tower and ring the bell at the first sign of dust. Bridges and the Carlins ride toward the town, down out of the hills now. The Stranger exits the hotel, having retrieved his overcoat. He walks to the saloon and gets a drink. Sam and Naylor are anxious, wanting him to get ready outside, but he tells them there's plenty of time. Mordecai asks \"What about after we do it? What do we do then?\" The Stranger says, \"Then you live with it.\" They walk into the street and watch everyone take their positions. A \"Welcome Home Boys\" banner has been raised at the town's entrance. Mordecai asks, \"When are you going to give the signal?\" The Stranger replies, \"I'm not. You are.\" The church bell begins ringing. The Stranger mounts his horse and rides calmly down the back road out of town. The townspeople watch in horror. Bridges and the Carlins arrive, pausing when they see the banner. They draw their guns and gallop down the main street, whooping, shooting, and roping tables. Mordecai yells, \"Fire!\", but they all freeze or panic. Sam is roped and dragged over a collapsing table. Several rooftop gunners are shot or knocked back by splintering wood. The livery boy is shot out of the tower. Stacey catches Drake sneaking out of the mining office, backs him into the lake, and shoots him dead. Later, after dark, the town is ablaze. The battered townspeople are in the saloon being roughed up by Stacey and Dan. Stacey beats Sam back onto a table, yelling, \"A party?\" Cole enters with Callie and throws her to the floor. She tries to convince Stacey she always loved him, but he's not buying it. Cole wants to know who ambushed them, and Stacey says, \"We're going to find out right now.\" Then, a whip flies in over the swinging doors, wraps around Cole's neck, and drags him out, choking. The Stranger whips Cole to death in the street while Stacey, Dan, and the townspeople remain inside, stupefied by what they hear. Finally, the bloody whip is thrown into the saloon. Stacey orders everyone out into the street where they gather around Cole's body. Stacey and Dan look for the whipper but see no one. Two sticks with lit fuses fly from behind a building and land near the body. The townspeople scatter, screaming \"Dynamite!\" When the fuses burn out, Stacey examines them and sees they are just sticks of wood. Dan tells Stacey the horses are gone. Stacey and Dan move down opposite sides of the street, guns drawn, searching for the whipper. A whip from above wraps around Dan's neck, lifts him, and hangs him dead from a balcony. While Stacey is looking at Dan's body, a lantern is thrown into the street. Spooked, Stacey fires three times. While Stacey reloads, the Stranger's voice is heard whispering, \"Help me, help me.\" The Stranger steps out in front of a burning building behind Stacey, who turns and sees only his silhouette. Stacey takes aim, but the Stranger draws and shoots Stacey's gun from his hand. Stacey yells, \"Who are you?\", and the Stranger shoots him dead. Belding steps out from between buildings and aims a shotgun at the Stranger's back. A shot is fired and Belding falls over dead. Mordecai is revealed, holding his huge revolver. The Stranger nods and walks away. The next morning, the Stranger rides down the smoldering street. Sarah, well dressed, is climbing aboard a buckboard. She and the Stranger exchange nods. The Stranger rides out to the cemetary where Mordecai is carving a grave marker. Mordecai says, \"I never did know your name.\" The Stranger replies, \"Yes, you do. Take care.\" As Mordecai watches him ride away, the marker is revealed-- \"Marshall Jim Duncan, Rest In Peace.\" In the distance, the Stranger disappears into the heat shimmer.",
      "writers": ["Ernest Tidyman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0068699/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTUwMjcxNTM0OF5BMl5BanBnXkFtZTcwODY1MTkxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Clint Eastwood, Verna Bloom, Marianna Hill | See full cast and crew »"],
      "reviews": [
         "By the early 70s, actor Clint Eastwood's career had gone from being a mere extra to a well-known Hollywood star. Thanks to the success of Sergio Leone's immortal Westerns, Eastwood was noticed and soon he began to work in very good projects, with great results. Despite being a respected actor, nobody could have imagined that his talent as director was even superior to his acting skills, and after a fairly good debut in 1971 (the thriller \"Play Misty for Me\"), he crafted his first masterpiece in 1973 as a tribute to his own artistic mentors: the haunting western \"High Plains Drifter\". \"High Plains Drifter\" is the story of a small mining town named \"Lago\" which is constantly troubled by outlaws and gunfighters. One day a stranger (Clint Eastwood) comes to town, and manages to kill three of those outlaws, gaining instant recognition and the offer of having whatever he wants from the town if he gets rid of the rest of the gang. He accepts but the town doesn't know that the mysterious stranger has a secret that will change their lives for ever. The figure of the stranger comes to town to alter the fragile equilibrium of their existence, and soon the town's own demons return to haunt them. Eastwood's character is not exactly the hero we know, but a morally ambiguous cruel man that doesn't hesitate to use and abuse the townspeople and that clearly has an agenda of his own. Written by Ernest Tidyman, this is a dark tale that explores the ambiguous morality of people and the concepts of justice and revenge. Eastwood's second directorial effort is a powerful movie that brilliantly combines the elements of Western with those of suspense and thriller. Due to his solid career in Westerns, Eastwood knows the genre's characteristics and pushes them forward to create something more, a movie beyond its genre. With brilliant camera-work, he goes from dream sequences out of a nightmare to day sequences in Leone's Spaghetti Western style. This is definitely a tribute to his mentors (In fact, he included a small reference to his directors in a cemetery scene). The acting is remarkably good, with Eastwood himself leading the cast with great skill and his powerful presence. His character is a lot more complex than his \"Man With No Name\" and it could be said that he mixes in one character the characteristics of the three outlaws of \"The Good, The Bad and the Ugly\". The underrated Billy Curtis is great as Mordecai, probably the only one in town who knows (and understands) the stranger's secret. The rest of the cast is very good and even those in small roles (such as William O'Connell as the barber) give performances of high quality. Apparently Eastwood's talent with people was there from the beginning. Tidyman's story is very well-constructed, and can be seen from diverse points of view. Every character in town is well-defined no matter how long their screen-time is, and Eastwood makes the most of it. It's hard to find a flaw in this movie and I really can't praise it enough. It is a story that once that grabs you never lets you go. \"High Plains Drifter\" is a must-see, not only for Western fans, it is a powerful story that is more than what it seems. Great camera-work, haunting images, terrific script, superb acting, all pieces fit to create Clint Eastwood's first masterpiece. This dark western sets the path of Eastwood's career as a director and one can see why is he one of the best directors alive. 10/10",
         "The exotic location in the desert, near Lake Mono in the California Sierras, certainly gives the film a fresh and refined look among Westerns...The sparkling colors of the backgrounds and the changing cloud formations gave effective shots...The film has certainly the most dramatic opening sequence of any Western... Through the burning desert, Bruce Surtees' lens discovers a lone horseman.... The camera pans with the horseman to reveal a small town by a lake-lagoon... The horseman rides in, the camera tracking behind him, interrupted with faces of suspicious locals - even a coffin maker with his merchandises - and instantly one is reminded of Sergio Leone and his faithful reproduction of Kurosawa... A coach driver cracks the whip... The horseman turns, and moves back... He enters a bar and asks for 'a beer and a bottle.' A town heavy intervenes: 'Flea-bitten range-bums don't usually stop in Lago. Life here is a little too quick for them. Maybe you think you're fast enough to keep up with us!' The drifter replies: 'I'm faster than you'll ever live to be!' True to his promise, the Stranger kills the 'trouble shooter' and his two friends, and also rapes the town belle who responds as any Eastwood feminine victim is obliged to, with resistance turning strangely to joy... The town midget, Mordecai (Billy Curtis) offers him a cigar inquiring: 'What did you say your name was again?' The hardened Stranger replies: 'I didn't!' The Man With No Name has returned, this time, quite literally, with a vengeance... His dictatorship is flavored with cool humor... The name Billy Borders is mentioned to him...'Don't know the man,' he confesses.'You didn't have much time to,' comes the reply, 'because you shot him yesterday.' When his rape victim, Callie Travers (Mariana Hill) inaccurately empties a pistol at him during his bath, he casually resurfaces, cigar still in his mouth, and in an aside to his sidekick, Mordecai, reflects: 'I wonder what took her so long to get mad?' His fellow chauvinist suggests, 'Maybe because you didn't come back for more.' The townsfolk accedes to the Stranger's requests, who pushes them to the limit, even forcing them to paint the entire town blood red... 'When we get down,' says one of them, 'this place is going to look like hell.' This is the Stranger's intention; he takes a brush and strokes out the name 'Logo' on the town sign and writes 'Hell' instead. In a series of flashbacks, primarily from the Stranger's point of view and later from Mordecai's, it is revealed that the townsfolk stood by and let three men whip their Marshal to death... The Marshal had discovered that the basis of the town's prosperity, a mine, was actually on government land and not on the townspeople's own. He was going to report this, so no-one felt obliged to intervene when he met his vicious end... His body now was lying outside the town in an unmarked grave: 'They say the dead don't rest without a marker of some kind... he's the reason this town's afraid of strangers.' Now they have reason to be afraid of the three men who paid the price for the crime in which they all agreed... The Stranger analyzes this fear: 'It's what people know about themselves inside that makes them afraid.' The town reaction to his is reserved... A group of vigilantes try to kill him... The Stranger repays them with a stick of dynamite... Despite their training, the remaining locals are horrified when they realize that he does not intend to remain for the final showdown... \"High Plains Drifter\" is one of the most important Westerns ever made, and when Eastwood takes his rightful place in film history alongside Cooper and Stewart and Wayne, this is the film that will be seen as the quintessential example of his art...",
         "I really had no idea what to expect when I grabbed High Plains Drifter from the video store shelf. I recently saw The Outlaw Josey Wales, and really enjoying that film, I figured I couldn't go wrong; I was right. High Plains Drifter is more than just another western with the standard assortment of gun fights, bar scenes, and shots of horseback riding on wide-open prairie. To be sure, it does have its share of the said events, it is a western after all, but what I particularly liked was the film's character development and well thought out story. I don't want to ruin any of the film's enjoyment for any potential viewers, so I won't go into describing any of the characters. Suffice it to say though that they all have a very realistic quality to them, especially Clint Eastwood's character. No stereotyped good guys/bad guys here, thank you very much. As I mentioned, the story is also very nicely developed. It has multiple layers which are peeled away as the movie progresses, remaining entertained throughout. High Plains Drifter is an excellent western. If you're a fan of the genre, you'll no doubt find it to be an entertaining watch.",
         "A small frontier town is worried and scared for it's future. Three men who murdered the sheriff in front of the whole town have been released from jail and are heading back to take revenge on the town. When a stranger comes into town, he is offered anything he wants if he will help defend them against the men. The stranger accepts but both he and the townsfolk have hidden agendas. High Plains Drifter stands out from Eastwood's many good westerns simply because it is a lack darker than many others I've seen and also possesses a weird supernatural quality to it. The plot is immediately dark, although it starts with Eastwood being who we expect him to be, an early rape sets him out with a more morally complex character than I had expected. This darker, cruel strand continues as it is clear that, although hired to protect them, the stranger also seems to be taking pleasure from harming the town itself. Those who have seen it will know the ending, although it is evident from the first flashback what the film's twist is. Knowing it doesn't make the film less enjoyable but it is probably better to figure it out yourself. The film also has a good streak of humour going through it and is enjoyable \u0096 the twist of the stranger punishing the townsfolk easily filling the time. Eastwood is as good as always but the support cast is also full of well known faces. The direction is good and adds to the weird feel to it, the music makes it feel other worldly and the flashbacks to the whipping stop it all getting too light. By the time the town literally becomes hell, the film has always won me over. Overall this is maybe not the best western Eastwood has ever done but it is certainly one of the most different! The supernatural twist and the streak of cruelty running through the film make it very interesting to watch.",
         "A lone gunman with no name and seemingly with no past, rides into the dusky town of Lago. The residents of Lago at first view the stranger with suspicion, but when news that some outlaws that are out for blood are on their way to town, they ask the stranger for his help. This is Clint Eastwood's first Western film that he directed, and it's clear and evident that the guy not only loves the genre that made his name, he also knows what makes it work. Obviously having worked for Sergio Leone, Eastwood was making notes because High Plains Drifter oozes the mythical aura of many of Leone's finest genre offerings. To which, with thanks, the result is one of the best offerings in the 70s for the Oater enthusiast. The film opens with our mysterious drifter slowly coming out of the beautiful sprawling haze and into Lago, it's ethereal, then there's just the sound of the horse breathing and the clop of its hooves that can be heard (the sound mix here is incredible), it's a gloriously mysterious opening that sets the tone perfectly. Yet Eastwood is just toying with us though, for a quick jolt of sex and violence snaps us out of the beatific warmth and into a quite hauntingly cold and morally challenged place. From here on in the stranger will demand all manner of odd things from the residents of Lago, he seems to be toying with them and revelling in their discomfort, with Lago quickly resembling an arid hellhole. You see, Lago has a dark secret, and our mysterious stranger has a purpose, and it's this purpose that makes High Plains Drifter an intriguing and gripping experience. A well known fact now is that the great man of the genre, John Wayne, wrote Eastwood to strongly complain about his harsh vision of the West, one can only think the Duke failed to grasp the post Vietnam feel of a 70s made Western. It's a great directorial effort from Eastwood, more so when you marry up his acting performance to his directorial duties. Very much the perfect role, it lets Eastwood accentuate his rugged Western leanings. Eastwood would direct the similarly themed Pale Rider in the 80s and then the genre crown topper Unforgiven in the 90s. A Western great in each decade? Well that will always be debatable, but what we do know is that the Western genre was considerably lucky to have had such a man to keep the genre going for the newer interested wanderers into the Wild West. Beautifully photographed (Bruce Surtees) on the shores of Mono Lake, California, it's a film pungent with sex, sadism, retribution and risks. High Plains Drifter is mystical and magnificent and essential Western fare. 9/10",
         "\"High Plains Drifter\" is probably Clint Eastwood's darkest western and that says quite a bit. It has similarities with \"Pale Rider\", his other western gem. The hero is a mysterious, ghost-like figure and he fights against the evil and corruption that infests a small town in the middle of nowhere. What sets these two films apart is that here Eastwood is fighting a lone battle , and his only sidekick is the midget Mordecai, while almost all other inhabitants of Lago are corrupted or/and cowardly. Eastwood delivers one of his strongest performances here and manages to be charming and humorous besides exacting cool-blooded vengeance. His interactions with the two women (Marianna Hill and Verna Bloom, both solid in their roles) who are very different draws comparisons to his earlier film \"Hang 'Em High\". But what sets this apart from the typical Eastwood fare is the dark nature of this movie. Anthony James, the man with the unforgettable face, is once again back as one of the main villains. The rest of the cast are quite forgettable and lesser known names, which adds credibility to this movie, making it a film to be taken seriously and not just a gathering of famous faces. This film's perhaps strongest asset is the excellent screenplay by Ernest Tidyman, the Oscar-winner for \"French Connection\" and it is probably the best screenplay ever written for an Eastwood-directed western. The storyline never ceases to surprise and is full of suspense and great dialogue. As always, Clint knew who to pick. As always in the Clint films, this movie is not about love. Clint and Bloom's affair almost results in love, but it never gets the chance to develop. The surprise ending adds a great touch. This film really is a delight for fans of Clint Eastwood and unusual, film-noirish westerns.",
         "Obviously this was produced before the age of feminist political correctness. The anti-hero with no name--Clint Eastwood, of course, a throwback to his days making spaghetti westerns in Italy with Sergio Leone--comes riding tall in the saddle down into a valley with a mining town by a lake. (The movie was shot around the Mono Lake area of California.) Particularly effective in this unforgettable opening scene is the music sounding like the high whine of the wind off of the desert. This town would be \"Lago\" later to be renamed \"Hell\" by Eastwood's character who is identified in the titles as \"The Stranger.\" The stranger really just wants a shave and a bath and something to drink and eat and place to lay his head for the night. What he gets is a bad time from some roughnecks and a woman (Callie Travers, played by Marianna Hill) who has attraction/avoidance feelings for him. He shoots the three guys and rapes the woman before the movie is twenty minutes old. What I mean by this not being politically correct is that, despite herself, she likes it! That sort of thing is not done in cinema these days. The idea that a woman might be turned on by being raped would not play before today's audiences, nor would a Hollywood producer make such a film. I won't go any further into the plot but suffice it to say that Eastwood is just beginning to kick tail. It seems that everybody in town is cowardly and without the will to protect themselves from the bad guys, especially the three who just got out of jail and are headed their way. How Eastwood, who directed from a script by Ernest Tidyman (The French Connection [1971]; Shaft [1971] etc.), handles the familiar revenge theme is interesting. First it is no accident that Eastwood's protagonist is named \"the Stranger.\" That is the English title of a famous novel by Albert Camus that surely influenced Eastwood. Camus's stranger is an existential anti-hero, a kind of benign sociopath who really doesn't feel anything for others except as they affect his life. But he is not particularly violent and just lives from one day to the next without any direction or goal. He just \"exists.\" Eastwood's stranger does more than just exist. He takes action, and he is very good at it. Indeed, I can't recall a western movie in which a gunman could draw faster or shot straighter, or any movie hero who was less afraid of putting his life on the line. So, in a sense what Eastwood has added to Camus's stranger is Nietzsche's superman. And herein lies, I think, the underpinning of Eastwood's philosophy and his \"message.\" Note that the people in the town to a man are cowardly. The only exception is Sarah Belding (Verna Bloom) who, like the aforementioned Callie Travers, can't resist the stranger's forceful charm, and falls in love with him. This somehow inspires her to leave the corrupt town. Yes, the town, like most of human society is corrupt. And yes the average man in the street is cowardly and without the will to defend himself. It is only the ubermensch, that rare breed celebrated in the works of the German philosopher, who has the skill, the strength and the will to bend events to his liking and to take on those who would use violence to achieve their ends. So what Eastwood does here in his second directorial effort (following Play Misty for Me, 1971) is to diverge from Leone's formula. While there is some very funny and intentionally ridiculous dialogue in such films as, for example, The Good, the Bad, and the Ugly (1966), or For a Few Dollars More (1965) or A Fistful of Dollars (1964), there is little that is funny, intentionally or otherwise in High Plains Drifter. Furthermore, whereas Leone just wanted to make a buck and saw that tough-minded heroes or anti-heroes involved in action-filled revenge plots was a good way to do it, Eastwood is interested in also making a philosophic (and perhaps political) statement. We are degenerate, we humans, he is saying, except for those rare individuals who take the law into their own hands, make their own rules, and through superior skill and bravery, make their own luck and create their own reality, as does his stranger. In this film there is also an element of the supernatural, or so it would appear. The stranger \"sees\" in his head the whipping of a past sheriff of the town. Perhaps it comes from the mind of the dwarf Mordecai (very well played by Billy Curtis, by the way) who witnessed the tortured death while hiding under the saloon. At any rate, the stranger shows that he is just as handy with the whip himself as he is with his six-gun. By all means see this for an early look at the work of Clint Eastwood as both an actor and a director. You will not be bored I can assure you. But don't invite the girl friend over. If there was ever an anti-\"chickflick,\" this is it.",
         "As is often the case with a Clint Eastwood western, High Plains Drifter is rather good. The usual scenario opens, with Eastwood (playing an unnamed character again) riding into a small mining town, Lagos, where a small group of thugs unsuccessfully try to kill him. This small act serves as an introduction to the local townsfolk: small-minded cowards who are all talk and no action. They also bear a horrifying secret. Eastwood is eventually approached to help them fend off an upcoming attack from three criminals who have just been released from prison. He also suffers from a recurring nightmare, which I will leave to you to find out. Needless to say, all of the pieces come together by the end, and those of you not astute enough to have noticed will be saying, \"of course!\" A good story combines with Eastwood's anti-heroic personality (he never really played a good guy, did he?) and a good supporting cast to produce one of the best westerns of the 1970s. As the Maltin summary states: \"Half-serious, half tongue-in-cheek, with great role for midget Billy Curtis.\" Curtis plays Mortecai, the town dwarf, who shadows Eastwood around Lagos. Some of the scenes in this are extremely funny, but are balanced by some harshly violent moments, of which Eastwood's nightmares are a prime example. 1985's Pale Rider bears similarity to High Plains Drifter in certain areas, but you'll have to watch that yourself to find out where.",
         "Most people are turned off by this film because it won't surrender to the audience. The film won't let people like the characters but I think that's the great element of this film. This town is chock full of cowards and not one(except the midget) deserves to be rescued. See most westerns have the undeniable lovable characters that deserve to be saved from corruption. Eastwood takes this film in a twisted, unique direction. Someone on this board said this didn't appear to have supernatural elements in it. I disagree. At the end Eastwood's character is asked by the midget Billy Curtis who he was. Eastwood told him that he knew. Billy then looked down at the tombstone of the dead sheriff that was killed by the three bandits. Eastwood then disappears into the sun's haze as he rides away from the town of Lago(at the conclusion of the film) with eerie music in the background. I liked the film's dark tone and thought this was more than just a western. It had those thriller elements,too. One other part of the movie that adds to it's supernatural aura is when Eastwood remembers back to the sheriff's whipping death at the hands of the three bandits(Eastwood wasn't even there, how would he know about that). This has it's detractors for it can be very off putting and very violent. But it's still fresh and very creepy. 10/10.",
         "In the coastal city of Lago, a stranger (Clint Eastwood) arrives and is challenged by three `bad guys'. He kills them and sooner is invited by the locals to protect the city against three outlaws that would leave a nearby prison in a couple of days. One year ago, these bandits killed Marshal Jim Duncan using whips. The marshal asked for help and the coward persons did not help him. The killers were sent to jail and promised to burn the city when they leave the jail. The citizens offer anything the stranger want `free of charge' if he protects them against the rage of the criminals. What they do not know is that the stranger is the avenger angel of the killed marshal looking for revenge. This movie about revenge is great: we never know whether the `stranger without a name' is a brother or friend of Jim Duncan, or whether he is Jim Duncan himself looking for revenge. Fans of western movies will not be disappointed with this story, no matter whether he is a cowboy or a supernatural character. My vote is seven."
      ],
      "genres": ["Western"],
      "productionCompanies": [
         "Universal Pictures",
         "Malpaso Company, The"
      ],
      "summaries": [
         "A Stranger rides into in the dusty mining town of Lago, where the townspeople are living in the shadow of a dark secret. After a shootout leaves the towns hired-gun protectors dead, the towns leaders petition the Stranger to stay and protect them from 3 ruthless outlaws who are soon to be released from prison. The 3 have their sites set on returning to Lago to wreak havoc and take care of some unfinished business. A series of events soon has the townspeople questioning whether siding with the Stranger was a wise idea as they quickly learn the price that they each must pay for his services. As the outlaws make their way back into Lago, they discover that the town is not exactly as they had left it, and waiting in the shadows is the Stranger, ready to expose the town's secret and serve up his own brand of justice.",
         "A stranger rides out of the hot desert into a small town in the wild west. The towns people are scared of him, and 3 gunmen try, unsuccessfully, to kill him. He takes a room and decides to stay. Meanwhile, a group of outlaws are about to return to the town and take their revenge - will the towns leaders convince the mysterious man to help ?",
         "A mysterious gunfighter without a name rides across the desert landscape and arrives in the mining town beside the sea \"Lago\" to stay for the night. After gunning down three desperado's who tried to kill him, the town hires the gunfighter to help defend the town from three murderous outlaws, Stacey Bridges, Bill Borders and Cole Carlin who have been released from jail after they brutally whipped to death the town's local lawman Marshal Jim Duncan who is in his grave with a unmarked gravestone, the three outlaws set out to return to \"Lago\" to get their vengeance. Can the mysterious gunfighter without a name stop the three outlaws?",
         "A gunfighting stranger comes to the small settlement of Lago and is hired to bring the townsfolk together in an attempt to hold off three outlaws who are on their way."
      ],
      "budget": 0
   },
   "movielensId": 2921,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1973-04-19",
      "dvdReleaseDate": "1998-02-24",
      "directors": ["Clint Eastwood"],
      "runtime": 105,
      "movieId": 2921,
      "title": "High Plains Drifter",
      "mpaa": "R",
      "actors": [
         "Clint Eastwood",
         "Verna Bloom",
         "Marianna Hill",
         "Mitchell Ryan",
         "Jack Ging",
         "Stefan Gierasch",
         "Ted Hartley",
         "Billy Curtis",
         "Geoffrey Lewis",
         "Scott Walker",
         "Walter Barnes",
         "Paul Brinegar",
         "Richard Bull",
         "Robert Donner",
         "John Hillerman"
      ],
      "imdbMovieId": "0068699",
      "originalTitle": "High Plains Drifter",
      "genres": ["Western"],
      "youtubeTrailerIds": [
         "_c2wyU5-Fyk",
         "YYeX6XAhS68"
      ],
      "plotSummary": "A gunfighting stranger comes to the small settlement of Lago. After gunning down three gunmen who tried to kill him, the townsfolk decide to hire the Stranger to hold off three outlaws who are on their way.",
      "tmdbMovieId": 11901,
      "avgRating": 3.82355,
      "releaseYear": "1973",
      "numRatings": 2896,
      "posterPath": "/557vwDdOIQ07Q1QvTwHVmxHJpXU.jpg"
   }
}