{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "radio",
            "id": 2135
         },
         {
            "name": "town",
            "id": 18090
         },
         {
            "name": "citizens band",
            "id": 221361
         }
      ],
      "imdb_id": "tt0076123",
      "video": false,
      "title": "Citizen's Band",
      "recommendations": [
         126764,
         177335,
         36818,
         49966,
         4500,
         113012
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Spider",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fb3",
               "name": "Paul Le Mat",
               "profile_path": "/zdXz9llyKWBRojikxjvtCs3Jt3W.jpg",
               "id": 12406,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Electra",
               "gender": 1,
               "credit_id": "52fe49349251416c910a5fb7",
               "name": "Candy Clark",
               "profile_path": "/6pGZGgHa09ktPwEcFWNAU3PLFdi.jpg",
               "id": 12407,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Blood",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fbb",
               "name": "Bruce McGill",
               "profile_path": "/r9UNvqwTYB9C3AcGyBpcjzkCnVD.jpg",
               "id": 14888,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Papa Thermodyne",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fbf",
               "name": "Roberts Blossom",
               "profile_path": "/iNW74OJWcF9LRbeRlsOPZBddVeE.jpg",
               "id": 66288,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Chrome Angel",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fc3",
               "name": "Charles Napier",
               "profile_path": "/90flwc0xLUDvS4pSUimZzyme2PD.jpg",
               "id": 16119,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Dallas Angel",
               "gender": 1,
               "credit_id": "52fe49349251416c910a5fc7",
               "name": "Ann Wedgeworth",
               "profile_path": "/qi153PFDSHi5afMBkdEqquXwxWc.jpg",
               "id": 83145,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Portland Angel",
               "gender": 1,
               "credit_id": "52fe49349251416c910a5fcb",
               "name": "Marcia Rodd",
               "profile_path": null,
               "id": 97782,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Hot Coffee",
               "gender": 1,
               "credit_id": "52fe49349251416c910a5fcf",
               "name": "Alix Elias",
               "profile_path": null,
               "id": 37598,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Smilin' Jack",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fd3",
               "name": "Richard Bright",
               "profile_path": "/k2P17sxGhh7Dafidxn9Ub5YbF7n.jpg",
               "id": 3174,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "The Priest",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fd7",
               "name": "Ed Begley Jr.",
               "profile_path": "/au4qlxxeHitgPDHmt7WhWTA7Znb.jpg",
               "id": 42157,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "The Red Baron",
               "gender": 2,
               "credit_id": "52fe49349251416c910a5fdb",
               "name": "Harry Northup",
               "profile_path": "/l8Xgvu4iYGBcuHEPJYL5DmLS6FN.jpg",
               "id": 127738,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Himself (voice)",
               "gender": 2,
               "credit_id": "54c80aec925141678c004a24",
               "name": "Arthur Godfrey",
               "profile_path": "/mR9UMl7U5XVm6sj7dIzZr4lKb0i.jpg",
               "id": 111191,
               "order": 11
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49349251416c910a5faf",
               "name": "Jonathan Demme",
               "profile_path": "/17dEjoWccPf9NDm43XP44vhSTEd.jpg",
               "id": 16294,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "54c80b0c92514157cc000833",
               "name": "Paul Brickman",
               "profile_path": null,
               "id": 57383,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "54c80b24c3a36874bf004a90",
               "name": "Freddie Fields",
               "profile_path": null,
               "id": 27963,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "54c80b379251416794004905",
               "name": "Shep Fields",
               "profile_path": null,
               "id": 1419352,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "54c80b49925141678e004939",
               "name": "Paul Brickman",
               "profile_path": null,
               "id": 57383,
               "department": "Production",
               "job": "Associate Producer"
            },
            {
               "gender": 2,
               "credit_id": "54c80b5bc3a36871df0008ec",
               "name": "Bill Conti",
               "profile_path": "/cR6H9EFVkeGP0TnoX9RPNBB6hSN.jpg",
               "id": 10494,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "54c80b6c925141678c004a29",
               "name": "Jordan Cronenweth",
               "profile_path": null,
               "id": 594,
               "department": "Crew",
               "job": "Cinematography"
            }
         ]
      },
      "genres": [{
         "name": "Comedy",
         "id": 35
      }],
      "popularity": 1.479058,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 85325,
      "vote_count": 6,
      "budget": 0,
      "overview": "The interlaced stories of several characters in a small town united by their use of CB (citizen's band) radio.",
      "similar": [
         858,
         801,
         838,
         39939,
         12444,
         46529,
         45269,
         3600,
         177699,
         227156,
         22588,
         15037,
         6535,
         1697,
         14139,
         9434,
         8866,
         282984,
         18311,
         10808
      ],
      "original_title": "Citizen's Band",
      "runtime": 98,
      "poster_path": "/1GHl5epPqL0ib7IxUx9D5127DI9.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1977-09-29",
      "vote_average": 4.7,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Jonathan Demme"],
      "runtime": 98,
      "synopsis": null,
      "writers": ["Paul Brickman"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0076123/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk0NDExNDE3OF5BMl5BanBnXkFtZTcwNzQ4OTYyMQ@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Paul Le Mat, Candy Clark, Bruce McGill | See full cast and crew »"],
      "reviews": [
         "This quite funny but nevertheless deep film, along with the great 'Melvin and Howard' can be viewed as part of the ongoing saga of Paul Le Mat, the guy who played the hotrodding eternal teenager, John Milner, in 'American Graffiti.' Le Mat is perfect for these films because he embodies a uniquely American mixture of down to earth hipness, non-cynicism and hard edged goodwill. He is somewhere between Audie Murphy and Steve McQueen with some touches of Elvis and Jerry Lewis thrown in. Demme uses him as the springboard for his explorations of what's authentic and non-cynical in ordinary American life. All the events in 'Citizen's Band' are connected by the CB radios all the characters use. This allows for events that happen to characters far apart from each other (such as the bigamist trucker and Le Mat), to become connected into the snapshot or slice of life that becomes the film. The characters don't have to necessarily all run into each other, even though some of them do. Oliver Stone's supercynical and ridiculous 'Talk Radio' features a similar set-up. In fact, there, we never actually have to meet any of the on-air personalities. Demme uses an Altman type setup to show how vast an area of 'craziness' the term 'normal people' covers and how all this can be non-cynical in nature at least as often as it is cynical.",
         "One of Jonathan Demme's earliest and best movies, this quirky, seriocomic, thoroughly amiable and disarming slice-of-Americana gem bombed at the box office, but was widely hailed by critics and has gone on to garner a much-deserved loyal fan following. Centering on a small rural community populated by assorted flaky eccentrics who gab over the CB radio under outrageous aliases and similar wildly exaggerated personalities to boot (nowadays these folks can be found on countless internet chat-rooms and web boards, so the premise really hasn't dated at all; it's just taken on a different manifestation in the new millennium), this honey stars the outstanding Paul LeMat as Spider, a fervent, obsessive, self-appointed vigilante who wants to get rid of all the nutcases chattering away on emergency channels. Among the targets of Spider's wrath are Ed Begley, Jr. as a zealous priest who sermonizes over the air; the delightfully daffy Alix Elias as sweet hooker on wheels Hot Coffee, who advertises herself over the airwaves and turns tricks in the back of her camper (!); a lewd adolescent male operating under the self-explanatory moniker the Hustler who tells dirty tales of his alleged spicy sexual misadventures over the radio, and a strident Aryan Nazi scumbag. Spider becomes so absorbed with his single-minded mission that loving, but frustrated girlfriend Candy Clark starts cheating on him with his hard-nosed competitive high school basketball coach brother Bruce McGill and even steams up the airwaves speaking raunchy talk over the CB radio to some dweeb who calls himself the Warlock! The always great Charles Napier contributes a terrific performance as amicable, big-hearted bigamist trucker Chrome Angel; Ann Wedgeworth and Marcia Rodd are likewise excellent as Chuck's flighty, blowzy wife and practical, more down-to-earth better half, respectively. Roberts Blossom (the nutty middle-aged Ed Geinesque lunatic in the supremely chilling psycho knockout \"Deranged\") turns in a hilariously crotchety characterization as Spider's ornery, batty old coot father who only comes to life while talking over the CB radio. Chiefly addressing the lack of direct, intimate communication between people in contemporary society and the basic need to transcend the drab mundaneness of ordinary life through the assuming of another, altogether more colorful, outlandish and exciting made-up alternate identity (substantial themes which are still quite timely and pertinent even today), Paul Brickman's bright, astute, truly whimsical and episodically structured script offers a wealth of precisely observed little moments and a generous helping of warmth and compassion which accumulate into a totally unique and engaging whole. Demme's peppy, sparkling, sympathetic direction displays an equally heartfelt and heartwarming affection for everyday oddball middle-class Americana, pacing and shaping the deliciously dense and winding narrative with utmost ease and consummate expertise. Jordan Cronenweth's flashy'n'splashy, richly saturated cinematography and Bill Conti's folksy, gently lulling and harmonic score further add to the frothy, gleefully off-center merriment. A fabulously idiosyncratic treat.",
         "This movie was made in the 1970s (3 years after American Graffiti) when use of the Citizens Band radio was at it's all time high. Hollywood, not being one to let a good craze go untapped when they can make good money from it, did EXACTLY that with this movie. Starring Paul Le Mat and Candy Clark, both of American Graffiti fame, it chronicles the lives of some CB radio fanatics living in a rural town who have nothing better to do than \"Be someone else\" on the radio. Paul Le Mat (Spider)plays a CB regulator of sorts, a REACT station operator, who goes on a crusade to clean up the airwaves. he tries to accomplish this by cruising around in his very cool 1956 Chevy Nomad Stationwagon CB equipped of course! He peruses The Hustler, a 10yo self proclaimed ladies man for using ch9, the emergency channel. He also goes after Grandma Breaker, a non stop talker for keeping the channel all locked up 24-7. He goes after The Rad Baron, a Nazi wannabe who hates everything and everyone NON white. He goes up against The Priest, played very well by Ed Beagly Jr, who turns in a very believable performance for preaching the gospel on the radio without a license. He only breaks off his pursuit of these folks when he and his buddy almost get shot by the Red baron who catches them in his yard. One must take this movie for face value in that it is a relatively simple movie but the actors and direction is perfect for portraying the lifestyle of rural CBers in the America of the times. One of the greatest lines in the movie, spoken my Paul (Spider) is \"No one in this town is who they are supposed to be!\" He is referring to the fact that people on the radio are sometimes far different in real life, an alter ego of sorts, compared to reality. His girlfriend Candy Clark plays Elektra, a sexy talking lady on the radio who talks dirty to other CBers (like Warlock) in an attempt to rid herself of the small town blues. Then there is Chrome Angel, who gets stuck in town after a trucking accident after Paul (Spider) saves his life because of his REACT station. Chrome Angel is a bigamist who's two wives come to meet him unknown to each other till they meet on the bus. Paul's Father, Papa Thermodyne, is an ex trucker who seems to listen to only what comes over the CB so much so that Spider has to use a CB in another room to talk to him. It is only when Papa Thermodyne gets fed up and leaves home suitcase in hand, attempting to walk to Canada and everyone has to band together to find him that everyone gets along. The movie has a good pace as well, never getting boring especially if you were also a CB junkie in the 60s~the 80s. Great acting, great script, great characters. Definitely a worthwhile watch! I highly recommend it and since it is available instantly you know where, it is a great watch. I wish it was available on DVD as I would buy it.",
         "I still enjoy this movie even though some parts are slow and seem to drag on a bit. I really wish they would release it to Blu-Ray or DVD, I have a VHS copy but would prefer a DVD or Blu-ray copy. I did see it on Netflix a few months ago. When I watch this movie it brings back memories. I live in a very small town where there isn't much to do, back in the late 80's and 90's the only thing that interested me was getting on Citizens Band radio. I would always look forward to the weekends so I could get on my base station at home or get in my truck and drive around and talk for hours and hours. My friends and I would do the dumbest things on the radio like dead keying on channel 19 just to irritate everyone. We would use linear amplifiers with our base stations and mobile radios so it would be near impossible for anyone in the area to be heard. We did so many stupid things on the radio back then that it would take far too long to list everything. We would also track people down by using the signal strength meter on the mobile radio to find out where people were broadcasting from so we could get their home address if they were on a base station or find out what type of vehicle they were driving and write down their license plate number and make and model of their vehicle. Now days citizen band radio isn't very popular. I always wanted to see an updated version of this movie but I know it wouldn't be very popular now days. I guess the closest thing would be the movie Joy Ride (2001).",
         "It sounds like a redneck movie about truckers, but it's really a gentle character study. The story centers around the citizen's band radio craze of the 1970s. Against this backdrop, the lives of a group of small town residents is examined in a successful blend of comedy and drama. Le Mat is quite likable as the unofficial enforcer of the local airwaves. His girlfriend is played by Clark, his \"American Graffiti\" co-star. There are fine performances from Blossom and McGill, as Le Mat's father and brother, respectively. There's a funny subplot about a bigamist trucker featuring Napier, Wedgeworth, Rodd, and Elias. The finale is a little forced, but this early effort from Demme mostly rings true.",
         "This here is a forgotten little movie about a small town that communicates less than amicably via CB radio. I don't say that it's a forgotten little gem, like it would've been expected of me to say after 'forgotten little' because it's not really a gem. That's not to say it doesn't attempt some interesting things, and occasionally succeeds. At the center of the story, I think, is a young guy who repairs said radios and volunteers with a monitoring organization and acts as a sort of community FCC, busting everyone's balls on the somewhat taboo things they talk to each other about on this sort of walkie-talkie sort of system. Everyone's anonymous, it's very rare that this stickler of a guy can deduce who is who when he hears them and objects, and what it makes me think of as a young guy myself, watching it on a library VHS in the year 2010, is an earlier, unofficial form of social networking that is ubiquitous nowdays. MySpace, Facebook. REACT International is like a poor Mormon in a room full of rich atheists now. Citizens Band is interesting because it was made in 1977 and I'm watching it now. Other than that, it's decent, but nothing really pops out at me. I stand by my claim of an uncanny parallel between the abuse of a citizens-band radio and the online networks of the information age. Look at what these characters do! Calling themselves by monikers on the airwaves such as Chrome Angel, Dallas Angel, Papa Thermodyne, Hot Coffee. Isn't that what we did for years on MySpace before we got sick of it and gravitated toward Facebook and started using our real names? At its core though, Citizens Band, or Handle With Care, as it is known in a further edited version, is a B comedy about an assortment of deadpan screwballs. That's not bad at all. Don't get me wrong. It feels like an Altman film in ensemble, in situations, in the depiction of a fully realized world of people, and certain plot strands are kind of novel and fun for that reason, such as when two women meet on their way to the same town, and find out they have more than a lot in common. Demme never looks down on his working class characters, displaying instead a compassion and empathy. Even a polygamist trucker, our young protagonist who in this day and age would probably be written off as a McCarthy or Murdoch sort of oppressor, and even his controlling, competitive older brother. Having seen Demme's later work, from the 1980s and his obvious crowning achievements later on, I suppose I expected more of his love of music as well, and there is very little. But who am I to criticize a filmmaker at the start of his career, making B films and exploitation films, trying to get started, feeling out his strong suits and his weak ones? The reasons why an above-par director could've made a sub-par film is often because he has yet to discover the sources of his passions, the key to his craftsmanship. Citizens Band is one of those sub-par films by one of those above-par directors. And don't miss Bruce McGill in his first film. That's right, pre-D Day!",
         "I gave this Gem a 10, because Grandma Breaker was my Great Grandmother! I so enjoyed watching This movie on the Big screen, when I was just a little girl in the 70's! we all Loved Our \"grandma\" and are so Proud of her! she had a wonderful and fascinating life. She was born on July 1st. Now my own Children are watching \"my Grandma Breaker\". Also a bit of Trivia, the stories she tells about her life living on the Nez Perce Indian Reservation, Were all True!! she was a wonderful woman who did so much in her life, she even sat in the Oval Office with President Kennedy. I am sure you will Enjoy this Gem of a movie as well, and bear in mind that this movie depicts the very very beginnings of \"Social media\" It was how awayyyy back in the day we all connected ourselves with one another, just as we do today with the internet! I bet my Great Grandmother never thought she would be sitting not only with Presidents, but on the \"Breaking edge\" of life as we know it today! Enjoy Citizen Band.. and listen carefully to my Grandma's stories for each and every one of them did happen! ENJOY!!",
         "I especially enjoyed this film because I was present when it was made in Marysville, CA. I worked security for the film and in fact I drove the police car flashing the spotlight when the cows were let out of the truck and made a mess all over the parking lot. The cow manure was hand made by compost purchased at the local Montgomery Wards Store. It was fun to watch it being made and the money wasn't too bad either. Charles Napier was a lot of fun to talk to as was most of the crew and cast. Paul LaMat wasn't too friendly but I guess he had more important things on his mind other than talking to peons. It amazed me how the talented the crew and prop people are, making cow dung, etc. to look so very real. Several movies have been made here in the 60's and 70's and most are supposed to be made in small southern towns.",
         "Another example of a movie featuring independent stories that find a connecting point, \"Handle With Care\" (or \"Citizens Band\") puts its own twist on the genre by having the stories connect through the use of CB radios by the main characters. As with almost any movie of this type, some of the stories are better than others. The story featuring \"Spider\" (Paul Le Mat) as a sort of CB super-hero who makes sure that people don't abuse the airwaves was a bit silly, and reminded me a lot of the old '70's TV series \"Emergency,\" combined with a bit of \"Batman\" - without the costume. Like the paramedics of \"Emergency\" kept responding to largely unrelated emergencies with at best only a loose thread holding every episode together, Spider similarly dealt with an injured trucker (Charles Napier) and a pilot forced to crashland on a highway, and - like the Caped Crusader without the cape - he took on a boy who used the radio for underhanded purposes, a neo-Nazi who spread hatred and a radical Catholic priest who was trying to convert listeners. The best story was of that rescued trucker, who turns out to be a bigamist and who has to deal with both wives coming to see if he's OK. That story was also responsible for most of the humour in the movie, and was, I thought quite well done. Spider's dysfunctional family, and the sexual CB fantasies of \"Warlock\" and \"Electra\" were other connecting stories. It was an inconsistent movie - some stories were very good and very funny, some were quite dull to be honest. It's worth no more than a 5, but in fairness it's a 5 that's worth watching.",
         "Speaking of whimsy (I just saw Life Aquatic), here's another ensemble piece, this one centered on an array of Southern jes' folks who live out their fantasy lives via CB radio. From bigamist trucker to alcoholic dad to humorous Nazi to overbearing but good-hearted gym teacher to every individual we glimpse in between, everyone is acutely and humanely drawn, and the action moves forward in an organic, relaxed way that is extremely endearing. Only at the end, when the whole ensemble converges to witness the dad's happy redemption, do things feel badly contrived; up to then the gentleness and fluidity of Demme's and writer Paul Brickman's conception carry us along smiling."
      ],
      "genres": [
         "Comedy",
         "Drama"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": ["This movie interlaces the stories of several characters in a small town united by their use of CB (citizen's band) radio. Paul LeMat is the local CB coordinator who has time for little else in his life. His father, Roberts Blossom is a sour old man who is nice on the radio. Charles Napier is a trucker hospitalized after an accident, with hilarious consequences."],
      "budget": 0
   },
   "movielensId": 2923,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1977-09-29",
      "dvdReleaseDate": null,
      "directors": ["Jonathan Demme"],
      "runtime": 98,
      "movieId": 2923,
      "title": "Citizen's Band",
      "mpaa": "PG",
      "actors": [
         "Paul Le Mat",
         "Candy Clark",
         "Bruce McGill",
         "Roberts Blossom",
         "Charles Napier",
         "Ann Wedgeworth",
         "Marcia Rodd",
         "Alix Elias",
         "Richard Bright",
         "Ed Begley Jr.",
         "Harry Northup",
         "Arthur Godfrey"
      ],
      "imdbMovieId": "0076123",
      "originalTitle": "Citizen's Band",
      "genres": ["Comedy"],
      "youtubeTrailerIds": [],
      "plotSummary": "The interlaced stories of several characters in a small town united by their use of CB (citizen's band) radio.",
      "tmdbMovieId": 85325,
      "avgRating": 3.3986,
      "releaseYear": "1977",
      "numRatings": 143,
      "posterPath": "/1GHl5epPqL0ib7IxUx9D5127DI9.jpg"
   }
}