{
   "tmdb": {
      "original_language": "cn",
      "keywords": [
         {
            "name": "trainer",
            "id": 1482
         },
         {
            "name": "sake",
            "id": 1796
         },
         {
            "name": "uncle",
            "id": 6464
         },
         {
            "name": "dojo",
            "id": 9992
         },
         {
            "name": "master",
            "id": 33401
         },
         {
            "name": "kung fu classic",
            "id": 155065
         },
         {
            "name": "drunken master",
            "id": 190992
         }
      ],
      "imdb_id": "tt0080179",
      "video": false,
      "title": "Drunken Master",
      "recommendations": [
         12207,
         10974,
         11537,
         9056,
         10753,
         11205,
         21519,
         11134,
         11198,
         18764,
         33542,
         10975,
         21521,
         19274,
         10951,
         8697,
         11143,
         17809,
         21733,
         10617
      ],
      "backdrop_path": "/quQt0DPCotCjTEhlFXpaM3sESQZ.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 12,
               "character": "Wong Fei-Hung",
               "gender": 2,
               "credit_id": "52fe44169251416c75028631",
               "name": "Jackie Chan",
               "profile_path": "/pmKJ4sGvPQ3imzXaFnjW4Vk5Gyc.jpg",
               "id": 18897,
               "order": 0
            },
            {
               "cast_id": 9,
               "character": "Su Hua Chi",
               "gender": 0,
               "credit_id": "52fe44169251416c75028629",
               "name": "Yuen Siu-Tin",
               "profile_path": "/7HC5QhrjmIjlLzUkOhcxQUnVtRG.jpg",
               "id": 68676,
               "order": 1
            },
            {
               "cast_id": 11,
               "character": "Thunderleg",
               "gender": 2,
               "credit_id": "52fe44169251416c7502862d",
               "name": "Hwang Jang-Lee",
               "profile_path": "/mS6l541wNrYcxUA25pmtsbYf06i.jpg",
               "id": 68677,
               "order": 2
            },
            {
               "cast_id": 13,
               "character": "Professor Kai-Hsien",
               "gender": 0,
               "credit_id": "5462a37f0e0a267815000831",
               "name": "Dean Shek",
               "profile_path": "/xvhgm8KkNbWBR72prPyAinKZyPh.jpg",
               "id": 26727,
               "order": 3
            },
            {
               "cast_id": 17,
               "character": "Wong Kei-Ying",
               "gender": 0,
               "credit_id": "55945d67c3a36869d1003c5f",
               "name": "Lam Kau",
               "profile_path": "/d3SOkHCmTA0NdupYTaxRLLzAkA6.jpg",
               "id": 990778,
               "order": 4
            },
            {
               "cast_id": 18,
               "character": "Fei-Hung's Aunt",
               "gender": 0,
               "credit_id": "55945dae9251410e92004288",
               "name": "Linda Lin",
               "profile_path": "/z9gETI8SIfhTL9bAk8keFG7LIK5.jpg",
               "id": 142601,
               "order": 5
            },
            {
               "cast_id": 19,
               "character": "Da Kuai-Dai",
               "gender": 0,
               "credit_id": "55945ddb925141674c002ba5",
               "name": "Chiang Kam",
               "profile_path": "/vpFC30IZ7VwX8GmM2To5dOJaNXX.jpg",
               "id": 134684,
               "order": 6
            },
            {
               "cast_id": 20,
               "character": "Ying's Student",
               "gender": 0,
               "credit_id": "55945e2f925141645a004417",
               "name": "Max Lee Chiu-Jun",
               "profile_path": null,
               "id": 1168315,
               "order": 7
            },
            {
               "cast_id": 21,
               "character": "Chen Kuo-Wei",
               "gender": 0,
               "credit_id": "55945e56c3a3683566001862",
               "name": "Yuen Shun-Yi",
               "profile_path": "/goFpyG2I0X8LBStTczGs1OywTz0.jpg",
               "id": 65976,
               "order": 8
            },
            {
               "cast_id": 22,
               "character": "Li Wan-Hao",
               "gender": 2,
               "credit_id": "55945e9bc3a36869d1003c99",
               "name": "Fung Ging-Man",
               "profile_path": "/20TtHvmFCfkiSWJLuufrIWrELII.jpg",
               "id": 119449,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Man with Bucket of Greens",
               "gender": 2,
               "credit_id": "55945eea92514167fd002b23",
               "name": "Yuen Woo-ping",
               "profile_path": "/7gr04tWDnsBHHmo18aYLWXZHAvC.jpg",
               "id": 18899,
               "order": 10
            },
            {
               "cast_id": 25,
               "character": "Gorilla/King Kong",
               "gender": 0,
               "credit_id": "571d9f809251416b9100163c",
               "name": "Lee Chun-Wa",
               "profile_path": "/2IWPbvLJe5B4nDVKkjSnzKWdYk0.jpg",
               "id": 1166565,
               "order": 12
            },
            {
               "cast_id": 26,
               "character": "Jerry Li",
               "gender": 0,
               "credit_id": "571d9f9cc3a368197c0086e5",
               "name": "Tino Wong Cheung",
               "profile_path": "/wUN0jz2NAMRqcTRQym3Fho8j2RP.jpg",
               "id": 1166104,
               "order": 13
            },
            {
               "cast_id": 27,
               "character": "Iron Head Rat",
               "gender": 0,
               "credit_id": "571d9fa79251411c7b00008b",
               "name": "San Kuai",
               "profile_path": null,
               "id": 1178815,
               "order": 14
            },
            {
               "cast_id": 28,
               "character": "King of Sticks Hsu Ching Tien",
               "gender": 0,
               "credit_id": "571d9fb1c3a3684e980036a7",
               "name": "Hsu Hsia",
               "profile_path": "/x8WtgVLgltsxyC8RNF9xyEKObov.jpg",
               "id": 119457,
               "order": 15
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44169251416c750285fb",
               "name": "Yuen Woo-ping",
               "profile_path": "/7gr04tWDnsBHHmo18aYLWXZHAvC.jpg",
               "id": 18899,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028613",
               "name": "Ng See-Yuen",
               "profile_path": "/wlSlJFdQxbcpDgaIxoGrHLtMIkZ.jpg",
               "id": 65981,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44169251416c75028619",
               "name": "Stanley Chow Fook-Leung",
               "profile_path": null,
               "id": 68673,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44169251416c7502861f",
               "name": "Hui Chang",
               "profile_path": null,
               "id": 68674,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44169251416c75028625",
               "name": "Hsiung Pan",
               "profile_path": null,
               "id": 68675,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "5462a38fc3a368124a0007bf",
               "name": "Yuen Woo-ping",
               "profile_path": "/7gr04tWDnsBHHmo18aYLWXZHAvC.jpg",
               "id": 18899,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5462a3990e0a26780a000803",
               "name": "Lung Hsiao",
               "profile_path": null,
               "id": 68671,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5462a3a3c3a368124700080d",
               "name": "Ng See-Yuen",
               "profile_path": "/wlSlJFdQxbcpDgaIxoGrHLtMIkZ.jpg",
               "id": 65981,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "5a4c19259251415a50000b59",
               "name": "Yuen Biao",
               "profile_path": "/hdBQMhtzpamgodIURGPQAcKdbWC.jpg",
               "id": 62414,
               "department": "Crew",
               "job": "Stunts"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Comedy",
            "id": 35
         }
      ],
      "popularity": 6.805827,
      "production_countries": [{
         "iso_3166_1": "HK",
         "name": "Hong Kong"
      }],
      "id": 11230,
      "vote_count": 224,
      "budget": 0,
      "overview": "Jackie Chan stars as Wong Fei-Hung, whose mischievous antics land him in hot water. Having tolerated enough of his son's mishaps, Fei-Hung's dad enlists his sadistic uncle, who specializes in drunken-style kung fu, to teach the lad some discipline. This Hong Kong martial-arts comedy helped establish the slapstick fighting style that would become Chan's trademark.",
      "similar": [
         11824,
         1371,
         9563,
         1375,
         7735,
         10115,
         7233,
         10390,
         9771,
         110830,
         8345
      ],
      "original_title": "醉拳",
      "runtime": 111,
      "poster_path": "/fWrUTM8jeiU6G6rA4NKwkeigxGa.jpg",
      "spoken_languages": [{
         "name": "广州话 / 廣州話",
         "iso_639_1": "cn"
      }],
      "production_companies": [{
         "logo_path": "/kAHLkwogrcQJYcf0x5nYzieezNg.png",
         "name": "Seasonal Film Corporation",
         "id": 13433,
         "origin_country": ""
      }],
      "release_date": "1978-10-05",
      "vote_average": 7.2,
      "belongs_to_collection": {
         "backdrop_path": "/3JWhJ6h9iR3ugJWxo7lcJl5L5ii.jpg",
         "name": "Drunken Master Collection",
         "id": 12203,
         "poster_path": "/4YKqOyFW1IP4jyX1vy5BooM0dU.jpg"
      },
      "tagline": "The Original Kung Fu Comedy!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Hong Kong",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Woo-ping Yuen"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Lung Hsiao",
         "See-Yuen Ng"
      ],
      "originalLanguage": "Cantonese",
      "imdbLink": "http://www.imdb.com/title/tt0080179/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTc1NjYxMTExNl5BMl5BanBnXkFtZTYwNTU2NTI5._V1_SY317_CR1,0,214,317_AL_.jpg",
      "actors": ["Stars: Jackie Chan, Siu Tin Yuen, Jang Lee Hwang | See full cast and crew »"],
      "reviews": [
         "Considered a classic of the kung fu genre, Jackie Chan's Drunken Master is everything I thought a kung fu movie would be: poor acting, worse humour (it's hilarious still ala Neil Hamburger) and superhuman fighting. It just gels so well together that I don't know why I have missed seeing this movie for so long. The longer the film runs, the more ridiculous it gets yet it doesn't lose sight of the fact that it is to entertain and provide a spectacle. The Matrix boasted great fight scenes but even with their expensive technology, they couldn't beat this little killer from twenty odd years ago. Essential viewing.",
         "I am not very familiar with the true story of Wong Fei Hung. I've read about him before, and from memory, he was an exceptional martial artist (he practiced Hung-Gar) and became a folk-hero to the people of China, much like his father, Wong Kei Ying. So there is the true story, and then there is the 200 or so movies made about him. 'Drunken Master' is one of these. I haven't seen most of those 200 movies, except for the Drunken Master movies, Jet Li's 'Once Upon a Time in China' series, and 'Iron Monkey'. The 'Once Upon a Time in China' movies and 'Iron Monkey' may be somewhat over-the-top wu xia movies, but they portray Wong Fei Hung as a serious hero. 'Drunken Master' features a very different take on the character. Jackie Chan's Wong Fei Hung is a rebellious trouble-maker. His father, Wong Kei Ying, has given up on disciplining him, and sends him to his uncle, So Hai, the master of drunken boxing, hoping that a year of training with So Hai will sort Fei Hung out. Fei doesn't seem to learn his lesson until a chance encounter with Thunderfoot (Hwang Jang Lee)... Story-wise, it is a bit of a standard kung-fu plot. However, in a documentary on Jackie Chan (I can't remember the name, I know that as of this review, it isn't listed on IMDb, but it was shown on SBS in 2003), 'Drunken Master' was mentioned as his breakthrough hit that nearly killed his career: Apparently Chinese viewers were insulted by Jackie's portrayal of Wong Fei Hung and nearly boycotted him when he was just gaining fame as an actor. Onto more important matters. Like kung-fu. 'Drunken Master' is one of the kung-fu classics. Boosted by the presence of martial-arts star Hwang Jang Lee, this pretty much made or solidified the careers of Jackie Chan and Yuen Woo Ping (in his directorial debut). 'Drunken Master' features some very well choreographed fights and training scenes. 'Drunken Master' is very funny too, and is one of two movies I know where a young main-character gets beaten by an older middle-aged lady (which is always funny, more movies need a scene like this) - the other movie is Battlefield Baseball. As a matter of interest for Jackie Chan fans: 'Drunken Master' signaled the end of Jackie Chan's work with director Wei Lo. Yay. In fact, the Columbia Tristar DVD release of 'Drunken Master' includes audio commentary by experts on Hong Kong cinema. I will check that out sometime, but it sounds like it would appeal to fans of kung-fu movies. Some more trivia - the latest release doesn't have the complete Cantonese sound track, and so the English dub is used where the Cantonese track is incomplete. 'Drunken Master' features awesome kung-fu scenes, and has some interesting historical perspectives. Ah, kung-fu movies and history, some of my favourite hobbies together at last - 10/10, a must see for any fans of Jackie Chan or kung-fu movies, 'Drunken Master' is kung-fu perfection.",
         "It is said that this is the film that made Jackie Chan a star, but that isn't really true, since Snake in Eagle's Shadow actually had a bigger impact at the time, and allowed Chan to make this film. One way we know this is that there are some two dozen films made in the late '70s- early'80's designed to imitate Snake in Eagle's Shadow, and only a couple imitate this film. By the time Drunken Master had become legendary world-wide, the chop-socky cycle (to which it still belongs, to an extent) had passed into history, and Chan himself had abandoned historical 'fu films for contemporary comedy-thrillers. It should be noted that the idea of making a film based on the early years of Wong Fei Hong was not original to Chan; at roughly the same time this film was being made, well-known martial arts choreographer Liu Chia Leung made a straight (non-comic) version of the story (without drunken boxing) over at Shaw Brothers, Challenge of the Masters, with Gordon Liu as Wong Fei Hung. The defining moment for the Chan-Yuen version of the film is the use of Drunken Boxing. There is no real evidence that the historical Wong Fei Hung was a master of this style; his more famous innovations involved the development of the shadowless hand technique and the no-shadow kick. Interestingly, in order to highlight Chan's use of Drunken Boxing, these other two techniques, better identified with Wong, are assigned in the film to the villain, \"Thunderlegs\" played by Hwang Jen Lee. At any rate, it would not be clear that one could consider this a Wong Fei Hung film at all - if it weren't for the fact that this film effectively redefined the Wong legend, so that it has since become pro-forma to assume that Wong was a bit wild in his youth. (Just to set that record straight, Wong was actually extremely studious, and recognized as a real child-prodigy in the martial arts, winning his first major public duel at the age of thirteen.) Drunken Master is solid martial arts entertainment. There are decided weaknesses in the plot and over-all staging of the film, but these can easily be ignored, as the film thrusts us along with kung fu and comedy to the grand final fight at the end. It must also be noted that these characters - even the villain - are well acted and quite likable and familiar, and thus add a credibility to the film. And Yuen's direction is also very professional and a couple notches above the average for a Hong Kong genre film of the time. Lives up to its own legend, and well-worth the viewing.",
         "This is one of the quality films from Jackie's early years made the year after Snake in Eagles Shadow with much of the same cast and crew this built on the comedic style of Kung Fu action that Jackie was to make his own. Of the two films I actually prefer the earlier Snake in.... but its this later film that is more often considered Chan's earliest masterpiece. This is a more traditional set kung-fu film than the later stunt fests that made his name. The fighting styles on show are unique, inventive and fascinating to watch. The showdowns are impressive and with no trick photography, CG or massive effects fueled blow outs and shows just how good a martial artist Jackie is. The comedy works well and Jackies on screen master is very funny and they spark well off each other as a team. This is a really good old style kung fu flick fans of Jackies later work such as Rush Hour etc. may not find what their looking for here this is Jackie in one of his most pure kung fu movies. But for anyone who loves martial arts you must see this!! Great entertainment 7/10",
         "This for me is Jackie Chan's finest, and is the film which propelled him to super stardom in Hong Kong. Whilst other martial artists were trying to be the new Bruce Lee, Jackie did something different. Why replace the irreplaceable when you could do something completely different? What Jackie did was introduce slapstick into the Kung Fu formula, the rest as they say is history. Jackie stars as Freddy Wong aka (Wong Fei Hung) depending upon which dub you watch. A juvenile delinquent with a penchant for feeling up immediate female members of his family. His father, fed up of his delinquency hires Sam Seed aka The Drunken Master to teach him some discipline as well as his secret fighting style. Naturally the two get off on the wrong foot but learn to respect each other as the film goes on whilst of course getting into the obligatory scrapes and japes. There is of course a villain of the piece in this case its the Tae Kwan Do master Hwang Jan Lee as the underworld assassin \"Thunderfoot\" who in real life was just as badass as he is in the film. So it's all pretty derivative then? Well yes and no. There is a genuine rapport between Jackie and Yu Su Tien as pupil and teacher. The martial arts is brilliantly choreographed and inventive (the scene in the restaurant is probably my favourite) and the whole thing has a \"joie de vivre\". Watching it, it seems to me that the actors had a ball making the film. Which is just as well as I had a ball watching it.",
         "This is my favourite jackie chan film. It's one of the funniest films i've ever seen. It starts with a fight and ends with one,so the action crowd won't be disappointed! Plus it contains the funniest scenes chan has ever put on film,such as the taunting of his idiotic teacher and the horror of realising the woman who he picks a fight with is his auntie!Brilliant.",
         "This for me is Jackie Chan's finest, and is the film which propelled him to super stardom in Hong Kong. Whilst other martial artists were trying to be the new Bruce Lee, Jackie did something different. Why replace the irreplaceable when you could do something completely different? What Jackie did was introduce slapstick into the Kung Fu formula, the rest as they say is history. Jackie stars as Freddy Wong aka (Fong Sai Yuk) depending upon which dub you watch. A juvenile delinquent with a penchant for feeling up immediate female members of his family. His father, fed up of his delinquency hires Sam Seed aka The Drunken Master to teach him some discipline as well as his secret fighting style. Naturally the two get off on the wrong foot but learn to respect each other as the film goes on whilst of course getting into the obligatory scrapes and japes. There is of course a villain of the piece in this case its the Tae Kwan Do master Hwang Jan Lee as the underworld assassin \"Thunderfoot\" who in real life was just as badass as he is in the film. So it's all pretty derivative then? Well yes and no. There is a genuine rapport between Jackie and Yu Su Tien as pupil and teacher. The martial arts is brilliantly choreographed and inventive (the scene in the restaurant is probably my favourite) and the whole thing has a \"joie de vivre\". Watching it, it seems to me that the actors had a ball making the film. Which is just as well as I had a ball watching it.",
         "What a wonderful film. This film has to rank amongst Chan's ultimate. There are so many incredible fights in this film, that you will certainly feel you're getting your money's worth. The action is entertaining and beautiful. The comedy is rich and memorable. I love the different factors that make a Hong Kong movie what it is. One of these factors is the quick zoom out from a shocked face, to the completed action. My favourite of these is in the restaurant, when Yuen Woo Ping's father laughs, then stops, as a fist comes into shot. The punch is blocked, and the camera zooms out, for the rest of the moves in the take. It's wonderful to watch, as it adds personality to the film, and tells you, \"I'm from seventies Hong Kong, and I'm not gonna change for you!\" Overall, one of my favourite films, and definitely one of Jackie's best.",
         "There are those who prefer Jackie Chan's later work (the POLICE STORY series, WHO AM I?, RUMBLE IN THE BRONX), but give me the early stuff! DRUNKEN MASTER is the perfect balance between action and humor, and the story is pure fun from start to finish. SPOILER WARNING!!! Sort of a remake of the previous year's SNAKE IN THE EAGLE'S SHADOW (which was again sort-of-remade right after this one as THE FEARLESS HYENA), DRUNKEN MASTER tells the story of Freddy Wong (Wong Fei Hung in the original Chinese), the troublemaking son of a martial arts teacher, who is simply incapable of not getting into fights. At his wits' end, his father calls in his Freddy's uncle, the infamous Sam Tse, to discipline the boy. Sam Tse also happens to be a master of the \"eight drunk gods\" technique, which is fueled by Herculean ingestion of wine. When a drunken master gets loose, God help anyone foolish enough to fight him!!! Freddy's training is so harsh that it could be seen as torture, so Freddy runs away because he is too lazy to learn it. Besides, he already knows his dad's style of kung fu, right? He promptly runs into a killer-for-hire who teaches the kid a humiliating lesson in the art of ass-whuppin'. He also engages Freddy in one of the all-time classic exchanges in a genre that is replete with classic exchanges: BAD GUY- Hmmph! Who teaches you that kung fu? FREDDY (proudly)- My dad does! BAD GUY- Hmmph! Judging by your kung fu, he's useless! I wouldn't hire him to wipe my ass!!! (He then seriously kicks Freddy's sorry butt) After that, Freddy trains hard in the eight drunk gods, and his transformation is a joy to behold. The sequence in which Jackie demonstrates seven of the eight forms is a jaw-dropping display of what a highly-trained martial artist/acrobat can do. YOU WILL BE AMAZED. Highly recommended, and whatever you do, don't miss Jackie's fight with an old lady in the middle of the street (old school kung fu fans, you know the rule: if the person is really old, DO NOT FIGHT THEM!!!), and his drunken-style fight with \"the king of sticks.\" It's not as slick as Jackie's later films, but this one has fun and energy to burn!",
         "i have seen other jackie chan movies and have been glued to the wonderful choreography of the fights and laughed at his henny youngman-type humour but this is by far the BEST jc movie. i would have to say it's one of the best all around kung fu movies, too. there is LOTS of humour, LOTS of shtick, and of course LOTS and LOTS of kung fu... crane kung fu, snake kung fu, tiger kung fu- i didn't know there were so many types of kung fu! seeing jc go through the \"disciplines\" is painful to watch, and auntie is cool! she makes sailor moon look like a power puff girl. this chick kicks a** with so much grace and style - and not a hair out of place! great, fun, popcorn-popin' movie."
      ],
      "genres": [
         "Comedy",
         "Action"
      ],
      "productionCompanies": ["Seasonal Film Corporation"],
      "summaries": [
         "The father of Wong Fei-hong, who has been attempting to teach his son kung-fu, but has found him too disobedient to teach and decides to send him off to his uncle, a cruel and torturous master of the 8-Drunken Genii kung-fu. After much suffering the son comes back to rescue the father from an assassin who has also previously humiliated Naughty Panther.",
         "Wong Fei Hong is sent to train under his uncle, a wine guzzling master famous for crippling his students. Desperate to escape this brutal teacher's cruel regime, he flees but is confronted, humiliated and beaten senseless by a hired assassin. Angry, ashamed, hungry for revenge, the wayward Fei Hung returns to his drunken master.",
         "His nickname is Naughty Panther, so earned because of his lack of discipline. Constantly clowning around when he should be learning Kung Fu, his father sends him to live with and study under his uncle - a sadistic Master with the reputation of crippling his students. Meanwhile, a rival landowner places a price on Fei Hung's father's head... and an assassin answers the call.",
         "An undisciplined boy must learn Drunken Fist Kung Fu in order to stop an assassin."
      ],
      "budget": 0
   },
   "movielensId": 2924,
   "movielens": {
      "languages": ["广州话 / 廣州話"],
      "releaseDate": "1978-10-05",
      "dvdReleaseDate": "2003-08-05",
      "directors": ["Yuen Woo-ping"],
      "runtime": 111,
      "movieId": 2924,
      "title": "Drunken Master",
      "mpaa": "PG-13",
      "actors": [
         "Jackie Chan",
         "Yuen Siu-Tin",
         "Hwang Jang-Lee",
         "Dean Shek",
         "Lam Kau",
         "Linda Lin",
         "Chiang Kam",
         "Max Lee Chiu-Jun",
         "Yuen Shun-Yi",
         "Fung Ging-Man",
         "Yuen Woo-ping",
         "Lee Chun-Wa",
         "Tino Wong Cheung",
         "San Kuai",
         "Hsu Hsia"
      ],
      "imdbMovieId": "0080179",
      "originalTitle": "醉拳",
      "genres": [
         "Action",
         "Comedy"
      ],
      "youtubeTrailerIds": [
         "i4SkO3ypCXw",
         "GDBi7uwFwRA"
      ],
      "plotSummary": "Jackie Chan stars as Wong Fei-Hung, whose mischievous antics land him in hot water. Having tolerated enough of his son's mishaps, Fei-Hung's dad enlists his sadistic uncle, who specializes in drunken-style kung fu, to teach the lad some discipline. This Hong Kong martial-arts comedy helped establish the slapstick fighting style that would become Chan's trademark.",
      "tmdbMovieId": 11230,
      "avgRating": 3.81463,
      "releaseYear": "1978",
      "numRatings": 2263,
      "posterPath": "/fWrUTM8jeiU6G6rA4NKwkeigxGa.jpg"
   }
}