{
   "tmdb": {
      "original_language": "it",
      "keywords": [
         {
            "name": "paris",
            "id": 90
         },
         {
            "name": "italy",
            "id": 131
         },
         {
            "name": "assassin",
            "id": 782
         },
         {
            "name": "fascism",
            "id": 1755
         },
         {
            "name": "benito mussolini",
            "id": 8077
         }
      ],
      "imdb_id": "tt0065571",
      "video": false,
      "title": "The Conformist",
      "recommendations": [
         690,
         776,
         20108,
         976,
         5055,
         15244,
         777,
         48035,
         17295,
         216,
         5511,
         4593,
         934,
         10238,
         3782,
         14696,
         1396,
         16672,
         26317,
         2000
      ],
      "backdrop_path": "/4ZVacZ3rNwzRKmCCuIenbZxucC3.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Marcello Clerici",
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a23f3",
               "name": "Jean-Louis Trintignant",
               "profile_path": "/rvwO5Rsm2ZohPCQjwEvY30PBp68.jpg",
               "id": 1352,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Giulia",
               "gender": 1,
               "credit_id": "52fe44a6c3a36847f80a23f7",
               "name": "Stefania Sandrelli",
               "profile_path": "/8KHaSvJ1mwBFMQ4J6r9h3FC4dSU.jpg",
               "id": 34027,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Manganiello",
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a23fb",
               "name": "Gastone Moschin",
               "profile_path": "/dlzOimu2std73cyi7S2RVb84XQg.jpg",
               "id": 3281,
               "order": 2
            },
            {
               "cast_id": 9,
               "character": "Anna Quadri",
               "gender": 1,
               "credit_id": "52fe44a6c3a36847f80a240b",
               "name": "Dominique Sanda",
               "profile_path": "/qNLSPZshmNb5j63iCwiKLd10JPI.jpg",
               "id": 24590,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Professor Quadri",
               "gender": 0,
               "credit_id": "52fe44a6c3a36847f80a23ff",
               "name": "Enzo Tarascio",
               "profile_path": "/ade7ECDsOe7kH33xDsjI5h7IuQ3.jpg",
               "id": 55757,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Il colonnello",
               "gender": 0,
               "credit_id": "52fe44a6c3a36847f80a2403",
               "name": "Fosco Giachetti",
               "profile_path": "/haWoddzNQk8lMuySFCJZfXjbDLF.jpg",
               "id": 33471,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "Italo",
               "gender": 0,
               "credit_id": "52fe44a6c3a36847f80a2407",
               "name": "José Quaglio",
               "profile_path": "/nIi1qRdXvvfv4nmXPAL3PNgZ8NW.jpg",
               "id": 25815,
               "order": 6
            },
            {
               "cast_id": 10,
               "character": "Lino",
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a240f",
               "name": "Pierre Clémenti",
               "profile_path": "/knoMVwKuw2dGAgs1s3l460J9iXc.jpg",
               "id": 17577,
               "order": 7
            },
            {
               "cast_id": 11,
               "character": "Madre di Giulia",
               "gender": 1,
               "credit_id": "52fe44a6c3a36847f80a2413",
               "name": "Yvonne Sanson",
               "profile_path": "/rUopd3a1iJMvitL0FSX0zIZtxnm.jpg",
               "id": 55758,
               "order": 8
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a23ef",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a36847f80a2419",
               "name": "Giovanni Bertolucci",
               "profile_path": null,
               "id": 55759,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a241f",
               "name": "Georges Delerue",
               "profile_path": "/yAlgcnY7fXUQLrxfknp0Jv4dUTv.jpg",
               "id": 3535,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a2425",
               "name": "Vittorio Storaro",
               "profile_path": "/4QuZy1Y5TEqSeo3GM3FJYrRM0Xa.jpg",
               "id": 7202,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "52fe44a6c3a36847f80a242b",
               "name": "Franco Arcalli",
               "profile_path": null,
               "id": 4667,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe44a6c3a36847f80a2431",
               "name": "Alberto Moravia",
               "profile_path": "/eEDRQhp7A6J4AMJUIlJcxLOVg1g.jpg",
               "id": 3780,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "56813875c3a36860e9010162",
               "name": "Ferdinando Scarfiotti",
               "profile_path": null,
               "id": 1155,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 1,
               "credit_id": "56813892c3a368227b0066a9",
               "name": "Gitt Magrini",
               "profile_path": null,
               "id": 18214,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "568138aa9251417def010e59",
               "name": "Rosa Luciani",
               "profile_path": null,
               "id": 1554804,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "568138b7c3a36860e901016c",
               "name": "Franco Corridoni",
               "profile_path": null,
               "id": 1314150,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "568138d4c3a36828f5006143",
               "name": "Mario Dallimonti",
               "profile_path": null,
               "id": 1554805,
               "department": "Sound",
               "job": "Sound"
            },
            {
               "gender": 0,
               "credit_id": "568138f2c3a368607500ef5f",
               "name": "Enrico Umetelli",
               "profile_path": null,
               "id": 1120173,
               "department": "Camera",
               "job": "Camera Operator"
            },
            {
               "gender": 0,
               "credit_id": "5681390e9251414f63009a60",
               "name": "Flavia Sante Vanin",
               "profile_path": null,
               "id": 1554806,
               "department": "Directing",
               "job": "Script Supervisor"
            },
            {
               "gender": 2,
               "credit_id": "58596859925141594101b23e",
               "name": "Bernardo Bertolucci",
               "profile_path": "/vu7dxDDRRjytIfGuQxDYj1eJULa.jpg",
               "id": 4956,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 9.48404,
      "production_countries": [
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "DE",
            "name": "Germany"
         },
         {
            "iso_3166_1": "FR",
            "name": "France"
         }
      ],
      "id": 8416,
      "vote_count": 165,
      "budget": 750000,
      "overview": "A weak-willed Italian man becomes a fascist flunky who goes abroad to arrange the assassination of his old teacher, now a political dissident.",
      "similar": [
         4909,
         6637,
         2501,
         2503,
         186,
         612,
         637,
         101,
         787,
         1538,
         242,
         9453,
         1948,
         95,
         657,
         667,
         682,
         707,
         156022,
         121856
      ],
      "original_title": "Il conformista",
      "runtime": 113,
      "poster_path": "/hIjOdQW7vRHjK3VBEYC3fRTfi52.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         },
         {
            "name": "Latin",
            "iso_639_1": "la"
         },
         {
            "name": "普通话",
            "iso_639_1": "zh"
         }
      ],
      "production_companies": [
         {
            "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
            "name": "Paramount",
            "id": 4,
            "origin_country": "US"
         },
         {
            "logo_path": null,
            "name": "Mars Films",
            "id": 819,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Marianne Productions",
            "id": 1497,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Maran Film",
            "id": 1627,
            "origin_country": ""
         }
      ],
      "release_date": "1970-10-21",
      "vote_average": 7.7,
      "belongs_to_collection": null,
      "tagline": "Bertolucci's Masterpiece about Sex and Politics",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Italy",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Bernardo Bertolucci"],
      "runtime": 111,
      "synopsis": null,
      "writers": [
         "Alberto Moravia",
         "Bernardo Bertolucci"
      ],
      "originalLanguage": "Italian",
      "imdbLink": "http://www.imdb.com/title/tt0065571/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1NDMzODYyNV5BMl5BanBnXkFtZTcwMzE2NTY0MQ@@._V1_SY317_CR6,0,214,317_AL_.jpg",
      "actors": ["Stars: Jean-Louis Trintignant, Stefania Sandrelli, Gastone Moschin | See full cast and crew »"],
      "reviews": [
         "American film audiences have rarely had the opportunity to view Bernardo Bertolucci's The Conformist in its original widescreen, non-dubbed theatrical release version. Although a restored print of the film has recently been shown at American film festivals, The Conformist remains unavailable on DVD. Its faded, butchered, and dubbed VHS/laserdisc release is long out-of-print, just about impossible to find, and a desecration not worth viewing in any case. Fortunately, I happened to view (and videotape) a widescreen, non-dubbed print of the film shown some years ago on a cable premium movie channel. No film lover should pass up an opportunity to see this film in any form approaching the director's intentions. A comparison of Bertolucci's The Conformist with the novel by Alberto Moravia from which it was adapted illuminates much about the ambitious style and structure of the film. For instance, Bertolucci chose not to follow the novel's omniscient point of view. Instead, he uses the intensely subjective and heavily unreliable point of view of the story's main character, Marcello (Jean-Louis Trintignant), a child of decadent aristocracy who embraces fascism, not from ideological commitment but from a desire to blend in with his social surroundings. Bertolucci also structures the film's plot in a non-linear manner rather than emulating Moravia's chronological narration. This strategy yields a film equivalent of the modern novel's characteristic \"stream-of-consciousness\" technique, whereby the inner workings of Marcello's mind, his desire for \"normality\" at all costs, are plumbed in a fragmented series of recollections held together by psychological association rather than direct cause and effect. Bertolucci's approach transforms Moravia's rather conventional, socio-political novel into a much more intimate and complex psychological study of the protagonist. The film's subjective point of view emotionally intensifies the formative and revealing experiences of Marcello's life such as his encounter as a young man with a male seducer, his shamed alienation from his parents, his deliberate courtship of and marriage to a shallow bourgeois young lady, and his ambivalent relationship with his anti-fascist former professor and the professor's liberated, bisexual wife. Two plot alterations from the novel are also worth noting. One is in the manner and location of the assassination of the professor and his wife, which occurs much more matter-of-factly in the novel. Bertolucci changes the setting to an isolated, snow-covered stretch of countryside where Marcello witnesses the execution and, by doing nothing to prevent or protest it, becomes morally complicit in the act. A second change involves the plot outcome for Marcello himself. Whereas in the novel Marcello and his family are killed by Allied bombing while attempting to flee Rome, the film's ending is much more open and ambiguous. Technically, The Conformist's indisputably brilliant cinematography, directed by Vittorio Storaro (Apocalypse Now), combines with some of the finest low budget set decoration in film history to poetically evoke a 1930s European setting that seems simultaneously real and surreal. Such scenes as the blind persons' ball, Marcello's meeting with his father in a stadium-like insane asylum, his walk through the Italian fascist government building, and the justly famous low-angle shot of blowing leaves are either hauntingly lyrical or startlingly nightmarish or, often, lyrical and nightmarish simultaneously. Many shots in the first two thirds of the film are skewed by slightly oblique camera angles to suggest that we are seeing a reality shaped by Marcello Clerici 's selective, distorting memory. This visual style radically shifts once the climactic assassination takes place and Marcello's consciousness is absorbed entirely into the film's present time. George Delerue's musical score and other elements of the soundtrack also greatly enhance the wonderfully nuanced mood shifts within and between the complex narrative strains of the plot. Quite simply, The Conformist is an unforgettable masterpiece of the highest order.",
         "Bertolucci's \"Conformist\" must not be missed if it shows up at your local art/independent movie theater. Indispensable for its photography and visual style alone -- credit legendary DP Vittorio Storaro, best known for his work on The Godfather films and Apocalypse Now -- the film delivers with a ferocious punch on a remarkable number of levels. Dense and often difficult, yet leavened with unexpectedly beautiful and humorous touches, \"The Conformist\" functions primarily as an indictment of Fascism and its adherents. But deeper threads run deeply through the picture; it is an examination of one man's attitudes towards the value of patriotism, love, family, marriage, sex and death, and, as has perhaps been overstated (by both the critics and perhaps the film-maker) it also explores the ramifications of homosexual repression. Bertolucci expertly manages to weave these themes into a hypnotic, occasionally surreal experience that has served as an inspiration for countless directors. Performances are brilliant throughout. Dominique Sanda is one of the most engaging and sensual women to ever grace the screen. See this film, and you will simply wish to see it again.",
         "As many have noted, the technical aspects of this film --the cinematography in particular-- are quite striking and sometimes beautiful. Unfortunately, the work as a whole isn't as equally developed, especially the script; as a result the viewer is overly-conscious of Bertolucci's Important Message, to the detriment of the whole film. There are many scenes that are visually wonderful; for example, when the antihero Marcello, the Conformist of the title, visits his syphilitic father in a sanitarium. Bertolucci set the scene in the midst of fascist-era monumental architecture for a very surreal effect. However, Marcello's father isn't real at all--he's a mannequin propped up by Bertolucci to represent the Corrupt Old Political Order. The viewer isn't allowed to make his or her judgment about the character--apparently Bertolucci doesn't trust his audience enough-- so the demented father blurts out a confession about torturing people. Bertolucci has a POINT and in case you're too stupid to get it, he'll make it crystal clear. I found that annoying, and a constant problem in the film. Yes, the art direction in the scene is wonderful; but the dialog is so bad the viewer becomes conscious of Bertolucci's manipulations. It's off-putting. Bertolucci is equally ham-handed when he deals with one of the central metaphors of the film, Plato's analogy of the cave from the Republic. This, supposedly, was the subject matter of Marcello's thesis as a young philosophy student under his once-admired Professor Quadri, whom the older, Fascist Marcello has been assigned to assassinate. It's laughable to suggest that any philosophy student would write a thesis on the cave analogy and have it taken seriously by a professor; yet Professor Quadri spouts nonsense about Marcello's promise as a young student. The cave analogy is the biggest cliché in Western philosophy. For film students, imagine proposing to your doctoral supervisor a thesis on the significance of Rosebud in Citizen Kane, and you get the idea. Bertolucci trots out this tired old nag to beat it to death once again with absolute seriousness. I couldn't help but roll my eyes. If Bertolucci had philosophical pretensions for this film, he should have enough sense to make it believable. This isn't. Bertolucci compounds his mistake by accenting the significance of the cave analogy with visual cues: the opening and closing of shudders. Overall, it signifies a sophomoric philosopher become too-clever film director. Bertolucci isn't satisfied with just philosophical ambitions for his story--it has to be Freudian, too. Early in the film, the audience sees in flashback a young Marcello, dressed as a dandified schoolboy, pursued by a harrying pack of boys. They trap Marcello and proceed to remove his knickers until they are interrupted by a passing chauffeur, whom we later learn to be Lino. Lino befriends Marcello, they play together in scenic parts of Florence, and then --sigh-- Lino invites Marcello into his apartment to see his gun, in both the literal and, I'm afraid, the metaphoric sense. In case you didn't miss it, this is a PHALLIC SYMBOL. Lino caresses Marcello until Marcello panics and begins firing the gun wildly, hitting Lino in the head and apparently killing him. This is Marcello's CHILDHOOD SEXUAL TRAUMA, which is clearly offered by Bertolucci as an explanation for his compulsive need as an adult to conform. Throughout the rest of the film, Bertolucci drops hints that Marcello is a closeted homosexual. He's sexually awkward with his attractive wife, but he compensates by engaging in casual sexual bragging with other men. He's attracted to Professor Quadri's wife, but the attraction is more fascination with her sexual liberation (she's bisexual) than with her. In several scenes there is noticeable sexual tension between Marcello and Manganiello, his Fascist spy partner, including an extended embrace. Manganiello isn't very bright, so he doesn't get it, but it's hard for the audience to miss. The payoff for all this Freudian subtext comes at the end of the film. Marcello meets his friend Italo in the streets of Rome while both of the them are trying to avoid capture by vigilante anti-Fascist mobs. The two of them pass by an older man and a younger man engaged in a conversation. Marcello overhears the older man obviously trying to seduce the receptive younger man with promises of food. Marcello suddenly recognizes the older man as --surprise!-- the chauffeur/pederast Lino, who didn't die after all. Marcello realizes that he isn't a murderer, and thus all of his attempts to conform to society were unnecessary. In a rage, he loudly denounces Lino as a Fascist, a homosexual and (naturally, according to the blunt psychology of Bertolucci) the murderer of Professor Quadri. Lino flees; Marcello turns his rage toward a panicky Italo, and denounces him as a Fascist, too. Italo is swept away in a celebrating crowd of anti-Fascists, leaving Marcello alone with the younger man. The final shot of the film pans over the naked backside of the younger man/male prostitute as he reaches from a bed to hand-crank a Victrola playing romantic music. Marcello sits against a nearby fence with his back to the younger man and the camera, then slowly turns head to gaze back at the male prostitute. Fade to black. This plot device is amateurish at best. Hitchcock handled Freudian themes (think Psycho) with a bit of irony and made them more believable and thus enjoyably creepy. In contrast, Bertolucci explores the Freudian theme of Marcello's repressed homosexuality with all the subtlety and seriousness of a first-year university student. As a character, Marcello is forced to conform to a psychological type, and that makes him less believable. Again, despite the visual dexterity of the film, I became very aware of Bertolucci's manipulation of the audience. Sexual repression is BAD and leads to Fascism. Oh, please. This is a film worth watching because of the beautiful images. Do yourself a favor: ignore the plot and Bertolucci's annoying intellectual pretentiousness. Turn off the subtitles and the dubbing, and you'll spare yourself some disappointment.",
         "I recently watched this film in my Italian cinema class and I believe it is one of the greatest films ever. Not only does Bertolucci mix elements of film noir and haunting surrealism, he is able to express his obsession with the illusion of reality. The film is based on the eponymous novel by Alberto Moravia, and although I have not had the pleasure to read it, I hear the film does not stray from the plot of the novel. Of course Bertolucci puts a spin on the chronology of the plot; allowing us to first see the film 2/3 into the plot, we weave back and forth between the protagonist's childhood, his admittance into the Fascist party and then finally the present. The film follows Clerici's quest for normalcy and acceptance, since he views himself as abnormal and an outcast from society. If it means he must marry the airhead giulia (his ticket to bourgeois life) he will. He tries to conform to society, and in doing so joins the Fascist party: the epitome of ideological conformity. The film is essentially about shadows in the cave, and the scene in which he meets up with his former professor is a direct allusion to Plato's myth. We see Clerici's shadow on the wall as professor Quadri recounts the myth. Clerici has been living his life, unable to exit this cave. He sees only shadows on caves, and instead of realizing they are merely shadows, lies, illusions, he remains imprisoned, like the prisoners in plato's cave. When the professor opens the window and light streams into the room, we believe this illumination will open Clerici's eyes. But he has failed to accept things that have happened in the past, and therefore is unable to grow up. He does not overcome his violent tendencies (he will take part in a conspiracy to kill Quadri since Quadri is an anti-Fascist in order to gain acceptance into the Fascist party) and lives forever boxed in that cave. The professor fails to illuminate Clerici because he is not the ideal Platonic hero: has abandoned Rome when the Fascist regime begins to rise and leaves his Italian followers to their own devices. He has not been a hero of the resistance, preventing others from joining the ranks of such a disillusioned ideology because as Clerici states: \"You left and I became a Fascist\". Some have questioned the scene between a 13 year old Clerici and the homosexual chauffeur named Lino. Some one said why does he have sex and then shoot him? First of all, Lino propositioned him, an act of sodomy never occurred. Second, at 13, Clerici (like most budding pre-pubescents) was probably intrigued and curious and then immediately ashamed by the so-called \"deviance\" of homosexuality. He shoots him because he becomes enraged in his attraction to Lino and seeks to punish he who almost set off his unknown erotic impulses. This crime will never leave him as he then sees he must atone for this sin by committing another: hence the murders of the Quadri and his wife (although she is not originally part of the conspiracy). Italo, his blind friend, is an ideologue, the embodiment of Facist theory. It is appropriate that he is blind, because those who followed the regime were blind and disillusioned. When they walk together down in the ranks of the coliseum, Clerici will once again place the blame on someone else for his crimes by accusing Italo of Fascist allegiance.",
         "This is one of few films in which every artist's performance peaks and falls into place: Trintignant (Z (1969), le Secret (1974)) at his best, Bertolucci's best picture so far, and Vittorio Storaro's best cinematography (besides Apocalypse Now). Their cooperation seems to pay off very well (Novecento (1976), Last Emperor (1987)) as they apparently enhance each other's work. With their brilliance they almost turn Marcello into a hero, while he is actually an anti-hero in this non-linear story. It's not only an entertaining personal tragedy, it's also a political thriller with very distinctive music. I couldn't imagine life without Il Conformista anymore (like Amarcord and some other masterpieces). Always beautiful, never sentimental: poetic from minute to minute. The compositions, lighting and camera-movements made me breathless: I've never seen so much poetic power in one film. Watch for instance the camera's movement to behind the tree when Manganiello searches for Marcello in the small park @ 68 min. And for instance the hand-held scene near the end. Or the camera placements when Marcello comes approaches his mother's house. Actually the entire film is a big poem. See for yourself :-) I was lucky enough to see this one in a theater just two months after seeing it first (dec 2000). If you have the chance, go see it on a big screen. If you like the looks of this you will probably like 'Una giornata particolare' (1977) and 'Amarcord' (1974) too. Why o why can't we vote 11 :(",
         "What is most amazing about The Conformist is it's cinematography and angles. Director Bertolucci and Cinematographer Storraro have created a masterpiece of form by using light, camera angles, and character positioning. The architecture dwarfs the characters as they try to make sense of their existence during Italy's fascist period (1930's). They are placed theatrically at times creating a balance of space. The Conformist is the most stunning film visually I have ever seen. Every scene is immaculate, kind of surreal, almost to rich for the senses to take in one viewing. The story is somewhat difficult on the first viewing but one can figure the basic plot line. It is a story about repression and oppression, about nationality, political beliefs during a paradigm shift. It is about acceptance and avoidance. It is about playing it safe in a time of tension. The final scene suggests what the main character might have become had he chose the truth. It is left up to us to judge him and realize that it is sort of a catch 22; either way, he would have ended up in that dark place where a fascist country would mentally place same sex love. See this film to see the potential of the beauty of film. Conform or not to Conform? That is the Question.",
         "Forget Last Year at Marienbad, which is wonderful (and deliberately empty), this is the epitome of the pompous art-film. If you can get past the masterful photography (most don't) you'll find a chilly, inert, over-dramatic, hopelessly literal movie that defies any attempts to think about it. Every scene just underscores the obvious moral pronouncement about conformity that you got in the previous scene. There isn't a single pretty composition that delivers a point; it's the epitome of bowling over viewers with production design. If you want me to believe your movie has ideas, don't make it so superficial. If you're a viewer who craves ideas, you're going to starve watching this. It's absolutely facile despite continued accusations of depth. The visuals have stuck in my head for two decades, not so for the clumsy, unartful script, or any of its vapid content. Structurally, it's absolute mush; Trintiganant takes so long to execute his orders that any of his conspirators could (and do) eventually just do it themselves. The surface activity is prolonged just long enough to be called a film. This movie adds up to zip - It is nothing to me. I'm with Jonathan Rosenbaum who wrote: \"In retrospect, Bernardo Bertolucci's highly influential fifth feature (1969)--ravishing to the eye but less than fully satisfying to the mind--can be regarded as the lamentable turning point in an extremely promising career that ultimately chose stylishness over style and both over content.\" I would guide your attention instead to Amarcord which directors have been ripping off for thirty years.",
         "I realized that three of my favorite films got something in common. Their protagonists dressed impeccable suits and wear hats too:J.J. Gittes in Chinatown(1974);Marcello in 8 ½(1962);and Marcello Clerici in Il Conformista(1971) also this actors seem to be in a kind of crossroad or in an emotional conflict , in appearance they look impassible. Our man,Clerici( played masterly by J.L. Trintignant) is an elegant,attractive man.He is serious and reflexive.He wants to know the significance of normal/normality.He asked to his best friend,Italo(who is also gay and blind) Who is a normal man? \"a normal man is one who turns his head to see a beautiful woman's bottom. The point is not just to turn your head. There are five or six reasons. And he is glad to find people who are like him, his equals. That's why he likes crowded beaches, football, the bar downtown-\" Maybe we can find `normality' in disappointment or boredom. Our man,the conflicted Marcello carries inside him a terrible guilt.Something he experienced during his childhood,a trauma always present in his mind(the audience are aware of this through flashbacks) Being an adult and Fascist in the tumultuous Europe of the 30s,Marcello has A STRANGE MISSION:To visit (in Paris) his former university professor, Quadry(who is an anti- fascist) and to be part of his murder/complot, but, is he capable to do that?.Besides this,Marcello has a relationship with two opposite woman;his child/woman wife,Giulia(Stefania Sandrelli)and Quadry's wife,Anna(Dominique Sanda,what a presence!)He feel in love with this sophisticated intimidating blond,\"I'm hostile because I'm sincere\"! Anna says to Marcello and she's right. I was impressed during the scene in that French forest covered with snow.Especially when the woman (she is outside) shout at Marcello(He is inside the car) through the car's window. He staring at her in shock. Then the persecution into the forest.Chilling!. Vittorio Storaro Cinematography is superb.An example? Notice when Marcello enters the palace to see the Ministry.He walks up the stairs and his shadow's projection on the floor diminish.Or when Marcello is at Quadry office he argues Plato's Myth of the Cave,he closed one of the two windows,the room is half dark shadows on the wall appear but Quadry re-open the window and Marcello's shadow disappears almost as a ghost or illusion. Note:Being an Actress should be as difficult as being an Astronaut.In this time anybody is a movie star.This film presents a example of how a true Actress should act or move:Dominique Sanda was not like today Movie Actresses(She had personality and sexuality at the same time) and we'll never see someone like her for a long time.",
         "Brilliant adaptation (and improvement) of the Moravia work, with the entire structure revolving around Plato's Republic added by Bertolucci. As a meditation on both tyranny and the tyrannized, it is unsurpassed in cinema. The center of the film explicitly discusses the cave image in the Republic (the topic of Marcello's abortive thesis when he was Quadri's student). But that is not all: a reading of the immediately relevant sections of the Plato will make it obvious that it provided Bertolucci with a stream of imagery for the film. A reading of the entire work will reveal an even greater stream, largely taken from the discussions of tyranny and the tyrannic man (who, like the philosopher, is the same both dreaming and awake). In turn, this all ties in nicely with both Spider's Stratagem and Before the Revolution, among others of his films.",
         "Story of a weak-willed Italian man (Jean-Louis Trintignant) who is ordered, in 1938, to assassinate his one-time professor. He is ordered by a Fascist organization he joined to become normal, to conform (he's gay and ashamed of it). He takes his annoying wife (Stefania Sandrelli) with him...only to find his professor has married a former love of his (Dominique Sanda). Can he kill them both? This film is just riveting. The story is never boring and full of some very intriguing people. The acting is superb--especially by Trintignant who you see holding his fear and indecision inside and Sanda who is unbelievably sexy...and dangerous. I don't know much about politics so I'm not going to discuss that. But this film is a must-see for the incredible cinematography by Vittorio Storano and masterful direction by Bernardo Bertolucci. The sets are exquisite--every single one looks incredible and is beautifully lit and shot for maximum impact. Sometimes I was just so caught up in the visuals I lost track of the story! Every shot is filled with rich symbolism. My favorite sequence was at a dance hall when Trintignant is \"caught\" in the dance. Also some prints are missing a 10 minute \"Dance of the Blind\" that was cut from original prints. It's no loss--it adds nothing to the story. Quite simply one of the most beautiful films I've ever seen with a strong, intriguing plot. A powerful must-see film. A 10 all the way."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Mars Film",
         "Marianne Productions",
         "Maran Film"
      ],
      "summaries": [
         "This story opens in 1938 in Rome, where Marcello has just taken a job working for Mussollini and is courting a beautiful young woman who will make him even more of a conformist. Marcello is going to Paris on his honeymoon and his bosses have an assignment for him there. Look up an old professor who fled Italy when the fascists came into power. At the border of Italy and France, where Marcello and his bride have to change trains, his bosses give him a gun with a silencer. In a flashback to 1917, we learn why sex and violence are linked in Marcello's mind.",
         "A weak-willed Italian man becomes a fascist flunky who goes abroad to arrange the assassination of his old teacher, now a political dissident."
      ],
      "budget": 750000
   },
   "movielensId": 2925,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Italiano",
         "Latin",
         "普通话"
      ],
      "releaseDate": "1970-10-21",
      "dvdReleaseDate": "2006-12-05",
      "directors": ["Bernardo Bertolucci"],
      "runtime": 113,
      "movieId": 2925,
      "title": "The Conformist",
      "mpaa": "",
      "actors": [
         "Jean-Louis Trintignant",
         "Stefania Sandrelli",
         "Gastone Moschin",
         "Dominique Sanda",
         "Enzo Tarascio",
         "Fosco Giachetti",
         "José Quaglio",
         "Pierre Clémenti",
         "Yvonne Sanson"
      ],
      "imdbMovieId": "0065571",
      "originalTitle": "Il conformista",
      "genres": ["Drama"],
      "youtubeTrailerIds": ["gZAd71lg6YQ"],
      "plotSummary": "A weak-willed Italian man becomes a fascist flunky who goes abroad to arrange the assassination of his old teacher, now a political dissident.",
      "tmdbMovieId": 8416,
      "avgRating": 4.00879,
      "releaseYear": "1970",
      "numRatings": 1024,
      "posterPath": "/hIjOdQW7vRHjK3VBEYC3fRTfi52.jpg"
   }
}