{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "baltimore",
            "id": 2672
         },
         {
            "name": "integration",
            "id": 6713
         },
         {
            "name": "racial segregation",
            "id": 6984
         },
         {
            "name": "detention",
            "id": 15299
         },
         {
            "name": "woman played by man",
            "id": 165567
         },
         {
            "name": "cross cultural relations",
            "id": 165576
         },
         {
            "name": "interracial love",
            "id": 165577
         },
         {
            "name": "cult classic",
            "id": 165580
         },
         {
            "name": "interracial friendship",
            "id": 165583
         },
         {
            "name": "fashion model",
            "id": 167200
         },
         {
            "name": "drag",
            "id": 171636
         },
         {
            "name": "1960s",
            "id": 208992
         },
         {
            "name": "dance show",
            "id": 236336
         },
         {
            "name": "big hair",
            "id": 236337
         },
         {
            "name": "ratted hair",
            "id": 236338
         }
      ],
      "imdb_id": "tt0095270",
      "video": false,
      "title": "Hairspray",
      "recommendations": [
         14269,
         14262,
         14267,
         14195,
         30650,
         30645,
         53380,
         11592,
         47658,
         25625,
         12606,
         409447,
         9066,
         11855,
         13702,
         171910,
         334328,
         20242,
         12714,
         44347
      ],
      "backdrop_path": "/p0JB7mNeQGlgS5ARB49iSAR3vMX.jpg",
      "revenue": 6671108,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Franklin von Tussle",
               "gender": 2,
               "credit_id": "52fe43ec9251416c750232ff",
               "name": "Sonny Bono",
               "profile_path": "/jwmPgJ43LPGnx2PtMU4SkIgDABg.jpg",
               "id": 67949,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Motormouth Maybelle",
               "gender": 0,
               "credit_id": "52fe43ec9251416c75023303",
               "name": "Ruth Brown",
               "profile_path": "/apVBr2IGrEzh85MaiieM5JAjn0h.jpg",
               "id": 67950,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Edna Turnblad",
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023307",
               "name": "Divine",
               "profile_path": "/A3uiSXlOpCJ5ycYO0TGZ0YF9VRT.jpg",
               "id": 10369,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Velma Von Tussle",
               "gender": 1,
               "credit_id": "52fe43ec9251416c7502330b",
               "name": "Deborah Harry",
               "profile_path": "/pASovJqjDaaHGs08jQs9FBOuWW6.jpg",
               "id": 102,
               "order": 3
            },
            {
               "cast_id": 14,
               "character": "Tracy Turnblad",
               "gender": 1,
               "credit_id": "52fe43ec9251416c75023345",
               "name": "Ricki Lake",
               "profile_path": "/y0nbFpKzWKLkziM9rZYYRUqciyn.jpg",
               "id": 70233,
               "order": 4
            },
            {
               "cast_id": 15,
               "character": "Wilbur Turnblad",
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023349",
               "name": "Jerry Stiller",
               "profile_path": "/wyleNpBLMLZ9CNjl13hNB8zoFIa.jpg",
               "id": 26042,
               "order": 5
            },
            {
               "cast_id": 16,
               "character": "Amber von Tussle",
               "gender": 1,
               "credit_id": "52fe43ec9251416c7502334d",
               "name": "Vitamin C",
               "profile_path": "/wc8GqQacvxBvqsijjPTSiy3zBdg.jpg",
               "id": 62521,
               "order": 6
            },
            {
               "cast_id": 17,
               "character": "Link Larkin",
               "gender": 0,
               "credit_id": "52fe43ec9251416c75023351",
               "name": "Michael St. Gerard",
               "profile_path": null,
               "id": 95090,
               "order": 7
            },
            {
               "cast_id": 18,
               "character": "Seaweed",
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023355",
               "name": "Clayton Prince",
               "profile_path": "/mXgiQQcl1Lb7e1RbWwaZUhTZjje.jpg",
               "id": 176655,
               "order": 8
            },
            {
               "cast_id": 19,
               "character": "Tammy",
               "gender": 1,
               "credit_id": "52fe43ec9251416c75023359",
               "name": "Mink Stole",
               "profile_path": "/ew1Ro2VvDR1YjaJAvO7ZjTNe7oK.jpg",
               "id": 9292,
               "order": 9
            },
            {
               "cast_id": 20,
               "character": "Corny Collins",
               "gender": 2,
               "credit_id": "52fe43ec9251416c7502335d",
               "name": "Shawn Alex Thompson",
               "profile_path": null,
               "id": 106482,
               "order": 10
            },
            {
               "cast_id": 21,
               "character": "Beatnik Cat",
               "gender": 0,
               "credit_id": "52fe43ec9251416c75023361",
               "name": "Ric Ocasek",
               "profile_path": null,
               "id": 219809,
               "order": 11
            },
            {
               "cast_id": 22,
               "character": "Beatnik Chick",
               "gender": 1,
               "credit_id": "52fe43ec9251416c75023365",
               "name": "Pia Zadora",
               "profile_path": "/ps2IeR7nylV8NjbmHUFMLEztR57.jpg",
               "id": 21992,
               "order": 12
            },
            {
               "cast_id": 23,
               "character": "Prudence Pingleton",
               "gender": 0,
               "credit_id": "52fe43ec9251416c75023369",
               "name": "Joann Havrilla",
               "profile_path": null,
               "id": 5701,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023311",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023317",
               "name": "John Waters",
               "profile_path": "/4foU1kJ24CJwz2RVZgyc7oxMs4i.jpg",
               "id": 10367,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 1,
               "credit_id": "52fe43ec9251416c7502331d",
               "name": "Sara Risher",
               "profile_path": null,
               "id": 13668,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023323",
               "name": "Robert Shaye",
               "profile_path": "/ylgPcVcvDAZ9IykvDVN4894cEJh.jpg",
               "id": 13663,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43ec9251416c75023329",
               "name": "Rachel Talalay",
               "profile_path": "/cGgfRMtgDiE17ThIliBqksMDknS.jpg",
               "id": 56891,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ec9251416c7502332f",
               "name": "Kenny Vance",
               "profile_path": null,
               "id": 67951,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43ec9251416c75023335",
               "name": "David Insley",
               "profile_path": null,
               "id": 59370,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 1,
               "credit_id": "52fe43ec9251416c7502333b",
               "name": "Janice Hampton",
               "profile_path": null,
               "id": 16534,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "52fe43ec9251416c75023341",
               "name": "Charles Roggero",
               "profile_path": null,
               "id": 67952,
               "department": "Editing",
               "job": "Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Family",
            "id": 10751
         },
         {
            "name": "Music",
            "id": 10402
         }
      ],
      "popularity": 10.199557,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 11054,
      "vote_count": 134,
      "budget": 2000000,
      "overview": "Ample teen Tracy Turnblad wants nothing more than to be on the hip local TV dance program, \"The Corny Collins Show\" -- and when her dream comes true, her lively moves and bubbly personality meet with unexpected popularity. But after witnessing firsthand the terrible state of race relations in 1960s Baltimore, Turnblad becomes an outspoken advocate for desegregation.",
      "similar": [
         403,
         381284,
         399055,
         50014,
         2976,
         692,
         409447,
         16367,
         14269,
         14267,
         47107,
         162494,
         451394
      ],
      "original_title": "Hairspray",
      "runtime": 92,
      "poster_path": "/awlcy51BoQxqxI6M6hqaQyUeEDj.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Pусский",
            "iso_639_1": "ru"
         }
      ],
      "production_companies": [{
         "logo_path": "/iaYpEp3LQmb8AfAtmTvpqd4149c.png",
         "name": "New Line Cinema",
         "id": 12,
         "origin_country": "US"
      }],
      "release_date": "1988-02-16",
      "vote_average": 6.8,
      "belongs_to_collection": null,
      "tagline": "The world was in a mess... but their hair was perfect!!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["John Waters"],
      "runtime": 92,
      "synopsis": null,
      "writers": ["John Waters"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0095270/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTczMTc2NzYzM15BMl5BanBnXkFtZTYwNzI1OTc5._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Sonny Bono, Ruth Brown, Divine | See full cast and crew »"],
      "reviews": [
         "As a HUGE fan of John Waters films, I have nothing but praise for this film. So fun, so campy, so enjoyable ( and you know...there IS a real plot inside the film. It's not just music and hair! ) The characters are at once silly and loveable, esp. Divine as Edna Turnblatt. And who can't love Ricki Lake as the voluptous teen sensation, Tracy Turnblatt!?! It's such a great movie. The one liners alone make me howl, as well as the great 60's look they were able to COAT the film with ( like hairspray? ) The clothes, the furniture, the makeup, EVERYTHING. Stellar pseudo B-movie casting ( Debbie Harry, Sonny Bono ). It's a favorite!!!",
         "Easily John Waters' best flick in terms of writing, direction, and mainstream appeal, it still has great little twisted touches like the rat Tracy kicks mid-makeout with her boyfriend, & her witchy rival's inevitable barf scene at the amusement park her bigoted parents (played by rock stars Sonny Bono and Debbie Harry) own. There's a strong undercurrent about race relations in 1962 Baltimore where the story is set, highlighted by Mrs Pingleton (Joanne Havrila)'s moronic descent into a black neighborhood to 'rescue' her daughter Penny from the arms of her black boyfriend Seaweed & be ridiculed by the residents. This is crosscut with the sheer exhilaration that Tracy & Penny are having dancing with their beaus in a black record shop down the street. Divine is hilarious as both Tracy's mom and the racist owner of the television station which hosts the Corny Collins 'American Bandstand' clone. And the music is fabulous early rock'n'roll, all Brill Building & pre-Motown soul stuff like Lesley Gore & Chubby Checker, with wonderful choreography throughout.",
         "I saw it when it first came out, I've seen it several times since, and my last viewing was just a few weeks ago. It never seems flat or old. It takes a look at an issue that doesn't necessarily seem to be a goldmine of laughs (racial difficulties in the early '60s) and turns it into just that without robbing it of any dignity or sense of importance. John Waters seems to have pulled out all the stops to insure this outcome, and it really paid off. The \"pleasingly plump\" pre-talk show Ricki Lake turns in a great performance in a role that's an inspiration to \"chunky\" girls everywhere. As always, Waters picks cameo and supporting actors that are dead-on perfect. His own turn as a psychologist is an absolute scream! Brimming with hysterical lines and set-ups, this is a comedy you need to see, if you haven't already.",
         "This has to be without a doubt my favourite movie. There are probably better but none that I have enjoyed as much. Its perfectly cast and well written. Ricki Lake, Divine, Vitamin C and of course Debbie Harry all shine. It deals with such a sensitive issue thats still relevant today (prejudice) in an easily digestable and engaging way. I love the dances and the whole feel of this movie. Its one you love or hate and I definatly love it! 10/10",
         "Ricki Lake plays Tracy Turnblad, a short, chubby teen with big hair who loves to dance in \"Hairspray,\" a 1988 John Waters film starring Divine, Deborah Harry, Sonny Bono, Ruth Brown, Jerry Stiller, and Mink Stole. \"Hairspray\" has now been immortalized on Broadway as an enormous, energetic, fabulously entertaining musical which kept the conceit of a man playing Tracy's mother, again with great success. \"Hairspray\" is highly exaggerated in parts, which makes it extra funny, and Waters captures '60s Baltimore beautifully. Corny Collins, who is the Baltimore Dick Clark, would like nothing better than to integrate his television show, but blacks are only permitted to dance one night a week. The van Tussles are for segregation - that would be Sonny Bono, running for office, his wife Harry (on stage the former Miss Baltimore Crabs, in the film Miss Soft Crab). Harry's hairstyles are fantastic - HUGE - her last hairdo is in the form of an enormous loving cup. When Tracy's friend Penny takes up with the son of an outspoken black woman, Motormouth Mabel (Ruth Brown), her hysterical mother has her kidnapped and put in the hands of a psychiatrist (Divine as a man) who tries to torture her to stop liking black men. It's so outrageous it's funny, and that's where Waters shows his talent. When Tracy gets a contract modeling for a plus-sized woman's shop, the owner's live ad on Corny's show begins, \"Tubby, tubby, 2 x 4, can't get through the kitchen door.\" It's this madcap treatment that keeps any of this from being remotely offensive. All the performances are delightful, and there's a nice turn by Pia Zadora as a black-haired beatnik chick. \"Hairspray\" has a lot of warmth that emanates from Tracy and the Turnblad family, and the mood stays upbeat throughout the entire film as the characters dance through life, Tracy with an overlay of blonde hair over her dark flip. Great music, great fun. \"Hairspray\" in any version is wonderful.",
         "Hairspray both this version and the new 2007 one are a pair of great satirical films about teenage mores in the early Sixties of the Civil Rights Era. Sometimes our heroes and heroines for civil rights and human decency can be found where you least expect. Such a person is Tracy Turnblad played by later television host Rikki Lake who's a full figured gal in every sense of the word. Her biggest desire growing up in Baltimore of the Early Sixties is to get on the local teen hop show hosted by Corny Collins. The regulars who dance there have a celebrity status, but something a fat girl dare not hope to dream. Tracy doesn't hope, she lives the dream and actually gets picked to dance and be a regular to the distress of plastic teen princess Colleen Fitzpatrick. But it's a cause for celebration for Tracy's parents played by Divine and Jerry Stiller and her best friend Leslie Ann Powers. All this is against the background of the civil rights era and Baltimore had its problems also. The Corny Collins show is segregated with a prescribed Negro Day once a month. That seems as bogus to Tracy as baseball being segregated not too long ago and she joins the fight to integrate the show. She's even convinced her teen dream new boyfriend Michael St. Gerard to join in as well. A subplot is Powers finding love herself in the person of Clayton Prince who is black and that's upsetting to a lot of people, not the least is Powers's mother. It would be within that same decade that the Supreme Court did away with miscegenation laws, so these kids are running some real risks. Hairspray is a very funny film with a very serious message about live and live. In fact that's the main problem with the world today right now, certain people feeling they've got the right through religion or secular philosophy or plain out and out wealth who just feel they've the right to dictate the lives the rest of us are supposed to lead in conforming to how they see the world. In the remake of Hairspray, Queen Latifah who plays Ruth Brown's role of Motormouth Mabel says to the characters playing the Powers and Prince roles that as a racially mixed couple that those young people should be prepared for a whole lot of stupid in the world to deal with. One cast member of this version of Hairspray had occasion to deal with a whole lot of stupid back in 1994. In the cast he's listed as Keith Douglas, lead singer of the Lafayettes DooWop group, but he was Keith Douglas Pruitt, a talented musician, actor, and composer. He and his partner were attacked by a trio of suburban rednecks who were dismayed at seeing two members of the same sex holding hands on Waverly Place. Keith sustained a fractured skull and a hearing loss for a while looked to permanently impair his career in music. It was in my working days with New York State Crime Victims Board that I met Keith Pruitt. I did the claims for both he and his partner, giving them what my agency could provide for both of them. He did go back to work eventually to the applause of his friends and admirers of his work. Keith Pruitt died only a week ago at the age of 47. He left a legacy in art, but he also left a legacy in life as a genuine hero. One who certainly never started out to be one, but things are thrust upon us in life sometimes. He stood up to the homophobic bigots and bashers with dignity and pride. I'm really proud I knew him and was part of his story in a small way. And so this review of Hairspray is dedicated to Keith Pruitt, someone we can all emulate in life.",
         "John Waters reveals a somewhat more sentimental side with \"Hairspray\", a movie several people have told me they absolutely hated. I wondered what it was about Waters' style as a filmmaker that could provoke such anger? I think it's his affection for '60s movie-clichés transposed through nostalgia and Waters' own gross-out sensibilities (and his particular brand of humor, which can be quite wicked). I didn't much care for the film the first time I saw it, but I gave it a second chance and it grew on me. The reckless amateurishness is off-putting at first, but you have to meet \"Hairspray\" halfway. There is much to enjoy here, not the least of which is Divine as Ricki Lake's mom (and also as a bigoted network bigwig); wheeling and dealing after her daughter finds TV fame, Divine becomes a coiffed society queen, twisting away in front of the television and tossing off jaded quips like, \"It's the times...they're a-changin'.\" The performances are all happily hammy, colorful and amusing, and the lightweight story comfortably shoehorns-in relevant political issues to counterbalance the slapstick. Ricki Lake is very appealing in her debut; also hilarious, Pia Zadora as a beatnik and Debbie Harry as the mother of Lake's main rival (\"1-2-cha-cha-CHA, 1-2-cha-cha-CHA!\"). It's not a seamless, polished picture, but it does have heart and charm and this sold me--but on the second time around. *** from ****",
         "After an abomination like 'Pink Flamingos' it was a surprise for me to learn that this guy had talent. Like Spike Lee or Oliver Stone, you've got to admit that John Waters, like him or not, is a born moviemaker. Also like those two (and ultimately all great directors) he knows how to speak with his own voice and translate his vision to the screen. His writing is most impressive here as he manages to point up the evils of racism and segregation while not abandoning his wacked-out comedic style. And his eye for period detail is uncanny (as long as the period wasn't too long ago!) 'Hairspray' is great entertainment, fun to watch and edifying, too. Who would have thought that?",
         "Wow, I was sure surprised by this film! If you've seen any of John Waters' earlier films, then this movie is a major shock because in so many ways this movie seems very,....normal and even uplifting!! This, coming from the same director was delighted in nauseating his audiences or shocking their sensibilities!! HAIRSPRAY, despite being funny and unusual in many ways, is actually a very family-friendly and endearing film! These are certainly NOT the sort of things I thought I'd say about a Waters film. I like his offensive and mondo-bizarro-type films, but after viewing HAIRSPRAY I realize that I like the direction this film took. Sure, it's extremely sentimental and \"nice\", but the film is so dog-done fun and has such a decent central message that it's something I highly recommend to the kids! Surely this CAN'T be the same John Waters who produced the X-Rated FEMALE TROUBLE!! Well, believe it or not, it is and Waters has actually gone \"mainstream\"! Wow,...next I'll see pigs fly! I initially avoided this movie because I had seen a few small glimpses of it and thought it looked too tame and a trifle boring. However, I am so glad I forced myself to try it again. The film has absolutely everything going for it--infectious music, a great style and love of the time period, a lot of great laughs, a strong socially-conscious message and a lot of characters you can't help but love. The most shocking thing about the film to me, though, was that Divine played a very wonderful and touching mother! Despite his/her great size, she loved her daughter, Tracy, and her husband and seemed like a pretty typical housewife--despite actually being a guy in drag. Divine also played a male role as an ultra-racist jerk and it was fun seeing him in dual roles (which he also did in FEMALE TROUBLE when he made love to the female version of himself, believe it or not). Ricki Lake played one of the more wonderful characters of a teen I have ever seen. Despite being very overweight, she was the type of kid I would love to have as a daughter--being very self-confident and decent through and through. It was also great seeing the plus-size Lake dancing very credibly in the film. In fact, I loved her dancing and the songs--you can't help but snap your fingers and enjoy them. What I particularly liked about her character was that Tracy knew she was fat but didn't care, and as a result, those around her accepted her. In particular, the cutest guy in the film fell for her and could look beyond her weight. I know this isn't exactly like real-life, but it's sure how I wish life was and it is so great to see a non-neurotic fat and happy girl on film. All too often, they are either ignored completely (such as the unwritten \"no one above a size 6 allowed on the film\" rule), or shown as pathetic or tortured (like in the excessively pointless and cruel French film, FAT GIRL). Since it really is a John Waters film, despite all the nice and wonderful things, there are also the usual strange supporting characters as well. The best examples are Ric Ocasek (lead singer from The Cars) and Pia Zadora as the drugged-out beatnik couple that have very little to do with the movie's plot. But there are also appearances by Debbie Harry (from Blondie), Jerry Stiller, Sonny Bono and a few others who bounce in and out of the film. Strange casting, by the way is THE one constant in all Waters films. Now for the plot, despite the whole emphasis on huge hair and doo-wop music, there is actually a deeper story that has substance. Ricki Lake (Tracy) has just become a regular on a local dance show (similar to American Bandstand, but set in Baltimore). She's an instant local celebrity and adored, but despite this, she cannot ignore that Black people are never allowed on the show with White kids--even though the music all has roots in the African-American culture. When her dippy friend (Penny) begins dating a nice Black man, Tracy cannot just ignore the segregation even though it would have been the safest thing for her to do in the early 60s where the movie is to have taken place. This leads to perhaps the funniest portion of the movie. Although there is a strong message of tolerance and racial togetherness, it is handled in a very funny tongue-in-cheek manner. When Penny and the gang go to a Black neighborhood in Baltimore to learn more about the local dance scene, her mom assumes Penny is going to be murdered! When this hysterical woman chases them into the \"ghetto\" and then behaves like she is going to die, it is a laugh riot!!! Every time a Black person comes near her, she assumes she's going to die. When a hobo asks for a quarter, she gives him her purse and begs him not to kill her!!! It's so over-the-top, it's a great way to attack racism caused by ignorance. It gets even better when Waters himself plays a quack psychiatrist that tries to hypnotize and torture Penny into giving up dating a Black man! Despite how it sounds, this is not offensive but subversively funny! Overall, it's rare that I enjoy a movie as much as I liked this one. And when it was over, I felt great--and that makes this a truly special movie. UPDATE: I just saw the movie again and, begrudgingly, I must admit that I actually like the remake better. It did seem to have an energy level and polish that made it just a 'hair' better.",
         "It is hard to believe that we are celebrating the 20th anniversary of this film this week. It is even harder to believe that just one week after it opened Divine left the world's stage forever. But, the star of the show was Ricki Lake in her first year as a film actress. She camped up John Water's script and delivered an enjoyable musical movie with a message that is just as important today as it was 20 years ago. It was really interesting seeing people like Sonny Bono, Blondie, Jerry Stiller, Pia Zadora, and, of course, writer/director John Waters himself. A goofy satire that is just as good today as it was then."
      ],
      "genres": [
         "Comedy",
         "Music",
         "Romance"
      ],
      "productionCompanies": [
         "New Line Cinema",
         "Stanley F. Buchthal",
         "Robert Shaye Production"
      ],
      "summaries": [
         "'Pleasantly Plump' teenager Tracy Turnblad achieves her dream of becoming a regular on the Corny Collins Dance Show. Now a teen hero, she starts using her fame to speak out for the causes she believes in, most of all integration. In doing so, she earns the wrath of the show's former star, Amber Von Tussle, as well as Amber's manipulative, pro-segregation parents. The rivalry comes to a head as Amber and Tracy vie for the title of Miss Auto Show 1963.",
         "A 'pleasantly plump' teenager teaches 1962 Baltimore a thing or two about integration after landing a spot on a local TV dance show."
      ],
      "budget": 2000000
   },
   "movielensId": 2926,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Pусский"
      ],
      "releaseDate": "1988-02-16",
      "dvdReleaseDate": "2002-11-05",
      "directors": ["John Waters"],
      "runtime": 92,
      "movieId": 2926,
      "title": "Hairspray",
      "mpaa": "PG",
      "actors": [
         "Sonny Bono",
         "Ruth Brown",
         "Divine",
         "Deborah Harry",
         "Ricki Lake",
         "Jerry Stiller",
         "Vitamin C",
         "Michael St. Gerard",
         "Clayton Prince",
         "Mink Stole",
         "Shawn Alex Thompson",
         "Ric Ocasek",
         "Pia Zadora",
         "Joann Havrilla"
      ],
      "imdbMovieId": "0095270",
      "originalTitle": "Hairspray",
      "genres": [
         "Comedy",
         "Family",
         "Music"
      ],
      "youtubeTrailerIds": ["fdKTHL0PMGw"],
      "plotSummary": "Ample teen Tracy Turnblad wants nothing more than to be on the hip local TV dance program, \"The Corny Collins Show\" -- and when her dream comes true, her lively moves and bubbly personality meet with unexpected popularity. But after witnessing firsthand the terrible state of race relations in 1960s Baltimore, Turnblad becomes an outspoken advocate for desegregation.",
      "tmdbMovieId": 11054,
      "avgRating": 3.31976,
      "releaseYear": "1988",
      "numRatings": 3856,
      "posterPath": "/awlcy51BoQxqxI6M6hqaQyUeEDj.jpg"
   }
}