{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prisoner of war",
            "id": 1968
         },
         {
            "name": "vietnam",
            "id": 2956
         },
         {
            "name": "vietnam war",
            "id": 2957
         },
         {
            "name": "aviation",
            "id": 10168
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "torture chamber",
            "id": 10772
         },
         {
            "name": "pow",
            "id": 11103
         },
         {
            "name": "woman director",
            "id": 187056
         }
      ],
      "imdb_id": "tt0176093",
      "video": false,
      "title": "Return with Honor",
      "recommendations": [],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f4c3a36847f8182257",
               "name": "Everett Alvarez",
               "profile_path": null,
               "id": 223809,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818225b",
               "name": "Ron Bliss",
               "profile_path": null,
               "id": 223810,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818225f",
               "name": "Fred Cherry",
               "profile_path": null,
               "id": 223811,
               "order": 2
            },
            {
               "cast_id": 1020,
               "character": "Narrator",
               "gender": 2,
               "credit_id": "52fe48f5c3a36847f81822a1",
               "name": "Tom Hanks",
               "profile_path": "/pQFoyx7rp09CJTAb932F2g8Nlho.jpg",
               "id": 31,
               "order": 3
            },
            {
               "cast_id": 1003,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182263",
               "name": "George Day",
               "profile_path": null,
               "id": 223812,
               "order": 4
            },
            {
               "cast_id": 1004,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182267",
               "name": "Jeremiah Denton",
               "profile_path": null,
               "id": 223813,
               "order": 5
            },
            {
               "cast_id": 1005,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818226b",
               "name": "Jerry Denton",
               "profile_path": null,
               "id": 223814,
               "order": 6
            },
            {
               "cast_id": 1006,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818226f",
               "name": "Paul Galanti",
               "profile_path": null,
               "id": 223815,
               "order": 7
            },
            {
               "cast_id": 1008,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182273",
               "name": "\tDouglas Hegdahl",
               "profile_path": null,
               "id": 223817,
               "order": 8
            },
            {
               "cast_id": 1009,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182277",
               "name": "Sam Johnson",
               "profile_path": null,
               "id": 223818,
               "order": 9
            },
            {
               "cast_id": 1010,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818227b",
               "name": "Tom Madison",
               "profile_path": null,
               "id": 223819,
               "order": 10
            },
            {
               "cast_id": 1011,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe48f5c3a36847f818227f",
               "name": "John McCain",
               "profile_path": null,
               "id": 223820,
               "order": 11
            },
            {
               "cast_id": 1012,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182283",
               "name": "John McGrath",
               "profile_path": null,
               "id": 223821,
               "order": 12
            },
            {
               "cast_id": 1013,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182287",
               "name": "George McKnight",
               "profile_path": null,
               "id": 223822,
               "order": 13
            },
            {
               "cast_id": 1014,
               "character": "",
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818228b",
               "name": "Kevin McManus",
               "profile_path": null,
               "id": 223823,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182291",
               "name": "Freida Lee Mock",
               "profile_path": null,
               "id": 223825,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f8182297",
               "name": "Terry Sanders",
               "profile_path": null,
               "id": 201165,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f818229d",
               "name": "Christine Z. Wiser",
               "profile_path": null,
               "id": 223827,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f81822a7",
               "name": "Terry Sanders",
               "profile_path": null,
               "id": 201165,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe48f5c3a36847f81822ad",
               "name": "Freida Lee Mock",
               "profile_path": null,
               "id": 223825,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [{
         "name": "Documentary",
         "id": 99
      }],
      "popularity": 0.775348,
      "production_countries": [],
      "id": 56235,
      "vote_count": 3,
      "budget": 1000000,
      "overview": "The story of U.S. fighter pilots shot down over North Vietnam who became POWs for up to 8 and a half years.",
      "similar": [
         1369,
         13,
         858,
         141,
         634,
         1368,
         227306,
         242224,
         112160,
         437557,
         297762,
         43923,
         18221,
         27586,
         2771,
         9587,
         3134,
         11236,
         10735,
         5781
      ],
      "original_title": "Return with Honor",
      "runtime": 101,
      "poster_path": "/8tDiA2fbYvOIGPmgWynTYn6WEEe.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1999-06-11",
      "vote_average": 5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": "http://www.pbs.org/wgbh/amex/honor/",
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "Freida Lee Mock",
         "Terry Sanders"
      ],
      "runtime": 101,
      "synopsis": null,
      "writers": [
         "Freida Lee Mock",
         "Terry Sanders"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0176093/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQ5MTUyNDI3NV5BMl5BanBnXkFtZTcwODY1NzgyMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Everett Alvarez, Ron Bliss, Fred Cherry | See full cast and crew »"],
      "reviews": [
         "Men face the camera and recant their prisoner of war ordeal over thirty years ago yet their voice and mannerism do not betray any animosity nor cry for retribution. Instead there is humility and a surprising resilience and sanity you would hardly expect from men isolated and tortured by North Vietnamese soldiers, some for as long as eight years. The remarkable film, \"Return With Honor\", chronicles in no uncertain terms about the strength of the American character and the steadfastness to pride and dignity then and now, embodied in young cadets schooled at the Air Force Academy. It is a tale of young, determined airmen who leave their families behind to fight a war they hardly understood. Their missions are already known to the Viet Cong and they become easy prey to enemy fire. Those who survive are marched around unceremoniously as war propaganda. One black airman is singled out for dishonor so as to break the morale of fellow black soldiers fighting in South Vietnam while another pilot, highly publicized in the cover of \u0091Time Magazine' is made to look utterly powerless. They are put in the tombs of the \u0091Hanoi Hilton' where their spirits are broken by their own torture as well as the horrific screams of the fellow pilots. Imprisoned, they learn to fight back. They develop their own communication with a 5x5 alphabetic code and their leaders, Risner, Denton, and Stockdale stand steadfast in their code of honor. Upon realization that they will not go home soon, they develop a shield epitomized by \u0091tough luck' - getting use to confinement. One man builds a house in his mind and repeatedly goes over the specifications while another memorizes all the squalor and humiliation that he will later painfully sketch out on canvas. They memorize all 260 names of fellow pilots so that they can keep track of each other. They defiantly tell the world about their predicament, one blinks out in Morse Code the word \u0091torture' as he is publicly displayed, another has both his middle fingers extended even as he bows in submission, while another writes to his wife about the \u0091darkness at noon', his cryptic warning of his plight. Repeated attempts to escape only land them back in confinement with more torture while, ironically, they later refuse early release because to do so would be to return without honor. Finally with the Paris Peace Accords, they are released. One man asked for a steak and 19 fried eggs and others cannot sleep on mattresses with clean sheets because they have had only concrete and wooden boards. Yet these men, robbed of productive years of their lives, are not embittered. One learns that a survivor of Auschwitz is greeting them and states he should be greeting her. They moved ahead with their lives - one (Pete Petersen) comes back as the U.S. Ambassador to Vietnam, another (John McCain) is a U.S. Senator, another (James Stockdale) becomes a Vice-Presidential Candidate. What makes \"Return With Honor\" a great film is that no one had to act their roles to give us a remarkable portrait of courageous Americans - by their mere retelling, they speak volumes about their steadfast character.",
         "This film tells the story of people who are living in your neighborhood who were called upon to endure things that no one should have to endure and did so with dignity, humor and honor that reflects on us all. No matter what your views are about the Vietnam war or patriotism or America this story will touch you and enlarge your view of humanity in some way.",
         "I saw this film in March 1999 at the Cleveland International Film Festival, and was blown away. Remarkably candid, disturbing, and honest revelations from Vietnam veterans about their captivity and release, combined with remarkable archival footage of the prisoners from the war, made this film touching and inspiring. The directors are both previous Oscar winners, and this film shows their experience and skill in the medium. Wonderful film about a difficult topic, told by the veterans themselves.",
         "I was fortunate enough to see this film at its sneak preview in Dallas a few years ago. This is a truly great film. The POWs featured tell their amazing, inspiring stories. They describe in graphic detail the hardships they endured, and the tremendous measures they took to survive and persevere. It also tells the stories of their families waiting at home. These men exemplified the core values of our nation's military. By the end of the film, nearly the entire audience, which was almost exclusively comprised of grown men, was in tears. Every American should see this film. This film solidifies the debt we owe to so many.",
         "This won the audience award at the 1999 Cleveland Int'l Film Festival and was brought back for the Director's Spotlight on Freida Lee Mock in 2006. Like her other works, it's a quality product taking a deep look at a time/event that resonates strongly in the American psyche. The look back in time to the prisons that held our Viet Nam era POWs is done effectively, with voices of the POWs themselves over pictures of the \"Hanoi Hilton\" and other 1960's vintage Hanoi. Mock presents a powerful portrait of the prisoners, the brutality, the political wills of the times. It's not Mock's role to say that history repeats itself, for we see the same issues in 2006 in the POW issue that we see portrayed in her film. Political pawns for both sides, expendable as individuals, tools of a national leadership's will, individuals struggling to survive; it has not changed. This is an excellent companion piece to another of Mock's works, \"Maya Lin: A Strong, Clear Vision\" chronicles this architect's part in creating the Viet Nam War Memorial.",
         "Background: I saw this film ten years ago (1998). I was an associate the law firm at which one of the featured POWs, Ron Bliss, was a partner. (I knew Ron in a casual, work relationship, but had never heard his story from him. He never made a big deal of it.) So, I was perhaps pre-disposed to view the film favorably due to that relationship. Perhaps this review is colored by my recollections of the film 10 years later. Perhaps that is telling (of what stays with me after a decade). I was born in 1970, after the events documented by this film took place. Growing up in public schools in the 1970s and 1980s, I wasn't taught much (and certainly not much objectively) about the war in Viet Nam. This film blew me away. Looking back ten years, it perhaps is no surprise that it took 35+ years from the events for the story to be told in this way--removed from the passions and politics of the time, with only the human elements surviving. Trying to be apolitical, I must say that the men documented in this film are genuine heroes. Not because of the situations life thrust on them, but because of how they reacted. While I can't recall all of the details of the film, ten years after viewing it, I vividly remember (and often consider when things in my life may be difficult) one of the closing comments from one of the POWs: \"It's never a bad day when there's a doorknob on the inside of the door.\" That comment has helped me through many personal situations. Both literally and figuratively, it tells us that when we have some control over our circumstances, we have no reason to complain. I have never experienced what these men lived through, and I pray to God I never do, but I am comforted to know that the human spirit, with faith, can withstand it. Sorry to sound trite, but this this film changed my worldview. It is worth seeing. If you were born after 1968 and have any interest in history, you owe it to yourself to see this film. I am off now to find a copy on the internet so that I can show it to my kids (who were not yet born even when the film was made....)",
         "I saw this movie this afternoon (3/21/99) at the Cleveland International Film Festival, and it was an incredible film experience. It documents the real-life experiences of a handfull of real-life POW's shot down over North Vietnam. We find out what it feels like to be a hot-shot fighter pilot. We find out what it's like being a guest in the infamous \"Hanoi Hilton\" prison. We get to feel a small example of what it must have felt like to finally be released it what in some cases was over seven years of internment. Many of them were in tears. So were many movie patrons. If you can gauge a movie by the emotions it evokes, then it wins. I was beginning to forget how absurd the entire situation was; about how most of us began believing in the war and ended up hating it. A powerful film indeed!",
         "This was such a great movie. By the end of the movie, I was in tears. I just felt so proud to be an American and so very proud of two of my brothers, who served two tours each in the Vietnam War. This movie was very emotional and I felt that it showed us that we should be very proud and respect all the men and women who served over there regardless of what our opinion of the war was. And I will always remember the scene with the woman who had been in a concentration camp for over two years and the P.O.W. telling her that she should be standing in his place and that he should be thanking her. This was a very emotional film, one that I will not forget anytime soon.",
         "\"Return with Honor\" is a fascinating documentary about the men who were held prisoner at the infamous \"Hanoi Hilton\" during the Vietnam War. For me, the most compelling part of the film is that it takes the viewer into the mind-set of these men while they were there. They went into combat with their minds full of glory and honor, but they found out the hard way that war really is hell. And then when they were released, they experienced euphoria at things we take for granted, such as ice water and clean sheets. They took all sorts of torture from the guards, were humiliated for all the world to see, and yet they refused to let themselves become despondent or become indoctrinated. This is largely due to the influence of Jim Stockdale, who is not the dottering old fool he seemed to be during the 1992 Vice-Presidential debate. In this film, he comes across as a leader anyone should be proud to follow. While, in general this film is very good and very moving, there were a few minor problems. First of all, there was only so much footage of the men taken while they were prisoners. This means that during much of the film, we see the same shots of the prison as it now stands over and over again. Also, the men's stories of torture are so similar, that at times it seems like overkill when one more man tells of his ordeal. Another problem is that the perspectives of the men's wives is given short shrift, and the perspectives of their children are completely ignored. One final problem is that, in order to give the film a feel-good vibe, the domestic unrest is skimmed over and the welcome home festivities are exaggerated. Overall, I would say that a documentary of this type has been overdue to the American public for twenty-five years. While this is not the great film it could (and should) have been, it is still very good and I recommend it to anyone who knows anyone else who was in Vietnam.",
         "An incredible doc interweaving interviews with P.O.W.s with amazing footage from the Vietnam war. Interviews include Arizona Senator John McCain & Ross Perot's Veep James Stackpole. Really charasmatic storytellers and first rate production really make this movie an entirely riveting experience. How the hell did they get this footage? Very American (and patriatic film). Would have liked to heard some of the Vietnamese's perspective but after all...it is the P.O.W.'s story. Very very engaging docu"
      ],
      "genres": ["Documentary"],
      "productionCompanies": [
         "American Film Foundation",
         "Sanders and Mock Productions"
      ],
      "summaries": ["The story of U.S. fighter pilots shot down over North Vietnam who became POWs for up to 8 and a half years."],
      "budget": 1000000
   },
   "movielensId": 2930,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1999-06-11",
      "dvdReleaseDate": "2001-04-24",
      "directors": [
         "Freida Lee Mock",
         "Terry Sanders"
      ],
      "runtime": 101,
      "movieId": 2930,
      "title": "Return with Honor",
      "mpaa": "",
      "actors": [
         "Everett Alvarez",
         "Ron Bliss",
         "Fred Cherry",
         "Tom Hanks",
         "George Day",
         "Jeremiah Denton",
         "Jerry Denton",
         "Paul Galanti",
         "\tDouglas Hegdahl",
         "Sam Johnson",
         "Tom Madison",
         "John McCain",
         "John McGrath",
         "George McKnight",
         "Kevin McManus"
      ],
      "imdbMovieId": "0176093",
      "originalTitle": "Return with Honor",
      "genres": ["Documentary"],
      "youtubeTrailerIds": [],
      "plotSummary": "The story of U.S. fighter pilots shot down over North Vietnam who became POWs for up to 8 and a half years.",
      "tmdbMovieId": 56235,
      "avgRating": 3.68557,
      "releaseYear": "1999",
      "numRatings": 97,
      "posterPath": "/8tDiA2fbYvOIGPmgWynTYn6WEEe.jpg"
   }
}