{
   "tmdb": {
      "original_language": "sh",
      "keywords": [
         {
            "name": "paranormal phenomena",
            "id": 11627
         },
         {
            "name": "anarchic comedy",
            "id": 236316
         }
      ],
      "imdb_id": "tt0097223",
      "video": false,
      "title": "Time of the Gypsies",
      "recommendations": [
         21042,
         11902,
         1075,
         52556,
         20128,
         19155,
         265351,
         103785,
         49769,
         8269,
         119555,
         55971,
         71762,
         5155,
         54424,
         100215,
         41954,
         287011,
         226594,
         48119
      ],
      "backdrop_path": "/33iyJARo5t5Xb3sKfxLITlmJsJv.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Perhan",
               "gender": 0,
               "credit_id": "52fe43d7c3a368484e001673",
               "name": "Davor Dujmović",
               "profile_path": "/z8oMfJ0ulfB4wecySKnS4YFzpSI.jpg",
               "id": 85642,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Ahmed",
               "gender": 2,
               "credit_id": "52fe43d7c3a368484e001677",
               "name": "Borivoje Todorović",
               "profile_path": "/d3Go2GoaUYF7x0hdRWrLTGSimpl.jpg",
               "id": 85643,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Hatidža",
               "gender": 0,
               "credit_id": "52fe43d8c3a368484e00167b",
               "name": "Ljubica Adzovic",
               "profile_path": null,
               "id": 15269,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Merdzan",
               "gender": 0,
               "credit_id": "52fe43d8c3a368484e00167f",
               "name": "Husnija Hasimovic",
               "profile_path": null,
               "id": 85644,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Azra",
               "gender": 0,
               "credit_id": "52fe43d8c3a368484e001683",
               "name": "Sinolička Trpkova",
               "profile_path": null,
               "id": 85645,
               "order": 4
            },
            {
               "cast_id": 6,
               "character": "Zabit",
               "gender": 0,
               "credit_id": "52fe43d8c3a368484e001687",
               "name": "Zabit Memedov",
               "profile_path": null,
               "id": 15266,
               "order": 5
            },
            {
               "cast_id": 7,
               "character": "Danira",
               "gender": 0,
               "credit_id": "52fe43d8c3a368484e00168b",
               "name": "Elvira Sali",
               "profile_path": null,
               "id": 85646,
               "order": 6
            },
            {
               "cast_id": 8,
               "character": "Dzamila",
               "gender": 0,
               "credit_id": "52fe43d8c3a368484e00168f",
               "name": "Suada Karisik",
               "profile_path": null,
               "id": 85647,
               "order": 7
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43d8c3a368484e001695",
               "name": "Emir Kusturica",
               "profile_path": "/qjpI8i30Kjv9bWphOdWhVW0ldAI.jpg",
               "id": 15254,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d8c3a368484e00169b",
               "name": "Emir Kusturica",
               "profile_path": "/qjpI8i30Kjv9bWphOdWhVW0ldAI.jpg",
               "id": 15254,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43d8c3a368484e0016a1",
               "name": "Gordan Mihić",
               "profile_path": "/74vAj53ZXAcINFBLn227cH2gxaR.jpg",
               "id": 15255,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "58850c8cc3a3684ec60200b2",
               "name": "Mirza Pašić",
               "profile_path": null,
               "id": 1050004,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 2,
               "credit_id": "58850c959251410457020dfb",
               "name": "Harry Saltzman",
               "profile_path": null,
               "id": 9863,
               "department": "Production",
               "job": "Co-Producer"
            },
            {
               "gender": 2,
               "credit_id": "58850c9fc3a368064d02175f",
               "name": "Goran Bregović",
               "profile_path": null,
               "id": 53908,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "58850cbb925141045d0221a7",
               "name": "Vilko Filac",
               "profile_path": null,
               "id": 52026,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 0,
               "credit_id": "58850cc2c3a3680643023797",
               "name": "Andrija Zafranović",
               "profile_path": "/yzzuAx2gY2hwPn2js6Us4vxLBKy.jpg",
               "id": 67912,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 0,
               "credit_id": "58850cd0925141044c02255f",
               "name": "Miljen Kreka Kljakovic",
               "profile_path": null,
               "id": 21830,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "58850cd7c3a36806390222d6",
               "name": "Mirjana Ostojić",
               "profile_path": null,
               "id": 937602,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "58850ce4c3a3684f3a01cf95",
               "name": "Jelena Silajdzic",
               "profile_path": null,
               "id": 1743704,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "58850cec925141045402288d",
               "name": "Halid Redžebašić",
               "profile_path": null,
               "id": 1599493,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Fantasy",
            "id": 14
         }
      ],
      "popularity": 5.223861,
      "production_countries": [
         {
            "iso_3166_1": "BA",
            "name": "Bosnia and Herzegovina"
         },
         {
            "iso_3166_1": "IT",
            "name": "Italy"
         },
         {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
         }
      ],
      "id": 20123,
      "vote_count": 79,
      "budget": 0,
      "overview": "In this luminous tale set in the former Yugoslavia, Perhan, an engaging young Romany with telekinetic powers, is seduced by the quick-cash world of petty crime that threatens to destroy him and those he loves.",
      "similar": [
         37136,
         620,
         762,
         9696,
         11902,
         813,
         1487,
         9552,
         68,
         583,
         745,
         8469,
         4543,
         4031,
         9470,
         11072,
         794,
         11519,
         2665,
         609
      ],
      "original_title": "Dom za vešanje",
      "runtime": 142,
      "poster_path": "/eZfoihNQ46RDsLGfIJrH8hVpQhL.jpg",
      "spoken_languages": [
         {
            "name": "Bosanski",
            "iso_639_1": "bs"
         },
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [
         {
            "logo_path": null,
            "name": "Ljubavny Film",
            "id": 3719,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Kinema Sarajevo",
            "id": 44449,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Televizija Sarajevo",
            "id": 49255,
            "origin_country": ""
         }
      ],
      "release_date": "1988-12-21",
      "vote_average": 7.5,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "UK",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Emir Kusturica"],
      "runtime": 142,
      "synopsis": null,
      "writers": [
         "Emir Kusturica",
         "Gordan Mihic"
      ],
      "originalLanguage": "Romany",
      "imdbLink": "http://www.imdb.com/title/tt0097223/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTM3MjQ3NTE4M15BMl5BanBnXkFtZTcwODcwMTM2Mw@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Davor Dujmovic, Bora Todorovic, Ljubica Adzovic | See full cast and crew »"],
      "reviews": [
         "This movie shines as an example of pure art in cinema. So powerful with symbolism and story telling, \"Time of Gypsies\" delivers amazing performances on acting, settings, musical scores, and overall directing. In year 1988, this movie was one of the most awaited films in the Istanbul International Film Festival. I was one of the lucky ones who had a ticket for the film. When the show time arrived, it was obvious that there was a problem since the film did not started. A lady from the festival committee came to the stage announcing their appology and explaining what the problem was; they were expecting the copy of the film from the its distributor in USA. Unfortunately there was a logistics problem, so they had to get it directly from Yugoslavia. When the festival organisation put their Yugoslavian translators at work they did not understand which language it was! And a cleaning lady, who was an actual gypsy figured out that the movie was in Gypsy language. So it was not possible to translate it for the festival. So they offered an apology and refund in case anybody did not want to watch it without subtitles. Nobody left the theatre. We watched the movie without understanding a word. But, at the end there was a standing ovation at the theatre went on for a couple of minutes.",
         "There is no other movie that has made such a big impact on my life as this one. I remember well the anticipation and excitement I felt when I sat to watch it for the first time, that grey day in March 1989. Upon it's release \"Dom za vesanje\" was received with rave reviews in Yugoslavia, deemed as the most important movie of the Yugoslav cinema by many. And in many aspects it is. Ironically it's a gypsy movie, one of a kind in former Yugoslavia. Gypsies have been principal heroes before in important movies as \"Skupljaci perja\" and \"Ko to tamo peva\", but there never was a gypsy epic like this one before. Or after. The story begins in Slovenia, the year is not given but since the movie \"Breathless\" from 1983 is shown here, it must be mid 80's. The main character is a young gypsy (we later find out that his father was a white Slovenian)named Perhan. His family consists of the wise and shaman-like grandmother Hatidza, who is played very well by Ljubica Adzovic, hard luck gambler of an uncle Merdzan and his sick sister Danira. We follow Perhan in his quest to win the beautiful Azra, girl from the neighbourhood. Since her mother thinks little of Perhan and calls him a bastard, Perhan decides to do anything to prove himself worthy. His chance soon comes in form of a big time gypsy hustler, the so called Champion Ahmed Djida. Ahmed and his two brothers, Zef and Sadam, cruise around gypsy settlements looking to recruit potential thieves and hustlers and make money on them. Perhan is chosen because he possesses telekinetic powers and his charming character falls to Ahmed's liking. The character of Ahmed is perhaps the most interesting and complex one. First he is shown as a rogue with a heart of gold who takes Perhan under his wing and becomes like a father Perhan never had. He even offers to get Danira into a hospital and pay for her treatment. Later as we follow Ahmed and his sordid family we find out that they are nothing more than a gang of crooks looking to take advantage of the first naive youth with no money. Perhan is soon attracted to the world of petty crime and starts enjoying its' advantages. In not too long, the poor gypsy with a less than impressive appearance is turned into a fancy-looking player and charmer. When he returns home however, his grandmother is appalled at the change she sees in her beloved grandson. He has changed and it is apparent also in the way he acts towards Azra. He suspects her of whoring after he finds out that she's pregnant, even though he had slept with her before that. The splendor of their wedding is therefore shown in a negative way. Now that he has become more than accepted by everyone in his community, especially Azra's witchy mother, he is not satisfied anymore. The dream he had has vanished. He therefore decides to return to Ahmed, together with Azra. This is where everything goes wrong. No matter how much Azra tries to convince him that he is the father of their child, Perhan won't have none of it. \"We'll make our own child\" he responds harshly. All this pushes Azra over the edge and she dies after giving birth to their son in a visually overwhelming scene. Perhan casts himself into the abyss of self destruction and he doesn't even know what becomes of his son. He spends his days drinking and Ahmed shows concern, the last time we see him do this. Soon thereafter, Ahmed has a heart attack. Not long after his recovery, he vanishes and takes Perhan's share of the loot. After finding out Danira is still not cured, Perhan seeks revenge over Ahmed. One of the most touching moments is when Perhan meets his son, named after him. Acting by Davor Dujmovic is really top notch here and it's a wonder how this 19-yearold could have displayed such maturity on screen. It is a real tragedy that Dujmovic never got the chance to build a stable acting career, instead being tossed crumb parts after this. It is a mystery and a disturbing thing that such a talent could have gone neglected since. Bora Todorovic is also marvelous as Ahmed and steals most of the scenes he's in. Sinolicka Trpkova as Azra also does a fine job as well as Husnija Hasimovic who plays Merdzan. This movie is a feast for the eye for it contains a good deal of interesting and spectacular imagery and dream scenes which rank up with the best ever filmed. My favourite is Perhan's first dream, where he dreams about Azra and himself getting married. Some of the motifs are clearly borrowed from Tarkovski's \"Andrey Rublev\", yet the music and the scenery are incredible and carry a distinctive gypsy feel which is magic. That is what makes this movie a standout, for there has rarely been done a movie about gypsies in such a stunning way. Some critics have since proclaimed \"Underground\" as Kusturica's best work, but I have no doubts that this is where Kusturica topped. It was his last picture made in the former Yugoslavia and as such a magnificent farewell. The way this movie ends is really heartbreaking and leaves little hope to the viewer. But I guess Yugoslav movies rarely ever did.",
         "Dom za vesanje is not a movie that an average viewer can comprehend thoroughly, but this doesn't change the fact that it's a masterpiece. Emir Kusturica's storytelling requires some talent, intelligence, and flawless attention to follow and understand correctly, nonetheless it's absolutely unique and fantastic. I would never ever have thought I'd enjoy seeing the world through Yugoslavian gypsies' eyes, but it turned out to be possible so long as it's Kusturica who opens the window. Goran Bregovic's adorable tunes suit the movie perfectly fine too. This movie was one of those that strengthened my opinion which states European movies are a billion times better than American movies. Thanks to Kusturica and Bregovic for producing such a beauty. A perfect 10 for the cast as well.",
         "In Russia we have a fine 300 minutes (without kidding) DVD release of the movie (the \"director's cut\"?). It has its moments. The first part is hilarious and witty. The second one is absurd and insane. The third is depressing and scary. The forth is enterprising and weird. The last one is violent and tragic. To crown it all, the only reason that this feature is an outsider (it is not in IMDb top 250) seems to be the following: not many people saw it. It doesn't look like fiction. It feels quite gritty and has very adult topics. The Gypsies look and act like Gypsies (well, at least to my taste and knowledge). There was once a serial on Russian TV called \"Karmelita\", where the Gypsies were shown civilized, snobbish, stylish in their dressing, good-looking, etc. They were talking and talking (in pure Russian, of course, phonetically perfect), showing a little bit more emotion than lamas (sorry my exaggeration). Personally, very thankful to my relatives that they did not spend their precious watching that never ending fiction. The title song in that \"Gypsy\" serial was sung by Mr Nikolay Baskov (a real \"Gypsy\" with blond hair). It lasted as long as 200+ parts mixed with good portion of commercials. Instead of prolonged showing of the \"epic\" \"Karmelita\" our TV should have shown \"Dom za vesanje\". On the other hand, they would have spoiled the whole movie by pushing commercials into it. So, let the matter rest. The only really bad thing about \"Dom za vesanje\" movie seems to be the way of its DVD presentation: after the end of each part there is a kind of sketch of the next one before the credits roll over. These spoilers are not enjoyable. Still it also has some minor drawbacks. To me they are camera-work and the absence of powerful scenery shots, i.e. the lack of the contrast and the ability to see what happens in good detail. An 8 for this poesy of human existence in hellish surroundings will do. Thank you for attention.",
         "I'm glad I was bored on a Friday night and decided to browse the foreign film section. I randomly picked Time of the Gypsies, and now it is my favorite. The soundtrack, as well as the movie, is amazing. This film is unique in almost every aspect. It was moving without being too gushy or fake--I highly recommend seeing it. The other commentees have said pretty much everything else about this film in an nicely eloquent way, so I feel I need not elaborate. :)",
         "'Time of the Gypsies' is a big, full movie. It is full in the way a magic realism novel is full, with its intergenerational cast of characters; its vivid sense of place, the weather and community life, where private is always public, where joy and tragedy are inextricable; where magic, dream and delusion are indistinguishable. It is full in the Fellini sense, with its grand, often hallucinatory, set pieces; its profusion of grotesques; its bursting compression of many plots; its general noisiness. It is one film containing many simultaneous films (a gangster film; a surreal road movie; a romantic comedy; a rites-of-passage; a Christian allegory). It somehow feels a little thin, like a tapestry of chunks from a massive novel. It is certainly a prime example of retrospective dating - at the time it seemed a masterpiece; over a decade on, it's pastiche Kusturica.",
         "This is one of my most favourite movies. I don't know if I can say it was the best movie I ever saw. It's amazing to see how talented these amateur actors are and how beautiful the mis en scene is. I always thought about Time of the Gypsies as a kind of answer to the Latin American Magic Realism. Kusturica seems to know which subject requires which specific aesthetic style. The Gypsies in Yugoslavia live in their traditional world as they live in the bizarre modernity of European reality. The clash of these two worlds is what so many so called European auteur directors thematized since the 1960's. Kusturica seems to be very conscious of these art cinema tradition, but he knows also which people he portraits. The East European Gypsies are in a very essential way still nomads, constantly shifting between different realities:the world of dreams, their own traditions, their myths, rituals and beliefs and the hybrid spaces of European criminality. Kusturica portrays these Gypsy worlds with a story that is both modern but also almost like a fairy tale. It is this very mixture that makes this movie brilliant and a must see.",
         "When I see a Kusturica film, I see the magic of Fellini but with a sinister edge. His characters may be crude and immorally incorrect, but interesting enough as an observation piece that represents the madness of life. All this done through an epic journey taken by the young and shy Perhan, who discovers the crudeness of live that alters his whole believes and existence. The film plays like an opera, but without the soap, making it another Kusturica masterpiece that mixes the real with the bizarre.",
         "Surreal, amazing and absorbing, there are not enough words to explain how great this movie is. I watched it late night on ITV in London from 2am to 4am only to catch a train the next day to Kent, but i don't regreat one moment of it. Am not even going to bother telling you what the film is about, because it really is one of those stories thats best kept to oneslf. Its like a good memory you keep to yourself. I have not seen any of the other Emir Kusturica films, but i will highly recommend this movie for all those that love fantasy, film and a good story. Dom za vesanje: Approved",
         "A hauntingly beautiful, tragic, and ultimately spiritual movie. This is \"magic realism\" put to the highest use. The music is very moving. Definitely not for the usual American-Hollywood audience, but I mean that as a compliment. It has value as a documentary of the Rom lifestyle in Europe and elsewhere. There's considerable irony in the fact that Yugoslavia descended into ethnic genocide and disintegrated since this movie was made -- raising the question of what precisely is this \"civilization\" that feels so threatened by Gypsies."
      ],
      "genres": [
         "Comedy",
         "Crime",
         "Drama",
         "Fantasy"
      ],
      "productionCompanies": [
         "Forum Sarajevo",
         "Ljubavny Film",
         "Lowndes Productions Limited"
      ],
      "summaries": [
         "In this luminous tale set in the former Yugoslavia, Perhan, an engaging young Romany with telekinetic powers, is seduced by the quick-cash world of petty crime that threatens to destroy him and those he loves.",
         "In this luminous tale set in the area around Sarajevo and in Italy, Perhan, an engaging young Romany (gypsy) with telekinetic powers, is seduced by the quick-cash world of petty crime, which threatens to destroy him and those he loves."
      ],
      "budget": 0
   },
   "movielensId": 2931,
   "movielens": {
      "languages": [
         "Bosanski",
         "English",
         "Italiano"
      ],
      "releaseDate": "1988-12-21",
      "dvdReleaseDate": "2007-06-06",
      "directors": ["Emir Kusturica"],
      "runtime": 142,
      "movieId": 2931,
      "title": "Time of the Gypsies",
      "mpaa": "",
      "actors": [
         "Davor Dujmović",
         "Borivoje Todorović",
         "Ljubica Adzovic",
         "Husnija Hasimovic",
         "Sinolicka Trpkova",
         "Zabit Memedov",
         "Elvira Sali",
         "Suada Karisik"
      ],
      "imdbMovieId": "0097223",
      "originalTitle": "Dom za vešanje",
      "genres": [
         "Drama",
         "Comedy",
         "Crime",
         "Fantasy"
      ],
      "youtubeTrailerIds": ["1cyBXPMurJY"],
      "plotSummary": "In this luminous tale set in the former Yugoslavia, Perhan, an engaging young Romany with telekinetic powers, is seduced by the quick-cash world of petty crime that threatens to destroy him and those he loves.",
      "tmdbMovieId": 20123,
      "avgRating": 4.02731,
      "releaseYear": "1988",
      "numRatings": 476,
      "posterPath": "/eZfoihNQ46RDsLGfIJrH8hVpQhL.jpg"
   }
}