{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "love triangle",
            "id": 128
         },
         {
            "name": "chicago",
            "id": 520
         },
         {
            "name": "wife husband relationship",
            "id": 1157
         },
         {
            "name": "texas",
            "id": 1556
         },
         {
            "name": "field",
            "id": 4511
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "love",
            "id": 9673
         },
         {
            "name": "poverty",
            "id": 12987
         },
         {
            "name": "class differences",
            "id": 14514
         },
         {
            "name": "farmer",
            "id": 154846
         },
         {
            "name": "jealous husband",
            "id": 178977
         },
         {
            "name": "harvest",
            "id": 190061
         }
      ],
      "imdb_id": "tt0077405",
      "video": false,
      "title": "Days of Heaven",
      "recommendations": [
         3133,
         26617,
         8416,
         592,
         469,
         25188,
         17295,
         614,
         15794,
         16672,
         15244,
         11656,
         976,
         777,
         10217,
         11481,
         643,
         247,
         20108,
         2000
      ],
      "backdrop_path": "/rGWzox5V7dv6KE1gYlZAZ2sUvKJ.jpg",
      "revenue": 0,
      "reviews": [
         {
            "author": "MoHA",
            "id": "5504d2619251412c51001a8e",
            "content": "Following the story of Bill (Richard Gere), a hard working laborer in the early 19th century, Days Of Heaven is a cinematic masterpiece. Accompanied by his girlfriend, Abby (Brooke Adams) and sister (Linda Manz), Bill departs on a steam engine for a lone wheat farm in Texas for work. The journey is a long one, but director Terrence Malick makes the ride pleasant with beautiful shots of nature at its best.\r\nThe rest of the movie follows suit. Although once at the farm the labor is arduous for the three characters, they find solace in being surrounded by the natural aesthetics. Everything is made even better when Bill, against his better judgment, convinces Abby to marry the owner of the farm. Life becomes carefree.\r\nThe common thread that ties the film together is the depiction of nature. The plains of Texas are exactly that–plain. Malick is able to capture this simplicity and turn it into something extraordinarily beautiful. A common theme emerges–the relationship between humans and nature. At times the relationship can be a close one, as illustrated by the carefree frolicking through the fields. However at other times, by piecing together wide shots of the plains, Malick portrays humans as insignificant in comparison to nature.  While the two are contrasts, the two work together to form a cohesive depiction of nature. This relationship is especially illuminated by the attempt to industrialize the farm. Steam engines and massive coal powered plows stand tall over the individual farmhands. One can look at these massive machines as an attempt for man to conquer nature and assert his dominance.\r\nAdditionally, Malick is able to give nature emotion, almost as vivid as if it was an animate object. Wheat blowing back and forth in the wind while the sun shines through the clouds provides for a very melancholy and relaxed mood. The breeze is almost palpable on one’s cheek. Yet, when the massive machines arrive and the farmhands are forced to do intense manual labor, the calmness disappears. Life becomes hectic. This contrast shows the duality of nature. For every pleasant thing in life, there is a bad thing as its complement– much like heaven and hell. This is extremely apparent when Bill attempts to leave the farm for the second time. As he leaves the farmer’s residence, he hears a droning sound. Before Bill or the viewer understands what is happening, the sky opens up with locusts. The farm literally becomes engulfed in these insects coming straight out of the ten plagues. All hell breaks loose–sirens sound and hundreds of workers tried to get these locusts off the farm. All that is beautiful–the wheat, the sky, and the vast emptiness of the plains–is covered up. It is almost as if hell is covering the heaven on earth. This allegory becomes even clearer once a fire erupts. The days in heaven are clearly over as the fire cannot be contained and the beauty is physically destroyed. Following the duality in nature already established by the movie, heaven is subsequently restored. Although most of the crops are gone after the fire, the land still has an aesthetic quality to it. And although Bill and Abby never find solace after fleeing, Bill’s sister finds herself enjoying life again after reuniting with her friend. Just as it had been during the days of heaven, she is carefree again.",
            "url": "https://www.themoviedb.org/review/5504d2619251412c51001a8e"
         },
         {
            "author": "talisencrw",
            "id": "577c2337925141111d00039f",
            "content": "Outstanding. My second favourite Malick film next to Badlands. I'm not sure anyone has ever been better at photographing fire. The only other of his films I have seen thus far is 'To the Wonder', but it's films like this that make me such a lover of cinema. I'm not a Richard Gere fan in the slightest (though I have always loved Brooke Adams), but it's roles like this that cement his reputation as a cinematic icon in my books. I didn't say 'actor' because I'm not really sure that's his strength--it's more a presence, such as Alain Delon in 'Le Samourai'.",
            "url": "https://www.themoviedb.org/review/577c2337925141111d00039f"
         }
      ],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Bill",
               "gender": 2,
               "credit_id": "52fe46e29251416c75086b69",
               "name": "Richard Gere",
               "profile_path": "/hqMhNyTqIStibnhBh8SjyfpU665.jpg",
               "id": 1205,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Abbey",
               "gender": 1,
               "credit_id": "52fe46e29251416c75086b6d",
               "name": "Brooke Adams",
               "profile_path": "/9LUExxYJTTkVEtnouKAEEG1QjLu.jpg",
               "id": 69054,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Linda",
               "gender": 1,
               "credit_id": "52fe46e29251416c75086b71",
               "name": "Linda Manz",
               "profile_path": "/x7NVSgMXrfjKNUE2SiEJxbQ957l.jpg",
               "id": 3011,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "The farmer",
               "gender": 2,
               "credit_id": "52fe46e29251416c75086b75",
               "name": "Sam Shepard",
               "profile_path": "/6KincXfDKVQaRHwtX6qMUAwOsR0.jpg",
               "id": 9880,
               "order": 3
            },
            {
               "cast_id": 10,
               "character": "The Farm Foreman",
               "gender": 2,
               "credit_id": "566b0ad2c3a36833b60053f3",
               "name": "Robert J. Wilke",
               "profile_path": "/jnHaFT2LEpJHMWewNBH6w76zOoO.jpg",
               "id": 2096,
               "order": 4
            },
            {
               "cast_id": 11,
               "character": "Mill Foreman",
               "gender": 2,
               "credit_id": "566b0b10c3a3683f560048a3",
               "name": "Stuart Margolin",
               "profile_path": "/aPY5PDrURHBlZv45XXCvrijmjsx.jpg",
               "id": 41406,
               "order": 5
            },
            {
               "cast_id": 13,
               "character": "Harvest Hand",
               "gender": 2,
               "credit_id": "5699758b925141193c000336",
               "name": "Timothy Scott",
               "profile_path": "/1KXqxseXqcbkQTHvybJArdLtdbs.jpg",
               "id": 83411,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe46e29251416c75086b7b",
               "name": "Terrence Malick",
               "profile_path": "/4w0C0RaJ3qS6YZ7Ons6VZcEdfl7.jpg",
               "id": 30715,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e29251416c75086b87",
               "name": "Billy Weber",
               "profile_path": null,
               "id": 909,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe46e29251416c75086b93",
               "name": "Terrence Malick",
               "profile_path": "/4w0C0RaJ3qS6YZ7Ons6VZcEdfl7.jpg",
               "id": 30715,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "5737e36392514110a30003bd",
               "name": "Bert Schneider",
               "profile_path": null,
               "id": 8952,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "5737e36b925141125b0016b7",
               "name": "Harold Schneider",
               "profile_path": null,
               "id": 12844,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "568056e0c3a3684be300e645",
               "name": "Haskell Wexler",
               "profile_path": "/k3JSEg2tildKuFl6F6T1gLQSwgf.jpg",
               "id": 7067,
               "department": "Camera",
               "job": "Additional Photography"
            },
            {
               "gender": 2,
               "credit_id": "5737e344c3a3686f3b001bdb",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "5737e34c92514112d200164a",
               "name": "Ennio Morricone",
               "profile_path": "/tlntfyflyEHgJTFjqIgg8P8UIx9.jpg",
               "id": 1259,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 0,
               "credit_id": "5737e35cc3a36823b400519d",
               "name": "Jacob Brackman",
               "profile_path": null,
               "id": 170940,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 1,
               "credit_id": "5737e375c3a36840ec004590",
               "name": "Dianne Crittenden",
               "profile_path": null,
               "id": 1221,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "5737e37cc3a3686f3b001bee",
               "name": "Jack Fisk",
               "profile_path": "/5T0M4HdNTKkTzY7kkNYIotegJtq.jpg",
               "id": 5632,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "5737e386c3a36805ab0027f8",
               "name": "Robert Gould",
               "profile_path": null,
               "id": 6880,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 1,
               "credit_id": "5737e38f9251411322001644",
               "name": "Patricia Norris",
               "profile_path": "/gZQZwyO3fckr0qNOxTDwxEK442F.jpg",
               "id": 5634,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5737e396c3a36823b40051ae",
               "name": "Jerry R. Allen",
               "profile_path": null,
               "id": 1620076,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "5737e39ec3a36840ec0045aa",
               "name": "Les Kimber",
               "profile_path": null,
               "id": 1015356,
               "department": "Production",
               "job": "Production Manager"
            },
            {
               "gender": 0,
               "credit_id": "5737e3a69251417dd800198d",
               "name": "Bertine Taylor",
               "profile_path": null,
               "id": 1620077,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "5737e3d2c3a3686f04001d6d",
               "name": "Mel Merrells",
               "profile_path": null,
               "id": 1620079,
               "department": "Crew",
               "job": "Special Effects"
            },
            {
               "gender": 2,
               "credit_id": "5aa663210e0a263dcd007ff4",
               "name": "Charles L. Campbell",
               "profile_path": "/1MoCPekZ23I9uyq6VPFka6o9Zkz.jpg",
               "id": 9971,
               "department": "Sound",
               "job": "Sound Effects Editor"
            },
            {
               "gender": 2,
               "credit_id": "5aa66339c3a36839d5008821",
               "name": "John Wilkinson",
               "profile_path": null,
               "id": 1710243,
               "department": "Sound",
               "job": "Sound Re-Recording Mixer"
            },
            {
               "gender": 0,
               "credit_id": "5aa66364c3a36839e4008591",
               "name": "Sharron Miller",
               "profile_path": null,
               "id": 1219779,
               "department": "Sound",
               "job": "Sound Editor"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 7.852012,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 16642,
      "vote_count": 291,
      "budget": 0,
      "overview": "In 1910, a Chicago steel worker accidentally kills his supervisor and flees to the Texas panhandle with his girlfriend and little sister to work harvesting wheat in the fields of a stoic farmer. A love triangle, a swarm of locusts, a hellish fire—Malick captures it all with dreamlike authenticity, creating at once a timeless American idyll and a gritty evocation of turn-of-the-century labor.",
      "similar": [
         24420,
         339397,
         639,
         1903,
         38,
         46705,
         50546,
         116,
         51828,
         167073,
         12102,
         311291,
         9598,
         35056,
         11121,
         36630,
         1628,
         288036,
         655,
         261470
      ],
      "original_title": "Days of Heaven",
      "runtime": 94,
      "poster_path": "/rjw7tQbiBnbIeufyEt02oVickDM.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": "/fycMZt242LVjagMByZOLUGbCvv3.png",
         "name": "Paramount",
         "id": 4,
         "origin_country": "US"
      }],
      "release_date": "1978-09-13",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "Your eyes... Your ears... Your senses... will be overwhelmed.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Terrence Malick"],
      "runtime": 94,
      "synopsis": "Bill ( Richard Gere), his girlfriend Abby ( Brooke Adams) and his young teen sister Linda ( Linda Manz) are forced to flee Chicago when Bill accidentally kills the foreman ( Stuart Margolin) at the steel mill at which he works. They hop a train and eventually arrive at a wheat farm in the Texas panhandle. Bill secures work for them as sackers by lying to the foreman ( Robert J. Wilke) about prior experience. Bill and Abby pretend to be brother and sister to avoid suspicion. Although Bill squabbles with the foreman who considers his performance subpar, the three enjoy the work. The wealthy farmer ( Sam Shepard) begins to fall in love with Abby and asks her to stay with him after the harvest. Bill is jealous, but when he overhears the doctor tell the farmer that he has only a few months to live, he encourages Abby to accept his proposal. After the other itinerant workers leave, the farmer and Abby are married. The foreman is suspicious and considers Bill and Abby to be con artists, leading the farmer to send him away. The farmer, Abby, Bill and Linda spend an idyllic year on the farm, playing in the river and fields and having many picnics. The farmer's health recovers quickly, and he no longer seems near death. He treats Bill like a brother but notices that Bill has begun to grow restless and irritable. Bill realizes that Abby is beginning to fall in love with the farmer. However, she is actually torn between her love for the two men. During a visit by a wayward Italian circus troupe, the farmer begins to suspect that Bill and Abby are lovers. When Abby tells Bill this, he decides to leave the farm with the circus troup. With Bill gone, Abby, the farmer and Linda form a stable family for nearly a year. But as the itinerant farmers return, so does Bill. He tells Abby that he doesn't blame her for deciding to stay with the farmer and that he will leave them alone. But the farmer, watching them from afar, misinterprets their final embrace and realizes the true nature of Bill and Abby's relationship. But before he can confront them, locusts arrive at the farm. Bill tries to help with the efforts to burn the pests out, but the farmer attacks him. In his rage, the farmer sets his fields on fire. Bill races off into the night, and the farmer, nearly insane, ties Abby to a column on the porch. The next morning, while surveying the damage, the farmer finds Bill. When he threatens Bill with a gun, Bill stabs him and mortally wounds him. Bill takes Abby and Linda away in the farmer's car, which they later sell in order to purchase a boat. They travel down river but a posse, led by the foreman, pursues them. One morning, the police catch up to the fugitive trio. Bill is shot down trying to escape. Abby has inherited the farmer's fortune. She deposits Linda in the kind of boarding school/dance academy that she herself had dreamed of as a child, then leaves on a train with American soldiers going off the fight in World War I. An older girl ( Jackie Shultis) who Linda had befriended that first fall on the farm finds her in the boarding school. Together they run away. ----- Note to author of below: opening credits, narrators and concepts such as \"scenes\" are not part of a synopsis. It also does not include every single detail, such as one character helping another with a cigarette, or use dialog in lieu of narrative description. ------ The films opening credits portray old photos of turn of the century America with a musical theme that recurs throughout the film, Carnival of the Animals The Aquarium by Camille Saint-Saens. Outside Chicago, Bill ( Richard Gere) is shown firing up the furnace at a steel mill. He gets in a fight with the steel mill foreman ( Stuart Margolin) and accidentally kills him. He runs away. His kid sister Linda ( Linda Manz), begins narrating the story. She begins by recounting how things were that have not happened in the movie yet the days of heaven. Bill is helping his lover Abby, ( Brooke Adams) with a cigarette as he explains that things will change for them eventually they are down on their luck. The three of them hop a train to Texas, where they sit with dozens of others on the roofs of the trains boxcars. Linda explains that she met someone once who told her that someday the world will go up in flames and the good people will avoid it, but for the bad people, God don't even hear you talkin'. Everyone gets off the train and Bill quickly negotiates a job working on a wheat field for $3 per day as a sacker. He lies about his experience as a \"sacker\" to get the job. All three get jobs as laborers on the vast wheat field of a farmer ( Sam Shepard). Linda makes a friend ( Jackie Shultis) in the wheat field. The farmer checks the quality of the wheat in the field to see if its ready for harvest. Prayers are said for a good harvest. Scenes of people using farming equipment follow. Linda narrates that the farmer is falling for Abby for some intangible reason. Bill has told everyone that Abby is his sister, and gets in a fight with a field hand who suggests otherwise. Bill and Abby share a moment in the shade of a wagon. Linda is shown plucking a pheasant. There are more scenes of the harvest. The farmer is shown asking questions of one of his workers about Abby. The farm foreman ( Robert J. Wilke) comes by inspecting Bill and Abbys work and docks them $3 for wasting wheat when making bushels. Bill complains but the foreman threatens to fire him and Bill backs down. Bill is concerned about Abbys hands which are sore and rough from the work and wants to find the doctor. The men swim in a pond after the days work is done. Bill sneaks up behind the doctors wagon and steals some ointment for Abbys hands. While he behind the wagon he overhears the doctor explaining that the farmer has about a year to live. Linda narrates that the farmer knew he was going to die, and that people live only once so they should have it nice. The farmer finally speaks with Abby. She explains she is from Chicago. Linda roasts a peacock over a spit, as Bill tells her a joke: \"I saved your life today. I killed a shit-eating dog. I'm always lookin' out for you.\" Apparently a joke by comedian Redd Fox - acknowledged in the end credits in the Thanks section. Bill and Abby have a talk in a haystack. Bill explains they will eventually go to New York and this is only temporary. The harvest continues on. Linda explains if people didnt work they were shipped right out they didnt need you. They could always find someone else. The farmers accountant explains its a 6-figure harvest, his best ever. The farmer gets up and takes a look at Abby through his telescope. There are more scenes of the harvest. The farmer comes up to Abby and offers her to stay instead of going on up north. She excuses herself quickly without answering to go talk to her brother. Bill and Abby splash around in a river. Bill begins to scheme. He suggests that she tell the farmer she will stay. There is a night scene of the harvest, the very end of it. Linda asks Bill if they are going to stay and he explains its up to Abby. Linda has a conversation with her friend about a worker who she was going with who abandoned her. Linda continues to narrate about Bill getting tired of living like the rest of them, like pigs. Bill figured some people need more than they got, and others got more than they need. It was a matter of getting everyone together. A man dances on a wooden plank to a tune played by harmonica. Bill and Abby continue their discussion about staying. A night time celebration with a bonfire and music occurs. Abby tells the farmer she can stay but shes got to keep her brother and sister with her. Lindas friend says good bye and many people leave on a train similar to the way they arrived. Linda questions Abby about why she wants to stay and she explains this isnt so bad to the way she had to live earlier, wrapping cigars, never seeing the light of day. The foreman questions Linda about what they did in Chicago before. Bill explains to the farmer a half-story about how he worked at the mill in Chicago. The farmer tells Abby he loves her. Bill begins to scheme. He suggests she marry him (since he is about to die). She is reluctant. The farmer and Abby get married along the river. The foreman is a joyless best man. The farmer and Abby take off of on their honeymoon. When they get back Linda explains they all never had it so good. The rich got it figured out. All four of them have a playful meal on a gazebo. They play makeshift golf. Bill sneaks Abby out of the house one night for some play in the river and tells her he never wanted to fall in love with her. They sneak in a bit late, after the farmer has begun calling for her. Life goes on. The foreman tells the farmer he thinks they are a couple of con-artists. The farmer takes offense and they have a falling out. The foreman quits and leaves and as he drives away, he stops to tell Bill and Abby he knows what they are doing and warns them that boy is like a son to me. The farmer senses some distance from Abby. A shot of a newspaper shows that president Wilson is on a whistlestop tour. They all go out to watch his train go by. Linda narrates that the farmer wasnt getting sicker as fast as they planned. Maybe the doctor gave him some medicine. Bill and the farmer go hunting for pheasant. The farmer remarks that Bill seems jumpy. Right during their conversation a Fokker tri-plane and a Sopwith camel come into a view as a flying circus lands right in their field. just as things were about to blow says Linda. The circus brings entertainment. Bill kisses Abby one night at the gazebo but the farmer sees it. He confronts Abby later about this strange behavior with her brother. She denies anything unusual but remarks to Bill that the farmer seems more paranoid. Bill is now angry that Abby seems to be in love with the farmer. Bill who is in a bit of a huff, gets a lift from the flying circus to take care of some business. The farmer and Abby are now alone. There are loving scenes between Abby and the farmer. Linda narrates that the farmer taught her the keys on the piano, the parts of a globe. Life continues. The following spring comes. The wheat begins to ripen. Bill comes back on a motorcycle and sees Abby dancing on the porch. Later, Abby apologizes to Bill. Bill explains he regrets not knowing what he had with her, and pushing her into this plot. Bill kisses Abby on his way to leave, and the farmer sees him from up on the roof with his weathervane. He seems a bit sickened. A close-up of a two locusts on some lettuce in the kitchen is a portent of a problem. They are shown bothering the birds. Things evolve rapidly. Abby begins swatting locusts all over the house. They are shown all over the wheat. A red storm flag is hoisted, and a warning siren is sounded, and the workers pile into the field to get rid of the swarm by any means possible. The farmer out in the smoking fields is suspicious of Bill and swings his lantern at him starting a fire. The fire spreads and starts to burn the entire field. Bill and Abby are silhouetted against the fire and she says, \"He knows\". The hands desperately try to put the fire out but it burns everything. The farmer aggressively intimidates Abby up in the bedroom, throws her down and gets a gun out of his desk. He ties her hands together and calls her a liar. The next day, the farmer is riding through his burnt out fields looking for Bill and finds him fixing his motorcycle. The farmer aims a gun at Bill but bill stabs him with a leather punch. The foreman finds the dead Sam Shepard. The three of them flee. They head down river in a boat. Linda narrates that no one is perfect, youve just got half devil and half angel in you. She explains that Abby will lead a good life from now on, she blamed it all on herself. Linda talks about all the things they see on the boat ride. In parallel action, the foreman begins to track them down. Wild turkeys gobble in the forest, where Bill, Abby, and Linda have camped. Bill walks under some trees, and notices police officers at their ferry boat at the river, presumably looking for him. They spot him and come chasing after him with dogs and horses. He gets back to the tent and grabs a shotgun. He tells them to keep down and then tries to run away as he is pursued. Eventually, he makes a run along the shore line and ends up in a gunfight. He is shot and killed by one of the pursuers on horseback. In her grief, Abby sobs over Bills body as detached people on the shoreline look on. The next scene is Linda in a dancing class. Abby has enrolled her in a dance academy. We dont know exactly how much time has passed. She tells Linda shell be all right, turn around and go inside. Abby walks to the train station through a small town. Young men are boarding a train to participate in World War I which the U.S. has just gotten involved in. A band plays a tune to bid the soldiers goodbye as Abby boards the train with the soldiers. The next morning, Linda escapes from the dance academy. She runs into her friend from the fields who has a new boyfriend. He's in the Army. Maybe he'll get killed or something. I don't know. Anyway, he said I'm pretty. They race away and chat at the railroad tracks, and then walk down the rails towards an uncertain future. Linda narrates This girl, she didn't know where she was goin' or what she was goin' to do. She didn't have no money on her. Maybe she'd meet up with a character. I was hopin' things would work out for her. She was a good friend of mine.",
      "writers": ["Terrence Malick"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0077405/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTkwNTEzNTgwN15BMl5BanBnXkFtZTcwODM2MTI1MQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Richard Gere, Brooke Adams, Sam Shepard | See full cast and crew »"],
      "reviews": [
         "I can understand why Malick didn't make another movie after he made Days of Heaven. The film was panned by the majority of the critics who could only find the cinematography worthy of praise. However, Malick was hugely misunderstood by these dumb critics. They complain that the film is ponderously slow. This was the intention. Malick used pause to convey that the characters think. Too many actors rattle off their lines without letting their characters think of them. It also conveys the slow pace of their lives. Critics complain that the characters are too remote - one feels removed from them and can't get involved. Hello! It is narrated by a 13 yr old and is essentially her view of the events that transpired. Naturally she does not grasp most of the more adult moments between them and thus is herself removed from being fully involved in Bill and Abby's relationship and that is what has to come across. Then Malick, in a moment of genius, allied the four main characters to the four elements; Earth, Air, Fire & Water. Bill is Fire - he is seen at first in front of the furnaces of a foundry where he works. We can see his temper is volatile. Abby is water - in the very first shot she is scavenging(?) by a stream and she is seen against the backdrop of the river. Linda is Earth - In her narration she says that she is close to the \"Oith\". The Farmer is Air - constantly tinkering with his weather vane, and his fields of wheat are often seen waving in the wind. All in all a severely mies-judged film and the critics owe Malick a huge apology. The work is pure genius!",
         "If any movie could be called filmed poetry, this would be it. From its first opening shot to its last frame, there is such lyricism and emotion and beauty that it almost leaves you speechless. I have not seen this movie in years, but it still affects me and I want to write about it. There is a pervading sadness to the movie, like a memory of something wonderful that could have been, that should have been, that almost was, and is all the more tragic because it was in your hands but slipped through your fingers. This is not a movie for everyone, but if you believe that film can be one of the highest forms of art, this is the film to see.",
         "This is truly a unique movie: in a class by itself. I had that opinion the first time I saw it on VHS and still feel the same way years later. It's been at the top of my list of favorite movies since I began compiling a list over a decade ago. It's very dream-like, surreal, a film I never get tired of watching and I've watched this film more than any other in my large collection. If I had to pin it down to two reasons why, it would be the video and the audio. The cinematography alone makes this movie worth watching repeatedly. Now that we all have access to a widescreen DVD version of this, the scenes are even more breathtaking. (I never had the pleasure of seeing this in a movie theater.) The same superlatives can be used when discussing the soundtrack, a haunting music score that gets better and better each time one views this film. In fact, lately it's the music more than anything else I miss when I go periods without viewing this film. The story is a simple one and is explained by others here. No need to repeat it. I find the narration to be unique, an unusual insight into the characters of the film and the thoughts of the little girl (Linda Manz), who does the narrating. The characters that continually fascinate me are Brooke Adams, as the lead female, and Robert J. Wilke, as the farm foreman. I guess it's their faces that intrigue me. Adams' down-turned mouth and sad look and Wilke's wrinklies catch my attention every time. The story is interesting, generally low-key but with a few quick violent scenes that are quite memorable. More than that, one gets an incredible feel for the land and for the migrant workers of that time period. Another nice aspect of this film is the very small amount of profanity. Kids probably would be bored with this film but at least I wouldn't be afraid to show it to them. But as many pluses as the story boasts, that haunting music and those incredible visuals are what drive me back for more. Great, great stuff.",
         "Oh, I better come out and say it: I love Terrence Malick. I think he's one of the few filmmakers who has completely and utterly captured filmic form. \"The Thin Red Line\" was, to me, an astonishing experience; beautiful, horrific and the best movie of the 90s. \"Badlands\" is the best lovers-on-the-lam movie I've ever seen (it certainly makes \"True Romance\" look like a gimmicky fraud of a movie). Malick somehow manages to make everything seem painfully beautiful: his landscape, his actors, his dialogue. There's something always elegiac about his movies. There's a picture of James Dean I saw from his youth -- a baseball team photo -- and the caption said something about how it captured his face, and in it, wisdom and sadness far beyond his years. That's what Malick does in his films and particularly in this film. He must have been a fan of James Dean (probably one of the reasons he chose to make \"Badlands,\" as a sort of homage), but not in the sense that coolness comes from a perfectly combed coiffure, a red leather jacket (which it wasn't -- it was a windbreaker) and a dark brood. There's a similar story here to that of \"Giant,\" set on a farm with that remarkable house, two men and one girl. Only \"Giant\" didn't have a philosophizing and very strange little girl. It was also an overblown soap opera and while this film is, I guess, a melodrama, it certainly isn't melodramatic. If Malick is anyone in the film, he's Sam Shapard; watching his love through a lens. Malick uses Manz as a sort of channel. If this is indeed some fashion of his own story, Malick tells us through her, with he visualized by Shepard, which is a somewhat brilliant approach. Manz is strangely philosophical; at once blunt and abstract. The story is obviously centered around her -- I don't see why this wouldn't be obvious -- but she's pushed into the background, commenting on the characters and informing us like God from above. As always with Malick, his film is mesmerizing and hypnotic. I was surprised that the film was only a little over an hour-and-a-half. The great Ennio Morricone created a wonderful score for this film that seems to forebode impending doom. Unlike his more famous spaghetti western scores, it's never overly-flamboyant. And the cinematography, listed as belonging to Nestor Almendros, but well-known to be at least substantially contributed to by Haskell Wexler, is so much like an oil painting that it's just about liquid film. I'd be willing to pay a lot of money to see this one on the big screen. It might seem obvious to state that this film is a transition between \"Badlands\" and \"The Thin Red Line,\" after all it was the middle film. But this film has moments, especially in the finale, that are surprisingly close to that of \"Badlands\" and this is the film where Malick fully mastered his approach of lush, visual poetry told at a languid pace that never seems boring, since you're fully within the film;s grasp. Pauline Kael said in her review that \"the film is an empty Christmas tree: you can hang all your dumb metaphors on it.\" And Charles Taylor, always following Kael's lead (even from beyond the grave), said of Malick's two 1970s films, \"Next to the work of Altman, Scorsese, Coppola, De Palma and Mazursky from that period, they're pallid jokes.\" What never fails to get me furious is when someone viciously attacks a director, like Malick, for being self-indulgent. Of course it's self-indulgent, he's telling a story that means something to him and trying to share what he feels with us. Malick certainly isn't trying to alienate people, and if you are alienated by his films, well, don't watch them. Malick is a filmmaker like Kubrick, but more fluid and much less abrasive. I mean, if you're going to aggressively attack a filmmaker, aggressively attack someone who is aggressive on his side. Directors like Malick use abstractions to engage their audiences more fully than most. By leaving things -- often feelings -- open to interpretation, the film becomes more intimate. Certainly one of the most enduring films from the 70s, this is a masterwork. ****",
         "In merely an hour and a half, Terrence Malick does more with Days of Heaven than most directors could do in a lifetime. In this wonderful film, we see all seven deadly sins play out against one of the most incredible backdrops ever put on camera. Virtually every shot could be framed and hung on your wall as a fine piece of art. Malick even shows us he knows how to film a pheasant hunt! The story, though at times swallowed up by the cinematography, is also pretty compelling. Richard Gere is the main focus. He plays a down-on-his-luck laborer from the dirty world of pre-WW1 industrialized Chicago. After a dispute with a foreman, which we see but don't really hear, Gere kills the man and is forced to flee the area. Along with him are his girlfriend (Brooke Adams) and his kid sister (Linda Manz). The three of them hop on a train, and before you know it, they all have a jobs harvesting wheat on a seemingly boundless Texas farm. The work is difficult to be sure, but once the owner of the farm (Sam Shephard) notices Adams, things take an unexpected turn. All along, Gere has told everyone that Adams is his sister rather than his girlfriend. Shephard likes Adams enough to let the three of them stay on after the harvest is done. Gere overhears the Farmer talking to a doctor in which it is apparently revealed that he has only a year to live. Gere urges Adams to marry the farmer so hopefully the three of them will get his money after he quickly passes. Adams agrees, setting the table for nothing but tragedy and betrayal. The story is narrated by Linda Manz who plays Gere's kid sister. In her words and in her voice we hear clear evidence of just what kind of difficult lives the three of them have lived, and what a wonderful opportunity their new situation seems at first to provide. Her character is one of the most authentic that this critic has seen in a film in many years. She even has an odd beauty about her, if the camera catches her in the proper light. Notice one scene in particular when she is watching a friend jump a train and the sun is setting behind her. Gere, Adams, and Shephard are also as good as ever. It would be so easy for their performances to get lost within the aesthetic beauty of this film, yet they stand out in well-defined characters. I don't recall us ever being told Shephard's name in the film. He's only referred to as \"the farmer\". Is he really dying? We can never be quite sure. Does Adams really love Gere or Shephard? Maybe. Maybe not. There is much left to the imagination about each of these characters. Towards the end, all hell breaks loose, as you might expect. Secrets are found out, fortunes are lost, and lives are taken. The last fifteen minutes look like something out of the book of revelations, as they were most likely intended to. And for some of the characters, new lives are forged, but they are another story. And it's a story we can only imagine. Days of Heaven is a triumph on all levels. It is simply unforgettable. Certainly one of the best films this critic has seen in a long, long time. 10 of 10 stars. The Hound.",
         "\"Days of Heaven\" is a beautiful film with fantastic panoramic cinematography. It's hard to say what it is about this film that captivated me from the start. I didn't expect to enjoy it when I read about the plot. Farm workers? How could that be interesting... But oh, the haunting, heavenly silence of the fields undulating in the wind, a silence not sundered by any garish music. Everything about this film is tangible, real, alive. The dialogue is sparse, believable, the bond between Bill and Abby is one of quiet passion that needs no dramatic proclamations to fuel it. And Sam Shepard's farmer is touching. I don't use that word very often, but I'll venture it here. I have watched this film now several times, and it is a delight each time when the farmer first sees Abby. This perhaps the strongest and most believable love triangle ever put to film, and in my opinion, the most compelling.",
         "Days of Heaven (1978) **** \"Nobody's perfect. There was never a perfect person around. You just have half-angel and half-devil in you.\" This line delivered by Linda Manz in Terrence Malick's gorgeous masterpiece, 'Days of Heaven,' sums up everything you need to know about life on earth. Much of Malick's themes have been devoted to man versus nature, and the idea of perfection is not outside that realm - imperfection is the nature of mankind. Richard Gere, in his greatest performance, plays Bill, a hot headed, lower class worker, who in a moment of mistake accidentally kills his boss in a Chicago factory. We see that the boss is hassling Bill, but we never know why, we just see faces but no distinguishable voices over the roar of the factory. Bill, his sister (Manz) and his girlfriend Abby, played by Brooke Adams, take off for the panhandle, hitching a ride on a train. Bill and Abby tell everyone that they are all brothers and sisters, because as you know, \"people talk.\" They find work on a farm owned by the rich farmer, played by Sam Shepard. Many other films would make the farmer the bad guy, giving him trade mark heel characteristics, but Shepard's farmer, who we learn is dying, is soulful, and yearning for love. He see's Abby, and is interested, and eventually will ask her to stay - after Bill hears the doctor tell him he has about a year to live. They decide to stay, and after some persuasion from Bill, Abby will marry the dying farmer so that they can be heir to his fortune. Suspicions arise, and hearts and lives are broken, and the Days of Heaven will come to a halting end. The cinematography is some of the most breathtaking ever captured on film. 'Days of Heaven' could even considered a masterpiece for its aesthetic beauty alone, if the story were not so terrific. Everything about the film is magnificent. Ennio Morricone's score is haunting and beautiful. You will remember it forever, along with Linda Manz' unforgettable narration, likely one of the greatest voice overs in film history. Many have criticized Malick's distancing techniques and muted emotions. We are always kept at arms length away. But these people don't realize that the story is a memory, a memory from the real main character - Linda. Also, in a method that Robert Bresson used, by distancing us emotionally, it leaves us to add our own emotions and imaginations in the story, heightening the power of the film, as long as you are willing not to be spoon-fed what to think. Terrence Malick is a filmmaker who came out of nowhere with his talents already fulfilled, and he has not stopped since. His films are filled with such heartbreaking beauty and symbolism, and he is one of the few living filmmakers who truly are creating art, rather than just entertainment. He had one of the greatest debuts ever, in the mesmerizing and haunting 'Badlands,' the deepest and most philosophical 'The Thin Red Line,' which is likely the greatest contemporary war film (as suggested by the late Gene Siskel)and the stunningly beautiful 'The New World.' His films are deep and meaningful, and to get into the underlying symbolism and themes of them here would be pointless, and better saved for a long essay. Days of Heaven is one of the greatest, and most beautiful films ever made. Cinema is at a low point recently, but as long as Terrence Malick is still making films, we still have some heavenly art to look forward to. PS - Hopefully someone like Criterion will create a new DVD, as the current one has some soundtrack problems. Imagine seeing it restored, visually and audibly.",
         "Days of Heaven is, in fact, what its highest praisers want you to believe: awe-inspiring cinema, sometimes even mind-blowing in what can be filmed and brought forth in a beautiful, seamless mold of narrative and poetry, photographed with an eye for the prairie and fields like very few others and for the period detail. But it's also wonderful- and haunting- because it evokes what it is to look back on something and remember things vividly, clearly, with a subjectivity that is startling in its scarred interior. This is child-actor Linda Manz, her first role in what is a relatively small career, and she voices, in grungy but fine vocal, from afar at times even as she's one of the principle players. She's the kid sister of Bill (Richard Gere, a very good if not extraordinary performance compared to others), a factory worker who kills a man by accident and runs off with his girlfriend Abby (Brooke Adams), and the three of them end up working for a farmer (Sam Shephard), and soon there's a love triangle formed wrapped around an elaborate con of Bill and Abby being brother and sister. These are just the facts, but director Terence Malick isn't after just those, but after a sad look back from a perspective of wonderment and horror and a kind of fractured innocence. It goes without saying that since it is a Malick picture one will expect the painterly landscapes of the fields, those intimate close-ups with bugs and waving fields of grass. But Malick is able to put a unique vision into the perspective of that of a little girl, who is seeing and experiencing everything as it is, not as it may be really imagined or wanting to be. So there's a lot of interest already just in the nature of the farming on this panhandle in early 20th century. But there's just little things, little fantastic bits that stick in your mind, probably forever: the workers in the field toiling away; the black man tap-dancing by the barn; the airplane circus people coming by and showing silent films. Most notably, as well, are near biblical visions like the plague (and extinguishing by lots of fire) of locusts. And through all of the many, many beautiful shots, there's a tender and perfectly tragic love story played out with great work by Adams and a young Shepherd. Manz too, I might add, is excellent in a role that could have been mucked up by anyone else (also trumping a later future first-time performance in Malick's own The New World with the woman playing Pocahontas). And as if the crisp eye of Malick and his DPs Nestor Almendros and Haskell Wexler weren't enough, there's Ennio Morricone on the soundtrack to boot. Here's a crucial part of Malick's success in translating the theme of remembrance and feeling both the moment and the mood of the whole period and characters in the film (sometimes combined): just listen to the theme of the movie, used later in movie trailers and commercials, as it reckons a nostalgic tinge for something that one can't firmly grasp but is felt deeply and without really fully knowing the whole scope. Overall, Days of Heaven is almost too good, too beautiful- it's the kind of picture that defines reputations, for better or worse. Like Malick's. A+",
         "Days of heaven is exactly what this is. The magic hour (when much of the film was shot), those moments before dawn and after dusk when everything is indirect, dreamlike, breathless, heartwaking. There's no real story, as such. Sure, there's a general plot line which should satisfy any casual viewer. This isn't, after all, a hard film to follow. It is simply that the environment is the main character as opposed to the human elements. Linda Manz's young character narrates the story sporadically, like a sleepy traveler beside the campfire telling you of half-forgotten memories, and wonderful, casual observations that will seem clearer in the morning light, but no longer worth mentioning. Her voice is halting and uncertain, belying a personality that is confident in all other respects. Other actors, good (Brooke Adams, Sam Shepard) and not-so-good (Richard Gere) blend in perfectly. Their performances are so understated that you forget they are actors playing characters. Even Richard Gere, who never learned subtlety and would never again employ it, is almost invisible here. This is not a long film. For all its leisurely pace, ninety-six minutes is all it needs to tell its tale. Terrence Malick is out for sight and sound. There is nothing lost to unneeded expression, nothing not shared in the space in front of you. That leaves cinematographer Néstor Almendros with the freedom to photograph, to observe without opinion whatever seems to be happening most openly before him. When I first finished watching \"Days of Heaven\" it felt like waking from a dream. I couldn't be sure how much time has passed. It seemed so long, but the silence was the same, and little had changed outside my window. Nothing but the heavy quiet was all around me, and I felt the desperate desire to move. Everything beneath my feet felt moving, quietly slipping past and all I had to do was put soles to earth and start walking. This is a film of photographs, images of the purest sort. Open your eyes.",
         "This movie was a full and happy surprise for me. This man, Malick, stood twenty years out of business because he had to be, afterwards, after such a beautiful movie he couldn't and shouldn't return with any other thing shorter than this. Days Of Heaven is absolutely perfect cinema, the plot is not important, Malick simply wants to fill your senses and he achieves it. I haven't had the chance to watch it in a theatre, I was four years old at the time, I've watched it on television, and I understood immediately, this man is a hero for building up such a magnificent film in the United States, in Hollywood. A true director builds a universe of his own, with its own \"time flow\" and dreams and that is what Malick achieved with this film, magic, sacral art. Some sequences are \"almost\" (a big almost) Tarkovskyand this is a big commendation."
      ],
      "genres": [
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Paramount Pictures"],
      "summaries": [
         "Bill and Abby, a young couple who to the outside world pretend to be brother and sister are living and working in Chicago at the beginning of the century. They want to escape the poverty and hard labour of the city and travel south. Together with the girl Linda (who acts as the narrator in the movie) they find employment on a farm in the Panhandle, Texas. When the harvest is over the young, rich and handsome farmer invites them to stay because he has fallen in love with Abby. When Bill and Abby discover that the farmer is seriously ill and has only got a year left to live they decide that Abby will accept his wedding proposal in order to make some benefit out of the situation. When the expected death fails to come, jealousy and impatience are slowly setting in and accidents become eventually inevitable.",
         "It's 1916. Because of an altercation he has with his mill foreman, Bill, a laborer, decides to leave his home base of Chicago, and become an itinerant farm worker along with his girlfriend, Abby, and his young teen sister, Linda. Bill and Abby tell those that they meet that they are siblings if only because of the poor optics of them traveling together without being married. They head to the panhandle of Texas, where they end up working on a large wheat farm. The wealthy but sickly farmer is immediately attracted to Abby, falls in love with her and wants to marry her. Bill encourages her to marry him if only because he expects the farmer to die soon, and they would then be able to live off his wealth. Abby goes along with Bill's scheme and marries the farmer. This arrangement could have dire consequences if the true nature of Bill and Abby's relationship is discovered, and/or if Bill's Chicago past catches up with him. But a few unexpected issues arise which may further alter the on the surface harmony that exists between the three.",
         "A hot-tempered farm laborer convinces the woman he loves to marry their rich but dying boss so that they can have a claim to his fortune."
      ],
      "budget": 3000000
   },
   "movielensId": 2932,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1978-09-13",
      "dvdReleaseDate": "1999-03-30",
      "directors": ["Terrence Malick"],
      "runtime": 94,
      "movieId": 2932,
      "title": "Days of Heaven",
      "mpaa": "PG",
      "actors": [
         "Richard Gere",
         "Brooke Adams",
         "Linda Manz",
         "Sam Shepard",
         "Robert J. Wilke",
         "Stuart Margolin",
         "Timothy Scott"
      ],
      "imdbMovieId": "0077405",
      "originalTitle": "Days of Heaven",
      "genres": [
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["XVbg9xc7tGc"],
      "plotSummary": "In 1910, a Chicago steel worker accidentally kills his supervisor and flees to the Texas panhandle with his girlfriend and little sister to work harvesting wheat in the fields of a stoic farmer. A love triangle, a swarm of locusts, a hellish fire—Malick captures it all with dreamlike authenticity, creating at once a timeless American idyll and a gritty evocation of turn-of-the-century labor.",
      "tmdbMovieId": 16642,
      "avgRating": 3.95669,
      "releaseYear": "1978",
      "numRatings": 1697,
      "posterPath": "/rjw7tQbiBnbIeufyEt02oVickDM.jpg"
   }
}