{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "immigration",
            "id": 1900
         },
         {
            "name": "independent film",
            "id": 10183
         },
         {
            "name": "woman director",
            "id": 187056
         },
         {
            "name": "political prisoner",
            "id": 207901
         },
         {
            "name": "cuban refugees",
            "id": 208396
         }
      ],
      "imdb_id": "tt0114113",
      "video": false,
      "title": "The Perez Family",
      "recommendations": [
         93263,
         73247,
         60792,
         46797,
         170400,
         27444,
         37923,
         71825,
         48249,
         1793,
         19415,
         31776,
         68274,
         10034,
         50812,
         47452,
         15503
      ],
      "backdrop_path": "/56DlZzLJsTFxEXEPlZ46n22dXPc.jpg",
      "revenue": 2832826,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Dorita Evita Perez",
               "gender": 1,
               "credit_id": "52fe4697c3a368484e099033",
               "name": "Marisa Tomei",
               "profile_path": "/l87UKhZ1ethWmn8lksmLZ2LcQJ1.jpg",
               "id": 3141,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Juan Raul Perez",
               "gender": 2,
               "credit_id": "52fe4697c3a368484e099037",
               "name": "Alfred Molina",
               "profile_path": "/uJQVkqEVJGLMaJbwI2tTDlJ9Oo0.jpg",
               "id": 658,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Carmela Perez",
               "gender": 1,
               "credit_id": "52fe4697c3a368484e09903b",
               "name": "Anjelica Huston",
               "profile_path": "/Aiyv68gYWcEe9OYhyCkOa09kjmy.jpg",
               "id": 5657,
               "order": 2
            },
            {
               "cast_id": 6,
               "character": "Lt. John Pirelli",
               "gender": 2,
               "credit_id": "52fe4697c3a368484e09903f",
               "name": "Chazz Palminteri",
               "profile_path": "/d9VkmkEO50zP0kww6aLLFpu5Ovh.jpg",
               "id": 9046,
               "order": 3
            },
            {
               "cast_id": 7,
               "character": "Teresa Perez",
               "gender": 1,
               "credit_id": "52fe4697c3a368484e099043",
               "name": "Trini Alvarado",
               "profile_path": "/mBXnTuUlllTWiGbJfbkw63WxV2U.jpg",
               "id": 17187,
               "order": 4
            },
            {
               "cast_id": 8,
               "character": "Father Martinez",
               "gender": 2,
               "credit_id": "54f3b0fac3a3681deb000784",
               "name": "Ruben Rabasa",
               "profile_path": "/uKtvqVjW4gz3LGOcBldbmFE0Rtc.jpg",
               "id": 1434041,
               "order": 5
            },
            {
               "cast_id": 26,
               "character": "News Photographer",
               "gender": 2,
               "credit_id": "5737ac33925141136e00504d",
               "name": "Luis Raúl",
               "profile_path": "/1KuJHnqwa4he0HCY6CrinUCadoT.jpg",
               "id": 84182,
               "order": 6
            }
         ],
         "crew": [
            {
               "gender": 1,
               "credit_id": "52fe4697c3a368484e099029",
               "name": "Mira Nair",
               "profile_path": "/kHsDhH7maEHxmanGh0ZiFCtT5GI.jpg",
               "id": 6495,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe4697c3a368484e09902f",
               "name": "Robin Swicord",
               "profile_path": "/eNQxuumi1AGkBllHr7zCdVbCeKD.jpg",
               "id": 19852,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 0,
               "credit_id": "561ccb289251415a670038b3",
               "name": "Christine Bell",
               "profile_path": null,
               "id": 1522025,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 1,
               "credit_id": "561ccb8dc3a368226400351a",
               "name": "Lydia Dean Pilcher",
               "profile_path": null,
               "id": 38804,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "561ccba69251415a670038bc",
               "name": "Michael Nozik",
               "profile_path": null,
               "id": 2948,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "561ccbbb9251415a6b0033a8",
               "name": "Alan Silvestri",
               "profile_path": "/chEsfnDEtRmv1bfOaNAoVEzhCc6.jpg",
               "id": 37,
               "department": "Sound",
               "job": "Music"
            },
            {
               "gender": 2,
               "credit_id": "561ccbcf9251415a6e0036b6",
               "name": "Stuart Dryburgh",
               "profile_path": null,
               "id": 7262,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "561ccc049251415a670038c1",
               "name": "Robert Estrin",
               "profile_path": null,
               "id": 4141,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561ccc1ac3a368225b002f9e",
               "name": "Greg Finton",
               "profile_path": null,
               "id": 993781,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "561ccc2c9251415a6e0036c8",
               "name": "Kerry Barden",
               "profile_path": "/zb3khdNgVHerkFz4esvjSZHnbDW.jpg",
               "id": 5328,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561ccc3ec3a3682256003996",
               "name": "Billy Hopkins",
               "profile_path": "/vTGamEl7a1D93TCh165v8IyZZMG.jpg",
               "id": 3192,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 1,
               "credit_id": "561ccc51c3a3682251003b4c",
               "name": "Suzanne Smith",
               "profile_path": "/fASNhfD4Tmw6KPW0LoPUycIFxEL.jpg",
               "id": 4023,
               "department": "Production",
               "job": "Casting"
            },
            {
               "gender": 2,
               "credit_id": "561ccc68c3a3682264003527",
               "name": "Mark Friedberg",
               "profile_path": null,
               "id": 5670,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 0,
               "credit_id": "561cccb3c3a3682251003b59",
               "name": "Kenneth Hardy",
               "profile_path": null,
               "id": 1432008,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 1,
               "credit_id": "561cccc99251415a670038e1",
               "name": "Stephanie Carroll",
               "profile_path": null,
               "id": 4907,
               "department": "Art",
               "job": "Set Decoration"
            },
            {
               "gender": 0,
               "credit_id": "561ccd209251415a6b0033d2",
               "name": "Eduardo Castro",
               "profile_path": null,
               "id": 18887,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 1,
               "credit_id": "561ccd40c3a3682261003415",
               "name": "Cydney Cornell",
               "profile_path": null,
               "id": 1444908,
               "department": "Costume & Make-Up",
               "job": "Hairstylist"
            },
            {
               "gender": 0,
               "credit_id": "561ccd58c3a368225b002fca",
               "name": "Hallie D'Amore",
               "profile_path": null,
               "id": 1327149,
               "department": "Costume & Make-Up",
               "job": "Makeup Artist"
            },
            {
               "gender": 0,
               "credit_id": "561ccd79c3a368225800382a",
               "name": "Betty Bennett",
               "profile_path": null,
               "id": 1407825,
               "department": "Directing",
               "job": "Script Supervisor"
            }
         ]
      },
      "genres": [
         {
            "name": "Comedy",
            "id": 35
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         }
      ],
      "popularity": 1.492042,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 63020,
      "vote_count": 11,
      "budget": 11000000,
      "overview": "In the midst of the Mariel boat lift -- a hurried exodus of refugees from Cuba going to America -- an immigration clerk accidentally presumes that dissident Juan Raul Perez and Dorita Evita Perez are married. United by their last name and a mutual resolve to emigrate, Dorita and Juan agree to play along. But it gets complicated when the two begin falling for each other just as Juan reunites with his wife, Carmela, whom he hasn't seen in decades.",
      "similar": [
         24684,
         11421,
         112160,
         376867,
         43923,
         455,
         376660,
         27586,
         8272,
         10735,
         598,
         858,
         14,
         49519,
         11216,
         141,
         634,
         693,
         93456,
         391713
      ],
      "original_title": "The Perez Family",
      "runtime": 113,
      "poster_path": "/paSbLkZL35t2fmdxoQNHv6ckVjw.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": null,
         "name": "Samuel Goldwyn Company, The",
         "id": 28205,
         "origin_country": ""
      }],
      "release_date": "1995-05-12",
      "vote_average": 6.2,
      "belongs_to_collection": null,
      "tagline": "On the way to finding a family, she found love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Mira Nair"],
      "runtime": 113,
      "synopsis": "Cuban boat-lift refugees (Carter era) land in Miami, with different goals. The story focuses on relationships that develop under hard circumstances, with long lasting effects. Drama is real, story is clean and not predictable. Character development is adequate, actor list is 1st class. Good writing. Marisa Tomei is incredible, as usual, and her character was the most developed, but a bit predictable at some points. At times, however, it feels as though you are seeing the table of contents version only of a great novel. There was so much talent available, and so much more character development was expected. Could be editing issues. The politics both, national and international were glossed over, and made to seem insignificant, like another day in the park. The boat lift of political prisioners from Cuba, deserved way more development and insight and with the amazing cast, it was an oppurtunity lost. The end of the movie provides a twist but not so strange as to be unbelievable, but again, so much interpersonal drama was available but not included. The acting was excellent considering what the actors were given to develop.",
      "writers": [
         "Christine Bell",
         "Robin Swicord"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0114113/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTk1MTI2Nzg0NF5BMl5BanBnXkFtZTcwOTcwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Marisa Tomei, Anjelica Huston, Alfred Molina | See full cast and crew »"],
      "reviews": [
         "Alfred Molina and Marisa Tomei head up the cast of this pleasant romantic comedy about a former political prisoner and a former sugar cane farmer who leave Cuba for the United States in 1980 on what I presume to be the famous Marielle Boat Lift that brought Cuban exiles to the states (although the boat looks much smaller than it did in 'Before Night Falls'). Having the same last name, the man and the bouyant young woman pose as husband and wife (and later members of an extended Perez family) in order to gain a sponsor who will give them a place to stay and some kind of work. But, Juan (Molina) is expecting to be reunited with his wife (Angelica Houston) and grown daughter (Trini Alvarado). His traitor brother-in-law, who was responsible for the twenty years he spent in that dreadful prison, comes to the dock looking for Juan, but is told by the guard that Juan and his wife already passed through. So, Angel (the brother-in-law) is under the assumption that Juan remarried and broke his sister's heart, and now he tells his sister to forget about him. Juan, in the meantime, has no idea about the misunderstanding, but longs to be reunited with his family. However, along the way, Juan and Dorita (Marisa Tomei in a fantastic performance) build a friendship, and eventually, fall in love for each other. And his wife (Houston) similarly finds a relationship with a charming cop (Chez Palminterri). Juan and his wife, after so many years apart and finding satisfaction and closeness in relationship, they find it hard to rekindle what they once had. It isn't that they're being disloyal to each other. Despite being married, they had been away from each for more than twenty years and could not just pick up where they left off. It is a pleasant romantic comedy and has some very funny moments as well as an excellent cast, particularly Marisa Tomei, who pretty much drives the whole movie as the young Cuban female who tries to create a close family (with others similarly named Perez) and searching out something like an \"American Dream.\"",
         "Mira Nair's take on comedy is quite impressive. The director is known for her more intense and dramatic films but here she proves that she can direct a comedy. Though 'The Perez Family' isn't without its share of flaws, it is overall a funny movie with loads of laugh-out-loud moments. The film is about a group of Cuban immigrants who move to the states, one of them is in search of freedom and another in search of his family whom he hasn't seen for 20 years. While the film is essentially a comedy, Nair does tackle some issues that represent the darkness of an immigrant's life. The score is energetic and the cinematography is vivacious. The pace tends to drag in some places and near the end becomes a tad too intense. Perhaps Nair could have balanced it off by including more comic punches. The dialogues are wonderful, especially the ones between Tomei and Molina. Marisa Tomei has never looked hotter. She is both sensual and hilarious and very convincing as a Cuban wild flower. She was also excellent in the more intense scenes. Angelica Huston too displays a sophisticated sensuality and shows that she too can be funny on screen. Alfred Molina is good but not as effective as his leading ladies. Chazz Palminteri is charming. The late Celia Cruz makes a pleasantly awkward appearance. 'The Perez Family' is quite a charming and funny romantic comedy that gives us a glimpse of the hardships of immigrant life but also lots to laugh about. Would like to see Nair make more comedy.",
         "When President Carter declared an open door policy to anyone who wanted to escape Cuba and come to America, Castro used this to clear his jails of criminals and political prisoners. When Juan Raul Perez gets on the boat he hopes his wife will be there to meet him, as she fled to the US decades ago. When she doesn't come he ends up in the camp with everyone else, including the feisty Dorita Evita Perez. The two need a sponsor to get out of the camp and realise that things would be easier if they were a family. For that reason they pretend to be married and gradually start putting their fake family in place. I was drawn to this film by the cast list and in fairness I should have spotted that this film about Cubans had very few Cuban or even Latino actors in it. Anyway, aside from that the plot has historical context but I am not familiar enough with it to say if it was accurate or not, although I really don't think it matters very much. The film tries to fizzle with Latin spirit while at the same time delivering a rather convoluted romantic drama of sorts. It partly works but the writing isn't great and the film failed to really engage me as it just seemed a little forced as if it had been a good idea once but had had so many knobs added to it that it got a little daffy. After an hour it settles into the formulaic mould it was in all along, the historical context forgotten and the clichés allowed to flow. If you can't see where this is going then I salute your ability to blindly accept what is given to you. Talking of clichés, the casting of so few Hispanic/Cuban/Latino actors was a mystery to me. Surely it would have been possible to get closer than Italian, which is what quite a few of the main characters appear to be. Tomei was the name that drew me to this film but in turns her role is good and bad. She has an important role and it was necessary for her to be feisty etc but she overdoes it a little bit - hammy up her Latin cliché at the start for all she is worth; she gets better though. Molina is another strange choice but he does well in his role and carries some dignity through the film - it's not his fault that the script gets silly in trying to keep him and Huston apart. Huston is OK but her subplot seems added on to make the ending more palatable to the audience (god forbid anyone should be hurt). For this same reason, Palminteri is wasted. Cruz is good and Chowdhry is quite funny, but why Gallo even bothered is beyond me - pre-fame I suppose. SNL's Cleghorne plays a cop and, in the spirit of ethnic clichés, pushes the `oh-no-she-didn't' eye-rolling, `talk to the hand', neck moving black character for all she is worth - when she does it as a joke it is OK but here it just felt like laziness - especially for such a minor character. Overall, any Hollywood film with Latinos/Cubans/Hispanics in it is going to force the rhythm for all it is worth and here is no different. It starts out boasting historical context and spice, falls into a rather convoluted series of plot twists that end up taking the film down a rom-com road to a solution that, although badly delivered, unthinkable and out-of-nowhere, was obvious from about 30 minutes into the film.",
         "We didn't expect much from this rental that we had never heard of but ended up being delighted. Marisa Tomei was an absolute delight. Angelica Houston was different than we have ever seen her and looked very attractive. Very, very good movie with a little bit of everything you could want. Marisa Tomei was wonderful.",
         "This excellent film came out at the same time as the similar titled \"My Family.\" How interesting it always is when twin films come out that way. Sometimes one film is completely ignored, other times the two films split their limited audiences and neither really take off. Such as the case with these two films. Both were excellent films with similar marketing campaigns, but Marisa Tomei in \"The Perez Family\" is what makes this film the superior of the two. As Dottie Perez, Marisa Tomei is sizzling hot, as sexy as anything to dance across the screen in decades, and simply dissolves into her character. If Marisa Tomei won a Oscar for \"My Cousin Vinny\" (which she did), then her performance here, in comparison, deserves a Nobel Peace Prize! I dare any one, male or female, to watch this film and not fall instantly in love with every inch of her. Our entire family adores this film and Marisa Tomei's performance.",
         "Marisa Tomei is wonderful! There is a scene it which she is kneeling down in the water just as her boat arrives at Key West which is as sexy with cloth9ing as anything nude I've ever seen. ALfred Molina is great as the confused political prisoner. The story begins as Alfred Molina sends his family off to America during a crackdown of the Cuban Communists. The former dictator Batista was very kind to capitalists. The country appeared to flourish but there was much poverty. Fidel Castro came to power and many of his political opponents were jailed or killed. Marisa Tomei is a young worker in the sugar cane fields. News was difficult to come by there. When she gets to the U.S. she doesn't even know that John Wayne has died. (One of her great desires is to have sex with him) Late in his administration President Carter declared an open door policy to anyone that was able to escape Cuba. As a result, Castro cleared his jails and hospitals of many criminals and insane people. It is in the midst of THIS that Marisa and Alfred meet. He as a released political prisoner trying to find the family he'd already sent to America years earlier, she as a poor worker trying to get to a better life. In the confusion of the long line at immigration and in order to get placed with a sponsor more quickly she claims him as her husband and an old man as her father in law. For those of us who's families have been here long enough that we don't remember immigration this movie is a great reminder of why so many people have wanted to come here over the years. You really can't go wrong with this...I bought it on recommendation of a friend and watch it a couple of times a year. It is among my personal top 10.",
         "I love this movie. I remember I was seeing a play \"Ragtime\" and I wondered if an immigration movie/play existed that was not incredibly depressing and then I remembered \"The Perez Family\". It's like that excercise where a shrink tells the husband to pretend he's interested in sex with his wife and then it the feelings actually occur. Here they pretend to be a family to get through immigration and then they actually do begin to care for one another and be like a true family. I also loved how it could get a little surealistic at moments. For example when they first arrive in the Oragebowl and Juan fears they're gonna be shot and then they are suddenly surrounded by a laughing crowd. Or the moment Juan sees his wife kissing the cop and as he crushes the photo we see a red stain appear over his heart. That was so subtle I only caught it with repeated vewings. The soundtrach even is simpally amazing. And yes Marisa Tomei has never been hotter! ;-) I also loved a lot of the minor roles such as the Indian immigration official who clearly realizes what's going on and clearly doesn't care. I loved that little sarcastic eyeroll he does when he talks about, \"Cowboys . . . and Indians!\" Overall it's just such a sweet heartwarming film which is such a change from the usual \"the more depressing the more deep and artistic\" immigration film. Sure some of it was pretty silly, coincidental, and over the top but \"My Big Fat Greek Wedding\" wasn't?",
         "Well, most have summed up the story and acting pretty well, but I thought this was a beautiful film about indominable human spirit. As Tomei's character states in the beginning of the film, \"I am like Cuba: always subjugated, but never conquered\" (paraphrased). That, for me, was the theme of the film throughout. Tomei was wonderful, but I loved the subtle work from Molina and Huston.",
         "This is a cute little film starring Marisa Tomei (Wild Hogs, My Cousin Vinny) and Alfred Molina (Spider-Man 2, Frida) as Cubans who came over on the Marial boat lift in the 80s. Juan Raul Perez (Molina) is married to Carmela (Anjelica Huston), who came to America 20 years previous while Juan languished in a Cuban prison. He is stuck in an immigration facility with Dorita Evita Perez (Tomei), who is not related to him, but pretends to be his wife so they can get out. They even pick up a father and a son in their attempt at freedom. While Juan is trying to escape and reunite with Carmela, her brother, Angel (Diego Wallraff) is trying to keep them apart. Further complicating the adventure is a cop, Lt. John Pirelli (Chazz Palminteri), who is falling in love with Carmela. It is a sweet little comedy that Tomei does so well and worth spending some time with.",
         "\"The Perez Family\" can't decide what it wants to be--a romance, a comedy, or a historical documentation of a period. The story comes from a novel about Cuban refugees--and maybe the novel was effective--but this rendition of the story is undermined by a confusing tone. It seems to move from tragedy to comedy to the surreal with such alacrity and little sense of purpose that the entire film feels inconsequential. All of the actors do a fine job. But they are given a script that devalues their performances. Marisa Tomei, in particular, gives a sensual performance that is just tossed away by the schizophrenic narrative. In the end, \"The Perez Family\" feels populated by caricatures. Within this film, I think there are the beginnings of a solid serious film. And a lighthearted comedy. And a sensual love story. But misdirection, bad editing and/or bad writing have mashed them all together into a lump of confusion. I do think it is possible to blend comedy, tragedy and more in one film. For a surreal, artistic, symbolistic example (that is even a musical), see Francis Ford Coppola's \"One From the Heart\". When I think how well some of the \"Perez\" characters could fit into a story like that, it reinforces my disappointment of this film. There are parts of this film that could be very striking if they were within a coherent story. Too bad."
      ],
      "genres": [
         "Comedy",
         "Romance",
         "Drama"
      ],
      "productionCompanies": ["Samuel Goldwyn Company, The"],
      "summaries": ["In an attempt to secure a sponsor, an unlikely group of Cuban refugees become a \"family\" as the U.S. Immigration and Naturalization Service gives families priority over others. In the process, a political prisoner who hasn't seen his wife for twenty years and a disaffected sugarcane cutter fall in love. An excitable brother and a lovestruck cop contribute to the general confusion. The inevitable humorous romantic entaglements ensue as a final confrontation is set up."],
      "budget": 11000000
   },
   "movielensId": 294,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1995-05-12",
      "dvdReleaseDate": "2003-04-01",
      "directors": ["Mira Nair"],
      "runtime": 113,
      "movieId": 294,
      "title": "The Perez Family",
      "mpaa": "R",
      "actors": [
         "Marisa Tomei",
         "Alfred Molina",
         "Anjelica Huston",
         "Chazz Palminteri",
         "Trini Alvarado",
         "Ruben Rabasa",
         "Luis Raúl"
      ],
      "imdbMovieId": "0114113",
      "originalTitle": "The Perez Family",
      "genres": [
         "Comedy",
         "Drama",
         "Romance"
      ],
      "youtubeTrailerIds": ["DR7GMGA5A_U"],
      "plotSummary": "In the midst of the Mariel boat lift -- a hurried exodus of refugees from Cuba going to America -- an immigration clerk accidentally presumes that dissident Juan Raul Perez and Dorita Evita Perez are married. United by their last name and a mutual resolve to emigrate, Dorita and Juan agree to play along. But it gets complicated when the two begin falling for each other just as Juan reunites with his wife, Carmela, whom he hasn't seen in decades.",
      "tmdbMovieId": 63020,
      "avgRating": 3.17206,
      "releaseYear": "1995",
      "numRatings": 866,
      "posterPath": "/paSbLkZL35t2fmdxoQNHv6ckVjw.jpg"
   }
}