{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "casino",
            "id": 585
         },
         {
            "name": "jealousy",
            "id": 931
         },
         {
            "name": "penalty",
            "id": 2060
         },
         {
            "name": "buenos aires",
            "id": 2900
         },
         {
            "name": "tricks",
            "id": 4988
         },
         {
            "name": "patent",
            "id": 6949
         },
         {
            "name": "night club",
            "id": 10712
         },
         {
            "name": "extramarital affair",
            "id": 34094
         },
         {
            "name": "musical number",
            "id": 155707
         },
         {
            "name": "film noir",
            "id": 195402
         }
      ],
      "imdb_id": "tt0038559",
      "video": false,
      "title": "Gilda",
      "recommendations": [
         3766,
         14638,
         678,
         17058,
         14580,
         27725,
         16305,
         25955,
         11016,
         1939,
         19119,
         16227,
         15794,
         18030,
         17136,
         14554,
         17057,
         29845,
         965,
         910
      ],
      "backdrop_path": "/tCqI3EtSxVxgddWeQtyaT1rRlYf.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gilda Mundson Farrell",
               "gender": 1,
               "credit_id": "52fe43a4c3a36847f8064199",
               "name": "Rita Hayworth",
               "profile_path": "/oG6UWxpq552LN5re0TJESUGP0K7.jpg",
               "id": 33741,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Johnny Farrell",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f806419d",
               "name": "Glenn Ford",
               "profile_path": "/t6lpxAmhOrRJ22d2xnQ1uB0CJf6.jpg",
               "id": 3381,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Ballin Mundson",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641ab",
               "name": "George Macready",
               "profile_path": "/t1xXYLfj7KSn2YQ3cKJ4V5ZYoQV.jpg",
               "id": 14564,
               "order": 2
            },
            {
               "cast_id": 3,
               "character": "Maurice Obregon",
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f80641a1",
               "name": "Joseph Calleia",
               "profile_path": "/xyb6l5Epo5NXbKUXD7puhLoYca2.jpg",
               "id": 33747,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Uncle Pio",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641bb",
               "name": "Steven Geray",
               "profile_path": "/bYHgnE8wv3zXhMoZAAmZjNes7in.jpg",
               "id": 30847,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Casey",
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f80641d1",
               "name": "Joe Sawyer",
               "profile_path": "/7waP4U3fOYpqUr8jJd4qAvgWWqK.jpg",
               "id": 3341,
               "order": 5
            },
            {
               "cast_id": 14,
               "character": "Capt. Delgado",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641d5",
               "name": "Gerald Mohr",
               "profile_path": "/3CJclUBH02N3sSrWCu2gODk79hL.jpg",
               "id": 51717,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Gabe Evans",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641d9",
               "name": "Mark Roberts",
               "profile_path": "/8el65rog3QqCvEeTvqBoDLE1i0v.jpg",
               "id": 131229,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "German Cartel Member",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641dd",
               "name": "Ludwig Donath",
               "profile_path": "/eJ91hF6spm3hYihu9TOTiwpHB9W.jpg",
               "id": 34405,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Thomas Langford",
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641e1",
               "name": "Donald Douglas",
               "profile_path": "/wD8T5t6cICiWHNkKe3sbXGBbX8G.jpg",
               "id": 96257,
               "order": 9
            },
            {
               "cast_id": 23,
               "character": "Gambler (uncredited)",
               "gender": 2,
               "credit_id": "5a9b86b00e0a2605e402fa66",
               "name": "Ed Haskett",
               "profile_path": null,
               "id": 1990130,
               "order": 10
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641a7",
               "name": "Charles Vidor",
               "profile_path": "/pE9oZbia0o9MlwD914sgWYooePl.jpg",
               "id": 32134,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a4c3a36847f80641b1",
               "name": "Virginia Van Upp",
               "profile_path": "/3OiGBo99fIJscSiGO6ouZ85Fm5q.jpg",
               "id": 34369,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 1,
               "credit_id": "52fe43a4c3a36847f80641b7",
               "name": "Marion Parsonnet",
               "profile_path": null,
               "id": 34371,
               "department": "Writing",
               "job": "Screenplay"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641c1",
               "name": "Rudolph Maté",
               "profile_path": "/gEXhYXdu4yOfuiHfvdA04xGDyp4.jpg",
               "id": 11593,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641c7",
               "name": "Charles Nelson",
               "profile_path": null,
               "id": 20601,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641cd",
               "name": "Jean Louis",
               "profile_path": "/uJ2hQZlHtrMJpcigGtM6KP7svBz.jpg",
               "id": 12145,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f80641e7",
               "name": "Jo Eisinger",
               "profile_path": null,
               "id": 19966,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "52fe43a4c3a36847f80641ed",
               "name": "E.A. Ellington",
               "profile_path": null,
               "id": 1123060,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641f3",
               "name": "Hugo Friedhofer",
               "profile_path": null,
               "id": 13571,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641f9",
               "name": "Stephen Goosson",
               "profile_path": null,
               "id": 29345,
               "department": "Art",
               "job": "Art Direction"
            },
            {
               "gender": 2,
               "credit_id": "52fe43a4c3a36847f80641ff",
               "name": "Van Nest Polglase",
               "profile_path": "/11wRR3ofmyXu33rjhlrwg74zpnJ.jpg",
               "id": 11036,
               "department": "Art",
               "job": "Art Direction"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 5.871773,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 3767,
      "vote_count": 136,
      "budget": 0,
      "overview": "Just arrived in Argentina, small-time crooked gambler Johnny Farrell is saved from a gunman by sinister Ballin Mundson, who later makes Johnny his right-hand man. But their friendship based on mutual lack of scruples is strained when Mundson returns from a trip with a wife: the supremely desirable Gilda, whom Johnny once knew and learned to hate. The relationship of Johnny and Gilda, a battlefield of warring emotions, becomes even more bizarre after Mundson disappears...",
      "similar": [
         599,
         28468,
         996,
         1939,
         27066,
         283227,
         638,
         1965,
         14638,
         910,
         9962,
         3112,
         3766,
         2155,
         844,
         16958,
         17136,
         18671,
         4507,
         25508
      ],
      "original_title": "Gilda",
      "runtime": 110,
      "poster_path": "/hz2gG5D3GHaaPZUSnRNjMC3Wl1r.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Français",
            "iso_639_1": "fr"
         },
         {
            "name": "Deutsch",
            "iso_639_1": "de"
         },
         {
            "name": "Español",
            "iso_639_1": "es"
         }
      ],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1946-02-14",
      "vote_average": 7.6,
      "belongs_to_collection": null,
      "tagline": "There NEVER was a woman like Gilda!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": null,
      "directors": ["Charles Vidor"],
      "runtime": 110,
      "synopsis": "Johnny Farrell ( Glenn Ford) is in Buenos Aires playing dice with locals. Soon someone holds a gun to his head, but a man with a snappy cane helps him out and also tells him about a casino on the other side of town. At the casino, Johnny makes sure he looks his best and enters the gambling room. He watches a short man win with a late bet at the roulette table. He goes to the blackjack table and wins several hands after requesting each time to cut the deck. Two tough guys says the casino director wants to see him; Johnny tries to fight them, but fails. The director turns out to be the man with the cane and goes by the name of Ballin Mundson ( George Macready). Johnny admits to cheating, but instead of being thrown out he manages to persuade Mundson to hire him. Soon World War II ends, and there is a party at the casino. Mundson is due to leave town and leaves Johnny in charge; they have gained each other's trust. When Mundson returns he has Johnny come to his house. Mundson has brought home a woman, Gilda ( Rita Hayworth), as his wife. When Johnny and Gilda see each other it's clear that they know each other, though they don't tell Mundson. That night at the casino Johnny sees the man from earlier winning at roulette again in suspicious manner and learns that it is Mundson's way of bribing those that allow his casino to continue despite gambling being illegal. Johnny has dinner with Mundson and Gilda. When Mundson leaves the table to meet with some German men, Johnny blames Gilda for marrying Mundson for the money. Gilda dances with another man, Capt. Delgado, and even gives him her phone number in front of Johnny. Later that night Mundson reveals his suspicion to Gilda that she knows Johnny from before and warns her that she should not make any missteps. Another night at the casino we see the man from before looking for his bribe at the roulette table, but his bet is turned away. Soon Johnny finds Mundson in his office talking to the same man; the conversation is about tungsten trading, Mundson telling the man he should not be selling the metal according to their agreement. Johnny goes downstairs to get Gilda out of the way, who is again enjoying herself with another man, and he and Mundson have a drink in the bar. Suddenly there's a gunshot, it's the man with the tungsten who is out to get Mundson; he misses, but in the commotion goes into the washroom and shoots himself. Scared by the threat to his life, Mundson tells Johnny about the cartel that he runs to monopolize tungsten and control the world, and gives him the combination to the safe in his office. Later that night Gilda returns home from town with the young man, Gabe. Johnny knocks the guy over and has him leave and tells Gilda she should not make trouble with Mundson and that he will make things appear right even if she does continue to cavort with other men. One night Johnny wakes up by the sound of Gilda singing in the casino room with only the washroom attendant, Pio ( Steven Geray), as audience. She's been out again. Johnny takes her home and they tell to Mundson that they have been swimming, together. Another night the casino is having a carnival party. Two Germans come to Johnny's office and demand to see Mundson; Johnny rings Mundson. Mundson talks to Gilda about being late for the party; tension runs thick between them. At the party Johnny and Gilda dance; Gilda comes on to him, but he refuses. A man, Obregon ( Joseph Calleia), who's been hanging around the casino for weeks, tells Johnny there might be trouble. Johnny gets a message that Gilda has left and wants him to pick her up later. Soon a man is revealed to be dead behind his mask, and there is commotion. Johnny finds Mundson in his office and warns him he might be in danger. But Mundson tells Johnny to go find Gilda, then calls an airfield and makes some arrangements. Johnny picks Gilda up, and they go to the house. Gilda suggests they make use of the time alone. He goes to her room to throw her out, but ends up kissing her. They hear a sound and Johnny sees Mundson leaving the house: he has seen them. Johnny goes after Mundson in a car, and so do the police, headed by Obregon. They follow Mundson to an airfield and watch him take off in a plane and crash down into the ocean, assuming that he is dead. However, we soon see Mundson being picked up by a boat, revealing that he had indeed intended to escape from the police investigation. With everybody thinking Mundson is dead, Gilda inherits his fortune, and Johnny takes over the casino and the cartel. Gilda and Johnny get married, and he takes her to a new home. Gilda is happy, but Johnny does not intend to live with her; instead, he makes sure she cannot have contact with anyone. One of the Germans from the cartel comes to see Johnny and tells him that Mundson held the tungsten patents unrightfully. Now he wants them and the cartel leadership back. Gilda comes to see Johnny, wanting a reason for his treatment of her. He blames her for cheating on Mundson and wants to punish her. Seeking company, Gilda starts going out with other men, but Johnny has them disappear one by one. Realizing Johnny wants to keep her in cage, she runs. We see her as a club singer in Montevideo with another man, Tom. He persuades her to go back to Buenos Aires to get an annulment of her marriage. But when they arrive, it turns out Tom is on Johnny's payroll, and Gilda is back in her cage. Obregon talks to Johnny, wanting him to reveal the names of the cartel members, Johnny says he knows nothing about it. Gilda starts singing and dancing in the casino and flirts with the men. Johnny doesn't like it and hits her. Obregon comes again, closes down the casino and puts pressure on Johnny. Johnny gives him what he wants. Obregon tells Johnny that Gilda is waiting in the casino. Johnny overcomes his pride and asks Gilda to take him with her back to America. Suddenly Mundson appears from his office, explains how he is not dead afterall and announces his intention of killing them both. But before he can, Pio stabs Mundson with his own cane. Obregon comes in seeing what's happened, but lets them go, saying afterall a man can only die once. Gilda tells Johnny, \"Let's go home.\"",
      "writers": [
         "E.A. Ellington",
         "Jo Eisinger"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0038559/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTAzNTQ4MjY4NzZeQTJeQWpwZ15BbWU4MDA3OTU3OTAx._V1_SX214_AL_.jpg",
      "actors": ["Stars: Rita Hayworth, Glenn Ford, George Macready | See full cast and crew »"],
      "reviews": [
         "The 40s and 50s produced many alluring performances from beautiful and sexy actresses and Rita Hayworth's in Gilda is one of the most provocative of all. The film is good and quite deep, the male leads are better, but Hayworth's performance is simply stunning and unforgettable. She may not have been the most beautiful 40s actress (Gene Tierney and Veronica Lake were more classic beauties imo), but if you look closely her ability to show the sweet, the vulnerable, and especially the wanton, in women has not been bettered. Somehow her character gets under the male viewer's skin in the same way as it does to the male characters in the film. Modern film femme fatales are a pale shadow by comparison, for example Linda Fiorentino or Sharon Stone. I'm not sure why. It could be either that nowadays allure is too much equated with sex or nudity (less tantalising than several dashes of suggestion) or maybe it's that present day equivalents are portrayed as hard as nails without the necessary mix of sadness and vulnerability. Whatever, if you've never appreciated what the appeal of 40s noir is, this is definitely one to try.",
         "And to think there used to be movies without graphic sex scenes that still got the point across, and how. The sexual tension between Ford and Hayworth in this movie is enough to make you run for the cold showers. Hayworth is gorgeous and so is Ford. They are so good together and in this movie they are positively great. When great screen lovers are mentioned, I've often wondered why Ford and Hayworth aren't among them. This is one of my absolute favorites.",
         "You could not have come up with a better title for this seductive thriller. GILDA is what this film is all about and Rita Hayworth is so engrossing and beautiful, you sometimes forget what is going on and just stare. \"Put the Blame on Mame\" is one of film history's more memorable singing sequences and we get to see it twice. Look out for the famous \"hair-toss\" scene the prisoners in SHAWSHANK REDEMPTION cheer at. There is a film to talk about here but the alluring Ms. Hayworth is always on the tip of your tongue. Glenn Ford is the anti-hero of this excellent Noir portrait of double-crosses, jealousy, and forbidden love. He has many flaws, not the least being his infatuation of Gilda. Director Charles Vidor looked as though he was trying to capture a CASABLANCA-esque feel with the casino in Buenos Aires and people of all walks of life toiling within. There are even some familiar head nods at a roulette table. This is no CASABLANCA, but the end of WWII is somewhere in the backdrop and the stoic \"Ballin Mundson\", played by George Macready (PATHS OF GLORY), seems to have some foreign matters happening on the side, like \"Victor Lazlo\". The crisp black and white cinematography is effective, especially in the casino where 2/3 of the film takes place. GILDA is all Hayworth and, whether you are a male or female viewer, you see a good performance. She is great to look at, but her dramatic scenes are equally great to see. GILDA is an all-time classic that ranks with MALTESE FALCON and DOUBLE INDEMNITY. Throughout the picture, the blame is put on Rita for most of the plot's turning points. There may just be someone as sweet as her flowing red hair inside waiting to come out. Glenn Fords' Johnny Farrel (perfect name for Noir character) cannot look past her deceiving flirtation and realize that the bad guy is right in front of him. Another triumphant film of the 1940's that works every time, GILDA is Rita Hayworth's claim to fame and sent her into the stratosphere as a star. She was more than just a pin-up. RATING: 9 of 10",
         "Johnny is a small time, but talented, hustler who finds himself at the wrong end of a gun on the dark back streets of Buenos Aires. He is rescued by a mysterious and controlling stranger, Ballin Mundson, who ends up being the owner of a club/casino that operates under the radar of the law. Johnny and Ballin form a close partnership with Johnny being the \"man who runs the joint\" and Ballin the Master. When Ballin takes a short leave and comes back married to the gorgeous Gilda, a threesome develops that puts a strain on the partnership. There is a burning mutual dislike between Johnny and Gilda. When Gilda feigns ignorance over not remembering his name, she coyly replies, \"Johnny. So hard to remember . . . and so easy to forget.\" Of course there's much more to their acquaintance than they are willing to acknowledge, and a fusion of sexual heat, jealousy, fear and hatred keep the tension tightly wound which fuels the film. And of course there is Rita Hayworth up front and center. All the accolades that have been showered on her sexy \"striptease\" interpretation of \"Put the Blame on Mame\" are true! And still this film has much more to offer; an economical but effective story line; a tight witty script loaded with innuendo; and superb acting all around, especially the overlooked icy performance of George Macready as Ballin Mundson.",
         "This is one of my all time favourite films, much watched with all its faults. Even the best things can't be faultless but any faults can be more easily overlooked. There is no golden age film I've seen quite like Gilda, full of strange people with highly-charged emotions saying and doing odd thought-provoking things in semi-comical ways - if you include violence and swearing you could say that's 90% of modern movies though! The subject of hate = love has been explored better since Gilda, but with me the first cut is always the deepest - I first saw this when I was a more impressionable youngster. What we have is a scintillating four way love/hate relationship between Ballin, Johnny, Ballin & Johnny's little friend with no name, & Gilda that ultimately becomes the \"usual\" tawdry tangle, resolved by their nightclub's toilet-attendant. Huh? When you're in the middle of this fantasy world you can swallow all of this and more. Probably the second best B picture ever made it only starts to feel like one during the last 30 minutes down to the metaphorical walking into the sunset ending. There's so many good bits: The inventive and relentlessly snappy dialogue between the main characters throughout the film; Johnny quoting statistically that there are more insects in the world than women; Johnny waking up at 5am to the sound of Gilda singing to Pio the toilet-attendant; Pio's reaction after the midget industrialist killed himself in the toilets; Ballin describing his little friend's attributes to Johnny who claims he's just as good; Ballin asking Gilda if she was decent when she was; Johnny telling Ballin categorically that he taught Gilda ALL she knew; Gilda's little striptease - what creeps there were in that club - and fancy stopping her! Not quite as good as, but a worthy bookend for Casablanca, THE best B picture ever made.",
         "Glenn Ford and Rita Hayworth made five films together, but when they are talked of as a screen team, it's only Gilda that people are really talking about. Their first film was before World War II, The Lady in Question where both are young Columbia contract players who were in the same film and no effort was made to bill them as a team. The Loves of Carmen which was made after Gilda was a disaster for Glenn Ford, though Rita was at her sexiest. Affair in Trinidad was a good effort to recapture the magic of Gilda after Rita's storm marriage to Aly Khan and the last film The Money Trap was a Glenn Ford film where Rita has a brief role as an old girl friend. She was the best thing in that film by far. Do you remember in Cabaret how both the Liza Minnelli and Michael York characters find out they are sex partners to the same German bi-sexual man? That's essentially what happens in Gilda though with the Code firmly in place it's not something we talk about. George MacReady, a man of many interests rescues Glenn Ford from the docks of Buenos Aires after he's won some money from sailors in a crap game. They hit it off and Ford becomes his right hand man in running the casino MacReady operates. Then MacReady brings home a wife and lo and behold it turns out to be an old girl friend of Ford's, Rita Hayworth. Add to that some Nazi refugees have some business with MacReady over some tungsten mines. The real emphasis in this film is sex and personified by the best embodiment of sex ever on the silver screen. This film raked in a lot of dollars for Harry Cohn and Columbia Pictures. Hayworth, voice dubbed as usual, had a big number here in Put the Blame on Mame. It became a signature tune for her the rest of her life. One thing did disappoint me about Gilda. For a story that took place in Buenos Aires who many say is the most beautiful city in the world, it would have been nice to see some location shots, even if it was just some newsreels to establish the time and place. The film might as well have been in Albuquerque. But when you've got Rita to look at, it could be at the South Pole.",
         "Charles Vidor's \"Gilda\" opens to a noir world of gambling, shifting uncertainties with a crooked crapshooter whose self-made luck is about to change at the close of World War II. Leaving with his winnings, Johnny Farrell (Glenn Ford) is rescued by a nasty scar- faced casino owner Ballin Mundson (George Macready) with a dagger-cane\u0085 The handsome gambler offers himself up as a croupier-manager to run Ballin's illegal joint\u0085 Promising to be faithful, Johnny is immediately accepted\u0085 Unfortunately this included Ballin's dazzling new bride Gilda (Rita Hayworth), who happens to be Farrell's ex- girlfriend\u0085 Thus begins one of the most tortuous and hard to follow of noir's many twists and turns\u0085 Rita captured everything about Gilda's character\u0085 She is extremely beautiful, malicious, provocative, greedy, vengeful, and awfully superstitious\u0085 And she makes it sound! There is a heat that one could feel in Gilda and Johnny and its intensity is pretty high\u0085 The movie shifts into a tremendous struggle between temptation and loyalty, challenge and envy, suspicion and mistrust, passion and desire\u0085 This noirish thriller reunited a two legendary stars in a magical moment that reflected strongly a forbidden love\u0085",
         "This film is a great example of a very good film whose style and sense of sex appeal actually surpasses the plot. Now this isn't to say that the film has a bad plot--no, it's good enough. It's just that the wonderfully Noir-like dialog and Rita Hayworth's incredible sex appeal are what you are left with when the film is over--not the plot! Despite being a Rita Hayworth starring vehicle, she actually doesn't take up the lion's share of the screen. In fact, she doesn't even make an appearance until about 20 minutes into the film! This task of anchoring the film is given to a young and very effective Glenn Ford--who does a fine job as a street-wise but smart young punk wanting to make it to \"the big leagues\" and stop hustling for small change. When Ford meets up with George Macready, it's an incredibly memorable Noir moment. The crackling dialog between them and Ford's not even bothering to thank Macready for saving his life is so stylish and made the Film Noir lover within me happy! Later, in another great scene, Ford has just been worked over by a bouncer from a high class casino when he finds out this is Macready's business! Instead of being angry, both strike up a working arrangement--and Ford dispatches the bouncer is a brutal manner! Only later, after Ford has been Macready's right-hand man for some time does Hayworth enter the film. The reaction to her arrival indicates that there is SOME unfinished business between the two--but now Rita is Macready's new wife! Now this brings me to one problem about the film. It isn't an insurmountable problem, but supposedly Rita and Glenn had been lovers some time before and their meeting now was by pure chance. However, considering that they were in love in New York and the film takes place in Argentina, you are left wondering \"what are the odds?\". Despite this, you aren't left wondering for long because of the sparkling dialog and chemistry between Rita and Glenn. In other words, because of all the steamy moments on the screen, you tend to forget the occasional inconsistency of the plot. And, speaking of steam, there is a lot. Despite apparently being pregnant during the shoot, Miss Hayworth managed to create the sexiest portrayal on film from the era...period. Her languid singing, her amazing dresses that looked like they were glued on and the dialog between her and Ford all created an amazing atmosphere that just can't be equaled. Sure, the plot was fine, but the mood--that's what makes this an exceptional film. By the way, it is rather fascinating to see that in many ways this film mirrored the real-life antics of Rita--especially in regard to how she had a devil of a time picking men! Both Gilda and Rita both seemed to have a lot of sex destructiveness within them.",
         "Rita Hayworth positively sizzles as Gilda in this film-noir classic. From her initial hair-tossing scene to her near striptease while she sings \"Put the Blame on Mame,\" Hayworth is captivating and more than convincing as the object of every man's desires. However, beyond the overtly heterosexual lures of Ms. Hayworth lurks a complex and ambiguous romantic triangle that provides more intrigue than the surface plot, which involves a gambling casino that is a front for shady operations that originated in a recently defeated, Fascist country. Hayworth may either be the intruding wedge that comes between Glenn Ford and George Macready or the object of both men's romantic interests. From the initial meeting between Ford as two-bit gambler Johnny Farrell and Macready as Ballin Mundson the casino owner, an ambiguous, possibly homo-erotic, attraction is established between the two men. The lingering looks that they exchange can be read in several ways, but Bogie never looked into Cagney's eyes like Ford looks into Macready's. After Ford begins to work for Macready, his devoted care and slavish attention to his boss's needs exceed the bounds of employee and employer. When Hayworth moves into Macready's home as his new wife, Ford returns the key to the house as though he were a jilted lover. Ford's increasing jealousy becomes apparent after Hayworth's arrival on the scene, but it is unclear of whom he is jealous, Hayworth or Macready or possibly both. Perhaps Ford's character is as unsure of his own feelings as is the viewer, which makes the ambiguity even more intriguing. Macready's jealousy also grows as the heat between Ford and Hayworth intensifies, but, again, it is ambiguous of whom he is jealous. With a dazzling performance by Hayworth, excellent black-and-white photography by Rudoph Mate, fine direction by Charles Vidor, and layers of psychological possibilities to ponder, \"Gilda\" is as golden as its title suggests.",
         "George Macready is playing the role that most people remember him for - Balin Munson, nightclub millionaire in Argentina, and a man with pure ice in his veins. He has two friends...Johnny (Glenn Ford), who Balin rescues from some toughs, and a slick, sharp little chum hidden in his walking stick - ever ready to cut up people that Balin doesn't like. He also has bigger plans. Men like Balin are not satisfied with successful nightclub/gambling casinos (however successfully they are run). During the Second World War several German and axis industrialists found Balin a comfortable man to do business with. It seems they were not sure if Der Fuhrer would win after all, so they transferred various papers concerning their international holdings in tungsten manufacturing to Balin for him to watch. Big mistake, for Balin realizes that the documents actually put these interests into his fully capable hands. And since he has managed to bribe a local tungsten manufacturer to sell out his plant in Argentina, if Balin can leave without police interference he can put together a cartel that will control the manufacture of such things as light bulb filaments. Sounds preposterous, but that is Balin's goal. He only has two problems: Johnny and Balin's beautiful wife Gilda (Rita Hayworth) apparently know each other and can't stand each other - but he has to leave them in charge of his nightclub while he's away. The other problem is Detective Maurice Obregon (Joseph Calleia) of the Argentine Police Department. Obregon suspects Balin's involvement in this illegal cartel scheme, and is watching him like a hawk. \"Gilda\" is the film that made Rita Hayworth a star, and (with \"Paths of Glory\") gave Macready his justifiable claims to being one of Hollywood's best villains. Ironically many people don't think of Macready as anything but a villain in movies. It is true that in films like \"Lady Without a Passport\" and \"The Big Clock\" he was a villain, but he also could play decent people. He tries to help Spencer Tracy escape recapture and execution in \"The Seventh Cross\", and he is the wise minister and reformer who helps thwart Ray Milland (a.k.a. the Devil) in \"Alias Nick Beal\". But his Balin is pure, malevolent ice. There has been some suggestion that Balin's relationship with Johnny is actually a homosexual one (the business with the knife in the cane possibly being a metaphor for a male sex organ). Perhaps, but it is a weird friendship of two cynics who (briefly) enjoy each other's cynicism. Curiously enough the business of the tungsten cartel is rarely discussed in going over the film. Like \"Notorious\" which came out about the same time, \"Gilda\" reminded American audiences of the large numbers of Nazis and collaborators who fled to South America in this period. In \"Notorious\" it was Brazil, and the gang (led by Alex Sebastian - Claude Rains) was fooling around with uranium. Here the idea of such people controlling a useful metal's manufacturing was not probed as much, probably because Balin was set to double cross them. But it is worrying to think of them coming so close to it. In a discussion of the Warner Baxter film, \"Such Men Are Dangerous\" I mentioned that (like that film) there is a hint here of the 1928 mysterious death of millionaire Alfred Loewenstein, who managed to fall out of his private airplane over the English Channel. Here, to evade both the Nazis and Calleia, Balin arranges his plane to explode over the ocean (although the audience and Calleia see a figure parachute before it does so). Not quite the same problem as the Loewenstein mystery, but one can see the seed of the idea was there. I would say this was certainly one of the better film noirs. It even was somewhat thought provoking."
      ],
      "genres": [
         "Drama",
         "Film-Noir",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "Just arrived in Argentina, small-time crooked gambler Johnny Farrell is saved from a gunman by sinister Ballin Mundson, who later makes Johnny his right-hand man. But their friendship based on mutual lack of scruples is strained when Mundson returns from a trip with a wife: the supremely desirable Gilda, whom Johnny once knew and learned to hate. The relationship of Johnny and Gilda, a battlefield of warring emotions, becomes even more bizarre after Mundson disappears...",
         "In Argentina, Johnny Farrell is a dice gambler who gets in a robbery situation and is saved by Ballin Mundson, an owner of a casino. Johnny starts working for Ballin as his right-man. The situation changes with the arrival of Gilda, his lover in the past and recently married with Ballin.",
         "Johnny Farrell has just arrived in Buenos Aires, Argentina, where he is making a living cheating in gambling, primarily in informal street games. He begins a more stable life when, upon a chance meeting, he convinces Ballin Mundson, the violent and less than scrupulous owner of the local illegal casino, to hire him on the premise that it is better for Ballin to have the \"enemy\" on his side. Besides the casino, which the local authorities are aware of, Ballin is involved in an international illegal tungsten cartel. Johnny quickly rises to be Ballin's trusted right hand man. Ballin surprisingly gets married to Gilda, a woman he only just met. The two have different reasons for getting married to each other. Ballin can see that Johnny and Gilda mutually hate each other, but he states that hate is an exciting emotion. As Johnny tries to carry out his work for Ballin, Gilda - who continues to do what she wants, married or not - is a constant distraction for him, which gets to the point where that strong emotion of hate starts to cross the line.",
         "Johnny, a professional gambler becomes the right hand of Balin, the owner of an illegal casino in Buenos Aires. This post becomes stressful, when Balin marries Gilda, the ex-friend of Johnny. She is having affairs with others, and Johnny has to do a lot that Balin doesn't get informed about. Due to some other illegal things Balin does, he has to leave Argentina in a way that he seems to be dead for everybody. After this Johnny marries Gilda, but not because he loves her, but because he wants to punish her of not being faithful to Balin. But things are not going in the way Johnny has planed.",
         "Johnny Farrell is a gambling cheat who turns straight to work for an unsettling casino owner Ballin Mundson. But things take a turn for Johnny as his alluring ex-lover appears as Mundson's wife, and Mundson's machinations begin to unravel."
      ],
      "budget": 0
   },
   "movielensId": 2940,
   "movielens": {
      "languages": [
         "English",
         "Français",
         "Deutsch",
         "Español"
      ],
      "releaseDate": "1946-02-14",
      "dvdReleaseDate": "2000-11-07",
      "directors": ["Charles Vidor"],
      "runtime": 110,
      "movieId": 2940,
      "title": "Gilda",
      "mpaa": "",
      "actors": [
         "Rita Hayworth",
         "Glenn Ford",
         "George Macready",
         "Joseph Calleia",
         "Steven Geray",
         "Joe Sawyer",
         "Gerald Mohr",
         "Mark Roberts",
         "Ludwig Donath",
         "Donald Douglas"
      ],
      "imdbMovieId": "0038559",
      "originalTitle": "Gilda",
      "genres": [
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["w49QG9hQT7I"],
      "plotSummary": "Just arrived in Argentina, small-time crooked gambler Johnny Farrell is saved from a gunman by sinister Ballin Mundson, who later makes Johnny his right-hand man. But their friendship based on mutual lack of scruples is strained when Mundson returns from a trip with a wife: the supremely desirable Gilda, whom Johnny once knew and learned to hate. The relationship of Johnny and Gilda, a battlefield of warring emotions, becomes even more bizarre after Mundson disappears...",
      "tmdbMovieId": 3767,
      "avgRating": 3.90462,
      "releaseYear": "1946",
      "numRatings": 1148,
      "posterPath": "/hz2gG5D3GHaaPZUSnRNjMC3Wl1r.jpg"
   }
}