{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "sexual identity",
            "id": 566
         },
         {
            "name": "shipwreck",
            "id": 2580
         },
         {
            "name": "lovers",
            "id": 4663
         },
         {
            "name": "stranded",
            "id": 9743
         },
         {
            "name": "marooned",
            "id": 10792
         },
         {
            "name": "pacific island",
            "id": 11823
         },
         {
            "name": "teenager",
            "id": 13130
         },
         {
            "name": "deserted island",
            "id": 155746
         },
         {
            "name": "tropical island",
            "id": 157524
         },
         {
            "name": "lost at sea",
            "id": 179578
         }
      ],
      "imdb_id": "tt0080453",
      "video": false,
      "title": "The Blue Lagoon",
      "recommendations": [
         13888,
         8856,
         12154,
         10303,
         2619,
         9494,
         11846,
         9326,
         11002,
         11896,
         10345,
         10603,
         4478,
         10495,
         6520,
         1885,
         6280,
         10328,
         10307,
         9889
      ],
      "backdrop_path": "/3x59nJ0umJAh0NWk9F8heCJt9nk.jpg",
      "revenue": 58853106,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 7,
               "character": "Emmeline",
               "gender": 1,
               "credit_id": "52fe4418c3a36847f8081fbf",
               "name": "Brooke Shields",
               "profile_path": "/zOyzH2LjJ3CbzpiJcAmpsiC7d1O.jpg",
               "id": 15110,
               "order": 0
            },
            {
               "cast_id": 8,
               "character": "Richard",
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fc3",
               "name": "Christopher Atkins",
               "profile_path": "/epuXlJ2np6Zp0WIiyo56XHFwevz.jpg",
               "id": 42740,
               "order": 1
            },
            {
               "cast_id": 9,
               "character": "Paddy Button",
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fc7",
               "name": "Leo McKern",
               "profile_path": "/qcO1TFO6SowLOQAwKRMKrqmrk6A.jpg",
               "id": 7192,
               "order": 2
            },
            {
               "cast_id": 10,
               "character": "Arthur Lestrange",
               "gender": 0,
               "credit_id": "52fe4418c3a36847f8081fcb",
               "name": "William Daniels",
               "profile_path": "/1SCR6im2maiASfTD5h7r0g9dU78.jpg",
               "id": 10775,
               "order": 3
            },
            {
               "cast_id": 11,
               "character": "Lookout",
               "gender": 0,
               "credit_id": "52fe4418c3a36847f8081fcf",
               "name": "Jeffrey Kleiser",
               "profile_path": null,
               "id": 44841,
               "order": 4
            },
            {
               "cast_id": 13,
               "character": "Officer",
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fd7",
               "name": "Gus Mercurio",
               "profile_path": null,
               "id": 44843,
               "order": 6
            },
            {
               "cast_id": 15,
               "character": "Young Emmeline",
               "gender": 1,
               "credit_id": "52fe4418c3a36847f8081fe1",
               "name": "Elva Josephson",
               "profile_path": null,
               "id": 136853,
               "order": 7
            },
            {
               "cast_id": 16,
               "character": "Young Richard",
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fe5",
               "name": "Glenn Kohan",
               "profile_path": null,
               "id": 136854,
               "order": 8
            },
            {
               "cast_id": 17,
               "character": "Little Paddy",
               "gender": 2,
               "credit_id": "530b65a492514111110050f0",
               "name": "Bradley Pryce",
               "profile_path": null,
               "id": 1037039,
               "order": 9
            },
            {
               "cast_id": 18,
               "character": "Infant Paddy",
               "gender": 0,
               "credit_id": "530b65b4925141111a004c6d",
               "name": "Chad Timmerman",
               "profile_path": null,
               "id": 1296157,
               "order": 10
            },
            {
               "cast_id": 19,
               "character": "Sailor",
               "gender": 0,
               "credit_id": "530b65c69251415e710022f0",
               "name": "Gert Jacoby",
               "profile_path": null,
               "id": 136855,
               "order": 11
            },
            {
               "cast_id": 20,
               "character": "Sailor",
               "gender": 0,
               "credit_id": "530b65d9925141111700506c",
               "name": "Alex Hamilton",
               "profile_path": null,
               "id": 136856,
               "order": 12
            },
            {
               "cast_id": 21,
               "character": "Sailor",
               "gender": 0,
               "credit_id": "530b65e59251411114004dd2",
               "name": "Richard Evanson",
               "profile_path": null,
               "id": 136857,
               "order": 13
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fa3",
               "name": "Randal Kleiser",
               "profile_path": "/dtSwBcwtYZL9ir9zfKZaTdwdiSm.jpg",
               "id": 8876,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fa9",
               "name": "Henry De Vere Stacpoole",
               "profile_path": null,
               "id": 44840,
               "department": "Writing",
               "job": "Novel"
            },
            {
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081faf",
               "name": "Néstor Almendros",
               "profile_path": "/3O9fLu6Mc1AYHHOh3DFwSO9vveY.jpg",
               "id": 3569,
               "department": "Camera",
               "job": "Director of Photography"
            },
            {
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fb5",
               "name": "Basil Poledouris",
               "profile_path": "/jEUcVOa9gppkDvr5MJOvSD5KVtj.jpg",
               "id": 7728,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fbb",
               "name": "Randal Kleiser",
               "profile_path": "/dtSwBcwtYZL9ir9zfKZaTdwdiSm.jpg",
               "id": 8876,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe4418c3a36847f8081fdd",
               "name": "Douglas Day Stewart",
               "profile_path": null,
               "id": 27538,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Adventure",
            "id": 12
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 10.681945,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 5689,
      "vote_count": 544,
      "budget": 4500000,
      "overview": "Two small children and a ship's cook survive a shipwreck and find safety on an idyllic tropical island. Soon, however, the cook dies and the young boy and girl are left on their own. Days become years and Emmeline (Brooke Shields) and Richard (Christopher Atkins) make a home for themselves surrounded by exotic creatures and nature's beauty. But will they ever see civilization again?",
      "similar": [
         115290,
         13888,
         449176,
         27902,
         2108,
         10229,
         8358,
         272693,
         315635,
         85350,
         205775,
         9880,
         308369,
         286565,
         8363,
         8193,
         3597,
         133805,
         10625,
         376660
      ],
      "original_title": "The Blue Lagoon",
      "runtime": 104,
      "poster_path": "/6zmAK0Ormo2xQh0K4FYPAnsKYc0.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1980-07-05",
      "vote_average": 5.8,
      "belongs_to_collection": {
         "backdrop_path": "/m8LAOuIhlCBr6dWdtVF2C2ioMrc.jpg",
         "name": "The Blue Lagoon Collection",
         "id": 59586,
         "poster_path": "/A4U11Zhp5KjiKOrghNlqNlmrbhw.jpg"
      },
      "tagline": "A sensuous story of natural love.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Randal Kleiser"],
      "runtime": 104,
      "synopsis": "It is the Victorian era in the South Pacific. Two young children, cousins Richard and Emmeline Lestrange ( Glenn Kohan and Elva Josephson) are sailing with Richard's father, Arthur ( William Daniels), to San Francisco. When the ship suddenly catches fire, the ship's cook, Paddy Button ( Leo McKern), gathers the children in a lifeboat and rows away from the wreck. However, due to dense smoke, heavy fog, and general chaos, they are separated from the children's father, who has escaped on a separate dinghy, and drift out to sea. After a day or two afloat, they arrive on the shores of a lush, tropical island. Paddy assumes responsibility for the children and, over an indeterminable amount of time, teaches them how to find food and build shelter, though he can't deter them from taking their shirts off and running about half naked. One day he discovers a stone altar covered in blood and the remains of what appear to be a human sacrifice. He warns the children to stay away from that place, telling them it's 'the law' and that the boogeyman lives there. He also tells them to never eat a certain scarlet berry that Emmeline finds, presumably to keep them from eating anything uncertain. He calls them 'never-wake-up berries'. The memory of having the berries temporarily in her mouth haunts Emmeline for the rest of the film. Because Paddy talks of being 'dead n' buried' if they eat the berries, Emmeline associates the words with them and renames them 'dead n' berries'. One day, Paddy discovers a barrel of rum or whiskey washed ashore from the sunken ship. He and the children have a little fun that night, dancing around a fire, though Paddy is obviously inebriated. When the children fall asleep, he takes the barrel and swims to a smaller, nearby island. The children wake up in the morning and take the rowboat out to where they see Paddy lying in the sand. Thinking he's merely asleep, they flip him over to see that he's died in a drunken binge. A crab crawls out of his mouth and Emmeline faints. Richard brings her back to the island where, that night in their hut, she begs him to take her away from this place. They pack up everything they have and row around to the other side of the island where they find a new stretch of beach to settle on. Relying on each other and the bounty the island has to offer, Richard and Emmeline mature into strong teenagers ( Christopher Atkins and Brooke Shields), spending their days diving for pearls and fish, gathering food, or maintaining their tree house. Though they spend most of their time together, Richard and Emmeline soon start developing both physically and emotionally in ways they can't explain. Growing up as children, they are generally ignorant to the changes they experience which leads to frustration and confusion for the most part. Emmeline experiences her first menstrual period while swimming and calls out to Richard, afraid at first. When he arrives and asks what's wrong, she yells at him, embarassed, and tells him to go away. Richard finds himself becoming physically attracted to Emmeline but she, though often fearful of being left alone, doesn't reciprocate his feelings, inciting Richard to go off alone and masturbate. One day, ever-curious Emmeline wanders to the forbidden side of the island and finds a Moai-like stone idol there with the tell-tale stain of blood. Thinking instead that the place is holy, she prays and later tells Richard that she thinks Paddy was wrong and that the 'boogeyman', who bleeds like Jesus, is actually God. However, Richard berates her for disobeying the 'law'. They speak often of being rescued and going to 'San Frisco' to see Richard's father, but when a ship passes by the island for the first time in years, Emmeline does not light the signal fire they had set up. Richard emerges from foraging in time to see the ship depart and angrily confronts Emmeline. She tells him that the island is their home now and that they should stay, to Richard's disbelief. They insult each other and Emmeline reveals that she knows what happens when Richard goes off alone which leads him to throw a coconut at her. She throws one back, hitting him on the head. Immediately remorseful, Emmeline rushes over to him but he slaps her and says he wishes she was dead n' buried. Furious, he kicks her out of their home, throwing her items onto the beach. After building a makeshift hut for herself near the water, Emmeline steps on a stonefish. Richard discovers her deathly ill in her hut and she begs him to take her to God, despite the law. Fearing for her life, Richard does so and places her on the stone altar, reciting what little he remembers of his prayers. Emmeline eventually recovers and, after she regains her ability to walk, goes swimming with Richard in the lagoon. Afterwards, they sit naked together and share some fruit as well as their first kiss. They lie down with each other, expressing their love for each other, and discover sexual intercourse and passionate love. Putting all their past arguing aside, they spend most of every waking moment with each other, playing in the water or making love. However, Emmeline soon becomes pregnant. Though this is clear to the viewer through Emmeline's hunger cravings and her ability to feel the baby, she and Richard are unsure of her physical changes and have no knowledge of childbirth, attributing it all, at first, to Emmeline merely getting fatter. One night, Emmeline goes missing and Richard looks through the jungle for her. Following the sound of drums, he comes upon the altar where 'God' stood. There, he witnesses a native tribe performing a human sacrifice. Richard flees as the victim is killed and hears Emmeline's cries, following them in time to help her give birth to a baby boy whom they name Paddy. They bring the baby back to their home and try to feed him. Frustrated by the baby's crying and that he won't take solid foods or juice, Emmeline takes him in her arms to see that he instinctively suckles at her breast. Richard tells Emmeline what he witnessed the night she gave birth and assures her that if any of the natives come to find them he will stick them with his spear like a fish. But the natives never come to their side of the island. As the baby grows, they teach him how to swim and play. As they all play together in wet mud near the shore, a ship led by Richard's father approaches the island and sees them there. As they are completely covered in mud, Arthur does not recognize them. Paddy points to the ship but when Richard and Emmeline see it, they resign all previous intentions of leaving the island with silent glances and retreat with Paddy into the forest. Richard is seen taking the rowboat alone out to the small island where Paddy Button died. He approaches the beach and sees the old man's skeleton lying in the sand, bleached white from the sun. Richard tentatively touches his ribs, matching them to Paddy's, and looks at the bones in his hands. A morbid understanding comes to him and it's implied that he has a better grasp on his own body as well as death. One morning, the young family takes the rowboat to visit their original home site and to collect food and other supplies. Richard goes to harvest bananas while Emmeline and the baby explore near shore and Emmeline fails to notice young Paddy collecting scarlet berries and putting them in his pocket. The two of them go back to the boat to wait for Richard but the tide takes them out when Emmeline falls asleep. She is awakened by the sound of Paddy pushing one of the oars into the water and tries to fetch it with the other. When she can't, she calls out to Richard who starts to swim to the boat, followed closely by a shark. Just before he reaches the boat, Emmeline throws the last oar at the shark, hitting it and giving Richard enough time to get out of the water. They try to paddle to shore with their hands but the tide is too strong and they don't dare swim for fear of a shark attack. Slowly but surely, the boat is taken out to sea. After a day or two at sea, Richard and Emmeline awake from a nap to find Paddy eating the berries he had collected. Frantic, they try to make him spit them out, but he's already swallowed them. After another day, young Paddy has a hard time keeping his eyes open and falls into a deep sleep. Resolute, Richard splits the remaining berries between Emmeline and himself and they lie down together to await death. A short time later, a large schooner approaches the rowboat. Arthur Lestrange and the captain of the ship ( Alan Hopgood) approach in their own dinghy to find the young couple and their child lying in the boat. He asks the captain, 'Are they dead?' The captain replies, 'No sir, they are asleep.'",
      "writers": [
         "Henry De Vere Stacpoole",
         "Douglas Day Stewart"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0080453/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTQwNTM5MDU2OF5BMl5BanBnXkFtZTgwNjI0OTgzMTE@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Brooke Shields, Christopher Atkins, Leo McKern | See full cast and crew »"],
      "reviews": [
         "After reading all the critiques and reviews, there's just one thing that all of you have to remember: THE ACTORS WERE SUPPOSED TO BE PORTRAYING TEENS WITH THE SOCIAL MENTALITY OF 7 OR 8 YEAR OLDS. Many critics were saying that the dialogue and the acting was bad, but in actuality, the acting is very good for what the plot called for. Brooke Shields and Christopher Atkins were supposed to portray young adults who were 'cut off' from the rest of the world at a very young age. That's why they were supposed to portray two people with the limited education, mentality, vocabulary and speech of 7 or 8 year olds. It would really have been unrealistic if they had more developed dialogue, since they had nobody to further their speech skills on an island with only two people...who were still both mentally children! That is why they show scenes where they sing very incomplete songs, refer to San Francisco as \"Sanfarisco\", and forget their daily prayers. In light of all this, I think they did a very good job of acting and the writers did a very decent job of limiting the dialogue to the speech abilities of young children. However, there are some unbelievable and unexplained scenes, such as the giving birth scene. How do they cut the umbilical chord off?? And some other minor details should have been explained, but overall: A very beautiful and romantic story with a happy ending. An 8 out of 10.",
         "I've never understood the critical slam this film has received. Then I saw the widescreen dvd version and understood; everyone has been watching it in pan and scan! The film is a visual poem. So much of the story telling is done through visual information. The impact of this is lost when the cinematography is altered. Remember that Nestor Almendros received an Academy Award nomination for his work on this film. The film has resonated with global audiences for so long for this very reason. I suggest people watch the dvd commentary with Randal Kleiser and Brooke Shields to get a better understanding of why this film is still such a popular one. People attack the acting, but these are children left alone with no one to guide them into adult sophistication. Their interaction and reactions to situations are very consistent with this scenario. Yes, the birth scene is a little rushed, but do we really need to see the umbilical cord? Not all films need to be about gritty reality, ala \"Taxi Driver.\" No one asks to see the bloody guts of the smashed witch in \"The Wizard of Oz.\" It is a beautiful, romantic film that speaks to millions of people. It seems that only the most skeptical cynics cannot embrace this film.",
         "This movie is simple, it captures what life is really about. Without the many special effects that is used in movies now and even in the past it is a absolutely wonderful movie. A young romance blossoming between two kids who have known nobody else but themselves. They discover everything in life without all the interference of the rest of the world. The low rating on this movie is unjust, it deserves a lot more then it is given, this is possibly one of the best movies I have ever seen. It is absolutely wonderful for a romantic night just you and the television. And the nudity? it was exciting when I was younger, it becomes a bit too much as I am getting older, but it does not bother me. It fits the movie, the pure soul of the movie.",
         "The Blue Lagoon (1980) is so very close to the book, Blue Lagoon: A Romance, written in 1907 by H. de Vere Stacpoole and published in January 1908. The actual book is on the Internet and the dialog in the movie is faithful to the book. Some dismiss the movie as trivial. However, consider this. Brooke Christa Shields was 14 years old (born 1966) when she played Emmeline LeStrange. She had already appeared in 12 prior films. Christopher Atkins was making his movie debut at the age of 18 years (born 1962) playing Emmeline's cousin, Richard LeStrange (referred in the book by the diminutive name, Dicky LeStrange). In the book, Emmeline is 8 years old and Dicky is 8 years \"and a bit\" when the story starts. Emmeline's father died before she was born. Two years later her mother died. Her uncle and father's brother, Arthur LeStrange, (veteran actor William Daniels) took guardianship of Emmeline in Boston. Mr. LeStrange purchased a small estate in Los Angeles and was in route by clipper ship to San Francisco around South America. The ship, named Northcumberland, had departed from New Orleans bound for San Francisco. Having rounded the Cape of South America and going off course during a calm, a fire breaks out in the hull of the ship. The cook, Paddy Button, played expertly by veteran Australian actor Leo McKern took Emmeline and Dicky aboard a dinghy launch and attempted to row a safe distance away from the ship before it exploded from gunpowder stored on board. Mr. LeStrange and ships' compliment were separated in the fog from Paddy, Emmeline, and Dicky after the ship blew up. Mr. Button and the children drifted in the South Pacific Ocean for about three days and nights until they were brought by the tide to an island named in the book as Palm Tree Island somewhere in the ocean southeast of the Marquesas Islands. In the movie we see a Boston newspaper with a date that appears to be 1893 floating in the water. The children and Paddy Button are saved and set up housekeeping as shipwrecked survivors. For the first 45 minutes of the movie, child actors Elva Josephson and Glenn Kohan play Emmeline and Dicky. Elva only acted in three movies and two TV appearances while Glenn appeared in this film only and acted no more. However, they did a good job playing themselves as eight-year-olds. On the island Paddy tries to be father and mother to the children. He teaches them the basics of survival, gathering fresh water, harvesting bananas from trees, catching fresh ocean fish, capturing small rabbits, knot tying, hut building, making a signal fire, making a tree calendar to mark the days, and exploring the flora and fauna and caves of the island. They had rescued a trunk of clothes that the children use as dress up and play items. Also, there were three-dimension view photos of the day of adults in social activities. These photos would be useful to educate Emmeline and Dicky in some social graces of civilized people. Emmeline had found a keg of rum and a skeleton of another shipwrecked sailor when they first arrived on the island. After two years on the island, Paddy, drinks himself to death. It is curious that this small keg would have lasted for two years being the rummy that Paddy was as he tells the children that he has many children in ports around the world. However, the children discover Paddy's dead body and conduct a burial ceremony as best as they could. Don't look for this on the TBS \"edited for content\" version, as it's not there. TBS spoils the movie by cutting out what they feel are \"sensitive\" parts of the movie, albeit, necessary for continuity of the story to retain its TV 14 rating. (This is not a children's movie. This is a young adult's movie. The rudimentary scenes are necessary to be faithful to the book! If the rating ends up being \"R\", so be it. Also, this is far from being a \"soft porn\" movie as some reviewers suggest. This is a story about how people can survive in the late 1800s on a deserted South Pacific Island without the niceties of the then civilized western world.) Enter teens Brooke Shields and Christopher Atkins at about the age of 14 years. The story picks up as the children have entered into puberty. Brooke (Emmeline) begins to become aware of her changing body turning her into a woman and she experiences these changes alone and confused without another woman to help educate her. Likewise, Chris (Dicky) is becoming a man and Brooke, although the same age in the story is more mature than Chris and is becoming sexually attracted to Chris' emerging manhood. What was once child's play and tickle-touch between children, is now, sexually sensitive to young emerging teens. Critics -- this is Nature at work! The moviemakers did a wonderful job of portraying this on film. Of course, they discover sex. But, they do not know that it produces children. Emmeline and Dicky marry each other in a ceremony they devise to show that they are \"civilized.\" They begin to live together as husband and wife. Ultimately, Emmeline becomes pregnant and finally is aware that there is something growing within her. Fast forward to the \"Bogeymen\" on the other side of the island. A tribe of natives had, from time to time, come by boat to the other side of the island. Here they had a stone idol and sacrificial alter. At least six times during the film, even when Paddy was still alive, the survivors heard distant drumbeats. Paddy knew the danger and passed a \"law\" warning the children never to go to the other side of the island. After Paddy's death, Emmeline and Dicky do go to the other side and discover the idol. Emmeline thinks it is God. The edited version leaves out the night spying and confrontation of Dicky with a native. Get the full version for this \"humane\" meeting of East meets West. Oh, these are not African peoples. This is a South Pacific movie. The natives are supposed to be \"Polynesians.\" In the book, Emmeline has her child all alone on the floor of the forest while Dicky is returning from spying on the Natives. In the movie, Dicky returns, \"in the nick of time,\" to witness the child's birth. No matter. That's Hollywood's movie license. Of course, Uncle Richard has continued to pursue finding his son and niece. The book explains how he comes to know where the children might be. He hires a ship to search the area of the Palm Tree Island. Ultimately, Emmeline, Dicky, and baby Paddy (now about 2 years old -- in the book she names the boy child a girls name, Hannah because she likes the name) put out to sea in the dinghy that is still seaworthy after being shipwrecked for eight years and five months. After losing their oars during a shark attack, the survivors, without food or water, drift in the ocean for three days before Uncle Richard discovers them. The movie ends as faithful to the book ending. The trio is rescued. When the rescue boat rows out to intercept the dinghy, Mr. LeStrange asks, \"Are they dead?\" The ship's crewman replies, \"No, they're asleep.\" Beautiful Brooke and handsome Chris are not to be made fun of. They acted remarkably well portraying children with limited education and vocabulary. The island scenery is beautifully photographed. There is a wonderful special effect when Brooke baths in the ocean. Get the video as TBS took a hatchet to these frames. If you were living in that era and shipwrecked and survived, you would want your eight plus years on the island to be like Brooke and Chris spent in this film. Get the video and enjoy. It's an adult film for mature teens and older adults.",
         "This is one of my favorite films. I was 14 when it was released and I could really relate to it. It's really hard to describe but it just brings me back to a time in life when everything was new and exciting. The storyline is something that you dream about especially when you're 14 years old. The beautiful scenery and sound track just puts you in the perfect mindset. Sure there are some things in the movie that are a little hard to believe but that's all part of the whole \"fantasy\" thing. I've probably watched it every chance I've had. I've always thoroughly enjoyed this movie and always will. It makes me feel like I'm 14 years old again. The Blue Lagoon is probably the most beautiful film ever made. I just love the movie! Just give it a chance sometime. But I guess that's just my opinion.",
         "I was a young kid when I saw THE BLUE LAGOON and yes, I remember all the hoopla about the \"nude\" scenes of Brooke Shields and all that jazz. I must confess that, being in my early teens at the time I saw this, there was an inherent morbidity which compelled me to want to watch Brooke Shields in the nude. After all, she was probably THE hottest \"teen\" actress of the early 80's (and damn, she DID look terrific!). But now I'm in my late 30's and I have recently seen the film once again and I must confess, BLUE LAGOON is a darn good movie. Yeah, it might be corny in some parts, but so what?!?! It's a cute love story that's very well done and done in a very realistic and believable way. It's the story of two kids who are stranded on a supposedly deserted island in the middle of the pacific ocean and that they have to grow up and learn the things of life by themselves. Yes, there's plenty of nudity but that's not the charm of this movie (which I recall, was nominated for best cinematography in 1981). The real deal is the story of these 2 kids growing up and reaching adulthood on their own primitive terms. The soundtrack is rich and heartfelt (by maestro Basil Poledouris) and only enhances the overall grandeur of this film. I think Chirs Atkins did a great acting job and I have to wonder why his acting career has faded into near obscurity. And Brooke Shields looks like a total goddess; she is REALLY beautiful in this movie and I doubt she's looked better elsewhere. I fully recommend this movie, especially to young couples, the recently married or just plain love birds. younger audiences might find it a bit corny, but like I said, this movie is pure entertainment and despite not being an action flick, it never bores. You'll do no wrong in watching or better yet, owning THE BLUE LAGOON on DVD!",
         "i have not seen this film in many years, and saw it unedited last week on TCM. when i was a boy, the film's main appeal was in its edenic milieu, its charged moments of wonder and terror, and brooke shields' extraordinary beauty and gamine charm. those qualities are all still there. But the film tells another story that i missed before: two children ripped from civilization struggle to make sense of the world and themselves. this is no rousseau inspired romp. the pulse and power of natures' force wrecks them, engulfs them, confines them and finally asserts itself through em and dick. the question is begged: where does human will and intellect figure in chaos of pubescence, sexuality and love? how helpless or powerful are we to control the furies of love or sex? more helpless than not, the filmaker seems to be saying. kleiser interposes the stereopticon pictures of the staid victorian couple with similar scenes of em and dick to highlight this point. naked or clothed, in a drawing room or on a beach, we all experience the torrent of love in very much the same way. instinct races ahead, sense chases behind in confusion. \"blue lagoon\" tells a timeless human story in a very simple style. this movie is better for talking to kids about growing up than any 10 sex education pamphlets. and if an adult cannot remember how this felt when they were young, a little part of them has already died. a good movie",
         "Last year I watched The Blue Lagoon for the first time and thought it was absolutely amazing. When I tell people this they usually laugh in my face and say that I only like it because of Chris Atkin's sex appeal, but that is not the only reason. This movie epitomizes Freud's theories of the id, ego and super ego- explaining these three branches of the human mind very effectively and creatively. It actually raised my interest in the subject of human psychology and sociology so much that I am considering it as a major in college. And who would have ever thought a buff man running around in a loin cloth could have given me direction in life?",
         "I have always liked this film, and don't like it when it is criticized so much. Brooke Shields and Christopher Atkins did a wonderful job, they were excellent. Brooke is a beautiful, talented actress. The scenery was just gorgeous, it makes you want to fly off to Fiji where they filmed most of the movie to see what it is really like. The music is also very good. The story starts out with a ship which catches fire, and everyone is forced to abandon ship. Two young children, Richard and Emmeline, as well as a drunken cook named Paddy, get on a lifeboat together and drift on the sea for many days, until they discover land, a bunch of little remote tropical islands. They build a home there. Time passes, and Paddy passes away, but Richard and Emmeline continue growing up together. They get older, and new feelings come over them. They discover many things about adolescence and sex. This is a great love story, sweet and lovable. Brooke and Chris make a great onscreen couple. The sex/nudity scenes are not really that bad at all, they're rather mild. There is more nudity in the underwater swimming sequences, but mostly all of that was done by Brooke's stand-in, a professional diver. I really like this movie, and even though there are a few logic loopholes, it is still enjoyable. My only complaint: I think this film could've gone on for about 5 more mins. or so and explained things a little bit better.",
         "I received this movie for Christmas back in 8th grade by my best friend at the time. I had seen it first on tv and fell in love with it regardless of the major chopping on tv's part with editing. The movie was and still is my favorite movie. The ending's a little too ambiguous for my tastes, but the music....oh gosh! Basil Poledouris (pardon the bad spelling) made this film shine. The concept is great of two people alone growing up without civilization to guide them. Most people's issue with this movie is the dialogue. Come on! They were left alone at like 8. Your body matures people, but not so your mind. Would it have made any sense if they were speaking like intelligent teenagers without benefit of education? No. The movie was realistic with the constant nudity and the childlike innocence of the two characters. Brooke Shields is awesome. I loved her in this movie. This was when she was at her best. Atkins did a great job as well. I know if I was on that island, I'd be naked a lot as well. It was just really put together nicely. The scenes with the water and the aquatic life was really gorgeous. Love this movie!"
      ],
      "genres": [
         "Adventure",
         "Drama",
         "Romance"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "On a journey to San Francisco, Richard, his father and cousin Emmeline find themselves on a ship about to explode. Rushed to a lifeboat with Paddy Button, the two children escape while their father (and uncle) are on another lifeboat. In the chaos following, the lifeboats are separated. Paddy, Richard and Emmeline find themselves with no food and no water stuck in the middle of nowhere. After some time, the three come across an uncharted paradise, where Paddy quickly teaches the children fishing, hunting and building. After maybe a month or two, Paddy gets very drunk off a barrel of rum found on the island when they first arrive, and drowns in the middle of the night. Emmeline and Richard, now alone and very scared, move location and rebuild their island home. Many years later, the two young teenagers have developed a very real home, but hormones and feelings between the two strain their friendship, until Richard, who is still very determined to reach San Francisco, is let down by Emmeline when a ship passes by the island and she does not light the signal fire. Throwing her out of the home they had built together, Emmeline attempts to survive on her own but is hurt. After Richard finds her dying, he realizes how he really feels for her and manages to save her. Nature runs its course and their friendship turns into love as the couple learn about the facts of life, when Emmeline has a baby and does not understand why.",
         "Two young children are the sole survivors of a shipwreck in a time when sailing was the only way of travel. They are stranded on a tropical island, a real paradise. Together, Richard and Emmeline have to survive, which is quite easy as there are no dangerous animals on the island. Years later, the two teenagers are living in a self-constructed hut, strange emotions start influencing their relationship. Although they had no grown-ups to educate them for all that time, the behaviour of the two always stayed in a very civilized way. Nature takes its course, and Emmeline gets pregnant, totally unaware of the fact that a child is growing inside her. On the night their boy is born, Richard finds out about the origins of the drums they hear from time to time from the forbidden side of the island.",
         "In the Victorian period, two children are shipwrecked on a tropical island in the South Pacific. With no adults to guide them, the two make a simple life together, unaware that sexual maturity will eventually intervene."
      ],
      "budget": 4500000
   },
   "movielensId": 2950,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1980-07-05",
      "dvdReleaseDate": "2005-02-01",
      "directors": ["Randal Kleiser"],
      "runtime": 104,
      "movieId": 2950,
      "title": "The Blue Lagoon",
      "mpaa": "R",
      "actors": [
         "Brooke Shields",
         "Christopher Atkins",
         "Leo McKern",
         "William Daniels",
         "Jeffrey Kleiser",
         "Gus Mercurio",
         "Elva Josephson",
         "Glenn Kohan",
         "Bradley Pryce",
         "Chad Timmerman",
         "Gert Jacoby",
         "Alex Hamilton",
         "Richard Evanson"
      ],
      "imdbMovieId": "0080453",
      "originalTitle": "The Blue Lagoon",
      "genres": [
         "Romance",
         "Adventure",
         "Drama"
      ],
      "youtubeTrailerIds": [
         "1nC0EdXk_2g",
         "DYhhph8uZyk"
      ],
      "plotSummary": "Two small children and a ship's cook survive a shipwreck and find safety on an idyllic tropical island. Soon, however, the cook dies and the young boy and girl are left on their own. Days become years and Emmeline (Brooke Shields) and Richard (Christopher Atkins) make a home for themselves surrounded by exotic creatures and nature's beauty. But will they ever see civilization again?",
      "tmdbMovieId": 5689,
      "avgRating": 2.58489,
      "releaseYear": "1980",
      "numRatings": 4323,
      "posterPath": "/6zmAK0Ormo2xQh0K4FYPAnsKYc0.jpg"
   }
}