{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "prison",
            "id": 378
         },
         {
            "name": "boxing",
            "id": 209476
         }
      ],
      "imdb_id": "tt0079709",
      "video": false,
      "title": "Penitentiary",
      "recommendations": [
         180879,
         115527,
         72785,
         156627,
         119555,
         63893,
         88176,
         82576,
         31293
      ],
      "backdrop_path": "/uNbdOhz3oKYG3aVCMA1Z3JeB6RG.jpg",
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1000,
               "character": "Sweet Pea",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1de1",
               "name": "Wilbur 'Hi-Fi' White",
               "profile_path": null,
               "id": 543348,
               "order": 0
            },
            {
               "cast_id": 1001,
               "character": "Martel 'Too Sweet' Gordone",
               "gender": 2,
               "credit_id": "52fe470ac3a368484e0b1de5",
               "name": "Leon Isaac Kennedy",
               "profile_path": "/81B8zryo4ZcuGDHrXHQv4A6dxtm.jpg",
               "id": 543349,
               "order": 1
            },
            {
               "cast_id": 1002,
               "character": "Eugene T. Lawson",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1de9",
               "name": "Thommy Pollard ",
               "profile_path": null,
               "id": 543350,
               "order": 2
            },
            {
               "cast_id": 1003,
               "character": "Linda (as Hazel Spear)",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1ded",
               "name": "Hazel Spears ",
               "profile_path": null,
               "id": 543351,
               "order": 3
            },
            {
               "cast_id": 1004,
               "character": "Jesse Amos",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1df1",
               "name": "Donovan Womack ",
               "profile_path": null,
               "id": 543352,
               "order": 4
            },
            {
               "cast_id": 1005,
               "character": "Hezzikia 'Seldom Seen' Jackson (as Floyd Chatman)",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1df5",
               "name": "Floyd 'Wildcat' Chatman ",
               "profile_path": null,
               "id": 543353,
               "order": 5
            },
            {
               "cast_id": 1006,
               "character": "Peaches",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1df9",
               "name": "Gloria Delaney ",
               "profile_path": null,
               "id": 543354,
               "order": 6
            },
            {
               "cast_id": 1016,
               "character": "'Half Dead' Johnson",
               "gender": 2,
               "credit_id": "52fe470ac3a368484e0b1e1f",
               "name": "Badja Djola",
               "profile_path": "/i5j8WpNKydvBs2Vu3cYJyXNBy3V.jpg",
               "id": 107009,
               "order": 7
            },
            {
               "cast_id": 1008,
               "character": "Lieutenant Arnsworth",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1dfd",
               "name": "Chuck Mitchell ",
               "profile_path": null,
               "id": 543356,
               "order": 8
            },
            {
               "cast_id": 1009,
               "character": "Poindexter",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e01",
               "name": "Cepheus Jaxon ",
               "profile_path": null,
               "id": 543357,
               "order": 9
            },
            {
               "cast_id": 1010,
               "character": "Lying Latney Winborn",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e05",
               "name": "Dwaine Fobbs ",
               "profile_path": null,
               "id": 543358,
               "order": 10
            },
            {
               "cast_id": 1011,
               "character": "Cheese",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e09",
               "name": "Ernest Wilson ",
               "profile_path": null,
               "id": 543359,
               "order": 11
            },
            {
               "cast_id": 1012,
               "character": "Magilla Gorilla",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e0d",
               "name": "Will Richardson ",
               "profile_path": null,
               "id": 543360,
               "order": 12
            },
            {
               "cast_id": 1013,
               "character": "Nut #1",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e11",
               "name": "Elijah Mitchell ",
               "profile_path": null,
               "id": 543361,
               "order": 13
            },
            {
               "cast_id": 1014,
               "character": "Mook",
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e15",
               "name": "Tony Andrea ",
               "profile_path": null,
               "id": 543362,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 0,
               "credit_id": "52fe470ac3a368484e0b1e1b",
               "name": "Jamaa Fanaka",
               "profile_path": null,
               "id": 932993,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5876f351c3a36850e30019eb",
               "name": "Jamaa Fanaka",
               "profile_path": null,
               "id": 932993,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Action",
            "id": 28
         },
         {
            "name": "Drama",
            "id": 18
         }
      ],
      "popularity": 1.247485,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 65448,
      "vote_count": 9,
      "budget": 0,
      "overview": "A hitchhiker named Martel Gordone gets in a fight with two bikers over a prostitute, and one of the bikers is killed. Gordone is arrested and sent to prison, where he joins the prison's boxing team in an effort to secure an early parole and to establish his dominance over the prison's toughest gang.",
      "similar": [
         1701,
         278,
         107846,
         10734,
         29381,
         29259,
         5925,
         9291,
         1368,
         1429,
         708,
         76640,
         38234,
         2832,
         5924,
         398175,
         10447,
         5971,
         575,
         12437
      ],
      "original_title": "Penitentiary",
      "runtime": 99,
      "poster_path": "/r9kZIOVwSA9Ojk4X2KDlDfIRNy6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1979-12-01",
      "vote_average": 5.5,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Penitentiary Collection",
         "id": 380822,
         "poster_path": null
      },
      "tagline": "There's only one way out, and 100 fools stand in the way!",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Jamaa Fanaka"],
      "runtime": 99,
      "synopsis": null,
      "writers": ["Jamaa Fanaka"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0079709/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzMjI0Mjk0MF5BMl5BanBnXkFtZTcwNzIwOTc2NA@@._V1_SX214_AL_.jpg",
      "actors": ["Stars: Wilbur 'Hi-Fi' White, Leon Isaac Kennedy, Thommy Pollard | See full cast and crew »"],
      "reviews": [
         "I read in an article that \"Penitentiary\" is one of John Singelton's favorite films. I can see why. It is an film that is kind of like an \"acquired taste\". It has its own audience. Hard-hitting, intense, and memorable, with some very well done casting, especially bad-man Badja Djola as \"Half Dead\". The musical score takes great risks that ultimately pay off. There is one part during the terrific fight scene between Too-Sweet and Half-Dead where there is no score, just screeching. Another interesting point, in Penitentiary 2, Ernie Hudson is just as good as Half-Dead's replacement.",
         "Surprise, surprise blaxpo fans the movie that started off the penitentiary series is available. No, it's not the one with Mr. T (penitentiary II) or that horrible one with the midget. (penintiary III) This is the one with the original too sweet, half dead and seldom seen. Despite the fact this movie is the epitome of low budget, try to find the boom mike in some scenes. This remains one of my favorite cult films. The cinemetography is pretty good. The fight between Too sweet and Half dead is particularly interesting. The use of the Wide angle lenses to give the viewer a distorted view. And the way some characters address the camera. Look were not talking Citizen Knae here, but it still is interesting. That's not what impresses me most about this movie. It's the fact it transends the usual blacksploitation stereotypes. They are still there but also there is also a lot of truth within it's characterizations. Seldom seen character is no caricature he's a real. (He plays too sweet's trainer.) I was amazed at how realistic his portrayal of an institutionalized convict was. We really get to understand him and why he does what he does. Another interesting thing about this movie is the character half dead (Badja Djola) was hilarious. (You want some Mr. goodbar) You might remember him from the dozens of movies she's appeared in afterward (a rage in harlem, mississippi burning and other films) I also liked the fact that this was funny (mostly) but it also contained moments of dead seriousness. If you are any kind of fan of blacksploitation movies, or cult movies in general check this one out. If you can find it.",
         "Lowlife scum's, trashola conns and pscyhotronics check this one out! A masterpiece of exploitation, PENITENTIARY(1979) is especially worth watching because of it's strange, neo-realism. Often I enjoyed watching wall-hangings or shoes for it's 70s appeal as much as the foreground action! An almost all-unknown cast (that also contributes a lot to the movie's appeal), realistic 1970s African American dialog and backgrounds, realistic and mind-bending scenes of perverse violence and huge doses of humor make this a blast in every department. Very realistic scenes of prison -- including sexual -- life, and the knowledge that this was NOT written by some Hollywood screenwriter (and same-schmuk's idea of \"what prison must be like\"), along with the near-documentary feel make this a must-see. I've seen 100s so-called Hollywood \"action\" films in the last few years, most of which I remember nothing about (\"Was that the one with Stallone or Bruce Willis?\"), and each of which cost 100s of times as much as the unforgettable PENITENTIARY! Note: Don't miss PEN 2 (the debut of Mr. T., and a Rudy Ray Moore cameo, no less); and PEN 3, which many believe to be the best of the three. But, the first will always be may favorite. Oh yeah -- the PLOT involves boxing matches in a corrupt ('natch) prison, but thankfully rarely gets in the way of the fun and action!",
         "Xenon deserves a big nod for releasing these long lost 70s blaxploitation movies on home video. PENITENTIARY does have some enjoyable moments, including the wild boxing matches. This one obviously takes the sleaze-o route than being a fulfilling and motivating drama about prison life, something this really should've been meant for. A good story, but it drags miserably in acting performances and a sense of weirdness. If you want to see how cheap production values do exist, then don't blink when a close-up view of an inmate actually isn't holding the knife to thrust the guy's chest in. Good fun for \"blaxplo\" fans, but the majority of us would pass this up and stick to the ROCKY movies.",
         "When this movie premiered in 1979 it was a sellout at our local $1 Theater in Dallas called the Texas (where Lee Harvey Oswald was caught).It played their several weeks and also at another local Hangout called the Aquarius. I am not sure why it was so popular,but I think it was because it was the Rawest,grittiest,downright Adult movie to deal with the consequences of committing a crime against others. This is a GRindHouse Original.Weak story line,but common. Poor cinematography ,but effective. Prison is not pleasant and this film was not pleasant. Ultra violent ,yet comical...? Love scenes in the Men's room are borderline Porn...I saw the premiere with my grandparents! And oh yes..men get anally raped in Prison (see Boondocks episode) This movie was so...So Baad ...that we Loved it. Ps...I have not seen this movie in 22years. So my opinion could change if I see it again...!",
         "Penitentiary (1979) follows the life of Too Sweet, a young man who's life is has taken a very wrong turn. A very tragic and unlucky event lands the dude in prison. Looking at a long stretch in the jug, Too Sweet looks for any opportunity to get out of the joint. Finally a big break comes along, boxing. But like all good guys, he makes a very nasty enemy in the guise of Half Dead, a cruel sadistic inmate who doesn't take a liking to our young hero. How did Too Sweet get in Prison? Can Too Sweet fight is way out of prison? Why does Half Dead want Too Sweet's head? Who in the hell is Peaches? All your questions will be answered when you watch Penitentiary! Highly recommended for fans of low budget films.",
         "A man is wrongly imprisoned for murder. While in the penitentiary he gets involved in a boxing competition that the prison hosts. Penitentiary is a somewhat odd blaxploitation movie. It seems to be a curious mix of realism and ridiculousness. While on the one hand, the idea of a prison boxing competition where the male and female inmates can get together is a very silly idea. But on the other hand, the movie also deals with issues of institutionalisation and the tone overall is often quite sombre. So it's a strange combination. It has to be said though that the best moment is the excellent fight scene between the hero and his psychotic cell mate. It's a pretty ferocious and exciting affair and I suppose just emphasises that Penitentiary is definitely a fight film over and above anything else. This is definitely a good example of its type. It's certainly not a typical prison drama though that's for sure. It even spawned a couple of sequels that recycled the same idea to ever more ridiculous extents. It's certainly one of the least likely franchises you could imagine.",
         "Boxer Martel \"Too Sweet\" Gordone (a fine and likable performance by Leon Isaac Kennedy) gets sent to jail on a trumped-up murder charge. Too Sweet joins the prison boxing team in order to secure an early parole. However, Too Sweet runs afoul of fierce top con Jesse Amos (well played by Donovan Womack) and his deranged flunky Half Dead Johnson (a memorably crazed and over the top portrayal by Badja Djola). Writer/director Jamaa Fanaka delivers a funky, funny, and flavorsome depiction of the harsh reality of life behind bars: deprived of women, surrounded by nothing but men (Fanaka's frank and honest treatment of homosexuality in the big house is especially admirable and impressive), yearning for freedom, and bereft of hope. The fight scenes are extremely brutal and exciting, with the high stakes match between Too Sweet and Amos rating as a surefire savage and gripping highlight. The movie's wickedly off the wall sense of humor qualifies as another major asset (the rowdy lady inmate audience members from a neighboring all-female prison are positively hilarious!). The inmates are a colorful and entertaining bunch. The acting is pretty raw, yet sincere and effective, with stand-out contributions by Floyd Chatman as Too Sweet's wise, tough elderly trainer Hezzikia \"Seldom Seen\" Jackson, Thommy Pollard as the proud Eugene T. Lawson, Hazel Spears as sassy'n'sultry hooker Linda, Chuck Mitchell as the no-nonsense Lieutenant Arnsworth, and Gloria Delaney as the lusty Peaches. Marty Ollstein's gritty cinematography gives the picture an appropriately grainy and unpolished look and makes inspired use of hand-held camera during the rough'n'tumble boxing matches. The groovy score by William Anderson and Frankie Gaye also does the right-on pulsating trick. As an added saucy plus, we even get a few incredibly raunchy sex scenes set in the prison bathroom (!). A solid and satisfying outing.",
         "I saw this film with a pal over twenty years ago at the theater, first-run. I sat there amazed at how wincingly terrible it was from start to finish. After about forty-five minutes my friend (who was a drama student at the time) wanted desperately to leave the theater. I refused, explaining that in the years to come we would both look back at this film as a standard for cinema awfulness. I was right."
      ],
      "genres": [
         "Crime",
         "Drama",
         "Sport"
      ],
      "productionCompanies": ["Jamaa Fanaka Production"],
      "summaries": ["A hitchhiker named Martel Gordone gets in a fight with two bikers over a prostitute, and one of the bikers is killed. Gordone is arrested and sent to prison, where he joins the prison's boxing team in an effort to secure an early parole and to establish his dominance over the prison's toughest gang."],
      "budget": 100000
   },
   "movielensId": 2954,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1979-12-01",
      "dvdReleaseDate": "2000-06-20",
      "directors": ["Jamaa Fanaka"],
      "runtime": 99,
      "movieId": 2954,
      "title": "Penitentiary",
      "mpaa": "R",
      "actors": [
         "Wilbur 'Hi-Fi' White",
         "Leon Isaac Kennedy",
         "Thommy Pollard ",
         "Hazel Spears ",
         "Donovan Womack ",
         "Floyd 'Wildcat' Chatman ",
         "Gloria Delaney ",
         "Badja Djola",
         "Chuck Mitchell ",
         "Cepheus Jaxon ",
         "Dwaine Fobbs ",
         "Ernest Wilson ",
         "Will Richardson ",
         "Elijah Mitchell ",
         "Tony Andrea "
      ],
      "imdbMovieId": "0079709",
      "originalTitle": "Penitentiary",
      "genres": [
         "Action",
         "Drama"
      ],
      "youtubeTrailerIds": ["zInUDi7zdBI"],
      "plotSummary": "A hitchhiker named Martel Gordone gets in a fight with two bikers over a prostitute, and one of the bikers is killed. Gordone is arrested and sent to prison, where he joins the prison's boxing team in an effort to secure an early parole and to establish his dominance over the prison's toughest gang.",
      "tmdbMovieId": 65448,
      "avgRating": 2.35185,
      "releaseYear": "1979",
      "numRatings": 27,
      "posterPath": "/29jkT9PKJFJPRJSNn1o6u82Vwey.jpg"
   }
}