{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "new york",
            "id": 242
         },
         {
            "name": "detective",
            "id": 703
         },
         {
            "name": "marriage",
            "id": 6038
         },
         {
            "name": "murder",
            "id": 9826
         },
         {
            "name": "socialite",
            "id": 156037
         }
      ],
      "imdb_id": "tt0094008",
      "video": false,
      "title": "Someone to Watch Over Me",
      "recommendations": [
         31945,
         19380,
         31618,
         4639,
         41971,
         32035,
         4823,
         69007,
         9409,
         42176,
         24249,
         14864,
         9491,
         9717,
         24073,
         26789,
         23303,
         2071,
         123392,
         58733
      ],
      "backdrop_path": "/hWq1gaTygZTtEIonfCenuwHZ8C5.jpg",
      "revenue": 10278549,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Det. Mike Keegan",
               "gender": 2,
               "credit_id": "52fe44939251416c91015895",
               "name": "Tom Berenger",
               "profile_path": "/gueEBgqv1sWFemMXyI4TJ2peuMA.jpg",
               "id": 13022,
               "order": 0
            },
            {
               "cast_id": 3,
               "character": "Claire Gregory",
               "gender": 1,
               "credit_id": "52fe44939251416c91015899",
               "name": "Mimi Rogers",
               "profile_path": "/cTXSghmtclAmeTSg4lBBjeOwpoQ.jpg",
               "id": 13920,
               "order": 1
            },
            {
               "cast_id": 4,
               "character": "Ellie Keegan",
               "gender": 0,
               "credit_id": "52fe44939251416c9101589d",
               "name": "Lorraine Bracco",
               "profile_path": "/8khTSZIrHEMbBiH6HSAOzOnnbmB.jpg",
               "id": 11478,
               "order": 2
            },
            {
               "cast_id": 5,
               "character": "Lt. Garber",
               "gender": 2,
               "credit_id": "52fe44939251416c910158a1",
               "name": "Jerry Orbach",
               "profile_path": "/95n3bLxEv1kRCwyfpA30J1IEc7N.jpg",
               "id": 725,
               "order": 3
            },
            {
               "cast_id": 6,
               "character": "Neil Steinhart",
               "gender": 2,
               "credit_id": "52fe44939251416c910158a5",
               "name": "John Rubinstein",
               "profile_path": "/jyHEmKDxlCCxWnsM8hPoCpj0Bn.jpg",
               "id": 44261,
               "order": 4
            },
            {
               "cast_id": 7,
               "character": "Joey Venza",
               "gender": 2,
               "credit_id": "52fe44939251416c910158a9",
               "name": "Andreas Katsulas",
               "profile_path": "/z1bbvx6O7VWGrtxCFugo5aCyqMS.jpg",
               "id": 43773,
               "order": 5
            },
            {
               "cast_id": 8,
               "character": "T.J.",
               "gender": 2,
               "credit_id": "52fe44939251416c910158ad",
               "name": "Tony DiBenedetto",
               "profile_path": null,
               "id": 138116,
               "order": 6
            },
            {
               "cast_id": 9,
               "character": "Koontz",
               "gender": 2,
               "credit_id": "52fe44939251416c910158b1",
               "name": "James E. Moriarty",
               "profile_path": null,
               "id": 141631,
               "order": 7
            },
            {
               "cast_id": 10,
               "character": "Win Hockings",
               "gender": 2,
               "credit_id": "52fe44939251416c910158b5",
               "name": "Mark Moses",
               "profile_path": "/98Pkb6phOJldkCHud8MXt7ftFL4.jpg",
               "id": 11889,
               "order": 8
            },
            {
               "cast_id": 11,
               "character": "Scotty",
               "gender": 2,
               "credit_id": "52fe44939251416c910158b9",
               "name": "Daniel Hugh Kelly",
               "profile_path": "/6eZZbAZsupu3WHHtW3tud3o0F1u.jpg",
               "id": 22111,
               "order": 9
            },
            {
               "cast_id": 12,
               "character": "Tommy Keegan",
               "gender": 2,
               "credit_id": "52fe44939251416c910158bd",
               "name": "Harley Cross",
               "profile_path": "/ho11xBDWXeJP6ub4b4e7XmYx9dL.jpg",
               "id": 35547,
               "order": 10
            },
            {
               "cast_id": 13,
               "character": "Helen Greening",
               "gender": 1,
               "credit_id": "52fe44939251416c910158c1",
               "name": "Joanne Baron",
               "profile_path": "/cd9dbkbTcDTtFWli2YrkYMgiwGU.jpg",
               "id": 59846,
               "order": 11
            },
            {
               "cast_id": 14,
               "character": "Waiter",
               "gender": 0,
               "credit_id": "52fe44939251416c910158c5",
               "name": "Anthony Bishop",
               "profile_path": null,
               "id": 141632,
               "order": 12
            },
            {
               "cast_id": 15,
               "character": "Cop #1",
               "gender": 0,
               "credit_id": "52fe44939251416c910158c9",
               "name": "David Berman",
               "profile_path": null,
               "id": 141633,
               "order": 13
            },
            {
               "cast_id": 16,
               "character": "Bimbo",
               "gender": 0,
               "credit_id": "52fe44939251416c910158cd",
               "name": "Sharon K. Brecke",
               "profile_path": null,
               "id": 141634,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe44939251416c91015891",
               "name": "Ridley Scott",
               "profile_path": "/oTAL0z0vsjipCruxXUsDUIieuhk.jpg",
               "id": 578,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "52fe44939251416c910158d3",
               "name": "Howard Franklin",
               "profile_path": "/fio3AI3ApZYclhP59vf8tMZNooC.jpg",
               "id": 2357,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 0,
               "credit_id": "52fe44939251416c910158d9",
               "name": "Colleen Atwood",
               "profile_path": "/4hbAdhvoCkENdoFDLKdXck1ESIl.jpg",
               "id": 557,
               "department": "Costume & Make-Up",
               "job": "Costume Design"
            }
         ]
      },
      "genres": [
         {
            "name": "Crime",
            "id": 80
         },
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "Romance",
            "id": 10749
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 4.502932,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 31650,
      "vote_count": 48,
      "budget": 17000000,
      "overview": "In Queens, Mike Keegan is celebrating with his wife Ellie, his son Tommy and friends his recent promotion to detective in a precinct in Manhattan. Meanwhile, in a fancy club, the socialite Claire Gregory witnesses the murder of the owner of the place by the powerful mobster Joey Venza. Mike is assigned to protect her in the night shift in her apartment in Manhattan. When Venza threatens Claire, the contact of Mike with Claire gets closer and conflicts him, dividing between the love for his family and the heat passion for Claire and the fascination for her world.",
      "similar": [
         984,
         2749,
         15069,
         12150,
         807,
         4771,
         75780,
         357096,
         445954,
         10651,
         11423,
         18587,
         4639,
         26390,
         37645,
         1949,
         979,
         101,
         281,
         281957
      ],
      "original_title": "Someone to Watch Over Me",
      "runtime": 106,
      "poster_path": "/3N0VBgafdANJjVulHlbdXItLJb6.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [{
         "logo_path": "/71BqEFAF4V3qjjMPCpLuyJFB9A.png",
         "name": "Columbia Pictures",
         "id": 5,
         "origin_country": "US"
      }],
      "release_date": "1987-10-09",
      "vote_average": 5.9,
      "belongs_to_collection": null,
      "tagline": "Where protection ends, obsession begins.",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Ridley Scott"],
      "runtime": 106,
      "synopsis": null,
      "writers": ["Howard Franklin"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0094008/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BNTIwMTU0NDQwM15BMl5BanBnXkFtZTYwOTU3Mjg5._V1_.jpg",
      "actors": ["Stars: Tom Berenger, Mimi Rogers, Lorraine Bracco | See full cast and crew »"],
      "reviews": [
         "I saw this movie when I was younger and for some reason it always stuck with me. I'll always remember the music (the title song as well as the classical pieces used throughout), the vestibule of Mimi Roger's apartment palace, the scene of Tom Berenger having breakfast with his family, Lorraine Bracco's fiery performance as his wife, and the haunting opening aerial shots of NYC lit up at night. I watched it again for the first time in probably nine or ten years and it was like visiting with an old friend or curling up with a good book you had read before. You knew the story, but it was all fascinatingly interesting. The plot here is pretty basic: working class cop has to babysit upper class babe who witnesses heinous murder. It doesn't take a rocket scientist to figure out how it all ends, but director Ridley Scott somehow manages to keep it compelling thanks to some great direction and wonderful performances from the cast. Somewhere I saw this billed as an erotic thriller, which is way off base. Scott keeps everything here extremely classy. It's more of a romantic thriller and throwback to the noir films of the 1940's. This may not be the best film you'll ever see, but it's one of the better thrillers of the 1980's, and a worthy testament to Ridley Scott's versatility as a director. It's also nice to see Jerry Orbach in a supporting role that probably paved the way for his part in the never ending \"Law and Order\" TV series.",
         "This has been one of my favorite movies. I admit that this is not something that might be recognized by academy people. There is nothing new and original about the story and situation and it is rather easy to guess what would happen next. But somehow it is an attractive movie (to me?) and I keep watching it over and over (I have a video). Actors are good and the view of New York is wonderful in every part of the movie. Most of all music is superb! Ever since I first saw this movie, \"Someone to watch over me\" has been my favorite jazz standard. One more thing. If somebody else directed this it might have been VERY boring. Great touch by Ridley Scott.",
         "In Queens, Mike Keegan (Tom Berenger) is celebrating with his wife Ellie (Lorraine Bracco), his son Tommy and friends his recent promotion to detective in a precinct in Manhattan. Meanwhile, in a fancy club, the socialite Claire Gregory (Mimi Rogers) witnesses the murder of the owner of the place by the powerful mobster Joey Venza (Andreas Katsulas). Mike is assigned to protect her in the night shift in her apartment in Manhattan. When Venza threatens Claire, the contact of Mike with Claire gets closer and conflicts him, dividing between the love for his family and the heat passion for Claire and the fascination for her world. Today I have just watched \"Someone to Watch Over Me\" maybe for the sixth or seventh time, and every time I see this movie, I conclude that it is an underrated stylish masterpiece. Everything works perfectly in this film. The story may be not original, the conclusion is quite moralist, but there is an important and unusual approach regarding the difference of classes and consequently of worlds, which is the basis for the conflictive romance between Claire and Mike. The direction of Ridley Scott is tight and perfect, as usual, using different angles camera and magnificent photography and shadows in the night, to express the differences between the two worlds. There is one specific scene that I love, when Mike is sat with his face half illuminated in the hall of Claire's apartment, totally confused and with his feelings divided. The cast is very inspired, and in my opinion, this is the best role of Mimi Rogers, amazingly perfect as an elegant, wealthy and needy of love woman and wearing a beautiful hair style. Tom Berenger is outstanding as Mike, and Lorraine Bracco is also fantastic in the role of a simple woman and wounded wife. The music score is awesome, highlighting the three versions of the song of George and Ira Gershwin, which gives the title of the film, specially the last one with the interpretation of Roberta Flack. My vote is ten. Title (Brazil): \"Perigo na Noite\" (\"Danger in the Night\")",
         "A highly stylized crime thriller that also manages to work as a tale of adulterous romance in addition to an effective parable of the culture clashes that are apparent between the upper and lower classes. This is a film with multiple agendas, and Ridley Scott, best known at the time for 1979's ALIEN and 1982's BLADE RUNNER, is frankly an odd choice to direct such a picture. However, Scott proves himself to be up to the challenge, and film plays like a slightly abstract dream that isn't afraid to crash down into gritty realism on occasion. With his film noir skills perfected with BLADE RUNNER, Scott turns the focus from the future to an equally idealized version of the present (well, 1987 to be exact), but he maintains the same sense of visual menace and harsh industrialism. Tom Berenger has received a considerable amount of criticism for the irritating fake Brooklyn accent he delivers his lines in, but I overall I found him to be quite acceptable in the role. Even better is Mimi Rogers, who convincingly portrays the detached loneliness of the high society lifestyle without the benefit of screen dialogue that permits her to openly address such an issue. Jerry Orbach and John Rubinstein are also memorable supporting parts, but it is Lorraine Bracco who steals the picture as Berenger's feisty wife. Long before she was best known as Tony Soprano's psychiatrist, Bracco brought to the screen the ultimate portrayal of the modern wife and mother - loving but fierce, tough but compassionate, and not afraid to slap some sense into the man who has done her wrong. And I love Sting's opening rendition of the title Gershwin classic.",
         "We've seen the script a hundred times if we've seen it once; happily married cop assigned to stand guard over a beautiful woman, cop falls in love with woman, etc. The difference with this one is that it actually works, even though you know how the story is going to go. Berenger is solid in the lead and Bracco fantastic as the fiery wife, while Rogers is sultry in a very classy way as the other woman. Andreas Katsulas is menacing and scary as Venza, which was perfect for this part. The classical music scores add a perfect touch, and the ending is actually quite thrilling. Something about this one just clicks, making it one of the better films of the genre. 7.5 out of 10.",
         "As other reviewers have noted, the story is none too special, quite generic. But even a generic story can be made memorable by good writing, good acting, and good directing; this movie has all three of those. Tom Berenger as the somewhat naive and vulnerable work-class junior detective. Mimi Rogers (who I did not even recognize initially, with the 80's hairstyle), as the upper-class murder witness. And even the supporting cast were all great. Nobody overacted, and no cliches. I credit the director, Ridley Scott, for keeping it low-key and believable.",
         "Solid thriller about a NYC detective protecting a rich socialite from the killer that she saw in the commission of a murder. Tom Berenger, Mike Keegan, is great as a NYC cop, sporting a very good New York City working-class class accent, being assigned on his first case as a NYC detective to keep eye-witness Mimi Rogers, Claire Gregory, alive and well to identify the murderer Andreas Katsulas, Joey Venza, of a nightclub owner Mark Moses, Win Hockings, who was a good friend of hers. Det. Keegan falls in love with the beautiful, which is obvious to everyone watching the movie, Miss.Gregory which ends up almost wrecking his marriage as well as his job to no fault of his own under the circumstances that he was put in, the guy's only human! With Mimi Rogers giving one of her best performances as a woman who's life is turned upside down by what she saw. And Andreas Katsulas is terrifyingly effective as the psycho killer who's out to stop Miss.Gregory from talking to the police. Very good interacting between Tom Berenger and his wife in the movie Ellie, Lorraine Bracco, on how the rigors of Det.Keegan being a cop in a big city can create havoc for his family as well as his professional life with a frightening and suspenseful ending that strikes home in more ways then one. \"Someone to watch over me\" has a good story and great acting all around with Lorraine Bracco a real stand out in one of the best police thrillers of the 1980's.",
         "Brooklyn detective (Berenger) gets promoted & has new assignment - Keep watch over rich & sultry Manhattanite Claire Gregory (Mimi Rogers) becuz she witnessed a murder. NEVER pair up 2 good-looking people for night time (or daytime) close association no matter HOW solid one's marriage is!! And why not? Becuz THIS could happen! 'Watch' this film & find out. Berenger looks fit & handsome as usual, especially back in the '80's. Rogers should have gotten a better hairdo. Larrainne Bracco, a NY favorite of mine, is just great in this role. Jerry Orbach, Berenger's superior is another NY favorite of mine. Tony DiBenedetto (the big burly limo driver from My Favorite Year) was also 'on the watch' & played Berenger's best friend. The most annoying thing about this film is the slow awful tune sung by Sting here! When the credits role in the beginning, we're shown The Big Bad Apple in all it's glory, lit up in the dark like nobody's business! But that song makes you just want to fast-forward!! Arrrgh!! Then he sings it again at the end!! Arrrgh!!",
         "Brooklyn Detective Tom Berenger is assigned to watch over socialite Mimi Rogers after she witnesses a brutal murder where a high profile Mafioso is involved. Berenger gets caught between two worlds; the upper class one he takes a liking to and the normal one (with a wife and kid) in the slums of Queens which he seems to be tiring of. Highly stylish drama/thriller courtesy of Ridley Scott, who directs with his usual visual flair and examines the world of the wealthy seen through the eyes of a middle class voyeur and mixes in some solid suspense to boot. The drama aspect is well handled, pitting Berenger in a dire situation where he must ultimately choose between a life he's already made for himself and a life that can seem very tempting from his perspective. Suspense is also plenty with some fantastic sequences, particularly one inside Mimi Rogers' apartment, not too unlike Dario Argento's Opera in some respects (and even beat it by a year, I think). Tom Berenger does well in the lead, displaying easily the conflicts his character is facing, Rogers is a stunner and gives a subdued and convincing performance. The usually intolerable Lorraine Bracco gives a forceful performance, and one the whole her relationship with Berenger is not only well played out but wholly believable. Recommended.",
         "\"Someone To Watch Over Me\" is a visual treat with some exceptionally beautiful shots (such as those of New York City at night and a number of stunning interiors) which together with a marvellous musical score contribute strongly to the movie's incredibly rich atmosphere. Murder, adultery and class distinction are at the heart of the story and interestingly, no gloss is applied to the depiction of any of these subjects. Instead, the focus is on the powerful impact they all have on the various people involved. Newly promoted police detective Mike Keegan (Tom Berenger) is given responsibility for protecting a wealthy Manhattan socialite Claire Gregory (Mimi Rogers) whose life is in danger because she was the only person who witnessed the brutal murder of one of her close friends. The job involves Mike spending time in Claire's luxurious apartment and accompanying her to a variety of social events. He soon becomes attracted to Claire and her glamorous lifestyle; she appreciates the level of security his presence provides and soon the unlikely couple fall in love. Mike's wife Ellie (Lorraine Bracco) becomes suspicious about the nature of his relationship with Claire and his tacit admission about their affair leads to the break up of his family. Mobster Joey Venza (Andreas Katsulas) who had attempted to kill Claire immediately after she witnessed him killing her friend, then takes Ellie and her son hostage and what follows leads to the threat on Claire's life being removed permanently. Claire's comfortable existence changed radically after she witnessed the murder as she became more fearful and had her life threatened by the psychotic killer. The level of freedom she'd previously enjoyed also became considerably more restricted and her affair with Mike led to her stuffy fiancé being dumped and Mike's wife being emotionally devastated by what had happened. Mike's first assignment as a detective led to his life being put in extreme danger and also to him experiencing a great deal of emotional turmoil over his relationship with Claire. The effect this had on his marriage (which had always previously been a happy one) was also painful and his conduct and handling of the case drew severe criticism from his superiors. Ultimately the intensity of Mike's anguish and Claire's desolation are both incredibly profound. \"Someone To Watch Over Me\" is a romantic thriller which is beautifully directed by Ridley Scott and features consistently good performances by its talented cast. Lorraine Bracco provides the stand out performance as Mike's feisty, down-to-earth wife whose instincts are totally reliable and Andreas Katsulas' physiognomy and bearing make him the perfect choice for the story's villain."
      ],
      "genres": [
         "Action",
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "productionCompanies": ["Columbia Pictures Corporation"],
      "summaries": [
         "In Queens, Mike Keegan is celebrating with his wife Ellie, his son Tommy and friends his recent promotion to detective in a precinct in Manhattan. Meanwhile, in a fancy club, the socialite Claire Gregory witnesses the murder of the owner of the place by the powerful mobster Joey Venza. Mike is assigned to protect her in the night shift in her apartment in Manhattan. When Venza threatens Claire, the contact of Mike with Claire gets closer and conflicts him, dividing between the love for his family and the heat passion for Claire and the fascination for her world.",
         "Claire Gregory has accidentally witnessed a murderer committing his crime. Fortunately she manages to escape and New York cop Mike Keegan is assigned to protect Claire. He risks his job and his marriage when he falls in love with Claire. Will he find the murderer and will he save his marriage?",
         "A married New York cop falls for the socialite murder witness he's been assigned to protect."
      ],
      "budget": 17000000
   },
   "movielensId": 2956,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1987-10-09",
      "dvdReleaseDate": "1999-10-19",
      "directors": ["Ridley Scott"],
      "runtime": 106,
      "movieId": 2956,
      "title": "Someone to Watch Over Me",
      "mpaa": "R",
      "actors": [
         "Tom Berenger",
         "Mimi Rogers",
         "Lorraine Bracco",
         "Jerry Orbach",
         "John Rubinstein",
         "Andreas Katsulas",
         "Tony DiBenedetto",
         "James E. Moriarty",
         "Mark Moses",
         "Daniel Hugh Kelly",
         "Harley Cross",
         "Joanne Baron",
         "Anthony Bishop",
         "David Berman",
         "Sharon K. Brecke"
      ],
      "imdbMovieId": "0094008",
      "originalTitle": "Someone to Watch Over Me",
      "genres": [
         "Crime",
         "Drama",
         "Romance",
         "Thriller"
      ],
      "youtubeTrailerIds": ["ErFGGccIfkc"],
      "plotSummary": "In Queens, Mike Keegan is celebrating with his wife Ellie, his son Tommy and friends his recent promotion to detective in a precinct in Manhattan. Meanwhile, in a fancy club, the socialite Claire Gregory witnesses the murder of the owner of the place by the powerful mobster Joey Venza. Mike is assigned to protect her in the night shift in her apartment in Manhattan. When Venza threatens Claire, the contact of Mike with Claire gets closer and conflicts him, dividing between the love for his family and the heat passion for Claire and the fascination for her world.",
      "tmdbMovieId": 31650,
      "avgRating": 3.14776,
      "releaseYear": "1987",
      "numRatings": 961,
      "posterPath": "/3N0VBgafdANJjVulHlbdXItLJb6.jpg"
   }
}