{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "kidnapping",
            "id": 1930
         },
         {
            "name": "farm",
            "id": 4932
         },
         {
            "name": "rescue",
            "id": 10084
         },
         {
            "name": "orphan",
            "id": 13014
         },
         {
            "name": "silent film",
            "id": 154802
         }
      ],
      "imdb_id": "tt0017423",
      "video": false,
      "title": "Sparrows",
      "recommendations": [
         130275,
         355484,
         128229,
         44914,
         49299,
         105981,
         134754,
         133929,
         42842,
         977,
         104287,
         46798,
         91471,
         191381,
         64534,
         44192,
         22595
      ],
      "backdrop_path": "/y7kJRgjLjEMoONJoeQVHBPyqaj7.jpg",
      "revenue": 966878,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 2,
               "character": "Molly",
               "gender": 1,
               "credit_id": "52fe48a1c3a368484e102bdd",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "order": 0
            },
            {
               "cast_id": 6,
               "character": "Dennis Wayne",
               "gender": 2,
               "credit_id": "5429d7efc3a3682d6c00073f",
               "name": "Roy Stewart",
               "profile_path": "/cAiv8E5MEVnlHbGYVUgPjo1mRYA.jpg",
               "id": 10229,
               "order": 1
            },
            {
               "cast_id": 7,
               "character": "Doris Wayne (the baby)",
               "gender": 1,
               "credit_id": "5429d830c3a3682d62000711",
               "name": "Mary Louise Miller",
               "profile_path": null,
               "id": 1366750,
               "order": 2
            },
            {
               "cast_id": 8,
               "character": "Mr. Grimes",
               "gender": 2,
               "credit_id": "5429d840c3a3682d770007ff",
               "name": "Gustav von Seyffertitz",
               "profile_path": "/v1mnrEVtPdSqTpOBHjLPmb2FElm.jpg",
               "id": 13345,
               "order": 3
            },
            {
               "cast_id": 9,
               "character": "Mrs. Grimes",
               "gender": 1,
               "credit_id": "5429d8530e0a260a240007d1",
               "name": "Charlotte Mineau",
               "profile_path": null,
               "id": 21314,
               "order": 4
            },
            {
               "cast_id": 10,
               "character": "Ambrose",
               "gender": 2,
               "credit_id": "5429d864c3a3682d62000717",
               "name": "Spec O'Donnell",
               "profile_path": null,
               "id": 119545,
               "order": 5
            },
            {
               "cast_id": 11,
               "character": "Bailey",
               "gender": 2,
               "credit_id": "5429d8730e0a260a240007da",
               "name": "Lloyd Whitlock",
               "profile_path": "/wP7jqV8wGfJIZyieE3SsKvJ3Rys.jpg",
               "id": 89016,
               "order": 6
            },
            {
               "cast_id": 12,
               "character": "One of the Children",
               "gender": 2,
               "credit_id": "5429d88ac3a3682d5f0007ac",
               "name": "Billy Butts",
               "profile_path": null,
               "id": 1034789,
               "order": 7
            },
            {
               "cast_id": 13,
               "character": "One of the Children",
               "gender": 0,
               "credit_id": "5429d898c3a3682d6200071c",
               "name": "Monty O'Grady",
               "profile_path": "/1yz4sQu0J0EAYvUWvjGgT0udItr.jpg",
               "id": 1368758,
               "order": 8
            },
            {
               "cast_id": 14,
               "character": "One of the Children",
               "gender": 0,
               "credit_id": "5429d8a90e0a260a2a0006f0",
               "name": "Jack Lavine",
               "profile_path": null,
               "id": 1368759,
               "order": 9
            },
            {
               "cast_id": 15,
               "character": "One of the Children",
               "gender": 0,
               "credit_id": "5429d8b9c3a3682d62000721",
               "name": "Billy 'Red' Jones",
               "profile_path": null,
               "id": 144040,
               "order": 10
            },
            {
               "cast_id": 16,
               "character": "One of the Children",
               "gender": 0,
               "credit_id": "5429d8c90e0a260a35000788",
               "name": "Muriel McCormac",
               "profile_path": null,
               "id": 1359006,
               "order": 11
            },
            {
               "cast_id": 17,
               "character": "One of the Children",
               "gender": 0,
               "credit_id": "5429d8d70e0a260a30000766",
               "name": "Florence Rogan",
               "profile_path": null,
               "id": 1368760,
               "order": 12
            },
            {
               "cast_id": 18,
               "character": "One of the Children",
               "gender": 0,
               "credit_id": "5429d8ed0e0a260a27000791",
               "name": "Mary McLain",
               "profile_path": null,
               "id": 938144,
               "order": 13
            },
            {
               "cast_id": 19,
               "character": "Hog Buyer",
               "gender": 0,
               "credit_id": "5429d961c3a3682d73000915",
               "name": "Mark Hamilton",
               "profile_path": null,
               "id": 1368762,
               "order": 14
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe48a1c3a368484e102bd9",
               "name": "William Beaudine",
               "profile_path": "/krWEsV2QBljRm98l2DxtkCPHxjI.jpg",
               "id": 30833,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 0,
               "credit_id": "5429d7750e0a260a240007b3",
               "name": "Tom McNamara",
               "profile_path": null,
               "id": 1158066,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "5429d78a0e0a260a2d000749",
               "name": "C. Gardner Sullivan",
               "profile_path": null,
               "id": 587951,
               "department": "Writing",
               "job": "Adaptation"
            },
            {
               "gender": 0,
               "credit_id": "5429d79d0e0a260a3a0006ae",
               "name": "Winifred Dunn",
               "profile_path": null,
               "id": 1055882,
               "department": "Writing",
               "job": "Story"
            },
            {
               "gender": 1,
               "credit_id": "5429d9850e0a260a2d00077c",
               "name": "Mary Pickford",
               "profile_path": "/1kG12uiv0VPNaPCjbkLkRLTqmIW.jpg",
               "id": 100047,
               "department": "Production",
               "job": "Producer"
            }
         ]
      },
      "genres": [{
         "name": "Drama",
         "id": 18
      }],
      "popularity": 2.779371,
      "production_countries": [{
         "iso_3166_1": "US",
         "name": "United States of America"
      }],
      "id": 73575,
      "vote_count": 13,
      "budget": 463455,
      "overview": "Evil Mr.Grimes keeps a rag-tag bunch orphans on his farm deep in a swamp in the US South. He forces them to work in his garden and treats them like slaves. They are watched over by the eldest, Molly. A gang in league with Mr. Grimes kidnaps Doris, the beautiful little daughter of a rich man, and hides her out on Grimes' farm, awaiting ransom. When the police close in, and Mr. Grimes threatens to throw Doris into the bottomless mire, Molly must lead her little flock out through the alligator-infested swamp.",
      "similar": [
         275,
         270487,
         8681,
         2320,
         2163,
         1523,
         12162,
         4771,
         3131,
         8271,
         9509,
         568,
         10545,
         12405,
         68718,
         44826,
         196867,
         19,
         76203,
         37135
      ],
      "original_title": "Sparrows",
      "runtime": 84,
      "poster_path": "/3ZPfhlwZ9HIYViUCgoZusCszohT.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [
         {
            "logo_path": null,
            "name": "United Artists",
            "id": 60,
            "origin_country": ""
         },
         {
            "logo_path": null,
            "name": "Pickford Corporation",
            "id": 14646,
            "origin_country": ""
         }
      ],
      "release_date": "1926-05-14",
      "vote_average": 7.8,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Black and White",
      "budgetCurrency": "$",
      "directors": [
         "William Beaudine",
         "Tom McNamara"
      ],
      "runtime": 84,
      "synopsis": null,
      "writers": [
         "Winifred Dunn",
         "George Marion Jr."
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0017423/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMTY3MTkyMTc0MF5BMl5BanBnXkFtZTgwOTI5MDgwMjE@._V1_SY317_CR8,0,214,317_AL_.jpg",
      "actors": ["Stars: Mary Pickford, Roy Stewart, Mary Louise Miller | See full cast and crew »"],
      "reviews": [
         "We take home video and DVDs for granted now, but for film buffs who grew up prior to the video era some silent movies weren't so easy to track down. They weren't frequently aired on TV, and when they were shown, unfortunately, they were sometimes treated as laughable relics with \"funny\" interpolations. Thankfully, vendors such as Blackhawk offered good prints of many vintage titles in 8mm and 16mm formats, and museums in some cities would schedule occasional screenings. Consequently, as a kid I was able to catch memorable performances by Lon Chaney, Valentino, William S. Hart, and most of the great comedians. Mary Pickford, however, remained elusive. Aside from a few early Biograph dramas most of her movies were locked away in vaults, and shown only rarely. Awareness of her phenomenal fame lingered, but the movies that brought it about were difficult to see. I had only a vague sense of Mary's screen persona, and imagined she must have been an earlier incarnation of Shirley Temple, a goody two-shoes with blonde ringlets whose vehicles were mostly tear-jerkers. Eventually, of course, the situation changed, restoration efforts commenced, and Mary's films began to emerge from hibernation. In the 1980s Sparrows became one of the first Pickford classics to become available on good quality VHS, and once I saw it I understood Mary's appeal. Seeing it again recently on the big screen, at a Pickford festival at the Museum of the Moving Image in Queens, New York, only confirmed my first impression that this is one of the most beautifully produced silent dramas anyone ever made. It isn't flawless, and it isn't for all tastes, but it's powerful, moving and unforgettable, and the leading lady gives one of her definitive performances. Sparrows is essentially a thriller, at times close to a horror story. Our setting is a bleak \"baby farm\" in a swampy bayou that looks like a landscape by Hieronymus Bosch. Mary plays an adolescent known as Mama Molly who acts as a protective maternal figure to a gang of scruffy, starving kids. These are children who have been sent away by families too poor to care for them, well-intentioned folk who naively believe their children will be raised properly. The farm is run by the most evil family you'll find in the movies: old Mr. Grimes, his wife, and her son, played by top character actors Gustav von Seyffertitz, Charlotte Mineau, and Spec O'Donnell. Both Mineau and O'Donnell had backgrounds in comedy, but their performances here are deadly earnest and without a trace of humor. Good as they are, however, they're topped by Von Seyffertitz in what he must have recognized as the role of a lifetime. Grimes is a Dickensian monster: a greedy, spindly, limping man with dead eyes and no conscience. His prison-like farm is surrounded by quicksand and alligator-infested swampland. The children in his keeping are treated as his property, and he'd sell any one of them down the river for a few coins. At the screening I attended a child in the audience responded to Grimes' evil-doing by loudly announcing: \"He's baaaaaaaaaaaaaaaad!\" We laughed, but the kid only said aloud what we were all thinking. Mama Molly occupies the story's moral center, but she's no goody two-shoes. She's been toughened by adversity, and she's fiercely protective of the youngsters in her charge. When Grimes' horrible step-son bullies them she is quick to stand up to him. And when Grimes threatens to punish the children by withholding their dinner, all because of a minor infraction on Molly's part, she volunteers to go without food for two days rather than see the children suffer. She is also the primary caregiver for a sickly baby who, despite her best efforts, dies one night in the loft of the old barn. In a scene some viewers may find a bit sticky, an image of Jesus appears at the moment of the baby's death and carries him away to the after-life. Sentimental? Sure, but it's performed with absolute conviction, and the close-up of Mary that concludes this scene is deeply affecting. (At the recent museum screening I attended we were shown several rejected takes of an earlier version of this scene in which the baby's spirit is carried away to the heavens by a phosphorescent angel. The out-takes were fascinating, but I feel the scene works better as it stands.) Much of the credit for this film rightfully belongs to the scenic designer, Harry Oliver, and to the crack team of cinematographers, Charles Rosher, Hal Mohr, and Karl Struss. All of these artists have numerous impressive credits to their names, but their collaboration in this case produced something extraordinary, a movie that is exceptionally beautiful in its design as well as beautifully photographed and edited. It's said that the production was influenced by the work of such German auteurs as Murnau and Lang, and indeed the film has a distinctly \"Germanic\" atmosphere, but with greater emphasis on audience empathy; that is, the filmmakers really want you to feel for these kids. Our emotions peak during the climactic escape, when Molly leads the children through the swamp to freedom. Pursued by Grimes' dogs they dash across rocks, narrowly missing the quicksand, then climb trees and crawl over branches hovering just above alligators that swarm and snap. It's an amazingly suspenseful sequence. Unfortunately, this is not the film's finale. The escape is followed by a gratuitous action sequence involving kidnappers attempting to flee the police by boat, and when this concludes we still have a couple more scenes meant to tie-up the plot's loose strands. If the last twenty minutes or so had been reduced to a brisk seven or eight, the movie would have been just about perfect. Nothing can top the escape through the swamp, and it's too bad they made the attempt. Even so, in my opinion Sparrows stands as one of the most memorable works of the silent cinema, and Mary Pickford's crowning achievement.",
         "A spunky orphan girl, enslaved on a horrible baby farm, looks after the younger children as tenderly as Christ cares for His little SPARROWS. Mary Pickford, America's Sweetheart and the most popular movie star in Hollywood's history, had made a career out of playing little girls in general & orphans in particular. Her legions of international fans thrilled at her adventures in harsh orphanages, dealing with stony-hearted adults. Time relentlessly marched on, however, and it became obvious that Little Mary could not carry on the adolescent act forever. Thus, in 1926 at the age of 34, Pickford appeared in her final orphan picture and she made sure it was a doozy. Never before had one of her characters been subjected to such hideous conditions, surrounded by quicksand, starved & overworked, living at the mercy of a self-avowed baby killer - a reptilian old reprobate who doesn't hesitate to `chuck children into the swamp' whenever he feels like it. Mary's audiences ate it up like sweet molasses on hot cornbread. Several sequences are memorable. The selling of a little boy to a hog-buying farmer sets up a remarkably poignant shot: as the little fellow is driven out of the gates of the baby farm he feebly waves farewell towards the barn, where Mary & the other children remain hidden; poking through cracks & crevices in the wooden structure several hands sadly wave back. Later, the coming of The Good Shepherd for the dead baby cradled in Mary's arms would have been maudlin in less reverent hands; here it succeeds because it is presented with true emotion. Finally, the escape & chase across the swamp, with desperate Mary leading eight tiny children through the perils of mud & crocodiles, is still as exciting & suspenseful now as it was at the film's inception. Gustav von Seyffertitz makes a marvelously hissable villain; abetted by his vile wife & unspeakable son, old Grimes is evil to his very core. His final fate is both just & emphatically well-deserved. SPARROWS boasts very high production values, and although burdened with a couple of climaxes too many, Mary's lively performance should effortlessly win over the toughest of critics.",
         "United Artists in the mid-1920's stood outside the motion picture industry's block booking system. It owned no theaters and did not have enough films to offer them in blocks. This meant each of the UA producers (Griffith, Fairbanks, Chaplin, and Pickford) had to finance each film individually; not an easy thing with the rising costs of producing long features. While Griffith was digging himself into a big hole (which would ultimately cost him his production company) making epic films and trying to top his early successes, Pickford prudently operated on a smaller scale. The irony being that she produced the type of folksy stuff that Griffith had once done so well and so profitably. \"Sparrows\" was her last appearance as a teenager; her choice because even in her thirties she would have been physically believable in these roles for a couple more years. Most often described as \"Dickensian\" because of its gloomy feel and slightly off-kilter production design, \"Sparrows\" is the original \"Series of Unfortunate Events\". It is regarded as the least dated of her pictures (maybe of all silents), fitting because it does not seem at all dated. Even the humor seems contemporary with little Molly misquoting bible verses with stuff like: \"Let not thy right cheek know what thy left cheek is getting\". \"Sparrows\" is also more perennially appealing than any silent film. In fact you have to go all the way until 1933's \"It Happened One Night\" to actually supplant it. But it is a serious subject as baby farms are a historical fact and wealthy parents had reasons to fear kidnapping. The kidnapping in \"Sparrows\" has an eerie similarity to that of the Lindbergh baby, which would not take place until seven years \"after\" the film. The \"look\" of the film reflects the German expressionist style and should delight Lemony Snicket fans and anyone who gets off on creepy-strange beauty. Set designer Harry Oliver \"aged the tree stumps with blowtorches, and the entire picture has that netherworld quality of a slightly stylized environment that could only be created in a movie studio\". Watch for the early scene where the baby farm operator crushes the little doll and drops it into the quicksand where it slowly disappears. You also see a lot of Pickford's technique in Hal Roach's \"Little Rascals\". Check out the sequence when Little Splutters is leaving and his imprisoned friends are waving goodbye from inside the barn, by passing their hands through the slats. In fact Spec O'Donnell, who plays nasty stepson Ambrose, would later be a Roach regular. He is responsible for the film's first big laugh when he beans Molly with a turnip while she is trying to get the baby to stop crying. It is totally unexpected and even the baby finds it funny. Also of note is the dream sequence where Jesus comes to take the baby to heaven. Modern special effects could not improve on what they got using a simple matte exposure process. A similar technique worked so well with the swamp scenes that a legend grew up that Pickford and the children were actually at risk from the live alligators used in the scenes. Probably no silent managed a more genuinely suspenseful sequence than when they are crossing a rotting tree limb which is slowly cracking and dipping toward the water full of hungry alligators. Gustav von Seyffertitz does great as the evil Mr. Grimes (an early Snidley Whiplash) and is one of the best bad guys to come out of the silent era. Then again, what do I know? I'm only a child.",
         "SPARROWS (United Artists, 1926), directed by William Beaudine, is a prime example of good vs. evil with a timeless story centering upon abducted children, mostly orphans, being held in bondage on an isolated location surrounded by treacherous swamps and quicksand where they are put through slave labor with little nutrition, only a potato for each, as well as living in constant fear from a \"family man\" named Mr. Grimes, who threatens to throw them into the swamp if they don't behave. Headlining the cast of not-so-well known actors is Mary Pickford, one of the top names of the silent screen, whose performance in SPARROWS has been singled out as the finest and most revived of her long list of film credits. Better known as \"America's Sweetheart,\" Pickford, as one of the \"sparrows\" (title inspired by the Biblical quotation concerning the Lord's attention even to the most humble sparrow) is convincing as the eldest and mother figure to the enslaved children, in spite of being a woman in her thirties, yet, this being her farewell performance as the little girl with pig tails, it's the sort of role moviegoers and film historians remember her best. The opening inter-titles gives much indication as to what's to be seen: \"The devil's share in the world's creation was a certain southern swampland - a masterpiece of horror and the Lord appreciating a good job, let it stand,\" followed by an overview of the location from where the story is set, \"Then the devil went himself one better - and had Mr. Grimes live in the swamp.\" Grimes (Gustav Von Seyffertitz) is then introduced as the title cards read, going one better, seen limping through the swamp land with mosquitoes flying around his head, acquiring a doll to be given to a little girl on his farm, then crushing the doll's head and throwing it into the quicksand as he watches it slowly sinking. Next introduction is Mollie (Mary Pickford) along with the other little orphans flying her kite with a message for help attached. The kite flies away in the wind only to be caught on a tree branch. There goes her plea for help! The \"sparrows\" must hide in the barn whenever the bell rings so that they won't be visible to visitors buying hogs from Mr. Grimes. As the story progresses, Grimes acquires a two-year-old girl (Mary Louise Miller) from a couple of abductors, unaware that she is the daughter of millionaire David Wayne (Roy Stewart). When Grimes learns of the child's identity in the newspapers, and that police are on his trail, he attempts to dispose of the evidence by throwing her into the swamp, but Mollie prevents this, first by using a pitchfork as a weapon against Grimes, and later making a daring escape taking the baby and the other \"sparrows\" with her, risking their lives through the swamps, quicksand and very hungry crocodiles. With this being the highlight, it is followed by a second climatic scene that fails to recapture the initial thrill. With the exception of Pickford and the child actors, much of the supporting players are very much like the Charles Dickens novels, unsympathetic types. Grimes is evil beyond belief; his wife (played by Charlotte Mineau) is an ignorant country woman with some common sense, but not quite as pleasant, while their son, Ambrose (Spec O'Donnell) is quite brutal, especially when he pleasures himself by bullying the sparrows, mainly the defenseless ones, ranging from a stuttering youngster to a lame boy bearing crutches. Throughout the years, SPARROWS has been available in alternate versions, not in terms of length or missing scenes, but in music accompaniment. When the Museum of Modern Art in New York City had a tribute to Mary Pickford in June 1979, the very year of her death, SPARROWS was presented to an attentive audience with a slow pacing piano score, the same print shown in the 1982-83 public television's weekly series of \"Sprockets.\" Distributed on video cassette through various distributors, ranging from those with an organ score by Gaylord Carter, piano or no score at all, Turner Classic Movies shows it on it's own \"Silent Sunday Nights\" equipped with piano score by William Perry from the Paul Killian collection, having the 1970s \"Silent Years\" feel to it. As good as the story goes in regards to sentiment, suspense and limited doses of comedy, SPARROWS leaves some questions unanswered, one in particular regarding the father of Doris Wayne. With the only other female residing in his mansion being a private nurse, whatever became of the mother? Is he divorced or widowed? As for Pickford's character, she comes across as self-confident, religious and never losing her faith, praying to the Good Lord in hope that someday she and the nine other \"sparrows\" will obtain their long awaited freedom. One poignant scene occurs with Molly holding a dead baby in her arms as she envisions Jesus Christ approaching her and taking the infant with Him to Heaven. Of the handful of screen villains at that time, such as Ernest Torrence or Tully Marshall, Von Seyffertitz comes across as very sinister, coming close to the physical resemblance to Max Schreck in the German made NOSFERATU (1922). In spite of a few weaknesses found in the screenplay, it's almost a perfect film. Only debit happens to be humorous scenes that seem to not fit into this atmospheric setting. It's also quite surprising that a movie with a touch of D.W. Griffith to be directed by William Beaudine, better known today more for his low-budget productions in later years. With a majority of silent movies remade during the sound era, it's amazing that as popular as SPARROWS has become, that it wasn't redone. A remake with Anne Shirley as Mollie and Edward Ellis or Arthur Hohl as Grimes might have worked as good casting. However, as remakes go, very few have ever recaptured the success of the original. (***)",
         "I usually ask myself why people want to watch movies filled with suffering. Challenges, yes, agony, no. But where kids are involved I guess I'm a sucker. I have to see it come out all right. Mary Pickford looks almost as young as her character in this gripping film about a group of orphans held as slave labor by a cruel farmer. The story itself is a natural hook. Like many of the works of Charles Dickens, it paints the picture of the innocent suffering at the hands of people who embody every possible vice and who are capable of every imaginable cruelty. One most touching quality of the film is the portrayed ability of Molly, in the face of all she endures, to draw together the group as a family and love each one as a mother should. Self-pity is alien to her. Life is what it is but there's always hope for better and the cruel blows don't change that or make it untrue. I saw that the ending did drag on in the sense that it isn't quite as snappy a resolution as a viewer would want. But I found that after seeing them endure so much, I wanted to see something of their happy ending. I shared in the pain, and wanted to share in the joy as well. And so I feel that it ended rather more like the books it resembles and not like a modern thriller. The boat scenes did go a bit astray, but were mercifully short compared to other parts. A horrifying tale with a surprising note of humor and sweetness that somehow worked, this film is well worth watching.",
         "An introduction explains: \"The Devil's share in the world's creation was a certain swampland, a masterpiece of horror; and the Lord, appreciating a good job, let it stand.\" The Devil's swampland is where Mary Pickford (as Molly) lives, with some orphans and a baby. Ms. Pickford has managed to avoid being thrown in the swamp, over the years, and has assumed the role of \"Mother\" to the young children. They are kept, as \"baby farm\" slaves, by wicked Gustav von Seyffertitz (as Mr. Grimes). Mr. von Seyffertitz, Charlotte Mineau (as Mrs. Grimes) and Spec O'Donnell (as son Ambrose) make a frightfully wicked family. Pickford employs too many of the girlish pouts and lip-twisting grimaces to make this one of her best characterizations; playing \"Molly\" as a young woman of indeterminate age would have been fine (something Pickford would do in her next film, the extraordinary \"My Best Girl\"). Otherwise, the Pickford persona works. As might be expected, the production is first class. Harry Oliver's swampy set is magnificent. The direction of William Beaudine and photography of Charles Rosher, Hal Mohr, and Karl Struss likewise superb. The too long conclusion is noticeably anti-climatic. The special effects and editing are still convincing viewers that Pickford and the children were in some kind of danger during the \"alligator-infested swamp escape\" sequence. In Booten Herndon's \"Mary Pickford and Douglas Fairbanks\" (1977) Mr. Mohr explains, \"There wasn't an alligator within ten miles of Miss Pickford. Do people think we were crazy? I shot that scene myself\u0085 It was hard work for all of us, but the only thing those alligators came close to biting was a chunk of horsemeat.\" Fewer people questioned Pickford's meeting with Jesus Christ, in an earlier scene. ******** Sparrows (5/14/26) William Beaudine ~ Mary Pickford, Gustav von Seyffertitz, Charlotte Mineau, Spec O'Donnell",
         "Excellent popcorn movie that serves as a perfect introduction to silent cinema or to Mary Pickford, who at age 34, and still looking youthful, gives a top-notch performance in her final juvenile role. Pickford stars as Molly, ingenious caregiver to a band of orphans held captive on the bayou farm of evil Mr. Grimes - played with steely menace by Von Seyffertitz. The film's title is a reference to Matthew 6:26, a Bible verse Molly teaches her children when they complain about their situation. The film's religious symbolism goes even further, when one of Molly's youngest dies and Christ appears to carry the child home. Grimes strikes a deal with kidnappers to keep the infant daughter of a wealthy young widower until the ransom money can be collected. He assigns the baby to Molly after the death of her \"sparrow\". When one of the orphans escapes, Grimes plots to dispose of the whole group in the alligator-infested bayou. When Molly learns of Grimes' plan, she plots a daring escape with her band. An all around excellent film, and a strong influence on many kids adventure films such as vastly inferior big-budget blockbusters like Goonies or Spy Kids.",
         "If the only movies directed by William \"One Shot\" Beaudine that you know are THE APE MAN, VOODOO MAN and BILLY THE KID VS. DRACULA you really ought to check out this 1926 thriller. Mary Pickford was one of the founders of United Artists, the first of the independant film studios and she and co-founders D.W. Griffith, Charles Chaplin and Douglas Fairbanks wanted to make movies THEIR way. 34 year old Mary plays 16 year old Molly, a fiesty tomboy who is protector and surrogate mother of a group of orphans on the seedy \"baby farm\" of the evil Mr. Grimes (Gustav von Seyfertitz, possibly the most unlikable villain in silent films). Mary was a deeply religious woman in real life and notice how Jesus puts in a cameo appearance in this film in a heartbreaking scene in which a young infant dies and is taken away to a beautiful pasture. The scene in which Molly and the children finally escape from the farm through a ghastly swamp was photographed by Karl Struss and Charles Rosher, both of whom would later win Oscars for their stylish photography. One scene of them clambering over a rotting tree limb which constantly threatens to drop them all to some eagerly anticipatory crocodiles is still a hair raiser even today. This is not to say that SPARROWS does not have some faults. The ultimate fate of Mr. Grimes is telegraphed far in advance of the actual occurrence and once the danger is over the film continues on with a prolonged motorboat chase and a seemingly interminable dream sequence where Molly envisions life for herself and the children in the future. A little editing would have helped immensely in this case. So is SPARROWS worth seeing? You bet!",
         "Mary Pickford once again shines in this late silent cinematic gem. The somber photography and storyline suggests a strong influence of the then German expressionist movement. A fine production nicely directed by William Beaudine. Still youthful looking, this is I believe Pickfords' last juvenile role and she plays it with that same girlish vitality. One of the finer films of the silent era.",
         "I've blown my nose through many a verifiable 'tear-jerker' but this was my first 'silent' sniffling: \"Sparrows\" (1926) was directed by William Beaudine. Winifred Dunn wrote the story. It was a drama about the very evil Mr. Grimes. He stole and kept poor orphans as \"slave labor\" on his farm. It's location was deep in a swamp in a southern U.S. state (one with alligators). They were used as his work force to keep the farm work done. Young Molly was the oldest and lovingly cared for the children. One day Grimes and his crooked cronies kidnapped the small daughter of a wealthy man. (The word 'wealthy' tells you why.) Molly added little Doris to her heart and care. Then she learned that the police were closing in on finding the baby. Grimes had ordered her thrown into the swamp. The children grouped around Molly to save the little one. There was a daring rescue and escape. Molly took all the children with her through the swamp. (Take about edge of the seat and a box of tissues.) Did they make it out? Was there a happily-ever-after ending? I hope you'll get to find out. (I've seen this on Turner Classic Movies twice. It's wee worth your time.) Cast: Mary Pickford played Molly; Roy Stewart played Dennis Wayne ;Mary Louise Miller was Doris Wayne (the baby); Gustave von Seyffertitz was Mr. Grimes. This was Mary Pickford's last film in which she played a young girl. Her fans had trouble letting her grow into adult parts. Since she was already involved in United Artists (founded with Douglas Fairbanks, D.W. Griffith, and Charles Chaplin) she turned to producing. Although she did try directing once: \"Dorothy Vernon of Haddon Hall\" (1924) \"Make them laugh, make them cry, and back to laughter. What do people want to go to the theatre for? An emotional exercise... I am a servant of the people. I have never forgotten that.\" A Quote from Mary Pickford. \"I don't make jokes. I just watch the government and report the facts.\" Will Rogers"
      ],
      "genres": ["Drama"],
      "productionCompanies": ["Pickford Corporation"],
      "summaries": [
         "Evil Mr.Grimes keeps a rag-tag bunch orphans on his farm deep in a swamp in the US South. He forces them to work in his garden and treats them like slaves. They are watched over by the eldest, Molly. A gang in league with Mr. Grimes kidnaps Doris, the beautiful little daughter of a rich man, and hides her out on Grimes' farm, awaiting ransom. When the police close in, and Mr. Grimes threatens to throw Doris into the bottomless mire, Molly must lead her little flock out through the alligator-infested swamp.",
         "Molly, the eldest child at a baby farm hidden deep in a swamp, must rescue the others when their cruel master decides that one of them will be disposed of."
      ],
      "budget": 463455
   },
   "movielensId": 2957,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1926-05-14",
      "dvdReleaseDate": "1999-10-05",
      "directors": [
         "William Beaudine",
         "Tom McNamara"
      ],
      "runtime": 84,
      "movieId": 2957,
      "title": "Sparrows",
      "mpaa": "",
      "actors": [
         "Mary Pickford",
         "Roy Stewart",
         "Mary Louise Miller",
         "Gustav von Seyffertitz",
         "Charlotte Mineau",
         "Spec O'Donnell",
         "Lloyd Whitlock",
         "Billy Butts",
         "Monty O'Grady",
         "Jack Lavine",
         "Billy 'Red' Jones",
         "Muriel McCormac",
         "Florence Rogan",
         "Mary McLain",
         "Mark Hamilton"
      ],
      "imdbMovieId": "0017423",
      "originalTitle": "Sparrows",
      "genres": ["Drama"],
      "youtubeTrailerIds": [],
      "plotSummary": "Evil Mr.Grimes keeps a rag-tag bunch orphans on his farm deep in a swamp in the US South. He forces them to work in his garden and treats them like slaves. They are watched over by the eldest, Molly. A gang in league with Mr. Grimes kidnaps Doris, the beautiful little daughter of a rich man, and hides her out on Grimes' farm, awaiting ransom. When the police close in, and Mr. Grimes threatens to throw Doris into the bottomless mire, Molly must lead her little flock out through the alligator-infested swamp.",
      "tmdbMovieId": 73575,
      "avgRating": 3.07143,
      "releaseYear": "1926",
      "numRatings": 28,
      "posterPath": "/3ZPfhlwZ9HIYViUCgoZusCszohT.jpg"
   }
}