{
   "tmdb": {
      "original_language": "en",
      "keywords": [],
      "imdb_id": "tt0187712",
      "video": false,
      "title": "Beefcake",
      "recommendations": [
         56310,
         32445,
         9098,
         19555,
         32519,
         35638,
         54934,
         17731,
         51764,
         155556,
         23270,
         239552,
         41156,
         49952,
         34935,
         27440,
         19094,
         34424,
         91873,
         54546
      ],
      "backdrop_path": null,
      "revenue": 0,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 3,
               "character": "Bob Mizer",
               "gender": 2,
               "credit_id": "52fe49e39251416c750d6a3f",
               "name": "Daniel MacIvor",
               "profile_path": null,
               "id": 76627,
               "order": 0
            },
            {
               "cast_id": 4,
               "character": "Delia Mizer",
               "gender": 0,
               "credit_id": "52fe49e39251416c750d6a43",
               "name": "Carroll Godsman",
               "profile_path": null,
               "id": 1013972,
               "order": 1
            },
            {
               "cast_id": 5,
               "character": "Himself",
               "gender": 2,
               "credit_id": "52fe49e39251416c750d6a47",
               "name": "Joe Dallesandro",
               "profile_path": "/lxpfX2F8yBF8rsIGkmWwN04B4qJ.jpg",
               "id": 29915,
               "order": 2
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe49e39251416c750d6a35",
               "name": "Thom Fitzgerald",
               "profile_path": "/4jSyoabB9VsY4LekIItNJZsuCOa.jpg",
               "id": 229519,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe49e39251416c750d6a3b",
               "name": "Thom Fitzgerald",
               "profile_path": "/4jSyoabB9VsY4LekIItNJZsuCOa.jpg",
               "id": 229519,
               "department": "Writing",
               "job": "Writer"
            }
         ]
      },
      "genres": [
         {
            "name": "Drama",
            "id": 18
         },
         {
            "name": "History",
            "id": 36
         },
         {
            "name": "Documentary",
            "id": 99
         }
      ],
      "popularity": 0.495908,
      "production_countries": [],
      "id": 97537,
      "vote_count": 10,
      "budget": 0,
      "overview": "Thom Fitzgerald's (The Hanging Garden) provocative blending of fiction and documentary, tells the story of Bob Mizer, the pioneering founder of the Athletic Model Guild, a company which produced still photographs and short films extolling the beauty and chiseled physiques of men. The fiction story follows photographer and enterprising businessman Mizer, who teamed up with his mother in 1945 to film his beefy star-wannabes around his sun-drenched pool. It is here that Neil, a naive, right-off-the-bus teen is lured into using his handsome looks to become a model. The wide-eyed Neil soon learns about the world of sex and prostitution. But a police raid and ensuing criminal trial soon threaten both of the men's worlds. Interspersed with the story are rare archival footage and interviews with former co-workers, customers and models.",
      "similar": [],
      "original_title": "Beefcake",
      "runtime": 97,
      "poster_path": "/vhASaZKU0mogc3ZEtMvED1DQDIy.jpg",
      "spoken_languages": [{
         "name": "English",
         "iso_639_1": "en"
      }],
      "production_companies": [],
      "release_date": "1998-09-01",
      "vote_average": 4.6,
      "belongs_to_collection": null,
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "Canada",
      "color": "Color",
      "budgetCurrency": null,
      "directors": ["Thom Fitzgerald"],
      "runtime": 97,
      "synopsis": null,
      "writers": ["Thom Fitzgerald"],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0187712/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjEzNDgwNDAxNl5BMl5BanBnXkFtZTcwMTY3ODQyMQ@@._V1_SY317_CR4,0,214,317_AL_.jpg",
      "actors": ["Stars: Daniel MacIvor, Joshua Peace, Jack Griffin Mazeika | See full cast and crew »"],
      "reviews": [
         "I was a male physique model in the 60s in LA and this film brought back so many memories of the time. In those days you weren't totally exposed. Yes, I made centerfold! However, in my frontal shots my hand was casually at the right place although my backside was completely in view. I was an actor, new in town and to earn extra cash I modeled for Young Physique Magazine. I never met Bob Mizer although I certainly heard of AMG then. One of the scenes of this film I enjoyed was interviewing such guys as Joe Dallesandro [of Warhol's FLESH and TRASH]. He still has his looks and sense of humor. Almost making fun of himself. I also enjoyed seeing Jim Lassiter, whom I knew, and Russ Warner. The role of Mizer, played by Daniel MacIvor was well played making him human and at times a bit overbearing. Also liked the acting of Josh Peace [Neil] and Jack Griffin [Red]. They both seemed natural and not uncomfortable with the nudity. But that mother of Mizer was too much. I still have some of the films of those times, including one with Jim Lassiter. The combination of the documentary look and today's look worked. Hat's off to Thom Fitzgerald the writer/director of this flick. I remember when I had stripped all my clothes off, having a certain feeling of control as others watched me strut my wares. You find yourself in a quiet place of feeling your body being in a state all by itself. It was quite thrilling. The shoot was done on a rooftop in Hollywood. I also remember thinking at the time, of those who were watching the shoot from their neighborhood windows. You could clearly see apartment buildings surounding us. I hope they were saying, \"Another star is born\".",
         "The makers of this film set a bit of a challenge for themselves. How to make an interesting movie about the world of magazine photography. The subject in this case is one that hasn't been comprehensively covered before: male physique photography. Generally speaking, in 30s the emphasis was on art, in the 40s on fitness, in the 50s on sensuality, and in the 60s on sexuality. The film explores all aspects of this industry by focusing on a few of the top photographers and their models. Surprisingly, not all participants had the same ideas or experiences about their work, nor the same recollections. In fact, these folk seemed to rather enjoy their work, which did emphasize a healthy, fit body. The relationships of the models emerges as congenial and brotherly, and the photographic activity as engaging. As in any \"entertainment type industry\" there were some over-the-top kibitzing, which in some cases digressed into rather kinky goings on. Still, the makers of this film manage to remain light hearted about most of it, while allowing some top models and fitness stars to share their memories in short commentary episodes. For those who were not into this area, they could simply not buy the magazines nor be concerned about the whole matter. For those who found this an area of interest, they were free to make their own choices. What caused problems were conflict with the law, which itself may be controversial. These clashes are also presented here in enactments. It was interesting to see Joe D'Allesandro, well remembered from some of Andy Warhol's films, being interviewed--and what a candid, down to earth personality he is. The fellows, though, come across as having a good time. While it may not be the most ambitious of professions, modeling at least keeps one off the streets -- that is, almost everyone.",
         "Beefcake is a fascinating docu-drama about a unique chapter in the history of the Gay liberation movement in the United States. It's a pity this film hasn't received a wider distribution here (if any at all). The MPAA guidelines, no doubt, would require quite a bit of editing to get it under the NC17 barrier. But nudity in the film, however, far from creating a salicious aura, actually conveys a sense of innocence and freshness to most of the dramatic scenes. The interview materials, in need of some tighter editing, did drag at times, though they were, for the most part, interesting and informative. This is more than made up for in the dramatic scenes. The actors convey both the excitement of this emerging masculine/Gay \"scene\" and the tragedy of the legal persecution suffered by the people who promoted it. By all means, see this movie if you get a chance. It's well acted (Josh Peace is a stand out), well directed and a fitting chronicle of one part of pre-Stonewall history.",
         "I was curious mostly about this movie. Not being one to pass up on seeing a movie based on information or history I took a chance and watched it on the HERE! network a couple of years ago. It was better than I expected. Ignoring the continuous display of frontal male nudity (which didn't offend me in the least), This film was very informative and entertaining. The interviews opened my eyes to a part of history that I have only read about. It is a pity that this film didn't get more exposure, but I believe that the \"exposure\" on screen would and probably did prevent any real showcasing in worldwide theaters. I think that anyone who likes to know what occurred in the past in regards to pre-stonewall life should watch this film. And if anyone who just wants to see guys in the nude without the sex involved, will like it too. In any case, it's really interesting.",
         "Bob Mizer photographed handsome young men for \"physical culture\" magazines that appealed to gay men when little other literature for them existed. The narrative part of the film about Mizer's life and activities seems two-dimensional in its production and dramatic values--perhaps intentional stylistically. It shows Mizer in his photography studio with his models, whom he found as they literally stepped off the bus from across the country--young men who were new to Los Angeles. In fact, most of the film was shot in a studio in Halifax, Nova Scotia: Canadian sources provided some of the funding. The documentary footage provides interviews with people from the larger California health and fitness culture, like Jack La Lanne, the pioneer health and exercise guru. Born in 1914, he was still active at the time of the film. Along with others, like Joe D'Allesandro, a model and actor (discovered first by Mizer and brought to greater fame by Andy Warhol), the interviews offer an interesting counterpoint to the narrative that seems stronger than the dramatic part of the film. The different segments are linked by a mixed chorus of singers using a style popular in fifties commercials. On a professional level, Mizer was a meticulous artist who took great care with his photography, creating a new genre. Perhaps later films will explore this in depth.",
         "Very entertaining and often funny, this re creation - with selected, astonishing genuine footage - of the AMG he-man 'studio' of the 1950s BEEFCAKE is best seen with a large (gay) crowd in a big cinema. That's how I first saw it and enjoyed the reactions as much as the movie. However the dramatic aspects of BEEFCAKE disappoints or falls short for several reasons: some of the casting is really terrible. Throughout BEEKCAKE, we see genuine footage made in the 50s by Bob Mizer. Parts of the production of these films is dramatized. The actors in these re created scenes are far from physically right. The actor who plays 'Red\" has a podgy body, unlike anyone in the real footage, and this is jarring against the photos and film strips screened. Also, one stupid scene with what is supposed to be \"Ramon Novarro\" with a massive black fake phallus, the old man actor looks like Montgomery Burns from The Simpsons. I cannot fathom the point of having really inappropriate looking actors play parts of well known handsome and athletic men. Even the actor playing Mizer does not look like the real Bob Mizer. BEEFCAKE has some excellent interviews with original AMG talent, especially Joe Dallasandro whose early work is astonishing and humorous. However, the recreated scenes often lurch into territory only seedy gay guys want and it is somewhat alienating from what is basically a fascinating part of Hollywood history. There is actually a good story and better movie unmade (yet) here that is half way successful in this production of BEEFCAKE",
         "This film is about the struggle of gay porn in the 50's USA, in the disguise of \"physique magazines\". It is based on a book of the same name. This film cleverly mixes archive footage with new footage shot for the film. The film flows seamlessly between the past and the present. The interviews with the physique models are very insightful. I am particularly impressed by these interviews, and the effort to hunt these men down. There is a lot of male nudity in the film, and yet it feels fresh and healthy, without a erotic or pornographic feel to it. I also liked the acting, Bob Mizer is portrayed very well in the film. The pleads for understanding and tolerance in the film is also very effective. The sexual controversy is toned down a lot in the film as compared to the book. In addition, the book has more history in it, while the film strips all of these away. That's my only complaint. As one of the models states in the interview, if these events are not written down, they will be lost forever. I am hence very glad that this piece of history is transcribed (albeit dramatised) from the book into a film.",
         "Watching a doco about male physique models whilst eating a bag a chips makes you think twice. That aside, this is a reasonably interesting film that blends original archive footage, interviews and places them along side recreations of events of the AMG Studios, set up by Bob Mizer to capture the male physic. The recreations are okay to a limit, there is too much flipping between black and white and colour and some of the actors playing the models have less than defined bodies which goes against all the images we are bombarded with that show strong ripped muscular bodies. Some of the acting is also heading to Hamsville. There are some clever scenes where they have melded archive footage with new scenes and this works very well. There are some interesting, if brief, interviews with some of the people that came through AMG: models including Joe Dallesandro, as well as other photographers and fans. Then there is a vast array of archive footage of models-and yes there is plenty of flesh on display-and it does have a sense of beauty to it, because despite the obvious homoerotic nature of some of the photos and films made and the fact that these were taken for publications that were really the beginnings of pornography, there is an innocence to some of it and perhaps that was the 40/50/60's backdrop which was an all together different time. The film wins on its old footage and the telling the story of an age gone by, but is let down by trying to have too many ideas at once. Now I have to go do some sit ups. More of my reviews at my site iheartfilms.weebly.com",
         "This is a wonderful mixture of documentary, drama and vintage material, skilfully inter-weaved to tell us the story of AMG studios. It is fascinating to see these physique films recreated before your very eyes and then masterfully inter-cut with the actual vintage material. It is also sad to see the men who appeared in these movies, at the very peak of their physical beauty, interviewed so many years later when it has all but gone. However, their personalities still shine through and all those interviewed remember their experience in this genre fondly. Technically superb, my one and only reservation about this film is that the actors portraying the models are only vague approximations of the real thing. However, Josh Peace gives a thoroughly charming and charismatic performance as Neil E. O'Hara and Jonathan Torrens is excellent as the mightily naughty David. It would be really nice to have a boxed DVD set of these original films, carefully selected, remastered and presented chronologically. They capture a particular moment in time, far removed from the excesses of today, but still carry a hefty erotic charge.",
         "This film is a huge departure from Thom Fitzgerald's first film The Hanging Garden. Beefcake is a loosely woven docu-drama of photgrapher Bob Mizer's Athletic Model Guild. The style of the film will look very familiar to anyone who's seen the NFB's \"Forbidden Love\" where interviews with those who knew Bob are blended with a storyline about a court case involving an alleged prostitution ring. Good use is also made of archival footage from AMG and others. The interviews are quite well done- Joe D'Allesandro and Jack LaLanne in particular but the new footage seemed a little 2 dimensional and predictable."
      ],
      "genres": ["Drama"],
      "productionCompanies": [
         "Alliance Independent Films",
         "Channel Four Films",
         "Emotion Pictures"
      ],
      "summaries": ["This film looks at the 1950's muscle men's magazines and the representative industry that were popular supposedly as health and fitness magazines, but were in reality primarily being purchased by the still underground homosexual community. Chief among the purveyors of this literature was Bob Mizer, who maintained a magazine and developed sexually inexplicit men's films for over 40 years. Aided by his mother, the two maintained a stable of not so innocent studs. At the end, the film moves into a court room drama as Mizer is tried for running a male-prostitute ring in the early 60's. Clips of Mizer's actual films starring individuals, such as Jack LaLanne and Joe Dallesandro, are included."],
      "budget": 0
   },
   "movielensId": 2960,
   "movielens": {
      "languages": ["English"],
      "releaseDate": "1998-09-01",
      "dvdReleaseDate": "2001-01-23",
      "directors": ["Thom Fitzgerald"],
      "runtime": 97,
      "movieId": 2960,
      "title": "Beefcake",
      "mpaa": "",
      "actors": [
         "Daniel MacIvor",
         "Carroll Godsman",
         "Joe Dallesandro"
      ],
      "imdbMovieId": "0187712",
      "originalTitle": "Beefcake",
      "genres": [
         "Drama",
         "History",
         "Documentary"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "Thom Fitzgerald's (The Hanging Garden) provocative blending of fiction and documentary, tells the story of Bob Mizer, the pioneering founder of the Athletic Model Guild, a company which produced still photographs and short films extolling the beauty and chiseled physiques of men. The fiction story follows photographer and enterprising businessman Mizer, who teamed up with his mother in 1945 to film his beefy star-wannabes around his sun-drenched pool. It is here that Neil, a naive, right-off-the-bus teen is lured into using his handsome looks to become a model. The wide-eyed Neil soon learns about the world of sex and prostitution. But a police raid and ensuing criminal trial soon threaten both of the men's worlds. Interspersed with the story are rare archival footage and interviews with former co-workers, customers and models.",
      "tmdbMovieId": 97537,
      "avgRating": 3.03608,
      "releaseYear": "1998",
      "numRatings": 97,
      "posterPath": "/vhASaZKU0mogc3ZEtMvED1DQDIy.jpg"
   }
}