{
   "tmdb": {
      "original_language": "en",
      "keywords": [
         {
            "name": "bible",
            "id": 3036
         },
         {
            "name": "suspense",
            "id": 9937
         },
         {
            "name": "biblical code",
            "id": 10867
         },
         {
            "name": "revelation (book)",
            "id": 10870
         }
      ],
      "imdb_id": "tt0203408",
      "video": false,
      "title": "The Omega Code",
      "recommendations": [
         30379,
         143928,
         68995,
         77073,
         66795,
         179165,
         48833,
         19568,
         36979,
         83105,
         47874,
         41730,
         265037,
         34028,
         153695,
         25646,
         37132,
         80195,
         68212,
         64832
      ],
      "backdrop_path": "/c9So0989uxUYT4M4gl6ZEXYj2Yi.jpg",
      "revenue": 2400000,
      "reviews": [],
      "credits": {
         "cast": [
            {
               "cast_id": 1,
               "character": "Gillen Lane",
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dd91",
               "name": "Casper Van Dien",
               "profile_path": "/ktJIgsilxxQeOvA9I789veHnDnt.jpg",
               "id": 27763,
               "order": 0
            },
            {
               "cast_id": 2,
               "character": "Alexander Stone",
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dd95",
               "name": "Michael York",
               "profile_path": "/hW0uWJtsKWsWAQ9k7EYq9sn5YCH.jpg",
               "id": 13919,
               "order": 1
            },
            {
               "cast_id": 3,
               "character": "Cassandra Barashe",
               "gender": 1,
               "credit_id": "52fe45c4c3a368484e06dd99",
               "name": "Catherine Oxenberg",
               "profile_path": "/1Sevgctbcf0FWN9ADqYTzwitMGe.jpg",
               "id": 69098,
               "order": 2
            },
            {
               "cast_id": 4,
               "character": "Dominic",
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dd9d",
               "name": "Michael Ironside",
               "profile_path": "/i3HkCGEnQGJeD0U8WDumO4VH5fU.jpg",
               "id": 11086,
               "order": 3
            },
            {
               "cast_id": 5,
               "character": "Prophet #1",
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dda1",
               "name": "Jan Tříska",
               "profile_path": "/pg2DHi92xJwJ8KoQq8UfuNkAdtT.jpg",
               "id": 61151,
               "order": 4
            }
         ],
         "crew": [
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dda7",
               "name": "Robert Marcarelli",
               "profile_path": null,
               "id": 102797,
               "department": "Directing",
               "job": "Director"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddad",
               "name": "Matthew Crouch",
               "profile_path": null,
               "id": 102803,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddb3",
               "name": "Lawrence Mortorff",
               "profile_path": "/uTvzRyNxRdGWDmbtW2BxJKs3Nie.jpg",
               "id": 63065,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c4c3a368484e06ddb9",
               "name": "Hollis Barton",
               "profile_path": null,
               "id": 102804,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddbf",
               "name": "Stephan Blinn",
               "profile_path": null,
               "id": 87432,
               "department": "Writing",
               "job": "Writer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddc5",
               "name": "Stephan Blinn",
               "profile_path": null,
               "id": 87432,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddcb",
               "name": "Carlos González",
               "profile_path": null,
               "id": 73001,
               "department": "Crew",
               "job": "Cinematography"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddd1",
               "name": "Harry Manfredini",
               "profile_path": null,
               "id": 20953,
               "department": "Sound",
               "job": "Original Music Composer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06ddd7",
               "name": "Peter Zinner",
               "profile_path": null,
               "id": 3100,
               "department": "Editing",
               "job": "Editor"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dddd",
               "name": "Mark Harper",
               "profile_path": null,
               "id": 102810,
               "department": "Art",
               "job": "Production Design"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dde3",
               "name": "Gary M. Bettman",
               "profile_path": null,
               "id": 102811,
               "department": "Production",
               "job": "Producer"
            },
            {
               "gender": 2,
               "credit_id": "52fe45c4c3a368484e06dde9",
               "name": "Paul Crouch",
               "profile_path": null,
               "id": 102813,
               "department": "Production",
               "job": "Executive Producer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c4c3a368484e06ddef",
               "name": "Jen Tauritz",
               "profile_path": null,
               "id": 102814,
               "department": "Art",
               "job": "Set Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c4c3a368484e06ddf5",
               "name": "David Waelder",
               "profile_path": null,
               "id": 102815,
               "department": "Sound",
               "job": "Sound Designer"
            },
            {
               "gender": 0,
               "credit_id": "52fe45c4c3a368484e06ddfb",
               "name": "David Waelder",
               "profile_path": null,
               "id": 102815,
               "department": "Sound",
               "job": "Sound mixer"
            }
         ]
      },
      "genres": [
         {
            "name": "Horror",
            "id": 27
         },
         {
            "name": "Thriller",
            "id": 53
         }
      ],
      "popularity": 3.07259,
      "production_countries": [],
      "id": 29064,
      "vote_count": 23,
      "budget": 0,
      "overview": "In this spiritual thriller, an ancient prophecy is about to be fulfilled as a secret code brings the world to the edge of Apocalypse. Gillen Lane (Casper Van Dien) is a expert on theology and mythology who has gained international fame as a motivational speaker.",
      "similar": [
         9946,
         615,
         9411,
         5876,
         2502,
         12162,
         13811,
         571,
         1018,
         949,
         10285,
         9741,
         9798,
         189,
         9509,
         793,
         6977,
         1571,
         1813,
         44214
      ],
      "original_title": "The Omega Code",
      "runtime": 100,
      "poster_path": "/pw6IyFeuFXbxKecKq5dX8pB1uxs.jpg",
      "spoken_languages": [
         {
            "name": "English",
            "iso_639_1": "en"
         },
         {
            "name": "Italiano",
            "iso_639_1": "it"
         }
      ],
      "production_companies": [{
         "logo_path": null,
         "name": "Code Productions",
         "id": 4897,
         "origin_country": ""
      }],
      "release_date": "1999-10-15",
      "vote_average": 4.3,
      "belongs_to_collection": {
         "backdrop_path": null,
         "name": "Omega Code Series",
         "id": 122947,
         "poster_path": null
      },
      "tagline": "",
      "adult": false,
      "homepage": null,
      "status": "Released"
   },
   "imdb": {
      "country": "USA",
      "color": "Color",
      "budgetCurrency": "$",
      "directors": ["Robert Marcarelli"],
      "runtime": 100,
      "synopsis": null,
      "writers": [
         "Stephan Blinn",
         "Hollis Barton"
      ],
      "originalLanguage": "English",
      "imdbLink": "http://www.imdb.com/title/tt0203408/",
      "coverLink": "http://ia.media-imdb.com/images/M/MV5BMjA1NjQ5NTI0M15BMl5BanBnXkFtZTcwMzMzNzUxMQ@@._V1_SY317_CR5,0,214,317_AL_.jpg",
      "actors": ["Stars: Casper Van Dien, Michael York, Catherine Oxenberg | See full cast and crew »"],
      "reviews": [
         "I would highly recommend seeing this movie. After viewing it, you will be able to walk out of every other bad movie EVER saying \"at least it wasn't The Omega Code.\" Forget my money, I want my TIME back!",
         "One of the most interesting aspects of this film is how divided people feel about it. Most people either love it or hate it. There is little in between. I fall into the group that loved it. Yes, it's true, Casper Van Dien is a little inconsistent. When he's good, he is very good, but sometimes he is less than adequate. (He is more often good.) Catherine Oxenberg is believable in a fairly standard role. Michael Ironside gives a very nice performance in a difficult role; difficult because his role, Dominic, was not well conceived, but he overcomes this problem beautifully. The casting of Michael York was inspired. His excellent performance as Stone Alexander is very suave, very powerful, very weird. I must also mention Jan Tríska and Gregory Wagrowski as the prophets. Their performances are very subtle and most convincing. Overall, well written, the script and story were well executed. I did have a problem with a couple of unnecessary scenes. There were several lines of dialog that were not believably written, but for the most part the script was sound. One piece of advice - go see this movie with an open mind. This isn't a perfect movie, and if you accept that, you should enjoy it immensely.",
         "I thought this was a good movie. The pace was fast, and rarely did it lag. Michael York was splendidly evil as was Michael Ironside. The lighting was superb, and it was good to see a movie that could contain violence without feeling as if they had to rub my nose in the blood and gore. The most amazing part of this movie was that it was made for $7M. I only wish they would have spent $8-9M so they could have given Cassandra more depth, and perhaps spent more time working on a little more plausible dialog between Gillen and his wife. The wife's lines were the most disappointing part of this film for me. I was left with some questions from a Biblical standpoint, but really, it's just a movie, and doesn't claim to be Revelation on film.",
         "This film is undeniably flawed, but it does contain an intriguing premise and story line. The idea that someone would use the Bible Code to try and conquer the world is an idea that has not been utilized before, at least to my knowledge. The characters definitely could have used some refinement, as they never really are fully developed during the movie. The acting, although not academy award material, was tolerable and did not detract from the story. Overall, this is an interesting film that has good special effects, especially considering the budget it used. Although it has little competition-considering some of the terrible Apocalyptic movies that audiences have been exposed to-this is one of the better end times movies.",
         "Unlike other 'bad movies' like Battlefield Earth or Plan 9 from Outer Space, this mindless piece of propaganda disguised as a film fails to entertain. It's clearly a ham handed attempt to ram an apocalyptic televangelist philosophy down your throat. And you would expect nothing else when you learn it is produced by Matthew Crouch, son of Paul Crouch who is one of the countries leading televangelists and founder of TBN. The plot is lifted directly from the popular Bible Code series of books by Michael Drosnin, although it is dumbed down substantially for the film. Unfortunately, this film lacks the wacky charm and unintentional humor of the Crouch's TBN TV productions such as \"Praise the Lord\". I never expected much from soap actors like Casper Van Dien and Catherine Oxenberg but it is truly sad to see how far Michael York and Michael Ironside have fallen, that they need to appear in mediocre movies such as this.",
         "As a great fan of the \"Left Behind\" series of novels, I found this film to be a great beginning for films with a prophetic backdrop. It is filled with high production values - good camera work and special effects - comparable to what Hollywood studios have to offer. It's not a perfect film. The script and talent can fail so that some of the key moments the producers would like us to fully appreciate don't quite make it for a cynical audience, but that can all be corrected on the next venture. I hope the box office supports their first attempt in this marketplace so that they will produce more -- and I hope I'll get a chance to work on the next one with them. So see it. Buy tickets. Send your friends. thanks,",
         "This film is much better than the severest critics give it credit for. It is not great, but if you allow yourself to ignore the Christian Right agenda, it is a rather entertaining tale. Films have a long tradition of exploiting biblical phenomena, and people have been entertained by such stories for years. The Exorcist, The Omen, and Raiders of the Lost Ark come to mind. Even the use of a crucifix to scare off vampires is well established. I think too many people are hung up by the fact that this film was intended to support a specific agenda -- the Fundamentalist interpretation of biblical prophesy. Casper Van Dien shows occasional glimpses of knowing how to act -- a refreshing change from his previous efforts. The rest of the cast does a decent job for this type of film. Taken as a high tech suspense-thriller it is quite a fascinating yarn. To me, those who rate this movie below \"4\" or above \"8\" are simply not being objective. It probably should be an average of 6.",
         "I bought this movie expecting it to be some corny and cheesy rendition of what might happen in the last days but upon viewing, I was surprised to find that it was very accurate. The story line and plot were really well thought out and planned and the acting was superb.",
         "The Omega Code is a must see! Action packed thriller. Kept me on the edge of my seat. No one left the theatre for popcorn or even a restroom break. I was amazed at how the story just pulled you right in and left you waiting for more. There was applause several times during the movie by fellow movie-goers. Don't look at it as just another religious film. It does follow the Bible pretty true to form. I don't know whether there is a so-called Bible Code but it is just a movie. I would highly recommend it!",
         "Yes I did see The Omega Code, knowing full well that it was probably going to be disappointing, but I was hoping that my preconceived ideas about it would be wrong...they weren't. I am a Christian and I have always thought that if a real \"Hollywood\" type movie could be made about the end times, then it would be very entertaining and very frightening, even if you don't believe the Bible. I still have that belief, but this definitely wasn't the movie that will entertain and frighten people, on the contrary it will make people confused and probably laugh a lot. I know it wasn't a Hollywood movie, but it did cost about 7 million dollars to make, and that is low budget, but I have seen movies that cost less, and were much better. This one had sub par acting, a horrible musical score that sounded like it was done entirely on a keyboard, and a script that seemed like it was done by people who have had little experience with screen writing. It was extremely confusing to me, and I have some knowledge of Revelation and Daniel, so I can imagine how confusing it would be to someone who has little or no experience with those books at all. Obviously too much of the budget was spent on the effects (and they weren't that great), and not on getting good screen writers and good actors. Overall, very disappointing."
      ],
      "genres": [
         "Action",
         "Adventure",
         "Fantasy",
         "Sci-Fi",
         "Thriller"
      ],
      "productionCompanies": [
         "Code Productions",
         "Eclipse Catering",
         "Gener8Xion Entertainment"
      ],
      "summaries": ["Ancient codes hidden within the Torah reveal the secrets of global events, past (i.e., Hitler, the Kennedy assassination, the Gulf War), present, and future. One man (York) is after the Code, seeking the power to change the world as we know it... for the worse. Another (Van Dien) seeks the truth, risking his life and everything he stands for in order to stop him."],
      "budget": 7500000
   },
   "movielensId": 2965,
   "movielens": {
      "languages": [
         "English",
         "Italiano"
      ],
      "releaseDate": "1999-10-15",
      "dvdReleaseDate": "2000-03-28",
      "directors": ["Robert Marcarelli"],
      "runtime": 100,
      "movieId": 2965,
      "title": "The Omega Code",
      "mpaa": "PG-13",
      "actors": [
         "Casper Van Dien",
         "Michael York",
         "Catherine Oxenberg",
         "Michael Ironside",
         "Jan Tříska"
      ],
      "imdbMovieId": "0203408",
      "originalTitle": "The Omega Code",
      "genres": [
         "Horror",
         "Thriller"
      ],
      "youtubeTrailerIds": [],
      "plotSummary": "In this spiritual thriller, an ancient prophecy is about to be fulfilled as a secret code brings the world to the edge of Apocalypse. Gillen Lane (Casper Van Dien) is a expert on theology and mythology who has gained international fame as a motivational speaker.",
      "tmdbMovieId": 29064,
      "avgRating": 2.03007,
      "releaseYear": "1999",
      "numRatings": 449,
      "posterPath": "/pw6IyFeuFXbxKecKq5dX8pB1uxs.jpg"
   }
}